[{"section_title": "LIST OF TABLES", "text": ""}, {"section_title": "[INTRODUCTMN", "text": "The National Center for Education Statistics (NCES) collects statistics on the condition of education in the United States, analyzes and reports the meaning and significance of these statistics, and assists states, local education agencies, and postsecondary institutions in improving their statistical systems. NCES supports a wide range of activities, providing policy-relevant data on issues as diverse as enrollment trends, access of minorities to postsecondary education, the academic achievement of students, comparisons of the United States education system with education systems in other countries, and the effect of education on employment and economic productivity. NCES programs are directed toward: O maintaining and analyzing the following major cross-sectional databases: at the elementary/secondary levelthe Common Core of Data (CCD), the Schools and Staffing Survey (SASS), and the Private School Survey (PSS); and at the postsecondary levelthe Integrated Postsecondary Education Data System (IPEDS), the National Postsecondary Student Aid Study (NPSAS), the National Study of Postsecondary Faculty (NSOPF), and the Survey of Earned Doctorates Awarded in the United States (SED). Together, these studies provide accurate, timely, and relevant data on the condition of American education, as well as how it has changed over time. In addition, NCES conducts a National Household Education Survey (NHES) covering various educational topics such as early childhood and adult education, program participation, educationrelated home activities, and parental involvement in education. conducting surveys and analyzing data from the NCES Longitudinal Studies Programs: at the early childhood levelthe Early Childhood Longitudinal Studies (ECLS) with birth and kindergarten cohorts; at the secondary school levelthe National Longitudinal Study of 1972 (12th-grade cohort) (NLS-72), the High School and Beyond Study of 1980 (10th-and 12th-grade cohorts) (HS&B) and the National Education Longitudinal Study of 1988 (eighth-grade cohort) (NELS); and at the postsecondary levelthe Beginning Postsecondary Students Longitudinal Study (BPS) and Baccalaureate and Beyond Longitudinal Study (BLS), which follow students attending or completing postsecondary institutions. These studies address a variety of important education issues from birth through postsecondary school, including differences in student achievement, effects of financial aid on access to postsecondary education, youth employment, high school dropouts, discipline and order in schools, and the quality of education in public and private schools. conducting the National Assessment of Educational Progress (NAEP), which annually assesses academic achievement at the national level in a number of domains, including reading, mathematics, writing, science, art, history, and geography. The reading and mathematics components of NAEP are administered every 2 years in grades 4, 8, and 12 at the national and state levels. Other components are administered at different times according to budgetary constraints and expressed need. participating in international surveys of educational achievement and programs to develop crossnational education data and indicators such as the Trends in International Mathematics and Science Study (TIMSS), the largest, most comprehensive international study of schools and students ever undertaken. 1 1 administering targeted surveys through the Fast Response Survey System (FRSS) and the Postsecondary Education Quick Information System (PEQIS) that rapidly provide data on current policy issues. collecting and reporting information on libraries through the Public Library Survey (PLS), the Academic Library Survey (ALS), the School Library Media Center Survey, and the State Library Survey (STLA). analyzing and reporting data on vocational education. synthesizing information from various surveys for the following NCES annual publications: Digest of Education Statistics, The Condition of Education, and Projections of Education Statistics. Each chapter in this publication contains a brief introduction; a section on data uses; summaries of the various programs and plans; a list of selected publications, tabulations, and data files; an NCES contact person; and a data collection calendar for that group of programs."}, {"section_title": "What Kind of Data Does NCES Collect?", "text": "NCES collects statistical data on all levels of education from preprimary education through graduate study, including adult education. The surveys address a full range of education issues including: student access, participation, and progress; achievement and attainment of students; organization and management of education institutions; curriculum, climate, and diversity of educational institutions; and financial and human resources of institutions, as well as economic and other outcomes of education. NCES surveys involve a broad spectrum of people and institutions involved in education. The following examples of topics illustrate the scope of the NCES data collection and analysis activities: Adults are asked about their participation in adult education and other learning activities. Parents are surveyed about their participation in their children's education. Teachers are asked to report information about their classes. Libraries report information on usage. NCES data and tabulations are made available at various levels of aggregation, ranging from the institutional to the national level (see table 1). The availability of data at a particular level of education is based on a variety of factors, including survey design and protection of confidential data. The level of aggregation of the data may affect how the data are available, whether in printed copy or only electronically. The aggregation of data required for a particular use can be an important determinant in the selection of the most appropriate survey database. Those who are interested in national-level public school enrollments have a variety of possible sources of information, while those needing enrollments for specific schools have one source. Some sample surveys, such as the NHES, are limited to national-level estimates because of the design of the survey. Data from other surveys, such as the CCD, are published as state-level summaries and district tabulations for large districts. In addition, CCD data files contain school-and school district-level records. Detailed data for individual schools, school districts, and colleges generally are made available only through electronic means because of the volume of the data. Table 1 summarizes the levels at which NCES data are available, either in printed or electronic format."}, {"section_title": "Who Uses NCES Statistics?", "text": "NCES, along with other offices of the Office of Educational Research and Improvement, has developed an information program that provides users of education statistics with access to a wide range of data. Statistical information is provided, in printed and electronic formats, from the Internet, the National Library of Education, and ED Pubs. Education statistics are used for a variety of purposes from research to policy formation. Congress uses data to study education issues, to plan federal education programs, to apportion federal funds among the states, and to serve the needs of constituents. Federal agencies (such as the U.S. Departments of Defense, Labor, and Commerce, and the National Science Foundation) are concerned with the supply of trained manpower coming out of schools and colleges, and also with the subjects that are being taught. State and local officials confront problems of staffing and financing public education. They use NCES statistics in all aspects of policy development and program administration. Educational organizations and professional associations use the data for planning, policy development, and research. The news media (such as national television networks, national news magazines, and many of the nation's leading daily newspapers) frequently use NCES statistics to inform the public about such matters as student achievement, school expenditures per student, and international comparisons. Business organizations use trend data on enrollments and expenditures to forecast the demand for their products. The general public uses education statistics to become more knowledgeable and to make informed decisions about current educational issues. name and year of the data set from which information is to be obtained (e.g., the 1990 wave of NELS:88); specific survey component from which information is to be obtained (e.g., NELS:88 Parent Questionnaire); variables to be analyzed; populations of interest (e.g., public school teachers with 1 year of experience); type of statistical analysis to be performed (e.g., cross-tabulations); and requested medium of final product (e.g., diskette, hard copy, e-mail). Requests for data analysis can be submitted to the NEDRC in three ways: E-mail: nedrc@pcci.com Please call (703-845-3151) if you would like to ask a question about data availability before you submit your written request."}, {"section_title": "NCES CENTER-WIDE PROGRAMS AND SERVICES", "text": "In order to fulfill the National Center for Education Statistics (NCES) mission, \"...to collect, analyze, and disseminate statistics and other information related to education in the United States and in other nations,\" NCES strives to develop high-quality, customer-driven products that are readily available to all education stakeholders. NCES is engaged in a set of agency-wide activities that are intended to help attain these goals. First, with respect to high quality, the reputation of NCES as a statistical agency is dependent on the integrity and the relevance of the information it produces. Second, with respect to customer-driven products, the value of NCES to the education community is contingent upon a full understanding of the data needs and interests of our customers. Third, with respect to availability, the success of NCES in making as much information available as possible hinges upon the effective use of technological advances."}, {"section_title": "Statistics Standards and Technical Review", "text": "The NCES statistical standards provide the guiding principles for data collection, analysis, and reporting of education data. NCES staff and contractors use these standards in an ongoing effort to ensure the development of high-quality education data. From study design to final analysis, NCES products are subjected to a rigorous technical review process that involves statistical and subject-matter experts from NCES and the broader education community."}, {"section_title": "During", "text": "design and data collection, NCES uses a combination of internal work groups, external technical review groups, and contractors to design and collect data to meet the needs of the education community: Data collection and processing frequently involve the collaboration of NCES staff and several contractors configured in a manner designed to ensure checks and balances on quality control. Analyses are conducted only. after analysis plans are developed and reviewed. Finally, the report review process usually involves a series of reviews by subject-matter and technical colleagues, culminating in a formal review by a combination of internal and external reviewers. NCES continually strives to increase the efficiency of the full review process, while at the same time maintaining-high standards. At the present time, work is under way to identify emerging issues and to update the 1992 statistical standards that are currently in use. Over the past several years, NCES has also participated in an agency-wide effort to evaluate existing quality control procedures and to develop and implement new ones."}, {"section_title": "Quality Control and Statistical Standards Review", "text": "In the fall of 1996, the Commissioner convened the Task Force on Quality Systems to study NCES quality control procedures, with the goal of identifying ways to improve the current procedures. The work of this group was one starting point for some of the work involved in revising the NCES Statistical Standards. In addition to this work, NCES initiated agency-wide audits of survey methodology, imputation procedures, and response rates to inform the standards revisions. In the summer of 2000, NCES convened 15 Working Groups that included over one-half of the agency's staff to participate in the standards revision. The Working Groups were coordinated by a Steering Committee that included representation from the Statistical Standards Program and each of the data collection and reporting divisions within NCES. The individual Working Groups met regularly over a 9-month period through the spring of 2001. During that time, an NCES seminar was held to give all NCES staff an opportunity to comment on proposed revisions. Throughout the summer and fall, the Steering Committee reviewed, and in some cases further revised, the drafts. As draft standards were completed, they were shared with NCES Senior Managers for further discussion and comments. During the spring of 2002, the Steering Committee convened a 2-day meeting, followed by a comment period for NCES contractors, to give them an opportunity to review and comment on the NCES draft standards. After responses to those comments were incorporated and reviewed by NCES Senior Managers, the NCES draft standards were posted on the NCES Web Site for a 45-day public comment period, part of an OMB-initiated data quality activity. Comments received during the public comment period have been incorporated by the Steering Committee and reviewed and approved by Senior Managers. Then, in July 2002, NCES submitted draft standards to OMB and to an independent commissioned expert panel convened by the National Institute of Statistical Sciences (NISS). The meeting of this expert panel is set for August 2002. NCES will incorporate comments and suggestions from this group before final review and adoption of the revised standards by Senior Managers."}, {"section_title": "Methodology", "text": "In an effort to document NCES data collection procedures, the Statistical Standards Program sponsored the development of a handbook of NCES data collections. The handbook documents key aspects of the design, collection, and processing of NCES surveys. A related report that summarizes the imputation procedures in NCES data collections is also under development. In a complementary project, the Statistical Standards Program conducted a review of the response rates in each NCES data collection. The results of this review will also be published in an NCES report. Periodically, statistical questions emerge that break new ground for NCES. The Statistical Standards Program consults and advises in these situations, and in some instances a panel of experts is used to consult on or review specific problems. Recent examples of this process include reviews of the issues surrounding the inclusion of students with limited English proficiency and students with disabilities in the National Assessment of Educational Progress (NAEP); of the response probability decision rules that are applied in NCES assessments; and of the NCES policies and procedures for analyzing data with low response rates, and issues concerning the use of adjustments for multiple comparisons. Based on an analysis of inspection reports, program staff developed a set of recommendations for improved quality control and increased customer service. As a result, an automated system was developed for the field inspections. This facilitates immediate corrections of potential security problems and allows NCES staff to monitor licensees more effectively. "}, {"section_title": "Customer Service", "text": "NCES is committed to providing a range of customer-driven products that are tailored to the needs of different members of the education community. In an effort to meet this goal, data are made available in a variety of formatsfrom published statistical compendia and online data tools, to microdata files for secondary analysis. NCES reports range from detailed technical, methodological, and analytic reports that provide an in-depth analysis of a particular topic or issue to Statistical Briefs and Issue Briefs that provide a short, focused analysis of a specific topic. In continuing the effort to make NCES statistics available to a broad audience, NCES launched the Education Statistics Quarterly, a periodical that includes findings from all NCES reports on a quarterly basis. All NCES publications are available online at the NCES Web Site (http://nces.ed.gov). NCES also continues to explore new and innovative ways to use the Internet to make 26 education information available to as many data users as possible. (For more information, please see subsequent NCES \"Technology\" and \"Internet\" descriptions in this chapter.)"}, {"section_title": "Customer Service Survey", "text": "The NCES Commissioner established a Customer Service Team to ensure that sufficient effort is devoted to the continual monitoring of our customers' information needs. As a part of an ongoing effort to better understand the data needs and interests of the education community, this team conducts a customer service survey. The purpose of the survey is to assess customer satisfaction with NCES products and services, and to identify areas that need improvement. The last customer survey was conducted in 2001. The survey's respondents do not include all NCES customers; instead, the survey focuses on specific customer groups. The 2001 survey targeted several large groups of current and potential users: federal, state, and local policymakers; academic researchers, and journalists. The response rate to the 1999 survey was 79 percent. The survey results indicate strong satisfaction with NCES and its products. However, awareness of NCES varies considerably between respondent groups and products. NCES customers use data for many purposes. Three main uses cited in the survey were general information, research and analysis, and planning. The data also suggested that the more experienced the user, the higher the level of satisfaction. The survey also indicated less satisfaction with the timeliness of NCES publications and data files, and the need for NCES to increase awareness of agency products and services. These are areas that NCES managers are seeking to improve."}, {"section_title": "Outreach Partnerships", "text": "In an effort to improve dissemination and increase the use of NCES education statistics, NCES has developed \"partnerships\" with external organizations whose members are either interested in education data or could become potential users. With NCES acting as a data \"broker,\" these new collaborative relationships provide an excellent means for expanding the NCES customer base and learning more about the needs of specific data users. And by making use of existing communication channels in other organizations, NCES is also able to make contact with potential customers. Collaborative activities include providing information on NCES products in association newsletters and online services; developing links to Web sites; providing training on NCES databases and other activities; developing individual workshops for specific data users; and identifying and assessing data needs. This twoway interaction with outside networks increases the utility of NCES products and services by more accurately reflecting the needs of various constituencies."}, {"section_title": "Practitioners' Web Page", "text": "Through focus groups and customer surveys, NCES has determined that local education practitioners (e.g., educators, administrators, counselors, librarians, and parents) are not adequately aware of NCES products and services. As a result, NCES developed a Web page targeted to the data needs of these groups. This new online service, called \"The K-12 Practitioners' Circle\" (http://nces.ed.gov/practitioners), presents education data in a user-friendly manner and links to a wide range of NCES publications and other relevant resources. In addition to alerting users to NCES findings on both continuing and emerging education issues, it provides information on relevant research studies and other practical resource materials that local practitioners would find useful. The new Web page will be updated regularly to respond to pressing education issues, and NCES will be encouraging feedback from its users."}, {"section_title": "Training", "text": "One way of ensuring that NCES staff members maintain state-of-the-art skills is through in-house training seminars on new and emerging statistical techniques and practices. The NCES training program director plans and coordinates these seminars on an as-needed basis. For example, over the past few years, seminars have been held on such topics as variance estimation; imputation of missing data; statistical significance testing; multiple regression analysis; logistic regression analysis; path analysis; hierarchical linear modeling; and special software, such as SUDAAN and Wesvar PC-computer programs, for handling survey data from complex sample designs. The seminars also cover such topics as contract management and emerging educational priorities, issues, and policies. Although these seminars are tailored to the needs of NCES staff, they are open to the general public. Any interested staff members from other government agencies, professional associations, private companies, or other organizations may attend. NCES also offers training seminars for external data users to promote and facilitate the effective use of NCES databases, such as the Early Childhood Longitudinal Study-Kindergarten Cohort, the National Education Longitudinal Study of 1988, the National Household Education Survey, the Schools and Staffing Survey, the Third International Mathematics and Science Study, NAEP, the National Postsecondary Student Aid Study, the National Study of Postsecondary Faculty, and the Integrated Postsecondary Education Data System (IPEDS). These data users include faculty members and graduate students in higher education institutions, as well as researchers and data analysts at state and local education agencies, professional associations, and other federal agencies. Seminars are usually offered each summer and are about 4 to 5 days long. During these seminars, participants learn how to access and analyze NCES data. Participants also review certain statistical topics such as sample design, variance estimation, imputation, and sampling weights. To participate in these seminars, browse the NCES Web Site (http://nces.ed.gov/conferences) for seminar announcements and specifications for applying. Instructors for both in-house and external-data-users seminars are usually NCES staff members who have extensive knowledge and experience in the given subject matter. Sometimes nationally known experts in pertinent fields are invited to give lectures. An announcement for each seminar is located on the NCES Web Site (http://nces.ed.gov/conferences). "}, {"section_title": "Technology", "text": "Technological advances have allowed NCES to improve both its internal activities and its ability to provide the public with useful education statistics. NCES staff can conduct their work within the Center more efficiently and effectively, and the Center can collect, analyze, and disseminate more education data than ever before in a more flexible and easily accessible fashion. Programs and individual projects are designed to be consistent with an overall vision of expanding access to NCES data. Advances in computer and telecommunication technologies are making it easier for all members of the educational communitylearners, parents, teachers, and administrators, as well as observers and policymakersto come directly to NCES for information. Technology tools being developed by NCES are beginning to reduce the burdens of data collection, enhance accuracy and timeliness of analysis, and increase the ease of access to education statistics. A variety of plans are being implemented to fully incorporate current and emerging technologies into the NCES working environment, and to provide both internal and external customers with timely education statistics in useful formats. Internal activities include acquiring and supporting up-to-date desktop hardware and software to facilitate statistical analyses, developing integrated software solutions for program management, and leveraging local-and wide -area network resources to share information. NCES currently provides access to its databases through several mechanisms. These include the dissemination of data via CD-ROMs, and most importantly through the NCES Web Site. Current activities to enhance electronic access to NCES data include: dissemination of products and services via the Internet; improved data administration and development of a central, comprehensive database; development and support of improved CD-ROM products for NCES databases; fostering increased capabilities of data suppliers and users to submit and retrieve NCES data electronically through the Internet; and expanding customer options for retrieving timely education data."}, {"section_title": "Internet", "text": "An essential component of the NCES Technology Program is the NCES Web Site (http://nces.ed.gov). The site contains an enormous amount of easily accessible education-related information, including research reports, data access tools, and raw data. It also provides links to additional information at the U.S. Department of Education Web Site (http://www.ed.gov), as well as assistance in obtaining CD-ROMs of restricted-use data and survey data sets too large to download from the Internet. The Web Site is the largest and most visible dissemination platform of NCES. Since the site's inception in May 1996, it has grown to include over 30,000 pages, in addition to providing many online data access capabilities. Current usage statistics indicate that approximately 1,000,000 user sessions and over 4,000,000 page views take place on a monthly basis. NCES has a full-time Webmaster and a Web team consisting of liaisons from all divisions and the Commissioner's office. The Web Site has beck n. primary mode of communication for NCES and its varied constituencies. Features of the NCES Web Site include: a complete catalog (over 1,900 products) of NCES publications and data products with customized search capabilities, including searches by title, author, subject, survey or program area, and other criteria, at http://nces.ed.gov/pubsearch; product information pages containing brief descriptions, links to accessible formats of the desired products, ordering assistance, and other useful information; a staff directory, searchable by subject, topic specialty, or name; the Student's Classroom for school-age visitors, with \"find your school, library, or college\" features, quizzes, games, easy-to-use graphing and probability functions, and many more engaging and educational activities, at http://nces.ed.gov/nceskids; daily \"Did You Know\" education facts displayed on the site's home page; statistical tables and education indicators for quick answers to inquiries; the most recent data sets for downloading and analysis; descriptions of NCES programs (http://nces.ed.gov/surveys), including separate Web sites for all surveys and program areas; a national locator (http://nces.ed.gov/globallocator) for searches of public schools, private schools, public libraries, and postsecondary institutions; and a \"Newsflash\" subscription service, organized by relevant topical areas of education research, about breaking NCES news (http://nces.ed.gov/newsflash). A powerful function of the NCES Web Site is its ability to provide rich, flexible data access tools. NCES has developed searchable databases to facilitate the location of educational institutions and their characteristics. One example of a data access tool available through the site is the National Public School Locator (http://nces.ed.gov/ccd/schoolsearch). This feature allows customers to locate a school based on name, location, state, or other similar variables. The National Public School Locator includes statistics on individual school characteristics, such as teacher counts, number of students, student/teacher ratio, and school enrollment by race/ethnicity. Another popular search tool is College Opportunities Online (http://nces.ed.gov/ipeds/cool), an extensive searchable database of up-to-date information on over 9,000 U.S. colleges, universities, and technical institutions. Information featured in this program includes attendance charges and programs offered. Newer and more sophisticated data access tools recently made available through the NCES Web Site provide users opportunities to manipulate data in increasingly more informative ways. Peer comparison tools allow users to compare the various libraries, school districts, and postsecondary institutions located throughout the United States. Using an advanced mapping application, the School District Demographics tool allows users to view census data in a more informative and intuitive manner. The Data Analysis System allow users to perform useful analyses online without having to download and format raw data, and the Quick Figures and Tables function provides previously analyzed data in table and figure formats to provide quick answers to topical research questions. A complete listing of NCES data access tools is available at http://nces.ed.gov/pubsearch/onlinedata.asp. In the future, NCES will continue to enhance the utility of the Web site by expanding the amount of material available and implementing more interactive capabilities within its databases. Also, users' ability to answer their questions more quickly will be improved by enhancing the site-wide search function. This will be accomplished by fine-tuning the site's indices, subject categorizations, and database search utilities. All future development of the NCES Web Site will be guided by a recently conducted usability study. This study identified necessary improvements to the site, as well as obstacles that will likely be encountered in the implementation of these improvements. For more information on the NCES Web Site, contact: "}, {"section_title": "Internet Data Collection Operations", "text": "NCES has been developing Web-based systems for the design and administration of survey data collections for over 5 years. Web-based surveys offer many advantages over other forms of data collection and analysis. They save time and money by reducing the amount of mailing, programming, data entry and cleaning, and preparation for analysis. They also provide more flexibility for researchers working with the data and respondents filling out the forms. Overall, Web-based surveys increase the timeliness and quality of data while minimizing respondent burden. NCES first used the Internet in this manner for data submissions in universe collections in the mid-1990s. Next, the Center developed an online system to collect survey data from sampled institutions. The 1999 pilot of this system in the Institutional Prices and Student Financial Aid survey was successful, leading to its implementation in collections of data in the administration of three other surveys: Integrated Postsecondary Education Data System, State Library Agencies, and Academic Library Survey. This NCES-pioneered system is also being appropriated by the Department of Education's Office of Postsecondary Education to conduct the Campus Crime and Security at Postsecondary Institutions Survey. After these successes, NCES broke new territory in education data collection by applying data encryption methods so that it was possible to securely collect confidential survey data not just from institutions, but also from individual survey respondents. This secure data collection system will be implemented beginning with the administration of the longitudinal Baccalaureate and Beyond (B&B) survey. In 2001, NCES began creating an interactive interface for the administration of the system that allows statisticians to maintain surveys without programmer support. These online survey collection initiatives will create uniformity and consistency across NCES surveys and help provide a foundation for an NCES comprehensive, integrated database. NCES is also developing an Electronic Data Interchange (EDI) system that will allow various institutions to collect and share data. The Center's first step in this area is a collaborative pilot project with four states to develop Extensible Markup Language (XML) technology for use in the collection of data from the universe of U.S. public elementary and secondary schools. NCES is also collaborating with the Planning and Performance Management Service in the Office of the Deputy Secretary of the Department of Education to evaluate the use of XML technology in support of the Performance-Based Data Base Management initiative. This technology is expected to form the foundation of the next generation of interactive data exchange. Eventually, schools and local and state education agencies will be able to use this XML technology to collect and share education-related and administrative data."}, {"section_title": "Building a Comprehensive, Integrated NCES Database", "text": "The concept of providing an integrated collection of related data from multiple sources in order to respond to complex inquiries has been around for some time. Integrating scattered resources into a central database is the next logical step in the expansion of automated information systems, enabling much more powerful and flexible analysis. With education statistics, analyses have often been constructed with specific survey data. Cross-survey or time-trend analyses frequently required long and expansive data massaging and custom analysis. A centralized database of education information will provide a rich, yet convenient resource for in-depth research. It will also provide a mechanism to respond to simple, but specific queries, such as: \"How do enrollment changes in my school district compare with those in other similar districts in another state?\" The objective is to build a new education information source within the Web site that will provide integrated access to survey and linked survey data, metadata, survey instruments and documentation, and ultimately reports and other published analysis. The database will be distinguished from existing NCES products in three respects: it will be exclusively Internet based; it will contain a growing repository of linked data from different surveys; and it will feature tools that will enable customers to easily find, extract, and analyze NCES data directly. The centralized NCES database will be designed to expand and improve as more data are uploaded and Internet tools become more powerful. From a customer perspective, the major benefit of the database will be more extensive Internet access to NCES survey data and documentation."}, {"section_title": "Technology Research", "text": "In addition to incorporating current technologies into its programs and operations, NCES helps sponsor a broad agenda to extend technological capabilities. This is a complimentary effort in support of the National Science Foundation's \"Digital Government Initiative.\" NCES is currently working on three research topics: the use of advanced database technologies to support statistical functions, such as standard error calculations for complex sample survey data; the development of clustered index algorithms for spatial databases; and the development of statistical analysis techniques for time-event indexed video databases. "}, {"section_title": "NCES Data Archive", "text": "NCES sponsors the International Archive of Education Data at the Inter-University Consortium for Political and Social Research (ICPSR), University of Michigan, to archive NCES databases. This archive includes a vast range of national and international data on education collected primarily by NCES from the 1960s to the present. These databases are available at no charge in ASCII flat file format that can be used with statistical processing software such as SAS and SPSS. The goal of the archive is to share information about education with researchers, academics, policymakers, service providers, and other customers. NCES currently maintains over 500 national data collections relating to education. The data are collected from elementary and secondary schools, colleges, and universities, as well as from elementary, secondary, and postsecondary students and teachers. Each data collection contains an abstract, a codebook, and one or more data files for research use. No statistical tables or printed reports are included. This archive makes this wealth of data publicly available and readily accessible. Additional NCES databases, both new and old, will be routinely added to the archive. This archiving project will preserve and enrich the research resources of NCES, as well as produce an archive of data sets that can be used effectively in the era of the Internet. It will also significantly enhance documentation of NCES data to make them more user friendly. The publicly available data can be accessed and downloaded directly from the ICPSR Web Site ( http : / /www.icpsr.umich.edu /IAED /). "}, {"section_title": "ELEMENTARY AND SECONDARY EDUCATION", "text": "The National Center for Education Statistics (NCES) program at the elementary and secondary level provides information on the condition of public and private education. Data collections include information on today's important issues, such as equity between schools and school districts, access to preschool programs, student trends, persistence, and the climate in our schools and classrooms. Other important issues addressed are school finance, school safety, teacher qualifications, school reform, teacher professional development, and the education of special needs populations. The core program includes national, state, and local data collection systems on public elementary and secondary education (i.e., the Common Core of Data (CCD) Survey). Important additions to the NCES data collection programs in the last decade include the Schools and Staffing Survey (SASS), the Private School Universe Survey (PSS), and the National Household Education Survey (NHES). These surveys, along with the Early Childhood Longitudinal Study, National Education Longitudinal Study of 1988, the National Longitudinal Study of 1972, High School andBeyond, the National Assessment of Educational Progress, and the Third International Mathematics and Science Study, supply a wealth of information about elementary and secondary education in the nation."}, {"section_title": "Data Uses", "text": "The statistics collected from state education agencies, other elementary/secondary institutions, staff, and students are used extensively by people outside of NCES. They are used for testimony before congressional committees, planning in various federal executive departments, and projects developed by professional organizations. They are used by state executive and legislative staff, state and local education agencies, and associations of local school systems. Other users are colleges, universities, education research facilities, businesses that work with educational institutions, and the media (for reporting on educational issues and events). Federal, state, and local governments make numerous requests for data. For example, representatives often request data on the demographic characteristics of school districts in their states; federal agencies request data on numbers of teachers and pupils by school level and type; state governments request data on high school dropouts and teacher attrition rates; and local governments request analyses of teacher demographics. In addition to federal, state, and local governmental requests for elementary and secondary information, foreign governments also request data on trends in American public schools. The media often need a great deal of data on elementary and secondary education for their reporting. For example, the media has used analyses of first-time teachers in the United States, characteristics of public schools, dropout rates, test scores, and urban school trends in their reporting. Colleges and universities request CD-ROMs of all of the elementary and secondary surveys. Some items of interest for college researchers have been teacher qualifications in mathematics and science, poverty status of schools and school districts, free-lunch eligibility of students, dropout rates and high school completions, class size, crime and violence, and persistence and attainment. Business organizations, including marketing and survey firms, use demographic profiles of schools and districts in their research. Also, parents use data on elementary and secondary schools and school districts (such as per pupil expenditures and class size) when they are in the process of moving their families to a new location.\nThe NCES postsecondary education data systems provide information such as trends in enrollment and degree completion, patterns of expenditures and revenues of institutions, patterns of student financial aid, workload of faculty, and the relationship between educational experience and labor market outcomes. These data are used to describe the condition of postsecondary education and to monitor changes. Federal program staff have used IPEDS and student survey data to address policy issues on financial aid programs. Policymakers at the state and institutional levels have used IPEDS data for planning purposes. Government commissions have used these data to monitor compliance with federal legislation. Thousands of requests for information based on IPEDS and other postsecondary programs are received by NCES each year. Those requesting data fall roughly into the following seven categories: Members of the executive branch, Congress and congressional committees, and a number of independent federal agencies use information from NCES on a regular basis. For example, an office of the legislative branch used IPEDS information to develop a profile of for-profit, less-than-2-year institutions. Several executive branch offices use the information to track baccalaureate and higher degree data by selected fields of study and minority status of degree recipients. An independent federal agency uses the information to track degree completions in engineering and scientific fields of study. State higher education agencies regularly use the data to help determine salary and fringe-benefit packages for their full-time instructional faculty. Other state agencies use the completions and institutional data on an annual basis to evaluate the availability of specific career training programs. Several state agencies have used the residence and migration data to determine where their high school graduates enroll in postsecondary education institutions. National and regional education associations annually request tabulations to determine enrollment patterns by racial/ethnic categories and fields of study, and finance data to review the economic health of postsecondary education institutions. Individual institutions use similar information at an institutional level for peer analyses and institutional planning purposes. These peer analyses range from comparing selected financial ratios to comparing proportions of minority student enrollments. The media, business community, and general public use postsecondary data in a variety of ways. For example, one newspaper developed a major article comparing public 4-year institutions across selected states. Members of the business community have used degree completion data to target minority recruitment efforts in selected fields of study. The general public regularly requests information on which institutions offer degrees in specific fields of study and the new IPEDS College Opportunities On-Line (IPEDS COOL) is used regularly by students, parents, and guidance counselors to help prospective college applicants choose the right institution. Congress, states, colleges, higher education associations, and other researchers use the data to describe students and faculty, financial aid programs, persistence and completion, and outcomes after completion.\nThe NLS-72 data have been widely used for investigating educational policy issues. For example, in the early 1980s, a congressional committee turned to these data to develop a model for estimating the costs of tuition tax credits. Capsule descriptions of this cohort have been produced and attrition rates from college 91 13 have been studied, as have transitions from high school and college into the workplace. Postsecondary attainment, access, and financial aid studies have all used NLS-72. The enlarged scope of HS&B provided even more data than NLS-72 for examining a wide variety of education policy issues. Like NLS-72, HS&B yielded a number of capsule descriptions of high school students. Additionally, HS&B data have been used to study the achievement of Hispanic students; discipline and order in high schools; economic issues, such as students working while in school; comparisons of public and private schools; the continuity of early employment of high school sophomores; and course-taking patterns of American high school students. Because similar items were used in HS&B, NELS:88, and NLS-72, it is possible to compare the high school seniors of 1980, 1982, and 1992, with those of 1972. The National Assessment of Vocational Education (NAVE) used the data from the HS&B study in several of their reports. For example, NAVE used HS&B data for studies that attempted to measure high school curricular experiences as they relate to vocational education and course enrollment patterns, and student financial aid as it relates to postsecondary vocational education. NELS:88 completed the fourth follow-up data collection in 2000. Data from this survey are being used to study transition patterns of eighth-grade students as they move through school (e.g., moving from public to private school, dropping out of school, and moving into and out of high school and college). Other research issues that can be addressed include: students' academic growth over time and the family, community, and classroom factors that promote or inhibit such growth; the tracking of course-taking patterns during high school; the educational outcomes and generational status among Asian and Hispanic eighth-graders; at-risk students' successful navigation of the pipeline to college enrollment and the process of dropping out of school; the role of the school in helping the disadvantaged; the school experiences and academic performance of language minority students; the process of attracting students to the study of mathematics and science; the transition to postsecondary education and the workforce; students' employment and postsecondary persistence histories; family formation, including marital status and children; and trend analyses with previous longitudinal studies. The ECLS-K and ECLS-B focus on the early childhood years and the influence of the home, classroom, school, and child care on children's development. To date, the ECLS-K has completed a baseline and four follow-up data collections. The ECLS-B started collecting data on its sample of children as they turned 9 months old. ECLS-K data have been used to produce descriptions of kindergartners as they enter school for the first time and describe their achievement gains in kindergarten and first grade. Data from this study are being used to examine the differences in children (e.g., their backgrounds, skills, and knowledge) at school entry and to describe teacher, classroom, and school characteristics. The research issues being addressed by these two studies fall into four broad areas: children's growth and development in critical cognitive and noncognitive domains; children's transitions to child care and education programs, kindergarten, and beyond; 92 t 1 01 school readiness; and the relationship between early experiences and later school performance. BPS studies have provided new information on traditional as well as nontraditional entrants to postsecondary education. This has included such topics as high school preparation and persistence, differences in receipt and use of financial aid, patterns of transfer and completion, family difficulties and formation, education debt, and posteducation employment. The complementary B&B study has provided information on bachelor's degree graduates. This has included such topics as entry into and progress through graduate school, employment after completion, family formation, methods of financing graduate education, both undergraduate and graduate debt, and the resulting education debt burden. In addition, B&B has a special component concerning those entering the elementary /secondary teacher pipeline, and has begun tracking entry into and exit from the pipeline as well as career paths among teachers.\nNCES receives many requests for information about education in other countries, such as school achievement levels, school completion rates, school expenditure levels, and higher education enrollment rates. Policymakers, such as chief state school officers, governors, and local school officials, also want to know the average level of achievement in various subject matters in other countries. Most requests are for data concerning highly developed countries (e.g., Australia, Canada, England, France, Germany, and Japan). This particular concern relates to maintaining a leading position in the world economy. However, interest 'rm 118 130 goes beyond how well the education systems do in preparing youth for the labor force, to questions of civic engagement and further participation in education. NCES also provides international data on instructional practices. These data are gathered through two vehicles: survey data gathered at the same time assessment data are collected and videotape data. Both vehicles allow researchers to examine and illustrate instructional practices around the world. Data from these international activities appear prominently in numerous publications produced not only in the United States, but also by international organizations. For example, the OECD publication, Education at a Glance, relies heavily on data gathered through NCES. United Nations Educational, Scientific, and Cultural Organization (UNESCO) reports on literacy have begun to follow the conventions developed by the International Adult Literacy Study, which NCES helped to underwrite.\nDescriptive information provided by the library surveys includes staffing levels and size and content of the collections in libraries, populations served by the libraries, the number of items per year that libraries circulate, library expenditures, and the extent of library services. The four library surveys provide the only current, national, and descriptive data on the status of libraries. They are used by professional associations, local practitioners, and federal, state, and local officials for planning, evaluation, and policymaking. These data are also available to researchers and educators to analyze the state of the art of librarianship and to improve its practice. Except for the School Library-Media Centers Survey, each of the library surveys is a census. Because the respondents include all known libraries of that type, the resulting data files can be used to develop frames for samples surveys by NCES, other agencies, or researchers. In addition to the periodic surveys of libraries, NCES has conducted some sample surveys related to public librariesboth to assess the feasibility of incorporating certain items into its universe surveys and to obtain information that addresses more specific issues. For example, in 1993, NCES conducted a survey of public library services to children and young adults using the Fast Response Survey System (FRSS). Several items on the extent of children's services were added to the Public Libraries Survey in 1995 based on the results of this FRSS survey. NCES also collected information from households about frequency of use and the purposes for which households use public libraries through the National Household Education Survey in 1996. NCES plans to update these data and add some additional survey questions in fall 2002 as part of a supplement to the current population survey. This usage information can be extremely helpful for policymakers setting priorities for libraries in relation to demands for other public services. Having additional information on how individuals actually use libraries provides practitioners important insights on ways to serve their customers better. format, access to electronic services, access to the Internet, number of Internet terminals used by the general public, number of Internet terminals used by staff only, and number of users of electronic resources in a typical week. A question\"Does this public library meet all the criteria of the FSCS public library definition?\"has also been added. Data about Public Library Service OutletsIncludes number and types of outlets, the location of public library service outlets relative to a metropolitan area, number of books-by-mail outlets, number of bookmobiles by bookmobile outlet, and square footage of the outlet. Web data search toolsThe Public Library Locator tool (http://nces.ed.gov/surveys/libraries/liblocator) is available on the Library Statistics Program Web Site. This tool enables users to locate the most recently available data about a library or a public library service outlet in instances where they know some but not all the identifying information about the library. For example, if one knows the city the library is in, but not its name, one will still be able to locate the library and obtain most of the available FSCS data about it, including identifying information, organizational characteristics, services, staffing, size of collection, and income and expenditures. The Library Statistics Program has also released a Web-based peer comparison tool on the Library Statistics Program Web Site (http://nces.ed.gov/surveys/libraries/publicpeer). Using this tool, a customer can first select a library of interest. Next, the user can search for a peer group by selecting key characteristics to define the library, such as total operating expenditures, circulation per capita, etc. Finally, the user can view customized reports comparing the library of interest and its peers. These reports include bar charts, pie charts, rankings, data reports, and address/telephone reports. In addition, one can view FSCS data for individual public libraries.   1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 Public"}, {"section_title": "Studies", "text": "\n\nEarly Childhood L ngitu LSE s NCES and several federal health, education, and human services agencies are sponsoring an ambitious program to provide comprehensive and reliable data sets that can be used to inform policy regarding children, their families, early care, and education. The data collected by the ECLS program, and the information that is disseminated through reports prepared by NCES and others will inform decisionmakers, educational practitioners, researchers, and parents about the experience of young children. The ECLS program consists of two cohort studiesa birth cohort study and a kindergarten cohort study. Together, these studies provide the range and breadth of data required to describe more fully children's early learning and education experiences. The birth cohort study (ECLS-B) is designed to study children's early learning and development from birth through first grade. It focuses on those characteristics of children, their families, and out-of-home experiences that influence children's first experiences with the demands of formal school (i.e., kindergarten and first grade), and provides important information about the way America raises, nurtures, cares for, and prepares its children for school. The kindergarten cohort (ECLS-K) measures aspects of children's development and their home, classroom, and school environments as they enter school for the first time, and examines how factors from these environments influence their academic achievement, social development, and school experiences through fifth grade."}, {"section_title": "Common Core of Data", "text": "The Common Core of Data (CCD) is the primary NCES database on public elementary and secondary education in the United States. The annual CCD is a comprehensive national statistical database of all public elementary and secondary schools and school districts that contains comparable data across all states. The objectives of the CCD are twofold. First, it is designed to provide an official listing of all public elementary and secondary schools and school districts in the nation that can be used to select samples for other NCES surveys, and to provide directory information for a variety of users. Second, the CCD provides basic information and descriptive statistics on public elementary and secondary schools, students, and staff. The data sets within the CCD can be used separately or linked with one another to provide information on many topics of interest. For example, they can be used to analyze differences in expenditures for education across large and small, or urban, suburban, and rural school districts. The CCD can be used to produce dropout rates for different types of school districts and track changes over time. It also can be used to measure changes in the racial/ethnic distribution of students in public schools. The school universe allows users to look at characteristics, such as pupil/teacher ratios at various instructional levels, or to use the addresses in the school locator to request records for transferring students. All of this information can be found on the CCD Web Site (http://nces.ed.gov/ccd). In addition, an annually produced CD-ROM links all of the CCD data, fiscal and nonfiscal, with school district-level data from the 1990 Decennial Census in an easy-to-use format. (Census 2000 data will be added in 2003.) The CCD is an important resource for policymakers at the state and local levels. The CCD provides basic statistics on schools, school districts, and states. Some examples of descriptive statistics available from CCD are student enrollment by race/ethnicity, the number and types of schools, revenues and expenditures of school districts, and the number of high school completers and dropouts."}, {"section_title": "Design", "text": "The CCD survey collects data on all public elementary and secondary schools, local education agencies, and state education agencies throughout the United States. The CCD contains three categories of information: general descriptive information on schools and school districts, data on students and staff, and fiscal data. The general descriptive information includes school and district name, address, phone number, and type of locale (e.g., rural or urban), as well as some information about the type of school (e.g., magnet, charter) or district (e.g., regular, state operated). The data on students include demographic, enrollment, and outcome characteristics. The numbers and types of education staff are reported as well. The fiscal data cover revenues and expenditures by object and function. The CCD is made up of six surveys sent to state education departments. Most of the data are obtained from administrative records maintained by state education departments. Statistical information is collected annually from public elementary and secondary schools (approximately 95,000), public school districts \nThe sample design for SASS is a stratified probability sample in which schools are selected first; then within schools, the principal and a sample of teachers are surveyed. The SASS sample has been designed to support the following types of estimates and comparisons: national and state estimates for public schools, teachers, and districts; national estimates for private schools and teachers by religious affiliation or type of school; national data on BIA schools; national data on public charter schools; and national comparisons of elementary, secondary, and combined schools and teachers. The teacher sample also supports comparisons of new versus experienced teachers, teachers by teaching assignment field, and many other characteristics of teachers. For the 1999-2000 administration of SASS, one major new component was added to the survey. SASS covered the entire population of public charter schools in the United States, as well as their principals, as of the 1998-99 school year. In addition, in the same manner as for regular public and private schools, a sample of teachers within each charter school was surveyed. Components from the 1993-94 SASS, the public and private school library media center components, were continued in the 1999-2000 administration, as well as the BIA school component and an oversample of schools in which American Indian students comprise 20 percent or more of the school's total enrollment.\nTwo questionnaires comprise the TFS: The Teacher Follow-up Survey Questionnaire for Former Teachers and the Teacher Follow-up Survey Questionnaire for Current Teachers (those who remained in the same school as well as those who moved to another school). These questionnaires ask teachers about their current status, occupational changes and plans, reasons for staying in (or leaving) teaching, and attitudes about the teaching profession. The first administration of the TFS was in the 1988-89 school year with a sample from the 1987-88 SASS of about 2,500 teachers who had left teaching and 5,000 who were still in teaching. The size of the sample is approximately the same for every cycle of the TFS. There have been three more administrations of the TFS, 1991TFS, -92, 1994TFS, -95, and 2000. Each collection of the TFS is a follow-up to the SASS sample of the previous year.\nThe target population for the universe survey consists of all private schools in the 50 states and the District of Columbia that meet the NCES criteria of a school (i.e., a private school is an institution that provides instruction for any of grades K through 12, has one or more teachers to give instruction, is not administered by a public agency, and is not operated in a private home. Organizations or institutions that provide support for home schooling, but do not offer classroom instruction for students are not included.) The survey universe is composed of schools identified from a variety of sources. The main source is a list frame, initially developed for the 1989-90 PSS. The list is updated regularly with lists provided by nationwide private school associations, state departments of education, and other state agencies that list private schools. In addition, the general public may submit additional schools for the survey through the NCES Web Site. The other source is an area frame search in approximately 120 geographic areas conducted by the Bureau of the Census.\nThe NHES is designed as a mechanism for collecting detailed information on educational issues from a large and targeted sample of households in a timely fashion. Households are selected using random-digitdialing (RDD) methods and data are collected using computer-assisted telephone interviewing (CATI) procedures. The sample for the NHES is drawn from the civilian population in households having a telephone in the 50 states and the District of Columbia. For each NHES survey, between 45,000 and 60,000 households are screened, and individuals within households who meet predetermined criteria are sampled for more detailed or extended interviews. The data are weighted to permit estimates of the entire population that the sample is intended to represent. The NHES survey for a given year typically consists of a screener questionnaire that collects household composition and demographic data and two to three substantive surveys addressing education-related topics. Generally, between 10,000 and 20,000 interviews are obtained for each survey. One of the goals of the NHES is to produce reliable national estimates of the characteristics of children's and adults' educational experiences for the targeted populations and for relevant subgroups defined by race and ethnicity. Estimates by race and ethnicity are of great interest, especially for monitoring education trends over time. Therefore, the NHES design oversamples Black and Hispanic subgroups in order to increase the reliability of estimates for those groups. Another goal of the NHES is to monitor educational activities over time. The NHES has collected data by repeating substantive surveys on a rotating basis in order to provide comparative data across survey years, with the exceptions of the School Safety and Discipline (SSD-NHES:1993) and the Household and Library Use (HHL-NHES:1996) surveys. Each administration of the NHES has benefited from experience with previous cycles, resulting in enhancements to the survey procedures and content. Thus, while the NHES affords the opportunity for tracking phenomena over time, it is dynamic in addressing new issues and including conceptual and methodological refinements. A design feature that was unique to the 1996 administration was the collection of demographic and educational information on members of all households rather than just those households that were eligible for a topical survey. This expanded screening feature included a brief set of questions on the use of public libraries. The total household sample size was large enough to produce state estimates for these brief topical questions. In 1999, the NHES was designed as a special end-of-decade collection to measure key topics covered in previous NHES surveys. These topics included Early Childhood Education and School Readiness, Parent and Family Involvement in Education, Civic Involvement, and Adult Education and Lifelong Learning.\nFRSS surveys collect and report data on key education issues at the elementary and secondary levels. A similar survey system, the Postsecondary Education Quick Information System (PEQIS), conducts timesensitive surveys at the postsecondary level (see description in chapter 4). Data collected through FRSS surveys are representative at the national level, drawing from a universe that is appropriate for each study. The FRSS collects data from state education agencies and national samples of other educational organizations and participants, including: local education agencies; public and private elementary and secondary schools; elementary and secondary school teachers and principals; and public and school libraries. In order to present high-quality data quickly, the FRSS provides the following services: research on survey topics and questionnaire design, pretest of survey questionnaires, quality control of survey data, national estimates reported within 16 months of survey mail-out, guarantee of response rates of 90 percent or higher, tabulations and other analyses of data, and preparation of survey reports. The FRSS also has the capability to conduct brief surveys of households using random-digit-dialing telephone techniques. \nThe School Crime Supplement is conducted from January through June of the collection year in all NCVS sample households. Within these households, eligible respondents for the School Crime Supplement are household members between the ages of 12 and 18 who attended school at any time in the previous 6 months. The school had to be one that would advance them toward the receipt of a high school diploma. Eligible individuals are administered the supplemental questions only after the entire NCVS interview is completed. More than 10,000 interviews of youth are obtained in the School Crime Supplement. A rotation scheme is used in order to reduce the burden on respondents that could result if they were permanently in the sample. The same rotation scheme employed for the NCVS survey design is used for the School Crime Supplement. The sample of households is divided into groups or rotations. One rotation group enters the sample every 6 months, and the corresponding rotation group from a previous sample is phased out. Households remain in the sample for 3 years, and each household is interviewed once every 6 months during that time. Households in the sample for the first time are in the incoming rotation and are interviewed in person. Subsequent interviews are conducted by telephone except the in-person fifth interview to reestablish personal contact. In 1995 and 1999, about 30 percent of the households were interviewed by telephone from a centralized dialing facility using CATI techniques. Other telephone interviews were conducted by the same interviewer who conducted the personal interviews. The Census Bureau conducts the data collection. Reports released by the Bureau of Justice Statistics using NCES data can be found on the Internet (http://www.ojp.usdoj.gov/bjs).\nThe CPS is a nationally representative probability sample survey of households. A multistage stratified sampling scheme is used to select sample households. The survey is conducted in approximately 50,000 dwelling units monthly. Dwelling units are in sample for 4 successive months, out of sample for the next 8 months, and then returned to the sample for the following 4 months. An adult member of each household provides information for all members of the household.\nWithin IPEDS, postsecondary education is defined as \"the provision of a formal instructional program whose curriculum is designed primarily for students who are beyond the compulsory age for high school. This includes programs whose purpose is academic, vocational, and continuing professional education, and excludes avocational and adult basic education programs.\" Organizations that provide instructional programs as described in the definition above are considered institutions within the IPEDS universe if their primary purpose is the provision of postsecondary education. The size of the institution, diversity of program offerings, levels of awards, degree or certification curricula, type of accreditation, or other distinguishing criteria are considered characteristics of particular institutions. These criteria are not used to determine which institutions are included in or excluded from the IPEDS universe. This universe of postsecondary education institutions is divided into the following three categories based on the highest degree awarded or the length of the longest program: baccalaureate or higher institutions; 2-year award institutions (that is, institutions must have at least a 2-year program, but less than a 4year program); and less-than-2-year institutions. Each of these three categories is further disaggregated by type of financial control: public, private notfor-profit, and private for-profit. The resulting nine institutional categories are called \"sectors\" within the IPEDS universe and are used, in conjunction with their Title IV eligibility status, to determine which data collection items institutions are asked to complete. Despite the diversity of institutions across these sectors, since institutions are the primary unit for data collection, institutional units must be defined as consistently as possible. IPEDS does not request separate reports from more than one component within an individual institution. However, separate branch campuses are asked to report as individual units; thus, each institution in a multi-institutional system and each separate branch in a multi-campus system reports separately. IPEDS defines a branch institution as \"a campus or site that is not temporary, is located in a community beyond a reasonable commuting distance from its parent institution, and offers organized programs of study, not just courses.\" This last criterion is the most important. It means that at least one degree or award program can be completed entirely at the site, without requiring any attendance at the main campus or any other institution within the system. The IPEDS universe of postsecondary institutions includes only those institutions that are open to the general public. Therefore, training sites at prisons, military bases, and corporations are not considered separate institutions or branches in IPEDS, regardless of how the institutional system classifies such training sites. Data on enrollment, finance, and completions from such locations or training sites are to be incorporated into the data reported by the main campus or any other institution or branch campus in the system that is most appropriate. With respect to postsecondary education provided in conjunction with hospitals, the intent of IPEDS is to include only those hospitals that contain one or more separate entities whose primary purpose is the provision of postsecondary education; schools of nursing and radiology are two examples of such entities. Hospitals offering only internships or residency programs are not included, nor are hospitals that only offer training as part of a medical school program. Training conducted as part of a medical school program is included in the reports of the postsecondary institution offering the medical program. Hospitals operating more than one school are treated as a single postsecondary entity. This is consistent with the practice for other postsecondary institutions, where NCES only requests reports for the institution as a whole, not separate reports for each program within the institution. Since the definition of postsecondary education excludes noncredit continuing education programs and education units, organizational entities that provide only these educational services are not included as 57 institutions. Schools whose only mission is to prepare students to take a particular test, such as the CPA examination or the Bar examination, are not included in IPEDS. These programs are not considered academic, vocational, or continuing professional education. Organizations that offer training at many sites (such as H&R Block) may be consolidated into a single institutional unit when deemed appropriate by NCES. High schools with vocational programs are also excluded from IPEDS because their primary purpose is not postsecondary education.\nThe NHES is designed as a mechanism for collecting detailed information on educational issues from a large sample of households in a timely fashion. Households are selected using random-digit-dialing (RDD) methods and data are collected using computer-assisted telephone interviewing (CATI) procedures. The sample for the NHES is drawn from the civilian population in households having a telephone in the 50 states and the District of Columbia. In each NHES survey, between 45,000 and 60,000 households are screened, and individuals within households who meet predetermined criteria are sampled for more detailed or extended interviews. The data are weighted to permit estimates of the entire population that the sample is intended to represent. The NHES survey for a given year typically consists of a screener questionnaire that collects household composition and demographic data and two to three substantive surveys addressing education-related topics. Generally, between 10,000 and 20,000 interviews are obtained for each survey. One of the goals of the NHES is to produce reliable national estimates of the characteristics of children's and adults' educational experiences for the targeted populations and for relevant subgroups defined by race and ethnicity. Estimates by race and ethnicity are of great interest, especially for monitoring education trends over time. Therefore, the NHES design oversamples Black and Hispanic subgroups in order to increase the reliability of estimates for those groups. Another goal of the NHES is to monitor educational activities over time. The NHES has collected data by repeating substantive surveys on a rotating basis in order to provide comparative data across survey years, with the exceptions of the School Safety and Discipline (SSD-NHES:1993) and the Household and Library Use (HHL-NHES:1996) surveys. Each administration of the NHES has benefited from experience with previous cycles, resulting in enhancements to the survey procedures and content. Thus, while the NHES affords the opportunity for tracking phenomena over time, it is dynamic in addressing new issues and including conceptual and methodological refinements. A design feature that was unique to the 1996 administration was the collection of demographic and educational information on members of all households rather than just those households that were eligible for a topical survey. This expanded screening feature included a brief set of questions on the use of public libraries. The total household sample size was large enough to produce state estimates for these brief topical questions. In 1999, the NHES was designed as a special end-of-decade collection to measure key topics covered in previous NHES surveys. These topics included Early Childhood Education and School Readiness, Parent and Family Involvement in Education, Civic Involvement, and Adult Education and Lifelong Learning.\nWith the increased use of technology, the design for the NPSAS sample has changed over the years. The 1995-96 design no longer involves an initial sample of geographic areas and institutions within geographic areas. To be eligible for inclusion in the institutional sample, an institution must satisfy the following conditions: offer an education program designed for persons who have completed secondary education; offer an academic, occupational, or a vocational program; offer access to persons other than those employed by the institution; offer more than just correspondence courses; offer at least one program lasting 3 months or longer; and be located in the 50 states, the District of Columbia, or Puerto Rico. Additional information on the sample design for each NPSAS is described in the Methodology Report for each cycle. NPSAS data come from multiple sources, including institutional records and student and parent interviews. Detailed data concerning participation in student financial aid programs are extracted from the U.S. Department of Education's financial aid application system, the National Student Loan Data System, and institutional records. In 1986-87, family circumstances, demographic data, and plans and aspirations were collected using student and parent questionnaires. Beginning with the 1989-90 NPSAS, student and parent data were collected using CATIs. The 1986-87 NPSAS sampled students enrolled in the fall of 1986. Beginning with the 1989-90 NPSAS, students enrolled at any time during the year were eligible for the study. This design change provided the data necessary to estimate full-year financial aid awards. Beginning with the 1989-90 survey, the NPSAS included a longitudinal component and collected baseline data for a specified cohort of students. Students who began their postsecondary education during 1989-90 were interviewed in 1992, and again in 1994, to examine such issues as persistence and effects of financial aid on subsequent enrollment. Students who graduated with a baccalaureate degree during 1992-93 were surveyed in 1994, and again in 1997, to examine issues such as the transition from college to work and access to graduate school (these students will be surveyed again in 2003). Students who began in 1995-96 were followed in 1998 and 2001. Students who graduated with a baccalaureate degree in 1999-2000 were surveyed again in 2001. These longitudinal surveys, known as the Beginning Postsecondary Students Longitudinal Study and the Baccalaureate and Beyond Longitudinal Study, are described more thoroughly in chapter 6. The NPSAS covers a number of topics of interest to policymakers, educators, and researchers. For example, the NPSAS analyzes the participation of students in financial aid programs. The goal is to identify institutional, student, family, and other characteristics related to program participation. Special population enrollment in postsecondary education is also analyzed. These populations include students with disabilities, racial/ethnic minorities, students taking remedial-developmental courses, students from families with low incomes, and older students. Another component of the NPSAS is the study of the distribution of students by major field of study. Major fields of particular interest include mathematics, science, and engineering, as well as teacher preparation and health studies. The NPSAS generates data on factors associated with choice of postsecondary institution, participation in postsecondary vocational education, parental support for postsecondary education, and occupational and educational aspirations.\nThe first cycle of NSOPF was conducted by NCES with support from the National Endowment for the Humanities (NEH) in 1987-88 (NSOPF:88) with a sample of about 500 colleges and universities, over 3,000 department chairpersons, and over 11,000 instructional faculty. The second and third cycles of NSOPF were conducted by NCES with support from NEH and the National Science Foundation in 1992-93 (NSOPF:93) and 1998-99 (NSOPF:99), respectively. NSOPF:93 and NSOPF:99 were limited to surveys of institutions and faculty, but with substantially expanded samples of about 975 colleges and universities and 30,000 faculty and instructional staff. NSOPF:88 was limited to faculty and staff who had some instructional responsibilities (e.g., teaching one or more courses for credit, supervising thesis or dissertation committees, individualized instruction), while NSOPF:93 and NSOPF:99 included these individuals, as well as faculty who had no instructional responsibilities (e.g., those engaged exclusively in research, administration, or public service). Faculty status was determined by each institution. A two-stage stratified random sample design was used for all three studies. The first-stage sampling frame consisted of a subset of postsecondary institutions drawn from the IPEDS universe. The subset of institutions included all public and private, not-for-profit U.S. postsecondary institutions that granted a 2year or higher degree. A modified Carnegie classification was used to stratify institutions by type and control. The second-stage sampling frame consisted of a subset of faculty and instructional staff drawn from lists of faculty and instructional staff provided by the institutions selected in the first-stage sampling. This subset of faculty and instructional staff was surveyed by mail, with CATI nonresponse follow-up. In addition, Web versions of the questionnaires were made available for NSOPF:99. All three studies gathered information regarding the backgrounds, responsibilities, workloads, salaries, benefits, attitudes, and future plans of both full-and part-time faculties. In addition, information was gathered from institutional-and department-level respondents (department-level data was collected in 1988 only) on such issues as faculty composition, turnover, recruitment, retention, and tenure policies. The next cycle of NSOPF is planned for 2003-04.\nSurvey forms are mailed to graduate deans each May for distribution to individuals receiving their doctorates between July 1 and June 30 of the next year. The data are collected, edited, and published by the National Opinion Research Corporation (NORC). Each year, NORC publishes general survey results in a summary report. NORC also provides detailed tabulations to each sponsoring agency.\nThe PEQIS employs a standing sample (panel) of approximately 1,600 postsecondary education institutions and a panel of 51 state higher education agencies. The PEQIS is designed to conduct brief surveys of postsecondary institutions or state higher education agencies on topics of national importance. Surveys are generally limited to two or three pages of questions, with a response burden of about 30 minutes per respondent. The sampling frame for the PEQIS panel recruited in 2002 was constructed from the 2000 IPEDS Institutional Characteristics file. The PEQIS frame included 2-and 4-year (including graduate-level) postsecondary education institutions located in the 50 states and the District of Columbia. The PEQIS sampling frame was stratified by instructional level (4-year, 2-year,), control (public, private not-for-profit, and private for-profit), highest level of offering (doctor's/first professional, master's, bachelor's, and less than bachelor's), and total enrollment. Within each of the strata, institutions were sorted by region (Northeast, Southeast, Central, and West) and minority enrollment. Each institution in the PEQIS panel was asked to identify a campus representative to serve as survey coordinator. The campus representative facilitates data collection by identifying the appropriate respondent for each survey and forwarding the questionnaire to that person. \nThe High School Transcript Study is conducted with a nationally representative sample of students and schools. Beginning in the summer and continuing through the fall of the year, high school transcripts are collected for students who graduated from public and nonpublic high schools that were sampled for the NAEP assessments. The sample of schools is nationally representative of all schools in the United States, and the sample of students is representative of graduating seniors from each school. The transcript study includes only those students whose transcripts indicate that they graduated the year that the study was conducted. Most of the students sampled in the transcript study are in schools that participated in the NAEP assessment; the remaining students were sampled specifically for the transcript study. The data collected from those students that participated in NAEP make it possible to link course-taking patterns to academic performance, as measured by the NAEP assessment. The data from the transcript study are summarized in the following types of tables, as in the 1998 reports: The distribution of graduates by school and student demographic categories. The mean number of credits (Carnegie units) that graduates earned in major subject field and by student demographic categories. The percentage of graduates earning minimum credits in major subject fields and in a core curriculum of courses recommended by the 1983 NCEE report (over time). The correlations of NAEP proficiencies with various school and student demographic categories. The number of students who received credit in secondary courses in the NCES Classification of Secondary School Courses (over time). The High School Transcript Studies database contains a variety of information on student and courselevel characteristics. Some of the key variables are listed below. \nThe 1992 NALS defined literacy as \"using printed and written information to function in society, to achieve one's goals, and to develop one's knowledge and potential.\" Literacy was measured along three dimensions: prose literacythe ability to understand and use information from connected texts that include editorials, news stories, and poems; document literacythe ability to locate and use information contained in documents, such as job applications or payroll forms, bus schedules, maps, tables, and indexes; and quantitative literacythe ability to apply arithmetic operations to numbers embedded in printed materials, such as balancing a checkbook, figuring a tip, completing an order form, or determining the amount of interest from a loan advertisement. Because policymakers needed to assess a broad range of abilities in the population, but did not need to diagnose literacy problems of individuals, the 1992 assessment was designed to cover a broad range of skills. All questions underwent extensive review by subject area and measurement specialists, as well as scrutiny to eliminate any bias or lack of sensitivity to particular groups. It would take any one individual about 4 hours to complete the entire assessment. To keep the burden on any one individual to less than 1 hour, the assessment was cut into 13 blocks, with only 3 blocks given to each respondent. The responses to the items were pooled and reported by proficiency scales on the three dimensions of literacy. NALS was administered in the summer of 1992 in person by trained interviewers to a nationally representative probability sample of about 13,000 individuals aged 16 and older and to 1,100 adults incarcerated in federal and state prisons. In addition, 12 states funded sample supplements of 1,000 adults in order to obtain literacy estimates for their state populations. This was the first national study of literacy for all adults since the Adult Performance Level surveys, which were conducted in the early 1970s. The next national study of adult literacy is planned for the year 2003.\nThe design of the ECLS-B is based on the assumption that children's preparation for school begins at (or before) birth and continues upon school entry. It is guided by a framework of children's development, care, and schooling that emphasizes the interaction among the child, the family, health care, child care and 106 education programs, and the community. The ECLS-B recognizes the importance and interrelatedness of factors that represent children's health status and socioemotional and intellectual development. A nationally representative sample of approximately 13,500 children born during calendar year 2001 was selected for participation in the study. The sample consisted of children from different racial/ethnic and socioeconomic backgrounds. Asian and Pacific Islander children, Chinese children, American Indian children, moderately low birthweight children (1,500-2,500 grams), very low birthweight children (under 1,500 grams), and twins were oversampled. Children were selected at birth from birth certificates, the best and most affordable way of sampling newborns. The first data collection occurs when the children are approximately 9 months of age. Capturing data this soon after birth is important because much of the data collected at this time pertains to prenatal care and the health care of the mother and child during the first months of life. Data are collected again when the children reach 24 months and 48 months of age. Data are also collected when the children enter kindergarten and first grade.\nThe design of the ECLS-K is guided by a framework of children's development and schooling that emphasizes the interaction between the child and family, the child and school, the family and school, and the family, school, and community. Thus, the ECLS-K recognizes the importance of factors that represent the child's health status and socioemotional and intellectual development, and incorporates factors from the child's family, community, and school and classroom environments. The study is particularly focused on the role that parents and families play in helping children adjust to formal school and in supporting their education through the primary and middle elementary grades. It also gathers information for understanding how schools prepare for and respond to the diverse backgrounds and experiences of the children and families they serve. A nationally representative sample of approximately 22,000 children enrolled in about 1,000 kindergarten programs during the 1998-99 school year was selected for participation in the ECLS-K. These children were selected from full-day and part-day programs in public and private schools. The sample consisted of children from different racial/ethnic and socioeconomic backgrounds. NCES oversampled private kindergartens and kindergartners, as well as Asian and Pacific Islander children. The ECLS-K sample will support separate analyses of public and private kindergartens, as well as White, Black, Hispanic, and Asian/Pacific Islander children's school experiences and outcomes. To date, NCES has collected data on the sampled children and their environments in the fall and spring of the kindergarten year, the spring of first grade, and the spring of third grade. It also conducted child assessments and parent interviews in the fall of first grade for 30 percent of the sample. Current plans call for a spring fifth-grade data collection.\nThe survey design provided for a highly stratified national probability sample of over 1,100 secondary schools as the first-stage units of selection. To make the study more useful for policy analyses, certain types of schools were oversampled: public schools with a high percentage of Hispanic students, Catholic schools with a high percentage of minority students, alternative public schools, and private schools with highachieving students. The initial national sample for HS&B was considerably larger than that drawn in NLS-72. In this survey, 36 seniors and 36 sophomores were selected in each school. Parents of these students were also sampled. In schools with fewer than 36 students in either of these groups, all eligible students were selected. The base year of this survey, which was conducted early in 1980, collected data from over 28,000 sophomores and 30,000 seniors. The longitudinal design of the study called for follow-up surveys of substantial subsets of the two cohorts at 2-year intervals. Data collection for the first follow-up was in spring 1982. Subsequent follow-ups were also undertaken in 1984 and 1986, and another follow-up of the sophomores was conducted in 1992. The first follow-up survey, conducted in 1982, sampled almost 40,000 students (12,000 seniors and 27,000 sophomores); the second, in 1984, sampled approximately 27,000 students (12,000 seniors and 15,000 sophomores); and the third, in 1986, sampled almost 27,000 students (also 12,000 seniors and 15,000 sophomores). The 1992 follow-up collected data from almost 15,000 sophomores. In 1993, a Postsecondary Education Transcript Study was conducted for the sophomore cohort. Data collection instruments in the base-year survey included: sophomore and senior student questionnaires with a series of cognitive tests; school questionnaires filled out by an official in each participating school; teacher comment checklists filled out by a teacher of the sampled student; second-language questionnaires; and parent questionnaires filled out by a sample of parents from both cohorts. ri`1\nThe base-year sample of 1988 eighth-graders was constructed to be representative at the national level. Two-stage probability sampling was used to select schools and students. The first stage involved stratified sampling of some 1,000 public and private schools from a universe of approximately 40,000 schools containing eighth-grade students. The second stage included random samples of approximately 24 to 26 students per school. Some 25,000 eighth-graders and their parents, teachers, and school principals were surveyed. When the student sample was selected, one parent and two teachers of each student were also selected as subsamples. Hispanic and Asian/Pacific Islander students were oversampled to permit analysis of the performance of language-minority students. 1 8 NELS:88 is designed to provide trend data about critical transitions experienced by young people as they develop, attend school, and embark on their careers. It can complement and strengthen state and local efforts by furnishing new information on how school policies, teacher practices, and family involvement affect student educational outcomes (i.e., academic achievement, persistence in school, and participation in postsecondary education). In the base year, four cognitive tests (reading, science, history-government, and math) were administered, in addition to the student questionnaire, a parent questionnaire, a teacher questionnaire, and a school administrator questionnaire. The design for the NELS:88 first follow-up survey included student, school administrator, teacher, and dropout questionnaires. Students took cognitive tests in reading, science, history-government, and math. The tests were designed to reflect 10th-grade coursework, but also had enough overlapping items with the eighthand 12th-grade tests to permit measurement of academic growth. Selected teachers of each sampled student provided information about the student's study habits and performance, and about instructional practices in the student's classes. The NELS:88 first follow-up was conducted between February and May of 1990. During the spring of 1992, NCES surveyed this eighth-grade cohort again as part of the second followup. This second follow-up survey included student, school administrator, parent, teacher, and dropout questionnaires. Students and dropouts also took cognitive tests in reading, science, social science, and math. High school transcripts were also collected from second follow-up participants. During the spring of 1994, NCES surveyed this cohort again. The focus of the interviews was employment, education, and family formation experiences. The sampled population was interviewed using CATI in order to determine whether they completed high school, and, if so, by what means (e.g., regular completion, GED, or some other method). The interview also collected information about other activities since the last interview in 1992 (e.g., working, number of jobs, periods worked, description of work and education, postsecondary activities, field of study, and periods of time). Another follow-up was conducted in 2000, by which time many in this cohort had finished their postsecondary education and completed a transition into the labor force. Others had been in the labor force for about 8 years.\nThe BPS is based on the NPSAS. The NPSAS is a large, nationally representative sample of institutions, students, and parents (see NPSAS description in chapter 4 for more information). As such, it provides a highly efficient and cost-effective way of identifying a nationally representative sample of beginning students attending postsecondary institutions. In addition, data from all components of the NPSAS (the Student Record Abstract, Student Interview, Parent Survey) are available as base-year data for the BPS sample. For the second BPS cohort (BPS:96/98/2001), annual matches with U.S. Department of Education financial aid records and SAT/ACT scores are also included The first BPS followed NPSAS:90 beginning students starting in 1992. About 8,000 students who began their postsecondary education career in the 1989-90 academic year responded to NPSAS:90 and were included in the first BPS (BPS:90/92) in the spring of 1992 and the second follow-up of that cohort (BPS:90/94) in 1994. NPSAS:90 collected data for over 6,000 parents of those students. The second BPS cohort followed NPSAS:96 students beginning their postsecondary education in the 1995-96 academic year. Over 10,000 students responded to the first follow-up of the second cohort in 1998 and over 9,100 responded to the second follow-up of the BPS:96 cohort in 2001 (BPS:96 /0l). New BPS cohorts alternate with the Baccalaureate and Beyond Longitudinal Study (B&B) in using the NPSAS as their base. Public-use data from BPS:90/92/94 and BPS:96/98 cohorts are available through the Internet and on CD-ROM.\nB&B is based on the NPSAS (described separately in chapter 4). The NPSAS is a large, nationally representative sample of institutions, students, and parents. As such, it provides a highly efficient and cost-effective way of identifying a nationally representative sample of baccalaureate degree completers. For each NPSAS that serves as the base year for a B&B cohort, the sample is structured to provide an optimum sample of graduating seniors in all majors. This allows the accurate identification of baccalaureate degree completers, and provides additional information concerning both past education experiences and future education employment expectations. Data from all components of the NPSAS are available as base-year data for the B&B sample. B&B will follow baccalaureate degree completers identified in alternating NPSAS surveys, beginning with NPSAS:93. About 11,000 students who completed their degree in the 1992-93 academic year were included in the first B&B cohort, followed up in 1994 and 1997 to date (B&B:93/97), with a third follow-up scheduled for 2003. NPSAS:93 also provided data for over 8,000 of their parents. In addition to the student interview data, B&B:93/94 collected postsecondary transcripts covering the undergraduate period. These transcripts provide information on progress and persistence at the undergraduate level. The second B&B follow-up took place in spring 1997 (B&B:93/97) and provided new information on employment, entry into graduate school, and progress in the teacher pipeline. A new B&B cohort began with the 2000 NPSAS and involved only a 1-year follow-up in 2001. Future B&B cohorts will alternate with BPS in using NPSAS surveys as their base."}, {"section_title": "Schools and Staffing Survey", "text": "The School and Staffing Survey (SASS) is an extensive survey of American public and private kindergarten through 12th-grade schools. Its linked design provides information on public, private, Bureau of Indian Affairs (BIA), and public charter schools; the principals who head these schools; and the teachers who work in them."}, {"section_title": "SASS has four unique features:", "text": "SASS is representative of K-12 teachers, principals, schools, and school districts at the state (public only) and national levels. SASS provides detailed data on both the public and private sectorsstate-reliable data on public schools and affiliation data on private schools. SASS collects data from every charter school in the United States and every school operated by the BIA; it also oversamples schools that have an American Indian student enrollment of 20 percent or more. SASS-licensed users can analyze data across various components of SASS. Using NCES restricted data, they can link teachers and principals to their schools and schools to their school districts. The most recent administration of SASS was in the 1999-2000 school year. Over 100,000 SASS questionnaires were mailed to collect information on teachers, principals and school heads, schools, school districts, and school library media centers. In 1999-2000, SASS collected information on a number of new topics crucial to education reform. At the same time, SASS retained or expanded many of the topics covered in previous surveys, maintaining the comparability for trend analysis. or' F. (4),"}, {"section_title": "39", "text": "New coverage includes: school and district performance reportscontent, uses, and rewards or sanctions for performance; computersnumber, uses, access to the Internet, and availability of computer support; standards for home-schooled students; charter schools; and migrant student enrollment and services. SASS large sample sizes (approximately 6,000 school districts, 10,000 public schools, 3,500 private schools, 60,000 public school teachers, and 12,000 private school teachers) allow extensive disaggregation of data by important characteristics of schools, such as the poverty level of the students, urbanicity, and minority enrollment; and of teachers, such as their demographic characteristics and teaching assignment field. SASS data were first collected in the 1987-88 school year, and again in the 1990-91, 1993-94, and 1999-2000 school years. One year after each collection, a follow-up survey of teachers is conducted to measure teacher attrition and mobility (see the \"Teacher Follow-up Survey\" description in this section). SASS will be administered every 4 years in the future, with the next collection occurring in school year 2003-04. Data from SASS are used by Congress, the U.S. Department of Education, and other federal agencies; state education agencies; educational associations; business firms that market education services; and the education research community for the following purposes: To profile the teacher workforce, including demographic characteristics, academic background, qualifications to teach in fields of assignment, workload, professional development, career plans, compensation, and perceptions of the teaching profession and their workplace. To profile the principal workforce, including demographic characteristics, academic background, qualifications, and training for administration, and to assess school climate and decisionmaking. To describe the qualifications of teachers to teach in their subject fields and, in particular, to monitor the rate of out-of-field teaching (i.e., teachers teaching in a subject area without certification, or a college major or minor in that field). To provide information on school conditions and programs, including basic descriptors of schools, enrollments, organization, curricula, student programs and services, staffing, student characteristics, school climate, and teacher workplace conditions. To provide information on aspects of teacher supply and demand, shortages, and turnover, such as methods of covering unfilled vacancies, and policies, practices, and circumstances influencing supply and demand conditions."}, {"section_title": "Teacher Follow-up Survey", "text": "The Teacher Follow-up Survey (TFS) is designed to measure attrition from the teaching profession and teacher mobility. The survey follows a sample of the teachers who were respondents to SASS in the previous school year and identifies those who left teaching, those who remained in the same schools, and those who moved to other schools. The data are used to measure rates of and reasons for teacher attrition, retention, and mobility at the national level in both public and private schools. Attrition can be examined in terms of primary destinations of those who leave, reasons for leaving the profession, and characteristics of those who leave. Data from the base year SASS Teacher Questionnaire allow analysis of other factors related to attrition, such as qualifications, salary, satisfaction, other working conditions, and retirement programs. The survey gathers information about teachers' decisions to leave or stay in the profession."}, {"section_title": "Components", "text": "Questionnaire for Former TeachersSurvey of former teachers to ascertain information on primary activity or occupational status, plans to remain in current position, plans for further education, plans for returning to teaching, reasons for leaving teaching, areas of satisfaction or dissatisfaction with teaching, salary and compensation, marital status, number of children, and other background information that may be related to attrition. Questionnaire for Current TeachersSurvey of continuing teachers to ascertain change or retention in school, occupational status, teaching assignment field, further education and plans, reasons for leaving previous school, effectiveness of administration, areas of satisfaction or dissatisfaction, expected duration in teaching, time spent performing school-related tasks, professional development in last 2 years, classroom instructional practices, salary and compensation, and basic demographic characteristics. \nBasic CPSCollects information about household membership and characteristics, individual demographic characteristics, and labor force participation. October SupplementCollects basic annual school enrollment information for preschool, elementary/secondary, and postsecondary students, and educational background information needed to produce dropout estimates on an annual basis. September SupplementCollects information about the availability of computers and access to the Internet at school, home, and work. It also collects information about reasons for and frequency of computer and Internet use. Computer Use (1984( , 1989 part of the September supplement in expanded form) Collects information about the availability of computers and access to the Internet at school, home, and work. It also collects information about reasons for and frequency of computer and Internet use. Private School Tuition (1979, 1985, 1988, 1991, 1994, and 1997)Collects information about students in private schools, including data about the type of private school attended and the amount of private school tuition paid. Selected Education Characteristics (1992, 1995, and 1999)Collects information about grade retention, language spoken at home, English proficiency, disability status, and whether an individual ever attended school in the United States. Summer Activities (1996)Collected information about elementary and secondary students only. Data included information about the enrollment of students in academic activities during the summer, frequency of and reasons for attendance at academic activities during the summer, employment status during the summer, participation in community service or volunteer activities during the summer, and participation in organized summer activities.\nInstitutional CharacteristicsAddress, telephone number, Web site URL, room and board charges, tuition, required fees, control or affiliation, selected student services, admissions criteria, calendar system, levels of awards offered, types of programs, and accreditation. In addition, the survey collects price information: tuition and fees, room and board, books and supplies, and other expenses that a full-time, first-time degreeor certificate-seeking undergraduate student would expect to pay when entering the institution. This \"sticker price\" information is made available to prospective students, parents, counselors, and others on a userfriendly Web siteCollege Opportunities On-Line (IPEDS COOL) (http://nces.ed.gov/ipeds/cool). CompletionsDegree completions by level (associate's, bachelor's, master's, doctor's, and firstprofessional) and other formal awards by length of program, race/ethnicity and gender of recipient, and sixdigit Classification of Instructional Programs (CIP) code. Completion data by race/ethnicity at the two-digit CIP level became an annual collection in 1990; beginning in 1995, race/ethnicity data were collected at the six-digit CIP level. Beginning with the 2001 collection, institutions were able to report the number of students with double majors by level of degree and the six-digit CIP code of the second major. EnrollmentFull-and part-time enrollment, in the fall, by level (undergraduate, first-professional, and graduate) and by race/ethnicity and gender of student. Beginning in 1990, raciallethnic data were collected annually. (Prior to 1990, raciaUethnic data were collected in even-numbered years.) Age distributions are collected in odd-numbered years; data on state of residence of first-time freshmen (first-time, first-year students) are collected in even-numbered years. Four-year institutions are also required to complete enrollment data by level, race/ethnicity, and gender for nine selected fields of study in even-numbered years for OCR. In addition, the enrollment survey now collects the12-month instructional activity and unduplicated headcount data, which are needed to compute a standardized, full-time-equivalent (FTE) enrollment statistic for the entire academic year. FTE is useful for gauging the size of the educational enterprise at the institution.\nStudent Records (from institutional records)Year in school, major field of study, type and control of institution, attendance status, tuition and fees, admission tests scores, financial aid received, price of attendance, student budget information and expected family contribution for aided students, grade point average, age, and date first enrolled. Student Telephone InterviewFinancial aid at other schools attended during year, other sources of financial support, reasons for selecting the school they are attending, current marital status, age, race/ethnicity, sex, highest degree expected, employment and income, voting in recent elections, and community service.\nInstitutional Survey (1988, 1993, and 1999)Counts of faculty, hires and departures, employment and tenure status, policies regarding tenure, retirement, and benefits for faculty. Department Chairperson Survey (1988 only)Faculty composition in department, tenure status of faculty in department, faculty hires and departures in department, hiring practices, activities to assess faculty performance, and professional and developmental activities. Faculty Survey (1988, 1993, and 1999)Socio-demographic characteristics; academic and professional background; field of instruction; employment history; current employment status, including rank and tenure; The NSOPF can be found on the Internet (http: / /nces.ed.gov /surveys /nsopJ). For more information on the NSOPF, contact: \nElementary and Secondary School Students SurveyThe primary data collected by NAEP are about student performance and educational experience. Major current assessment areas include reading, writing, mathematics, science, civics, U.S. history, geography, foreign languages, and the arts. Data include overall performance, performance on specific content dimensions, demographic characteristics, classroom experiences, attitudes toward school, and aspirations for the future. School Characteristics and Policy SurveyIn conjunction with student performance surveys, NCES routinely collects important supplemental data about school characteristics and school policies, which could be used analytically as contextual variables to enhance understanding of student performance issues. Specifically included in school data are enrollment, curriculum testing, and objective-setting practices; school administrative practices; school conditions and facilities; special services; and programs. Teacher SurveySimilar to school contextual data, NAEP also collects important supplemental data from teachers whose students are respondents of the assessment surveys. Teacher data include race/ethnicity, sex, age, field of study, teaching certification, professional development, full-time teaching experience, classroom instructional practices, and subject-matter specialization. \nThe emphasis that is being placed on the different aspects of children's development and the different environments in which learning occurs is critically important for the design of the ECLS-B. While children's parents are the primary reporters throughout the life of the study, at varying points it is necessary to gather data from children's birth records, their care and early education providers, their schools and teachers, and from the children themselves. Children's Birth CertificatesA variety of useful data is captured in birth certificates. They provide information on the date of birth and children's gender. Information is also available on parents' education, parents' race and ethnicity (including Hispanic origin), and mother's marital status. Birth certificates provide information on the mother's pregnancy history, prenatal care, medical and other risk factors during this pregnancy, and complications during labor and birth. Health characteristics of children, such as congenital anomalies and abnormal conditions of the baby and the baby's APGAR score, are also provided. Parent-Guardian InterviewsParents and guardians are an important source of information about themselves, their child, and the home environment. A parent-guardian interview is conducted in the child's home at each data collection point using computer-assisted personal interviewing (CAPI) and a selfadministered questionnaire. The parent-guardian interviews capture information about children's early health and development and their experiences with family members and others. Parents report on children's development in such areas as children's temperament and developmental milestones (e.g., crawling). The parent interview also captures detailed information on children's health (e.g., developmental difficulties, illness, ear infections) and access to health care (e.g., health insurance). Parents-guardians provide key information about themselves as caregivers, the home environment, and the neighborhood in which they live. Several aspects of the economic stability of the home environment are tracked (e.g., welfare receipt, household food sufficiency, employment situation). The parent-guardian interviewed is the individual who is the primary caregiver and the most knowledgeable about the care and education of the child. In most cases, this is the child's mother or female guardian. Father QuestionnairesThe ECLS-B collects information from fathers as well. Fathers complete a selfadministered questionnaire regarding the particular role they play in the development of their children. The father questionnaire captures information about children's well-being and activities fathers engage in with their children. Fathers also provide key information about themselves as caregivers. Both resident fathers and 95\nBecause numerous factors in schools, homes, and communities influence children's academic and social outcomes, data for the ECLS-K are collected not only from children, but also from their parents-guardians, teachers, and school administrators. Student AssessmentsSampled children participate in various activities that measure the extent to which they exhibit those abilities and skills deemed important for success in school. They are asked to participate in activities designed to measure important cognitive (e.g., general knowledge, literacy, and quantitative skills) 98 and noncognitive (e.g., physical) outcomes. Measures of a child's cognitive skills are obtained through an untimed one-on-one assessment of the child. Measures of physical development include both height and weight measurements. Also, in the fall of kindergarten, a psychomotor assessment is administered to measure children's motor abilities, coordination, and visual motor skills. In the years when most of the children are in third and fifth grade, they are asked to report on their feelings about school and school subjects such as reading and mathematics. Parent-Guardian InterviewsParents and guardians are an important source of information about the families of the children selected for the study and about themselves. In telephone interviews (or in personal interviews for households without telephones), they provide key information about children's development and their experiences with family members, schools, and others. The family background, demographics, and home environment content covered in the parent-guardian interviews of the ECLS-K include family structure; immigration status; primary language(s) spoken; parents' involvement with the child's school; child care; child's health and well-being; parental values, beliefs, and expectations; home environment, activities, and cognitive stimulation; parental monitoring; neighborhood; parent education; parent employment; parent income and assets; welfare and other public transfers; discipline, warmth, and emotional supportiveness; parents' psychological well-being and health; and critical family processes. Parent-guardian interviews also include items asking parents-guardians to rate their child's social skills, problem behaviors, and approaches toward learning. Teacher QuestionnairesLike parents, teachers represent a valuable source of information on themselves and the children's learning environment (i.e., the classroom). In self-administered questionnaires, teachers are asked to provide information about their own backgrounds, teaching practices, and experiences, along with information on the classroom setting for the sampled children they teach. The content covered in the teacher questionnaires of the ECLS-K includes class type and composition, class organization, class activities, curricular focus and evaluation methods, parent involvement, views on readiness, professional development, and teacher's professional background. Teacher RatingsTeachers are also asked to evaluate sampled children on a number of critical cognitive and noncognitive dimensions. Teacher cognitive ratings measure teachers' perceptions of students' academic achievement and dispositions for learning in three domainslanguage/literacy, mathematics, and general knowledge (i.e., science and social studies). Ratings of children's socioemotional behaviors provide measures of children's prosocial and problem behaviors and their approaches toward learning. Teachers also complete checklists on the sampled children, reporting on such things as the children's language skills, special needs, program placements, attendance, and physical activity levels. Special Education Teacher QuestionnairesSpecial education teachers represent a valuable source of information on themselves and the children's experience with special education services. In a selfadministered questionnaire, they are asked to provide information about their background and experience and the instructional approaches used for the sampled children who receive these services. They also provide information on sampled children's disabilities, Individual Education Plans (IEPs), and services. School QuestionnairesIn a self-administered questionnaire, school administrators, principals, and headmasters provide information on the physical and organizational characteristics of their schools, and on the schools' learning environments and programs. Special attention is paid to the instructional philosophy of the school and its expectations for students. The content covered in the school questionnaires of the ECLS-K includes school characteristics, student characteristics, teaching staff characteristics, school policies and programs, principal characteristics, and school governance and climate. Additionally, field staff conduct an 99 1 I 1 independent survey of the schools' physical facilities, atmosphere (e.g., fighting in hallways), and learning environments (e.g., student work displayed). Salary and Benefits QuestionnaireIn order to trace resources directly available to children, school district business offices or headmasters complete a self-administered questionnaire capturing information on salary, merit pay (e.g., education stipends), and benefits (e.g., payroll taxes, medical insurance) for sampled children's teachers and school administrators. It represents one of the first times that specific teacher salary data can be linked to outcomes of specific children. This information was collected during the kindergarten year. Student Records Abstract FormFor each sampled ECLS-K child, information is gathered from his/her school records. This form, completed by the school from its records, provides data on the child's attendance, the child's home language, whether the child has an IEP on record, and whether the child attended Head Start. Verification of Head Start Program ParticipationHead Start participation data have proven to be somewhat unreliable, as reported by either parents or schools. The ECLS-K contacted each Head Start site that a sampled child was reported to have attended. This report of participation came from either the parentguardian interview or the student record. The Head Start site completed a self-administered form for each child that verified attendance and asked about attendance dates and program type (e.g., partvs. full-day, center-vs. home-based).\nBase-Year SurveyAge, sex, racial/ethnic background, physical handicap, socioeconomic status of family and community, school characteristics, future education and work plans, test scores, school experience, school performance, work status, and work performance and satisfaction. Follow-up Surveys (1973, 1974, 1976, 1979Marital status, community characteristics, education and work plans, educational attainment, work history, attitudes and opinions, postsecondary school characteristics, grade point average, credits earneeafiti financial assistance for postsecondary education. Patterns and Consequences of Delay in Postsecondary Education (February 1990) Trends in Postsecondary Credit Production: 1972and 1980High School Graduates (June 1990 Careers in Teaching: Following Members of the High School Class of 1972In and Out of Teaching (July 1991) Statistics in Brief: High School Seniors Look to the Future, 1972(December 1993 Trends Among High School Seniors, 1972(July 1995 Data File \nStudent QuestionnaireAge, sex, racial/ethnic background, religion, socioeconomic status of family and community, school experiences, test scores, school performance, future educational plans, family status and orientations, work experience and satisfaction, future occupational goals, plans for and ability to finance postsecondary education, and cognitive tests. School QuestionnaireEnrollment, staff, educational programs, facilities and services, dropout rates, and special programs for handicapped and disadvantaged students. Teacher Comment ChecklistTeacher observations about the student. Parent QuestionnaireFamily attitudes, family income, employment, occupation, salary, financial planning, and postsecondary education goals. Follow-up Surveys (1982, 1984)Sophomores: similar student information as collected in the base-year survey, school information in the first follow-up, high school and postsecondary transcripts, and data on dropping out. Seniors (not surveyed in 1992 follow-up): marital status, community characteristics, work plans, educational attainment, work history, attitudes and opinions, postsecondary The transition from elementary to secondary schoolThe survey permits the investigation of ways students are assigned to curricular programs and courses, and how such assignments affect their academic performance as well as future career and postsecondary education choices. The students' academic growth over timeFamily, community, school, and classroom factors that promote such growth can be studied. The goal is to identify school and classroom characteristics and practices that promote student learning. The effects of changing composition of the family, which is evidenced by increasing numbers of working mothers and families headed by single parents, can also be studied. The process of dropping out of school, as it occurs from eighth grade onNELS:88 provides the unprecedented opportunity to study young dropouts on a national scale, to examine the contextual factors associated with dropping out (especially those related to the school), and to profile the movement of students in and out of school, including alternative high school programs. The role of the school in helping the disadvantagedGiven the factors of increasing teenage pregnancy rates, increasing poverty among children, and the growing proportion of language-minority students, there is a need for research on the school experiences of the disadvantaged and the approaches that hold the greatest potential for assisting them. By design, the NELS:88 sample contains an ample number of disadvantaged students to study this issue. The school experiences and academic performance of language-minority studentsNELS:88 oversampled Hispanics and Asians/Pacific Islanders to allow meaningful analyses of these subpopulations. Specifically, the data provide information on variation in achievement levels and bilingual education needs and experiences. Attracting students to the study of mathematics and scienceThe data can be used to examine the math and science preparation students receive nationwide and the degree to which their interest in these subjects is captured. Information is also available on whether they were encouraged by their teachers and school to study advanced mathematics and science. The transition from high school to college (postsecondary access and choice)NELS:88 included the planning and postsecondary education application behaviors of the high school class of 1992, as well as their subsequent enrollments in postsecondary institutions. The transition from high school and postsecondary education to the world of work and adult roles was also examined. During the fourth follow-up, NELS:88 respondents provided information on their current activities, including work and postsecondary education experiences.\nNPSAS Base Year (1990 and1996)Major field of study, type and control of institution, financial aid, cost of attendance, age, sex, race/ethnicity, family income, reasons for school selection, current marital status, employment and income, community service, background and preparation for college, college experience, future expectations, parents' level of education, income, and occupation. BPS Follow-up Surveys (1992, 1994 Year in school, persistence in enrollment, academic progress, degree attainment, change in field of study, institution transfer, education-related experiences including early entry into graduate school, expenses and financial aid, employment and income, employment after completion, employment-related training, current family status, community service, political participation, and future expectations. degree and continue their education. B&B:93/97 provided a unique opportunity to gather information concerning delayed entry into graduate education, time to completion of graduate education, and the interaction between work and education beyond the bachelor's degree. B&B:93/2003 will expand this opportunity and begin to provide information concerning graduate study and long-term employment experiences after degree completion. B&B is an expansion of the former RCG Survey. The RCG focused on the immediate postdegree employment and education experiences of people who completed a bachelor's or master's degree, and also estimated the potential supply of newly qualified teachers at the elementary and secondary levels. B&B builds upon and expands that effort to provide unique information on education and employment experiences at the undergraduate level as well as extensive information on financing undergraduate education. In addition, B&B:93 provides that information over a longer period of time and addresses issues concerning delayed entry into graduate school, progress and completion of graduate-level education, and undergraduate and graduate debt and its impact on choices related to career and family. In addition, it provides new information on the career paths of new teachers and movement into and outside the education system. B&B:2000/01 is comparable to the previous RCG survey, with the addition of information about undergraduate education from the NPSAS. B&B covers a number of topics of interest to policymakers, educators, and researchers. For example, B&B allows analysis of the participation and progress of recent bachelor's degree completers in the workforce, the relationship of employment to degree, the income and ability to repay debt, and the willingness to enter public service-related fields. B&B also allows analysis of issues related to access to and choice in graduate education programs. Here, the emphasis is on ability, ease, and timing of entrance into graduate school, and attendance-employment patterns, progress, and completion timing once entered. The unique features of B&B allow it to be used to address issues related to undergraduate education as well as postbaccalaureate experiences. For instance, B&B allows the investigation of issues related to undergraduate course-taking patterns, progress, and time to degree. This can involve such things as course taking in the major area of study, as well as in areas other than the academic major; stopout and transfer behavior; credits and grades earned; financial aid and work experiences as an undergraduate and their relationship to postbaccalaureate education; and financial experiences. This information has been used to investigate the relationship between undergraduate debt burden and early labor force experiences, and between undergraduate academic experiences and entry into teaching. These and other relationships can be investigated both in the short term and over longer periods. Because B&B has a special emphasis on new teachers at the elementary and secondary levels, it can be used to address many issues related to teacher preparation, entry into the profession (e.g., timing and ease of entry), persistence in or defection from teaching, and career movement within the education system. Employment and enrollment patterns can also be examined for special baccalaureate degree populations. These populations include, but are not limited to, students with disabilities, racial and ethnic minorities, students from families with low incomes, and older students. B&B also allows investigation of the experiences of students by major field of study at both the undergraduate and graduate levels. Major fields of particular interest include mathematics, science, engineering, teacher preparation, and health studies.\n"}, {"section_title": "Major Publication", "text": "\nHandbook on Human Resources: Recordkeeping and Analysis (May 1998) For further information on the NCES postsecondary education handbook program, contact: \nHow do the skills demonstrated by the U.S. adult population, as measured in ALL, compare to the skills of adults in other countries'? How do the skills measured in ALL relate to one another? What is the relationship between the skills measured in ALL to individual economic and social status? Are there significant differences across race, gender, and socioeconomic background in the skills demonstrated by U.S. adults'? Design ALL will consist of two components: background questionnaires designed to collect general participant information and examine attitudes toward teamwork and familiarity with information and communication technology; and assessments of the skills of participants in prose and document literacy and numeracy. ALL is a household survey. Participants will complete approximately 45 minutes of background questions and 60 minutes of paper-and-pencil assessment items in their homes. In the United States, a nationally representative sample of approximately 4,000 adults aged 16-65 will be selected. Each participating country will provide a sample that is representative of their adult population as a whole. Main data collection for ALL will take place at the end of 2002. Additional details on ALL can be found on the Internet (http://nces.ed.gov/survevs/a11). For further information on ALL, contact: Mariann Lemke Early Childhood, International, and Crosscutting Studies Division Data Development Program National Center for Education Statistics 1990 K Street, NW Washington, DC 20006 Telephone number: (202) 502-7341 E-mail address: inariann.lemke ii)ed.gov"}, {"section_title": "Private School Survey", "text": "With increasing concern about alternatives in education, the interest and need for data on private education have also increased. NCES has made the collection of data on private schools a priority. The purposes of the PSS data collection are to build an accurate and complete list of private schools to serve as a sampling frame for NCES sample surveys including private schools, and to report data on the total number of private schools, teachers, and students in the survey universe. The PSS is conducted every 2 years, with collections in the 1989-90,1991-92,1993-94,1995-96,1997-98, and 1999-2000 school years. The most recent survey was conducted in the 2001-02 school year. The PSS produces data similar to that of the CCD for public schools, and can be used for public-private comparisons. The data are useful for a variety of policy-and research-relevant issues, such as the growth of religiously affiliated schools, the number of private high school graduates, the length of the school year for various private schools, and the number of private school students and teachers."}, {"section_title": "Component", "text": "1999-2000 Private School SurveyThe PSS consists of a single survey that is completed by administrative personnel in private schools. Information collected includes; level of school, religious orientation or other affiliation, size of school, length of school year and school day, total enrollment (K-12), race/ethnicity of students, whether a school is coeducational or single sex, number of high school graduates, number of teachers, program emphasis, existence and type of kindergarten program, and whether a school has a library media center. Information on the PSS can be found on the Internet (http://nces.ed.gov/surveys/pss.html). For more information on the PSS, contact: NHES addresses many issues in education that had not been addressed previously by other NCES data collection activities, such as early childhood care arrangements and education, children's readiness for school, parent involvement in elementary and secondary education, and adult participation in education outside of traditional postsecondary institutions.\nSurvey of Earned DoctoratesSex, age, race/ethnicity, marital status, citizenship, disabilities, dependents, specialty field of doctorate, all institutions attended from high school to completion of doctorate, time spent in completion of doctorate, source of financial support for graduate study, education debt incurred, postdoctoral plans, and educational attainment of parents.\nNational Assessment of Adult LiteracyAssessed areas include prose literacy, document literacy, and quantitative literacy. Other information includes race/ethnicity, age, sex, educational and occupational background, and reading habits. Literacy of Older Adults in America: Results from the National Adult Literacy Survey (November 1996) Information about NAAL can be found on the Internet (http://nces.ed.gov/naal). For further information on the 1992 NALS Survey, contact:"}, {"section_title": "Major Publications", "text": "Full-scale NHES collections have been conducted in the spring , 1996, 1999. Surveys have included Early Childhood Program Participation (ECE-NHES:1991, ECPP-NHES:1995, Parent-NHES:1999, and ECPP-NHES:2001, School Readiness (SR-NHES:1993 andParent-NHES:1999), School Safety and Discipline (SSD-NHES:1993), Parent and Family Involvement in Education (PFI-NHES:1996 andParent-NHES:1999), Civic Involvement (PFI/CI- NHES:1996, YCI-NHES:1996, Youth-NHES:1999, and ACI-NHES:1996, Household and Library Use (HHL-NHES:1996), and Before-and After-School Programs and Activities (ASPA-NHES:2001). The NHES has also collected data on Adult Education (AE-NHES:1991, AE-NHES:1995, AE-NHES:1999, and AELL-NHES:2001) (see chapter 4, \"Postsecondary and Adult Education.\") The NHES will be conducted again in the spring of 2003 and 2005, and periodically thereafter. NHES:2003 will include two surveys: Parent and Family Involvement in Education and Adult Education for Work-Related Reasons.\nParents' Reports of School Practices to Involve Families (November 1996) Use of Public Library Services by Households in the United States: 1996 Student Interest in National News and its Relation to School Courses  An Overview of Response Rates in the National Household Education Survey: 1991 An  National Household Education Surveys: CD-ROM (July 1997, 1996 \n\nStudents' Reports of School Crime: 1989(April 1998 \nDropout Rates in the United States: 1999(November 2000 Dropout Rates in the United States: 2000 November 2001The CPS can be found on the Internet (http://nces.ed.gov/surveys/cps/). For further information on the CPS October Supplement, contact: Chris Chapman Early Childhood, International, and Crosscutting Studies Division National Center for Education Statistics 1990 K Street, NW Washington, DC 20006 Telephone number: (202) 502-7327 E-mail address: chris.chapman@ed.gov\n\nDevelopments in School Finance, 1998 (August 2000) A Primer for Making Cost Adjustments in Education March 2001Public School Finance Programs of the U.S. and Canada April 2001Selected Papers in School Finance, 2000-01 August 2001Persons seeking NCES finance information, publications, and data should visit the Internet (http://nces.ed.gov/edfin). For further information on the EFSC, contact: \n\n\n\n\n\nThe 1998 High School Transcript Study Tabulations: Comparative Data on Credits Earned and Demographics for 1998, 1994, 1987, and 1982High School Graduates (June 2001 The  1987, 1994 \nSheida White Assessment Division Office of the Associate Commissioner 1990 K Street, NW Washington, DC 20006 Telephone number: (202) 502-7473 E-mail address: sheida.white@ed.gov\nAmerica's Kindergartners February 2000The Kindergarten Year (December 2000) Entering Kindergarten: Findings from the Condition of Education (January 2001) Children's Reading and Mathematics Achievement in Kindergarten and First Grade (March 2002) Information on the ECLS-K can be found on the Internet (http://nces.ed.gov/ecls). For further information, contact: Young people's success in making the transition from high school or college to the workforce varies enormously for reasons only partially understood. Some cling to dependency; others move into selfdetermination smoothly. The NLS-72 base-year study and its five follow-up surveys provide data to allow researchers to study how these transitions evolve. NLS-72 can provide information about quality, equity, and diversity of educational opportunity, and the effect of those factors on cognitive growth, individual development, and educational outcomes. It can also provide information about changes in educational and career outcomes and other transitions over time. The NLS-72 data cover the sampled cohort from 1972 to 1986. Design NLS-72 was designed to produce representative data at the national level on the cohort of students who were in the 12th grade in 1972. The sample for the base-year of NLS-72 was a stratified, two-stage probability sample of 12th-grade students from all schools (public and private) in the 50 states and the District of Columbia during the 1971-72 school year. A sample of schools was selected in the first stage. In the second stage, a random sample of 18 high school seniors was selected within each participating school. Data were collected by mail, telephone, and personal interviews. In addition, the survey obtained high school transcript data on high school curriculum, credit hours in major courses, grade point average, standardized test scores, and related information for each senior. To conduct intensive studies of disadvantaged students, NCES oversampled schools in low-income areas and schools with significant minority enrollments. The size of the student sample was increased during the first follow-up survey because base-year nonrespondents were recontacted at that time. Those who provided base-year information during the first follow-up were retained and included in later follow-up efforts. Consequently, in 1972 there were 16,683 respondents, but in the first follow-up in 1973, the number increased to 21,350. The numbers of respondents in subsequent follow-ups in 1974, 1976, 1979, and 1986 were 20,872, 20,092, 18,630, and 12,841, respectively (only a subsample of 14,489 of the original sample was contacted in 1986). In addition to the follow-ups, a number of supplemental data collection efforts were undertaken. For example, a Postsecondary Education Transcript Study was undertaken in 1984, and the fifth follow-up survey in 1986 included a supplement for those who became teachers.\nAmerica's High School Sophomores: A Ten-Year Comparison, 1980(June 1993  persistence, and attainment. With two cohorts of beginning students, differences and changes over time can also be tracked. Among the questions BPS addresses are: Do students who are part time or discontinuous attendees have the same educational goals as full-time, consistent attendees? Are they as likely to attain similar educational goals? Are students who change majors more or less likely to persist? The publication Descriptive Summary of 1989-90 Beginning Postsecondary Students: 5 Years Later presented rates of persistence and degree attainment. In addition, Nontraditional Undergraduates presented differences in persistence found for traditional and nontraditional students. The report Descriptive Summary of 1995-96 Beginning Postsecondary Students: Three. Years Later, With an Essay on Students Who Started at Less-Than-4-Year Institutions provides information on the second BPS cohort.\n1 5 3"}, {"section_title": "Surveys", "text": "Early Childhood Program Participation Surveys (ECE-NHES:1991, ECPP-NHES:1995, and ECPP-NHES:2001The Early Childhood Program Participation surveys were conducted in (ECE-NHES:1991, ECPP-NHES:1995, and ECPP-NHES:2001. The 1999 Parent survey (Parent-NHES:1999) collected information on a limited set of issues covered in earlier early childhood program participation surveys. In the 1991 Early Childhood Education survey, parents of 3-to 8-year-olds completed interviews about their children's early childhood education, including participation in nonparental care and education programs, characteristics of programs and care arrangements, and early school experiences, including delayed kindergarten entry and retention in grade. In addition, parents were asked about activities children engaged in with parents and other family members inside and outside the home. In the 1995 and 2001 Early Childhood Program Participation surveys, parents of children from birth through third grade were asked about their children's participation in nonparental care and education programs such as relative care, nonrelative care, Head Start programs, and center-based programs. Additional sections included information on early school experiences of school-age children, home literacy activities, health and disability status, and parent and family characteristics. In the 1999 Parent Survey, parents were asked about many of the nonparental care arrangements addressed in previous years. Sample sizes for Early Childhood Program Participation surveys were: 13,892 for ECE-NHES:1991, 14,046 for ECPP-NHES:1995, 6,939 for Parent-NHES:1999, and 6,749 for ECPP-NHES:2001. School Readiness Surveys (SR-NHES:1993 and P-NHES:1999)The School Readiness survey was conducted in 1993 (SR-NHES:1993) and portions were also included as part of the 1999 Parent survey (P-NHES:1999). In the School Readiness survey, parents of 3-to 7-year-olds completed interviews about the children's developmental characteristics, their center-based program participation, home activities with family members, and health status. For children in elementary school, parents were also asked about school adjustment, teacher feedback, and early school experiences. The 1999 Parent survey collected information on many of the issues studied in the 1993 collection, including emerging literacy and numeracy. Sample sizes for the School Readiness surveys were: 10,888 for SR-NHES:1993 and 6,939 for P-NHES:1999. School Safety and Discipline Survey (SSD-NHES:1993)In the School Safety and Discipline survey (SSD-NHES:1993), interviews were conducted with parents of children in grades 3-12 and with youth in grades 6-12. Parents and youth were asked about the school learning environment, discipline policy, safety at school, victimization, the availability and use of alcohol and drugs, and alcohol and drug education. Youth were also asked about peer norms for behavior in school and substance use. Sample sizes for the School Safety and Discipline Survey were: 6,504 youth interviews and 12,680 parent interviews. Parent and Family Involvement in Education Surveys (PFI/CI-NHES:1996 andParent-NHES:1999) The Parent and Family Involvement in Education survey was conducted in 1996 (PFI/CI-NHES:1996) and portions of the survey were included for children in grades K through 12 in the Parent survey of 1999 (Parent-NHES:1999). This survey will be conducted again in 2003. Parents answered questions about their children age 3 through 12th grade. For school-age children, questions addressed family involvement, including the involvement of nonresidential parents in four areas: children's schooling, communication with teachers or other school personnel, children's homework, and activities with children outside of school. For children not yet in kindergarten, information was collected on center-based early childhood program participation and family activities with children outside of school. Sample sizes for the Parent and Family Involvement surveys were: 20,792 for PFI/CI- NHES:1996and 21,222 for Parent-NHES:1999. Civic Involvement Surveys (YCI-NHES:1996, ACI-NHES:1996, and Youth-NHES:1999In the NHES:1996, there were three civic involvement surveys (youth, adult, and parentYCI-NHES:1996, ACI-NHES:1996, and PFI/CI-NHES:1996. In the NHES:1999, civic involvement items were asked in the youth interview (Youth-NHES:1999). In the 1996 Civic Involvement surveys, samples of adults, and children in grades 6-12 and their parents were asked about sources of information on government and national issues, civic participation, and knowledge and attitudes about government. In addition, the Youth and Parent surveys asked about opportunities that youth have to develop personal responsibilities and civic involvement. The Youth-NHES:1999 repeated the YCI-NHES:1996 with some additional questions about community service activities. Sample sizes for the Civic Involvement surveys were: 9,389 for PFI/CI-NHES:1996, 8,044 for YCI-NHES:1996, 2,250 for ACI-NHES:1996, and 7,913 for Youth-NHES:1999. Household Public Library Use Survey (HHL-NHES:1996)In the 1996 Household and Library Use survey (HHL-NHES:1996), about 56,000 household were screened using an expanded screening procedure that collected demographic and educational information on all household members and included a limited set of items on household use of public libraries. Information about household use of public libraries included items regarding proximity to a public library, borrowing of materials, and use of the public library for schoolwork, children's activities, recreation, course taking, and job seeking. The sample size for the Household and Library Use survey was 55,708. Before-and After-School Programs and Activities Surveys (Parent-NHES:1999 and ASPA-NHES:2001)The Before-and After-School Programs and Activities survey was conducted in 2001 (ASPA-NHES:2001), although some items were first addressed in the 1999 Parent survey (Parent-NHES:1999). The survey asks parents of children in kindergarten through eighth grade about nonparental care arrangements children received before and after school during the school year. This includes care by relatives and nonrelatives, school-and center-based programs, scouting, sports and other extracurricular activities, and self-care. The ASPA survey includes questions about children's activities within care arrangements, parents' preferred types of after-school arrangements, and parents' ratings of the child's primary arrangement. Sample sizes for the Before-and After-School Programs and Activities surveys were: 12,396 for Parent-NHES:1999 and 9,583 for ASPA-NHES:2001.\nAdult Education Surveys (AE-NHES:1991, AE-NHES:1995, AE-NHES:1999, and AELL-NHES:2001 Adult Education surveys were conducted in , 1999(AE-NHES:1991, AE-NHES:1995, AE-NHES:1999, and AELL-NHES:2001. A survey on Adult Education for Work-Related Reasons will be conducted in 2003 (AEWR-NHES:2003). The Adult Education surveys ask persons 16 years of age and older about their participation in basic skills courses, English as a Second Language (ESL) courses, credential (degree or diploma) programs, apprenticeships, work-related courses, and personal development/interest courses. The Adult Education for Lifelong Learning survey (AELL-NHES:2001) also asked about less formal learning at work. Adults participating in programs or courses provided information about those programs or courses, including the subject matter, duration, cost, location and sponsorship, and employer support. In 1991 and 1995, nonparticipants in selected types of adult education were asked about their interest in educational activities and their perceived barriers to participation in adult education. Extensive background, employment, and household information were collected for each adult."}, {"section_title": "4 8", "text": ""}, {"section_title": "49)", "text": "planners, and decisionmakers when information could not be collected quickly through traditional NCES surveys."}, {"section_title": "School Crime Supplement to the National Crime Victimization Survey", "text": "NCES supports a supplement to the Bureau of Justice Statistics National Crime Victimization Survey (NCVS). The NCVS is a household survey that collects data on crime from a nationally representative sample of about 45,000 households. The School Crime Supplement is an additional set of items asked of all youth ages 12 through 18 in the households. The Bureau of Justice Statistics and the National Institute of Justice supported the first School Crime Supplement in 1989. Subsequent School Crime Supplements, supported by NCES, were conducted in 1995, 1999, and 2000. It was fielded again in 2001 and is scheduled for every 2 years thereafter. The focus of the supplement is on crimes committed against 12-to 18-year-olds in elementary and secondary schools. The School Crime Supplement contains items that will allow estimates to be tracked over time. The general topic covered by items in the questionnaire is school environment, including preventive measures employed by the school, the availability of drugs and alcohol, victimization in school, avoidance behaviors, weapons, and gangs."}, {"section_title": "NCES Items in the Current Population Survey", "text": "The Current Population Survey (CPS) is a monthly household survey conducted by the Bureau of the Census to provide information about employment, unemployment, and other characteristics of the civilian noninstitutionalized population. Since the mid-1960s, NCES has sponsored a supplement each October. The supplement routinely gathers data on school enrollment and educational attainment for elementary, secondary, and postsecondary education. Related data are also collected about preschooling and the general adult population. In addition, NCES regularly includes additional items on education-related topics, such as language proficiency, disabilities, grade retention, and student mobility. Beginning in September 2001, NCES, in conjunction with several other federal agencies, began cosponsoring an annual survey about household and individual use of computers and the Internet. Prior to this point, computer and Internet items had been occasionally added to various CPS monthly supplements, including the October supplements."}, {"section_title": "Other Activities 1990 Census Mapping Project and School District Data Book", "text": "The 1990 Census Mapping Project was initiated in 1988. Under this initiative, sponsored by NCES and coordinated by the Council of Chief State School Officers, all states participated in a program to develop school district maps. In the 1990 Decennial Census, the Bureau of the Census developed the Topologically Integrated Geographic Encoding and Referencing (TIGER) System, in which 10,000,000 census block boundaries were digitally encoded (to 6 decimal places). The boundaries of approximately 15,274 local education agencies, special education districts, Indian reservations, and military installations that have education activities within their boundaries were similarly digitized and encoded in the TIGER system, thus making it possible to convert the data from census blocks to education entities and produce tabulations. In 1992, under the sponsorship of NCES, the Census Bureau produced the 1990 Census School District Special Tabulation files using the basic record file of the 1990 Decennial Census data. These tabulations contain aggregate data describing attributes of groups of persons and households in school districts. With the exception of two data items (total population and total housing units), data were sample-based estimates. In many cases, the special tabulations were produced using a process of splitting census blocks to develop estimates for a school district. Files were used in combination with NCES data (i.e., CCD) and other Census Bureau data (i.e., School District Financial Survey) (F-33) to produce the School District Data Book. The School District Data Book is an electronic library containing social, economic, and administrative data for each of the 15,274 public school districts in the United States in 1990. The School District Data Book contains the most comprehensive demographic database ever developed for the nation's school system. The School District Data Book is contained on a set of 44 CD-ROMs. This large database of approximately 20 gigabytes of data (after reduction by data-compression techniques) provides up to 10,000 data items for each school district. The mapping features enable users to view maps of all individual school districts in the nation for the first time. The School District Data Book provides an effective way for the U.S. Department of Education and Congress to access, analyze, and interpret data from the 1990 Census School District Special Tabulations. Since this information can benefit state and local education agencies, as well as researchers, policy analysts, and administrators in a variety of other organizations, NCES implemented a program to meet these broader needs. The School District Data Book can be found on the Internet (http://nces.ed.gov/surveys/sddb). "}, {"section_title": "Decennial Census School District 2000 Project", "text": "In 1998, NCES initiated a project to specify the special tabulation of the 2000 Census and the 1999-2000 TIGER/Line files school district boundaries. Similar to the 1990 Census Mapping Project, the Decennial Census School District 2000 Project will provide social, economic, and demographic characteristics of children and public school districts in the United States by using the School District Special Tabulation files from the 2000 Census, the 1999-2000 CCD, and the 2000 School District Financial Survey (F-33). These products will be used to support research and policy analysis at the national, state, and individual school district levels. The NCES School District Demographics Web Site provides access to information about the Decennial Census School District 2000 Project. This online interactive Geographic Information System will enable users to directly access school district geographic and demographic data. "}, {"section_title": "Education Finance Statistical Center", "text": "The number and sophistication of policy requests to NCES for school finance information are constantly shifting and expanding. The Education Finance Statistical Center (EFSC) is designed to conduct research to improve the collection and reporting of education finance information. EFSC projects explore definitional, measurement, collection, reporting, and analysis issues related to education finance. The EFSC Web Site provides an \"umbrella\" under which NCES publications related to education finance can be found. The EFSC is currently conducting the following research activities: Examining whether at-risk, minority, and limited-English-proficient kindergartners have access to equal school and staff resources; Assessing public kindergarten staff compensation; Evaluating the effects of energy needs and expenditures on U.S. public schools; Exploring conceptual issues in measuring and reporting school district property wealth and tax rates; and Investigating possible inequities in school district financing. Among the projects NCES anticipates exploring in the next year are: How economic conditions influence school district revenuesIn partnership with The Condition of Education staff, this project seeks to develop an indicator that reflects the relationship between state economic conditions and school district revenues. States have generally increased state support for education, particularly for poor school districts. Poor school districts may be the most vulnerable to reductions or smaller increases in state funding when economic conditions become less favorable. Creation of Pseudo-Unified School DistrictsAnalyses of inequality in school district funding typically only examine those school districts that are \"unified,\" that is, are K-12. Some large states, such as Texas, California, and Illinois, have mixtures of elementary, secondary, and unified school districts. This project will attempt to match elementary and secondary school districts to create \"pseudo-unified\" school districts. If such districts can be created, analyses of the effect upon inequality measures will be undertaken. Assessing School District Financial ConditionCurrent NCES fiscal data collections do not permit the calculation of school district fiscal condition. This project will examine the options for designing a survey that can assess the financial condition of school districts in the nation."}, {"section_title": "56", "text": ""}, {"section_title": "Elementary and Secondary Handbooks", "text": "The elementary and secondary handbooks are intended to promote the use of a standard education vocabulary and to encourage the maintenance of accurate and complete data by schools, districts, state and federal agencies, and other educational organizations. The data terms included in the handbooks reflect the best judgment of individuals representing all facets of education concerning what data might be needed in making appropriate, cost-effective, and timely decisions about elementary and secondary education. The elementary and secondary handbooks are not data collection instruments. While they are careful to include data elements that can be used in meeting federal reporting requirements, many other practical data elements have been included as well. They are presented as a resource to those who plan and operate education information systems and others who are seeking comparable, technically acceptable data definitions."}, {"section_title": "Student Data Handbook", "text": "Accurate and comprehensive information is needed to make appropriate decisions about students within both public and private schools. These information needs are being met in an increasing number of instances by automated management information systems that allow data to be used in a variety of ways. These information systems are effective only to the extent that data are entered consistently according to established terms and definitions. This handbook focuses on the importance of consistency in how student data are defined and maintained at various levels within the education enterprisefrom schools (both public and private) and school districts to state and federal agencies. In addition to providing data terms and \"best practice\" definitions, the handbook suggests how data might be organized in a student data system to promote timely and effective use of student information for student services. This handbook is compatible with the Staff Data Handbook. The Student Data Handbook was revised in 2001 and is updated annually."}, {"section_title": "45", "text": ""}, {"section_title": "5?", "text": "Staff Data Handbook Information about staff has an important role in the efficient and effective functioning of the education enterprise. Staffing information is needed for daily administrative purposes and for making long-term program and policy decisions. Staffing information can also be used to monitor efforts to improve the education system. This handbook offers data terms and \"best practice\" definitions for elementary and secondary staff at various levels within the education enterprisefrom schools (both public and private) and school districts to state and federal agencies. Instructional, administrative, and support staff categories are included. The handbook makes suggestions about how data might be organized in a staff data system. The format and content of this resource are compatible with those of the Student Data Handbook. The Staff Data Handbook was revised in 2001and is updated annually."}, {"section_title": "A Pilot Standard National Courses Classification System for Secondary Education", "text": "This handbook attempts to establish a common terminology, descriptions, and coding structure for course information at the secondary level of education. Ideally, it is intended to facilitate electronic and other communication among education agencies, enable questions about course taking to be answered at the national level with greater ease and precision, and provide a common methodology for researchers carrying out transcript studies. The handbook presents a taxonomy that reflects a course's subject area, title, and level, as well as its credit and sequence (e.g., term, year) and several specific subject fields. In addition to providing course titles and \"best practice\" descriptions, the handbook makes suggestions concerning how information about courses can be maintained and reported."}, {"section_title": "Financial Accounting for Local and State School Systems", "text": "The Financial Accounting handbook defines the national standards for public education agencies to use in reporting financial data. The standards are intended for use by school districts in preparing their comprehensive annual financial reports that are submitted to state education agencies and by state education agencies in their reports to the Department. The purpose of the handbook is to ensure that education finance data can be reported in a comprehensive and uniform manner. The handbook gives an overview of accounting systems and provides guidelines on setting up a chart of accounts for public education agencies. Specific funds, programs, functions, and objects, and their accounting costs are defined and organized in accordance with generally accepted accounting principles. The handbook provides the framework for collecting and reporting school finance data that are comprehensive and comparable. Revisions of the Financial Accounting handbook began in 1999 and will incorporate recently updated standards of the Government Accounting Standards Board (GASB). The revised Financial Accounting handbook will be published in 2002. "}, {"section_title": "National Cooperative Education Statistics System", "text": "The National Cooperative Education Statistics System serves as the umbrella for a number of efforts to improve the quality, timeliness, and comparability of statistics used by education policymaking at all levels of government. This system was begun in 1988, under the mandate of the Hawkins-Stafford Education Improvement Amendments (P.L. 100-297). Soon after, NCES established the National Forum on Education Statistics, an appointed group representing national, state, and federal interests in elementary/secondary education data to address issues of data policy and develop ways of improving data systems. The system also includes training and technical assistance efforts, such as the weeklong Fellows Program and two major annual professional conferences. It has been the means for NCES to work in collaboration with state and local educators to develop guidelines that provide assistance in data collection, reporting, and both the technical and policy aspects of maintaining student records."}, {"section_title": "National Forum on Education Statistics", "text": "The National Forum on Education Statistics is broadly representative of elementary/secondary education at all levels of policy. It is composed of representatives from NCES, the 50 states, the District of Columbia, the 5 outlying territories, local education agencies, and professional associations and federal agencies involved in the collection and reporting of education statistics. The forum's primary mission is to work with NCES to improve the overall quality, timeliness, and comparability of education statistics across the nation. It puts into practice the goals of the National Elementary/Secondary Cooperative Statistics System, which was mandated by the Hawkins-Stafford Education Improvement Amendments of 1988 (P.L. 100-297) and continued in the 1994 Improving America's Schools Act. Under the direction of its Steering Committee, the forum maintains three standing committees: the National Education Statistics Agenda Committee; the Technology, Dissemination, and Communication Committee; and the Policies, Programs, and Implementation Committee. At present, the forum is addressing such important issues as facilitating uniform development in state education information systems; promoting the adoption of guidelines and common definitions that will foster best-practice procedures in many areas of data collection and reporting; and developing guidelines or handbooks for maintaining data about school finance, education facilities, education and administrative technology, and school crime, violence, and 47 discipline. The group is an active partner with the Department in efforts to reduce redundancy across data collections and thereby lessen the burden of reporting. In addition to these efforts, the forum is available to respond to specific requests from the Commissioner of NCES and to raise issues and make recommendations of its own. By bringing federal and state representatives together to work cooperatively toward improving the quality of education statistics, the forum plays an important role in determining the future of our nation's education statistics system. In 1990, the National Forum issued its first publication, Guide to Improving the National Education Data System. This guide contains 36 recommendations for improving the nation's elementary and secondary education statistics system. Other forum products include the SPEEDE/ExPRESS format (see description on next page) for transmitting student records electronically, guidelines for protecting the privacy of student records (with an accompanying brochure on this topic for parents), and reports on data needs in the areas of early childhood education and equity. The forum produced a format for reporting incidents of school crime, violence, and discipline (under revision), and handbooks for nontechnical policymakers to use in selecting education hardware, software, and networking services and security procedures (Technology @ Your Fingertips and Safeguarding Your Technology). The forum is a means for providing technical assistance to states and encouraging the development of more efficient data systems. It sponsors a state-to-state personnel exchange and recommends to NCES innovative data projects to be supported under contract with state education agencies. Reports of site visits assessing 33 state education agency data systems in terms of their potential for increased automation are also available. "}, {"section_title": "SPEEDE/ExPRESS: Electronic Interchange of Data for Education", "text": "The Electronic Interchange of Data (EDI) is the exchange of information in computer-processable format, covering such traditional applications as inquiries, payments, financial reporting, and education information. EDI and XML technologies are currently prevailing formats utilized for such exchanges of information. Hard-copy transmission of educational information is costly and time consuming. Through the electronic exchange of data, educational institutions, organizations, and agencies can reap the benefits of timely and accurate information, while avoiding costly error-prone data reentry. The translation and electronic transmission of this information can occur over networks in a matter of seconds. EDI works on the principle of standard formatting. A standard format for different applications exists that spells out what information is included, where it is to be located, and in what form. This makes a common language among computers possible. SPEEDE/ExPRESS has developed into a strong and focused single effort utilizing EDI and XML standards for elementary/secondary and postsecondary education. EDI and XML formats that have already been developed or are currently being developed include student transcripts, personnel information, education institutional profiles, financial aid information, and survey-specific requests. Among the direct and indirect benefits of exchanging documents electronically are reduction of paperwork and associated savings, faster transmission of critical educational administrative information, improvement in the reliability of information exchanged among educational entities, and more effective data management and reporting. "}, {"section_title": "Annual Meetings Conferences", "text": "The NCES Data Conference, held in Washington, DC, each year at the end of July, includes presentations and workshops on current NCES surveys and national issues related to education statistics. New products, such as data sets on CD-ROM or electronic handbooks, are demonstrated, and hands-on training in their use is often available. This conference issues an open call for proposals, and thus reflects a wide range of topics and presenters. There is no registration fee and it is open to the public. The NCES Web Site (http://nces.ed.gov/conferences) gives full information about registration. Each year NCES cosponsors a Management Information Systems (MIS) Conference with a host state. The purpose of this 3-day meeting, usually held in late February, is to encourage those who work with education MIS systems to share their innovations, developmental efforts, and issues with one another. A demonstration room is available to exhibit MIS software and programs in the public domain. Florida, California, Louisiana, and Texas have hosted past MIS conferences. The call for papers, issued in October or November of each year, and the conference announcement are posted on the NCES Web Site. "}, {"section_title": "Cooperative System Fellows Program", "text": "As part of its ongoing effort to increase cooperation among federal, state, and local education data collectors, and to improve the overall quality and timeliness of education statistics, NCES initiated the Cooperative System Fellows Program in 1990. Twice each year, Fellows are nominated by local, state, higher education, and library agencies across the country to convene in Washington, DC, for 1 week. The purpose is to provide the participants with an overview of the many NCES activities and to foster professional ties between education professionals and members of the federal statistical community. During their stay, the Fellows take part in a series of planned activities, including presentations by NCES staff on their major data collections, reports, and dissemination practices; projects to automate state and local data systems; and efforts to integrate existing data collections. In addition, Fellows explore their own professional interests and objectives. During the week, mentors selected from NCES staff work with the Fellows and lead discussions on various topics, answer questions, and offer guidance and advice. An effort is made to help the Fellows achieve their individual program objectives. The Fellows Program is held in May and November of each year and includes approximately 30 Fellows at each session. There is no charge and NCES reimburses participants' expenses. Telephone number: (202) 502-7394 E-mail address: mary.mccrory @ed.gov"}, {"section_title": "Plans for Elementary and Secondary Education", "text": "The core surveys of the NCES elementary and secondary program are the Common Core of Data (CCD), Schools and Staffing Survey (SASS), National Household Education Survey (NHES), and Private School Survey (PSS). Some topical supplements may be attached to these continuing surveys so that current data on key issues can be produced. The Fast Response Survey System (FRSS) collects additional topical data for policymakers within a short timeframe. Beginning with the 1998-99 school year, the CCD began collecting an expanded set of information intended to greatly enhance the survey's usefulness as a sampling frame and provide baseline statistics on several programs of interest. States were asked to identify charter and magnet schools, schools that participate in Title I programs, and the numbers of migrant and limited-English-proficient students receiving special services. This additional information, coupled with the CCD's previous content and unique identifiers for every public school and agency, will make it possible to explore ways of merging information from different surveys and to reduce the chances that the same information will be requested on more than one federal survey, reducing response burden. In 2002, NCES will be publishing dropout and graduation rates for more than 30 states. NCES will also release for the first time data files of school district-level financial statistics from the F-33 Survey of Local Governments. SASS was redesigned for its administration in 1999-2000. The sample design and data collection methodology remained the same, but a new conceptual framework shifted the focus of SASS from teacher supply and demand to measurement of teacher and school capacity (the objectives of recent school reform agendas). Teacher capacity is defined by measures of teacher quality, teacher career paths (including induction experience), professional development, and classroom instructional practices. School capacity is defined by measures of school organization and decisionmaking, curriculum and instruction, parental involvement, school safety and discipline, and school resources. Although the framework requires new item modules, important items from past surveys were retained for trend data. The Teacher Follow-up Survey will continue to be implemented 1 year after SASS. The NHES has become a source of many key indicators of the educational status of children. NHES:2001, which  NCES will continue to support the collection of educational enrollment and attainment on an annual basis in the October Supplement to the Current Population Survey (CPS). An additional topical component regarding select education characteristics, grade repetition, language and English proficiency, computer use, and disability will be collected on a periodic basis. The School Survey on Crime and Safety (SSOCS) is a new survey sponsored by NCES that will collect information from school principals on crime and safety in U.S. elementary and secondary public schools. SSOCS was first administered in the spring of 2000. However, in many ways it will cover the same topics addressed by the Principal/School Disciplinarian Survey on School Violence conducted by NCES in 1997. Thus, some information on changes over time will be available with the 2000 survey. After that initial survey, NCES plans to conduct SSOCS every 2 years to provide continued updates on crime and safety in U.S. schools. NCES is working on the Decennial Census School District 2000 Project. The project will use data from the 2000 census, 1999-2000 CCD, and the 2000 School District Financial Survey (F-33). The project will provide substantial social, economic, and demographic data on individual public school districts to data users, researchers, and policymakers. The FRSS will continue to identify and report on issues of current interest. Studies being prepared now include Adult Services in Public Libraries, Survey of Alternative Schools and Programs, and continuing surveys on access to technology and the Internet in elementary and secondary schools nationwide. The National Cooperative Education Statistics System will continue to serve as the vehicle for improving the elementary and secondary data system across the nation. Under the National Forum on Education Statistics, it will sponsor projects in individual states to adopt common data standards and definitions, and to develop more efficient ways of collecting and reporting data electronically. Federal-state forum task forces will complete data standards or guidelines in the areas of reporting data about school facilities, protecting the privacy of education staff records, sharing data among different agencies, and identifying key data elements in the area of school finance that are needed to produce comparable and useful education indicators.  1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 Common"}, {"section_title": "6,;", "text": "Schools and Staffing Survey (school year ending)  1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 National Household Education Survey  POSTSECONDARY AND ADULT EDUCATION Social, demographic, educational, and economic issues challenge postsecondary education today. Among the most critical are questions regarding access to postsecondary education for various populations, the effects of shifting enrollment patterns, the price of postsecondary education, student financing of postsecondary education, education outcomes, the long-range financial outlook for colleges and universities, demand for and supply of qualified faculty and staff, and job opportunities for graduates. The National Center for Education Statistics (NCES) program in postsecondary education provides statistical information used by planners, policymakers, and educators in addressing these issues. One major source of this information is the Integrated Postsecondary Education Data System (IPEDS), an annual series of surveys conducted by NCES that provides a variety of data on the nation's 9,800 public and private postsecondary institutions. Special studies of students, financial aid, postsecondary faculty, bachelor's degree recipients, and doctoral degree recipients complement IPEDS, as do surveys of the participation of the adult population in educational activities through the National Household Education Survey. In addition, postsecondary education transcript studies have been conducted in conjunction with the National Longitudinal Study of 1972, the High School and Beyond Study, the Baccalaureate and Beyond Longitudinal Study (see \"National Longitudinal Studies,\" chapter 6), and the Recent College Graduates Study. Another postsecondary longitudinal survey system, Beginning Postsecondary Students, also collects institutional and student data from postsecondary students over a period of several years (see \"National Longitudinal Studies,\" chapter 6)."}, {"section_title": "Integrated Postsecondary Education Data System", "text": "IPEDS, established as the core postsecondary education data collection program for NCES, is a system of surveys designed to collect data from all primary providers of postsecondary education. IPEDS is a single, comprehensive system designed to encompass all institutions and educational organizations whose primary purpose is to provide postsecondary education. The IPEDS system is built around a series of interrelated surveys to collect institution-level data in such areas as enrollments, program completions, faculty, staff, finances, and institutional price and student financial aid."}, {"section_title": "Data Collection Principles", "text": "The collection of IPEDS data from this diverse universe of institutions is based upon several principles. First, data elements identify characteristics common to all providers of postsecondary education. Within these data elements, specific values define characteristics of different types of postsecondary education providers. Second, the data elements and the component surveys in IPEDS, through which they are collected, are interrelated to avoid duplicative reporting and to enhance the analytic potential of the database. For example, enrollment data from one survey can be used in conjunction with data on degrees granted, faculty, or financial resources from the other surveys. Third, the surveys are compatible, but are adapted to meet the needs and characteristics of different sectors of postsecondary education providers. In general, postsecondary institutions granting baccalaureate and higher degrees provide more detailed data, while less data are requested from other institutions. This feature accommodates the varied operating characteristics, program offerings, and reporting capabilities of postsecondary institutions, while yielding comparable statistics for all institutions. Prior to 1993, NCES sampled the private less-than-2-year sectors. However, the Higher Education Act of 1992 mandated the completion of IPEDS surveys in a timely and accurate manner for all institutions that participate, or are applicants for participation, in any federal student financial assistance program authorized by Title IV of the Higher Education Act of 1965, as amended (20 U.S.C. 1094(a)(17)). Thus, beginning in the 1993 survey year, NCES began to survey in detail all postsecondary institutions that met this mandate. Institutions that were not eligible to participate in federal student financial aid programs were asked to complete only the Institutional Characteristics survey. Between 1993 and, NCES continually improved the IPEDS data collection instruments and the list of institutions (universe) surveyed. There was a concerted effort to match files with the Office of Postsecondary Education (OPE) to ensure full coverage of all institutions having Program Participation Agreements (PPAs) with the Department of Education. Currently, IPEDS identifies and categorizes institutions according to whether or not they have a PPA with the Department of Education and their degreegranting status. The IPEDS program was completely redesigned for the 2000-01 academic year when the data collection converted from a paper-based data collection to a fully Web-based data collection system. The universe of postsecondary institutions was divided into two basic groups: those institutions with PPAs and all others. Institutions that do not have PPAs may voluntarily complete the IPEDS online surveys, but there is no requirement to do so. In the near future, these institutions will be subject to a telephone survey to collect a minimum set of data items (Minimum Data Set (MDS)). Institutions with a PPA are required to complete IPEDS and are subject to extensive follow-up for nonresponse. Any institution that provides data is included on the IPEDS COOL Web Site."}, {"section_title": "70", "text": "The new Web-based system tailors the forms (screens) and data items for each institution based on a series of screening questions or institutional characteristics. Thus, public institutions automatically receive a different finance form than private not-for-profit institutions; 4-year schools that have graduate programs are prompted for graduate-level enrollment; and institutions that do not enroll full-time, first-time undergraduate-level students are not asked to complete information for either the Student Financial Aid or Graduation Rate components. All survey data are now collected using a Web-based system. Institutions may submit data in two ways: manual data entry or file upload. The survey data are requested at different times during the year. The schedule for the 2002-03 academic year is as follows: IPEDS attempts to minimize institutional respondent burden by coordinating data collection with state education agencies and other federal offices and agencies that regularly collect data from institutions. These coordinating efforts include: State agenciesIn many states, IPEDS institutional data are provided by the state higher education agency from data collected on state surveys. Alternatively, state agencies may extract data from IPEDS surveys rather than conduct their own surveys. Office for Civil Rights (OCR) Racial /ethnic compliance data are incorporated into IPEDS surveys and are provided annually to OCR. NCES and OCR cooperate on the collection of enrollment, completions, and staff data to fulfill the mandates of Title VI and Title VII of the Civil Rights Act of 1964. Equal Employment Opportunity Commission (EEOC) In 1993, NCES began collecting fall staff data for EEOC in much the same way that data are collected for OCR. Office of Vocational and Adult EducationThe Completions survey includes data in response to the Carl D. Perkins Vocational Education Act. IPEDS is also part of the Vocational Education Plan for Postsecondary Education (P.L. 98-524). Census Bureau and Bureau of Economic Analysis (BEA)The Census Bureau and BEA both use data collected through the IPEDS Finance surveys rather than collect these data on their own."}, {"section_title": "State occupational coordinating committees and career information systemsThe IPEDS Institutional", "text": "Characteristics survey incorporates many data elements required by state Career Information Delivery Systems (CIDS), thereby reducing or eliminating the need for these organizations to conduct their own surveys."}, {"section_title": "60", "text": ""}, {"section_title": "7.2", "text": "Institutions are also asked to provide the total number of first-time undergraduate students regardless of status (degree or non-degree seeking; first year or transfer in; full-or part-time). Graduation Rate SurveyData on the number of students entering the institution as full-time, first-time, degree-or certificate-seeking students in a particular year (cohort), by race/ethnicity and gender; number completing their program within 150 percent of normal time to completion; number transferred to other institutions; and number of students receiving athletically related student aid in the cohort and number completing within 150 percent of normal time to completion. Worksheets automatically calculate rates, including average rates over 4 years. This survey was developed to help institutions comply with requirements of the Student Right-to-Know Act. Employees by Assigned PositionData on the number of full-and part-time employees by occupational category, faculty status, and tenure status (if applicable); employees in medical schools are collected separately. This survey was first collected in 2001. Fall Staff Number of full-time faculty by racial/ethnic category, gender, contract length, and salary class intervals; number of other persons employed full time by racial/ethnic category, primary occupational activity, and salary class intervals; number of part-time employees by primary occupational activity, racial/ethnic category, and gender; and tenure of full-time faculty by academic rank and new hires by primary occupational activity, both by racial/ethnic category and gender. Beginning with the 1993 survey year, Fall Staff replaced the EEO -6 survey conducted by the EEOC. SalariesNumber of full-time instructional faculty by rank, gender, and length of contract; total salary outlay; and fringe benefits and number of full-time instructional faculty covered by these benefits. The survey became annual in 1990, but data were not collected in 2000. Prior to 2001, data were collected by tenure status. FinanceRevenues by source (e.g., tuition and fees, government, private gifts); current fund expenditures by function (e.g., instruction, research, plant maintenance and operation); physical plant assets and indebtedness; and endowment investments. Survey forms differ substantially for public and private institutions because of differences in accounting standards. Student Financial AidNumber of full-time, first-time, degree-seeking undergraduate students, total number of these students receiving financial aid, and average amount of aid received by type of aid."}, {"section_title": "Special Features", "text": "State Coordinator workshopsThese are conducted on an annual basis, usually in the spring. A full-day workshop is planned to provide IPEDS State Coordinators and other interested parties with up-to-date information on IPEDS, plans for the future, anticipated changes, and other issues of interest. This forum allows for exchanges of ideas and practices and a general sharing of information among the various state, federal agency, and educational association representatives. Regional workshopsThrough a grant to the Association for Institutional Research, IPEDS funds a series of regional workshops to provide institutional respondents with training on the new Web-based data collection. These are generally held in conjunction with state or regional association meetings or in various key cities across the nation to allow respondents to attend one close to their institution's location. College Opportunities On-Line (IPEDS COOL)In response to the Higher Education Amendments of 1998, NCES developed a Web site to provide up-to-date statistics on a broad range of postsecondary institutions for easy access by consumers. The site presents data on institution prices, financial aid, enrollment, degrees and awards conferred, accreditation, and types of programs that are offered by the institution. IPEDS COOL is designed to help college students, future students, and their parents understand the differences among colleges and how much it costs to attend college. The site also provides direct links to each institution's home page, campus crime statistics, student financial aid information, and various other postsecondary education Web sites. IPEDS Peer Analysis SystemThis feature enables a user to easily compare one institution of the user's choosing to a group of peer institutions by generating reports using selected IPEDS variables of interest. The user may create a group of peers or have the system create it. "}, {"section_title": "National Household Education Surveys Program (Adult Education Surveys)", "text": "The National Household Education Surveys Program (NHES) is the only general-purpose survey conducted by NCES to collect education data through a household-based survey. Historically, NCES has collected data from teachers, students, and schools through school-based surveys and from administrative records through surveys of school districts and state education agencies. As a household-based survey, the NHES addresses many issues in education that had not been addressed previously by other NCES data collection activities, such as early childhood care arrangements and education, children's readiness for school, parent involvement in elementary and secondary education, and adult participation in education outside of traditional postsecondary institutions. Full-scale NHES collections have been conducted in the spring of 1991, 1993, 1995, 1996, 1999, and 2001. Topical surveys on Adult Education and Lifelong Learning were collected in 1991, 1995, 1999, and 2001. In addition, a survey about the civic involvement of adults, the Adult Civic Involvement survey, was conducted in 1996. Surveys covering topics related to children from birth through 12th grade have also been conducted. See chapter 3, \"Elementary and Secondary Education\" for more details on these surveys The NHES will be conducted again in the spring of 2003 and 2005, and periodically thereafter. NHES:2003 will include two surveys: Involvement in Education and Adult Education for Work-Related Reasons, and Parent and Family."}, {"section_title": "National Postsecondary Student Aid Study", "text": "The National Postsecondary Student Aid Study (NPSAS) is a comprehensive nationwide study of students enrolled in less-than-2-year institutions, community colleges, 4-year colleges, and major 64 7,6 universities located in the United States and Puerto Rico. Undergraduate, graduate, and first-professional students who receive financial aid, as well as those who do not receive aid, participate in the NPSAS. The NPSAS collects information on student demographics, family income, education expenses, employment, education aspirations, parental demographic characteristics, parental support, and how students and their families meet the costs of postsecondary education. In addition to describing characteristics of students enrolled in postsecondary education, the results are used in part to help determine future federal policy regarding student financial aid. The first NPSAS was conducted during the 1986-87 school year. Data were gathered from institutional records on about 60,000 students at 1,100 colleges, universities, and other postsecondary institutions. About 43,000 students and 13,000 parents also completed questionnaires. During 1989-90, information from institutional records on about 69,000 students at 1,130 postsecondary institutions was collected. About 51,400 students and 16,000 parents also completed CATIs. During 1992-93, information from institutional records on about 77,000 students at 1,000 postsecondary institutions was collected. About 52,000 students and 12,500 parents were interviewed by telephone. The 1995-96 NPSAS had a smaller sample due to budget constraints. Institutional administrative records data were collected on about 60,000 students at 830 institutions. About 31,000 students were interviewed by telephone. In 1999-2000, institutional records data were collected on about 62,000 students (50,000 undergraduates and 12,000 graduate/first-professional students) at 1,000 institutions. About 44,500 students were interviewed by telephone. In 2004, NCES will combine the NPSAS and the National Study of Postsecondary Faculty (NSOPF) into the National Study of Faculty and Students (NSoFaS). About 80,000 students and 24,000 faculty and instructional staff are expected to participate. Results should be available in late spring/early summer 2005. These data provided information on the price of postsecondary education, the distribution of financial aid, and the characteristics of both aided and nonaided students and their families. Following each survey, NCES publishes three major reports: Undergraduate Financing of Postsecondary Education, Student Financing of Graduate and First-Professional Education, and Profile of Undergraduates in American Postsecondary Institutions."}, {"section_title": "78", "text": "Parent Interview (limited sample of some students/parents for NPSAS:87 through NPSAS:93 only) Parents' marital status, age, highest level of education achieved, income, amount of financial support provided to children, types of financing used to pay children's educational expenses, occupation, and industry. "}, {"section_title": "National Study of Postsecondary Faculty", "text": "The National Study of Postsecondary Faculty (NSOPF) was developed in response to a continuing need for data on faculty and instructors. An institution's faculty often determine curriculum content, student performance standards, and the quality of students' preparation for careers. Through their research, development, and public service activities, faculty members make valuable contributions to society. For these reasons, it is essential to understand who they are; what they do; and whether, how, and why they are changing. The NSOPF was designed to provide data about faculty to postsecondary education researchers, planners, and policymakers. The NSOPF is currently the most comprehensive study of faculty in postsecondary educational institutions."}, {"section_title": "67", "text": "The NSOPF contains data that can be applied to policy and research issues related to postsecondary faculty. For example, the NSOPF can be used to analyze whether the size and composition of the postsecondary labor force is changing. NSOPF data can also be used to analyze faculty job satisfaction and how it correlates with an area of specialization, how background and specialization skills relate to present assignments, and the relationship of academic rank and outside employment. Benefits and compensation can also be studied across institutions, and faculty can be aggregated by socio-demographic characteristics."}, {"section_title": "Survey of Earned Doctorates Awarded in the United States", "text": "This survey has collected basic statistics from the universe of doctoral recipients in the United States each year since the 1920s. It is conducted by the National Science Foundation and is supported by NCES, as well as several other federal agencies, including the National Science Foundation, National Endowment for the Humanities, the U.S. Department of Agriculture, and the National Institutes of Health. From the Survey of Earned Doctorates data, it is possible to determine whether the number of doctoral recipients is increasing or decreasing, by field of study. The various sources of financial aid for doctoral students can be assessed, as can the average time it takes to complete the degree. Future or present employment can be studied, which is useful to postsecondary institutions and research facilities. Trend data on who is receiving doctorates by sex, race/ethnicity, and other characteristics can also be analyzed."}, {"section_title": "e 6 82", "text": "The Survey of Earned Doctorates is available on the Internet (http://www.nsfgov/sbe/srs/ssed/start.htm). For more information on the Survey of Earned Doctorates, contact: "}, {"section_title": "Postsecondary Education Quick Information System", "text": "Policy analysts, program planners, and decisionmakers in postsecondary education frequently need data on emerging issues quickly. It is not always feasible for NCES to use its large, recurring surveys to provide such data due to the length of time required to implement large-scale data collection efforts. NCES established the Postsecondary Education Quick Information System (PEQIS) in 1991 to collect timely data on focused issues needed for program planning and policy development with a minimum burden on respondents. Recent survey topics include distance learning, remedial education, campus crime and security, finances, and accommodation of disabled students. In addition to obtaining information on emerging issues, PEQIS surveys are used to assess the feasibility of developing large-scale data collection efforts on a given topic or to supplement other NCES postsecondary surveys."}, {"section_title": "Other Activities National Postsecondary Education Cooperative", "text": "The National Postsecondary Education Cooperative (NPEC) is one of three cooperatives created by Congress and supported by NCES. NPEC is a voluntary partnership of governmental and nongovernmental providers and users of education data. Its mission is \"to promote the quality, comparability, and utility of postsecondary data and information that support policy development, implementation, and evaluation.\" NPEC consists of a Council with approximately 135 members representing agencies, organizations, and associations from all sectors of the postsecondary community, including public, not-for-profit, and for-profit institutions; state postsecondary agencies; state and regional organizations; national postsecondary associations; and federal offices with an interest in postsecondary education. Members are nominated to the Council by state agencies and postsecondary associations. Members serve a 3-year term, with one-third of the membership rotating each year. NPEC recently selected a new Executive Director, Brenda Albright, who will oversee the development of a new agenda for NPEC projects, direct the efficient management of the organization, and facilitate NPEC's visibility within the education community. NPEC also recently established a new Executive Committee that will work with NCES and the Executive Director to provide oversight to the substantive and operational functions of the Cooperative. In past years, NPEC activities have included a Delphi study to identify the future trends affecting postsecondary education, two invitational policy panels to discuss the data implications of definitions of access and technology-mediated instruction, and a collaborative effort with NCES on the IPEDS redesign activity. An ongoing project that is a guide to information about national postsecondary data sets can be found at: (http://nces.ed.gov/npec/answers). Other continuing activities focus on NPEC's five strategic areas: student outcomes, access, cost, finance and productivity, and data infrastructure and relationships. NPEC has established a Web Site within the NCES site (http://nces.ed.gov/npec) and has produced several publications, two videos, and an interactive \"Sourcebook\" on assessment information. Other products include the NPEC brochure; a quarterly newsletter, NPEC Notes; and a monthly e-mail note, \"NPEC In Touch,\" which is sent to members and alumni. "}, {"section_title": "NCES/State Postsecondary Education Coordination Network", "text": "The purpose of the Network is to represent the states' mutual interests in postsecondary data selection, collection, analysis, and utilization, and to provide feedback to NCES about its plans for data collection and related activities through a single formal organization or network composed of representatives from all the states, the District of Columbia, and Puerto Rico. Toward this effort, the Network facilitates cooperation and coordination between NCES and the State Higher Education Executive Officers (SHEEO) and other state postsecondary entities regarding national postsecondary survey data selection, collection, and related activities. The Network provides a vehicle through which NCES can disseminate information directly and quickly to the highest level postsecondary 73 education officials in the states, thereby facilitating the exchange of ideas and information on matters of mutual concern involving postsecondary education data collection and related activities. The Network also serves as an organization through which the states and postsecondary institutions can exchange technological expertise and current information and provide technical assistance regarding state-of the-art technologies for their own data collection and data exchange activities, as well as NCES data collection and data exchange efforts. Additionally, because of its relationship with the states, the Network is in a unique position to: 1) work with NCES in the development, dissemination, and testing of standard data definitions in published and electronic formats; 2) advise in the development and design of new surveys and data collection methodologies; and 3) provide support for a partnership between the states, postsecondary institutions, and the federal government in the implementation of the mission and activities of NCES. Project activities include meetings with the Network Steering Committee and an annual national meeting and IPEDS workshop with SHEEO Network representatives. This Network issues a quarterly technical report containing information about NCES and state activities, with a focus on selected issues of significance to the postsecondary community. It also provides an advisory service summarizing developing postsecondary education issues and related data needs. Additionally, the Network maintains a library service providing information about state and federal postsecondary education data collections. There is also a personnel exchange service that provides funds for staff of state higher education agencies to meet each other and share technical assistance information regarding their data collection and dissemination efforts. "}, {"section_title": "IPEDS Workshops", "text": "State Coordinator workshopsThese are conducted on an annual basis, usually in the spring. A full-day workshop provides IPEDS State Coordinators and other interested parties with up-to-date information on IPEDS, plans for the future, anticipated changes, and other issues of interest. This forum allows for exchange of ideas and practices, and a general sharing of information among the various state coordinators, federal agencies, and education association representatives. Regional workshopsIPEDS staff conduct regional workshops on an as-needed basis. These are generally held when new surveys (such as the Graduation Rate Survey) are implemented or when significant changes are made to the survey forms that warrant training of institutional respondents. Workshops are held in various key cities across the nation to allow respondents to attend one close to their institution's location. Attendees are provided with materials such as new survey forms, Guidelines for Survey Respondents, and frequently asked questions and answers to help them understand the changes and new requirements. Regional workshops were last held in 1993 (for all IPEDS surveys) and in 1997 (for the Graduation Rate Survey)."}, {"section_title": "86", "text": "Cooperative System Fellows ProgramIn 1990, NCES initiated the Cooperative System Fellows Program as part of its ongoing effort to increase cooperation among federal, state, and local education data collectors and to improve the overall quality and timeliness of education statistics. Twice each year, Fellows nominated by local, state, higher education, and library agencies across the country convene in Washington, DC, for 1 week. The purpose is to provide the participants with an overview of the many NCES activities and to foster professional ties between education professionals and members of the federal statistical community. During their stay, Fellows take part in a series of planned activities, including presentations by NCES staff on major NCES data collections, reports, and dissemination practices; projects to automate state and local data systems; and efforts to integrate existing data collections. In addition, Fellows explore their own professional interests and objectives. During the week, mentors selected from NCES staff work with Fellows and lead discussions on various topics, answer questions, and offer guidance and advice. An effort is made to help Fellows achieve their individual program objectives. The Fellows Program is held in May and November of each year, and includes approximately 30 Fellows at each session. There is no charge and NCES reimburses participants' expenses."}, {"section_title": "Postsecondary Handbooks", "text": "NCES develops, disseminates, and encourages the use of handbooks to promote commonality and consistency in the data elements and definitions that are used to define, measure, and report postsecondary education data. This activity is an important part of NCES efforts to improve the quality and comparability of education data. Handbooks have been an integral part of the NCES postsecondary program since the late 1960s. In 1966, NCES established a common language that higher education institutions could use to record and report on major fields of study. This language, codes from the Higher Education General Information Survey (HEGIS), evolved into the Classification of Instructional Programs (CIP) that encompasses not only the academic programs included in the HEGIS program codes, but vocational and occupational program codes as well. The CIP was implemented in 1986 with the beginning of IPEDS and revised in 1990. It forms the basis for the IPEDS \"Completions\" report. A revision of the 1990 CIP has been available since May 2002. In 1973, NCES published the Higher Education Facilities Inventory and Classification Manual. This manual, initially developed by a group of facilities experts, evolved through several versions and was issued and used with the approval of professional groups, state agencies, and institutional associations. Last published in 1974, the manual was widely used and adapted. In recognition of the fact that planning for and use of facilities had changed significantly, and many states and institutions were beginning to devise their own classification structures, SHEEO assembled a Working Group on College and University Facilities in 1989. The work of this group resulted in the 1992 Postsecondary Education Facilities Inventory and Classification Manual (FICM). The 1992 FICM provides a common framework and coding structure for use in collecting and reporting inventory data on postsecondary institution buildings and on the space within those structures, primarily rooms. The manual also suggests to institutions a pattern for compiling essential data on their physical facilities, and provides a set of common building definitions and room codes so that reported data are reasonably consistent and comparable across institutions and states. NCES has published the first handbook on faculty and staff in postsecondary institutions. The 1998 Human Resources in Postsecondary Institutions Handbook provides postsecondary institutions with coding structures, data element definitions, analytic conventions, and recommendations for developing and maintaining a central data file on the institution's faculty and staff that will be useful for resource and policy 75 analysis and planning at the institutional level. This handbook, as with all other NCES handbooks and manuals, was developed in conjunction with a technical panel of experts in the field of faculty and human resource issues and problems. One objective in developing this handbook was to provide institutions with the necessary tools to report high-quality data to the IPEDS Staff and Salary surveys, and to facilitate their participation in the NSOPF. The development of the Postsecondary Student Handbook is a cooperative effort among NCES, SHEEO, and the American Association of Collegiate Registrars and Admissions Officers. The primary objective of this handbook is to promote commonality and consistency in the data elements and definitions that are used to define, track, measure, and report postsecondary student data. The handbook identifies a comprehensive and uniform set of data elements, definitions, and coding descriptors to use in postsecondary student recordkeeping systems. The handbook also provides recommendations for standardizing the methods and practices by which data on students are collected, reported, and exchanged; suggests a framework for developing or upgrading student tracking systems; and identifies and promotes sound practices for institutional reporting to state and federal agencies. This handbook will be published in spring 2003. CIP:2000, the 1998 Human Resources in Postsecondary Institutions Handbook, and the Postsecondary Student Handbook will all be available as searchable databases on the NCES Web Site."}, {"section_title": "Plans for Postsecondary and Adult Education", "text": "NCES recently completed a major redesign of the IPEDS program, converting it from a paper-based system to a totally Web-based system. Changes in collection procedures, data elements, timing, and processing were phased in through the 2001-02 academic year. Part of the redesign focused on separate data collections for Title IV and non-Title IV institutions. The approximately 6,900 Title IV institutions are required to respond to the full set of IPEDS surveys according to the Higher Education Amendments of 1998. However, the non-Title IV institutions have no similar requirement. NCES has already identified 2,700 non-Title IV institutions and is planning an 18-month study to estimate the number of these institutions and the characteristics of the students they serve. This will be done through an area search followed by a telephone survey of the institutions identified through the area search. This study is called the IPEDS MDS (minimum data set) since institutions will be asked to provide a minimum number of data items."}, {"section_title": "88", "text": "IPEDS will continue to provide a sampling frame for other postsecondary surveys, such as the ongoing NPSAS and NSOPF. PEQIS will be used to collect data for addressing emerging and focused issues that the ongoing data collection systems are unable to provide. PEQIS surveys being planned or implemented include Distance Education, Students with Disabilities in Postsecondary Education, Faculty Workload, and Non-Credit Course Offerings. Some postsecondary institutions use an automated data system for a nationwide electronic records transfer system. The Standardization of Postsecondary Education Electronic Data Exchange developed a set of data elements and definitions in American National Standards Institute format to be used in the pilot electronic transfer of student records among postsecondary institutions. Data elements are included in five different areas: demographics, academic history, special programs and services, health, and test information. NCES is examining other applications for the electronic exchange of data among postsecondary institutions. The NHES has become a source of many key indicators of the educational status of children and adults. The 2001 NHES included the Adult Education and Lifelong Learning Survey. This survey was largely a repeat of the Adult Education Surveys done in detail in 1991 and 1995, and in brief in 1999. The 2003 NHES will include a survey with more focus on work-related adult education. The last cycle of the NSOPF occurred in the 1998-99 academic year. NSOPF:99 was limited to surveys of institutions, faculty, and instructional staff. It allowed for comparisons to be made over time and expanded existing topics surrounding faculty and instructional staff that have developed as critical issues since the first two studies. Expansion topics included the increasing use of part-time instructional faculty and staff at higher education institutions and their credentials for teaching; the decline of full-time tenure-track appointments as institutions explore possible alternatives to tenure; faculty's allocation of time to teaching versus research; measures of faculty workload and productivity; the presence of women and minority faculty in higher education institutions; and the effects, if any, of the removal of mandatory retirement for faculty and instructional staff. NSOPF:99 was also collected over the Internet for the first time. The fourth cycle of NSOPF will be conducted in 2003-04 and will make even greater use of Web technology. Meeting the challenges of maintaining current data and possibly establishing new data collection activities takes a cooperative effort among institutions, states, and NCES. As part of this effort, the NCES/State Postsecondary Education Coordination Network and NPEC will continue to facilitate coordination and the exchange of data, technology, and information between the states, postsecondary institutions, and NCES. Further, NPEC continues to strive to identify new trends in postsecondary education and emerging issues that have implications for data collection, reporting, and dissemination in order to facilitate the production of better data for better decisions. Continuing activities focus on NPEC's five strategic areas: student outcomes, access, cost, finance and productivity, and data infrastructure and relationships.  1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 Integrated National Study of  "}, {"section_title": "EducationContinued", "text": "Year of Data Collection (school year beginning) 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 National Household Education Surveycontinued  The National Center for Education Statistics (NCES) collects and reports information on the academic performance of the nation's students and assesses the literacy level of the adult population. NCES also participates in international assessments (see chapter 7, \"International Statistics\"). The congressionally mandated National Assessment of Educational Progress (NAEP) is the primary NCES assessment of what American elementary and secondary students know and can do in academic subjects. For more than 2 decades, NAEP has collected and reported information on the knowledge and skills of national and, since 1990, state samples of both age-and grade-representative populations in a variety of school subjects. NCES also collects data from students' high school transcripts. These data include courses students have taken as well as the grades they attained. These studies generally build on NAEP and other major survey studies to increase their analytical usefulness. Besides assessing student achievement, the educational assessment program at NCES also assesses the proficiency of adults in performing basic literacy and mathematical tasks through the National Assessment of Adult Literacy Survey. In 1992, NCES conducted a household-based literacy survey of adults aged 16 and over. This survey included the general adult population as well as adults in institutional settings such as prisons. High school transcript data have been used for a variety of assessment purposes. Most notably, such data have been used to monitor trends or patterns in curricular changes. The 2000 High School Transcript Study compared the course-taking patterns of students in 2000 with similar patterns in 1998, 1994, 1990, 1987, and 1982. Together with performance results in subject areas, the basic descriptive information about students, teachers, administrators, and communities collected systematically by NAEP from its surveys has been used to address the following four educational policy issues that are of concern to educators, policymakers, and researchers: Instructional practices: What instructional methods are being used and how do these relate to achievement? Students at risk: How many students appear to be at risk, in terms of achievement, and what are their characteristics? Distribution of teacher qualities among different student populations: What are the characteristics of teachers of various subjects that students are exposed to? Education reform: What, if any, policy changes are being made by our nation's schools? Over the past 30 years, NAEP has generated more than 200 reports spanning 11 instructional areas. It is the nation's only ongoing, comprehensive, and representative assessment of what American students know and can do. In the states, mathematics was assessed at grades 4 and 8, and science was assessed at grade 8 only. In 1997, the arts were assessed at the national level at grade 8. In 1998, reading and writing were assessed at the national level at grades 4, 8, and 12, and at the state level at grades 4 and 8. Civics was assessed at the national level as well. In 2000, reading was assessed at the national level at grade 4; mathematics and science were assessed at the national level at grades 4, 8, and 12, and at the state level at grades 4 and 8. In 2001, geography and history were assessed at the national level only, at grades 4, 8, and 12. In 2002, reading and writing were assessed at three grades nationally, and at the state level at grades 4 and 8. These assessments may involve about 500,000 students in over 10,000 schools at the national and state levels. In the long-term trend, main national, and main state assessments, background information is collected from students, teachers, and school administrators. This information provides the context within which the academic performance of major student groups can be evaluated. Data are available on such student characteristics as gender, race and ethnicity, level of parents' education, eligibility for the free or reducedprice lunch program, participation in Title Ito assist at-risk students, attendance at public or private schools, limited English proficiency, and presence of a disability. Characteristics of teachers include academic preparation and classroom practices. NAEP also reports on school characteristics, such as courses offered, availability of computers, participation of parents, and the existence of problems such as tardiness or violence. To maintain its reputation as \"The Nation's Report Card\" and to enhance its usefulness to the nation, NAEP has undergone a redesign of its program. For example, assessments now take place annually. Assessment of academic subjects is conducted on a more regular schedule than in the past. Reading and mathematics will be assessed every 2 years. Writing and science will be assessed at least every 4 years. Frameworks for these subjects will be developed to last through three assessments (i.e., 12 years). Other subjects, such as geography, history, the arts, and foreign languages, will be assessed in the intervening years. Streamlining NAEP's sampling scheme, data collections, and reporting schedule, while increasing the information value of the various subject-matter tests, will enable NCES to provide the nation an enriched, technically rigorous, and authoritative basis for making decisions about education."}, {"section_title": "User Guides", "text": "Interpreting NAEP Scales (April 1993) Overview "}, {"section_title": "Data Files", "text": "1994 Almanac Viewer (Reading, Geography, and History) (February 1996) 1994 National Assessment (September 1996) . "}, {"section_title": "High School Transcript Studies", "text": "The High School Transcript Studies are a group of studies, seven in total, that provide educational researchers and policymakers with information regarding current course offerings and course-taking patterns in the nation's secondary schools. In 1983, the National Commission on Excellence in Education (NCEE) released a report, A Nation at Risk, which recommended a minimum high school course of study. Since the NCEE report, there have been a number of critics advocating the strengthening of the high school core curriculum. Students have been encouragedthrough a reformed curriculumto increase the number of academic courses they take in English, mathematics, science, social studies, computer science, and foreign languages. The changes in student course-taking patterns across the past 2 decades are reflected in the results of the various transcript studies. The first study was part of the High School and Beyond (HS&B) first follow-up survey in 1982 (see chapter 6 for more information on HS&B). Transcripts were collected for the HS&B sophomore cohort of students who were seniors in 1982. In 1992, another transcript study was conducted in conjunction with the 1992 second follow-up survey from the National Educational Longitudinal Study of 1988 (NELS:88) (see chapter 6 for more information). The majority of the transcript studies were conducted in conjunction with the National Assessment of Educational Progress (NAEP). These transcript studies were conducted in 1987, 1990, 1994, 1998, and 2000 and provide additional information on the relationship between student coursetaking patterns and achievement as measured by NAEP. The 1987 High School Transcript Study collected transcripts for approximately 25,000 high school seniors who participated (as 1 1 th-graders) in the 1986 NAEP assessment. Subsequent transcript studies conducted in conjunction with NAEP collected over 20,000 transcripts per study from a nationally representative sample of students, most of which participated in the NAEP assessments that year. Transcript data are measures of student exposure to courses rather than measures of student learning since the studies do not include information on course content. The data collected by the transcript studies allow investigation of the relationship between course-taking patterns and academic performance. To ensure maximum compatibility of the various transcript studies, the procedures and formats used in previous studies for data editing, course coding, error resolution, and documentation were used for each subsequent transcript study. This consistency enables users to compare cohorts of students with a minimum of effort."}, {"section_title": "National Assessment of Adult Literacy Survey", "text": "Literacy assessments inform policymakers about the extent of skills in using printed information that adults need to function in society, achieve their goals, and develop their knowledge and potential. Recently, concern has mounted that inadequacies in literacy are preventing some Americans from exercising the rights and responsibilities of citizenship. The National Assessment of Adult Literacy (NAAL) survey provides an accurate benchmark for measuring the literacy capabilities of adults. The NAAL survey builds upon the previous 1992 National Adult Literacy Survey (NALS). There has been serious concern about the literacy level of the American workforce, as described in a number of national reports published since 1980, including A Nation At Risk, Toward a More Perfect Union, The Subtle Danger, Workforce 2000, The Bottom Line, and Literacy: Profiles of America's Young Adults. These reports have emphasized the need to increase our nation's standard of literacy in order to maintain our standard of living and to compete in the global market. This concern about literacy culminated in 1990, when the President and governors adopted six national education goals, including the following goal: \"By the year 2000, every adult American will be literate and will possess the knowledge and skills necessary to compete 87 99 in a global economy and exercise the rights and responsibilities of citizenship.\" The role of the NAAL survey is to provide the information needed to begin understanding our nation's literacy capabilities."}, {"section_title": "Plans for Educational Assessment", "text": "For the 21st century, NAEP is undergoing a full-scale redesign. In the 1980s and 1990s, NAEP was administered every 2 years. Beginning in 2000, NAEP returns to annual assessments, which means that considerably more subjects will be tested. In 2000, NAEP mathematics and science assessments were assessed in both grades 4 and 8 in the state assessment. Previously, state assessments never included both grades in two subjects. Beginning in 2003, reading and mathematics will be assessed every 2 years, and science and writing every 4 years (nationally at grades 4, 8, and 12, and in the states at grades 4 and 8). Also, new comprehensive assessments will be administered in foreign languages, world history, and economics. The long-term trend assessment (scheduled for 2004) will be updated while continuing to monitor trends from the past. These major changes are documented in a new calendar that identifies subjects to be tested from 2000 to 2012. These and other possible changes are being monitored constantly by outside panels of experts and citizens through such institutions as the National Academy of Sciences. Through this process, NAEP will endeavor to remain the nation's foremost instrument in measuring the academic skills of the nation's elementary and secondary school students. In addition to NAEP, NCES is working on the development of NAAL, a national assessment that will build on the 1992 NALS.  19961999200220032004Surveys 19881994 Reading"}, {"section_title": ")", "text": "The longitudinal studies program at the National Center for Education Statistics (NCES) was established to provide ongoing, descriptive information about what is occurring at the various levels of education and the major transition phases of students' lives. In this way, intervening processes can be studied. The program is comprised of three study areas: early childhood/elementary, secondary, and postsecondary education. Together, these studies capture critical information across the lifespan of individuals' development and education. The early childhood longitudinal studies examine children's early home, child care, and education experiences prior to formal schoolingthat is, birth through age fiveas well as during the early elementary years. These studies describe the influence of early experiences on children's success in school. The secondary and postsecondary longitudinal studies look at transitions and education experiences and their influence on educational and occupational attainment. These surveys provide for periodic examination of such attainment, as well as students' aspirations, attitudes, and motivations during the pivotal years before, during, and after middle school or junior high school, high school, and college. With extensive questioning over succeeding years, the longitudinal studies make it possible to make long-range comparisons between early learning environments and children's preparation for school, between early school experiences and later school success, and between what individuals expect and what actually occurs. Consequently, such studies are critical to understanding the processes by which early experiences influence education and, in turn, the processes by which education leads individuals to develop their abilities and roles in society. The National Longitudinal Study of 1972 (NLS-72) began with that year's high school senior class and followed them through 1986. The High School and Beyond (HS&B) study began with both the sophomore and senior classes of 1980. Four other longitudinal studies have also been conducted: the National Education Longitudinal Study of 1988 (NELS:88), which began with the eighth-grade class of 1988 and followed them through 2000; the Beginning Postsecondary Students (BPS) Longitudinal Studies of 1990 and 1996, the most recent of which started with postsecondary students who began their postsecondary education in 1995-96 and were followed in 1998 and 2001, and the earlier cohort that began in 1989-90 with follow-ups in 1992 and 1994; the Baccalaureate and Beyond Study that began with college seniors in 1992-93 who were followed in 1997 and will again be contacted in 2003, with a second cohort that graduated from college in 1999-2000 with a one-time follow-up in 2001; and the Early Childhood Longitudinal Study-Kindergarten (ECLS-K) Class of 1998-99, which began following a cohort of kindergarten children in 1998-99 and has completed five waves of data collection through 2002. A new longitudinal study, the Early Childhood Longitudinal Study-Birth Cohort (ECLS-B), began with a group of children born in 2001 and will follow these children into formal school."}, {"section_title": "Early Childhood Longitudinal Study-Birth Cohort", "text": "Parents, educators, health practitioners, and policymakers are seeking effective ways for caring for and educating children throughout early childhood. Researchers and practitioners searching for answers are turning to the critical years before formal schooling as a source of information and a place to start. Several factors have contributed to this research and policy focus on children's early care and education experiences before entering school, including: new research, such as that on early brain development, highlighting the significant growth and development occurring in the first 3 years; a 93 105 public awareness of the importance of children's early experiences for later school success; large numbers of working mothers and dual-employed families, resulting in children entering child care at earlier ages; and the increasingly diverse population of children entering school. Vital to any effort to improve the health, early care, and education for all of the nation's children is a research and data collection program that increases primary understanding of the dynamics that lead to differential school success. NCES, in collaboration with several health, education, and human services agencies, has embarked upon an ambitious new study on the early years before formal schooling. The ECLS-B will follow a national sample of children, born in the year 2001, from birth through first grade. The four key areas to be addressed by the ECLS-B are children's health status at birth and various points thereafter; children's growth and development in critical cognitive and noncognitive domains; children's transitions to child care and early childhood education programs, kindergarten, and beyond; and children's preparation for school. First, the relationship of children's early health to their later growth and development is of special interest to the ECLS-B. The study provides information on prenatal care and children's health status at birth and across the early childhood years, covering basic topics such as health insurance, nutrition, doctor visits, hospitalizations, and chronic health conditions (e.g., asthma, ear infections). Over time, the study will be able to analyze the potential connections between young children's health and their growth and development. Second, the ECLS-B follows children's growth and development during the critical years before school. In these early years, children are quickly achieving developmental milestones that build upon one another. The ECLS-B seeks to accurately describe children's physical, social, emotional, cognitive, and language development in relation to important influences in their lives prior to school entry. It then follows their progress during the first 2 years of schoolkindergarten and first grade. Third, children and adults are continually making transitions from one status to anotherfrom home to child care and to school. Most notably is the transition that occurs as young children go from being cared for exclusively by their parents to being cared for by other persons. For some children, this transition may occur shortly after birth; for others, their first significant experience with adults other than their parents in a regular care and educational setting may be when they enter school for the first time. The ECLS-B is especially focused on looking at these transitions and their impact on different groups of children and families defined by race/ethnicity, socioeconomic status, birthweight, language minority status, plurality (i.e., twins), and family structure (i.e., single-parent families and teenage mothers). Fourth, most children attend kindergarten before entering first grade. However, the nature of children's early experiences in and before kindergarten is quite variable, and the demands placed on children differ across programs. The ECLS-B examines children's preparation for school by prospectively studying the different characteristics of children, their families, and their out-of-home care and educational experiences leading up to and at school entry."}, {"section_title": "10?", "text": "nonresident biological fathers complete self-administered questionnaires designed to collect information about their roles in their children's lives. Direct Child AssessmentsChildren's participation in the study occurs with the full permission of their parents-guardians. Beginning at 9 months, children participate in activities designed to directly measure important developmental skills in the cognitive, social, emotional, and physical domains. The ECLS-B uses the Bayley Short FormResearch Edition. This instrument, designed specifically for the ECLS-B, is based on a smaller set of items from the Bayley Scales for Infant Development (BSID-II). It assesses children's gross and fine motor skills as well as their receptive and expressive language skills and emotion regulation. The Nursing Child Assessment Teaching Scale (NCATS) from the Nursing Child Assessment Satellite Training (NCAST) assesses the parent-child interaction for early precursors of cognitive and social skills. These interactions are videotaped and coded along several dimensions (e.g., mother responsiveness, cognitive growth fostering), providing rich information on early parent-child interactions. At the 9-month home visit, height, weight, and middle upper arm circumference are measured for all children. In addition, head circumference is measured for very low birthweight infants. The same measures are planned for 24 months, with the addition of a measure of attachment. Early Care and Education ProvidersWith the permission of the child's parents, individuals and organizations that provide regular care and/or education for a child are interviewed. Care providers and preschool teachers, like parents, represent a significant source of information on themselves (their backgrounds, teaching practices, and experiences), the children in their care, and children's learning environments. Much of the data needed to describe the structure of children's care arrangements and education programs, develop indicators of the quality of these arrangements and programs, and profile the background and experience of the persons caring for these children can only be reported accurately by the providers, teachers, and organizations themselves. Contacting children's care and education providers also opens up other data collection opportunities (e.g., collecting information about children's development from sources other than their parents). Children's child care providers are interviewed using computer-assisted telephone interviewing (CATI). This information is collected when the children are 24 months ofage and again at 48 months. Observations of children's child care settings are conducted in a sample of the arrangements attended by ECLS-B children. Teacher QuestionnairesAs the ECLS-B cohort enters kindergarten and first grade, their school teachers become valuable sources of information on one of the children's most immediate learning environments, the classroom. Teachers also represent important sources of information about themselves (e.g., their backgrounds, teaching practices, and experiences) and children's development, both cognitive and social. The plan is to use a subset of the ECLS-K teacher questionnaires (see the ECLS-K Web Site). School QuestionnairesOnce children enter formal schooling, school administrators provide information on the physical, fiscal, and organizational characteristics of their schools and on the schools' learning environments, educational philosophies, and programs. Again, the plan is to use a subset of the ECLS-K school questionnaires (see the ECLS-K Web Site). Information about the ECLS-B can be found on the Internet (http://nces.ed.gov/ecls). For further information on the ECLS-B, contact: In recent years, parents, educators, and policymakers have been reconsidering the ways young children are taught in schools and have been looking for more effective approaches to education. Several factors that have contributed to this research and policy focus on children's early school experiences include: an increased public awareness of the importance of children's early experiences; the changing nature of children's preschool and early school experiences; the increasingly diverse population of children entering school and the demands this places on schools; and the expanded role that schools are expected to play in supporting and nurturing development and learning. NCES has embarked on an ambitious study to provide a comprehensive and reliable data set that can be used to inform policies related to early and middle childhood education, defined as kindergarten through fifth grade. The 1998-99 ECLS-K, in which a cohort of kindergarten children is sampled and studied intensively over time, responds directly to the concerns decisionmakers, educational practitioners, researchers, and parents have about our nation's schools and American education. The three key issues to be addressed by the ECLS-K are children's transition to school, student performance in the early grades in literacy and numeracy, and the interaction of school, family, and community. First, the ECLS-K examines children's transition to school. Of particular interest to the study are the transitions that occur as young children go from being kindergartners to being first graders, and as they move from first grade to the later elementary grades. These transitions are an ongoing process mutually influenced by the child's characteristics, the family and school environments, and the demands, resources, and responses within both family and school settings. Therefore, these transitions may be quite different for children depending upon the characteristics of the setting and their experience in each one. Second, a major goal of the ECLS-K is to describe student learning and academic progress during the early school years. It begins by focusing on children's characteristics and experiences as they enter school, and seeks to describe ways in which these are related to different aspects of children, their families, and the kindergarten programs they attend. Then by closely chronicling the relationship between children's kindergarten experience and their school performance in grades 1 through 5, the study provides useful information on achievement differences between boys and girls, among minority groups, and among members of different socioeconomic groups as children pass through school. The study also provides useful data on when children begin to experience problems with their schoolwork and the circumstances surrounding these difficulties. It provides data on the longevity of these problems and on the responses of the children's families, schools, and teachers. Third, numerous factors influence children's school and other life outcomes, including the school, family, and community. The ECLS-K examines how the educational system prepares for and responds to children. It gathers information on how schools and teachers respond to the diverse backgrounds and experiences that children bring with them as they enter school for the first time. The ECLS-K also looks outward to the family and community in which children live by focusing on the resources of the family, the home environment, and the community that have a profound impact on children's success in school and provide the context within which schools must operate. The ECLS-K provides critical information on the roles that parents and families play in preparing for and supporting their children's education, and how families, schools, and communities interact to support children's education."}, {"section_title": "High School and Beyond", "text": "New education issues arose after NCES began its longitudinal study of the 1972 senior class. For example, declining test scores and minimum competency testing caused concern among parents and educators alike. The rate at which many students dropped out of high school before graduation was also a concern. Anxiety over access to postsecondary and vocational education sharpened the focus on the educational experiences of Hispanic and other minority youths. To examine these and other issues, NCES initiated a second longitudinal study, HS&B, to complement the first. HS&B studied the high school students of 1980. It attempted to collect the same types of data gathered in the NLS-72. However, the second study differed from the first in two significant ways. First, it addressed many newer issues of the educational process. Second, it included a sophomore cohort as well as a senior cohort. Adding the sophomore cohort made it possible to study high school dropouts and analyze changes and processes during high school. The base-year survey of HS&B and the follow-up surveys have addressed the issues of educational attainment, employment, family formation, personal values, and community activities since 1980. For example, a major study on high school dropouts used HS&B data to demonstrate that a large number of dropouts return to school and earn a high school diploma or an equivalency certificate. Other examples of issues and questions that can be addressed with HS&B data are: How, when, and why do students enroll in postsecondary education institutions? Did those who (while in high school) expected to complete the baccalaureate (BA) degree actually do so? How has the percentage of recent graduates from a given cohort who enter the workforce in their field changed over the past years? What are the medium-term effects of not completing high school in the traditional way? How do employment and earnings event histories of traditional high school graduates differ from those who did not finish high school in the traditional manner? Do individuals who attend college earn more than those who do not attend college? What is the effect of student financial aid? What percentage of college graduates are eligible or qualified to enter a public service profession such as teaching? How many enter the workforce full time in the area for which they are qualified? In what ways do public and private schools differ?"}, {"section_title": "1A5", "text": "The student questionnaires focused on individual and family background, high school experiences, work experiences, and future plans. Cognitive tests administered to students measured both verbal and quantitative abilities. Sophomore tests included brief achievement measures in science, writing, and civics, while seniors were asked to respond to tests measuring abstract and nonverbal abilities. The parent questionnaire elicited information about family attitudes, financial planning, and educational goals. The school questionnaire gathered information about enrollment, staff, educational programs, facilities and services, dropout rates, and special programs for handicapped and disadvantaged students. The teacher comment checklist provided teacher observations on students participating in the survey. The first follow-up of sophomores provided insights into the school dropout problem and the influence of the last 2 years of high school on student attitudes and aspirations. The second follow-up in 1984 included a Postsecondary Education Transcript Study of the senior cohort. The later follow-ups of the sophomore cohort made it possible to trace the consequences of dropping out, and the extent to which dropouts later return and complete high school. In brief, HS&B provides information on the educational, vocational, and personal development of young people as they move from high school into postsecondary education or the workforce and then into adult life. The initial study (NLS-72) laid the groundwork for comparison with HS&B. It recorded the economic and social conditions surrounding high school seniors in that year and, within that context, their hopes and plans. It has since measured the outcomes, while also observing the intervening processes. HS&B allows researchers to monitor changes by retaining the same goals, measuring the economic returns of postsecondary education for minorities, and delineating the need for financial aid. By comparing the results of the two studies, researchers can determine how plans and outcomes differ in response to changing conditions or remain the same despite such changes. Additional concerns of HS&B encompass issues that surfaced since NLS-72 began: How did the availability (or lack thereof) of student financial aid alter student plans for further education? Did middleincome families alter their attitudes toward postsecondary education? These questions, as well as concerns about declining test scores, youth employment, and bilingual education, were addressed, along with a host of others."}, {"section_title": "Components BASE YEAR (1988)", "text": "Student QuestionnaireFamily background items, interaction with parents regarding in-and out-of-school activities, educational and occupational goals, perceptions about self and school, participation in classes and activities, and self-reported grades. Four cognitive tests: reading, math, science, and history-government. Parent QuestionnaireSocial-demographic characteristics, participation in student course selection, longrange educational planning, in-and out-of-school activities, establishing home discipline and interaction with the school, family educational expenses, and sources of income for children's education. School Administrator QuestionnaireSchool characteristics: grade span, school type, enrollment and major program orientation, policies and practices, admission procedures and tuition, grading, testing and minimum course credits, gifted and talented programs, extracurricular activities, and school climate. Student characteristics: average daily attendance, migration, race/ethnicity, single-parent households, limited-English-proficiency classes, and special student services, such as remedial classes and job training. Teaching staff characteristics: size, race/ethnicity, salary, and degree."}, {"section_title": "1A9", "text": "Teacher QuestionnaireStudent information: personal characteristics, behavior, academic performance, attitudes, problems, and handicaps. Class information: homework assigned, use of instructional materials, choice of textbook-workbook, curriculum, and topical coverage. Teacher information: sex, race/ethnicity, age, experience, certification, degree, foreign language proficiency, in-service education, classroom preparation, parent contact, perception of school climate, and experience teaching gifted and talented children. FIRST FOLLOW-UP (1990) Student QuestionnaireSchool experiences and activities, plans for the future, language use, opinions about self, attitudes, religion, finances, and family composition. Four cognitive tests: reading, math, science, and history-government. Dropout QuestionnaireSame as Student Questionnaire, except school experiences and activities section includes questions about leaving school, grade at the time, and if the student returned to school. Teacher QuestionnaireStudent information: academic performance, behavior, homework, absenteeism, parental involvement, and language-minority status. Class information: enrollment, composition, homework assigned, class schedule, teaching materials, methods, and objectives. Teacher information: sex, race/ethnicity, subjects taught, and degrees held. School climate information: cooperation among staff, shared beliefs, and problems. School Administrator QuestionnaireSchool characteristics: grade span, enrollment, control of school, community location, calendar system, programs, facilities and services, and absenteeism. Student characteristics: race/ethnicity, single-parent homes, limited English proficiency, free lunch programs, busing, and 10th-grade dropouts. Teaching staff characteristics: meetings, departmentalization, chairpersons, fulltime teachers, salaries, race/ethnicity, and degrees. School admission policies and practices: grading structure, testing structure, or both; school programs; and school climate."}, {"section_title": "SECOND FOLLOW-UP (1992)", "text": "Student QuestionnaireSchool experiences and activities, age, social development, opinions about self, attitudes, occupational expectations and aspirations, money and work, language use, early graduate supplement, and school structure. Parent QuestionnaireFamily background, child's school life, parental behavior concerning student course selection, student educational outcomes, long-range educational planning, contact with child's school, family life, friends, activity in the community, child's future plans, postsecondary education aspirations, parent involvement, in-and out-of-school activities, family educational expenses, and sources of income for child's education. School Administrator QuestionnaireSchool characteristics: school environment and policies, total enrollment, grade span, school type, school activities, school programs and services, grading and testing stfucture, and school climate. Student characteristics: average daily attendance, race/ethnicity, single-parent households; and limited-English-proficiency classes and special student services, such as remedial classes and job training. Teacher staff characteristics: size, full or part time, salary, and degree. Teacher QuestionnaireStudent information: academic performance, behavior, homework, absenteeism, parent involvement, and language-minority status. Class information: enrollment, composition, homework assigned, class schedule, teaching materials, methods, and objectives. Teacher information: sex,"}, {"section_title": "BASE YEAR", "text": "NPSAS DataYear in school, major field of study, type and control of institution, attendance status, tuition and fees, admission test scores, financial aid awards, cost of attendance, student budget information and expected family contribution for aided students, grade point average, age, date first enrolled, level, major field of study, financial aid at other schools attended during year, other sources of financial support, monthly expenses, reasons for selecting the school they attended, current marital status, age, race/ethnicity, sex, highest degree expected, employment and income, community service, expectations for employment after graduation, expectations for graduate school, plans to enter the teaching profession, parents' level of education, income, and occupation. FIRST FOLLOW-UP B&B:93/94 and B&B:2000/2001Employment after degree completion, job search activities, expectations for and entry into teaching, teacher certification status, job training and responsibilities, expectations/entry into graduate school, enrollment after degree, financial aid, loan repayment/status, income, family formation and responsibilities, community service, undergraduate coursework, institutions attended, grades, credits attempted and earned, and academic honors earned. In addition, B&B:93/94 contains undergraduate transcript records."}, {"section_title": "SECOND AND THIRD FOLLOW-UP", "text": "B&B:93/97/03Employment history; enrollment history; job search strategies at degree completion (each new degree completed); career progress; current status in graduate school; federal and nonfederal aid received; additional job training; entry into, persistence in, and resignation from teaching career; teacher certification status; teacher career paths; income; family formation and responsibilities; community service; types and amounts of federal financial aid received; total federal debt accrued; and loan repayment status.  -up Studies Surveys 19981999200220032004 Early Childhood 1972 1973 1974 1976 1979 1986 National Longitudinal Study of 1972Study of 1980Study of 1982Study of 1984Study of 1986Study of 1992 High School and Beyond Seniors 1988 1990 1992 1994 2000 National Education Longitudinal Study of"}, {"section_title": "1988", "text": "Base Year and Years of Follow-up Studies (school year ending) 199019941996 Beginning "}, {"section_title": "INTERNATIONAL STATISTICS", "text": "Insights into the educational practices and outcomes of the United States are obtained by comparing them with those of other countries. Congress, in authorizing the National Center fof Education Statistics (NCES), recognized the importance of crossnational information by including it in the agency's mission. NCES carries out a variety of activities to provide statistical information comparing the educational experiences and trends in other countries to those in the United States. Through comparisons with other countries, it is possible to learn more about the status of education in the United States and to generate new ideas for improving American education. NCES plays a central role among organizations involved in collecting and interpreting international data and has created an International Activities Program within the Early Childhood, International, and Crosscutting Studies Division to coordinate NCES efforts in international education studies. NCES is actively involved with the Organization for Economic Cooperation and Development (OECD), based in Paris, France, and with the International Association for the Evaluation of Educational Achievement (IEA), based in Amsterdam, Netherlands. NCES, along with the National Science Foundation, also supports the Board on International Comparative Studies in Education at the National Academy of Sciences. The board discusses U.S. participation in international education studies and provides advice on ways to improve these studies. In addition, NCES works with the Office of the Under Secretary, U.S. Department of Education, on the statistics project for the Asian Pacific Economic Cooperation (APEC) Education Forum. There is a great deal of interest in the findings of international student assessment studies and in the development of education indicators that facilitate comparisons among national systems of education. This interest has been spurred by increased concern about global economic competition and the role education plays in the economy. International assessment studies provide answers to questions of how other countries educate their children and with what success. Such comparisons can lead to reexamination of our own teaching practices and challenge the conventional wisdom underlying them. The assessments not only compare the performance of American students with those of their peers in other nations, but can also provide insights into the factors that influence performance. The work that NCES conducts within the International Activities Program is designed to provide comparable indicator data about the activities and outcomes of educational systems and institutions in other nations. Such data can lead to improvements in accountability and policymaking. These data are increasingly relevant to policy formulation as the political, economic, and cultural ties grow among countries."}, {"section_title": "Studies and Activities 1999 Third International Mathematics and Science Study-Repeat", "text": "The 1999 Third International Mathematics and Science Study-Repeat (TIMSS-R), sponsored by the IEA, is a study of eighth-grade mathematics and science achievement in the United States and 37 other nations. It is a successor to the earlier Third International Mathematics and Science Study (TIMSS; currently known as \"Trends in International Mathematics and Science Study\"), conducted in 1995, and is part of a series of regular international assessments planned on a 4-year cycle. (Planning for TIMSS 2003 is currently underway.) However, unlike TIMSS, the 1999 TIMSS-R study focused on eighth-grade students only. TIMSS-R allows the United States to compare the achievement of its eighth-graders in the original TIMSS to the scores of its eighth-graders 4 years later in TIMSS-R. It also provides an opportunity for the United States to compare the relative performance of its fourth-graders in 1995 to the relative performance of its eighth-graders 4 years later in 1999. In addition, TIMSS-R allows for comparisons among nations on education-related contextual factors collected from schools, teachers, and students. Moreover, the United States sponsored three additional components of TIMSS-R that enrich our knowledge of education in an international context. TIMSS-R Benchmarking ProjectTwenty-seven states, districts, or consortia of districts throughout the United States participated as their own \"nations\" in this project, following the same guidelines as the participating nations. Participants were able to assess their comparative international standing and evaluate their mathematics and science programs in an international context. TIMSS-R Videotape Classroom StudyBuilding on the work of the first TIMSS videotape study of mathematics, the TIMSS-R Videotape Classroom Study examines national samples of eighth-grade mathematics and science instructional practices in seven nations. The study is designed to reveal nationallevel portraits of mathematics and science teaching practices that can provide a more detailed context for understanding mathematics and science teaching and learning in the classroom. National Assessment of Educational Progress/TIMSS-R Linking StudyA subsample of students taking the 2000 NAEP mathematics and science assessment also took the TIMSS-R assessment. This provides an opportunity to compare students' performance on NAEP to their performance on TIMSS-R, and allows for estimates of how states participating in NAEP 2000 would perform had they participated in TIMSS-R. Results from the TIMSS-R Benchmarking Project are used to check the results of this linking study. On its regular 3-year cycle, PISA will provide trend data in a major subject area every 9 years. As PISA develops, it is expected that additional areas of crosscurricular or general competencies will be assessed. For example, in 2003 an assessment of problem solving will be piloted. Questions that PISA helps address include the following: How do U.S. 15-year-olds perform in the subject areas covered by PISA in comparison to their international counterparts? What are the strengths and weaknesses of U.S. 15-year-olds in reading literacy, mathematical literacy, and scientific literacy? Are there significant differences across race, gender, or socioeconomic background in reading literacy, mathematical literacy, and scientific literacy as measured by PISA?"}, {"section_title": "Design/Components", "text": "PISA is designed to focus on 15-year-old students. In the United States, these are largely ninth-and 10thgraders. A nationally representative sample of 15-year-old students is asked to complete the PISA assessment and background questionnaires in each participating country. To assess the performance of students and to provide education-related contextual information to understand their performance, PISA includes the following three components: Assessment ItemsStudents are required to read passages; interpret charts, graphs, diagrams, or other documents; and answer questions related to them. Question types range from multiple-choice to extendedresponse. The objective of the assessment items is to determine whether students can reflect and think about the domain being assessed, rather than simply repeat knowledge they have learned. The focus of the assessment items will change with each cycle of PISA. Student QuestionnaireThe student questionnaire was developed to collect information on school and outof-school experiences of students, their attitudes toward learning, and other basic information considered important to interpreting the assessment results. School QuestionnaireA school administrator or someone knowledgeable about the school was asked to complete a questionnaire about the staff and its policies. PISA was designed through an intensive, collaborative process involving all participating nations. PISA brought together content and testing experts to develop the framework from which all PISA assessments are developed. Data collection for PISA 2003 in the United States will take place in spring 2003. Each participating nation was required to draw a nationally representative sample of 15-year-olds. 136"}, {"section_title": "OECD International Education Indicators Project", "text": "NCES has been working cooperatively with the member countries of the OECD since 1988 to develop an education indicator reporting system. The goal of the Indicators of Education Systems Project (INES) is to improve the comparability of education data across OECD countries and to develop, collect, and report on a key set of indicators of the condition of education in these countries. NCES chairs Network A, which develops indicators for student outcomes, and participates in other networks and a technical group, which develop indicators in other areas. The set of indicators includes measures of student enrollment and achievement, labor force participation, school and school system features, and costs and resources. The primary vehicle for reporting on these indicators is a report entitled Education at a Glance (EAG). EAG was first released in September 1992. An analytical volume was added to the series in 1996, and the two volumes continue to be released annually."}, {"section_title": "127", "text": ".1 In addition, NCES will continue its collaboration with foreign governments and agencies towards the development of international education indicators. In addition to the World Education Indicators Project a joint program of the OECD and UNESCO that gathers INES data from non-OECD countriesand INES, NCES is working with governments, organizations, and universities in the Western Hemisphere to develop an Indicators of the Americas program. .142"}, {"section_title": "/ 129", "text": ""}, {"section_title": "DATA ON VOCATIONAL EDUCATION", "text": "The National Center for Education Statistics (NCES) Data on Vocational Education (DOVE) system derives data about vocational education primarily from existing NCES surveys. Some of the most informative data in the DOVE system are high school student transcript data. In comparison to reports from states that categorize students as vocational using different definitions, high school transcripts indicate how many vocational education credits students earn. These data allow researchers to identify students who take different amounts and types of vocational education courses, and to examine the relationship between academic and vocational coursetaking. This method of obtaining data provides a more accurate and complete picture of participation in vocational education than can be obtained by other means. The DOVE system also uses data from NCES longitudinal studies to examine the economic and educational outcomes associated with participation in vocational education. DOVE is supplemented with data from other federal sources, including the Bureau of Labor Statistics (National Longitudinal Survey of Youth) and the Census Bureau (Survey of Income and Program Participation and Current Population Survey)."}, {"section_title": "LIBRARIES", "text": "Libraries represent an educational resource that is available to individuals regardless of age, social status, or educational background. In an effort to provide more complete information on this aspect of the education spectrum, the National Center for Education Statistics (NCES) initiated a formal Library Statistics Program in 1989. The first library survey was begun, however, in 1966 with the fielding of the Academic Libraries Survey as part of the Higher Education General Information Survey. This survey was fielded because an academic library was considered an essential component of a higher education institution. The first survey under the auspices of the Library Statistics Program (1989) focused on public libraries in response to a congressional mandate for NCES to establish a cooperative system for public library data. The Public Libraries Survey is the product of a cooperative effort among state library agencies, NCES, the Bureau of the Census, and the National Commission on Libraries and Information Science. In addition to the Academic Libraries Survey and the Public Libraries Survey, the Library Statistics Program has developed two additional library surveys: the School Library-Media Centers Survey in 1993-94 and the State Library Agencies Survey in 1994."}, {"section_title": "GENERAL PUBLICATIONS OF NCES", "text": "The National Center for Education Statistics (NCES) annually produces three major publications designed for general audiences: The Condition of Education, Digest of Education Statistics, and Projections of Education Statistics. In addition, NCES produces the Education Statistics Quarterly, which provides an overview of NCES work four times a year. These publications present statistics on a wide array of education topics. They are used in diverse ways by policymakers, researchers, and the general public. NCES produces other publications that draw upon a variety of data sources, such as Trends in Educational Equity of Girls and Women."}, {"section_title": "The Condition of Education", "text": "Efforts to improve education in America require reliable data on the condition and progress of education. When the original Department of Education was created in 1867, the law stated that it should \"gather statistics and facts on the condition and progress of education in the United States and Territories.\" NCES -currently carries out this mission for the Department of Education and, since 1975, has done so by publishing The Condition of Education, a mandated annual report submitted to Congress on June 1 every year. The Condition of Education presents statistical information, drawn from numerous data sources, in an indicator format that is designed to make such information meaningful and accessible for a general audience. An indicator format differs from traditional statistical tables in that the quantitative data presented are carefully selected to convey summary information (about conditions, functioning, performance, or trends) and to serve as diagnostic tools for policymakers. Similar to leading economic indicators (e.g., the gross national product or consumer price index) that track economic trends and signal weak or strong economic performance, The Condition of Education's indicators focus national attention on important aspects of the U.S. educational system. The Web version of The Condition of Education allows readers to access all indicators published since 2000. Both versions include supplemental information (e.g., statistical tables, standard errors, and supplemental notes) when needed for indicators. In addition, both versions include introductory essays in each of these six areas and a special focus essay. The 2002 special focus analyses examined private elementary and secondary schools and nontraditional postsecondary students. Recent editions of Projections of Education Statistics can be found on the Internet (http://nces.ed.gov/surveys/AnnualReports/reports.asp?type=projections). For more information on Projections of Education Statistics and projection methodology, contact: Debra E. Gerald Early Childhood, International, and Crosscutting Studies Division Annual Reports Program National Center for Education Statistics 1990 K Street, NW Washington, DC 20006 Telephone number: (202) 502-7341 E-mail address: debra.gerald@ed.gov"}, {"section_title": "The Education Statistics Quarterly", "text": "Objective, high-quality statistics are crucial for informed decisionmaking about educationwhether at the national, state, local, institutional, or family level. NCES developed the Education Statistics Quarterly as part of an overall effort to make reliable data on education more accessible to a variety of audiences. The first issue was published in April 1999. Each issue provides a comprehensive overview of all NCES publications and data products released each quarter. Published four times a year, each issue contains: a table of contents that provides brief descriptions of each article; very short NCES reports in their entirety; summaries of longer NCES reports (intended to be accessible to a broad audience that includes less technically oriented readers); boxed information that steers interested readers to full technical details (which are only a click away in the Web version); short descriptions of other NCES products, such as data releases, handbooks, and manuals; notices about training and funding opportunities from NCES; and an annual comprehensive index (published in the winter issue) of all NCES publications and data products by topic and keyword, as well as by author and NCES contact. In addition, each issue includes a featured topic, with two independent commentaries written by respected experts in the education research and policy communities. These independent perspectives on policy and data issues are intended to stimulate ideas and discussion in the field of education statistics. In each issue, the first of the two invited commentaries typically focuses on important policy implications of an NCES data set. The second commentary generally focuses on data and measurement issues, including the strengths and limitations of the data currently available, as well as actual or desirable plans for future surveys or analyses. The Education Statistics Quarterly is designed to make information from NCES readily available to a wide variety of users in an attractive and user-friendly format. By regularly distributing a compilation of short and summary pieces covering work done across all parts of the agency over a 3-month period, along with independent commentaries, NCES hopes to increase the visibility and usability of reliable education statistics. 158"}]