[{"section_title": "", "text": "Recent analyses of nationally representative samples of low-income infants and toddlers have revealed that these children are more likely to be cared for in home-based settings than in center-based settings (Halle et al., 2008;Iruka & Carver, 2006). Similar patterns have been found when looking at child care data within individual states (Lippman, Vandivere, Keith, & Atienza, 2008). However, the research base examining the indicators of quality in home-based settings is small (see Doherty, Forer, Lero, Goelman, & LaGrange, 2006, for a recent study), and has not differentiated between the features of quality that may be most important for children of different ages. Additional studies are needed to explore the factors within home-based settings that are important for low-income infants' and toddlers' developmental outcomes. Recent innovations in the study of child care quality have begun to focus on the specific aspects of quality and how they relate to the multiple domains of child development (Child Trends, 2009b). However, a first step in understanding the relations between specific facets of child care quality and domains of children's development is an understanding of what factors are associated with quality in the early care and education setting (Zaslow, Tout, & Halle, 2008). In addition, it is difficult to compare measures of global quality across home-based and centerbased settings because common environmental quality measures (such as the Family Day Care Environmental Rating Scale (FDCERS), Harms, Cryer, & Clifford, 1989; Infant/Toddler Environmental Rating Scale Revised (ITERS-R), Harms, Cryer, & Clifford, 1990) were not developed for this purpose. Consequently, the field needs a better understanding of which quality factors are important and consistent across center-based and homebased settings for supporting low-income infants' and toddlers' development. Previous theory and research suggest that improving the professional development of the early care and education workforce, as well as improving other quality features of the early care and education environment, are important for supporting children's development. For example, recent work supported by the Office of Planning, Research, and Evaluation (OPRE) has highlighted the importance of professional development of early childhood educators for supporting child care quality and child outcomes (Zaslow & Martinez-Beck, 2006), as well as the importance of identifying particular aspects of quality related to child outcomes (Burchinal et al., 2008;Child Trends, 2009a;Forry, Vick, & Halle, 2008;Johnson, Jaeger, Randolph, Cauce, & Ward, 2003;Wishard, Shivers, Howes, & Ritchie, 2003). One recent study demonstrated that measures of professional development, such as educational attainment and participation in training, predict differently to observational measures of child care quality in center-based and home-based settings (QUINCE, 2007). However, these analyses have not been carried out with nationally representative samples or in samples that are predominately low-income. Further work is needed to inform the field's understanding of how provider education and training are related to specific indicators of quality for low-income children in both home-based and center-based care. This brief examines how provider training and education are related to parent-and provider-reported indicators of quality in home-based and centerbased care for toddlers using data from a nationally representative sample of low-income children. The research addressed three research questions: What are the demographic characteristics that distinguish low-income families who use homebased versus center-based settings as the primary arrangement for their 24-month-olds? How do quality indicators differ in center-based versus home-based settings serving low-income children at 24 months of age? How do provider training and education predict other reported markers of quality, and do these relationships differ by type of setting? The first two questions were examined using bivariate analyses. The third question was examined using structural equation modeling. 2 We address differences between home-based and centerbased settings by modeling the relations between provider training and education and other markers of quality in the care setting separately for the two subsamples of children in home-based and centerbased care arrangements within the Early Childhood Longitudinal Study -Birth Cohort. 3 The differences in findings across these models are discussed.  demogrAPhic chArActeristics of low-income children in home-bAsed versus center-bAsed settings At 24 months of Age The proportion of low-income children using homebased and center-based care differs by race/ethnicity and birth weight status. There are no differences in terms of children's age, gender, or disability status with regard to the type of nonparental care children use primarily at 24 months of age. However, race/ethnicity distinguishes the type of nonparental care primarily used among low-income children at 24 months of age. Specifically, there are more non-Hispanic White low-income children in home-based care than in center-based care at 24 months of age, and there are more non-Hispanic Black low-income children in center-based care than in home-based care at 24 months of age (see Figure 1). Consistent with other findings in the literature, Hispanic children who are not in parental care are more likely to be in home-based than in center-based care at 24 months of age. In addition, more low-income children who are born at low or very low birth weight and are not in parental care are in center-based care (39%) than in home-based care (26%) at 24 months of age (see Table 1). Mother's education level does not distinguish the type of nonparental primary care arrangement low-income children are in at 24 months of age. The majority of low-income children in both homebased and center-based care have mothers who have a high school degree or less (see Table 1). Approximately 30% of low-income children in both home-based and center-based care have mothers who have completed some college. Low-income children in home-based care are more likely to have mothers who are employed either part-time or full-time than are their peers in center-based care. Over three-quarters of low-income children in nonparental care at 24 months of age have mothers who are employed; however differences by type of care setting were evident. Specifically, 79% of children in home-based care have mothers who are employed either full-time or part-time, compared to 70% of children in center-based care. Low-income children in home-based care are more likely to have mothers who are married than are their counterparts in center-based care. Fifty percent of low-income children in home-based care have married mothers, compared to 34% of low-income children in center-based care. Low-income children in home-based care have been in the provider's care for more months than have low-income children in center-based care. On average, low-income children in home-based care are in the provider's care for 14.6 months, compared to 6.9 months for children in centerbased care at 24 months of age (see Figure 2). This finding may reflect limited center-based care options for infants and toddlers prior to 24 months of age (Hofferth, Chaplin, Wissoker, & Robins, 1996)."}, {"section_title": "child cAre QuAlity indicAtors 4", "text": "As rePorted by PArents And Providers in center-bAsed versus home-bAsed settings serving low-income children At 24 months of Age Children in center-based care have providers who are more likely to have participated in training in the last 12 months and who have higher levels of education than children in home-based care. More than 80% of children in center-based care have providers who participated in training with an early Similarly, nearly two-thirds of children in centerbased care have providers who have completed some college or more, compared to one-third of children in home-based care (see Table 1). Child-to-adult ratios are higher, on average, in center-based settings than in home-based settings. Specifically, the average child-to-adult ratio is twice as large for low-income children in center-based settings as it is for children in homebased settings at 24 months of age (see Figure 3). More developmentally appropriate materials are found in center-based settings than in homebased settings. On average, center-based settings have more developmentally appropriate materials available to children than home-based settings. Language and literacy activities are more prevalent in center-based than in home-based settings, whereas participation in enriching outings is more prevalent in home-based than in center-based settings. Ninety-five percent of children in center-based settings at 24 months are provided with language and literacy activities (such as singing to children, telling children stories, or reading books) at least twice a day, compared to 72% of children in home-based settings at 24 months of age. In contrast, 27% of children in homebased settings participate in enriching outings (such as going to the zoo, library, or museum) in the last month, compared with 11% of children in centerbased settings (see Table 1). Children in center-based care settings have providers who are more likely to disagree than their counterparts in home-based settings with behavior-management practices that reflect a high level of control. Children in center-based care, on average, are more likely to have providers who disagree with statements that reflect strong control of the children in their care (for example, \"child misbehavior or breaking the rules will always be punished\" and \"the provider does not allow children to get angry with her\") than children in home-based care. Specifically, 59% of children in center-based care have providers who \"disagree\" or \"strongly disagree\" with controlling behavior-management practices, compared to 35% of children in home-based care (see Figure  4). Forty-five percent of children in home-based care have providers who respond \"neutrally\" on these same items, compared to 29% of children in center-based settings (See Figure 4). This finding may reflect differences in the providers' level of education within home-based versus center-based settings. As noted above, children in center-based settings are more likely than children in homebased care to have providers who had completed at least some college. Furthermore, children in center-based care, compared to children in home-based care, are more likely to have providers who have attended training with an early childhood focus in the previous 12 months. These differences in education and training may translate into providers who are better informed about child development and appropriate behaviormanagement practices. Further analyses exploring this possibility are warranted.  Figures above chart the proportion of home-based and center-based providers who reported that they strongly agreed, agreed, disagreed, strongly disagreed, or felt neutral about controlling behavior-management practices. Figures above chart the proportion of home-based and center-based providers who reported that they strongly agreed, agreed, disagreed, strongly disagreed, or felt neutral about controlling behavior-management practices. differences in the relAtionshiPs Among Provider trAining And educAtion And other rePorted indicAtors of QuAlity in home-bAsed versus center-bAsed settings used by low-income children At 24 months of Age Provider training predicts more indicators of quality than provider education in home-based settings. Additionally, provider training and provider education predict different indicators of quality. Children with home-based providers who attended early childhood development training in the last 12 months tend to be in settings with a larger child-to-adult ratio (that is, more children per adult), more developmentally appropriate materials, and more language and literacy activities than children with home-based providers who did not attend such trainings in the last 12 months (See Figure 5). For children in home-based settings with providers who did not attend training in the past 12 months, the average ratio is 1.93 children per provider, whereas for children in home-based settings with providers who did attend training, the average ratio is 3.07 children per provider. In addition, the average index score of developmentally appropriate materials is 5.39 for children in home-based settings with providers who did not attend training in the past 12 months, compared to 6.57 for those with providers who did attend training. Children with home-based providers who attended training are also 23% more likely than children in homebased care whose providers did not attend training to be offered at least two language and literacy activities twice a day (see Table 2). Children whose home-based providers had a high school degree or less have providers who are more likely to endorse controlling behavior-management practices than children whose home-based providers had a bachelor's degree or more (see Table 1). In addition, children whose providers had less than a high school degree are 25% less likely than children whose providers had a bachelor's degree or more to be provided at least two language and literacy activities twice a day (see Table 2). Provider training and education predict fewer indicators of quality in center-based settings compared to home-based settings. 5 Provider training and education also predict different indicators of quality in center-based settings compared to home-based settings. Children with center-based providers with less than a high Figure 5. Associations between Provider Education and Training and Reported Markers of Child Care Quality for Children in Home-Based Care Figure 6. Associations between Provider Education and Training and Reported Markers of Child Care Quality for Children in Center-Based Care school degree tend to be in settings with higher child-to-adult ratios than children with centerbased providers with a bachelor's degree or more. Specifically, children with center-based providers with less than a high school degree are in centers with a child-to-adult ratio of 4.47, whereas children with center-based providers with a bachelor's degree or more are in centers with a child-to-adult ratio of 3.75. In addition, children with center-based providers who attended early childhood education training in the last 12 months are in settings that provide more enriching outings than children with center-based providers who did not attend training (see Figure  6). Specifically, children with center-based providers who attended early childhood education training in the last 12 months are 13% more likely to be offered enriching outings than children with center-based providers who had not received such training in the past 12 months (see Table 3)."}, {"section_title": "conclusions And Policy imPlicAtions", "text": "Low-income families who use home-based versus center-based care for their 24-month-olds differ in a few noteworthy ways. Low-income families who use primarily home-based care for their 24-month-old children are more likely than families who primarily use center-based care to be non-Hispanic White or Hispanic, to have an employed mother in the household, and to have a mother who is married. They are also likely to keep their children in this care arrangement for a longer period of time. The finding that there are more children with unemployed mothers in center-based care suggests that centerbased care may be used for purposes other than employment support among low-income familiesfor example, it may be used to support children's development (Tout, Zaslow, Papillo Romano, & Vandivere, 2001). Two alternative explanations are also feasible. Either children of unemployed mothers may be in center-based care while their mothers are in school or training, or children of unemployed mothers, who are more likely to be at risk, may participate in Early Head Start or other center-based early intervention programs. The findings reported in this brief also indicate that providers' professional development is related to more indicators of child care quality in home-based settings than in center-based settings. Home-based providers who have availed themselves of early childhood training in the past 12 months are more likely than their peers who have not engaged in such training to provide cognitively stimulating materials and language and literacy activities to low-income toddlers. Home-based providers who have achieved a higher level of educational attainment than their peers are more likely to engage in language and literacy activities and are less likely to endorse highly controlling behavior-management practices. For center-based providers, there were fewer associations. In particular, center-based providers who have obtained early childhood training in the past 12 months provide more enriching outings than their peers who have not obtained training, and center-based providers who have achieved higher levels of educational attainment than their peers have lower (i.e., better) child-to-adult ratios. Few home-based providers took part in early care and education training in the past 12 months. Previous research has found that home-based providers who engage in more education or training opportunities have characteristics that are different from home-based providers who do not pursue professional development. As mentioned above, differences in early childhood training may be associated with being more or less informed about child development and developmentally appropriate behavior-management practices. While this hypothesis needs further exploration, we do know that early childhood provider training is associated with aspects of quality in early care and education settings (Bordin, Machida, & Vamell, 2000;Burchinal, Howes, & Kontos, 2002;Clarke-Stewart, Vandell, Burchinal, O'Brien, & McCartney, 2002;Raikes, Raikes, & Wilcox, 2005). Fewer associations were found between provider training and education and other indicators of quality within center-based settings. One plausible explanation is that there is constrained variability among professional development indicators in such settings resulting from varying licensure requirements. For example, home-based providers have fewer requirements than center-based providers for entering the field (that is, preservice qualifications for becoming licensed) and for ongoing training once they become licensed (National Child Care Information Center, 2006, 2007Witte & Queralt, 2006). Thus, home-based providers who receive training may be highly motivated to obtain information about child development. Further analyses would need to examine differences in home-based care provided by relatives and homebased care provided by nonrelatives. When designing quality initiatives or guidelines to support quality and child outcomes, it is of great benefit to understand the characteristics of various settings and build on strengths inherent in each environment. The findings presented in this brief indicate that home-based settings and centerbased settings have distinctive strengths. For example, home-based settings used by low-income families with 24-month-old children tend to have lower (i.e., better) child-to-adult ratios than centerbased settings, whereas center-based settings are more likely than home-based settings to provide language and literacy activities at least twice a day. Overall, these findings demonstrate the need to give careful consideration to the meaning of quality across home-based and center-based care for low-income toddlers, and suggest that policies or initiatives aimed at promoting professional development opportunities, especially among home-based providers, may benefit low-income children in their care. This knowledge is timely because quality initiatives are actively being developed at the state level. However, additional information is needed to fully inform quality initiatives. For example, policy makers may want to consider how to obtain quality information about programs in efficient and cost-effective ways. Further work is also needed to identify strategies to engage home-based providers in professional development activities. Additionally, we need to further examine the effects on child outcomes of more nuanced measures of provider education and training (such as going into more depth on factors such as content, dosage, and quality of the training)."}, {"section_title": "technicAl APPendix vAriAbles Provider Education and Training", "text": "The child care providers' self-reported education level was coded into four categories: less than high school, high school/GED completion, some college, and bachelor's degree or more. The reference category for analyses was attainment of a bachelor's degree or more. Provider self-report of whether or not they obtained early childhood education training in the last year was coded as a dichotomous variable with (1) indicating that training was received and (0) indicating that no training was received in the last 12 months."}, {"section_title": "Structural Environment", "text": "For center-based and home-based settings, the parent/most knowledgeable caregiver was asked how many children were usually cared for in one group at one time and how many providers usually cared for the focal child in the care setting. Based on this information, a child-to-adult ratio was calculated. Four variables were used to develop an index of developmentally appropriate materials. These variables were recoded to use categorical response options (0 = none, 1 = 1 to 10, 2 = 11 to 30, 3 = > 30) to reflect the number of records, books, soft toys, and pull toys available in the care setting as reported by the care provider. The recoded variables were summed to create an index score if 75% of the data was not missing. Thus, the developmental materials index had a possible range of 0 to 12."}, {"section_title": "Process Indicators", "text": "Five variables assessing providers' perception of the degree to which various activities were a hassle, each scored on a three-point scale ranging from no problem (0) to big problem (2) were used to develop the hassle index. Activities assessed were: cleaning children's messes, having children underfoot, needing to change plans because of unexpected children's needs, cleaning children's clothes, and keeping constant watch over a child. The recoded variables were summed to create an index score if 75% of the data was not missing. Thus, the Hassle Index had a possible range of 0 to 10. A single indicator of provider warmth was created from providers' reaction to the statement \"I am easygoing and relaxed with child.\" The responses categories ranged from strongly disagree (1) to strongly agree (5). Finally, two variables were used to create an index for provider control. These variables were: child misbehavior/breaking rules will always be punished and provider does not allow children to get angry with her. Each of these variables was coded into a five-point scale ranging from strongly disagree (1) to strongly agree (5). The Control Index ranged from 2 to 10 with higher scores indicating more controlling attitudes."}, {"section_title": "Cognitive Stimulation", "text": "Three variables measuring the frequency with which child care providers reported singing to children, telling children stories, or reading books to children were used to develop a language/literacy stimulating activities index score. Due to the negative skew of this variable, this index score was converted to a dichotomous variable so that providers who engaged in all three of these activities at least three to six times a week or two of these activities every day were coded as (1) and providers who offered fewer language/literacy activities were coded as (0). A dichotomous enriching outings variable (1 = yes, 0 = no) indicated whether the provider brought the children in his or her care to the zoo, library, or museum in the last month."}, {"section_title": "Maternal Characteristics", "text": "A number of maternal characteristics were included in the model as covariates. Maternal education was coded into four categories (less than high school, high school/GED completion, some college, and bachelor's degree or more), with bachelor's degree or more as the reference category. Maternal employment was coded (1) if the mother worked full-or part-time and (0) if she was not employed."}, {"section_title": "Child Characteristics", "text": "Child characteristics included whether the child was reported by his or her parent to have a disability (1 = yes, 0 = no). Health conditions included in the definition of disability ranged from severe conditions (e.g., blindness, hearing loss, limited mobility) to less severe conditions (e.g., food allergies, motor or speech delays). Child gender was coded (1) for female and (0) for male. The birth weight of the child was coded into three categories (very low birth weight, low birth weight, and normal birth weight). Normal birth weight was used as the reference category. Parental perception of how difficult the child was to raise from the 9-month data wave was coded on a five-point scale ranging from (1) not at all difficult to (5) very difficult. Finally, the provider's report of how long he or she had cared for the focal child in months was included as a continuous variable.  "}]