[{"section_title": "Abstract", "text": "Wetlands provides important ecosystem services. Despite increasing recognition for their importance as a natural resource, wetlands are continuously facing a high risk of loss and degradation. Geographically isolated wetlands (GIWs) and headwaters are most vulnerable. They are temporary water ways with relatively small size. They can be easily filled to support other uses without permits and generally unprotected under the legal framework in the US [US EPA, 2015]. However, there is increasing pressure to consider cumulative influence of certain types of GIWs on downstream water. While debates on protecting temporary waterways continue, improving understanding on the wetland hydrology and stream-wetland connection is crucial. This requires reliable information to update the status and changes on wetlands and rapid assessment tool to investigate the strength and frequency of the wetland connectivity to other water bodies.\nThe U.S. Fish and Wildlife Service (US FWS) provides information on the extent and status of wetlands, through National Wetlands Inventory (NWI) [Cowardin & Golet, 1995] . The NWI is a spatial dataset that features wetlands and deep water habitats in consistent standardized ecological classification. However, the NWI, similar to other regional land use maps, is a categorical map. It does not provide information on inundation extent. Inundation is highly dynamic and can vary remarkably time to time, in response to multiple drivers and the local hydrological condition. It is a key factor controlling the ecological functioning of a wetland."}, {"section_title": "", "text": "In this study, we first demonstrated a practical and effective regional framework to develop long-term wetland inundation record. Using Landsat time records and airborne Light Detection and Ranging (LiDAR) intensity data, we generated a set of temporally consecutive maps of subpixel water fraction (SWF). The SWF maps indicate the percent of surface water within every 30-m Landsat pixel at an annual time basis over 1985-2011. They can provide crucial information on change dynamics and inundation extent of wetlands. When the mapping was demonstrated for the Coastal Plain of the Chesapeake Bay Watershed (CBW), comprehensive accuracy assessments of the SWF maps resulted in an estimated root mean square error (RMSE) of 7.78% for open water area. Moreover, a separate accuracy assessment targeting inundation in wetlands (i.e. presence or absence of water) yielded an overall accuracy of 93%. These results indicated that Landsat data can be calibrated to accurately extract long-term water information at the regional scale.\nWe then demonstrated how SWF maps and NWI can be used to assess the cumulative impacts of headwater wetlands on downstream water, and how such data could assist us to overcome the challenges in modelling wetland hydrology and assessing the hydrological connection to downstream water at the local landscape level. The study was conducted on the coastal catchment in the upper region of Choptank River in CBW. The study area included a dense network of wetlands, which made up for ~ 30 % of the catchment area in aggregate. When assessed at the local scale, it was evident that the SWF maps showed inundation changed in response to the weather variability, and the change trend was consistent with daily stream flow (r = 0.81; p-value < 0.01) and base flow (r = 0.57; p-value < 0.1). Furthermore, the change patterns followed the characteristics of the hydrological regimes (i.e., hydroperiod, the seasonal variation of inundation) described by NWI. The catchment-scale, cumulative impacts of GIWs was further investigated using the catchment scale simulation model, Soil and Water Assessment Tool (SWAT), with improved wetland extension. Results showed significant, cumulative, catchment-scale hydrological impacts of GIWs. GIWs changed the partitioning of precipitation between actual evapotranspiration (AET) and stream flow, and the major transport pathway of water delivery into the stream flow. Wetland dominated catchment produced lower AET, but maintained higher streamflow mainly delivered by the groundwater. This study demonstrates the evolution of mapping and monitoring wetlands using remote sensing, and the progress toward modelling wetland function using improved water information and a catchment scale model."}, {"section_title": "Keywords:", "text": "Wetland classification, spatial data, remote sensing, inundation, wetland modelling 22nd International Congress on Modelling and Simulation, Hobart, Tasmania, Australia, 3 to 8 December 2017 mssanz.org.au/modsim2017"}, {"section_title": "INTRODUCTION", "text": "Wetlands are unique ecosystems where terrestrial and aquatic habitats co-exist [Mitsch & Gosselink, 2007] . Due to the semi-aquatic nature, wetlands are extremely productive and provide valuable ecosystem services. In the Mid-Atlantic Region (MAR) of the US, the ecosystem values that wetlands provide for regulating agricultural runoffs and improving water quality are becoming more recognized. Nutrients and sediments from intensified cropping are the major causes for declining water quality within the Chesapeake Bay and coastal water ways. This coastal catchment is characterized by flat topography, and contains a dense distribution of inland wetlands. Most commonly found wetland type is depressional wetlands, known as Delmarva Bays, and they are referred to as geographically isolated wetlands (GIWs). They lack persistent surface water connections to the downstream water and they are typically small in size. Because of their lack of persistent hydrological and biogeochemical connectivity with surrounding landscape via surface water and their relative small sizes, their ecological value to regulate agricultural runoffs, has been largely overlooked. However, these GIWs, when densely distributed within a catchment, may have significant cumulative impacts on downstream water [Cohen et al., 2016] . This idea has been highlighted in the recently finalized US Clean Water Act (CWA), which proposed legal protection on certain types of wetlands including Delmarva bays because of their aggregate influence on downstream water [US EPA, 2015] .\nThe ecological functions and values of GIWs are extremely difficult to assess. One of the fundamental problems arise from the lack of reliable data on wetland inundation, and methods to rapidly assess wetland-stream surface water connection. Without inundation, wetland-downstream water connectivity cannot be easily established. However, existing wetland data available do not capture such changes on inundation, hence they cannot be used to assess the hydrological connection of GIWs on downstream water. Existing wetland datasets were developed largely based on remotely sensed data, as they provide spatially continuous and consistent information on land surface features. However, most commonly used wetland mapping products (e.g., US Fish and Wildlife Service [FWS] National Wetland Inventory [NWI], Multi-Resolution Land Characteristics [MRLC] Consortium National Land Cover Databases [NLCD], National Oceanic and Atmospheric Administration [NOAA] Coastal Change Analysis Program [C-CAP]) are categorical maps. They do not provide information on inundation dynamics. NWI is arguably the most accurate and the finest spatial resolution wetland map available. Derived from aerial photography in conjunction with collateral data sources and field work, it classifies wetlands and deep water habitats based on hydrologic, geomorphic, chemical, and biological characteristics [Cowardin & Golet 1995] . The NWI includes a broad categorization of inundation and soil saturation dynamics, known as water regime modifiers. Non-tidal water regime modifiers describe intra-annual hydrologic condition (i.e., seasonal variation of surface water inundation and soil saturation) of every NWI polygon. However, it does not provide quantitative information on inundation extent and status, which can be used to infer hydroperiod of wetlands or hydrological connection with downstream water.\nSignificant efforts have been made to improve wetland mapping using remotely sensed data from different sensors and platforms. Optical images from a variety of satellite sensors have been applied to study wetlands [Lang et al., 2015] , including Landsat MSS/TM/ETM+, SPOT, and AVHRR. Synthetic Aperture Radar (SAR) imagery has been used in many wetland studies, taking advantage of its day-and-night, allweather observation capability and its sensitivity to soil moisture. Recently, there has been increasing utility of airborne Light Detection and Ranging (LiDAR) intensity data to detect inundation beneath the forest canopy [Lang & McCarty, 2009 ]. Despite its demonstrated use to produce highly accurate inundation maps, LiDAR inundation monitoring over large areas or at fine temporal scales is greatly constrained by limited data availability and relatively high costs. Most mapping efforts focused on developing regional or global scale inundation products, and they cannot provide spatial details necessary to characterize inundation status. Some recent studies used Landsat images to map water bodies at a higher resolution of 30-m, but mostly for limited application to open water areas such as lakes or rivers. Little emphasis was given on complex ecosystem such as forested wetlands. In addition, most high resolution inundation maps still lack subpixel information, thus remain limited uses for small wetlands with intermittent inundation such as Delmarva Bays in CBW.\nIn this study, we report our progress toward improving understanding on wetland ecosystem through better spatial data and modelling. First, we discuss our recent effort on developing a practical and effective framework for regional, long-term monitoring of wetland inundation dynamics using Landsat time records and the airborne Light Detection and Ranging (LiDAR) intensity data. Generated were a set of temporally consecutive maps of subpixel water fraction (SWF), which indicate the percent of surface water within every 30-m Landsat pixel at an annual time basis over 1985-2011. We then demonstrated the potential uses of our enhanced inundation maps for the rapid assessment of wetland-stream connection, in conjunction with existing data, and improved catchment scale wetland modelling to evaluate the long term catchment scale impacts of wetlands.\nMore specifically, we investigated (1) if the SWF maps could provide crucial information on change dynamics and inundation extent of GIWs; (2) if inundation change trend was consistent with the local weather conditions and downstream flow pattern; (3) if the inter-annual pattern of inundation characterized from the SWF maps was consistent with NWI hydrological regimes; (4) if inundation grouped by NWI modifier showed different degree of hydrological connectivity with downstream; and (5) if GIWs, despite their small size, had catchment scale impact on downstream water. Here, we hypothesized change patterns and trend of inundation would reflect the local hydrological condition. The inundation trend, when analysed in aggregate, would show consistent pattern with the local weather condition and downstream hydrograph. Furthermore, we assumed the spatial inundation patterns also reflected the emergent landscape characteristics to receive and store water flux. This spatial pattern of landscape was assumed to be rather persistent, resulting in similar inundation pattern at inter-annual and intra-seasonal time scale. For example, GIWs with longer hydroperiod would have larger water storage capacity and/or be most likely located in recharge zone with stronger groundwater connection, hence remain inundated longer throughout the growing season, compared to those with shorter hydroperiod. Those GIWs with longer hydroperiod would show stronger hydrological expression in spring, when the groundwater reaches its seasonal high water table with low evapotranspiration (ET). Lastly, we improved the wetland component of a catchment simulation model, Soil and Water Assessment Tool (SWAT) to demonstrate the catchment scale impacts of GIWs on downstream water in agricultural lanscape. This was done by setting up the two land cover scenarios (i.e., presence or absence of wetlands) and comparing the simulated catchment-scale hydrological fluxes. The simulation was conducted in the upper region of Choptank River in CBW, where the study catchment included a dense network of wetlands (~ 30 % of the catchment). This research shows how the SWF maps can assist to overcome the data limitation (i.e., categorical wetland maps), as they provide crucial information to characterize inter-annual variation of inundation extent and patterns. The SWF maps and improved SWAT showed the cumulative impacts of GIWs on downstream water. This study highlights data needs and modelling challenges to systematically assess the hydrological responses and functioning of multiple wetlands in the landscape scale."}, {"section_title": "STUDY AREA", "text": "Our regional mapping approach was tested for the major part of the Coastal Plain of CBW, the Delmarva Peninsula on the East Coast of the United States ( Fig.1 (a) shown in red). The new mapping products were further evaluated for the agricultural catchment, located in the upper basin of the Choptank River ( Fig. 1(b) , highlighted in red). The study catchment includes a dense network of wetlands with flat topography. The catchment land is evenly used for cropland (~ 45 %) or forest (48 %). The NWI shows the majority of forests are indeed forested wetlands, and these forested wetland areas make up for ~ 30 % of the study catchment. Most are GIWs. They are inundated or saturated for a relatively short time period, usually in spring after snowmelt and before leaf-out. This is when ET is low and the groundwater is seasonally high. Precipitation is evenly distributed throughout the year, with annual total of ~ 1130 mm per year."}, {"section_title": "DATA AND METHOD", "text": "Mapping Inundation: Three types of remote sensing data collected during a leaf-off season were used to map inundation at the subpixel level (i.e., subpixel percent of surface water): time records of Landsat images, LiDAR intensity data, and historical aerial photos. NWI data were used to identify wetland boundary to assist mapping within a wetland.\nThe historic Landsat records (path 14/row33) acquired in early spring over 1984-2011 were downloaded from the U.S. Geological Survey (USGS) Earth Resources Observation and Science Center (EROS) website. Those images with minimal cloud covers and no snow cover were processed for the atmospheric correction and normalization. These images were taken after several days after precipitation to minimize the immediate impacts of precipitation on ground cover reflection and flooded areas. Then several spectral reflectance (SR) and indices derived from each normalized scenes were used as model input to build regression tree to predict inundation at the subpixel level. Two LiDAR data collected (over a 51 km 2 area in the study catchment, Fig 1(b) ) on March of 2007 and 2009 [Lang et al., 2013] were used to generate a 1-m gridded intensity image. The images were further classified as non-inundated, partially inundated or inundated (with an overall classification accuracy of 96.3 %. Lastly, Color-infrared (CIR) Digital Orthophoto Quarter Quadrangles (DOQQs) produced by the USGS at a 1-m resolution were used to extract reference water data. The DOQQs acquired closely at the dates of Landsat overpass (1989 & 1995) were used. Landsat-derived SR and spectral indices were related to reference water data derived from the DOQQs and LiDAR Surface Water Fraction (SWF) maps. We used the regression tree approach to establish the relationship as shown in [Huang et al., 2014] . We used ~ 80 % of collected data for calibration and remaining 20 % for validation/accuracy assessment. The developed relationship was applied to selected time series Landsat record, and a long-term SWF map over 1984-2011 was generated. Details on mapping technique and accuracy assessment are available in [Jin et al., 2017] .\nRapid Hydrological Assessment: Two types of datasets were used rapidly to assess the impacts of weather variability on inundation and wetland-stream connection. First, commonly used Palmer's drought indices were downloaded from the NOAA National Climate Data Center (NCDC) for the study region and used to characterize the weather variability (wet, dry and, and normal condition) during the mapping period. Time series of daily stream flow and weather data (e.g., precipitation, temperature, etc) were downloaded from the US Geological Survey gauge station located at the catchment outlet and nearby weather stations operated by NOAA-NCDC. We used the method presented in [Arnold et al., 2015] to separate baseflow from daily hydrograph. Second, we analysed the SWF maps with NWI to calculate the extent of inundated areas per NWI polygons (by counting pixels with SWF>0 %), and used the correlation analysis to relate the wetland inundation to drought indices and daily stream flow. In addition, we developed multiple metrics to characterize inundation patterns according to NWI modifiers (i.e., inundation extent per NWI modifier, frequency of high inundation (SWF >50 %), etc) and investigated how the frequency and extent of highly inundated area (SWF >50 %) varied by this NWI classification. Analysis of variance (ANOVA) method was used to make comparison of inundation patterns from NWI modifiers, and the correlation analysis to investigate their relationship to stream flow."}, {"section_title": "Wetland-Catchment Modelling:", "text": "We used SWAT (Soil and Water Assessment Tool) with improved wetland extension to simulate catchment and wetland hydrology. The model was run on a daily time step over 1985-2015 to predict a long term, cumulative impact of wetlands on downstream water. SWAT is a continuous, semi-distributed model. It subdivides a catchment into multiple smaller spatial units, first to sub-watershed according to stream network, and then to the Hydrologic Response Unit (HRUs) based on unique characteristics of soil, slope, and land cover. Hydrologic fluxes are calculated first at the HRU level and then routed to the sub-basin and the catchment outlet. SWAT has been widely used to study hydrology and water quality impacts of land management for agricultural landscape. It includes a wetland module, but with limited capability, to evaluate the impacts of ponds and natural wetlands at the catchment scale. The capability of SWAT has been extensively tested for the study site, but wetlands have not been well considered in previous studies. We improved the wetland process in SWAT following [Evenson et al., 2015; , to account for the hydrological interaction between riparian wetlands and streams, and upland effects on GIWs. SWAT was calibrated over 2001-2005 and validated over 2006-2010 against stream flow after a 2-year spin up. Calibration was done manually to adjust model parameters in allowable ranges to achieve high Nash Sutcliff (NS) coefficient value. Overall, the calibrated model showed relatively good performance for low and average flow conditions and NS value provided valuable information to assess the model performance. Once calibrated, simulation was conducted over the period of 1985-2015 under two land cover scenarios (i.e., the presence and absence of wetlands in catchment) at a daily time scale. For the case of absence of wetlands, wetland land covers were replaced with forests as shown by the regional land use maps. Different hydrological variables predicted under the two scenarios were compared to assess the catchment-scale cumulative impacts of wetlands on downstream waters. Details of SWAT including calibration and validation for the study catchment are available in Yeo et al., (2014) and ."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "(1) Inundation trend and patterns assessed at the catchment using the SWF maps", "text": "The derived SWF maps showed consistent inundation patterns as observed from corresponding Landsat images (Fig 2) . When the Landsat derived SWF maps were assessed against SWF obtained from digitization of aerial photos over open water areas, the SWF prediction errors was less than 10 %, with an estimated root mean square error (RMSE) of 7.78 %. Overall, the Landsat-derived SWF maps showed the tendency for overestimation. We selected 11 SWF maps (acquired from the Landsat images without cloud cover, several days before and after precipitation) for the study catchment over the period of 1985-2011 and studied the trend of inundated areas in aggregate. The NWI indicated ~ 90 % of wetlands in the study catchment were forested GIWs, and the remaining riparian wetlands (RW). For GIWs, inundated areas (pixels with SWF >0 %) varied considerably from 11 to 53.7 km 2 over 1985-2011, but most inundated areas in GIWs had low SWF (<50 %) (See Fig 3) . However, RWs showed much invariable inundation with high SWF (>50 %). The total inundation for RWs varied only from 3.4 to 6.5 km 2 .\nThe catchment experienced various weather conditions ranged from moderate drought to very wet (with PDSI varied from -3 to 4). Aggregated inundation extent in GIWs followed the general trend of the weather condition when compared with the PDSI (r = 0.58 between PDSI and inundation extent; p-value =0.05 after removing outliers). However, inundation in RWs was quite invariant to the weather conditions, as they remained mostly inundated in spring due to consistent inflow from the streams. We further investigated the relationship between the SWF maps and NWI modifier, as it may help to interpret and quantify the hydrological regimes described by NWI. According to NWI, there were four dominant types of water regimes in the study wetlands: saturated, temporarily flooded, seasonally flooded, and seasonally flooded/saturated. Most GIWs (>80 %) were classified as seasonally flooded or saturated, indicating they were only inundated in the beginning of the growing season. The ANOVA results demonstrated statistically significant difference in inundation patterns, when grouped by NWI modifier (p-value <0.001). The degree and frequency of high inundation relative to wetland extent (assessed using NWI polygons) increased with the duration of hydroperiod. For example, the relative proportion of flooded area (SWF>0 %) of saturated GIWs was ~ 40 %, but only 8.3 % of those saturated GIWs was highly flooded (SWF>50 %). However, the relative proportion of flooded area of GIWs with longer hydroperiod (e.g., seasonally flooded or seasonally flooded/saturated wetlands) was more than 50 %, and these GIWs exhibited a larger proportion (>15 %) of high inundation levels on a per area basis."}, {"section_title": "(2) Rapid assessment for wetland-stream connection water", "text": "The trend of inundation in wetlands was more strongly correlated to stream flow than the drought indices. We used the daily stream flow observed at the catchment outlet on the dates of the image acquisition for this analysis. As RWs were directly connected to the streams, the inundation in RWs showed very strong connection to the daily streamflow observed at the catchment outlet (r = 0.87; p-value < 0.001). Surprisingly, GIWs also showed strong correlation with stream flow (r = 0.81; p-value < 0.01; see Fig 3) . We separated daily streamflow hydrograph to estimate base flow and the results showed about 62 % of streamflow was contributed from the groundwater. Hence, the daily base flow and inundated areas (aggregated for the study catchment) showed statistically significant correlation(r = 0.57; p-value < 0.1), which seemed to suggest relatively high degree of hydrological connection between headwaters (including wetlands) and downstream via groundwater in early spring. Furthermore, we investigated if the relationship between inundation pattern grouped by NWI modifier and streamflow would vary. The results showed the relationship between inundation extent and streamflow was significant (p-value < 0.01) and strong for all hydrologic modifier groups (r >0.7). As hypothesized, the strength and significance of this relationship varied by the modifier. Stronger and more significant relationship was observed for those wetlands with longer hydroperiod. For example, seasonally flooded and saturated wetlands, those with the longer hydroperiod, showed the strongest and most significant relationship with streamflow (r=0.84; p value < 0.005) and base flow (r =0.81; p value < 0. 005). Saturated wetlands, despite their relatively strong connectivity to daily stream flow (r =0.74, p value < 0.01), showed a weaker relationship with base flow (r =0.48 with p value < 0.15)."}, {"section_title": "(3) Cumulative impacts of wetlands on downstream", "text": "The long-term SWAT simulation results (~ 30yrs) under the two scenarios (i.e., presence or absence of wetlands) elucidated catchment-scale cumulative impacts of wetlands. We compared simulated seasonal water fluxes at the catchment scale between the two land cover scenarios (Fig 4) . As aforementioned, no wetland scenario replaced wetland areas with forest cover, as catchment wetlands were dominantly forested wetlands. Overall, it showed no wetland scenario (i.e., forested cover) provided much higher actual evapotranspiration (AET) but lower stream runoff, compared to the wetland scenario. With wetlands, cumulative annual AET and water yield (i.e., normalized streamflow by catchment area) were approximately ~ 50 % (562 mm) and ~ 45 % (510mm) of cumulative annual precipitation (1127 mm). This partitioning changed when wetlands were replaced with forests, as forests increased AET due to transpiration by vegetation. Simulated cumulative AET and water yield under no wetland scenario were ~ 58 % (660 mm) and 40 % (455 mm) of annual precipitation. The variation in the water storage (~ 2% as estimated by P-[AET+Runoff], from Fig.4 ) was slightly less for the catchment with wetlands (~ 5 %) throughout season. Two scenarios showed clearly different patterns of seasonal hydrological flux. The wetland scenario showed much less water deficit during the growing season. It showed more stable, higher streamflow during the growing season, but then soil water became recharged earlier and more rapidly at the end of growing season (Fig 4(a) ). Fig 4(b) showed the wetlands helped maintain rather less variable but steady stream flow throughout year, as it received higher groundwater but less surface runoff contribution to the stream flow. The simulated ground water contribution to simulated streamflow was approximately 78 % under the wetland scenario, but it reduced to 63 % without wetlands (i.e., forested cover). "}, {"section_title": "DISCUSSION AND CONCLUSION", "text": "This study demonstrates the effective regional and long term framework of wetland inundation monitoring using Landsat time records and LiDAR intensity data. Generated were a set of temporally consecutive SWF maps, indicating the percent of surface water in a 30-m Landsat pixel at an annual time step. The SWF maps showed the maximum hydrological expression of wetlands in early spring, when leaf off images showed flooded area under the canopy. Unlike the commonly used, categorical wetland maps, time series SWF maps offer new information to characterize change status, trend, and pattern of inundated area. This information is crucial to assess the ecological functioning and values of wetlands in the landscape context, as it provide valuable information to infer hydroperiod. The Landsat derived SWF maps provided spatially explicit information to predict flooded areas under various weather conditions. When assessed at the catchment scale, the SWF maps showed consistent inundation patterns as stream flow and base flow patterns. This correlation analysis seemed to suggest high degree of hydrologic connection between GIWs and downstream water via groundwater, despite no evident wetlandstream connection via surface water. The SWF maps showed inter-annual trend and variability of inundation, which followed the seasonal variation of inundation as described by NWI modifier. This consistency in inundation patterns between inter-annual (the SWF maps) and intra-annual (NWI modifier) time scales seemed to suggest temporarily invariant inundation pattern. As hypothesized, those wetlands with longer hydroperiod remained flooded more with high SWF in early spring when wetlands showed the maximum hydrological expression. The degree of wetland-downstream connection increased with the duration of hydro-period. The SWAT simulation results supported the hypothesis that GIWs have significant impacts on downstream water, particularly due to hydrological connection via groundwater. The simulation results showed a catchment with dense wetland distribution (~ 30 %) had lower AET but higher streamflow than the catchment without wetlands (i.e., forested cover). The 'no wetland' scenario (i.e., replacing wetlands with forest) resulted in higher transpiration (therefore higher AET) but lower groundwater table due to the vegetation. However GIWs, despite their small sizes, reduced AET with increasing open water surface but less leaf area. GIWs temporarily held surface runoff but recharged ground water slowly. Hence it increased groundwater contribution to streamflow. The results suggested strong hydrologic connection between GIWs and downstream water for the study region. In summary, this study showed the potentials for the regional monitoring of wetland inundation using the moderate satellite data. Complementing existing categorical wetland data, generated times series SWF maps were promising to assist rapid functional assessment of wetlands based on the hydrological regime at the local catchment scale. The SWF maps and improved wetland catchment model showed hydrological connection of wetlands to streams via groundwater, and their significant cumulative impacts on downstream water. New wetland information was vital to demonstrate the importance of GIWs for the downstream water."}]