[{"section_title": "Abstract", "text": "Although buoyed by the induction of a democratic government, and the high ideals of our constitution, the South African education system has in many ways not met the expectations of its people, in this case, the mathematics education community. With the birth of an expansive intended curriculum came the monitoring of the outcomes through systemic type testing, the so-called attained curriculum. In time, it became clear that the inevitable 'teaching to the test' would constitute a narrowing of the implemented curriculum. Two possible constraining influences of the systemic test were identified, namely, a narrowing of the curriculum, and reliance on only one source of external monitoring. To counteract these, a project titled Assessment Enhanced Teaching and Learning (AETL) has been initiated, involving Grade Nine mathematics teachers. The aim of the project is to provide intermittent markers of progress to the teachers and learners at strategic points throughout the year. Teacher involvement in the design and implementation of these formative assessment tasks is thus central to the project. In this paper, we report on a case study at one school in the Pretoria region, and explore the use of structured assessment tasks as an approach to professional development. The question posed here is, \"How does the implementation of strategically designed assessment tasks support professional development and enable professional agency?\" Our findings indicate a strong sense of agency motivated by the need to excel in systemic type testing."}, {"section_title": "Introduction", "text": "Science, mathematics and technology education (SMTE) in the South African context is seen as crucially important and critical for developing countries (OECD, 2013) . At the same time, while there are many initiatives designed to promote SMTE, there are constraining factors inhibiting the attainment of quality mathematics for all (Reddy & Juan, 2014) . In this paper, we note the range of conceptions of mathematics, and report on the current educational environment that impacted on the delivery of quality mathematics teaching at the time of this study. We also highlight some problems that we understood to be constraining factors in the provision of quality education. We then further propose a solution to the problem by drawing on a model of assessment developed by Bennett and others (Bennett, 2010; Bennett & Gitomer, 2009) . In this project, we combined the design of sets of assessment tasks with professional development, where the agency of teachers is foregrounded. Our main focus, therefore, was on how strategically designed assessment tasks can support teacher agency and professional development.\nThe Assessment Enhanced Teaching and Learning (AETL) project serves a cluster of schools in the Tshwane (Pretoria) area in South Africa. In this paper, we focus on a single case study of one school, Tsebo Kematla Secondary School (not its real name), which was situated on the outskirts of the city. We present the preliminary findings of the study in which we describe the professional agency that was enacted in the pursuit of providing quality mathematics education to learners, and note the constraining as well as supporting factors therein. We propose that educational policy ensures that the context in which teachers work is conducive to enabling agency, and is therefore also conducive to providing quality mathematics education."}, {"section_title": "Conceptions of Mathematics", "text": "An international study by Petocz, Reid, Wood, Smith, Mather, Harding, Engelbrecht, Houston, Hillel and Perrett (2007) revealed that students' conceptions of mathematics ranged from the narrowest view, focusing on calculations with numbers, through the notion of mathematics as a focus on models or abstract structures, to the broadest view of mathematics as an approach to life and a way of thinking. Broader conceptions of mathematics, however, were more likely to be found in later-year students. The largest group of students (44%) saw mathematics as a \"toolbox\" of formulas, equations and laws, whereas only a few students (6%) saw mathematics as the language of nature (p.446).\nWe do not find this outcome surprising. The way mathematics is taught at many schools is very one-sided, and as a result, students experience it as a \"toolbox of formulas, equations and laws.\"\nIn an essay in The Economist (Mathematics: Proof and beauty, 2005) , the question, \"Why mathematics?\" is eloquently addressed:\nThe foremost reason is that mathematics is beautiful, even if it is, sadly, more inaccessible than other forms of art. The second is that it is useful, and that its utility depends in part on its certainty.\nMany mathematicians are involved with the subject mainly due to the aesthetic aspect. Hardy (1940) , who is famous for his quote \"Judged by all practical standards, the value of my mathematical life is nil ...\" (p. 49) also said that for him \"… beauty is the first test; there is no permanent place in the world for ugly mathematics\" (p. 14).\nIn our teaching, these more pleasing and more aesthetic elements of mathematics are often neglected. We spend so much time on the technical and algorithmic aspects of mathematics that it may not always be the students who really engage with mathematics in its entirety who perform best in what we assess. The extent of mathematics in the world around us is described by Hom (2013) as follows:\nMathematics is the science that deals with the logic of shape, quantity and arrangement. Math is all around us, in everything we do. It is the building block for everything in our daily lives, including mobile devices, architecture (ancient and modern), art, money, engineering, and even sports.\nTo ensure quality mathematics education for all, there is a need to expand the assessment process to include the other, sometimes neglected, dimensions of mathematics and in the process, enable teachers and students to address these aspects of mathematics in the teaching and learning process. The fact that mathematics learning and teaching is generally assessment driven could be exploited by designing assessment tasks in mathematics that are worth teaching."}, {"section_title": "Context", "text": "Although sustained by the high ideals of our new constitution in a post-apartheid democratic government over the past 20 years, the South African education system has in many ways not met the expectations of its people (Reddy & Juan, 2014) . With the birth of an expansive curriculum, the intention of which was to provide children access to mathematics as a human activity, came the monitoring of outcomes through systemic and large scale studies (Howie, 2012) . While the intended curriculum was articulated and the attained curriculum was monitored through systemic testing, the implementation thereof by teachers in their classrooms had not received enough attention. The professional development of mathematics teachers, while nominally perceived to have taken place, was not perceived to be successful when viewed through the lens of systemic assessment results and large scale international assessments. The Strategic Planning document of the Department of Basic Education, Republic of South Africa (DBE) (2011 :77) states:\nThe problem of poor quality teaching and poor subject matter knowledge of our teachers, a legacy of apartheid teacher training, is one of the greatest impediments to improved delivery of quality education in the system as a whole, as measured by poor learner performance, not only in international tests (TIMSS [Trends in International Mathematics and Science Study] and PIRLS [Progress in International Reading Literacy Study]), but also in our own systemic assessments and matriculation examinations.\nAn inevitable outcome of high stakes testing, or 'teaching to the test', is a narrowing of the curriculum. It could be argued that successive curriculum narrowing has characterised our official intended curriculum since 1998 with successive reviews and revisions that, rather than addressing the concerns of professional teacher development, have tailored the curriculum to the perceived weakest teachers.\nThe rationale for the narrow prescription of curricular elements was the poor performance of learners in systemic tests, and the inference that teachers did not possess the content knowledge required to teach an elaborated curriculum that adhered to the conception of mathematics as a way of thinking and an approach to life.\nWhile it may be true that many mathematics teachers do not currently have the requisite mathematics knowledge, the actions taken to remedy this situation have undermined rather than supported the teaching community. The inherent phenomenon of agency, which we believe is central to being human and is core to the functioning of the professional teacher, has been constrained rather than supported in the successive reforms and attempts by the Education Department to improve the teaching and learning of mathematics.\nIn South Africa, Grade Nine learners are subject to national external systemic testing, the Annual National Assessment (ANA). The results of these tests are released in public documents, and while some diagnostic purpose may be achieved, the results serve largely an accountability function. The consequences of external testing, which is by definition not aligned with classroom teaching and learning, is that there is a backwash effect from the test to the implemented curriculum, and the effect on mathematics education is greatly impacted. It has been observed that in terms of classroom impact, ANA wields enormous power and influence that is not entirely warranted.\nFurther afield in the United States, Bennett and Gitomer (2009) report that the testing programmes designed to support the No Child Left Behind campaign have not had the desired effect, and are more likely to have had a negative effect. Their criticism is that the feedback gained from the testing process did not enable better teaching and learning as the assessment and the results were not aligned with teaching and learning.\nIn summary, the constraining influences of systemic testing are firstly that of narrowing the curriculum to focus only on what is in the test. Secondly, the delayed feedback is received only once a year, when it is too late to remedy the situation. Thirdly, having only one source of external feedback is problematic, and fourthly, test outcomes are not directly related to teaching and learning."}, {"section_title": "Assessment", "text": "A growing body of research suggests that a critical aspect of effective classroom-based (formative) assessment is the alignment of assessment activities with goals focused on student learning (Ayala, Shavelson, Ruiz-Primo, Brandon, Yin, Furtak, Young & Tomita, 2008; Shepard, 2000; Wiley, 2008) . Formative assessment can be seen as a systematic process in which evidence is gathered and feedback about student learning is continuously provided during instruction (Sadler, 1989) . This feedback identifies the gap between a student's current level of learning and the desired learning goal. It is therefore crucial that teachers not only understand, but also align their classroom tasks with the learning goals and assessment criteria that will determine their students' progress relative to the set goals (Shepard, 2000; Stiggins, 1999) . However, teachers often receive insufficient training in classroom assessment as part of their teacher preparation programme, and in-service teachers consistently indicate that they need more professional development in classroom-based assessment (DeLuca & Klinger, 2010) . Assessment is much more than simply measuring learning outcomes. In this study, we proposed a better understanding of formative assessment and how meaningful, contextualised, and purposeful assessment activities could inform teaching and learning experiences in mathematics. Bennett and Gitomer (2009) describe an assessment model developed in response to the inadequacies of systemic assessment programmes, referred to as the Cognitively Based Assessment of, for and as Learning (CBAL) model (Bennett, 2010; Bennett & Gitomer, 2009) . This model provides an articulation of three components of assessment: systemic type assessment (monitoring); classroombased assessment (formative assessment); and professional development (assessment as learning). The foundation of all three components is the view that any form of assessment should be aligned with the cognitive models that are acknowledged to support learning and teaching.\n\n"}, {"section_title": "Professional Development", "text": "The professional development component, comprising assessment as learning, is required in order to support teachers with both a deeper insight into knowledge domains through engagement with the given activity sets. It is also required to support teachers' formative assessment practice in the classroom, which is conceptualised as assessment for learning. Building on the democratic imperative that all learners have access to quality mathematics education, classroom-based assessment practices that support this aim formed a central part of this study. Furthermore, it is suggested by Stiggins (1999) that the frequent assessment of students during the learning process allows teachers to adjust their instruction to address learning deficiencies and misconceptions before it is too late and student motivation decreases (Stiggins, 1999) .\nIn order to focus on understanding, enhancing, and/or developing teachers' mathematics knowledge, beliefs, and pedagogical knowledge in teaching mathematics, we have drawn on resources such as the National Council of Teachers of Mathematics (NCTM) in the United States. The NCTM (2014) developed eight 'Principles to Actions,' which offer a broad framework against which to gauge teachers' thinking and practice in relation to the current perspectives on quality mathematics education for all. Teachers are required to: implement tasks that promote reasoning and problem solving, use and connect mathematical representations, facilitate meaningful mathematical discourse, pose purposeful questions, build procedural fluency from conceptual understanding, support a productive struggle in learning mathematics, and elicit and use evidence of student thinking (NCTM, 2014) ."}, {"section_title": "Teacher Agency", "text": "Central to the professional development component in this study is the supporting and enabling of professional agency, which we understand to be the dynamic competence of human beings to act independently, and to make choices (Priestley & Biesta, 2013) in order to advance toward their goals. There are two additional ideas that are key to this concept, the first being that agency is not intrinsic to a person, but is rather perceived as occurring interactively with the environment, and the second being that the environment in which individuals find themselves may enable or constrain agentive action (Biesta & Tedder, 2007) .\nEssentially, agency does not reside entirely in the person, or in this case, the teacher, but is a product of the teacher engaging with the environment. Furthermore, this dynamic competence has historical features in that the teacher may draw on previous experience, projective features in that action may be taken towards a future goal, and features in terms of the present, where the teacher has to negotiate the educational and social milieu (Priestley, Edwards, Priestley & Miller, 2012) ."}, {"section_title": "Assessment Enhanced Teaching and Learning Project (AETL)", "text": "We developed a model informing the ongoing project, and this study, which is referred to as the Assessment Enhanced Teaching and Learning (AETL) project. This project is modelled on the CBAL model (Bennett & Gitomer, 2009 ) in some respects. The focus in this project is on the formative assessment component, where sets of assessment activities are designed to provide intermittent markers at strategic points in curriculum implementation. These sets of activities are aligned with the Grade Nine mathematics curriculum plan, as set out in the Curriculum and Assessment Policy Statement (CAPS) (DBE & Higher Education & Training, 2011) . The sets are designed to test the critical aspects of a topic area, e.g. Functions, drawing on what Usiskin (2015) describes as the critical dimensions of understanding that are required to master any particular mathematics topic. These are the Skills-Algorithm, Property-Proof, Use-Application, and the Representation-Metaphor dimensions of understanding (Long, Dunne & De Kock, 2014; Usiskin, 2015) . In addition to including items that require these dimensions, we also included a problem-solving type question of the type that can be found in the South African Mathematics Olympiad (see Engelbrecht & Mwambakana, 2016) .\nCritical and extensive engagement with the assessment item sets on the part of the teachers forms a critical part of the project. The rationale of the project is that, through direct engagement with assessment tasks that are designed to highlight critical mathematics concepts, together with reflective implementation of such tasks, there will be professional growth and subsequently teacher agency.\nThe teachers were actively involved in the implementation and refinement of these formative assessment tasks, not only to increase their knowledge of particular mathematical concepts, but also to enhance their assessment skills (see Figure 1) . "}, {"section_title": "Participants and Site", "text": "The selection of the participating schools was guided by the purpose of the AETL project. District officials of Tshwane and mathematics subject specialists attended the first training session with the researchers and selected teachers. Purposive sampling methods were used to select Grade Nine teachers from 10 schools in the Tshwane area. The main criteria for the participants in this study were that they have to be Grade Nine in-service mathematics teachers in the Tshwane (Pretoria) District. Additional criteria was based on time, availability and access, also known as convenience sampling (Merriam & Tisdell, 2015) .\nExisting knowledge, practices, beliefs and attitudes regarding assessment and learning objectives of mathematics in a local context, were discussed during the first session. Detailed discussions were held on formative assessment strategies and how it links to mathematical learning theory during the second meeting."}, {"section_title": "Assessment Of learning(AoL):", "text": "Monitoring component (external and summative assessment)"}, {"section_title": "For learning (AfL):", "text": "Classroombased component (formative assessment)"}, {"section_title": "As learning (AaL):", "text": "Professional development component (focus on teacher agency)\nOne of the schools, Tsebo Kematla Secondary School (pseudonym), volunteered to participate in this particular case study which formed part of the overarching AETL Project. The school is situated in a township on the outskirts of Pretoria and the learners come from different socio-economic backgrounds. The school had approximately 1,400 learners from Grades 8 to 12 at the time of this study.\nThe Grade Nine teachers who voluntarily participated in this study were the principal, Mr M, who taught one Grade Nine class, the Head of Department (HoD) for Mathematics, Mr L, and two teachers, Mr Z, and Mr T.\nIt was the choice of the headmaster, Mr M (pseudonym), that all of the students in the school took Mathematics rather than Mathematical Literacy, which does not prepare students for further mathematics. Moreover, he did not screen the children prior to their acceptance to the school. The reason for his insistence that every child should take Mathematics was based on his belief that every child should have access to mathematics, that mathematics is within their grasp, and that he did not want these children to be limited in any way in their choice of career. It is not usual in such a large school for the principal to teach, however, Mr M insisted that he should take a Grade Nine class because of the stresses around the ANA at Grade Nine level (teachers feel exposed by the ANA since the ANA results reflect on their performance as teachers). Due to the normal disruptions during the week, occasioned by visits from Departmental officials or parents, Mr M held an additional weekly class on Saturday mornings for his class.\nMr L, the HOD, taught Grade 12 (also known as Matric) classes to prepare them for the final exit examination, the national senior certificate. He performed the function of coordinator for the AETL project at the school. Outside of his school responsibilities, Mr L was the chairman of a regional branch of the Association for Mathematics Education of South Africa (AMESA), and was in the process of furthering his studies. He was also a teacher moderator for district cluster meetings. At the time of this study, Mr T was registered for a Master's degree at a nearby university. Mr Z was new to the staff, and was responsible for teaching Grade Eight and Nine mathematics.\nAll of the participating teachers who were responsible for Grade Nine mathematics were thus appropriately qualified and may be described as professional teachers."}, {"section_title": "Research Questions", "text": "The primary research questions explored in this study were: 1) What are the constraining factors in the implementation of the intended mathematics curriculum for Grade Nine teachers in the current educational environment?\n2) How do these teachers engage in the strategically designed assessment item sets, and how does this impact their instructional practices? 3) To what extent do structured formative assessment practices support teacher agency as part of their professional development?"}, {"section_title": "Methodology", "text": "An interpretivist qualitative research methodology (Merriam & Tisdell, 2015:9) was chosen, as it emphasises the varied experiences and perceptions of the four Grade Nine teachers and their participation in a professional development programme. In keeping with the lived experiences and behaviours associated with a qualitative approach (Merriam & Tisdell, 2015:8) , we reported on a single case study, based on assessment in the current educational context, the implementation of assessment tasks, and an approach to professional development and teacher agency. The formative assessment item sets as previously described (see AETL Project), were disseminated at the end of the second term for use in the third term. The two sets focused on Functions and Algebraic expressions; topics that were allocated to the beginning of the third term in the teaching plan, as outlined in the CAPS document. The idea was for the four participating teachers to engage with the item sets and all associated memoranda, and then at a strategic time, administer the items to their classes. An additional expectation of the project, in keeping with the commitment to supporting and enabling agency, is for teachers to reflect on the usefulness of the item sets in relation to their own classroom experience. Feedback was thus expected regarding the usefulness, or otherwise, of the project, the possible adaptation of items, and change in the use of the sets."}, {"section_title": "Data and Analysis", "text": "Multiple forms of data collection strategy were employed such as observations, an open-ended questionnaire, standardised semi-structured interviews, written documents, field notes, and digital voice recordings to enhance the trustworthiness of the study through the process of triangulation (Creswell, 2007) .\nAfter receiving consent from the participants, the researchers visited the school and conducted three discussion meetings with the four participating teachers. An open-ended questionnaire and individual semi-structured interviews were conducted after school hours dependent on the availability of the participants.\nThe purpose of the first meeting was to understand the supporting or constraining factors as experienced by the teachers, and to understand how the various role players, the principal, HOD and teachers, experienced the pressures, challenges, and joys of teaching. It was expected that the teachers would have engaged, to some extent, with the item sets. The item sets (assessment activities) were given to the teachers prior to the scheduled discussion meetings.\nThe second meeting comprised a reflection on the implementation of the third term item sets, and a discussion on the NCTM's 'Principles to Action' (NCTM, 2014), which address the concerns voiced by the teachers in the first meeting.\nThe third meeting with the teachers comprised a reflection on the previous meeting, confirmation from the researchers regarding the findings, a discussion of the NCTM article, and a dialogue on the big ideas of mathematics.\nThe open-ended questionnaire was designed to focus on the individual teachers' background information, their general assessment knowledge, beliefs and practices with regard to mathematics teaching and learning, and their professional development activities. Semi-structured interviews were conducted by the author with the participating teachers to provide a deeper understanding of the individual teacher's general skills and knowledge related to the teaching and learning of mathematics, their experiences in engaging and implementing the formative assessment tasks, and the role that this engagement played in their professional development and teacher agency.\nThe meetings and interviews were recorded and transcribed to identify the conceptions that each teacher brought to his or her engagement with the formative assessment tasks, and their experience of professional development within the current educational environment. Data was analysed by using Creswell's (2007) methods of categorisation and open coding to identify topics and emerging themes and issues relevant to the research aims and objectives of this study. By inductively analysing the data obtained, the authors were able to compare, contrast and identify similarities between the responses of the teachers. The qualitative data was therefore examined by working from particulars (raw data) to more general perspectives, which are called themes or categories (Creswell, 2007) ."}, {"section_title": "Findings", "text": "The collected data was analysed and the following themes emerged:"}, {"section_title": "Constraining Factors in Assessment Practices in the Current Educational Context Learners' socio economic backgrounds", "text": "Two of the teachers mentioned that the majority of their learners were from poverty stricken areas, and that some of the learners travelled great distances to attend this school. According to Mr M, these learners were determined to get out of their current circumstances through the perceived quality of education in mathematics, science and technology offered by the school. This perception inevitably led to an increase in the size of the classes."}, {"section_title": "Large classes", "text": "Mr T voiced his concern regarding the large classes and the influence it had on effective formative assessment: "}, {"section_title": "Learner preparedness", "text": "One of the major teaching issues was the wide range of learners' abilities in any one class. Further contributing to this problem, there was little continuity from the feeder primary schools for this high school. The Grade Eight teachers could not assume that the required curricula elements had been covered. It was also mentioned by one of the teachers that some of the high schools in the district gave prospective Grade Eight learners a pre-test in mathematics to determine if they should continue with Mathematics or take Mathematics Literacy as an alternative in further grades. This was not the case with Tsebo Kematla Secondary School. However, the principal, Mr M, explained that the school \"does not want to discriminate at all,\" and expressed his belief that every learner should be able to pursue the career of his or her choice.\nDespite the difficult socio-economic background of the majority of the learners, all of the participating teachers had high expectations for their learners."}, {"section_title": "Language issues", "text": "The problem of language fluency in the language of instruction, English, was another concern raised by all of the participants. Mr L added to the language issue by emphasising that his learners were struggling to read the questions:\nOnce they see a quadratic equation, they just solve it, but they don't read."}, {"section_title": "Anxiety related to assessment", "text": "Mr M reported another challenging external factor, stating that \"there was great anxiety in relation to testing\" amongst learners. The big difference between what learners wrote in response to a test question, and what they answered when engaged after the test, could be explained by anxiety in relation to testing. The teachers also related stories of how students would not attempt answering if they knew they would receive the memoranda, and there was likely to be straight copying. This situation reflected a focus on marks and achievement, rather than on understanding mathematics, a phenomenon to be expected given the anxiety around systemic assessment results."}, {"section_title": "Communication between schools and the Department of Education", "text": "The important role of the school's interpersonal relations with the Department of Education, the organisational contexts in which teachers work, and the effect this has on the implementation of the formative assessment tasks was confirmed in this research study. Last minute instructions from the Gauteng Department of Education (GDE) and schools also seemed to be a constraining factor in the formative assessment practices of the teachers, for example, a sudden change in the teaching plan had been ordered by the GDE. Thus, instead of starting the term with Algebraic Expressions and Functions, all of the Grade Nine teachers across the province had been told to start the term teaching \"addition and subtraction of algebraic expressions\" with very little notice.\nThe influence of systemic testing on the participating teachers' assessment and classroom practices were also evident in this study. It was clear from the conversations, questionnaires and interviews that all four of the participating teachers invested a lot of time and energy in teaching towards the ANA.\nInevitably, the question that came to mind was whether this was really the most important educational aim for the learners and their future careers. When discussing the 'Principles to action,' as described by Silver (2015) , it emerged that the attention given to the ANA was a strategic and necessary move on the part of the principal. However, his thinking on education in general extended much deeper than the immediate focus on the ANA. In another meeting, Mr M shared his numerous strategies to ensure that his learners had the best possible chance of doing well in the matric exam, and in the ANA."}, {"section_title": "Teachers' beliefs regarding mathematics teaching", "text": "In response to the questions, \"what are the reasons we teach mathematics?\" and \"if there were no exams, what would be our reason?,\" the participants provided us with a range of beliefs regarding the value of mathematics teaching, as well as some constraints within their profession.\nFor Mr Z, the value of mathematics teaching and learning was in the acquired knowledge that his learners could apply in real life situations: Despite their positive beliefs in terms of mathematics, and the intended aims and objectives of the teachers, there was a concern raised by two of the teachers that the educational profession does not receive the recognition it deserves in South Africa. Mr Z explained:"}, {"section_title": "Most of the learners who are achieving high marks, they look for engineering, they look for other courses […] They tend to look down on teachers.", "text": ""}, {"section_title": "Teachers' engagement with the strategically designed assessment item sets", "text": "In agreement with Schön's (1987) view that reflection plays an important role in professional development, this study also drew on the reflection of the participating teachers' formative assessment practices. According to Schön (1987) , reflection begins with \"reflecting-on-action\" and eventually progresses to \"reflecting-in-action.\" Silver's article (2015:33) was introduced in response to Mr M's desire to provide quality mathematics education to all of his learners. The teachers were given the article to read during the week in preparation for the discussion the following week. In so doing, the aim was for them to reflect on the alignment of the ideas expressed in the article with the needs and current assessment practices in their school.\nVariations in the teachers' ideas of Mathematics assessment principles identified the conceptions that each teacher brought to his or her engagement with the principles described by Silver (2015).\nOn the one hand, for Mr M, it seemed to be important to \"establish mathematical goals to focus learning\" and \"implement tasks that promote reasoning and problem solving\" in his formative assessment practices.\nMr T on the other hand, focused on keeping with the themes of \"all students have the opportunity to learn\" and \"facilitating meaningful discussion.\"\nMr L meanwhile explained his view by giving an example of how he involved his learners in \"eliciting and using evidence in student thinking\" and also how he \"facilitates meaningful discourse in mathematics assessment.\" Mr M's response was as follows:"}, {"section_title": "I am using everything I come across (to improve) the Maths. I like what comes from the outside because I can see it challenges our learners.", "text": "Once he had completed a section, for enrichment purposes, Mr Z would use the worksheets, \"They should be used for a variety of methods and how the questions should be asked -that is why I am saying for enrichment.\" Lastly, Mr L, the HOD, expressed the view that the teachers found it difficult to design their own worksheets and that these worksheets could \"work as a guideline.\""}, {"section_title": "Impact on teacher agency", "text": "The teachers' contexts and backgrounds offered an opportunity to examine the extent to which the evidence of teacher agency, the dynamic competency to engage with problems, was influenced by the curriculum and teaching organisation, as well as their conceptions of teaching and learning mathematics.\nThe importance of having supportive colleagues and engaging in collaborative activities in the same school context became evident from the selected teachers who participated in the AETL project.\nThe data obtained from the meetings, questionnaires, and interviews revealed that all four of the participating teachers had a strong sense of personal commitment and professional identity. This was the case, as they personally constructed an understanding of what it is to be a good mathematics teacher, and how to be reflective in their classroom assessment practices. Biesta, Priestley and Robinson (2015:626) note that \"Agency is in some ways 'motivated'; that it is linked to the intention to bring about a future that is different from the present and the past.\" It is in these terms that we recognised in Mr M the strongest sense of agency.\nThe perception of agency as being influenced by the past, guided by a vision for the future, and motivated to engage with the current context provided a framework for analysing and theorising about the energy exhibited by Mr M in his quest for quality mathematics for all children. With regard to engaging with the current context, being the principal of a school meant that he engaged with the departmental authorities on a regular basis. He also had discussions with the Chief Director, who is directly accountable to the provincial Minister of Education. The Chief Director personally visits the school, and in particular the Principal, to find out what is happening on the ground. Furthermore, Mr M's relationship with his staff members was horizontal rather than hierarchical.\nMr M was also constantly on the lookout for resources that would support the achievement of learners in the ANAs. He mentioned an example of revision books that were stacked up in a neighbouring school in the same district, and how he persuaded the principal of that school to hand the books over to him for the Tsebo Kematla secondary school learners.\nMr T, alternatively, incorporated resources such as previous question papers and ANA papers at the end of his lessons to help identify weaknesses in his learners' responses, and to inform his planning for the following lesson.\nIt was observed that active engagement in assessment tasks with colleagues within similar school contexts and resources influenced Mr T's act of agency in his classroom: According to the participants, all of the Grade Nine teachers discussed the AETL worksheets during their subject meetings on a weekly basis, and tried to align their current assessment practices with the worksheets. These findings also strongly resonate with Biesta and Tedder's (2007:137) view on the achievement of agency,\n[T]his concept of agency highlights that actors always act by means of their environment rather than simply in their environment […] the achievement of agency will always result in the interplay of individual efforts, available resources and contextual and structural factors, as they come together in particular and, in a sense, always unique situations.\nFrom the data collected, it was clear that all of the participating teachers were open to life-long learning, and that they participated in initiatives, such as formative assessment activities to enhance their professional development. This could also help assessment programme developers to connect teacher learning and professional development in order to improve mathematics teaching."}, {"section_title": "Conclusion", "text": "As noted earlier, our main objective in this study was to use the focus on assessment to include the multiple dimensions required to understand concepts in Mathematics, and in this way contribute to the professional development of teachers. In having teachers reflect on and take control of the assessment process, we understood this to contribute to supporting teacher agency among mathematics teachers. This move was an attempt to avert a narrowing of the curriculum, and was also an attempt to provide timeous feedback of important elements of the curriculum that could be fed back in a formative assessment cycle that is central to the learning process. It was also done to counterbalance the problem of only a single source of feedback being given to the teachers in the form of the ANA. A further aim was to align assessment tasks with teaching and learning.\nThe question, \"what are the constraining factors in the implementation of the intended mathematics curriculum for Grade Nine teachers in the current educational environment?\" was richly answered by the participants of the three interactive group interviews at the school. There is no doubt that the ANAs wield power and influence. We are in agreement with Matters (2009:222) , who states that assessment information plays a powerful role in educational debate, but this role can be justified only if at least two conditions are met: 1) the assessment itself is of sufficient strength and quality to support the uses to which it will be put; and 2) the users of the assessment data (analysts, teachers, administrators, policy makers) have sufficient expertise and imagination to make reasoned judgments about the system as a whole.\nIn answer to the question, \"how can the use of strategically designed assessment item sets support the learning and teaching of mathematics in Grade Nine?\" we do believe that the potential is there, however, the current expectations to perform in the ANAs may take attention away from deeper conceptual understanding of particular mathematical topics. As explained by Mr M, for the most part, normal teaching is happening in the classroom, and all attempts to improve and excel in the ANAs and the matric exams are above and beyond the normal teaching that takes place. However, because of the public nature of the ANAs, it is understandable that for three weeks in the third term when the ANAs are written, all of the focus is on performing well in the ANAs.\nIn answer to the third question, \"to what extent do these assessment practices support teacher agency?\" the question of approach on the part of the research team was critical. As stated, these extra assessment resources were offered in the spirit of collegial sharing. Due to the complex school environment with many external forces impacting the day to day running, the teachers and principal had to be convinced through their own implementation and practice of the value of the assessment resources. The approach therefore was first to understand the context into which this Assessment Enhanced Teaching and Learning was feeding.\nOur findings in this study with regard to agency, viz. the dynamic competence to engage with and solve problems, were that there was a strong sense of agency motivated by the need to excel in systemic testing. Above all, what appeared to be the primary motivation was a love of mathematics, an awareness of its power, the belief that all children should learn mathematics and be able to use mathematics in their lives, and then only the need to excel in the Annual National Assessments (ANAs) and the matric examination.\nWithin an ecological approach to agency, we drew on the chordal triad to describe the elements of agency that emerged in this case study. We note that agency does not occur in a vacuum, but in response to motivation and within a certain context. The various aspects of change, as it relates to teacher agency in this study, indicate the strong influence of school-based interventions such as the AETL project, and the way in which the Mathematics Department of the school was managed based on the motivation of its teachers. The teachers' belief systems and how they positioned themselves in relation to policy, to the learners, to the wider community, and their colleagues provided us with a better understanding of their motivation to adapt their instructional and assessment practices.\nThe main education goals espoused in this study were the development of mathematical proficiency that renders mathematics intrinsic to the person, and mathematics that is naturally applied by a person within their environment. It is thus critical to the attainment of these education goals that anxiety around mathematics is decreased, and that a sense that mathematics can be mastered to some extent by all children be promoted."}, {"section_title": "Next Steps", "text": "In this three week engagement with the school, a broader question emerged: \"how do schools in the current context of systemic assessment act strategically to improve performance in the Annual National Assessments and in the matric examination?\"\nHere, the evidence is clear that a resourceful principal audaciously sought to ensure that the learners performed well in the ANAs.\nNonetheless, the principal's imperative leads us, in synergy, to further ask: how do these strategies support engagement with mathematics, and what conceptions of mathematics are prioritised; how do we understand agency in this context; and how could the phenomenon of teacher agency better support the learning of quality mathematics?\"\nPublished under a Creative Commons Attribution Licence."}]