[{"section_title": "Introduction", "text": "Coronaviruses are enveloped, single-strand RNA viruses that can infect a wide range of hosts including avian, wild, domestic mammalian species, and humans. Coronaviruses are well known for their ability to mutate rapidly, alter tissue tropism, cross the species barrier, and adapt to different"}, {"section_title": "Coronavirus Taxonomy", "text": "Coronaviruses are enveloped, icosahedral symmetric particles, approximately 80-220 nm in diameter containing a non-segmented, single-strand, positive-sense RNA genome of about 26-32 kb in size [34] . Coronaviruses (CoVs) are one of the largest groups of viruses that belong to the order Nidovirales, suborder Cornidovirineae, and family Coronaviridae. Coronaviridae is classified into two subfamilies, namely, Letovirinae and Orthocoronavirinae. Letovirinae includes the Alphaletovirus genus, while Orthocoronaviridae is further classified on the basis of phylogenetic analysis and genome structure into four genera: Alphacoronavirus (αCoV), Betacoronavirus (βCoV), Gammacoronavirus (γCoV), and Deltacoronavirus (δCoV), which contain 17, 12, 2, and 7 unique species, respectively (ICTV 2018). The most recent classification of the Coronaviridae is shown in Table 1 . Corona in Latin means crown, and this name was attributed to the virus due to the presence of spike projections from the virus envelope that give it the shape of a crown under the electron microscope; Nido means nest and refers to the ability of the viruses of this order to make a nested set of subgenomic mRNA [25, 35] .\nCoronaviruses infect a wide range of wild and domestic animals; αand βCoVs infect mammals, while γand δCoVs primarily infect birds (Table 1) . A human coronavirus (HCoV) was first isolated in 1960 from hospitalized patients who suffered from common cold symptoms and was named B814 [36] . So far, the seven different HCoVs that infect humans are 229E, NL63, which belong to α CoVs, and HKU1, OC43, SARS, MERS, SARS-CoV-2, which belong to βCoVs. In 2002-2003, a pandemic caused by SARS-CoV (lineage B βCoV) originated in China [37] . In the Middle East, MERS-CoV (lineage C βCoV) emerged in 2012 [27] . In 2019, a newly emerged SARS-CoV-2, closely related to bat SARS-related CoVs, was clustered with lineage B βCoV. Chan et al. [13] demonstrated that SARS-CoV-2 represents a distinct lineage in the subgenus Sarbecovirus (previously, lineage 2b of βCoV) [38] . Additionally, other coronaviruses have caused pandemic diseases in domestic and wild mammals and birds, leading to high mortality rates and severe economic losses. These viruses include IBV in chickens [40] , Beluga whale coronavirus SW1 (BWCoV-SW1) [41] , bat coronaviruses CDPHE15 and HKU10 (ICTV 2018), porcine epidemic diarrhea virus (PEDV), TGEV, and sudden acute diarrhea syndrome (SADS-CoV) [42] ."}, {"section_title": "SARS-CoV-2 Genome Organization", "text": "Since the emergence of SARS-CoV-2 in Wuhan City, China, in December 2019, many laboratories have been working on sequencing the genome of the causative agent. As of 14 April 2020, there are a total of 7655 complete genomes from 67 countries in the Global Initiative on Sharing All Influenza Data (GISAID) database [43] (Table 2) . A reference genome is now available in the NCBI genome database (29,903 nucleotide, Reference Sequence: NC_045512.3) [44] . To date, there are a total of 875 sequences including one RefSeq sequence and 768 complete genomes at NCBI. SARS-CoV-2 is a monopartite, single-stranded, and positive-sense RNA virus with a genome size of 29,903 nucleotides, making it the second-largest known RNA genome. The virus genome consists of two untranslated regions (UTRs) at the 5 and 3 ends and 11 open reading frames (ORFs) that encode 27 proteins (Table 3) . The first ORF (ORF1/ab) constitutes about two-thirds of the virus genome, encoding 16 non-structural proteins (NSPS), while the remaining third of the genome encodes 4 structural proteins and at least 6 accessory proteins. The structural proteins are spike glycoprotein (S), matrix protein (M), envelope protein (E), and nucleocapsid protein (N), while the accessory proteins are orf3a, orf6, orf7a, orf7b, orf8, and orf10, as shown in Figure 1 [2, 13, 38, 45] . The 5′UTR and 3′UTR of SARS CoV-2 are comprised of 265 and 229 nucleotides, respectively. Orf1ab is 21,290 nucleotides and encodes either replicase proteins pp1a of 4405 amino acids (aa) (nsp1-nsp11) or pp1ab of 7096 aa (nsp1-nsp16), according to ribosomal frameshift. Of these proteins, (1) nsp1 suppresses the antiviral host response, (2) nsp3 is a papain-like protease, (3) nsp5 is a 3CLpro (3C-like protease domain), (4) nsp7 makes a complex with nsp8 to form a primase, (5) nsp9 is responsible for RNA/DNA binding activity, (6) nsp12 is an RNA-dependent RNA polymerase (RdRp), (7) nsp13 is confirmed as a helicase, (8) nsp14 is a 3′-5′ exonuclease (ExoN), 9) nsp15 is a poly(U)-specific endoribonuclease (XendoU). The remaining nsps are involved in transcription and replication of the viral genome [13, 46, 47] ."}, {"section_title": "Comparative Phylogenetic Analysis of SARS-CoV-2", "text": "Single-stranded RNA viruses exhibit a faster biological mutation rate due to the lack of proofreading activity of viral RNA polymerases [48] ; however, unlike other mutation-prone RNA viruses, with the exception of the Arenaviridae family, CoVs do have limited proofreading capabilities, with the nsp14 protein allowing for the enhanced genome size of CoV family members [49] .\nRecombination is another mechanism of evolution in coronaviruses [50] . A high recombination frequency was demonstrated in murine hepatitis virus during mixed infection, where the majority of viruses recovered after three passages were recombinants [51] . Recombination was also reported for MERS-CoV and SARS-CoV. Seven putative recombination regions were detected in ORF1ab and S protein between SARS-CoV and six other coronaviruses by in silico analysis of their genomes [52] . Similarly, bioinformatic analysis of MERS-CoV genomic data revealed 28 recombinant sequences from humans and camels [53] . Recombination in SARS-CoV-2 is not yet clearly understood. Initial studies suggested that it may have occurred in the course of SARS-CoV-2 evolution [9] , while other researchers excluded the possibility of recombination based on a full genome evolutionary analysis investigating putative recombination events [11] .\nTo better understand the evolution of SARS-CoV-2, we performed a phylogenetic analysis of 45 representative coronaviruses from 18 countries including SARS-CoV, SARS-CoV-2, HCoV, bat SARS . The other third of SARS CoV-2 includes four genes (in green) that encode four structural proteins (S, M, E, N), and six accessory genes (in blue) that encode six accessory proteins (orf3a, orf6, orf7a, orf7b, orf8, and orf10).\nThe 5 UTR and 3 UTR of SARS CoV-2 are comprised of 265 and 229 nucleotides, respectively. Orf1ab is 21,290 nucleotides and encodes either replicase proteins pp1a of 4405 amino acids (aa) (nsp1-nsp11) or pp1ab of 7096 aa (nsp1-nsp16), according to ribosomal frameshift. Of these proteins, (1) nsp1 suppresses the antiviral host response, (2) nsp3 is a papain-like protease, (3) nsp5 is a 3CLpro (3C-like protease domain), (4) nsp7 makes a complex with nsp8 to form a primase, (5) nsp9 is responsible for RNA/DNA binding activity, (6) nsp12 is an RNA-dependent RNA polymerase (RdRp), (7) nsp13 is confirmed as a helicase, (8) nsp14 is a 3 -5 exonuclease (ExoN), 9) nsp15 is a poly(U)-specific endoribonuclease (XendoU). The remaining nsps are involved in transcription and replication of the viral genome [13, 46, 47] .\nSingle-stranded RNA viruses exhibit a faster biological mutation rate due to the lack of proofreading activity of viral RNA polymerases [48] ; however, unlike other mutation-prone RNA viruses, with the exception of the Arenaviridae family, CoVs do have limited proofreading capabilities, with the nsp14 protein allowing for the enhanced genome size of CoV family members [49] .\nRecombination is another mechanism of evolution in coronaviruses [50] . A high recombination frequency was demonstrated in murine hepatitis virus during mixed infection, where the majority of viruses recovered after three passages were recombinants [51] . Recombination was also reported for MERS-CoV and SARS-CoV. Seven putative recombination regions were detected in ORF1ab and S protein between SARS-CoV and six other coronaviruses by in silico analysis of their genomes [52] . Similarly, bioinformatic analysis of MERS-CoV genomic data revealed 28 recombinant sequences from humans and camels [53] . Recombination in SARS-CoV-2 is not yet clearly understood. Initial studies suggested that it may have occurred in the course of SARS-CoV-2 evolution [9] , while other researchers excluded the possibility of recombination based on a full genome evolutionary analysis investigating putative recombination events [11] .\nTo better understand the evolution of SARS-CoV-2, we performed a phylogenetic analysis of 45 representative coronaviruses from 18 countries including SARS-CoV, SARS-CoV-2, HCoV, bat SARS CoV, bat SARS-like CoV, and MERS-CoV. The viral genomes were obtained from the GISAID and NCBI databases. Multiple sequence alignment was performed using kalign 3 [54] . A phylogenetic tree was constructed based on whole-genome sequences (coding sequences of all genes) in IQ-TREE, using the maximum likelihood method, ultrafast bootstrap approximation, and ModelFinder [55, 56] . The tree was drawn to scale, with branch lengths measured in the number of substitutions per site.\nThe bootstrap values were determined by 1,000 replicates. The tree was visualized in MEGA X [57] ( Figure 2 ).\nCoV, bat SARS-like CoV, and MERS-CoV. The viral genomes were obtained from the GISAID and NCBI databases. Multiple sequence alignment was performed using kalign 3 [54] . A phylogenetic tree was constructed based on whole-genome sequences (coding sequences of all genes) in IQ-TREE, using the maximum likelihood method, ultrafast bootstrap approximation, and ModelFinder [55, 56] . The tree was drawn to scale, with branch lengths measured in the number of substitutions per site. The bootstrap values were determined by 1,000 replicates. The tree was visualized in MEGA X [57] ( Figure 2 ).\nIn the analysis we performed, all SARS-CoV-2 samples from the 18 countries clustered together and were close to bat SARS or SARS-like coronaviruses, with Wuhan bat CoV RaTG13 being the closest virus. In addition, MERS-CoV and human CoV HKU1 were very distant from SARS-CoV-2 ( Figure 2 ). Within MERS-CoV samples, the South China MERS-NL13892 clustered separately from other MERS-CoVs. The two bat SARS-like CoVs (bat-SL-CoVZC45 and bat-SL-CoVZXC21) were the second closest viruses from bats to SARS-CoV-2 ( Figure 2 ). All SARS-CoVs from China, Canada, England, and the US were in a single cluster. The tree was constructed in IQ-TREE using the maximum likelihood method, ModelFinder, and ultrafast bootstrap approximation (1000 replicates). The tree is drawn to scale, with branch lengths (numbers below the branches) measured in the number of substitutions per site. Branch lengths less than 0.3 are not shown. Numbers above the branches represent the percentage of replicate trees in which the associated viruses clustered together in the bootstrap test. The tree is rooted with two human coronavirus species from the genus Alphacoronavirus as an outgroup (HCoV-229E and HCoV-NL63).\nIn the analysis we performed, all SARS-CoV-2 samples from the 18 countries clustered together and were close to bat SARS or SARS-like coronaviruses, with Wuhan bat CoV RaTG13 being the closest virus. In addition, MERS-CoV and human CoV HKU1 were very distant from SARS-CoV-2 ( Figure 2 ). Within MERS-CoV samples, the South China MERS-NL13892 clustered separately from other MERS-CoVs. The two bat SARS-like CoVs (bat-SL-CoVZC45 and bat-SL-CoVZXC21) were the second closest viruses from bats to SARS-CoV-2 ( Figure 2 ). All SARS-CoVs from China, Canada, England, and the US were in a single cluster.\nZhou et al. [9] conducted a phylogenetic analysis of SARS-CoV-2 against previously identified coronaviruses based on their whole-genome sequences, main structural protein genes, and non-structural protein genes. SARS-CoV-2 clustering was different depending on whether the whole genome or specific genes were used in the analysis. For example, SARS-CoV-2 clustered with the members of the subgenus Sarbecovirus including the SARS-CoV (79.5% identical) that caused the global pandemic in 2003 and other bat SARS-like viruses (96% identical at the whole-genome level), but the topological position within the Sarbecoviruses changed when individual genes (ORF1ab, S, E, M, and N) were used for clustering [2, 9] ."}, {"section_title": "SARS-CoV-2 Mutations and Their Effects", "text": "Based on the whole-genome sequence alignment, SARS-CoV-2 shares 89% identity with bat SARS-like CoVZXC21, 82% with SARS-CoV, and 96.3% with bat CoV RaTG13 [11, 13] . Alignment of the predicted protein sequences of SARS-CoV-2 to those of SARS-CoV or SARS-like coronaviruses revealed a total of 380 amino acid substitutions between these viruses [2] . These amino acid substitutions were distributed as follows: 348 mutations in nonstructural proteins (ORF1ab, 3a, 3b, 7a, 7b, 9b, and ORF14), 27 in S protein, and 5 in N protein. No amino acid substitutions were detected in E or M proteins, indicating that E and M proteins are highly conserved among these viruses.\nIt has been reported that SARS-CoV-2 uses the same cellular receptor, hACE2, as SARS-CoV to gain entry into the cell [9, 58, 59] . The analysis of the receptor-binding domains (RBD) of SARS-CoV and SARS-CoV-2 S protein revealed similar binding affinities [60] . Wu et al. [2] found a total of 27 amino acid substitutions in the S protein but not in the receptor-binding motif (RBM) that directly interacts with hACE2, which may affect host tropism. These 27 substituted residues were distributed as follows: 17 in the S1 subunit [6 in the RBD and 6 in the subdomain (SD)] and 10 in the S2 subunit. Wan et al. [58] reported similarity in the spike protein RBD, including RBM, of both SARS-CoV and SARS-CoV-2, in addition to the presence of several residues in SARS-CoV-2 RBM that favor the interaction with human ACE2. These results agree with the genomic analysis of SARS-CoV-2, according to which the S2 subunit of the spike protein shares 99% identity with those of two bat SARS-like CoVs (SL-CoVZXC21 and ZC45) and of human SARS-CoV [13] . While the SARS-CoV-2 S2 subunit was conserved, the S1 subunit shares an overall 70% identity with those of bat and human SARS-CoV. The RBD core domain of S1 is highly conserved, with most of the amino acid differences located in the external subdomain that is responsible for the direct interaction with host receptors [13] . Investigators have also reported the presence of a polybasic cleavage site and predicted O-linked glycans that are unique to SARS-CoV-2 S protein. Differences in SARS-CoV-2 S protein and the high contagious nature of this virus suggest that SARS-CoV-2 has evolved via natural selection for binding to human ACE2 receptor [61] .\nORF3b also differs in SARS-CoV-2. ORF3b deletion mutations in SARS-CoV do not affect viral replication in vitro [62] . ORF3b may play a role in viral pathogenicity in addition to its inhibitory effects on interferon (IFN) expression and signaling [63, 64] . Recently, a novel short putative protein was identified in ORF3b of SARS-CoV-2 [13] ; however, the function of this novel protein is still not known. SARS-CoV-2 ORF8 is closer to those of bat SARS CoV ZXC21 and ZC45 and distant from that of human SARS-CoV [13] ."}, {"section_title": "Genetic Diversity of SARS-CoV-2", "text": "The assessment of genetic diversity among 86 complete or semi-complete genomes of SARS-CoV-2 viruses revealed three deletions in the genome of isolates from Japan, USA, and Australia in addition to many other substitution mutations. The deletion mutations were in the ORF1ab gene (3-nucleotide and 24-nucleotide deletion) and at the 3 end of the genome (10-nucleotide deletion). Of the 93 substitution mutations, 42 changed the amino acid sequence of structural and non-structural proteins [65] . The 3and 24-nucleotide deletions in ORF1ab are expected to reduce the protein sequence by 1 and 8 amino acid residues, respectively, without changing the reading frame, but the functional effects have yet to be investigated.\nThe alignment of SARS-CoV-2 reference S protein gene against all SARS-CoV-2 sequenced genomes from China, USA, Japan, Australia, and Taiwan revealed 99.97-100% identity, with 100% query coverage (also confirmed by our phylogenetic analysis, Figure 2 ), while the identity and coverage for SARS-CoV S protein gene were 74.5% and 91%, respectively. Also, the S protein gene from bat SARS and SARS-like coronavirus isolates shared 76.5-83% identity with that of SARS-CoV-2. This agrees with previous conclusions regarding the evolutionary analysis of SARS-CoV-2 [11, 44] . In the phylogenetic analysis we performed, SARS-CoV-2 viruses were in the same cluster regardless of the geographic region ( Figure 2 ). These results strongly suggest the possibility of a recent common ancestor for all SARS-CoV-2 or the transmission of the same virus strain across countries."}, {"section_title": "Epidemiology of COVID-19", "text": "The outbreak of COVID-19 originated from Wuhan City, Hubei province, in China. Fifty-five percent of the infected cases before 1 January 2020 were linked to the Huanan Seafood Wholesale Market. However, the first human-to-human case of SARS-CoV-2 infection reported on 1 December 2019 did not have any exposure to this market [66, 67] . In mid-January 2020, SARS-CoV-2 spread to other provinces of China due to the Spring Festival travel season. SARS-CoV-2 was transmitted from China to other countries via international travelers. On 13 January 2020, the first case of SARS-CoV-2 infection was confirmed outside China in Thailand, and on 16 January 2020 the first infected case was confirmed in Japan. These cases were also linked to the Huanan Seafood Wholesale Market. By 25 January 2020, the number of confirmed cases had risen to 2062, including 2,016 in China, Thailand, Hong Kong, Macau, Australia, Malaysia, Singapore, France, Japan, South Korea, Taiwan, the US, Vietnam, Nepal, and Sweden. On 30 January 2020, China reported a sharp rise in the number of infected cases, with the presence of infection in more than 18 countries. Therefore, WHO declared the SARS-CoV-2 outbreak to be a Public Health Emergency of International Concern [68] .\nAs of 16 March 2020, more than 150 countries and territories have been affected, with major outbreaks in central China, South Korea, Italy, Iran, France, and Germany [69] . There were 167,511 confirmed cases of SARS-CoV-2 infections, with 6606 deaths and about 8% estimated mortality rate. More than 73% of these cases have been reported in mainland China [69] . At this time, the number of global cases has shown a drastic increase within a short time, confirmed cases and deaths in China have not increased too much, while confirmed cases and deaths in other countries have drastically increased ( Table 4 ). The number of confirmed cases increased from 2798 to 17,391 in one week (between 27 January and 3 February), and the number of infected countries doubled (from 12 to 24). Due to the rapid increase of the number of infected cases and infected countries, the WHO declared SARS-CoV-2 a pandemic on 11 March 2020 and on 13 March 2020, the WHO declared Europe to be the new center of the pandemic due to the massive increase of confirmed cases there [70] . On 15 ,889, were in Italy). One week later (13 April 2020), the number of confirmed cases of SARS-CoV-2 increased 1.7 times (up to 524,514 confirmed cases), and the number of deaths increased 2.5 times (up to 20,444 deaths) in the USA alone. The number of confirmed cases, deaths, and infected countries are shown in Table 4 . "}, {"section_title": "Source of Infection and Evolution of SARS-CoV-2", "text": "The origins of more than 75% of coronavirus infections are considered zoonotic, i.e., animals are the main source of the outbreaks. For example, SARS-CoV was transmitted from palm civets to humans, and MERS-CoV from dromedary camels to humans. Bats are currently considered a reservoir for all human coronaviruses, as mentioned above [5, 71] . Many coronaviruses are circulating in animals but have not yet infected humans. The type of animal that SARS-CoV-2 originated from is still unclear. At the beginning of the outbreak in Wuhan, China, many patients were linked to the Huanan Seafood Wholesale Market, suggesting animal-to-person spread. After retrospectively studying case reports, the number of patients that did not have exposure to animal markets has risen, indicating person-to-person spread was also occurring at that time [66] . SARS-CoV-2 is closely related to bat coronaviruses and SARS-CoV [8] . A group of researchers reported early in the outbreak that the novel SARS-CoV-2 has the highest similarity of codon usage bias with snakes [72, 73] ; however, this method to determine initial host origins is dubious. Interestingly, researchers also reported one amino acid difference in the receptor-binding domain of the S protein of Pangolin-CoV compared to that of SARS-CoV-2, suggesting that pangolins might play a role as an intermediate host (Xiao et al., data currently under review). Another group of researchers reported that the virus originated from bats based on the genome sequence of SARS-CoV-2, which is 96% identical to bat coronavirus RaTG13. There were speculations that SARS-CoV-2 is a laboratory-engineered CoV and leaked directly from a laboratory in Wuhan where a bat CoV (RaTG13) was recently reported. However, there is no evidence to support this allegation [74] . Recently, a group of researchers found that SARS-CoV-2 replicates poorly in dogs, pigs, chickens, and ducks but efficiently in ferrets and cats [75] . Scientists are still trying to find the main source of the disease outbreak and identify the definitive intermediate hosts."}, {"section_title": "Mode of SARS-CoV-2 Transmission to Humans: Transmission Dynamics and Virus Persistence", "text": "Both established (SARS-CoV, MERS-CoV) and novel (SARS-CoV-2) coronaviruses were reported to spread from an infected person to a non-infected person through direct or indirect contact. SARS-CoV-2 infection was reported to be transmitted directly from person to person like most respiratory viruses via close contact with an infected person or through respiratory droplets (aerosol) produced when an infected person coughs or sneezes. These droplets can be inhaled to reach the lung. The virus can be indirectly transmitted via touching a surface or an object that was previously contaminated with the virus and then touching the face, eyes, or mouth [76] and possibly via the fecal-oral route [77, 78] . Asymptomatic carriers (during the incubation period of the virus) and patients after recovery from the acute form of the disease are also considered a potential source of virus transmission to healthy persons [10, 12] . Interestingly, human coronaviruses are able to survive on steel, metal, wood, aluminum, paper, glass, plastic, ceramic, disposable gowns, and surgical gloves for 2-9 days. High temperature (≥30 • C) can reduce the persistence period, while low temperature (4 • C) increases the persistence time up to 28 days [79] . Transmission of the virus vertically from mother to fetus or via breast milk has not been confirmed yet [80] . The transmission cycle of coronavirus among animals and humans is shown in Figure 3 . \nBoth established (SARS-CoV, MERS-CoV) and novel (SARS-CoV-2) coronaviruses were reported to spread from an infected person to a non-infected person through direct or indirect contact. SARS-CoV-2 infection was reported to be transmitted directly from person to person like most respiratory viruses via close contact with an infected person or through respiratory droplets (aerosol) produced when an infected person coughs or sneezes. These droplets can be inhaled to reach the lung. The virus can be indirectly transmitted via touching a surface or an object that was previously contaminated with the virus and then touching the face, eyes, or mouth [76] and possibly via the fecal-oral route [77, 78] . Asymptomatic carriers (during the incubation period of the virus) and patients after recovery from the acute form of the disease are also considered a potential source of virus transmission to healthy persons [10, 12] . Interestingly, human coronaviruses are able to survive on steel, metal, wood, aluminum, paper, glass, plastic, ceramic, disposable gowns, and surgical gloves for 2-9 days. High temperature (≥30 °C) can reduce the persistence period, while low temperature (4 °C) increases the persistence time up to 28 days [79] . Transmission of the virus vertically from mother to fetus or via breast milk has not been confirmed yet [80] . The transmission cycle of coronavirus among animals and humans is shown in Figure 3 . "}, {"section_title": "Risk Factors for SARS-CoV-2 Infection and Their Assessment", "text": "There are many factors that affect SARS-CoV-2 transmission and spread. These factors include, but are not limited to: (1) travel to or contact with individuals who have recently visited Wuhan, China, or other places experiencing an outbreak; (2) close contact with persons who are diagnosed positive for the disease, such as healthcare workers caring for patients with SARS-CoV-2; (3) contact with droplets and secretions (produced by sneezing or coughing) from an infected person and eating or handling wild animals native to China such as bats. Additionally, the risk of infection is higher for the elderly and for patients suffering from pre-existing illnesses such as cardiovascular disease, hypertension, diabetes, and chronic respiratory disease [66] . The reported fatality rate based on age is 14.8% for people ˃80 years of age, 8% for people between 70 and 79 years, 3.6% for people between 60 and 69 years, 1.3% for people between 50 and 59 years, 0.4% for people between 40 and 49 years, \nThere are many factors that affect SARS-CoV-2 transmission and spread. These factors include, but are not limited to: (1) travel to or contact with individuals who have recently visited Wuhan, China, or other places experiencing an outbreak; (2) close contact with persons who are diagnosed positive for the disease, such as healthcare workers caring for patients with SARS-CoV-2; (3) contact with droplets and secretions (produced by sneezing or coughing) from an infected person and eating or handling wild animals native to China such as bats. Additionally, the risk of infection is higher for the elderly and for patients suffering from pre-existing illnesses such as cardiovascular disease, hypertension, diabetes, and chronic respiratory disease [66] . The reported fatality rate based on age is 14.8% for people >80 years of age, 8% for people between 70 and 79 years, 3.6% for people between 60 and 69 years, 1.3% for people between 50 and 59 years, 0.4% for people between 40 and 49 years, 0.2% for people between 10 and 39 years; no fatalities have been reported for children under 10 years of age. Notably, the fatality rate is higher in males (2.8%) than in females (1.7%) [81, 82] ."}, {"section_title": "Clinical Characteristics and Susceptibility of SARS-CoV-2 Infection in Humans", "text": "The estimated incubation period of the novel coronavirus ranges from 2 to 14 days. However, some cases had an incubation period of 21, 24, or 27 days [83] . The complete clinical picture of SARS-CoV-2 is still unclear. The disease begins with flu-like symptoms that include fever, fatigue, dry cough, sore throat, shortness of breath, headache, chest tightness, chest pain, and muscle pain. Some of SARS-CoV-2 patients have runny nose, nausea, vomiting, and diarrhea [84] . People can be infected without showing symptoms, which allows the virus to spread more effectively from person to person. Complications can occur due to COVID-19 leading to severe infections, such as pneumonia (infection of the lungs), kidney failure, and death [8] . The mild phase of the disease can last up to 2 weeks, while severe or critical disease lasts approximately 3 to 6 weeks (this analysis was conducted on 55,924 confirmed cases). Additionally, the time from the disease onset to the development of severe disease is one week, while the time from the onset of symptoms to death ranges from 2 to 8 weeks [82] .\nBased on the data analysis of 72,314 confirmed cases of SARS-CoV-2 in Wuhan City, China, by 11 February, 80.9% of the cases were mild with flu-like symptoms, and patients recovered at home, 13.8% were severe with pneumonia and shortness of breath, 4.7% were critical with respiratory failure and septic shock resulting in organs failure, and approximately 2% of the cases were fatal [85] . Another study was conducted on 99 hospitalized patients, and symptoms were classified as follow: fever (83%), cough (82%), shortness of breath (31%), muscle ache (11%), confusion (9%), headache (8%), sore throat (5%), runny nose (4%), chest pain (2%), diarrhea (2%), and nausea and vomiting (1%) [8] ."}, {"section_title": "Diagnosis of SARS-CoV-2 Infection", "text": "The rapid diagnosis of SARS-CoV-2 infection is the cornerstone of disease control. It depends on several criteria including case history, clinical symptoms, serology, molecular diagnosis, and computed tomography (CT) imaging. On 2 March 2020, WHO published interim guidance for laboratory testing of suspected human cases, with precautions for specimen collection, packing, shipment, and amplification of nucleic acid to detect viral genes (N, E, S, and RdRp) [82] . SARS-CoV-2 uses the same cell entry receptor, hACE2, as SARS-CoV. Therefore, oral swabs, bronchoalveolar lavage fluid (BALF), blood, as well as anal swabs are the best samples used for virus diagnosis [86] . A proper diagnosis depends primarily on the factors described below."}, {"section_title": "Epidemiological History", "text": "The strict monitoring of case history in clinically suspicious patients is considered the first step in the early diagnosis of SARS-CoV-2 infection. Clinically suspicious patients are those who suffer from fever and lower respiratory tract infection symptoms (for details, see the clinical characteristics section) and reside within or have traveled to endemic regions or had close contact with a confirmed or suspected case. Additionally, SARS-CoV-2 can be transmitted by symptomatic and asymptomatic patients especially to the high-risk group mentioned above (for details, see the risk assessment section) [13] ."}, {"section_title": "Laboratory Diagnosis", "text": "The blood profiles of patients suffering from SARS-CoV-2 infection revealed the following: (1) increased C-reactive protein and erythrocytes, (2) increased myohemoglobin, liver enzymes, and muscle enzymes, with a high level of D-dimer in severe cases, and (3) normal or decreased white blood cell counts and lymphocytes in the early stage of the disease, with advanced lymphocytopenia in severe cases [13] . In ICU patients, high levels of plasma granulocyte colony-stimulating factor (GCSF), IP10, IL2, IL7, IL10, TNF-α, and MIP1a were reported [38] ."}, {"section_title": "Virus Detection", "text": "Electron microscope examination of SARS-CoV-2 revealed the typical coronavirus morphology. Further, SARS-CoV-2 was successfully isolated from human respiratory epithelial cells or BALF samples of infected patients using Huh7 cells and Vero E6 cells. The isolated strain was confirmed by immunofluorescent antibody techniques using the cross-reactive nucleoprotein (NP) antibody. Serum neutralization tests (SNT) using Vero E6 cells were conducted to confirm the neutralization activity in IgG-positive viral samples [87] .\nElectron microscope examination of SARS-CoV-2 revealed the typical coronavirus morphology. Further, SARS-CoV-2 was successfully isolated from human respiratory epithelial cells or BALF samples of infected patients using Huh7 cells and Vero E6 cells. The isolated strain was confirmed by immunofluorescent antibody techniques using the cross-reactive nucleoprotein (NP) antibody. Serum neutralization tests (SNT) using Vero E6 cells were conducted to confirm the neutralization activity in IgG-positive viral samples [87] ."}, {"section_title": "Serological and Molecular Diagnosis", "text": "IgM and IgG ELISA detection kits using bat SARSr-CoV Rp3 NP were developed with no cross-reaction against human coronaviruses except SARSr-CoV [80] . Using these serological tools, viral antibody titers were increased in SARS-CoV-2-infected patients [38] . The procedures of ELISA for the determination of SARS-CoV-2 IgG were described before [86] . Nucleic acid detection is the main, fastest, and most sensitive test for the diagnosis of SARS-CoV-2 infection. Recently, two nested RT-PCR and two real-time RT-PCR assays have been developed with successful detection of the first 25 positive cases of infection in Japan [88] . Three real-time RT-PCR techniques have been designed based on the E, RdRp, and N genes [89] . Also, scientists established molecular detection tools for SARS-CoV-2 based on the S gene [86] .\nIgM and IgG ELISA detection kits using bat SARSr-CoV Rp3 NP were developed with no cross-reaction against human coronaviruses except SARSr-CoV [80] . Using these serological tools, viral antibody titers were increased in SARS-CoV-2-infected patients [38] . The procedures of ELISA for the determination of SARS-CoV-2 IgG were described before [86] . Nucleic acid detection is the main, fastest, and most sensitive test for the diagnosis of SARS-CoV-2 infection. Recently, two nested RT-PCR and two real-time RT-PCR assays have been developed with successful detection of the first 25 positive cases of infection in Japan [88] . Three real-time RT-PCR techniques have been designed based on the E, RdRp, and N genes [89] . Also, scientists established molecular detection tools for SARS-CoV-2 based on the S gene [86] ."}, {"section_title": "Radiological Diagnosis", "text": "Chest X-ray examination in the early stage of the disease shows interstitial changes and multiple small plaque shadows. Chest CT scans play an important role in the diagnosis of acute respiratory disease syndrome (ARDS) and pneumonia as well as in the early detection of lung parenchymal abnormalities in patients at risk and provide an impression of secondary infection (Figure 4 ). \nChest X-ray examination in the early stage of the disease shows interstitial changes and multiple small plaque shadows. Chest CT scans play an important role in the diagnosis of acute respiratory disease syndrome (ARDS) and pneumonia as well as in the early detection of lung parenchymal abnormalities in patients at risk and provide an impression of secondary infection ( Figure 4 ). Assessing these lungs parenchymal abnormalities conveys disease severity to clinicians. Using artificial intelligence models in the future may be useful in mass screening, to allow risk prioritization and help to minimize turnaround time [90] . Pan et al. [91] conducted a retrospective study to elaborate the time course of lung changes during recovery from infection. They described Assessing these lungs parenchymal abnormalities conveys disease severity to clinicians. Using artificial intelligence models in the future may be useful in mass screening, to allow risk prioritization and help to minimize turnaround time [90] . Pan et al. [91] conducted a retrospective study to elaborate the time course of lung changes during recovery from infection. They described findings using international standard nomenclatures such as ground-glass opacity (GGO), consolidation, and crazy paving patterns. They established a semi-quantitative scoring system of 5 grades to quantify the degree of involvement based on an area ranging from 0% to >75%. The total score ranged from 0 to 25 (max), and involvement was subpleural, random, or diffuse. They found that in early stages (0-4 days after the onset of symptoms), GGO was the main finding in lower lung lobes; in progressive stages (5-8 days), the progression of lung disease involved three patterns of ground-glass, consolidation, and crazy paving, while in peak stages (9-13 days) , dense consolidation became the prevalent feature; in absorption stages (>14 days), GGO was detected with no crazy paving and resolution of consolidations [91] . More than 75% of SARS-CoV-2-affected patients suffered from bilateral lung involvement, and 71% have multilobe involvement. CT examinations of 21 patients showed 29% consolidation and 86% GGO in the chest [8, 9, 92, 93] . Another study examined 51 cases by CT and reported that 77% showed pure GGO, 75% exhibited GGO with reticular and/or interlobular septal thickness, 59% had GGO with consolidation, while 55% revealed pure consolidation. Bilateral lung involvement was reported in 86% of cases; in 80% of the cases the posterior part of the lung was involved, while in 86%, the periphery was involved [94] ."}, {"section_title": "Control and Treatment of COVID-19 Infection", "text": "In January 2020, the WHO issued guidance for the clinical management of SARS when SARS-CoV-2 infection was suspected. In this guidance, the start of emergency treatments, immediate implementation of prevention and control strategies, early supportive therapy and prevention of SARS-CoV-2 complications were described in detail [15] . So far, there are no approved specific antiviral drugs for SARS-CoV-2 infection. Therefore, preventive measures and inactivation of the virus are essential to stop and control the spread of the disease. Human coronaviruses can be inactivated using 0.5% hydrogen peroxide, 62-71% ethanol, 0.1% sodium hypochlorite, 0.7-1% formaldehyde, 2% glutaraldehyde, or 0.23% povidone iodine within 1 minute. Other disinfectants such as 0.02% chlorhexidine digluconate, 0.55% orthophtalaldehyde, or 0.05-0.2% benzalkonium chloride are less effective [79] .\nIn light of the urgent clinical demand, many drugs are approved to be used for clinical trials against SARS-CoV-2 infection, such as lopinavir/ritonavir, arbidol, interferon-alpha, favipiravir, chloroquine phosphate, darunavir/cobicistat, oseltamivir, and methylprednisolone. The most used antiviral drugs [95] are summarized in Table 5 .\nGenerally, coronaviruses are not sensitive to current antiviral drugs, and high concentrations of drugs effective on these viruses cannot be used in vivo.\nTherefore, combinations of different therapies have been used for the treatment of coronavirus infections [96] . Some drug combinations that could be successful for the treatment of SARS-CoV-2 patients are lopinavir and ritonavir [97, 98] , lopinavir/ritonavir plus arbidol [99] , and ribavirin and interferon [100, 101] . The use of anti-inflammatory drugs such as glucocorticoids, IL-6 antagonist, janus kinase inhibitors (JAK), and choloroquine/hydrocholoroquine in SARS-CoV-2 patients is a dilemma, especially in patients suffering from an impaired immune system. Balancing the risk-benefit ratio is a critical issue. Corticosteroids may delay the elimination of the virus and increase the risk of secondary infection. In addition, drugs targeting pro-inflammatory cytokines can only inhibit specific inflammatory factors and thus may not be very effective in curbing the cytokine storm (excessive and uncontrolled release of pro-inflammatory cytokines). Moreover, some anti-inflammatory drugs such as JAK block INF-α production, which is important in fighting the virus [102] .\nAdditionally, fecal transplantation was approved for clinical trials as a therapeutic option for SARS-CoV-2-related pneumonia based on the promising results obtained from fecal microbiota transplantation in patients suffering from antibiotic-associated diarrhea, active ulcerative colitis, and other viral infections [103] [104] [105] [106] . Recently, it was found that intestinal microbiota-derived IFN in lung stroma confers protection against viral diseases such as avian influenza and respiratory syncytial virus [103] . Moreover, based on historical records of the effect of antiviral herbs on SARS and influenza H1N1, Chinese herbal formulas could be an alternative approach for the prevention of SARS-CoV-2 in a high-risk population [107] , if no scientifically based therapeutics are available. It was found that Sambucus formasana Nakai exhibited a strong antiviral effect against human coronavirus NL63 [108]. "}, {"section_title": "Chloroquine", "text": "Increases pH in host cell lysosomes and negatively influences virus-receptor binding, as well as interferes with the glycosylation of cellular receptors of SARS-CoV -Exhibited a promising antiviral effect against SARS-CoV-2 in vitro -Improved COVID-19-pneumonia patients and shortened the course of the disease [114] Remdesivir A monophosphoramidate of adenosine prodrug that incorporates into nascent viral RNA chains causing pre-mature termination -Used against a wide range of RNA viruses such as Filoviridae, Paramyxoviridae, Pneumoviridae, and Coronaviridae; used successfully in COVID-19 treatment in the United States and showed no adverse events [115] Darunavir and Cobicistat Inhibit 3 C-like protease (3CLpro).\n-Used for the treatment of MERS-CoV in experimental animals -Used for the treatment of HIV-1 patients [116] "}, {"section_title": "Vaccination", "text": "To date, there is no vaccine to prevent SARS-CoV-2 infection, and trials for vaccine development are in the preliminary stages of research. Several vaccine candidates such as live attenuated, adenovirus-vectored, recombinant protein, and nucleic acid (DNA and mRNA) vaccines are in the pipeline [123] ."}, {"section_title": "Preventive Measures to Control the SARS-CoV-2 Spread", "text": "The epidemiology of SARS-CoV-2 is still unclear, and data availability is limited. Therefore, it is imperative to follow preventive measures and safety precautions issued by health authorities to limit exposure to the virus and to reduce further spread. General hygienic measures should be implemented, such as (1) washing hands often with soap and water or an alcohol-based hand sanitizer, (2) cough or sneeze etiquette, recommending covering of the mouth, (3) avoiding touching eyes, nose, and mouth if the hands are not clean, (4) avoiding close contact with sick persons, (5) avoiding sharing dishes, glasses, bedding, and other household items with sick people, (6) cleaning and disinfection of surfaces that are often touched, and (7) staying home from work, school, and public areas when feeling sick.\nThe transmission route of SARS-CoV-2 is probably not only through cough, respiratory droplets, and/or contaminated surfaces [13, 124] , but also through fecal-oral transmission [78] . Therefore, strict hygienic measures should be followed, especially in dense cities or agricultural spaces [125] .\nSince the SARS-CoV-2 spread is primarily driven by travel, screening of travelers who arrive at airports from pandemic areas for possible SARS-CoV-2 infection and entry-screening procedures are necessary. Also, general hygienic precautions during travel are highly recommended. Travelers who suffered from acute respiratory infection should be tested and reported to the respective public health authorities [73] . In addition, people should be motivated to notify and report about travel history and close contacts in case of SARS-CoV-2 infection.\nAsymptomatic carriers (during the incubation period) and patients after recovery from the acute form are also considered potential sources of the virus [12, 13] . Strict hygienic measures should be implemented to avoid virus transmission to healthcare workers and other contacts, i.e., placement of SARS-CoV-2 suspected or confirmed patients in single-person rooms and wearing personal protection equipment (PPE) such as masks, goggles, and protective gowns. Because early diagnosis and detection of asymptomatic carriers of SARS-CoV-2 are successful factors for the treatment and prevention of transmission, health authorities should designate laboratories to implement tests for a rapid and accurate diagnosis [126] . The control of coronaviruses is based on biosecurity regarding animals as well as on shifts in food habits, including discouraging the consumption of bushmeat and of animal products without appropriate cooking [127] . Ban of wet marketplaces where live or dead animals are handled should be implemented. Surveillance among people who have contact with wildlife and improvement of biosecurity regarding wildlife trade are urgently needed to prevent the next pandemic outbreak [128] ."}, {"section_title": "Challenges to Control SARS-CoV-2 and the Role of the One-Health Approach in Disease Control", "text": "The epidemiology of SARS-CoV-2 is still unclear. Many unresolved questions related to SARS-CoV-2 epidemiology and pathogenicity pose great challenges for researchers. These unresolved questions include: What is the origin of SARS-CoV-2? What is the intermediate host that transmitted the virus from bats? Why does the virus cause severe disease and mortality in the elderly or those with co-morbidities, while it is milder in children? Are aerosol, saliva, feces, urine, and foodborne the only routes of transmission? What are the other unknown routes of transmission?\nControl of the SARS-CoV-2 outbreak and future epidemics requires global efforts among medical and veterinary clinicians, diagnosticians, epidemiologists, public health experts, vaccinologists, pharmaceutical industries, economists, and governments to implement a One-Health approach [128, 129] . These measures must include: (1) writing policies and supporting funds required for the implementation of One Health, prevention, and control measures, (2) hiring well-trained and professional personnel, (3) performing rapid and accurate diagnosis and treatment of infected persons, (4) developing and providing vaccines for virus control in humans, (5) conducting surveillance among wildlife for the identification and characterization of possible reservoirs and surveillance among people who are in contact with wildlife to identify risk factors in human behaviors and living environment, (6) improving hygienic measures, (7) assessing the social and economic impacts of COVID-19 on the population, (8) utilizing veterinary experience in the disinfection of premises and gatherings under the supervision of health authorities to decrease outbreaks in humans, (9) providing antiviral drugs for the treatment of the disease in humans, and (10) increasing public health awareness about the virus and its transmission."}, {"section_title": "Conclusions and Future Perspective", "text": "The SARS-CoV-2 outbreak started in Wuhan City, China, in December 2019. It is now a global pandemic, with 1,773,084 confirmed cases, 111,652 deaths, and 467,074 recoveries (as of 13 April 2020). The virus has the potential for rapid and extensive spread between people and countries. There are a lot of misleading information and knowledge gaps on the newly emerged SARS-CoV-2. Therefore, we reviewed the latest updates about different aspects including epidemiology, source of infection, transmission dynamics, zoonotic potential, virus characteristics, and discovery of novel strategies for disease control to avoid spillover of infection in the future. Bats play an important role in the transmission of the infection to humans. Coronaviruses are genetically diverse and have a high tendency towards frequent genetic mutations and gene recombination, which increases the risk of interspecies transmission. Information about the incubation period can help in establishing an effective quarantine for asymptomatic carriers, thus preventing the virus spread. From our perspectives and based on the currently available information about the virus and its epidemiology, the control of the SARS-CoV-2 requires an effective and global disease coordination effort including multidisciplinary research efforts (One-Health approach) through collaboration between governments, epidemiologists, virologists, health authorities, veterinarians, and physicians. At this stage of the disease outbreak, developing vaccines is crucial to limit the spread of the infection."}]