[{"section_title": "Abstract", "text": "As interest in local food systems as a community development tool increases, scholars and practitioners are looking for methods to count progress toward benchmarks. This paper reports on efforts to count local food consumption as part of a statewide strategic plan for food systems development in Vermont. It provides longitudinal data from three waves of counting (2011, 2014, and 2017), finding increases over time due to both increased consumption and improved counting methods. The paper reflects on successes and challenges over the study period, focusing on data availability, key assumptions, and limitations. It concludes with future directions of inquiry into measuring food relocalization efforts."}, {"section_title": "Introduction", "text": "Local food systems continue to draw the interest of scholars and practitioners because of their potential to contribute to economic development as well as social and public health goals (Conner & Garnett, 2016; Conner & Levine, 2007; Low et al., 2015; Martinez et al., 2010) . A growing body of research has examined the economic impact of actual or proposed initiatives (Conner, Knudson, Hamm, & Peterson, 2008; Hughes, Brown, Miller, & McConnell, 2008; Jablonski & Schmit, 2016; Swenson, 2006) . Furthermore, the 2016 U.S. Department of Agriculture (USDA) Economics of Local Food Systems toolkit (Thilmany McFadden et al., 2016) and a recent special issue of this journal on the utilization of the toolkit principles (Thilmany McFadden & Jablonski, 2019) point to the importance of developing methods and metrics to assess relocalization efforts. A major data gap that remains to assess these relocalization efforts is the quantity of local food consumed at a larger scale, such as at the state level. This data gap is largely due to the unavailability of data through secondary datasets. In this paper, we replicate and build upon a previous study (Conner, Becot, Kahler, Sawyer, Hoffer, & Berlin, 2013) to assess how local food consumption has changed in Vermont between 2010 and 2017. By looking at changes over time, our article speaks to the outcomes of Vermont's extensive relocalization effort. To the best of our knowledge, no other state has undertaken a comprehensive counting of local food and beverage consumption over time. To be clear, local food counts such as ours are imperfect due to large remaining data gaps; however, these estimates provide key benchmarks and insights towards a greater understanding of the role played by local food systems in community and economic development.\nVermont, a small rural New England state with an historical emphasis on the dairy and maple sugar sectors, provides an interesting case study site, since it has extensively invested in its local food system and is seen by some as a national leader on this effort. In 2009, the state legislature signaled that the food system is a significant part of its overall economic development strategy through the passage of the Farm-to-Plate Investment Program (2009) . This investment program tasked the nonprofit Vermont Sustainable Jobs Fund to coordinate a systematic approach to food system development with an emphasis on economic devel-opment and jobs in the food system along with improving food access to all Vermonters, including supporting legislation. The Farm-to-Plate (FTP) investment program has since led to one of the most comprehensive statewide food plans in the United States. This plan is coupled with a coordinated network of actors in the public and private sectors who are implementing the plan. In a state with a population just over 625,000, the network includes about 350 members-representing a mix of nonprofits organizations, businesses, educational institutions, and health-care facilities.\nEarly on, FTP set the target for local food to reach 10% of total food consumption in the state by the year 2020 (Vermont Sustainable Jobs Fund, 2011) . To monitor progress toward that goal, FTP commissioned a University of Vermont research team that measured local food and beverage consumption in 2010, 2014, and 2017. While we have previously reported on the methods we used for our first wave of data collection (see Conner et al., 2013) , in this article we discuss how we have built on our original method over two more waves of local food consumption assessment. This article has relevance for other states, counties, and municipalities across the U.S. who have developed food system plans and are at varying stages of developing metrics to track progress toward their stated goals. After presenting our methods and results, we discuss the implications of our approach to data collection and findings using the USDA Economics of Local Food Systems toolkit (Thilmany McFadden et al., 2016) as a framework. While the first two waves of data collection were completed before the release of the toolkit, it not only provides a framework for individual local food systems projects assessment efforts, but also provides a framework to begin comparative work conducted across time and space toward a greater understanding of the economics of local food systems."}, {"section_title": "Literature Review", "text": ""}, {"section_title": "Local Food as a Conduit to Economic and Community Development", "text": "Local food has long been seen as a conduit to economic and community development. First, increasing local food consumption can stimulate the economy as local business owners purchase inputs and hire labor to meet the increased demand. Second, scholarship has long shown how the structure of farm operations, including ownership structure and scale, affects communities. Starting with Walter Goldschmidt's (1947) work and the hypothesis named after him, scholars have shown that industrialized farming overall has had a negative impact on the social and economic well-being of rural communities (Goldschmidt, 1947; Lobao, 1990; Lobao & Stofferahn, 2008) . Then, through the concept of civic agriculture, Lyson (2004) highlighted the ways in which smaller and family-owned operations are embedded within the social and economic fabric of their community. Placing local food production at the center of the community development strategy, then, would provide an avenue toward social, environmental, and economic sustainable development. More recently, empirical studies have pointed to the differences in the expenses of different types of farm operations. Compared to farm operations that do not participate in the local food system, farm operations participating in the local food system tend to purchase more of their inputs locally and tend to hire more labor (Jablonski & Schmit, 2016) .\nAs interest in local food has grown, so has interest in measuring the economic contribution and impact of local food initiatives. Previous studies have assessed increased purchases of local foods by consumers (Conner et al., 2008; Rossi, Johnson, & Hendrickson, 2017; Swenson, 2006) , increased sales at farmers' markets (Becot et al., 2018; Hughes et al., 2008; Hughes & Isengildina-Massa, 2015; Myers, 2004; Otto & Varner, 2005) , through food hubs (Jablonski & Schmit, 2015; Schmit, Jablonski, & Mansury, 2013) and through institutions (Becot et al., 2018; Becot, Conner, Imrie, & Ettman, 2016; Christensen, Jablonski, Stephens, & Joshi, 2017; Tuck, Haynes, King, & Pesch, 2010) . Scholars have pointed out the importance of using sound methods and data. Although recent studies have worked to address some of these methodological challenges (Becot et al., 2018; Jablonski & Schmit, 2016; Rossi et al., 2017; Swenson, 2006) , a lack of adequate data is still the biggest challenge Thilmany McFadden et al., 2016; Rossi et al., 2017) . The lack of data on local food sales at the macro level, such as the state or county, could explain the paucity of economic contribution studies. To our knowledge, previous studies using a macro-level approach have either used hypothetical scenarios (Conner et al., 2008; Swenson, 2006) or focused on the agricultural sector without considering other sectors of the food system (Rossi et al., 2017) ."}, {"section_title": "Estimates of Local Food Sales", "text": "Despite the increase in the number of local food systems initiatives within the last 15 to 20 years, only a handful of studies have tried to measure current local food consumption. Miller et al. (2015) used parameters from an input-output model to estimate the economic contribution of Michigan's local food system. Timmons, Wang, & Lass (2008) used USDA production and consumption data to establish an upper bound of local food production for Vermont. They found, for example, that Vermont produced more dairy but fewer fruits and vegetables than it can consume. A few years later, Conner et al. (2013) used a mix of primary and secondary data from 2011 to estimate local food sales from the agricultural and food manufacturing sector as well as from restaurants, food co-ops, and institutions. They estimated that in 2010, spending on local food in Vermont composed about 2.5% of all food expenditures; they revised this estimate up to 5% due to known data gaps. Their study had important limitations, including not adequately measuring local food sold through traditional retail venues as well as not accounting for commodity milk sales. As a result, they highlighted several challenges connected to local food measurement, including (1) consistently counting dollars at the same place in the supply chain (e.g., farmgate or retail or some consistent point in between); (2) avoiding double counting (e.g., counting both a distributors' sales to a school and the school's purchase from the distributor); (3) determining how to count processed foods that use little or no locally grown ingredients; (4) determining the source and processing location of commodity fluid milk; and (5) encouraging stakeholders to provide their data in a consistent format to researchers. Since then, a meta-analysis of food modeling research revealed several crucial limitations to these types of research (Horst & Gaolach, 2016) . First, aligning with the economics of local food system literature, Horst and Gaolach (2016) lament the lack of standardized and scale-relevant data on production and consumption. Second, they call for greater focus on the policy implications of foodshed scenarios, while urging caution around the complexity of the issues.\nRecognizing the need to develop a better understanding of local and regional local food activity, the need for credible measurement, and the need for resources for local organizations to build their capacity, USDA partnered with a team of researchers to develop The Economics of Local Food Systems: A Toolkit to Guide Community Discussions, Assessments and Choices (Thilmany McFadden et al., 2016) . The toolkit provides a roadmap that begins with topics relevant to a broad audience, such as discussing how to properly frame the research question and assemble a team to answer it (module 1), the types of secondary data available, how to use these data sources and their limitations (module 2), primary data collection and data analysis (module 3), data visualization and sharing of data with the community (module 4), and measurement of broader economic contribution modelling (modules 5 through 7). Because the first four modules are germane to our work, we use the modules of the toolkit as the backdrop of our discussion section."}, {"section_title": "Methods", "text": "The project was well defined: measure the amount of food grown and processed food in Vermont or within 30 miles of its borders (the official state local food definition) that is consumed in Vermont. In this section, we describe how we built on our first data collection efforts in 2010 and how we refined our approach in 2014 and 2017 (hereafter referred to as waves 1, 2, and 3). Interested readers can refer to Conner et al. (2013) for more details on the first wave of data collection. Before we detail each step of the process, we discuss the project team and the general approach to the project."}, {"section_title": "The Project Team and General Approach", "text": "For each wave of data collection, the project team was composed of researchers from the University of Vermont (UVM), members of the FTP team from the Vermont Sustainable Jobs Fund, and independent food systems consultants. The UVM members led the research project, including design of the data collection tool and data analysis. The FTP members brought general oversight, funding, food systems knowledge, and relationships with key stakeholders. Last, the consultants in waves one and three (a different consultant for each of these two waves) brought further knowledge of the food system and relationships with key stakeholders. There was some turnover in project members over the three waves as individuals changed organizations. However, institutional memory and consistency in the approach were preserved in three key ways. First, two of the team members (one from UVM and one from FTP) participated in all three waves. Second, all documents, including data collection tools and data analysis procedures, were accessible by the research team across the three waves. Third, members who had worked on previous waves of the project provided informal guidance as needed.\nThe general approach to the project over the three waves varied little. We started each wave of data collection with a project kickoff meeting to plan basic methods and timelines. Then we had two to three phone calls over the course of the project to discuss progress and methodological issues as they arose. After the team agreed on the data collection tool, FTP members contacted stakeholders to request data (more on the stakeholders below). The rationale was that an entity known across the state would introduce the research project. Stakeholders were instructed to send their data to the UVM team for data entry and analysis. The goal was to ensure confidentiality and independence of the data collected by leveraging the credibility of a research institution. Last, UVM team members in the first two waves and a consultant in the third wave followed up with stakeholders through phone calls and email during data collection, in order to encourage participation. Each time, FTP also followed up with some key stakeholders with whom existing relationships and trust were deemed important, such as supermarket chains or large food distributors."}, {"section_title": "Defining Local and What Food Items Count as Local", "text": "Because the definition of what is local has bearings on the data collection and data analysis approach, the project team had extensive discussions about the definition during the first project kick-off meeting in 2010. A major difficulty relates to the diversity of definitions. In some cases, the definition is based on a distance, while in others the definition is based on a geographical boundary. Ultimately, the team used the state of Vermont legislature's definition of local food to guide its inquiry, which is defined as Vermont or within 30 miles (48 km) of its borders.\nThe team also had extensive discussions about which processed food items should be included. The driving criteria were the sources of the ingredients and the ownership structure of the food manufacturer (locally owned or not). Certain food items were not counted when local water was the main ingredient and when ownership of the company was not local (e.g., soda bottled by a large corporation in the state vs. locally owned and operated breweries) (see Conner et al., 2013 , for more information)."}, {"section_title": "Data Needs and Data Collection Efforts", "text": "To estimate the amount of local food consumed, we needed two types of data: total food and beverage consumption and local food sales. Total food and beverage consumption was the easiest data to obtain since they are available through the Consumer Expenditure Survey (U.S. Bureau of Labor Statistics [BLS], 2011; . For each wave, we either used the data for the relevant year or adjusted the most recent available data for inflation. In the first wave of the project we only included food consumption data, while in the second and third waves we included beverages (alcoholic and other).\nAs mentioned earlier, there is no publicly available dataset with a complete estimate of local food sales at the county or state level. Therefore, we used primary and secondary data, with our approach changing the most between waves one and two. Starting with secondary data, we used two main sources of data across the three waves:\n(1) data from the Census of Agriculture and (2) data from the Nonemployer Statistics (NES). The Census of Agriculture provides data on direct sales from farmers to consumers through community supported agriculture operations (CSAs), farmers markets, and farm stands 1 (USDA National Agricultural Statistics Service, 2007; . The NES provides data on small-scale food producers with no paid employees (U.S. Census Bureau, n.d.) . While the nonemployer economic census does not provide data on the location of sales, we assumed that since these are small businesses, they likely sell their products close to the point of production. Starting in wave two, we added an estimate of local food sales through independent grocery stores (Desai, Roche, Kolodinsky, Harlow, & Nilan, 2013) .We adjusted the 2013 estimate for inflation for waves two and three; hence for wave three, we assumed that these sales levels have not changed other than by the rate of inflation. However, anecdotal evidence suggests that sales have increased in these stores, so our estimate for wave three may be conservative.\nWe collected primary data to fill data gaps for sales through distributors and/or involving retailers and institutions. In wave one, we created a list of stakeholders likely to have data on local food sales, including businesses, state agencies, institutions, and nonprofit organizations. Then, in waves two and three, we added stakeholders that were not contacted previously because we previously did not know about them, they were new businesses, or they had grown to a point where their inclusion was important. Our list grew from 29 stakeholders in wave one, to 60 in two, and to 73 in wave three (Table 1) . While the percent of organizations that provided data decreased between wave one and two and stabilized in wave three, the number of organizations that provided data actually increased across the three waves since we contacted more organizations in each wave. Our experience with the third wave of data collection provides an example of the constantly changing environment and overlaps within the food system that we observed in three waves of data collection. As mentioned earlier, a total of 73 requests for primary data were sent out by the FTP team during the last wave of data collection, and we received data from 33 stakeholders. Despite following up, 20 respondents did not provide data, including five institutions and four nonprofit organizations. For the remaining 20 respondents, either we obtained the data through other means, such as through an industry organization or distributor, or we learned that they were not collecting local sales data.\nWe refined our data collection instrument over time. In wave one, we simply asked stakeholders to report on the total volume of local foods. This could be local food that they had sold if they were a distributor or retailer, or local food that they had purchased if they were an institution. We categorized the location based on who provided the data. In waves two and three, we asked stakeholders for a breakdown by food category (e.g., meat, vegetables) and buyer type or destination (to hospitals, schools, retailers). While some stakeholders provided the breakdown of their data, others were either unable or unwilling to. Thus, when calculating the percent of sales by category and destination, we have large percentages listed as \"uncategorized.\""}, {"section_title": "Data Extrapolation", "text": "Even after obtaining primary data there were still a few data gaps, the largest being supermarket sales, commodity dairy, and alcohol. In waves two and three, we used a combination of primary and secondary data to fill these three data gaps. To estimate local food sales by the three major supermarket chains operating in Vermont, we used data obtained from one of the major supermarket chains (primary data) and extrapolated to estimate sales from the two other chains using Vermont market share data and total sales for the retail sector (secondary data) (Marchat, 2017) . In wave two, we estimated the same level of local food sales across the three chains, while in wave three we assumed different levels of local food sales. These decisions were informed by the independent consultant's knowledge of the retail market in Vermont.\nOur approach to estimating the quantity of Vermont-produced commodity dairy sold in the state changed somewhat between waves two and three. In two, we used estimates of the percent of Bureau, 2013 ). An agricultural economist specializing in dairy and a Vermont Agency of Agriculture, Food and Markets (VAAFM) staff member vetted our approach and deemed it appropriate considering data limitations.\nIn wave three, we were given access to unpublished data from VAAFM on the amount of milk produced that remained in the state (primary) and data from the Consumer Expenditure Survey and population census data to estimate total consumption (secondary) (U.S. BLS, 2019; U.S. Census Bureau, 2017) . VAAFM data showed that 57.5% of milk produced in Vermont stayed in the state, with the rest being exported to southern New England and New York state. We netted out all dairy purchases for which we had primary data to calculate the final figure.\nOur approach to estimating alcohol sales also changed between waves two and three. In wave two, we used store prices for beer, wine, and cider from three locations (one supermarket, one liquor store, and one food co-op) along with data from the Vermont Department of Taxes, which included gallons sold for alcohol produced in Vermont. Of note, the data from the Vermont Department of Taxes did not include small breweries and wineries that use one of the largest distributors, and there are no estimates on that amount. Furthermore, despite our attempts, we were also not able to obtain data on local liquor sales. In wave three we obtained data directly from the craft beer industry association and several large wineries but were unable to get local distillers or local cider maker sales information."}, {"section_title": "Data Clean-up and Tally", "text": "We entered all sales data and estimates into a Microsoft Excel document. While in wave one we only had aggregate sales and used the name of the data source to categorize the destination (e.g., schools, hospitals, grocery stores), in waves two and three we used two tabs to track data by destination and by food type (e.g., meat, dairy, vegetable). For the three waves, we screened the data to avoid double-counting. For instance, double-counting would have occurred if we had both included a distributor's sales to an institution and that institution's purchases from the distributor, or if we had included a manufacturer's sales to a grocer and the grocer's purchase from the manufacturer. When in doubt, we used a conservative approach by eliminating any problematic data points.\nTo calculate the percentages of the total sales by destination and category, we summed the figures in each row and divided them by the total food sales with a known category or destination. A final category for \"uncategorized\" products was created by subtracting the total from category and destination, respectively, from the overall. Lastly, to calculate the percent of local food consumed in the state, we divided total local sales by the total food and beverage consumption (as mentioned earlier, total consumption data is from the consumer expenditure survey). To assess changes over time, the 2017 data were then combined and compared to 2010 and 2014 results (adjusted for inflation). All results were shared by the research team and vetted by the project team."}, {"section_title": "Assumptions and Limitations", "text": "We now turn to our main assumptions and limitations, most of which are not unique to this research. Indeed, we noted earlier that the lack of complete and accurate data is a critical challenge of local food sales studies. First, we assumed the accuracy and completeness of the secondary data. For example, on the one hand, the agricultural census data might under-report direct sales of agricultural and value-added products to consumers. This is because some of these transactions are likely cash transactions, which are more difficult to track. On the other hand, we assumed that food processing businesses without employees sell their production locally when they could also sell some of their production through mail orders or travel to sell their production in other states. However, we are not aware of data that would enable us to corroborate this assumption. Second, the quality of data provided by stakeholders varies. For instance, some stakeholders have automated tracking systems for local food and thus their data are likely more accurate and complete, while other stakeholders provided 'back of the envelope' calculations. Third, because of large data gaps connected to supermarket sales, commodity dairy, and alcohol, we used a mix of primary and secondary data to fill the gaps. While we erred on the conservative side, we currently are not aware of data that would enable us to estimate the margin of error. Furthermore, our approach to estimate dairy and alcohol changed between waves two and three due to access to new data and/or due to stakeholders not providing data for both waves. The lack of consistency across the two waves is problematic, and we are not aware of data that would also allow us to triangulate the accuracy of our estimates. Finally, we present the data for the three waves to assess progress over time. However, because we refined our data collection approach over time, wave one is not directly comparable with waves two and three. An increase in local food consumption over time is, therefore, likely due to both an increase in sales but also a more complete accounting. We speak to these nuances when we present the results of waves two and three."}, {"section_title": "Results", "text": "In this section, we provide an overview of our results, including changes in the proportion of local food and beverage consumption across the three waves of data collection, local sales by location, and local sales by product type."}, {"section_title": "Local Food and Beverage Consumption Trends", "text": "Between 2010 and 2017, our estimates indicate that the proportion of local food and beverage consumption has increased from 5% in 2010 to 9.7% in 2014 and 13.9% in 2017. When removing alcohol from the two and three data (since we did not collect data for beverages in wave one), we find that the proportion of local food consumed increased from 5% in 2010 to 9% in 2014 and 11.2% in 2017. To further remove some of the uncertainties due to the changes in stakeholders who provided data, we also isolated stakeholders who provided data in 2014 and 2017. Of the 16 providers who provided data in waves two and three, 13 reported an increase totaling about US$258 million. Note, however, that these numbers are not directly comparable to the overall local food sales as many were netted out as double counting."}, {"section_title": "Local food and beverage sales by location", "text": "A look at local food and beverage sales by location provides further evidence of the upward trend ( Table 2 ). The direct-to-consumer category provides perhaps the best point of reference, since the data source in that category (direct sales from the census of agriculture and sales from the nonemployer survey) remained constant. In nominal dollars, the sales in that category increased by US$27 million. At the same time, the share of direct-to-consumer sales in the total decreased in 2014 and 2017. This could be due, in part, to increasing our data collection efforts and due to the inclusion of beverages. The decrease may also be an indication of the growing importance of other market channels including distributors, food stores, and institutions, which have all increased in dollar terms over time. Indeed, since the early 2010s several initiatives have provided support to institutions to purchase more local food. This includes planning and implementation grants from the state of Vermont and technical assistance from nonprofits such as the Vermont Farm to School Network. Food stores also have worked to increase their offerings of local food to respond to consumer demand. The largest category of growth was \"Other Local Businesses,\" which is due in large part to sales of alcohol (US$59 million), especially local craft beer."}, {"section_title": "Local Food and Beverage Sales by Food Category", "text": "Looking at the local sales by food category, we find that sales in many categories declined in both absolute terms from 2014 to 2017 (as a reminder, sales by food category were not measured in 2010) ( Table 3 ). The decrease is due largely to fewer key stakeholders providing data broken down by food type in 2017 compared to 2014. For sales that were categorized by type, the biggest increase was in beverages, again due to the effect of craft beer sales. Dairy and manufactured food sales also increased in absolute terms (but declined as a percentage). Finally, while the emphasis of local food initiatives has often been on fruits and vegetables, we note that in Vermont, these two categories represent a small share of the total compared, for example, to processed/manufactured food, dairy, or beverages. In a state with a short growing season, this is an important reminder of the diversity of opportunities within the local food system."}, {"section_title": "Discussion", "text": "As local food systems continue to draw the interest of scholars and practitioners because of their potential to contribute to economic and community development, we used Vermont as a case study to assess the extent to which relocalization efforts are paying off. We also discussed how we have refined our approach over three waves of data collection to fill a major current data gap, which is the aggregate amount of local food consumption. We organize our discussion of the process, findings, and reflections around the 2016 USDA Economics of Local Food Systems toolkit (Thilmany McFadden et al., 2016) . While we had completed two waves of data collection when the toolkit was released, our project aligned with many of the rec- ommendations of the USDA toolkit. Furthermore, the toolkit provides a framework for greater comparisons of the impact of local food systems projects across time and geographical areas. Beyond documenting local food consumption using a longitudinal approach, we hope that the description of our process and our reflections might be helpful to those interested in undertaking a similar project. Module 1 of the USDA toolkit is about framing the assessment process. This includes engaging community members, developing scope and objectives, and evaluating needed resources. Our project had a well-defined research question (i.e., what is the amount of local food consumed in Vermont), which was inspired by an informal conversation between the director of FTP and a newly arrived UVM faculty member in early 2010s. From there, a team was assembled with the intention of leveraging the diversity of knowledge and networks across team members. As mentioned above, the FTP members and independent food systems consultants brought their knowledge of the local food system and leveraged their networks to encourage participation. The UVM team members brought in their research expertise and independence to preserve the confidentiality of those who reported their data. Once the team was assembled and obtained funding for the first wave, 2 the team defined the scope of the project and inventoried the needed resources. Defining the scope of the project during the first project kick-off meeting included discussing the definition of local food and food items to be included. The scope of the project was redefined in waves two and three to reflect the development of the local food system in Vermont. This included, for example, the inclusion of alcoholic beverages. Finally, because FTP team members had already developed a strong understanding of the data available and data needs in preparation of the Farm to Plate Strategic Plan in 2010, the discussion of needed data resources was minimal.\nModule 2 of the toolkit is about using secondary data, including identifying secondary data sets and evaluating their usefulness to project objec-2 Funding for the first wave of data collection was provided by a UVM Center for Rural Studies minigrant that funded partnerships between UVM researchers and Vermont food system's practitioners. Funding for the second and third waves of data collection was provided by the VSJF from various foundation sources. tives. We used secondary data when available. The use of secondary data not only reduces the cost of data collection, but data generated by federal agencies are key to developing comparable approaches to local food assessments. We note that starting with the 2017 Census of Agriculture, the USDA is now collecting data on farmers' sales to intermediated market channels such as food hubs. While our study predates the release of the latest census, these data should reduce the burden of data collection in future waves. Other secondary data sources that maybe useful as comparisons or supplements to our methods are the 2015 USDA Local Food Marketing Practices survey (USDA NASS, 2015) and the parameters from input-output models (Miller et al., 2015) . These data may also help triangulate findings.\nModule 3 of the toolkit is about generating and using primary data, including developing methods for sampling, data collection, and analysis. The bulk of our work involved collecting primary data, and we refined our approach over time as discussed in the methods section. Aware that tallying local food sales or purchases would require time for most stakeholders, we asked for what we believed was the essential information (i.e., amount broken down by location and food category). For each wave, many stakeholders were willing and able to provide local sales data. Time and effort spent cultivating relationships of trust with local stakeholders, often under the auspices of FTP, were vital factors in obtaining primary data. However, the inability or unwillingness of some stakeholders to provide the 2017 data divided by category or destination resulted in large \"uncategorized\" entries which greatly inhibited our ability to make comparisons over time. Besides the time investment required from stakeholders to respond to our request, data collection fatigue might play a role. As interest by various groups to track local food sales continues (for example, by funders, government agencies, or researchers), data collection fatigue will likely continue to negatively affect data collection and data quality. This also means that longitudinal analyses, which are already limited, will become increasingly difficult to implement. The issue of data collection fatigue further points to the importance of collaborating and concentrating data collection efforts. Is there value at the state or federal level in creating local food data clearinghouses? Might relatively simple adaptations to existing federal data collection efforts be made? Some of this work has begun, as evidenced by the inclusion of a new question about local food marketing channels on the 2017 Census of Agriculture.\nRegarding the data analysis phase, researchers have cautioned against using arbitrary assumptions in the absence of data (O'Hara & Pirog, 2013) . As we explained in the methods section, while we worked to ground our assumptions in limited evidence and using team members' knowledge of the food system, the lack of data and assumptions represent key limitations of our work. We described our assumptions and limitations in the methods section but, for example, the extrapolation of supermarket sales from one major retail chain to the other two is our biggest assumption. Despite our efforts, only one retail chain shared its data. Given the large magnitude of these sales, any error here would be greatly magnified. One of the guiding principles of our data analysis across the three waves has been our transparency about the process and our use of conservative estimates.\nModule 4 of the toolkit is about engaging the community with the data, including developing strategies for identifying and communicating significant results with stakeholders. While our data collection efforts have several limitations, our findings show that since 2010 the proportion of local food consumption has increased and that FTP has likely reached its target of 10% of total food consumption in the state by the year 2020 three years early (estimated at 13.9% for 2017). From the beginning, the team has used the communication of the results as a strategy to show progress toward strengthening the local food system. In particular, we have shared the results of the last two data waves at the 2015 and 2018 FTP Gathering, an annual conference of Vermont food systems stakeholders. Furthermore, we have disseminated the results through press releases, on the FTP website, in the FTP annual report, and presented them to the Vermont Legislature's House and Senate agriculture committees. Although the data is anonymized, we have found that presenting them to the public and legislators provides an incentive to those sharing data because it attracts positive attention to their businesses' or institutions' contribution to total local purchasing and economic development in the state. For those working in the food system, the data provide a means of evaluating progress, along with insights on broad market trends on types of foods being purchased and where Vermonters are or are not purchasing local food. This information can then be used to determine strategic priorities, policy interventions, or evaluate program or policy effects on local food expenditures in certain market channels (e.g., have K-12 schools' local food purchases increased in conjunction with Farm to School programming and grants?). Additionally, for organizations in the food system the release of the data gives them a larger context and a means to communicate their own impacts and priorities to members (existing and prospective) and/or funders.\nModules 5 through 7 of the toolkit are about analyzing the linkages of local foods to local economies through economic contribution or impact studies. At this time, we have not conducted a formal input-output analysis. Previous research has shown the importance of customizing the production function for more accurate estimates of the economic contribution (Hardesty et al., 2016; Jablonski & Schmit, 2016) . This would require that we collect data from farmers and also food manufacturers participating in the local food system."}, {"section_title": "Conclusion", "text": "Until systematic and comprehensive tracking of local food sales is possible (and we note that that might not be a realistic proposition), local food consumption estimates such as ours should not be taken at face value due to the large data gaps. Rather, these estimates provide one piece of the puzzle toward tracking progress in food relocalization efforts and toward understanding larger trends. As food relocalization efforts continue to be framed as a means toward community and economic development, we note that much of the recent empirical work (including our own work) has been focused on economic indicators such as economic activity generated and local food multipliers, local sales, or number of jobs created in the food system. While this may not be a frontier in research, more work should aim to assess the extent to which food relocalization efforts have broader social effects on the community as theorized through the concept of civic agriculture (Lyson, 2004) and as advocated by stakeholders and politicians. While some scholars have called on the use of the community capitals or rural wealth creation frameworks (Gasteyer, Hultine, Cooperband, & Curry, 2008; Schmit, Jablonski, Minner, Kay, & Christensen, 2017) , we see opportunities in adapting the work grounded in the Goldschmidt hypothesis. Influential in the sociology of food and agriculture, this literature has a long history of assessing the impact of the structure of agriculture on the social and economic wellbeing of communities. Through their review of key studies grounded in the Goldschmidt hypothesis, Lobao and Stofferahn (2008) provide insights into the type of indicators and data that have been used over the years. Furthermore, Welsh (2009) proposed to build on this work through a conceptual model that integrates the impact of changing market structures and the role played by public policy. Both of these, thus far, have received limited attention in the local food literature, yet likely play a crucial role in reshaping the food system."}]