[{"section_title": "Abstract", "text": "Background: Testosterone levels decline as men age, as does cognitive function. Whether there is more than a temporal relationship between testosterone and cognitive function is unclear. Chemical castration studies in men with prostate cancer suggest that low serum testosterone may be associated with cognitive dysfunction. Low testosterone levels have also been observed in patients with Alzheimer's disease (AD) and mild cognitive impairment (MCI). This paper reviews the current clinical evidence of the relationship between serum testosterone levels and cognitive function in older men. Methods: A systematic literature search was conducted using PubMed and EMBASE to identify clinical studies and relevant reviews that evaluated cognitive function and endogenous testosterone levels or the effects of testosterone substitution in older men. Results: Low levels of endogenous testosterone in healthy older men may be associated with poor performance on at least some cognitive tests. The results of randomized, placebo-controlled studies have been mixed, but generally indicate that testosterone substitution may have moderate positive effects on selective cognitive domains (e.g. spatial ability) in older men with and without hypogonadism. Similar results have been found in studies in patients with existing AD or MCI. Conclusions: Low endogenous levels of testosterone may be related to reduced cognitive ability, and testosterone substitution may improve some aspects of cognitive ability. Measurement of serum testosterone should be considered in older men with cognitive dysfunction. For men with both cognitive impairment and low testosterone, testosterone substitution may be considered. Large, longterm studies evaluating the effects of testosterone substitution on cognitive function in older men are warranted."}, {"section_title": "", "text": "Cognitive ability, including memory, attention, language and visuospatial ability, declines as people age (1, 2). The prevalence of cognitive dysfunction in older adults is high, although estimates vary depending on the methodology and definitions used. Moderate to severe memory impairment has been estimated to occur in about 13% of adults aged R65 years and in 32% of adults aged R85 years (3). Nearly 40% of individuals aged 60-78 years were found to have age-associated memory impairment as defined by the National Institute of Mental Health criteria (4). However, about 25% of individuals aged 68-78 years were found to have 'ageing-associated cognitive decline' as defined by the more stringent criteria developed by the International Psychogeriatric Association (5). Estimates of the prevalence of mild cognitive impairment (MCI), a transitional state between normal ageing and Alzheimer's disease (AD), range between 3 and 20% in adults aged R75 years (6).\nSerum testosterone levels also decline as men age (7). Between the ages of 30 and 80 years, the mean free testosterone index (the ratio of serum total testosterone to sex-hormone-binding globulin (SHBG)) decreases by as much as 50% in men (8). Furthermore, approximately one in ten men over the age of 50 years, increasing to one in five over the age of 60 years, has hypogonadal levels of serum testosterone (9).\nSome researchers have suggested that these agerelated reductions in cognition and testosterone are more than temporally related (10), although others have argued that the current clinical evidence is inconclusive (11). Cognitive impairment is considered a component of late-onset hypogonadism, for which some men may receive testosterone substitution (2, 12,"}, {"section_title": "Methods", "text": "The literature was searched using PubMed and EMBASE databases. General inclusion criteria included clinical trials, randomized controlled trials and review articles published in English in peer-reviewed priority journals after 1999 that included at least ten human male adult subjects. Keywords used in PubMed were the following: hypogonadism and (cognition or cognition disorders or cognitive therapy); hypogonadism and testosterone and (cognition or cognition disorders or cognitive therapy); andropause and (cognition or cognition disorders or cognitive therapy); andropause and testosterone and (cognition or cognition disorders or cognitive therapy) and testosterone and (cognition or cognition disorders or cognitive therapy). For EMBASE, keywords included the following: hypogonadism and (cognition or cognitive defect); hypogonadism and testosterone and (cognition or cognitive defect); (andropause or andropause-related disorder) and (cognition or cognitive defect); (andropause or andropause-related disorder) and testosterone and (cognition or cognitive defect) and testosterone and (cognition or cognitive defect). Clinical trials of patients with congenital endocrine abnormalities or of people seeking gender reassignment were excluded. For completeness, additional key trials known to the author that did not meet the initial search criteria were included."}, {"section_title": "Testosterone effects in the adult brain", "text": "Possible mechanisms to explain the relationship between testosterone and cognitive ability in older adults are based on preclinical observations of the neurotrophic and neuroprotective effects of testosterone (14, 15) . In the brain, testosterone can be metabolized to dihydrotestosterone and bind to androgen receptors, or it can be converted to oestradiol by the enzyme aromatase. Both aromatase and androgen receptors are found in key regions in the brain involved in memory and learning, including the hippocampus and amygdala (14) . Testosterone has been shown to increase concentrations of nerve growth factor (NGF) in the hippocampus and upregulate NGF receptors in the forebrain (16) . Androgens can prevent N-methyl-D-aspartate receptor excitotoxicity in hippocampal neurons and promote fibre outgrowth and sprouting, which may help neurons recover after injury (17, 18) . Neuroprotective effects against oxidative stress (19) and apoptosis (20) could also help protect the brain against accelerated age-related cognitive decline.\nTestosterone may protect the brain against the development of AD by inhibiting two hallmarks of AD pathology: b-amyloid found in senile plaques and hyperphosphorylated tau found in neurofibrillary tangles. Testosterone has been shown to reduce bamyloid secretion in rat cortical neurons by altering the processing of the amyloid precursor protein (21) . In hippocampal neurons grown in culture, testosterone can reduce b-amyloid-induced neurotoxicity (22) . In addition, testosterone has been shown to inhibit the hyperphosphorylation of tau in animal models (23) .\nDespite these observations, the biological effects of testosterone on the brain are far from fully understood. Further insight on the effects of testosterone substitution on neurological activity in different regions of the brain may be provided by advances in imaging techniques. For example, Zitzmann and colleagues (24) used 18 F-deoxyglucose positron emission tomography to study cerebral glucose metabolism during a standardized mental rotation task in six hypogonadal men. Each patient performed the test before and during treatment with testosterone substitution. During testosterone substitution four patients exhibited improved visuospatial performance, which corresponded with enhanced cerebral glucose metabolism during the test (24) . Using single photon emission computed tomography, Azad and colleagues (25) showed that cerebral perfusion was increased in the midbrain and the superior frontal gyrus after 3-5 weeks testosterone substitution in seven men with hypogonadism. After 12-14 weeks, increased perfusion was still observed in the midbrain as well as the midcingulate gyrus. Lastly, Park and colleagues (26) used blood oxygenation leveldependent (BOLD) functional magnetic resonance imaging to demonstrate differences in regional brain activation among 12 eugonadal sexually potent men and 2 hypogonadal impotent men in response to visual erotic stimulation. Activation of cerebral cortices in the two men with hypogonadism was low but was partially restored following testosterone substitution. Whether similar techniques could be used to assess differences in brain activity during cognitive tasks remains to be studied. These and other approaches could help to further establish the effects of testosterone on the brain in relation to cognitive ability."}, {"section_title": "Chemical castration and cognition", "text": "Surgical and chemical castration is used routinely in the treatment of prostate cancer. Some studies have evaluated cognitive ability during and following chemical castration (27) (28) (29) . A study of 26 men with prostate cancer reported impaired visuomotor speed, attention and verbal recall following chemical castration, although recall of objects was improved after castration levels of serum testosterone were achieved by 6 months (27) . In a study of 40 patients who underwent chemical castration for 36 weeks and were then observed for an additional 18 weeks, improvements in global cognitive function and word list recall seen only after treatment was discontinued (28) . Lastly, in a study of 19 patients with prostate cancer who underwent chemical castration, scores for spatial rotation worsened, whereas scores for verbal memory improved during treatment (29) . Compared with 15 healthy community-dwelling controls, however, no significant change was observed in verbal and spatial memory, executive functions or language. Taken together, this preliminary evidence suggests that artificially lowering testosterone levels may impair performance in some cognitive domains, particularly spatial ability.\nThe relationship between serum levels of testosterone and cognitive function Numerous studies have attempted to describe the relationship between serum testosterone levels and cognitive ability in younger adults. Although some studies have failed to find any relationship (30, 31) , others have reported linear (32) (33) (34) or non-linear (35) (36) (37) (38) relationships. Two studies of healthy young men and women have suggested a curvilinear (inverted U-shape) relationship between serum testosterone levels and spatial ability, whereby higher and lower levels of testosterone had the low spatial ability scores, whereas intermediate levels of testosterone were associated with better spatial performance (35, 36) . Moffat and colleagues (37) reported a similar relationship, but only in right-handed subjects. In a cross-sectional study of men aged 40-80 years, Muller and colleagues (38) found a similar curvilinear relationship between bioavailable testosterone levels in serum, and memory performance and processing capacity/speed. Taken together, these studies suggest that a mid-range of serum testosterone levels may correspond with optimal cognitive performance. However, a plausible biological mechanism has not yet been proposed to adequately explain this phenomenon. In the study by Muller and colleagues (38) , a positive linear relationship between bioavailable testosterone and cognitive ability was observed in the oldest patients (aged 70-80 years). Other studies have also reported a positive linear relationship in which higher testosterone levels were associated with improved spatial ability (32, 33) . Based on a cross-sectional study of 56 men aged 21-84 years, Morley and colleagues (34) determined that bioavailable testosterone levels were positively associated with tests of verbal and non-verbal learning and memory.\nFewer studies have been conducted specifically in older men (Table 1 ) (2, 39-41). Two population-based studies found that bioavailable testosterone levels were positively associated with scores of general cognitive ability (40, 41) . In a study of 310 older men aged R50 years (mean age 73 years), Yaffe and colleagues (40) measured serum concentrations of total and bioavailable testosterone and other hormonal factors. Cognitive function was assessed using the Mini-Mental State Examination (MMSE), Trails B and Digit Symbol tests. Men with high levels of bioavailable testosterone were found to have better cognitive scores on all the three tests (P%0.001), while SHBG levels were negatively associated with cognitive test scores (P%0.001). Total serum testosterone was not associated with cognitive ability. The fact that bioavailable testosterone is more biologically active and more readily crosses the bloodbrain barrier than bound testosterone may explain why bioavailable testosterone more strongly correlated with tests of cognitive ability than total serum testosterone.\nIn a population-based study of 547 men aged 59-89 years (mean age 70.2 years), Barrett-Connor and colleagues (41) measured serum testosterone levels between 1984 and 1987 and cognitive function using 12 neuropsychological tests between 1988 and 1991. Increased bioavailable testosterone was associated with Although the results of this study may have been limited by the fact that cognitive status was not assessed during the same period that testosterone levels were measured, the linear and the non-linear associations found suggest that optimal cognitive function may be related to a specific range of testosterone levels. Studies that have assessed more specific domains of cognitive function in older men have produced mixed results, most likely due to differences in the tests of cognitive function used (2, 39). In a long-term longitudinal study, 407 elderly men aged 50-91 years at baseline (mean age 64.1 years) were assessed for cognitive status and testosterone levels over an average duration of 9.7 years (2). Tests of cognitive function and behaviour included verbal and visual memory, mental status, visuomotor scanning and attention, verbal knowledge/ language, visuospatial ability and symptoms of depression. Overall, an increased free testosterone index was associated with improved scores on visual and verbal memory, visuospatial function and visuomotor scanning. It was also related to less rapid decline in visual memory as assessed by the Benton Visual Retention test. Notably, men considered hypogonadal (nZ149) had worse scores of visual and verbal memory, visuomotor scanning and visuospatial rotation compared with men considered eugonadal (nZ211). Men with hypogonadism also had faster rates of decline in visual memory.\nIn contrast, Fonda and colleagues (39) found no significant relationship between hormone levels and cognitive function in 981 men aged 48-80 years (mean age 62.7 years) using tests of working memory (Backward Digit Span test), speed/attention (Digit Symbol Substitution test) and spatial ability ( Figural  Relations test) . Initially, free and total testosterone levels and other hormones were significantly related to performance on at least one out of the three cognitive domains tested. However, these relationships were no longer significant after adjusting for age, education level and physical status, with the exception of oestrone and cortisol levels, which had a negative relationship with test results. Based on the cognitive domains tested in this study, the authors concluded that the hormones do not mediate age-related cognitive decline (39) .\nOverall, it appears that low endogenous levels of testosterone may be associated with reduced cognitive ability in older men, although the current evidence is inconclusive and the exact relationship is far from being fully understood. The different results of the studies conducted to date may be attributed to their small sample size or to differences in study populations, cognitive tests used and method of testosterone assessment.\nTestosterone substitution in men without cognitive impairment Does testosterone substitution improve cognitive ability in older men? The results of some placebo-controlled studies suggest that it may have a positive effect on some cognitive domains, particularly spatial ability and memory (Table 2) (42) (43) (44) . In a 3-month placebo-controlled study of 56 healthy men aged 60-75 years (mean age 67.4 years), testosterone substitution was found to improve spatial cognition but not verbal and visual memory (42) . In a 1-month study in 19 healthy men aged 61-75 years (mean age 67.5 years), working memory improved significantly in the patients receiving testosterone substitution (43) . Lastly, in a 6-week placebo-controlled study in 25 healthy older men aged 50-80 years, testosterone substitution was found to improve spatial cognition as well as verbal memory (44) . This was the first study to report a significant improvement in verbal memory with testosterone substitution in older men, which was hypothesized to be a result of conversion of testosterone to oestradiol in the brain. This hypothesis was confirmed by a later study in which 60 healthy older men aged 50-90 years were randomized to weekly testosterone injection (100 mg) plus oral placebo, testosterone injection plus an oral aromatase inhibitor (to prevent conversion to oestradiol) or saline injection plus oral placebo for 6 weeks (45) . Spatial memory improved in both groups that received testosterone. However, verbal memory improved in those who received testosterone only but not in those who received an aromatase inhibitor, suggesting that oestradiol which has been converted from exogenous testosterone is responsible for improved verbal memory (45).\nOther placebo-controlled studies have failed to find any significant effect of testosterone substitution on cognitive ability in older men (Table 2) (46) (47) (48) . One initial study of 30 healthy older men found that a single dose of testosterone had no effect on verbal or spatial tasks and had a negative effect on verbal fluency after 5 days (46) . However, this study may have been too short to capture a meaningful effect on cognition. A 12-month study of 67 men aged 65-87 years (mean age 76 years) with bioavailable testosterone levels !128 ng/dl also found no difference in overall cognitive ability with testosterone substitution compared with placebo (47) . Trails B scores improved from baseline in the testosterone group, but the difference was not significantly different from the change in scores in the placebo group (47) . In a similar 12-month study in 32 men aged R50 years with bioavailable testosterone levels %60 ng/dl, Sih and colleagues (48) found that testosterone substitution had no significant effect on scores of verbal or non-verbal memory. However, visuospatial ability was not measured specifically in this study.\nOverall, the results of these studies suggest that further investigation of the effects of testosterone substitution on cognition is warranted. Although some studies have reported no benefit with testosterone substitution, others have found significant improvement in some scores of cognitive ability indicating that testosterone may have selective effects on certain cognitive domains. It may also indicate that some patients may derive more benefit than others. In particular, it should be noted that baseline levels of serum testosterone varied considerably among the studies. Therefore, further evaluation of the effects of testosterone substitution on specific cognitive domains in a carefully selected patient population of older men is justified."}, {"section_title": "Testosterone substitution in men with cognitive impairment", "text": "Several studies have determined that men with AD have reduced levels of endogenous total or bioavailable testosterone (49) (50) (51) . AD is characterized by senile plaques and neurofibrillary tangles in the brain. Senile plaques are composed of aggregated b-amyloid peptide, and neurofibrillary tangles are composed of abnormal filaments consisting primarily of hyperphosphorylated tau protein (21, 23) . Testosterone has been associated with reduced plasma concentrations of b-amyloid peptide in clinical studies (52, 53) and reduced tau phosphorylation in preclinical models (23) , suggesting that testosterone may protect against the development of AD.\nRecently, much attention has been focused on identifying patients with MCI who may be at risk of developing AD. An estimated 6-25% of people with MCI will develop AD annually compared with a conversion rate in the general population of 0.2-3.9% (54) . MCI is characterized by significant impairment of short-term memory with little or no functional loss (55) . It has been associated with significant neuronal loss in the hippocampus, reduced blood flow in the subiculum, and increases in b-amyloid depositions and tau protein concentrations (56, 57) . Estimates of the prevalence of MCI range widely depending on the diagnostic criteria used. In an analysis of 1045 community-dwelling adults aged R75 years who participated in the Leipzig Longitudinal Study of the Aged (LEILA75C), prevalence rates for MCI ranged from 3 to 20% (6). The prevalence was 13.7% in a study of 2551 community-dwelling adults in Australia aged 60-64 years, but rates varied up to sixfold depending on the diagnostic criteria applied (58) . Improved ways to identify and treat MCI may avoid or delay the onset of AD.\nThe clearest evidence regarding the role of testosterone in the early development of AD comes from the Baltimore Longitudinal Study of Aging (59) . In this longitudinal study, 574 men without AD aged 32-87 years at baseline were followed for a mean of 19.1 years (range, 4-37 years). The impact of testosterone level on risk of developing AD was assessed at 2, 5 and 10 years before diagnosis. For every 10-unit (nmol/nmol) increase in the free testosterone index, the risk of developing AD was found to be reduced by 26%. The fact that low testosterone levels could predict the development of AD up to 10 years in advance clearly indicates that testosterone levels are often reduced prior to the development of AD and may coincide with the onset of MCI.\nThe effects of testosterone substitution in men with MCI or AD have been evaluated by four small placebocontrolled trials (Table 3) (60) (61) (62) (63) . The largest of these studies involved 32 men aged 63-85 years with MCI (nZ17) or AD (nZ15) (60) . Mean baseline testosterone levels ranged from 9 to 14 nmol/l in the various demographic groups. After 6 weeks, patients given testosterone substitution had significantly better scores of spatial memory and constructional abilities than those given placebo. There was also a significant difference in verbal memory scores between treatment groups, due primarily to a worsening of scores in the placebo group; scores remained generally unchanged in the testosterone substitution group. Tan and Pu (61) conducted a pilot study in ten men with newly diagnosed AD and hypogonadism (serum total testosterone !7 nmol/l). They reported improved visuospatial ability scores after 1 year of testosterone substitution compared with placebo. In contrast, Kenny and colleagues (62) found no effect of testosterone substitution on cognitive ability after 3 months in 11 men with early cognitive decline and hypogonadism (serum bioavailable testosterone !128 ng/dl). However, the tests used in this study focused primarily on domains that were unlikely to be affected by testosterone substitution, such as attention, language and motor coordination. Lastly, Lu and colleagues (63) evaluated the effects of testosterone substitution or placebo on cognition and quality of life in 16 men with mild AD and 22 healthy controls. No significant differences in cognitive ability were found between treatment groups. However, patients with and without AD who received testosterone had numerical improvements or less decline in scores of visuospatial functions over the course of the study. Notably, the magnitude in change in testosterone levels from baseline was positively associated with visuospatial recognition scores indicating that men with lower endogenous testosterone levels derived the most benefit from testosterone substitution.\nIt is difficult to draw conclusions from these small studies that differed substantially with regard to study population and methodology. However, the potential of testosterone substitution to improve spatial ability deserves further investigation in this setting. Memory loss and spatial disorientation are two early hallmarks of AD. Since spatial memory and ability are essential for navigating complex environments, deficiencies can lead to environmental disorientation, which can rapidly become a considerable burden on caregivers. Interventions that improve navigational abilities or delay the onset of environmental disorientation could therefore have a substantial impact on healthcare burden as well as patient quality of life."}, {"section_title": "Summary of clinical trial review", "text": "There is a strong biological rationale to support the potential protective effects of testosterone against the It is difficult to establish universal cut-off levels of serum testosterone that correspond with clinical lateonset hypogonadism. Symptoms typically manifest when total serum testosterone levels are between 8 and 12 nmol/l (12). When alternative causes of these symptoms have been excluded, testosterone substitution may be considered. Men with serum levels of total testosterone !8 nmol/l or free testosterone !180 pmol/l generally require testosterone substitution. Before initiating testosterone substitution, men aged R45 years should undergo digital rectal examination (DRE) and prostate-specific antigen (PSA) testing to establish prostate health. Men with confirmed or suspected prostate or breast cancer should not receive testosterone substitution. DRE and PSA testing should be conducted at quarterly intervals during the first year of treatment and annually thereafter.\nCognitive dysfunction can be detected with the help of multiple tools of varying specificity. General practitioners, endocrinologists, urologists and other specialists may use non-specific measures, such as the MMSE, the Kokmen Short Test of Mental Status, the 7-Min Screen or the Memory Impairment Screen to detect possible cognitive impairment (54) . To confirm the diagnosis, a general neurologist or geriatrician may use more specific tests for dementia, such as the Diagnostic and the Statistical Manual of Mental Disorders, fourth edition (64) . To determine whether cognitive impairment may be related to low testosterone levels, neuropsychologists may test specifically the relevant cognitive domains, such as visuospatial memory, spatial ability and non-verbal working memory.\nIdentification of cognitive impairment in older adults is only relevant if effective interventions are available (54) . Treatment strategies for cognitive impairment consist of pharmacological and non-pharmacological approaches. The number of non-pharmacological therapies has expanded to include not only standard approaches, such as behavioural therapy and reality orientation, but also brief psychotherapy and alternative therapies, such as art or music therapy. Pharmacological approaches consist mainly of acetylcholinesterase inhibitors, which have a modest effect on symptoms but do not prevent disease progression, and non-specific therapies, such as neuroleptics and other sedatives. Identifying new treatment approaches that safely and effectively prevent or delay the onset of dementia is the subject of ongoing investigation."}, {"section_title": "Final comment", "text": "Despite decades of research on the relationship between testosterone and cognitive function in men, many questions remain. In particular, the appropriate study population has yet to be established. Some have suggested that more severely hypogonadal men may derive more benefit from testosterone substitution than mildly hypogonadal or eugonadal men (63) . However, others have in fact suggested the opposite that eugonadal men may derive more benefit because longterm hypogonadism may confer a lack of sensitivity of androgen receptors in the brain (15) . The appropriate age has also been questioned in a review of studies conducted in elderly men on cognition and testosterone (evaluating endogenous levels or the effects of substitution), Hogervorst and colleagues (15) noted a trend in which a positive effect of testosterone on cognitive function was observed, primarily in studies with a younger median age (roughly !72 years). This observation may not only explain some of the mixed results reported from various studies but also suggest a therapeutic strategy whereby testosterone substitution would be considered for younger patients. In addition to issues of study population, the optimal dose and type of testosterone and the duration of therapy needed to provide optimal effects on cognition must also be established.\nAll of the issues mentioned above point to the need for more clinical data from well-designed controlled clinical trials using established methods of measuring cognitive ability and serum testosterone levels. In the meantime, endocrinologists and urologists should be aware of the potential cognitive impairment in men with low serum testosterone. Consultation with a neurologist or geriatrician may help to identify and manage symptoms related to cognitive decline. In addition, neurologists and geriatricians should be aware of the possibility of hypogonadism in elderly men with cognitive impairment, and should consider measuring serum testosterone concentrations in these patients."}]