[{"section_title": "Preface", "text": "At the request of the National Science Foundation Engineering Directorate, the National Academies performed an international benchmarking exercise to determine the standing of the U.S. research enterprise in the field of mechanical engineering relative to its international peers. This of course was no trivial undertaking, even for the panel of mechanical engineers assembled-11 members, mostly from U.S. universities, with expertise across the 11 selected areas of mechanical engineering covered in the report (see Chapter 1): acoustics and dynamics, bioengineering, computational mechanics, design and computer-aided design, dynamic systems and controls, energy systems, manufacturing and computer-aided manufacturing, mechanics of engineering materials, microelectromechanical systems and nanoelectromechanical systems, thermal systems and heat transfer, and tribology. The panel was charged with addressing three specific questions:"}, {"section_title": "1.", "text": "What is the current position of U.S. mechanical engineering research relative to that of other regions or countries? 2. What key factors influence U.S. performance in mechanical engineering? 3. On the basis of current trends in the United States and abroad, what will be the relative U.S. position in the near term and in the longer term? 1. What is the current position of U.S. mechanical engineering basic research relative to that of other regions or countries? 2. What key factors influence U.S. performance in mechanical engineering? 3. On the basis of current trends in the United States and abroad, what will be the relative U.S. position in the near term and in the longer term? Following a process similar to that established in Experiments in International Benchmarking of U.S. Research Fields, 2 the panel was instructed to perform its charge in a short time frame and with a limited budget. The group met in person once and otherwise communicated by way of teleconference or electronic mail. Thus, in order to adequately respond to its charge, the panel had to limit the scope of the benchmarking exercise to assessing the state of basic (fundamental) research as determined by the open published literature, the opinions of its peers, and other sources of easily accessible information. This benchmarking exercise was conducted based on the premise that evaluating this type of more \"academic\" research information would give a good estimate of the quality and quantity of fundamental research being conducted, which could in turn be used as an indicator of the competitiveness of overall U.S. mechanical engineering basic research. Thus, this exercise in no way presents a complete picture of the research activity in the field-particularly the industrial component. The quantitative and qualitative measures employed to compare U.S. mechanical engineering basic research with that in other nations included analysis of journal publications (numbers of papers, citations of papers, and most-cited papers), utilizing such sources as Thompson ISI Essential Science Indicators and Scopus. In addition, the panel asked leading experts from the United States and abroad to identify the \"best of the best\" whom they would invite to an international conference in their subfield. The national makeup of these \"virtual congresses\" provides qualitative information on leadership in mechanical engineering. The panel also examined trends in the numbers of degrees, employment, and research funding of U.S. mechanical engineering, relying heavily upon NSF Science and Engineering (S&E) Indicators 2006 and earlier years. The resulting report details the status of U.S. competitiveness in mechanical engineering basic research and its areas and subareas. This benchmarking exercise attempts to determine the current status of the discipline and to extrapolate the future status based on current trends. The report does not make judgments about the relative importance of leadership in each area or recommendations on actions to be taken to ensure such leadership in the future."}, {"section_title": "IMPORTANCE OF MECHANICAL ENGINEERING", "text": "Mechanical engineering is a discipline that encompasses a broad set of research areas. At the core of mechanical engineering are the design, analysis, manufacturing, and control of solid, thermal, and fluid mechanical systems-as well as, innovative application of technology, systems integration, creation and development of new products and markets, and solution to product problems. This includes optoelectrical-mechanical machines, materials, structures, and• In 2002-2006 the United States published 24 percent of the mechanical engineering articles in the world. For 1987-1991, the U.S. contribution was 48 percent. A stiff competitor for numbers of publications is China, which published 7,580 articles in 2006, while the United States authored 5,660 articles. • U.S. mechanical engineers contribute strongly as authors to the leading research journals in this field, accounting for about 40 percent of the articles and 40 percent of the mostcited articles in 68 selected journals. • U.S. mechanical engineers contributed 65 or more out of the 100 most-cited articles in the Scopus database from 1987 to 2006. • The combined virtual congress and journal analysis supports the conclusion that the United States is the leader or among the leaders in all areas of mechanical engineering basic research. The United States is • The leader in bioengineering, design and CAD, manufacturing/CAM, mechanics of materials , and thermal and heat transfer, with an average 50-70 percent U.S. contribution; and • Among the leaders in acoustics and dynamics, computational mechanics dynamics and controls, energy systems, and MEMS/nano tribology, with an average 30-50 percent U.S. contribution. Overall, the United States is among the leaders in mechanical engineering basic research, with the following average contributions: • 50 percent of virtual world congress (VWC) speakers, • 40 percent of journal articles, and • 40 percent of most-cited articles. These results indicate that overall the United States is among the leaders in mechanical engineering basic research."}, {"section_title": "A Combination of Factors is Responsible for U.S. Basic Research Leadership in Mechanical Engineering", "text": "U.S. research leadership in mechanical engineering basic research is the result of a combination of key factors, including a national instinct to respond to external challenges and to compete for leadership. Over the years, the United States has been a leader in innovation as a result of cutting-edge facilities and centers, and a steady flow of mechanical engineers and research funding. This has meant relying increasingly upon foreign-born students. • Research funding for S&E overall and in mechanical engineering in particular has been steady. In 2005, more than $900 million was spent on mechanical engineering research and development (R&D) at academic institutions. Of this, about two-thirds consisted of federal expenditures. Federal support for U. S. mechanical engineering research between 1999 and 2003 was on average about 1 percent of the total U.S. R&D budget, with the largest portion (more than 70 percent) coming from the U.S. Department of Defense (DOD)."}, {"section_title": "Challenges Lie Ahead for the Future Position of Mechanical Engineering Basic Research", "text": "The United States now holds a position among the leaders in most areas of mechanical engineering basic research, but because of the advance of mechanical engineering in other nations, competition is increasing and the U.S. lead will shrink. The United States is particularly strong in areas at the interface with other disciplines. In these areas, which include bioengineering, design, and mechanics of materials, the United States will maintain the leadership position in spite of growing competition. In some core areas where the U.S. position is currently not as strong, such as acoustics and dynamics, dynamics and controls, computational mechanics, and tribology, the U.S. position among the leaders may continue to fade. On the basis of current trends in the United States and abroad, the relative future U.S. position in mechanical engineering basic research is outlined below: • There will be growing industrial opportunities in China and India, which will result in increased mechanical engineering research talent and leadership abroad. • There will likely be continued movement offshore of mechanical engineering R&D by U.S. companies, as well as increased competition from foreign companies. Local talent will be hired, which will likely include international students educated and trained in the United States. • There will also be more international research collaborations (United States and other countries, between countries in the European Union, etc.). • U.S. universities will continue to reach out and offer educational opportunities abroad and online. If the United States does not, other countries certainly will. • Contemporary issues such as national security, energy, manufacturing competitiveness, and sustainability will be a strong influence on research directions in mechanical engineering. These are areas in which mechanical engineering can make significant contributions. • Going forward, there will be a continued emergence of certain fields such as MEMS, nanotechnology, mechatronics, alternative energy sources, biomedical materials and devices, green manufacturing, and materials over many length scales. In addition, there will be continued importance of high-technology fields where the United States maintains a strong leadership position, such as the design and manufacturing of civilian and military aircraft, healthcare diagnostics, and power generating systems. • U.S. academic mechanical engineering departments continue to attract international talent for graduate studies. However, the barriers to travel for international students and visiting faculty may impact the ability of the United States to continue to attract this important source of U.S. mechanical engineering basic research talent."}, {"section_title": "CONCLUSION", "text": "U.S. leadership in mechanical engineering basic research overall will continue to be strong. Contributions of U.S. mechanical engineers to journal articles will increase, but so will the contributions from other growing economies such as China and India. At the same time, the supply of U.S. mechanical engineers is in jeopardy, because of declines in the number of U.S. citizens obtaining advanced degrees and uncertain prospects for continuing to attract foreign students. U.S. funding of mechanical engineering basic research and infrastructure will remain level, with strong leadership in emerging areas."}, {"section_title": "Introduction", "text": "Like many other fields of science and engineering, mechanical engineering is facing growing uncertainty about its research competitiveness. Concerns about educating students, future employment opportunities, and the fundamental health of the discipline and industry are regular topics of discussion in the mechanical engineering community, in venues such as meetings of the American Society of Mechanical Engineers (ASME) or at workshops of the National Science Foundation (NSF). 1 Mechanical engineering researchers seek to position the discipline to meet the needs of the future. However, before addressing future needs, it is imperative to understand the current health and international standing of the discipline."}, {"section_title": "KEY CHARACTERISTICS OF MECHANICAL ENGINEERING BASIC RESEARCH", "text": "Mechanical engineering is a discipline that encompasses a broad set of research areas. At the core of the discipline are the design, analysis, manufacturing, and control of solid, thermal and fluid mechanical systems. This now has expanded to include optoelectrical-mechanical machines, materials, structures, and micro-and nanoscale devices. Key aspects of the discipline also include heat transfer, combustion, and other energy conversion processes; solid mechanics (including fracture mechanics); fluid mechanics; biomechanics; tribology; and management and education associated with the above areas."}, {"section_title": "ROLE OF MECHANICAL ENGINEERING BASIC RESEARCH IN THE U.S. ECONOMY", "text": "Mechanical engineering is critical to the design, manufacture, and operation of small and large mechanical systems throughout the U.S. economy. It is often called upon to provide scientific and technological solutions for national problems, playing a key role in the transportation, power generation, manufacturing, and aviation industries, to mention a few. According to the NSF workshop report New Directions in Mechanical Engineering, \"In terms of both research areas and education, the mechanical engineering profession has been instrumental in the birth and development of industries such as nuclear and aerospace, and has been the foundation of broad-based disciplines such as industrial engineering. Mechanical engineering has played, and continues playing, a commanding role in trends that drive change in engineering.\" As pointed out at a 2002 National Science Foundation workshop, 2 \"Today, the synergy of science and technology is producing an era of profound change. Mechanical engineering is intrinsic to this change through its impact on enabling technologies. These technologies include: micro-and nano-technologies, cellular and molecular biomechanics, information technology, and energy and environment issues.\" For example, mechanical engineers are prominent in medical areas such as tissue engineering, instrumentation, prostheses, and medical devices and in energy areas such as energy conversion, hybrid power, energy storage, and utilization of alternative fuels. A mechanical engineering success story involves large reductions in pollutants from internal combustion engines and other combustion-related energy systems."}, {"section_title": "MECHANICAL ENGINEERING DEFINED FOR THIS REPORT", "text": "For the purposes of this report, the panel divided mechanical engineering into 11 areas, most with multiple subareas (see Box 1-1). This is not a comprehensive list, but rather provided a framework for the panel to assess the U.S. strength in modern mechanical engineering. The majority of the 11 areas have already been identified earlier in the discussion of key characteristics. Bioengineering, energy, and microelectromechanical systems and nanoelectromechanical systems (MEMS/Nano) represent active areas of research in modern mechanical engineering. The dramatic growth in the use of computer methods for modeling and simulation of mechanical systems has had a profound impact on mechanical engineering and it has affected every area of mechanical engineering. In particular, the field of computational mechanics has become a vital component of this engineering discipline, and the panel has identified it as an independent area. "}, {"section_title": "BOX 1-1 Areas and SubAreas of Mechanical Engineering in This", "text": ""}, {"section_title": "STUDY CAVEATS", "text": "Because of the size and strength of U.S. science and engineering overall, in this report the United States is largely compared with regions, such as Europe or Asia, rather than with individual countries. On occasion, specific countries are discussed. One difficulty in carrying out this benchmarking exercise was not being able to obtain data on international human resources (such as numbers of Ph.D.'s granted by country) and funding of mechanical engineering. Thus, the panel focused mainly on U.S. human resource and funding trends and relied on general science and engineering data to make international comparisons. In addition, mechanical engineering is a highly diverse field, and mechanical engineers are employed in a broad range of industries. In some cases, mechanical engineers are not associated with mechanical engineering departments. As a result, the panel acknowledges that contributions from some individuals involved in mechanical engineering undoubtedly will not have been captured in this report."}, {"section_title": "ORGANIZATION OF THIS REPORT", "text": "The panel was instructed to perform its charge in a short time frame and with a limited budget, and followed a process similar to that established in Experiments in International Benchmarking of U.S. Research Fields, 3 . The group met in person once and otherwise communicated by way of teleconference or electronic mail. Thus, in order to adequately respond to its charge, the panel had to limit the scope of the benchmarking exercise to assessing the state of basic (fundamental) mechanical engineering research as determined by the open published literature, the opinions of their peers, and other sources of easily accessible information. This benchmarking exercise was conducted based on the premise that evaluating this type of more \"academic\" research information would give a good estimate of the quality and quantity of fundamental research being conducted, which could in turn be used as an indicator of the competitiveness of overall U.S. mechanical engineering research. Thus, this exercise in no way presents a complete picture of the research activity in the field-particularly the industrial component. The quantitative and qualitative measures employed to compare U.S. mechanical engineering with that in other nations included analysis of journal publications (numbers of papers, citations of papers, and most-cited papers), utilizing such sources as Thompson ISI Essential Science Indicators and Scopus. In addition, the panel asked leading experts from the United States and abroad to identify the \"best of the best\" whom they would invite to an international conference in their subfield. The national makeup of these \"virtual congresses\" provides qualitative information on leadership in mechanical engineering. The panel also examined trends in the numbers of degrees, employment, and research funding of U.S. mechanical engineering, relying heavily upon NSF Science and Engineering (S&E) Indicators 2006 and earlier years. The outline of this report is as follows: Chapter 2 responds to the first question of the panel's charge and details the panel's assessment of the current standing of the United States in the 11 areas of mechanical engineering. Chapter 3 addresses the second question of the charge and identifies the key determinants of leadership in the field. Chapter 4 addresses the third part of the charge, assimilating past leadership determinants and current benchmarking results to predict future U.S. leadership."}, {"section_title": "Current U.S. Leadership Position in Mechanical Engineering Basic Research", "text": "To determine the overall position of U.S. basic research in mechanical engineering relative to research performed in other regions or countries, the panel analyzed journals (paper authorship, most-cited journals, and journal articles) and panel-generated virtual congresses, which are described in more detail later in this chapter. The panel used the collective results of all of these data to draw conclusions of the relative research competitiveness of U.S. mechanical engineering. The panel tried to interpret the gathered information objectively, but it also recognized its responsibility to make collective subjective judgments when needed. In addition, certain boundaries were needed to keep the exercise timely and relevant to the broader mechanical engineering community. The assessment of U.S. mechanical engineering research begins with a look at U.S. contributions to journal articles and most-cited journal articles. This is then followed by the virtual congresses, which were tabulated by the committee based on input from experts in mechanical engineering around the world. Finally, the panel provides leadership assessments for the different areas of mechanical engineering based on the journal and virtual congress data presented earlier in the chapter."}, {"section_title": "JOURNAL ARTICLES AND CITATIONS", "text": "Publishing research results is essential for scientific and technological progress. Thus, looking at the quantity and quality of journal articles being published in the world is an important and largely objective measure of scientific and engineering research leadership. For this analysis, the panel conducted broad literature searches as well as more targeted searches of specific mechanical engineering journals using the Scopus 1 database. Given the broad range of journals in which mechanical engineers publish, and in an effort to assess current trends in the directions of mechanical engineering research, the panel selected the journals as follows: • Journals with broad coverage of mechanical engineering (e.g., ASME Journal of Applied Mechanics) • Leading journals for each subarea of mechanical engineering: o Area-specific journals in which researchers from various sciences and/or engineering disciplines publish, along with researchers from mechanical engineering., (e.g., Journal of Power Sources) o Area-specific journals where mechanical engineering researchers are the primary contributors, e.g."}, {"section_title": "Journal of Fluid Mechanics", "text": "The full list of 68 mechanical engineering-related journals considered by the panel, including impact factors 2 and country of publication, is given in appendix Table C-1. The journals in that list include high profile journals with high impact factors, as well as journals important to subareas of mechanical engineering but that may have low impact factors. The panel largely focused its analysis of journal publications data on the change in publication rates and citations over roughly the 10 years 1995-2005, with particular attention paid to the change in the percentage of contributions from U.S. researchers."}, {"section_title": "Decreasing Overall U.S. Share of S&E Journal Articles", "text": "Examination of the number of articles published annually in the broader scientific literature on a regional basis shows that the profile of scientific activity worldwide has changed dramatically over the 15 years from 1988 to 2003 (Figure 2-1). 3 The long-standing scientific dominance of the United States persists, but other areas of the world are closing the gap. 4 In 1988, the United States was the largest contributor to S&E publications, even when compared to other regions. While the absolute number of U.S. S&E articles grew by 19 percent between 1988 and 2003, the output of articles from Western European nations combined increased by 67 percent and surged past the U.S. total. Dramatic growth was seen for articles from Korea (1,683 percent), China (630 percent), and Taiwan (556 percent). The percentage of articles coming from Asia and the subcontinent as a whole, which include China and India, have almost tripled in going from 4 to 10 percent. The percentage of all S&E articles from U.S. authors dropped from 38 percent to 30 percent between 1988 and 2003. FIGURE 2-1 Numbers of all S&E articles for select countries and regions. NOTES: Publication counts from set of journals classified and covered by Science Citation Index and Social Sciences Citation Index. Articles assigned to region/country/economy on the basis of institutional address(es) listed in article. Articles on fractional-count basis; i.e., for articles with collaborating institutions from multiple countries/economies, each country/economy receives fractional credit on the basis of proportion of its participating institutions. \"Asia 13\" includes Bangladesh, China (including Hong Kong), India, Indonesia, Malaysia, Pakistan, the Philippines, Singapore, South Korea, Sri Lanka, Taiwan, Thailand, and Vietnam. SOURCE: Regional and country portfolio of S&E articles, 1988, 1996, 2001, and 2003. NSF Science and Engineering Indicators."}, {"section_title": "U.S. Share of Mechanical Engineering Journal Articles", "text": "The panel conducted a literature search of the full catalog of journals in the Scopus database 5 using the search term \"mechanical\" in the author affiliation or source title to get a count of numbers of journal articles published for the period1988-2006. Based on these data, the panel found that the trend for the U.S. share of mechanical engineering journal articles is similar to the overall trend for S&E.   1 9 8 9 1 9 9 0 1 9 9 1 1 9 9 2 1 9 9 3 1 9 9 4 1 9 9 5 1 9 9 6 1 9 9 7 1 9 9 8 1 9 9 9 2 0 0 0 2 0 0 1 2 0 0 2 2 0 0 3 2 0 0 4 2 0 0 5 2 0 0 6 Year Share of Mechanical Engineering Journal Articles US China FIGURE 2-2 Comparison of U.S. and China's percentage share of contributions to overall mechanical engineering journal articles, 1988-2006. SOURCE: Scopus database (http://www.scopus.com/scopus/home.url) search, \"mechanical\" in source title or author affiliation, and country in author affiliation. Although the number of articles published by China and the United States are comparable, the journal titles where these two countries publish most of their research are quite different from each other ( SOURCE: Scopus database search, \"mechanical\" in source title or author affiliation, and country in author affiliation. At the same time, U.S. contributions to top international mechanical engineering journals have remained quite steady over the last five years (1999)(2000)(2001)(2002)(2003)(2004)(2005). From a list of 68 journals analyzed (see appendix Table C-2), the average U.S. contribution to mechanical engineering journal articles remained at around 40 percent between 1999 and 2005, with some mechanical engineering areas having significantly higher contributions from U.S. authors. Figure 2-3 (ranked from highest to lowest percentage U.S. contribution) shows the breakdown for journals according to year and area of mechanical engineering.  "}, {"section_title": "Steady U.S. Share of Most-Cited Articles", "text": "Journal article citations provide a better gauge of research leadership than numbers of articles. At the same time, counting citations is somewhat limited, since high citation counts often result from important past research results rather than current results. Nevertheless, this information on U.S. contributions to most-cited articles was obtained in two different ways in order to identify contributions to mechanical engineering. First, the Scopus database was used to determine the 50 most-cited articles for the 12 area-representative mechanical engineering journals (appendix table C-2), by year and country authorship. The average of the individual journal results (appendix Table C-3) show that U.S. authors contributed to 40-50 percent of the most-cited articles in these journals for all six years (Figure 2-4).  In a slightly different approach, the Scopus database was used to search for \"mechanical\" in the author affiliation or source title in all journals indexed for the periods 1987-1991, 1992-1996, 1997-2001, and 2002-2006. The top 100 most-cited articles from these periods were then searched for country of authorship to determine the U.S. contribution. Table 2-3 provides a summary of the results, showing the clear leadership position of the United States with 65 or more out of 100 articles over these times. The journal titles of the top 100 most-cited articles for each period were also sorted in order to evaluate mechanical engineering area contributions. Journals appearing in the top 100 three or more times are listed in Table 2-4. Overall, bioengineering, thermal systems and heat transfer, computational, and materialsrelated journals figure prominently among the lists. As expected, the most recent list for 2002-2006, largely includes nanotechnology, materials, and biologically focused articles in journals such as Acta Materialia (5), Nano Letters (5), and Science (5). However, the journal at the top of the list for this time period, with 6 articles out of the top 100, is the International Journal of Heat and Mass Transfer (all U.S. authored).  1 1987-1991, 1992-1996, 1997-2001, and 2002-2006 "}, {"section_title": "VIRTUAL WORLD CONGRESS", "text": "In another effort to evaluate the status of U.S. leadership in mechanical engineering, the panel called on an international group of leaders in the field for their qualitative assessment of the areas and subareas of mechanical engineering. This exercise is referred to as the virtual world congress (VWC), and it is based on the experience of past benchmarking panels. 6 To carry out the exercise, the field of mechanical engineering was divided into 11 major areas-and each area was subdivided into 2-5 subareas. The panel members individually identified 8-10 respected leaders throughout the world in each subarea. The selected organizers (listed in Appendix D) were asked to imagine that they were about to organize a VWC on the subarea topic; then, regardless of travel costs, visa restrictions, or the opinions of their peers, they were asked who would be the 10-20 speakers that must be a part of the imaginary session. A summary of the area results of the VWC (percentage of U.S. speakers chosen by area) presented in Figure 2-5. A detailed tabulation of the VWC results is given in appendix Table D-1. U.S. representation ranges from a high of 80 percent in the area of design and computer-aided design (CAD) to a low of 48 percent in the area of tribology. This is likely influenced by the origin of the VWC organizers (see Figure D-1). Overall about 70 percent of the VWC organizers were from the United States, and as expected, U.S. organizers were biased toward choosing U.S. speakers. U.S. organizers selected an average of 67 percent U.S. speakers, whereas non-U.S. organizers selected an average of 43 percent U.S. speakers. Also, because the VWC representation is largely populated by researchers with well-established reputations resulting from a long career, U.S. domination probably reflects past rather than present leadership. "}, {"section_title": "MECHANICAL ENGINEERING AREA ASSESSMENTS", "text": "The panel also qualitatively evaluated the different areas and subareas of mechanical engineering, and made assessments of leadership based on the combined analysis of journal citations and VWC results. U.S. leadership was determined based on the criteria shown in Box 2-1."}, {"section_title": "BOX 2-1 Criteria for Determining Research Leadership", "text": "Greater than 70 percent U.S. contribution-the United States is the strong leader Greater than 50 percent U.S. contribution-the United States is the leader Greater than 30 percent U.S. contribution-the United States is among the leaders Less than 30 percent U.S. contribution-the United States is lagging behind the leaders"}, {"section_title": "Acoustics and Dynamics", "text": "Acoustics and dynamics both deal with time-dependent phenomena that are ubiquitous in nature as well as in the designed objects of our technologically based world. Acoustics is the engineering and science of fluid oscillations that lead to perceived sound or noise (if the sound is unwanted). Dynamics is the study of motion of mechanical objects as they may occur in nature (e.g., birds, trees) or as constructed (e.g., aircraft, automobiles, spacecraft). To assess the current status of U.S. contributions in acoustics and dynamics, the following representative subareas were examined: • Nonlinear Phenomena. Current research and (to an increasing extent) practice deal with large or nonlinear motions of very complex systems with many (perhaps millions of) degrees of freedom. Motions at small scales such as nanodevices and phenomena, socalled micro air vehicles, and MEMS devices are now more often the applications of interest. • Complex Systems. Complex systems that involve a large number of degrees of freedom as may arise in computational models of fluid, structural, and molecular systems. Complex systems also arise due to the interaction of multimedia such as fluids interacting with structures or multiscale systems ranging from quantum to molecular to continuum models. • Computational Models. Modeling the large variety of nonlinearities that arise in fluids and solids, constructing computationally efficient models of systems with many degrees of freedom, and multiscale modeling of events at the nanoscale are current major research challenges. • Experimental Methods. Experimentally measuring the acoustic fields and dynamic response of complex nonlinear systems at very large to very small scales is also a major goal of current research."}, {"section_title": "Assessment", "text": "An average of 50 percent of the 303 VWC speakers selected in the area of acoustics and dynamics were from the United States. In the subareas, there was a 60 percent U.S. contribution in dynamics and a 41 percent U.S. contribution in acoustics. The U.S. contribution to journal articles and article citations is more mixed. In 2005, the U.S. contribution to most-cited articles in the Journal of Sound and Vibration was 44 percent. The U.S. contribution is greater than 50 percent in U.S.-based ASME and Acoustical Society of America (ASA) journals, but 30 percent or lower in the internationally based Journal of Sound and Vibration and Journal of Fluids andStructures. Between 1999 and2005, the average percentage U.S. contribution to articles published in acoustics and dynamics journals increased from 34 to 41 percent. Based on the combined analysis of journal citations (30-50 percent U.S.) and VWC data (50 percent U.S.), the United States is among the leaders in acoustics and dynamics basic research.\nMechanical engineering design in the United States is especially strong and has been in a global leadership role since the emergence of the field in the middle to late twentieth century. There is a strong U.S. representation in the VWC for this area, where an average of 79 percent of the 532 speakers are from universities, government agencies, and industries in the United States, with universities being the largest contingent. Primary \nAn average of 49 percent of the 714 speakers identified in the VWC were from the United States (appendix Table D-1), but the results for the subareas varied considerably. For example, about 60 percent of invited speakers in the subarea of control methodologies and control theories were from the United States, whereas there were 40 percent in mechatronics and applications. The two leading journals in the field with strong methodology orientation are Automatica and IEEE Transactions on Automatic Control. In these journals, U.S. authors made up 23 and 36 percent of the authors represented in 2005, respectively. The difference in representation of U.S. experts as authors of publications in journals versus U.S. speakers at virtual congresses can be attributed to the broad scope of this discipline in terms of the number of researchers and the number of topics. In other subareas, the dominance of the United States is not as evident, but the United States is certainly among the leaders. This is illustrated by the U.S. contribution to the most-cited articles in IEEE Robotics and Automation, 8 of 54, 46, 38, 34, and 48 percent respectively for the years 1995, 1997, 1999, 2001, and 2003. In the subarea of mechatronics and applications, 40 percent of virtual congress speakers are from the United States. This is consistent with the percentages of U.S. authors in application-oriented periodicals published in the United States: IEEE Transactions on Control Systems Technology (49 percent), and IEEE-ASME Transactions on Mechatronics (37 percent). U.S. authors, however, represent only 10 to 20 percent in Control Engineering Practice (CEP), another application-oriented periodical. This may be attributed to the preference of U.S. researchers to publish papers in ASME and IEEE journals, which are regarded as premier control journals in the international community; CEP is published by Elsevier in the Netherlands. In the ASME Journal of Dynamic Systems, Measurement, and Control, which covers the broad discipline of dynamic systems and control, 34 out of 81 articles (42 percent) were contributed by U.S. researchers. Taken together, the VWC (49 percent U.S.) and journal results (30-50 percent U.S) indicate that the United States is among the world leader in dynamic systems and controls.\nThe VWC for the area of energy systems resulted in 68 percent of the 274 speakers being from the United States, which indicates a strong leadership position in this area. However, an examination of article authorship in seven journals (see appendix Table C-1) in this area showed the average U.S. contributions to be about 30 percent. U.S. contributions to the Journal of Power Sources are around 20 percent, while U.S. contributions to the most-cited articles in this journal average around 22 percent over the 1995-2005. The combined VWC representation (68 percent U.S.) and the journal article results (20-30 percent) indicates that the United States is among the leaders in energy systems with well-recognized researchers, and the lack of recent publications in this area shows a significant weakening of leadership.\nAccording to the VWC results, about 50 percent of the 389 speakers named were from the United States. This was consistent across all the manufacturing subareas. This leadership position is further supported by an analysis of journals in this area. In the ASME Journal of Manufacturing Science and Engineering, U.S. contributions to the top 50 most-cited articles amounted to about 70 percent. In addition, four out of the five manufacturing journals analyzed showed greater than 50 percent U.S. contributions on average (Appendix Table C-2). Together, these results indicate that the United States is the leader in manufacturing basic research.\nThe VWC results for mechanics of engineering materials show that U.S. organizers picked more than 70 percent U.S. speakers, while international researchers named 50 percent U.S. speaker's to participate. U.S. researchers in the mechanics of engineering materials publish in a widerange of journals, some focused on the area of mechanics, such as the premier mechanics journal, Journal of Mechanics and Physics of Solids (JMPS), and with significant presence in journals specific to fields of application, such as Journal of Biomedical Materials Research. In JMPS, U.S. authors publish an average of about 65 percent of the most-cited articles. In addition, researchers have begun to broaden the visibility of the field and its contributions with publications in top general science journals such as Science, Nature, and Nature Materials. Overall, U.S. authorship is at about 50 percent for all articles combined in relevant journals. Together, these results indicate that the United States is the leader in the mechanics of engineering materials research.\n\nThe VWC results for the area of thermal systems and heat transfer show that an average of 65 percent of the 562 speakers were from the United States. This is similar to the U.S. contribution to the ASME Journal of Heat Transfer. An average of 50 percent of the 50 mostcited articles for the ASME Journal of Fluids Engineering were U.S. authored. In 2005, an average of 40 percent of 10 selected journal articles in this area were U.S. authored (see appendix Table C-2). Based on the combined results of the VWC (65 percent U.S.) and journal analysis (30-50 percent U.S.), the United States is the world leader in thermal systems research.\nAn average of about 50 percent of the 471 VWC speakers in the area of tribology were from the United States. The other countries with large contributions of speakers include the United Kingdom, France, and Germany in that order. There are also significant numbers from Japan, the Netherlands, Finland, Italy, and Sweden. The United Kingdom is strong in all subsubfields, while France is strong in hydrodynamic phenomena and Germany is strong in the area of tribomaterials. Primary venues to publish tribology research contributions are the ASME Journal of Tribology, the Society of Tribologists and Lubrication Engineers' STLE Tribology Transactions, Wear, Tribology International, and Tribology Letters. Many tribology-related articles are also published in physics, chemistry, and material science journals, as well as publications closely related to specific engineering applications fields such as transportation, environmental control, and manufacturing. Of the 50 most-cited articles in the journal Wear, an average of about 20 percent were by U.S. authors. U.S. authors appear more frequently among the most-cited authors than among authors in general in that publication. The reason U.S. authors appear less frequently in Wear than among the VWC authors may be that U.S. authors are more likely to publish in the two major U.S. publications in tribology-ASME Journal of Tribology and STLE Tribology Transactions. Wear is published in Europe. At the same time, about 30-50 percent of authors in the U.S.-based tribology journals mentioned above are from the United States, while in the British based journals, about 20 percent of the authors are from the United States. Tribology Letters has about 40 percent U.S. based authors. Based on the combined results of the VWC (50 percent U.S.) and journal analysis (20-50 percent U.S.), the United States is among the world leaders in tribology."}, {"section_title": "Biomechanics and Bioengineering", "text": "The field of biomechanics is concerned with motion, deformation, and forces in biological systems. Initially the field of biomechanics developed from contributions by experts trained in fields as diverse as auditory mechanics, cardiovascular mechanics, hemodynamics, musculoskeletal bioengineering, neuromuscular control and respiratory mechanics, and mechanism of propulsion for animal locomotion (walking, running, flying, and swimming). The first journal specializing in bioengineering appeared in the mid-1960s with the publication of the Journal of Biomechanics in 1965, which was followed by the ASME Journal of Biomechanical Engineering in 1976. Since then, biomechanical engineers have been at the forefront of medical device developments with tremendous clinical implications ranging from heart valves (e.g., the DeBakey-Noon heart pump), to artificial joints and more recent work on functional tissue engineering constructs, as well as pioneering multiscale and hierarchical strategies to connect physiologic function to cellular and molecular mechanisms. The diverse field of biomechanics may be subdivided into the following areas: • Biomechanics of auditory, cardiovascular, musculoskeletal, and respiratory systems. Involves in vivo, in vitro, and computational studies of the electrical and mechanical function of physiological systems. which are largely used in medical devices and implants."}, {"section_title": "Assessment:", "text": "An average of 75 percent of the 194 VWC speakers in the area of bioengineering and biomechanics came from the United States. These overall results are also consistent with those obtained from the chemical engineering panel, 7 which had significant overlap of both VWC organizers and speakers with the mechanical engineering panel. The share of U.S. contributions to journal articles is somewhat different. U.S. contributions to the most-cited articles in Biomaterials ranged from 20 to 40 percent between 1995 and 2005. As shown in Table 2-4, the most-cited mechanical engineering journal articles for the periods shown included a significant number of bioengineering journals-which are largely U.S. authored. Five bioengineering journals that currently have the top five greatest impact factors-Biomaterials, Journal of Orthopaedic Research, Journal of Biomedical Materials Research, Journal of Biomechanics, and Annals of Biomedical Engineering-were examined. In addition, from 1999 to 2005, U.S. authors consistently provided roughly 40 to 45 percent of the content of these journals. When taken in combination, the overwhelming virtual congress results (75 percent U.S.) and the relatively stable publications rate in the top bioengineering journals (40 percent U.S.), the United States can be considered the leader in the area of bioengineering and biomechanics basic research."}, {"section_title": "Computational Mechanics", "text": "Computational mechanics is concerned with the use of numerical methods and computer devices to study and predict the behavior of mechanical systems. Computational mechanics is a vital area of mechanical engineering, making possible the analysis, design, and optimization of systems at a level of sophistication not attainable by other means. At present, a large list of vital new technologies is on the horizon that will rely on advances in computational mechanics. These include new computational paradigms for nanomanufacturing design of new materials, patient-specific predictive surgery, drug design and delivery, weather and climate prediction, pollution remediation and detection and control of toxic agents, optimal design of mechanical systems, and many more. The successful development of a new generation of computer simulation tools that will make possible these technological advances will require substantial research efforts. While it can be argued that the field of computational mechanics began in the United States in the 1950s and 1960s, substantial early work was also conducted in the United Kingdom and Germany. Important developments came later in France and Japan, and new work and engineering applications occur worldwide. The major components of computational mechanics are (1) computational and applied mathematics, (2) modeling (including the development of algorithms software, and (3) computing, including the development of computational devices that enable large-scale computations; data storage, retrieval, and distribution; and the use of computational grids The major subareas of computational mechanics are computational fluid dynamics (CFD) and computational solid mechanics (CSM). Significant work in other subareas also exists, including computational electromagnetics, optimization, and biomedicine. These subareas of computational mechanics are described below: • Computational fluid dynamics. Includes the study of turbulent flow, combustion modeling, compressible flow and aerodynamics, multiphase flow, flow in porous media, rarified gas dynamics, and kinetic theory. "}, {"section_title": "Design and Computer-Aided Design", "text": "Design in mechanical engineering involves a number of diverse topics, all related to the process of developing and producing products, systems, processes, and infrastructures. This includes fundamental theories underlying product realization processes and the types of decisions that are made in a design process, issues in the modeling and simulation of systems, challenges in the synthesis and optimization of systems, and emerging topics in design informatics and environments. A holistic view of design is where a total system, life-cycle context recognizes the need for advanced understanding of the process of innovation, the identification and definition of preferences, the evaluation of alternatives, the effective accommodation of uncertainty in decisionmaking, and the relationship between information and knowledge in a digitallysupported design process. Mechanical engineering design in the United States is especially strong. However, this strong leadership across all areas of design is beginning to diminish, as Germany, France, England, Japan, Korea, China, and Australia each gain ground, while other European nations are also establishing themselves as leading authorities in specific areas of design. The subfields within design have been identified by examining both the historical foundations of the field of design and the modern research areas that are both defining and shaping this dynamic field. • Design Theory. Includes some of the basic pillars and frameworks of design and the types of models and decisions that are necessary in a design process. It includes research in the realm of \"design for\" capabilities, including studying system architecting and platforming. In addition, underlying research in the divergent and convergent processes underlying any design process is critical. Lastly, validation of these models and developments lies at the core of the research in design theory to effectively support fundamental decisions in design. • Design Modeling and Simulation. Includes the vast scientific challenges underlying the approaches to the geometric and analytical modeling of design artifacts and processes. In addition, a number of more recent theoretical, experimental, and computational topics in multiscale and distributed modeling of systems are germane to this subfield. As system complexity increases, there is a need to move beyond deterministic models and incorporate uncertainty and risk in design models, including adeptly developing appropriate surrogate modeling approaches. • Design Informatics and Environments. Includes the growing research challenges involved in capturing, representing, and manipulating the information and knowledge that is inherently woven throughout design processes. It includes information technology areas such as cyberinfrastructure development and design, digital libraries, and ontologies and human-computer interaction areas such as visualization, haptics, and web environments. • Design Synthesis. Includes the research challenges in design optimization such as inverse methods, numerical algorithms, global search, multimodal solutions, discrete problems, constrained models, and distributed processing among others. It also includes a number of difficult issues in synthesizing complex design processes and products such as multidisciplinary optimization, coordination processes, hierarchical methods, and agent networks."}, {"section_title": "Dynamic Systems and Controls", "text": "The discipline of dynamic systems and control deals with the analysis and synthesis of control systems that typically include feedback loops. Feedback control systems involve system components such as a plant, a feedback controller, actuators, and sensors. The control community is multidisciplinary, and active researchers come from aerospace engineering, electrical engineering, chemical engineering, mechanical engineering, and applied mathematics. For example, the American Control Conference, one of the most important conferences in the field, is sponsored by the American Automatic Control Council and membership societies including American Institute of Aeronautics and Astronautics, American Institute of Chemical Engineers, Association for Iron and Steel Technology, American Society for Civil Engineers, American Society of Mechanical Engineers, Institute of Electrical and Electronics Engineers, ISA-The Instrumentation, Systems, and Automation Society), and Society for Computer Simulation. In the 1960s, major advances in the state of space control system design methodologies, including optimal control theory, were made in the United States and the Soviet Union. These advances resulted from the pursuit of space exploration, and the United States still remains the world leader in the subfield of control system design methodologies, particularly in optimal and robust control theories (see discussion in the assessment below). For the purpose of the present study, the discipline is divided into the following subfields: • Modeling and Identification. In the design of control systems, it is important to understand the dynamics of the controlled plant; therefore, the controlled plant is modeled and identified. • Control System Design Methodologies or Control Theories. The feedback controller and other types of controllers must be designed to achieve various objectives such as stability, performance, robustness, and autoadaptive capability, and this is done with control system design methodologies and control theories. • Enabling Technologies (ET). ET such as sensors or actuators and hardware components are important because the actual synthesis of control systems must be supported by them. • Mechatronics and Applications. Motivations for research in the subfield of dynamic systems and control are often found in application domains, and application-oriented research has mechatronics aspects. Mechatronics refers to the synergistic integration of physical systems, decision-making, and electronic components such as digital signal processing (DSP) and intelligent sensors. • Robotics and Automation (R&A). In the mechanical engineering community, there are a number of application domains such as vehicles, transportation, manufacturing, biomedical systems, modeling, and control at micro-or nanoscales and so on. R&A may be regarded as an application area, but its coverage and scope are broad."}, {"section_title": "Energy Systems", "text": "Energy systems allow the conversion of an energy source (fossil fuel, nuclear plants, solar conversion) into a form that can be used immediately or stored and then recovered to fulfill a useful purpose (transportation, local power, etc.) The key issues and challenges in the subarea of energy systems presently center on reducing reliance on fossil fuels because of concerns regarding unstable supplies of petroleum, global climate change due to combustion product gases released into the atmosphere, and pollution resulting from fossil fuel production and conversion. With a few exceptions, federal research funding in this area has been very poor for some decades. The subareas that can be identified are (1) renewable energy systems and sources, (2) energy conversion and storage, and (3) nuclear energy. • Renewable energy systems and sources. Include solar, wind, biomass, ocean thermal energy conversion (OTEC), and geothermal energy, and the systems used for converting energy from these sources into useful forms. • Energy conversion (power plants, engines, fuel cells, photovoltaic, thermionic, etc.). Includes devices and systems for converting a primary energy source into a useful energy form. • Energy storage (batteries, flywheels, phase change, etc.). Methods and systems for storing energy so that intermittent or steady energy production can be matched with intermittent or steady energy loads. • Nuclear energy (modeling of reactor fuel and computational fluid dynamics for reactor design). Includes design, analysis, and testing of advanced nuclear power systems such as high-temperature gas cooled reactors, as well as modification and safety analysis of existing nuclear systems."}, {"section_title": "Manufacturing and Computer-Aided Manufacturing", "text": "Manufacturing is the production of goods and services using raw materials and labor, Many of the specific issues associated with manufacturing are being done by mechanical engineers and include development of processes for creation of materials and material surfaces (textures) and interfaces, by machining and molding, for such varied uses as reducing drag of automobiles, creating the next generation of data storage devices, and developing concepts and tools (electrooptomechanical) for automated assembly. For the purposes of this study, manufacturing was divided into five subareas: processes, tooling and equipment, systems, metrology, and quality. • Manufacturing Processes. Involve materials removal processes (e.g., turning, milling, drilling, grinding), nonconventional materials processes (e.g., electrical discharge machining, electrochemical machining, energy beams such as laser, ion focus beam, or water jet), materials deformation processes (e.g., sheet forming, bulk forming, rolling, extrusion), casting processes, sinter and powder metallurgy (e.g., ceramic, powder metals), joining processes, and assembly processes • Manufacturing Toolings and Equipment. Covers cutting tools, dies and molds, and fixtures, as well as computer numerical control and high-speed machines). • Manufacturing Systems. Have to do with flexible manufacturing systems, reconfigurable manufacturing systems, group technologies, and process planning. • Manufacturing Metrology. Involves coordinate measuring machines, optical gauges, and in-process inspection. • Manufacturing Quality. Covers statistical process control (e.g., \"6-Sigma\"), variation reduction, and root cause identification)"}, {"section_title": "Mechanics of Engineering Materials", "text": "This field has a long history both inside and outside the United States. Research in the United States has maintained a strong leadership due to the ability of researchers to rapidly apply the concepts of mechanics to new and evolving problems. Current and future fields of intense interest include mechanics of materials at very small length scales, application to complex hierarchical biological materials, and multiscale modeling and experimentation. Such foci permeate traditional fields such as damage mechanics and experimental mechanics by providing important new applications for mechanics and new tools by which to further our understanding of materials and enable the creation of devices and materials for the well-being of society. • Nanomechanics and nanomaterials. Involves understanding at the nanometer level the mechanisms and limits of mechanical changes, the stability of materials, and the transfer of energy to and from materials. • Durability mechanics. Has to do with the material science of large physical structures, largely involving fracture mechanics and the deterioration of materials. • Computational materials. Involves numerical methods for the analysis of the nonlinear continuum response of materials, which includes: elasticity, inelasticity, molecular statics and dynamics modeling across atomistic, molecular, and continuum scales. • Experimental mechanics. Has to do with understanding the mechanical behavior of materials, structures, and systems, especially at small scales and bridging between scales and bridging to theory. • Multiscale mechanics: involves the use of theory, experiment, and numerical simulation in combination, to understand heterogeneous materials, biomaterials, composites, and micromechanics at all levels of function."}, {"section_title": "Microelectromechanical Systems and Nanoelectromechanical Systems", "text": "Microelectromechanical systems (MEMS) is the technology of very small devices and systems having important dimensions at the micrometer level (i.e., between a micrometer and a millimeter), too small to machine with traditional physical methods but too large to build with chemical syntheses. Born from the semiconductor integrated circuit (IC) fabrication processes, MEMS technologies typically use deposition and etching of materials along with photolithographically defined mask patterns. Today, the fabrication arsenal has been enriched by several IC processes commercialized specifically for MEMS (e.g., deep reactive ion etching) and many non-IC processes modified for microfabrication (e.g., microelectrodischarge machining, electroplating into micromolds). MEMS is considered coming of age with a few commercial successes of high visibility (e.g., automobile airbag sensor, micromirror array for high-definition display, inkjet printhead). Although the success is most often viewed through applications, the fabrication technologies constitute the indispensable basis for the next wave of success across fields beyond electronics (e.g., biomedical). With the focus of funding shifted to application research years ago however, MEMS appears to have lost support in fundamental and core research rather prematurely. Despite dramatic miniaturization, MEMS is still within the realm of continuum mechanics. Nanotechnology (Nano) is poorly defined today, but it generally deals with engineering at the nanometer scale. Originally inspired by molecular engineering in its core intent (i.e., building three-dimensional structures molecule-by-molecule in bottom-up approaches), nanotechnology is currently dominated by material syntheses, thinfilms, and nanoscale ICs. To assess the current status of the U.S. contribution to MEMS/Nano, the following representative subareas were examined: • Fundamental Issues in MEMS and Nano. The physics unique to the scale are the main points of focus for the field. As an example for both MEMS and Nano, the surface-to-volume ratio is extremely large compared to conventional mechanical engineering devices and systems. The scale effects are prohibitive in some cases but enabling in others. Understanding the fundamentals allows one to avoid the problems and take advantages of the unique opportunities of being in the given scale. • Design and Modeling. Design and Modeling are based on the fundamental issues and allow one to design products and predict their performance, minimizing the trial-and-error development cycles. Modeling in MEMS typically requires simultaneous solution of multiphysics issues. Modeling for Nano often requires simulation at the molecular level, and the boundaries may be blurred between mechanical engineering and chemistry even for machines in nanometer scale. • Micro/Nano Process Technologies. The ability to fabricate objects in micro-or nanometer scale is a major obstacle. MEMS processes typically use top-down methods, forming the shape by removing unnecessary portions. Nano processes are said to be based on bottom-up methods, building by placing the minimum unit of materials one at a time. However, most nanofabrication methods today are extensions of known methods (e.g., embossing into molds having submicrometer features). • Micro/Nano Devices and Systems. The components or final products whose key functions originate from micro-or nanoscale features are Micro/Nano devices and systems. For example, an airbag deployment sensor is a complete microdevice or system, which in turn is a component of an automobile. The same can be said for a digital light processor (DLP) for high-definition television (HDTV) or the printhead of an inkjet printer. On the contrary, examples of devices are rare as yet in the Nano field. Based on the combined results of the VWC (>50 percent U.S.) and journal analysis (30-50 percent U.S.), the United States is among the leaders in the world in both MEMS/Nano research."}, {"section_title": "Thermal Systems and Heat Transfer", "text": "Research and development in thermal systems and heat transfer span a variety of fields including fluid mechanics (e.g., multiphase flows, plasmas, turbulence, biofluids), heat transfer (e.g., convection, conduction, radiation, phase change), and micro-and nanothermofluid systems and applications. Applications and technology development have been led by U.S. researchers include aerospace, nuclear, propulsion, electronics and photonics thermal management, advanced manufacturing, laser-material interactions, HVAC (heating, ventilation, and air conditioning), and flow control. • Combustion. Involves experimental and analytical studies in combustion, applications in power generation, propulsion, and fire safety. • Heat transfer. Has to do with studies of fundamental heat transfer phenomena in radiation, conduction, convection, mixed modes, and phase change. • Fluid mechanics. Includes plasmas, multiphase flow, turbulence, biofluids, supersonic and hypersonic flows, and shocks. • Nano/Micro systems. Involve thermal properties and heat transfer in fluids, nanofluidics, and nanocomposites; and near-field effects in radiation, phonon and photon transfer, and property modifications at a small scale. • Applications. Are very wide ranging, including electronic cooling, aerospace, nuclear, propulsion, advanced manufacturing, laser-material interactions, HVAC, flow control, power generation, and electronics cooling."}, {"section_title": "Tribology", "text": "Tribology is the study of surfaces in relative motion. It encompasses the areas of friction, lubrication, and wear. Tribology is an enabling technology in that all mechanical systems involve surfaces in relative motion that require control of friction, motion, and wear. Mechanical systems could not operate without triboelements. New mechanical systems, or upgrades of existing mechanical systems, often require new developments in tribology to accommodate increases in speed, load, or operating temperature. Research in tribology tends to be done in the mechanical engineering community, although considerable contributions also come from the physics, chemistry, material science, and applied mathematics communities. The term tribology originated in Great Britain in 1966, and the British, along with Americans, tend to dominate the field. Other countries making significant contributions tribology include France, Japan, Germany, and to a lesser extent Israel, Norway, Finland, Sweden, The Netherlands, Switzerland, and China. Prior to the collapse of the Soviet Union there were considerable contributions from that country. The continuous driver in tribology research is to push mechanical systems to higher loads, higher temperatures, higher speeds, and longer more reliable life. Tribology can be divided into five subareas. • Hydrodynamic phenomena. Are concerned with those situations in which the surfaces are separated by a fluid, either a liquid or a gas, and a pressure in the fluid is generated by the relative motion of the surfaces, or an external source, sufficient to support the load on the surfaces and keep the surfaces from contacting one another. • Friction and wear. Is concerned with solid surfaces in relative motion and in contact with one another resulting in friction forces resisting motion and resulting in the wear of surfaces. • Tribomaterials. Involves all types of material development and selection for tribological elements such as bearings, brakes, cams, and tires, and the lubricants used in triboelements. • Contact mechanics and surface engineering. Has to do with surface and near surface material deformation and fatigue resulting from highly concentrated loads occurring in some triboelements, such as rolling element bearings and rail-wheel contact. • Diagnostics. Involves developing techniques for early detection of mechanical failure in machinery."}, {"section_title": "SUMMARY", "text": "Mechanical engineering is the foundation for the creation of the industrialized world, and it is a central element of all engineering disciplines. It is at the heart of design, creation, and manufacturing of wealth-generating devices in the twenty-first century. Research in mechanical engineering is no doubt essential to future technological innovation. Evidence for current basic research leadership in mechanical engineering comes from an analysis of journal articles, mostcited articles, and virtual congresses conducted by the panel. Overall, the United States is certainly among the leaders in mechanical engineering basic research. However, excellent mechanical engineers throughout the world provide stiff competition for the United States. • In 2002In -2006 \nThe United States now holds a leadership position in most areas of mechanical engineering basic research. However, because of the advance of mechanical engineering in other nations, competition is increasing and the U.S. lead will shrink. The United States is particularly strong in emerging areas at the interface with other disciplines. In these areas, which include biomechanical engineering, design, and mechanics of materials, the United States will maintain a leadership position in spite of growing competition. In some core areas where the U.S. position is currently not as strong such as acoustics and dynamics, dynamic systems and controls, computational mechanics, and tribology, U.S. leadership may continue to face further challenges from other nations. In the areas where the United States is currently the leader in research, bioengineering, design, manufacturing, mechanics of engineering materials, and thermal systems and heat transfer, U.S. leadership should remain strong. On the basis of current trends in the United States and abroad, the relative future U.S. position in mechanical engineering basic research is outlined below: • There will likely be continued movement offshore of mechanical engineering R&D by U.S. companies, as well as increased competition from foreign companies. Local talent will be hired, which will likely include international students educated and trained in the United States. • There will also be more international research collaborations (United States and other countries, between countries in the European Union, etc.) • U.S. universities will continue to reach out and offer educational opportunities abroad and online. For example, the Singapore-MIT alliance (SMA) 4 founded in 1998 is an engineering education and research collaboration among the National University of Singapore (NUS), Nanyang Technological University (NTU), and the Massachusetts Institute of Technology (MIT). Online there is the international multi-university OpenCourseWare Consortium. 5 If the United States does not continue such outreach efforts, other countries certainly will. • Contemporary issues such as national security, energy, manufacturing competitiveness, sustainability will be a strong influence on research directions in mechanical engineering. These are areas in which mechanical engineering can make significant contributions. • Going forward, there will be a continued emergence of certain fields such as MEMS, nanotechnology, mechatronics, alternative energy sources, biomedical materials and devices, green manufacturing, and materials over many length scales. In addition, there will be continued importance of high-technology fields in which the United States maintains a strong leadership position, such as the design and manufacturing of civilian and military aircraft, healthcare diagnostics, and power generating systems. • U.S. academic mechanical engineering departments continue to attract international talent for graduate studies; however, the barriers to travel for international students and visiting faculty may impact the ability of the United States to continue to attract this important source of research talent. In conclusion, U.S. leadership in mechanical engineering overall will continue to be strong. The contributions of U.S. mechanical engineers to journal articles will increase, but so will the contributions from other growing economies such as China and India. At the same time, the supply of U.S. mechanical engineers is in jeopardy, due to declines in the numbers of U.S. citizens obtaining advanced degrees and uncertain prospects for continuing to attract foreign students. U.S. funding of mechanical engineering research and infrastructure will remain level, with strong leadership in emerging areas. "}, {"section_title": "Key Factors Influencing U.S. Leadership in Mechanical Engineering Basic Research", "text": "In the previous chapter, the panel evaluates leadership in mechanical engineering as measured by numbers and quality of journal articles and a virtual congress conducted by the panel members. This leadership is influenced by a multitude of factors that are largely the result of national policy, economics, and available resources of each country in the world. Here, the panel focuses on three key factors that influence the international leadership status of U.S. mechanical engineering basic research: 1. Centers, facilities, and instrumentation: the physical infrastructure for conducting mechanical engineering basic research 2. Human resources: the national capacity for producing and employing mechanical engineering students and degree holders. 3. Research and development funding: financial support for conducting mechanical engineering research"}, {"section_title": "CENTERS, FACILITIES, AND INSTRUMENTATION", "text": "Modern science and engineering research involves interdisciplinary collaboration, requiring specialized hardware and software often used by multiple disciplines. At the same time, mechanical engineers have specific needs to be met. The health and competitiveness of mechanical engineering research depends on the availability of cutting-edge facilities at U.S. universities and national laboratories. Examples of such facilities are described below. When available, important international facilities are also included. This section does not provide an analysis of the availability of or funding for centers, facilities, and instrumentation-it is meant to highlight the types of such infrastructure resources that are important for carrying out mechanical engineering research. The types of centers, facilities, and instrumentation of interest to mechanical engineering research fall into the following broad categories: • Materials characterization and micro-or nanofabrication "}, {"section_title": "Materials Characterization and Micro-or Nanofabrication", "text": "In the mechanics of engineering materials subarea, central facilities are extremely important, especially for the experimental side of the research. As the frontiers of research have moved to an increasingly small scale, access to electron microscopy, scanning probe microscopy and other specialized equipment is essential. These types of equipment are typically not found in individual research labs, they are housed in central facilities on campuses or in other research centers. At the elite research universities in the United States, access to such equipment is quite good, though in some cases usage fees can be excessive. Internationally, the same situation holds, where one potential difference is that in many foreign nations equipment is staffed by trained technicians who can facilitate the consistent quality as well as the speed of work. In addition to this equipment, access to large-scale, unique equipment such as synchrotrons is increasingly important. In the United States these facilities are run by the U.S. government and access for academic work is well supported. Characterization of materials often requires high-energy light sources-such as synchrotron and neutron sources-or other specialized facilities that need a significant level of funding to operate and maintain. These are typically available only at national facilities both here and abroad. Examples of important synchrotron sources include the following: Most research-intensive universities are well equipped with conventional micro-and nanofabrication techniques such as thin-film deposition (e.g. chemical vapor deposition, physical vapor deposition), lithography, chemical etching, and electrodeposition, as well as characterization techniques such as electron microscopy, electron and X-ray diffraction, and probe microscopy that are used routinely to characterize small structures, small volumes, and thin films. However, the ability to characterize extremely small nanostructures or to tailor materials at an atomic level requires much more specialized equipment. The Department of Energy is now in the process of opening five Nanoscale Science Research Centers 3 that will provide just such capabilities. Four of these centers are listed here, and one is mentioned later in the discussion of biological capabilities. 1. The Center for Nanoscale Materials is focused on fabricating and exploring novel nanoscale materials and, ultimately, employing unique synthesis and characterization methods to control and tailor nanoscale phenomena. 2. The Center for Functional Nanomaterials provides state-of-the-art capabilities for the fabrication and study of nanoscale materials, with an emphasis on atomic-level tailoring to achieve desired properties and functions. 3. The Center for Integrated Nanotechnologies features low vibration for sensitive characterization, chemical and biological synthesis labs, and clean rooms for device integration. 4. The Center for Nanophase Materials Sciences is a collaborative nanoscience user research facility for the synthesis, characterization, theory-modeling-simulation, and design of nanoscale materials. Other agencies and even some universities support key nanofabrication facilities. The National Science Foundation funds several nanofabrication facilities (e.g., at Cornell University) that are available to external users and are part of a larger National Nanotechnology Infrastructure Network (NNIN). 4 The Cornell Nanofabrication Facility 5 provides fabrication, synthesis, characterization, and integration capabilities to build structures, devices, and systems from atomic to complex large scales. Carnegie Mellon University independently operates its own user facility that serves the broader community. The Nanofabrication Facility at Carnegie Mellon 6 provides facilities for data storage, thin film, and device development and includes extensive cleanroom space."}, {"section_title": "Manufacturing, Automation, Rapidprototyping", "text": "Mechanical engineers are involved in all aspects of manufacturing from product design to process controls. A key infrastructure resource for manufacturing is the Manufacturing Engineering Laboratory (MEL) at the National Institute of Standards and Technology (NIST). MEL conducts research and development, provides services, and participates in standards activities related to mechanical and dimensional metrology. One particular area of success has been in lean manufacturing; many industrial success stories are available on the NIST Manufacturing Extension Partnership website. 7 Similar facilities exist at universities, such as the NSF Center for Reconfigurable Machining Systems (RMS) at the University of Michigan, Ann Arbor. \"[RMS) is one designed at the outset for rapid change to quickly adjust its production capacity and functionality in response to sudden market changes and customer demand.\" 8 Mechanical engineers are concerned with the calibration and quality control of measurement of instruments and manufacturing devices. Microcomputed tomography (microCT) is used for high resolution imaging. Another example is the use of micropatterning (Columbia University has three N.Y. state-funded centers for conducting this kind of research). NIST offers extensive measurement and standardization facilities. In the area of automation and dynamic systems and controls, many university centers provide important shared facilities, such as the Iowa Driving Simulator at Iowa State University or automated highway research facilities at the University of California at Berkeley. Physical prototyping infrastructure facilities allow researchers to rapidly produce prototypes of products as a means to better validate theoretical and applied developments. Although a small handful of rapid prototyping centers exist across the nation (e.g., Milwaukee School of Engineering, Georgia Tech, University of Louisville) and isolated prototyping machines at a large number of universities, there is very limited accessible infrastructure dedicated to providing researchers the ability to test and validate their advancements in design. Emerging quickly, largely because of digital advances and global market pressures, is the need for virtual prototyping, allowing researchers to create functional digital models of products and systems while also providing tactile feedback using haptic and virtual reality technologies. Although there are a small handful of design centers with virtual prototyping capabilities (e.g., Iowa State University, University of Iowa, University at Buffalo-State University of New York), and isolated researchers with haptic devices and visualization facilities, there is limited infrastructure dedicated to providing researchers the ability to virtually test and validate their advances in design research. In addition, more action is being taken to coordinate R&D in manufacturing across federal agencies, including joint solicitations through the efforts of the Interagency Working Group (IWG) on Manufacturing Research and Development. 9 One report that will be forthcoming from the IWG is related to manufacturing R&D in three specific areas: (1) nanomanufacturing; (2) manufacturing for the hydrogen economy; and (3) integrated and intelligent manufacturing systems."}, {"section_title": "Biomechanical Engineering", "text": "The need for biomechanical engineering facilities fall into three areas: (1) characterizing signal transduction (cells sensing external signals) such as effects of shear force, which requires multiscale computational power; (2) imaging at smallest length scales (i.e., nanometer) level; and (3) mimicking biological tissues-biomimetics (e.g., tissue engineering). Two examples of new centers providing state-of-the-art facilities and approaches for bioengineering research are given below-starting with one of the DOE's nanoscale science research centers."}, {"section_title": "The Molecular Foundry provides instruments and techniques for users pursuing", "text": "integration of biological components into functional nanoscale materials. 10 2. The Institute for Systems Biology takes a multidisciplinary approach to addressing systems biology that includes integration of research in many sciences including biology, chemistry, physics, computation, mathematics, and medicine. 11"}, {"section_title": "Cyberinfrastructure", "text": "According to the National Science Foundation, cyberinfrastructure refers to the distributed computer, information, and communication technologies combined with the personnel and integrating components that provide a long-term platform to empower the modern scientific research endeavor. 12 Advances in computational mechanics depend heavily on (1) advances in high-performance computing (HPC) devices; (2) new software that is compatible with the changing computer platforms; and (3) new algorithms and methods to model advanced problems in mechanical engineering, such as multiscale and multiphysics events in nanomanufacturing. Two examples of engineering cyberinfrastructure capabilities are the following: 1. The Collaborative Large-scale Engineering Analysis Network for Environmental Research (CLEANER) addresses large-scale human-stressed aquatic systems through collaborative modeling and knowledge networks. 13 2. The Network for Computational Nanotechnology connects theory, experiment, and computation in a way that makes a difference to the future of nanotechnology. 14"}, {"section_title": "Energy and Flow Systems", "text": "Generally, research in thermal systems and heat transfer relies on small-scale lab experiments. The exception is large flow systems such as wind tunnels and facilities for testing turbine blade cooling systems, nuclear fuel assembly thermal test systems, and other specialized facilities. Large scale wind tunnels for sub-, super-, and hypersonic flow were originally maintained by the National Aeronautics and Space Administration (NASA) under its aeronautics program. This program has been cut back significantly, and many of these facilities have been put in storage or permanently dismantled. Wind tunnels are also used for acoustics and dynamics research. NASA has one at Langley-used for high-noise chambers. Slow-neutron sources (such as the Savannah River Site reactor) are used for real-time imaging of casting and engines. Turbines are also critical to energy and research in aeropropulsion and turbomachinery, and laboratories or facilities exist mainly at universities-for example the gas turbine laboratory (GTL) at the Massachusetts Institute of Technology, Ohio State University, or Georgia Institute of Technology. There is also a well-known GTL at the National Research Council Canada (NRC) Institute for Aerospace Research, located in Ottawa."}, {"section_title": "HUMAN RESOURCES", "text": "Human resources are an essential component of leadership in mechanical engineering. Below, the panel discusses overall characteristics of worldwide science and engineering human resources, and then focuses on some important features of the U.S. supply of mechanical engineers."}, {"section_title": "Strong Competition for International S&E Human Resources", "text": "In terms of sheer numbers of engineering undergraduate degrees granted, the United States is outpaced by China, Japan, Russia, and South Korea (Table 3-1). In the physical and biological sciences, the United States is behind India, China, and Russia. Moreover, the United States ranks lower than most industrialized nations in the percentage of 24-year-olds who hold their first university degrees (e.g., bachelor's degree in the United States) in natural sciences and engineering (NS&E: see Figure 3-1). U.S. competitors in Europe and Asia are producing a higher percentage of NS&E degree holders.  2002Australia 2002France 2002United Kingdom (2003) Russia (1999) European Union 2002Japan 2004Poland 2002Canada (2001) Singapore (1995) Italy 2002Germany 2002 The United States is the single largest producer of natural science and engineering doctoral degrees (see Figure 3-2). However, the number of U.S. doctorates has been declining gradually since the late 1990s. At the same time, the number of China's doctorates leveled off after rapid growth in the early 1990s.   15 The study also found that among S&E disciplines, the highest stay rates were for computer and electrical and electronic engineering and the physical sciences. Most foreign doctorate recipients come from four countries. The stay rates for two of these countries, China (90 percent) and India (86 percent), are very high, while those for the other two, Taiwan (47 percent) and Korea (34 percent), are well below the average for all countries."}, {"section_title": "Steady Supply of Mechanical Engineers in the United States", "text": "A good measure of the near-term supply of new mechanical engineers is to look at the recent trend in the number of graduate students in the United States, which is discussed in more detail below. A measure of the midterm availability of U.S. research mechanical engineers is provided by the number of B.S. mechanical engineering degrees granted in the United States (Figure 3-3); which has drifted down by about 6 percent over the most recent decade for which data are available-from 15,297 in 1994 to 14,368 in 18,000 1 9 8 4 1 9 8 5 1 9 8 6 1 9 8 7 1 9 8 8 1 9 8 9 1 9 9 0 1 9 9 1 1 9 9 2 1 9 9 3 1 9 9 4 1 9 9 5 1 9 9 6 1 9 9 7 1 9 9 8 2 0 0 0 2 0 0 1 2 0 0 2 2 0 0 3 2 0 0 4 Year"}, {"section_title": "Degrees Awarded", "text": "Bachelor's Master's Doctorate FIGURE 3-3 Mechanical engineering degrees awarded, by degree level: 1984-2004. SOURCE: National Science Foundation, Division of Science Resources Statistics. 2006. Science and Engineering Degrees: 1966-2004. January 2007 On a still longer time scale, the supply of scientists and engineers overall depends on the current state of the U.S. K-12 educational system. Here, there have been ongoing concerns about K-12 math and science education in the United States compared with other countries, based largely on the results of internationally administered tests. In 2004, the NSF summarized the situation: \"U.S. students are performing at or below the levels attained by students in other countries in the developed world,\" and \"In international comparisons, U.S. student performances become increasingly weaker at higher grade levels.\" 17 More recent results reported by NSF showed a more mixed picture-where U.S. fourth and eighth grade students scored above average on the international tests, but U.S. 15-year-olds scored below average. 18 Because of the difficulties in locating quantitative data on mechanical engineering human resources at the international level, the panel concentrated on the trends in the number of U.S. mechanical engineering graduate students and Ph.D.s. The data shown in the following figures demonstrate that the numbers of U.S. graduate students and Ph.D.s have remained fairly steady over the past 10-20 years due to the growing number of foreign-born mechanical engineering graduate students and Ph. D.s. Between 1985 and2005 (Figure 3-4), there was a fluctuating, but overall steady, supply of graduate students enrolling in mechanical engineering. In the late 1990s, there was a decline in the number of U.S. citizens and permanent residents enrolling in mechanical engineering graduate programs that has begun to rebound more recently. Increasing enrollment of temporary residents has compensated for the declines in U.S. citizens and permanent residents. 18,000 20,000 1 9 8 5 1 9 8 7 1 9 8 9 1 9 9 1 1 9 9 3 1 9 9 5 1 9 9 6 1 9 9 7 1 9 9 8 1 9 9 9 2 0 0 0 2 0 0 1 2 0 0 2 2 0 0 3 2 0 0 4 2 0 0 A better indicator of current trends, however, is to look at first-time full-time graduate enrollments, because overall graduate student enrollments include individuals who began school up to five or six years ago. Again during the period shown, first-time full-time graduate student enrollments in the United States fluctuated but overall remained above 2,800 (Figure 3-5). 1,000 1,500 2,000 2,500 3,000 3,500 4,000 1 9 8 5 1 9 8 7 1 9 8 9 1 9 9 1 1 9 9 3 1 9 9 5 1 9 9 7 1 9 9 9 2 0 0 0 2 0 0 1 2 0 0 2 2 0 0 3 2 0 0 4 2 0 0 5 Year First-time Full-time Mechanical Engineering Graduate Students There has been concern about the potential impacts of immigration policies following the terrorism events on September 11, 2001. A breakdown of first-time full-time enrollments by residency ( Figure 3-6) shows that for 2003-2005, temporary resident enrollments fell below those of U.S. citizens and permanent residents.   Figure 3 -7, between 1975 and 1995, the number of earned mechanical engineering Ph.D.s in the United States more than doubled due to increases in the number of doctorates awarded to both U.S. citizens and temporary residents. Over the past 10 years for which data are available (1995)(1996)(1997)(1998)(1999)(2000)(2001)(2002)(2003)(2004)(2005), the number of earned mechanical engineering doctorates awarded each year has fluctuated, but overall remained above 800 doctorates awarded per year. At the same time, there was a significant decline in the number of doctorates awarded to U.S. citizens.  1975 1978 1981 1984 1987 1990 1993 1996 1999 2002 2005   Graduate student support also has some impact on the appeal of mechanical engineering research to students and the competitiveness of the discipline. Graduate students in mechanical engineering have been supported adequately over the past 20 years. During this time, graduate research assistantships have increased significantly. Research assistantships (RAs) accounted for more than 50 percent of graduate student support in 2004 (see Figure 3-8), with only a small number of fellowships. In comparison, chemical engineering graduate students received more than 50 percent of their support from RAs, with the rest of the support split nearly equal between fellowships, teaching assistantships (TAs), and other mechanisms. 19 Research assistantships for mechanical engineering graduate students have largely been supported by NSF, the Department of Defense (DOD) and other federal sources (see Figure 3-9). Chemical engineering graduate students also receive significant RA support from NSF and from other federal agencies. Chemistry graduate student RAs are supported by NSF, the National Institutes of Health (NIH), and other agencies. 12,000 14,000 16,000 1 9 8 0 1 9 8 2 1 9 8 4 1 9 8 6 1 9 8 8 1 9 9 0 1 9 9 2 1 9 9 4 1 9 9 6 1 9 9 8 2 0 0 0 2 0 0 2 2 0 0 4 Year Mechanical Engineering Grad Students"}, {"section_title": "Total", "text": "Research Assistantships Fellowships Teaching Assistantships Other Mechanisms FIGURE 3-8 Full-time mechanical engineering graduate students by mechanism of support, 1980-2004. SOURCE: NSF/SRS, Survey of Earned Doctorates, Integrated Science and Engineering Resources Data System (WebCASPAR), http://webcaspar.nsf.gov (accessed July 11, 2007).  1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 FIGURE 3-9 Full-time graduate students in mechanical engineering on research assistantships, by funding source. NOTE: Nonfederal is likely not directly from federal sources, whereas NSF, DOD, and NIH are directly funded graduate fellowships. SOURCE: NSF/SRS, Survey of Earned Doctorates, Integrated Science and Engineering Resources Data System (WebCASPAR), http://webcaspar.nsf.gov (accessed September 5, 2006)."}, {"section_title": "Favorable Job Prospects and Salaries for U.S. Mechanical Engineers", "text": "Employed mechanical engineering degree holders have steadily increased (Figure 3-10). The percentage change increase from 1999 to 2003 was 22 percent overall, 23 percent for bachelor's, 18 percent for master's, and 11 percent for Ph.D.s.    1999and 2003. SOURCE: NSF, S&E Indicators, 2004, 2006 According to the Bureau of Labor Statistics 2006-2007 mechanical engineers can expect the following employment conditions: \"Mechanical engineers [with S&E degrees) are projected to have an average rate of employment growth [9-17 percent] through 2014. Although total employment in manufacturing industries-in which employment of mechanical engineers is concentrated-is expected to decline, employment of mechanical engineers in manufacturing should increase as the demand for improved machinery and machine tools grows and as industrial machinery and processes become increasingly complex. Also, emerging technologies in biotechnology, materials science, and nanotechnology will create new job opportunities for mechanical engineers. Additional opportunities for mechanical engineers will arise because the skills acquired through earning a degree in mechanical engineering often can be applied in other engineering specialties.\" The expected earnings for mechanical engineers are also quite good. While earnings for engineers vary significantly by specialty, industry, and education-engineers as a group earn some of the highest average starting salaries among those holding bachelor's degrees. Table 3-2 shows the average starting salary offers for engineers, according to the Fall 2007 Salary Survey by the National Association of Colleges and Employers. Earnings for more experienced mechanical engineers (with Ph.D.s) as measured by median annual salary since degree (Figure 3-12), grew 3.1 percent annually between 1993 and 2003, which is 0.7 percent more than inflation. "}, {"section_title": "R&D FUNDING", "text": "Here the panel looks at trends in international levels and S&E funding and specific R&D funding for mechanical engineering in the United States. As discussed earlier, the U.S. innovation system benefits greatly from the variety as well as consistency of funding sources."}, {"section_title": "Steady Funding for S&E in the United States", "text": "The United States spent more on science and engineering R&D over 1981-2002 than any other OECD (Organisation for Economic Cooperation and Development) country (Figure 3-13). In 2003, the U.S. spent more than $250 billion (constant 2000 U.S. dollars) on total R&D. About $50 billion of the U.S. expenditures were defense related (Figure 3-14), which is equivalent to Germany's total S&E expenditures. The United States accounted for more than 40 percent of the yearly international expenditures for S&E. Between 1981 and 2001, the U.S. contribution has declined from 45 percent to 43 percent, and the G7 contribution from 91 percent to 84 percent. 1 9 8 3 1 9 8 5 1 9 8 7 1 9 8 9 1 9 9 1 1 9 9 3 1 9 9 5 1 9 9 7 1 9 9 9 2 0 0 1 2 0 0 3  1981 1983 1985 1987 1989 1991 1993 1995 1997 1999 2001 2003  The intensity of a nation's investment in S&E is better measured as a percentage of its gross domestic product (GDP) spent on R&D. In 2003 the United States spent a smaller percentage of its GDP (2.2 percent) on nondefense R&D than either Japan (3.1 percent) or Germany (2.5 percent; see Figure 3 5 1981 1983 1985 1987 1989 1991 1993 1995 1997 1999 2001 2003 Year R&D Expenditures as Percent of GDP US Japan Germany France UK Italy Canada In 2005, reported academic spending on mechanical engineering R&D totaled more than $900 million (Figure 3-16). Of this, about two-thirds consisted of federal sources.  In terms of constant 2000 dollars, the reported U.S. federal government funding (obligations) 23 for total research in mechanical engineering declined from a high of almost $550 million in 1993 to just over $250 million in 2003 (Figure 3-17), which is similar to levels in the early 1980s. There could be multiple reasons for this decline. One that has been documented in the past has to do with changes in NSF classification of funding by field of research, which changed in 1996. 24 Federal obligations for mechanical engineering over the period 1999-2003 were on average about 1 percent of the total U.S. R&D budget. 1 9 8 4 1 9 8 5 1 9 8 6 1 9 8 7 1 9 8 8 1 9 8 9 1 9 9 0 1 9 9 1 1 9 9 2 1 9 9 3 1 9 9 4 1 9 9 5 1 9 9 6 1 9 9 7 1 9 9 8 1 9 9 9 2 0 0 0 2 0 0 1 2 0 0 2 2 0 0 3 Year Federal research funding for mechanical engineering, millions constant 2000 $US FIGURE 3-17 Federal obligations for total research in mechanical engineering. SOURCE: NSF, S&E Indicators 2006, Appendix Table 4-32 Federal funding for mechanical engineering research is comparable with spending for the other \"big four\" engineering fields of civil and chemical engineering, with the exception of electrical engineering, which has traditionally been better funded than chemical, civil, and mechanical engineering (Figure 3-18).  200.0 1984 1986 1988 1990 1992 1994 1996 1998 2000 2002 "}, {"section_title": "Year", "text": ""}, {"section_title": "Millions of constant 2000 $US", "text": ""}, {"section_title": "Chemical", "text": "Civil Electrical Mechanical  Table 4-32 DOD has accounted for the largest proportion of federal obligations for mechanical engineering research over the years (Figure 3-19). However, in the past, other agencies accounted for a larger proportion, especially for basic research (Figure 3-20). In 1994 DOD accounted for 70 percent of the federal obligations for mechanical engineering research, whereas in 2004, DOD accounted for 84 percent. 500 1984 1986 1988 1990 1992 1994 1996 1998 2000 2002 2004 Fiscal Year "}, {"section_title": "FIGURE 3-19", "text": "Federal obligations for total research in mechanical engineering, 1984-2004. SOURCE: NSF, Federal Funds for R&D, http://www.nsf.gov/statistics/fedfunds/ (accessed July 12, 2007). 198819901992199419961998200020022004 Years 1986-2004. SOURCE: NSF, Federal Funds for R&D, http://webcaspar.nsf.gov (accessed September 19, 2007. DOD obligations for basic research in mechanical engineering largely come from the Air Force, Army, and Navy (Table 3-3). Specific information on the breakdown of DOD funding for specific areas of mechanical engineering is not readily available, but the type of mechanical engineering research funded is described on the various DOD organization websites. According to the Army Research Office website, 25 \"it supports fundamental investigations in the areas of solid mechanics, structures and dynamics, combustion and propulsion, and fluid dynamics.\" The Air Force Office of Scientific Research website 26 indicates it supports \"A wide range of fundamental research addressing structures, structural materials, solid mechanics, fluid dynamics, propulsion, and chemistry.\"  Research andDevelopment, 1994 and2004. Other federal agencies also vary in the specific information they provide on the breakdown of funding for specific areas of mechanical engineering. Below is a comparison of Department of Energy Basic Energy Sciences funding for core research areas in materials (Figure 3-22) for fiscal year 2001 and fiscal year 2005, which includes the core research area of mechanical behavior and radiation effects. According to DOE, \"This activity supports basic research to understand the deformation, embrittlement, fracture, and radiation damage of materials with an emphasis on the relationships between mechanical behavior and radiation effects and defects in the material. This research builds on atomic level understanding of the relationship between mechanical behavior and defects in order to develop predictive models of materials behavior for the design of materials having superior mechanical behavior such as at very high temperatures.\"     (accessed July 12, 2007). Table 3-4 shows the overall research proposal funding rate for CMMI. While, the number of awards has remained fairly stable and the median annual size of awards has increased between 1997 and 2006, the funding rate for awards has decreased by 11 percent, from 28 percent in 1997 to 17 percent in 2006. 27 The funding rate for awards in CBET decreased by 13 percent, from 30 percent in 1997 to 17 percent in 2006. In comparison, the funding rate for the NSF engineering directorate and NSF as a whole declined by only 8 percent during this same time period. Comparable data on proposal funding rates for other funding agencies were not readily available.  • Research funding for S&E overall and mechanical engineering in particular has been steady. In 2005, more than $900 million was spent on mechanical engineering R&D at academic institutions. Of this, about two-thirds were federal expenditures. Federal support for U.S. mechanical engineering research between 1999 and 2003 was on average about one percent of the total U.S. R&D budget, with the largest portion (more than 70 percent) coming from DOD."}, {"section_title": "The Likely Future Position of U.S. Mechanical Engineering Basic Research", "text": "Earlier in the report the panel assesses the current position of U.S. research in mechanical engineering relative to that in other regions or countries (Chapter 2) and identifies the key factors influencing relative U.S. performance in mechanical engineering (Chapter 3). In this final chapter of the report, the panel addresses the third part of its charge-to determine the relative position of U.S. mechanical engineering in the near term and in the longer term. In short, U.S. mechanical engineering is currently in a healthy position and will likely continue to be in the near future. Mechanical engineering makes many significant contributions to U.S. economic competitiveness and national quality of life; broad public benefits are now derived from past investments in mechanical engineering-for example, in the transportation, power generation, and aviation industries. If no major change occurs in U.S. science policy or levels of financial support, mechanical engineering research in the United States will remain among the leaders for at least the next five years. However, there will continue to be increasing competition from Europe and Asia. Analysis of data in Chapters 2 and 3 reveals trends in U.S. mechanical engineering that the panel believes are likely to continue in the near-(two to three years) and mid-term (five to seven years) future. Over the past decade, graduate enrollment and the number of new U.S.-trained Ph.D.s has been virtually constant, and federal research support for mechanical engineering research has barely kept up with inflation. In contrast, the number of Ph.D.s trained outside the United States continues to increase. The number of papers published by non-U.S. authors in both international and ASME journals is increasing. Based on flat U.S. mechanical engineering research budgets and flat numbers of students, the panel projects that other nations and regions will soon be catching up or passing the United States. Projected trends in mechanical engineering publications, human resources, research funding, and infrastructure are presented below."}, {"section_title": "MECHANICAL ENGINEERING RESEARCH PUBLICATIONS", "text": "The number of mechanical engineering articles by U.S. authors will continue to increase over the next several years, but the share of mechanical engineering articles from U.S. authors will continue to decrease due to likely increases in the number of articles from other countries. The quality of international mechanical engineering research is also increasing, and the panel projects that this will be reflected in increased citations per paper for non-U.S. authors and in a decrease in the U.S. lead in citations per paper. Similarly, the fraction of most-cited articles coming from non-U.S. authors is expected to increase."}, {"section_title": "SUPPLY OF U.S. MECHANICAL ENGINEERS", "text": "The number of mechanical engineering Ph.D.s trained in the United States was more than 800 per year for 1995-2005. In 1980, there was about half this number of Ph.D.s. However, over this time, the number of U.S. citizens receiving mechanical engineering Ph.D.s has steadily decreased. The number of U.S. mechanical engineering graduate students has been maintained by successfully attracting international students to the United States. Many of these students often stay in the United States after graduation and pursue careers in mechanical engineering. Evidence of the attractiveness of the United States is the high percentage of foreign doctorate recipients who plan to remain in the United States for work after graduation (Table 4-1). However, with changes in visa policies as a result of the attack on 9/11 ( Figure 4-1) and global leveling of research capability, the United States may be losing ground. Following 9/11, international students and postdoctoral associates found it increasingly difficult to obtain visas for study in the United States and many traveled to Europe, Japan, and Australia for their graduate work. This has had a fairly significant impact on engineering disciplines compared to the sciences, which also holds for mechanical engineering as shown in Figure 3-5 (ratio of Ph.D.s to temporary residents decreased three years in a row for [2003][2004][2005]. Also, because of the growth of new opportunities for Ph.D. mechanical engineers in China, India, and elsewhere, more students who obtain a U.S. Ph.D. are increasingly likely to return to careers in their native countries or to other opportunities elsewhere. Thus, the United States is faced with increasing competition overall for attracting foreign graduate students and for retaining them in the U.S. workforce. It is not clear whether the United States can continue to attract mechanical engineering talent from the United States and abroad in the future. According to a background paper generated for the recently held NSF \"5XME\" workshop, 1 Many countries now emulate the very successful USA engineering schools and their science-based curricula, and are making investments that produce an order of magnitude more engineers, and of comparable quality. Global companies employ such world-class engineering talent, often at 20% of the cost in the USA and are moving manufacturing design and even research activities to such locations. The authors state that \"the challenge for engineering schools in the U.S. is how to educate a mechanical engineer that provides five times the value added when compared to the global competition, i.e., the '5XME.'\" "}, {"section_title": "U.S. MECHANICAL ENGINEERING RESEARCH FUNDING", "text": "University reported mechanical engineering research expenditures has continued to grow over the years, and reached more than $900 million in 2005. Federal sources have made up an increasingly larger percentage of these expenditures, which will likely continue.  On the other hand, federal government reported obligations 3 for mechanical engineering research over the past 10 years (in constant 2000 dollars) have been flat, and funding for basic research has declined (Figure 4-3). In addition, funding has been dominated by a single agency, DOD. If this funding trend continues, U.S. mechanical engineering basic research will likely drop from a leadership position among the leaders to lagging behind the leaders.  Dollars, fiscal year 1986-2004. SOURCE: NSF, Federal Funds for R&D, http://webcaspar.nsf.gov (accessed September 19, 2007."}, {"section_title": "INFRASTRUCTURE TO SUPPORT BASIC RESEARCH", "text": "The quality of the basic research infrastructure strongly influences the long-term health of mechanical engineering research. The position of the U.S. research enterprise will be strongly influenced by the improvement or decline of this infrastructure, which includes organizational structure and intellectual property policies in addition to facilities and instrumentation. The university structure in which the mechanical engineering organization resides strongly influences the future of the discipline. The high quality of U.S. academic leadership in mechanical engineering and the excellence of the scientific research enterprise have placed mechanical engineering departments in a position of strength at most of the top research universities in the United States. The prominence of mechanical engineering in industry and government agencies is also well established. Mechanical engineers require instruments for daily use and access to major frequently used instruments in their local departments. Mechanical engineering research sometimes requires major instruments or facilities that can only be economically provided by national facilities. Major centers and facilities provide key infrastructure and capabilities for conducting research and have provided strong support for U.S. leadership in mechanical engineering. Key capabilities for mechanical engineering research include advanced light sources, scanning probe instruments, supercomputers, nuclear reactors and accelerators, and specialized facilities for biomechanics. U.S. facilities have instrumentation that is on par with the best in the world. However, rapid advances in the design and capabilities of instrumentation can create obsolescence in five to eight years. Large central facilities must continuously be upgraded and maintained. Sustained support is essential to compete with heavy capital investments by the European Union, Japan, Korea, and China. Federal laboratories and the national laboratories of DOE are critical in providing unique facilities for research; they have instrumentation no single university could afford to put in place. An important complement is the availability of world-class scientists who engage in long-term fundamental research and provide assistance through research collaborations with the user community. Although the United States has enjoyed a research and funding environment that has enabled the installation and operation of a diverse range of facilities to support leading-edge research in mechanical engineering, funding for needed infrastructure seems to be in continuous jeopardy. For example, U.S. research infrastructure includes major user facilities such as the National Solar Thermal Test Facility, the AZTRAK (AZimuthal TRAcKing) Rotating Platform system and the Combustion Research Facility (centering on improving energy efficiency and reducing emissions from energy conversion and utilization systems) at Sandia Labs, and NIST's Building Integrated Photovoltaic Testbed and Mobile Solar Tracking Facility. All of these are based on technology needs from the 1980s, and major facilities in Europe and Japan are overshadowing U.S. capability to demonstrate and gain experience in large-scale systems. A few examples include the Japanese High Temperature Gas Reactor, the European Solar Thermal Industry Federation (ESTIF) in Brussels, and the European Solar Test Installation (ESTI) in Ispra, Italy."}]