[{"section_title": "INTRODUCTION", "text": "In 2017, an estimated 15,270 children and adolescents in the United States aged birth to 19 years were diagnosed with cancer, and an estimated 1790 died of the disease. 1 Leukemia is the most commonly diagnosed cancer among children aged birth to 14 years, accounting for 29% of all cases, followed by nervous system cancers (26%), and lymphomas and reticuloendothelial neoplasms (12%). 2 Among adolescents aged 15 to 19 years, the most common cancers are those of the nervous system (21%), lymphomas and reticuloendothelial neoplasms (21%), and leukemia (13%). 2 Five-year survival rates vary greatly by cancer type, ranging from 65.1% to 99.4% for children and 45.9% to 99.5% for adolescents. 2 Sociodemographic and economic factors found to be associated with cancer survival among children include race, 3 parental educational level, 4 and hospital resources. 5 Rural residence may affect cancer outcomes because rural areas tend to have fewer available health care resources compared with urban areas. 6 The Centers for Disease Control and Prevention found that cancer death rates averaged between 2011 and 2015 for nonmetropolitan (nonmetro) rural counties (180.4 per 100,000 population) were significantly greater than those for metropolitan (metro) counties with ≥1 million individuals (157.8 per 100,000 population). 7 These disparities could stem from a later stage of cancer at the time of diagnosis, lower health care access, or differences in incidence due to exposures (eg, smoking) among rural populations. 7 However, when stratified by age group, cancer death rates among those aged <20 years living in metro counties of ≥1 million individuals (2.4 per 100,000 population) were significantly greater than those living in nonmetro rural counties (2.2 per 100,000 population). 7 Although it has been the subject of many international studies, [8][9][10][11][12][13] to the best of our knowledge, US data regarding the potential impact of rural residence on childhood and adolescent cancer outcomes are sparse. One US study reported Cancer January 15, 2019 no evidence for the impact of distance to treatment on stage of disease at the time of diagnosis for children 14 and another US study reported no association between population density and diagnosis delays in adolescents and young adults. 15 With respect to cancer survival among US-based studies of adults, Singh reported a significantly lower 5-year survival rate for rural (64.8%) compared with urban (69.6%) patients with cervical cancer. 16 However, Eggleston et al reported no evidence of inferior survival among rural patients with cervical cancer who were residing in Texas. 17 No association was reported for rural patients with gastroesophageal cancer, 18 nor for rural adults with acute myeloid leukemia who were living in North Carolina. 19 To our knowledge, 3 studies to date have examined this question for patients with lung cancer, with one reporting inferior survival for patients residing in rural areas 20 and 2 studies finding no association. 21,22 To our knowledge, no previous US study has examined whether rural/urban residence impacts survival in childhood or adolescent cancer. Children and adolescents represent a particularly vulnerable patient population with unique medical and health policy considerations. Using data from the US Surveillance, Epidemiology, and End Results (SEER) 18 registries, a large population-based database, we examined the association between rural/urban residence at the time of diagnosis and childhood and adolescent cancer survival in the United States."}, {"section_title": "MATERIALS AND METHODS", "text": ""}, {"section_title": "Study Population", "text": "We obtained data on individuals diagnosed with cancer between the ages of birth to 19 years from the SEER 18 registries database (1973-2015). 23 We restricted the study population to individuals diagnosed with a first primary malignancy from 2000 through 2010, which allowed for at least 5 years of follow-up for each case."}, {"section_title": "Variables", "text": "Rural/urban residence was classified according to 2003 and 2013 Rural-Urban Continuum Codes (RUCCs) as developed by the United States Department of Agriculture. 24 RUCCs categorize metro counties by population size and nonmetro counties by urbanization and adjacency to a metro area. 25 RUCCs for each individual were calculated from residential address at the time of diagnosis. 26 We defined rural/urban residence using 2 variables for our analyses. First, we used the 9 individual RUCC categories: 1) metro counties of ≥1 million individuals, 2) metro counties of 250,000 to 1 million individuals, and 3) metro counties of <250,000 individuals; 4) nonmetro urban counties of ≥20,000 individuals adjacent to a metro area, 5) nonmetro urban counties of ≥20,000 individuals not adjacent to a metro area, 6) nonmetro urban counties of 2500 to 19,999 individuals adjacent to a metro area, and 7) nonmetro urban counties of 2500 to 19,999 individuals not adjacent to a metro area; and 8) nonmetro rural counties of <2500 individuals adjacent to a metro area, and 9) nonmetro rural counties of <2500 individuals not adjacent to a metro area. Second, we created a binary variable that collapsed RUCC categories into metro counties (the first 3 categories above) and nonmetro counties (the remaining categories). Cancer subtypes were based on the International Classification of Childhood Cancer (ICCC) definition and stratified into 13 broad categories according to the ICCC. 27 We classified race and ethnicity as non-Hispanic white, non-Hispanic black, non-Hispanic American Indian/Alaska Native, non-Hispanic Asian or Pacific Islander, and Hispanic (all races). Individual-level measures for income or educational status were not available in the SEER database. As proxies for socioeconomic status, we used median family income and percentage with less than a high school education in the county of residence, both categorized into 5 quintiles. Insurance status was classified as uninsured, any Medicaid, or other insurance at the time of diagnosis. Survival months were calculated from the date of a first primary malignant cancer diagnosis to the date of cancer death or last follow-up, whichever came first. A list of all SEER variables used in the current analysis can be found in Supporting Table 1."}, {"section_title": "Data Analysis", "text": "To evaluate whether childhood and adolescent cancer death rates varied by rural/urban residence at the time of diagnosis, we used Cox proportional hazards regression to compute hazard ratios (HRs) and 95% confidence intervals (95% CIs) with survival months as the timescale. Observations with missing values and zero survival time were excluded from the analysis (<5%). A Kaplan-Meier curve was used to illustrate survival probabilities over time by metro/nonmetro residence. 28 Potential covariates were identified with a directed acyclic graph 29 of known and suspected confounders for the relationship between rural/urban residence at the time of diagnosis and childhood and adolescent cancer survival. Age, race, sex, cancer type, insurance status, educational level, and income were considered. Paths between the exposure and outcome were identified using the back-door criterion. 30  Child race and parent income provided a minimal set of covariates necessary for mitigating confounding bias (see Supporting Fig. 1). Because there is evidence that insurance coverage differs by rural/urban residence and is associated with cancer outcomes, 31 we conducted subanalyses including insurance status for individuals diagnosed in the years 2007 through 2010 (SEER 18 registries provide insurance status only from 2007 onward). We performed multiplicative interaction tests to assess whether HRs for associations between metro/ nonmetro residence and childhood and adolescent cancer death differed by age group (ages birth-4 years, Cancer January 15, 2019 5-9 years, 10-14 years, and 15-19 years), sex, race/ethnicity, and cancer type by including an interaction term between metro/nonmetro residence and these variables in the regression model. 28 Cox proportional hazards regression models satisfied the proportionality assumption, which was tested with the \"assess PH/resample\" statement in an SAS PHREG procedure (SAS Institute Inc, Cary, North Carolina). 32 Statistical tests were 2-sided, and P values were considered statistically significant at the α =.05 level. Independent analyses were conducted by 2 analysts to ensure reproducibility of the results using SAS University Edition software (SAS Institute Inc) and R software (R Foundation, Vienna, Austria). Code for analyses can be found at the following Web site: https://github.com/kijohnson/ childhood-and-adolescent-cancer-rural-urban-paper."}, {"section_title": "RESULTS", "text": "Of the 43,499 cases of childhood and adolescent cancer identified, 1620 (3.7%) were excluded because of missing data or zero survival time. Of the 41,879 cases included, the majority were non-Hispanic white (54.7%), male (54.3%), and living in a metro county at the time of diagnosis (90.4%) based on the 2003 RUCC classification. The most common cancer types were leukemias (26.6%), central nervous system cancers (17.4%), and lymphomas (14.5%) ( Table 1). The median age at the time of diagnosis was 10 years, with a median follow-up of 114 months for those patients alive or dead of noncancer causes, and 18 months for those with a cancer-related death. A Kaplan-Meier curve illustrating survival probabilities demonstrated no discernible difference between those individuals residing in a metro county versus a nonmetro county at the time of diagnosis according to 2003 RUCCs (Fig. 1). In Cox proportional hazards regression models, we found no significant associations between rural/urban residence at the time of diagnosis classified by either 2003 metro/nonmetro or individual RUCC categories and cancer death in this cohort. Children and adolescents living in nonmetro counties were found to have a similar risk of cancer death compared with those living in metro counties (HR, 1.03; 95% CI, 0.94-1.13). The HRs for the analysis based on individual RUCC categories were all near 1.0. Children and adolescents living in nonmetro rural counties with <2500 individuals adjacent to a metro area (HR, 0.99; 95% CI, 0.70-1.40) and nonadjacent to a metro area (HR, 0.98; 95% CI, 0.71-1.37) had a similar risk of cancer death compared with those living in metro counties with ≥1 million individuals ( Table 2). We found no statistically significant evidence of effect modification of the HRs between metro/nonmetro residence according to 2003 RUCCs and cancer death by age group, sex, or cancer type (Table 3). We did observe a significantly increased risk of cancer death in association with nonmetro residence among non-Hispanic American Indian/Alaska Native individuals (HR, 2.24; 95% CI, 1.10-4.56), but not other race/ethnicity categories. In an analysis including a subset of cases diagnosed in the years 2007 through 2010 with insurance status as a covariate, we observed no patterns indicative of differing survival rates by rural/urban residence classified by either 2003 metro/nonmetro or individual RUCC categories (see Supporting Table 2). Finally, to account for potential misclassification of rural/urban residence using 2003 RUCCs, we conducted an analysis with 2013 RUCCs. No material difference in the results was observed based on the 2013 RUCCs (see Supporting Table 3)."}, {"section_title": "DISCUSSION", "text": "To our knowledge, the current study is the first to examine whether rural/urban residence is associated with childhood or adolescent cancer survival in the United States. We found no evidence of a variation in childhood and adolescent cancer survival by rural/urban residence at the time of diagnosis as defined by RUCCs. In addition, evidence for effect modification by age group, sex, race/ethnicity, and cancer type was absent, with the exception of a pronounced effect for non-Hispanic American Indian/Alaska Native individuals. American Indian/Alaska Natives generally have lower cancer survival compared with other racial or ethnic groups in the United States, 33 with mortality rates that vary by region. 34 Greater than 35% of American Indian/Alaska Native individuals live in rural areas compared with 19% of the overall US population. 35 Rural American Indian/ Alaska Native children may experience worse survival due to low socioeconomic status and barriers to health care access related to living on a reservation, 36 as well as factors that affect their adult counterparts such as a later stage of disease at the time of diagnosis 37 and poor adherence to guideline-concordant cancer care. 38 However, considering the small sample size of American Indian/ Alaska Natives in the current study (281 individuals), this finding should be considered exploratory. The findings of the current study are contrary to the rural-urban disparities in survival reported among adults with cervical 16 and lung 20 cancer in the United States, children with medulloblastoma in Greece, 10 and children with leukemia and lymphoma 9 and central nervous system tumors 11 in Southern and Eastern Europe. One possible explanation is that US children and adolescents have better health care access, with smaller insurance disparities between socioeconomic groups, than do US adults. 39 Children and adolescents generally have greater eligibility for public health insurance, including plans under the Children's Health Insurance Program (CHIP), which may explain why children have a much lower uninsured rate (5%) compared with adults (12%). 39 CHIP has been shown to decrease disparities in access to care for children living in rural areas, 40 which may improve cancer survival. It has been argued that loss of funding for CHIP will increase health disparities by socioeconomic status among children 39 because health insurance is believed to be associated with educational and economic success in the long term. 41 Furthermore, in contrast to some other medical specialties, an extensive network of pediatric cancer specialists exists throughout the United States through the Children's Oncology Group, a program of the National Cancer Institute. The Children's Oncology Group is affiliated with >200 children's hospitals in 47 states and the District of Columbia. 42 It has been estimated that >90% of children and adolescents diagnosed with cancer in the United States are treated through a Children's Oncology Group-affiliated cancer center, which helps reach children living in areas with fewer medical resources. 42 This unique program may explain why children and adolescents in rural areas have cancer survival rates that are similar to those of children and adolescents residing in urban areas. The results of the current study must be interpreted within the context of a few limitations. First, RUCCs are one of several ways with which to assess rural residence. Rural-Urban Commuting Area (RUCA) codes are a related measure that use census tracts, which generally are smaller and more precisely defined than counties. 43 RUCA codes take population density and daily commuting rates into account, which may provide a more accurate depiction of spatial barriers to health care resources than RUCCs, which rely on population size and proximity to metro areas. 43 However, RUCA codes are not available in the SEER database. In addition, any measure of rural residence is subject to misclassification from demographic changes that result from urbanization. Although results from the analysis using the 2003 RUCCs were similar to those using the 2013 RUCCs, frequent changes in rural/ urban designations may not have been perfectly captured in the 10 years that separate these 2 measures. Another source of RUCC misclassification may result from possible changes in residence after the time of diagnosis. This may occur if a family moves closer to their child's source of health care (which would bias results toward the null) or for other reasons. There is evidence that some families of patients with childhood cancer move after diagnosis, 44 but to the best of our knowledge the extent to which it may bias survival in studies concerning place of residence requires further investigation. However, even if individuals from medically underserved areas move temporarily or permanently after diagnosis, the current study results suggest that any adverse impact of rural residence at the time of diagnosis on pediatric and adolescent cancer survival does not operate through diagnosis or treatment start delays. Lastly, our variable for income was obtained at the county level and not the individual level. This may result in incomplete adjustment for income. The results of the current study demonstrated no association between rural/urban residence at the time of diagnosis as defined by RUCCs and cancer survival among children and adolescents. Possible explanations include the high rates of health insurance among children and adolescents and a strong pediatric oncology network throughout the United States."}, {"section_title": "FUNDING SUPPORT", "text": "No specific funding was disclosed."}, {"section_title": "CONFLICT OF INTEREST DISCLOSURES", "text": "The authors made no disclosures. Abbreviations: 95% CI, 95% confidence interval; CNS, central nervous system; HR, hazard ratio; metro, metropolitan; NH, nonHispanic; RUCC, RuralUrban Continuum Code. a Models were adjusted for race/ethnicity and median family income of county of residence."}]