[{"section_title": "Introduction", "text": "This report describes the enrollment, persistence, and degree attainment of students who began postsecondary education for the first time in the 1995-96 academic year. It covers the experiences of these first-time beginners over a period of 6 academic years, from 1995-96 to 2000-01, and provides information about the rates at which students attained degrees, transferred to other institutions, and left postsecondary education without attaining degrees. The report is based on the 1996/01 Beginning Postsecondary Students Longitudinal Study (BPS:96/01), a National Center for Education Statistics (NCES) survey that provides data describing a nationally representative sample of first-time students who entered postsecondary education during the 1995-96 academic year. The students were initially interviewed in 1996, at the end of their first year in postsecondary education; interviewed again in 1998,3 years after they had started; and interviewed for the last time in 2001, 6 years after they had started."}, {"section_title": "Types of Institutions Attended", "text": "When they first entered postsecondary education in 1995-96, the largest proportion of beginning students (46 percent) enrolled at public 2-year institutions (community colleges). About one-fourth (26 percent) started at public 4-year institutions, 15 percent at private not-for-profit 4year institutions, 10 percent at private for-profit institutions offering vocational programs of less than 4 years, and 3 percent at all other types of institutions. However, over the 6 years covered in this report, 40 percent of students who began in 1995-96 were also enrolled in at least one postsecondary institution other than the institution at which they started. About one-third (32 percent) of the beginners transferred from their first institution to a different one, and 11 percent were sometimes coenrolled, taking courses at more than one institution at the same time. About one-fourth of the students who began at 4-year institutions and 42 percent of those who began at public 2year institutions transferred during the 6 years.\nWhen they first entered postsecondary education in 1995-96, the largest proportion of beginning students (46 percent) enrolled at public 2-year institutions (also called community colleges), and about one-fourth (26 percent) started at public 4-year institutions, 15 percent at private not-for-profit 4-year institutions and 10 percent at private for-profit institutions offering vocational programs of two years or less (figure 1). However, over the six years covered in this report, 40 percent of all the beginning students were also enrolled in at least one other   (table 1). About one-third (32 percent) of the beginners transferred6 from their first institution to a different one, and 11 percent were sometimes coenrolled, taking courses at more than one institution at the same time. About one-fourth of the students who began at a public or private not-for-profit 4-year institution transferred to a different institution (27 and 24 percent, respectively), most frequently by the end of their first year.? Beginners at public 2-year institutions were even more likely to transfer (42 percent) than those beginning at 4-year institutions. No difference could be detected in the percentage of students beginning at public 4-year institutions who transferred to either another public 4-year institution or a public 2-year institution (table 2). Similarly, no difference could be detected in the percentage of students beginning at private not-for-profit 4-year institutions who transferred to either a public 4-year institution or a public 2-year institution. Those who began at public 2-year institutions, however, were more likely to transfer to public 4-year institutions than anywhere else (20 percent), although 11 percent transferred from one public 2-year institution to another. Overall, students were most likely to transfer to a public 4-year institution (14 percent) or to transfer to a public 2year institution (10 percent). 61n this study, a transfer is defined as occurring when a student is no longer enrolled in one institution (the origin) and subsequently enrolls in a different institution for at least four months (the destination). This definition is intended to exclude short summer school or occupational courses at a different institution. This transfer definition is not based on whether course credits were accepted at the destination institution because this is not always known. 7See compendium table 6.1-A. Among those who transferred from 4-year institutions, 49 percent left the first institution after the first year, and another 31 percent left after the second year. The ways in which the beginners were redistributed among the types of institutions as a result of their transfers over the six years are also shown in figure 1, which compares the distribution of the beginners at the first type of institution attended and at the last type of institution attended as undergraduates.8 For the 68 percent of students who never transferred, the last institution is the same as the first. The last type of institution where students were enrolled may represent any of the following: where they had completed a degree;9 the institution from which they left postsecondary education without a degree; or where they were still enrolled in 2001. When comparing the distribution of students at the first type of institution attended with that at the last type attended as undergraduates, the proportion of students at the last type decreased for public 2-year institutions and increased for public 4-year institutions. When they were last enrolled, about one-third of the students were in public 4-year institutions, and about one-third of the students were in public 2-year institutions."}, {"section_title": "Degree Completion Among Students Beginning at Public 2-Year Institutions", "text": "Public 2-year institutions serve a diverse body of students who enroll with a variety of educational goals. Associate's degree completion rates are only partially valid as a measure of student success at public 2-year institutions, because it is not necessary to complete an associate's degree before transferring to a 4-year institution. During their first year, about one-half of the beginning students at public 2-year colleges said that they intended to attain an associate's degree, and another one-fourth intended to transfer to a 4-year institution and complete a bachelor's degree. In the following years, about one-fourth of the beginners at public 2-year institutions did transfer to a 4-year institution. Of the three-fourths of beginners at public 2year institutions who intended to complete either an associate's or a bachelor's degree, 31 percent did so within 6 years: 23 percent completed an associate's degree, and 13 percent completed a bachelor's degree (these percentages include the 5 percent who completed both). Among those students who actually did transfer to a 4-year institution, 36 percent attained a bachelor's degree within 6 years of starting community college."}, {"section_title": "Types of Bachelor's Degree Completion Rates for Students Beginning at 4-Year Institutions", "text": "Rates of completion at the first institution attended versus at any 4-year institution When 4-year colleges and universities report their graduation rates, they are reporting the percentage of first-time freshmen who completed a bachelor's degree at that institution within a certain time period. Institutions usually do not know what happened to the students who left without a degree. When students leave an institution, they may either leave postsecondary education permanently or transfer somewhere else. From the institutional perspective, all students who leave before completing a degree at that institution are considered to be dropouts. From the perspectives of students as well as of the postsecondary education system as a whole, transfers are not dropouts: they are persisting students who have decided to attend a different institution. In this report, the term institutional completion rate is used to describe bachelor's degree attainment of students at the first institution they attended, and the term student completion rate is used to describe bachelor's degree attainment anywhere, regardless of whether or not students stayed at the original institution. Among all beginners at 4-year institutions in 1995-96, 51 percent completed a bachelor's degree within 6 years at the first institution attended (table A). However, when those who transferred out of the first institution are also included, the percentage of beginners who actually completed a bachelor's degree within 6 years (at any 4-year institution) increases to 58 percent."}, {"section_title": "Rates based on different subcategories of students", "text": "Bachelor's degree completion rates not only differ by whether they reflect the institutional or student perspective, but also by which subcategories of beginning students are included when calculating the rates (table A). For example, if the calculation includes only those beginners with a bachelor's degree goal (90 percent of all beginners at 4-year institutions), then the rate of completion at the first 4-year institution attended was 55 percent. Including only first-time beginners who were enrolled full time when they started and also had a bachelor's degree goal (83 percent of all beginners), the bachelor's degree completion rate at the first 4-year institution was 58 percent. Sometimes interest centers on recent high school graduates (those who started college immediately after high school, who made up 83 percent of the beginners at 4-year institutions). Among all the beginners at 4-year institutions who were recent high school graduates, the rate of bachelor's degree completion at the first institution was 55 percent, while it was 64 Table A.Percentage of students beginning at 4-year institutions in 1995-96 who had completed a bachelor's degree at the first institution attended or at any 4-year institution by June 2001, by subcategories of beginning students percent at any 4-year institution. But including only those first-time beginners who were recent high school graduates, had a bachelor's degree goal, and also started as full-time students (73 percent of all beginners at 4-year institutions), the 6-year completion rate at the first institution attended was 61 percent, and it was 69 percent at any 4-year institution."}, {"section_title": "Focus on Students With a Bachelor's Degree Goal at 4-Year Institutions", "text": "This section describes only the beginners at 4year institutions who had a bachelor's degree goal (90 percent of the total), including those who started as part-time students and those who did not start college immediately after finishing high school. Degree completion and transfer from the first institution attended Among students beginning at 4-year institutions with a bachelor's degree goal, the cumulative percentage who had left their first institution and transferred to a different one was 10 percent by the end of the first year, 18 percent by the end of the second year (including the 10 percent who had already left by the end of the first year), 22 percent by the end of the third year, and then about 23 percent through the end of the sixth year (since there were few additional transfers in the fifth and sixth years) (figure A). The cumulative percentage of beginning students who were not enrolled at the first institution at the end of the academic year and never enrolled anywhere else by June 2001 was 3 percent at the end of the first year, 6 percent at the end of the second year (including the 3 percent who were not enrolled at the end of the first year), 9 percent at the end of the third year, and so on. By June 2001, at the end of the sixth academic year, 13 percent had left postsecondary education directly from the first institution without a degree, a smaller percentage than the 23 percent who had transferred elsewhere. V Figure A.Percentage distribution of students with a bachelor's degree goal who were first-time beginners at a 4-year institution in 1995-96, by their enrollment status or degree attainment at the first institution attended, at the end of each academic year through 2000-01 Some students who transferred from their first institution later left postsecondary education without a degree, while others were still enrolled in June 2001 or had already attained a degree at another institution. In figure B, the numbers in the arrows indicate the percentages of students who transferred and then had various outcomes at any postsecondary institution. For example, 6 percent of students who began at a 4-year institution with a bachelor's degree goal transferred from their first institution and then left postsecondary education without a degree after attending the transfer institution. Seven percent, however, transferred and then completed a bachelor's degree at a different 4-year institution."}, {"section_title": "Percent", "text": ""}, {"section_title": "Number of years to complete a degree at different types of institutions", "text": "Thirty-four percent of beginners with a bachelor's degree goal completed that degree at their first institution within 4 years, and another 21 percent finished in 5 to 6 years, for a total of 55 percent completing a bachelor's degree at the first institution within 6 years of starting there (table  B). Those who began at a private not-for-profit institution were more likely to complete their bachelor's degree at that institution than those who began at a public institution (65 percent vs. 50 percent) and were more likely to have finished in 4 years (52 percent vs. 24 percent). vi  "}, {"section_title": "Differences in completion rates by enrollment patterns and student characteristics", "text": "Among beginners with a bachelor's degree goal, student rates of completion at any 4-year institution varied by enrollment patterns (table B). Students who did not transfer, were always enrolled full time, or were continuously enrolled without a break had higher 6-year completion rates (72-74 percent) than other students, and about 45 percent graduated within 4 years. Students who entered college with good academic preparationthose who received mostly A's in high school, took two or more Advanced Placement (AP) tests, or had high SAT scores also had higher completion rates than others. About 80 percent completed a bachelor's degree within 6 years, and more than one-half (55-61 percent) graduated within 4 years. Among beginners with a bachelor's degree goal, women had higher completion rates than men and were more likely to finish in 4 years vii Table B.-Percentage of students beginning at 4-year institutions in 1995-96 with a bachelor's degree goal who completed a bachelor's degree at the first institution attended or at any 4-year institution by June 2001, and the number of years to complete the degree, by type of first institution, enrollment patterns, academic preparation, and student characteristics Bachelor's degree completion rate At first 4-year institution At any 4-year institution 4 years or less NOTE: These completion rates are based on the number of months between the date of first enrollment and bachelor's degree completion. The 4-year rate includes those who completed in 48 months or less after they first enrolled. These rates may differ slightly from bachelor's degree attainment percentages based on status at the end of an academic year, such as those in figure A. Detail may not sum to totals because of  (table B). Hispanic and Black, non-Hispanic students had lower completion rates than Asian/Pacific Islander and White, non-Hispanic students. Low-income dependent students had lower completion rates than high-income dependent students."}, {"section_title": "Profile of 1995-96 Beginners Who Completed a Bachelor's Degree by June 2001", "text": "A number of factors have been shown to put students at risk of not completing their degree programs. Two of the most important ones are part-time enrollment and delaying entry into postsecondary education after high school. Other factors are not having a regular high school diploma, having children, being a single parent, being financially independent of parents, and working full time while enrolled. In prior studies, a persistence risk index was developed based on the number of these adverse characteristics (Horn 1996). All of these risk factors are also associated with \"nontraditional\" students, and the more risk factors a student has, the more nontraditional the student may be considered to be. Conversely, students with none of the risk factors may be considered to be highly traditional students: they enroll immediately after receiving a high school diploma, attend full time in the first year, are financially dependent on their parents, and work part time or not at all while enrolled. Beginners who started at 4-year institutions in 1995-96 were predominantly traditional students: most of them had entered college without delay after high school, and most had none of the characteristics associated with a high risk of not completing a degree. This pattern is reflected in the profile of those college graduates who started at a 4-year institution in 1995-96 and had completed a bachelor's degree by June 2001: 91 percent had entered college immediately after high school, and 86 percent had no persistence risk factors when they first enrolled in 1995-96. Students who graduated with a bachelor's degree within 4 years were well prepared when they entered college. More than one-half had received mostly A's in high school (62 percent) or had SAT test scores in the highest quartile among college freshmen (56 percent), and 30 percent had taken two or more AP tests. Women represented a majority (62 percent) of the college graduates who started at a 4-year institution in 1995-96 and completed a bachelor's degree in the expected 4year period. Students who began at public 2-year institutions were more likely to be nontraditional students than those who began at 4-year institutions. Almost one-half of the beginners at public 2-year institutions had delayed starting college after high school, and about one-half had two or more persistence risk factors when they started. Traditional students (those with no risk factors when they began) represented about onehalf (56 percent) of the bachelor's degree recipients who had transferred from public 2-year institutions. The other half were nontraditional students who began their education in 1995-96 with a higher risk of not completing a degree at all, but had been able to enter a bachelor's degree program via a community college."}, {"section_title": "Summary and Conclusion", "text": "Differences in the bachelor's degree completion rates of students who began at community colleges and those who began at 4year colleges and universities reflect differences in the degree goals, academic preparation, enrollment patterns, and demographic characteristics of these students. Compared with students who started at 4-year institutions, those who started at public 2-year institutions were less well prepared for college and were less likely to be continuously enrolled. Beginners at public 2year institutions were also more likely to enroll part time, to have delayed enrolling after high school, and to be nontraditional students starting postsecondary education with one or more persistence risk factors. Beginners at 4-year institutions were predominantly traditional students with no persistence risk factors when they started college, and they were usually enrolled full time. Among those with a bachelor's degree goal, 55 percent of the beginners at 4-year institutions completed a bachelor's degree at the institution where they had started. When transfer students who completed their degrees at a different institution are also included, a total of 63 percent of the students who began at a 4-year institution with a bachelor's degree goal completed that degree within 6 years. Although the expected length of time required to complete a bachelor's degree is 4 years, 37 percent of the students with a bachelor's degree goal who started at a 4-year institution in 1995-96 actually finished their degree in that period of time. The characteristics of the students who were most likely to graduate within 4 years with a bachelor's degree fit a commonly held perception of what a college student looks likehe or she receives good academic preparation in high school, enters college immediately after high school, enrolls in college full time, and is continuously enrolled.\nThe differences in the completion rates of students at community colleges and 4-year colleges and universities reflect the differences in the degree goals, academic preparation, enrollment patterns, and demographic characteristics of the students who began there. Compared with students who started at 4-year institutions, those who began at public 2-year institutions were less well prepared for college, more likely to enroll part time, and less likely to be continuously enrolled. Beginners at public 2-year institutions were also more likely to have delayed enrolling after high school and to be nontraditional students starting postsecondary education with one or more persistence risk factors. About one-fourth of the community college students with an associate's degree goal completed an associate's degree, but they rarely did so in the expected two years (4 percent). Among those who transferred from a public 2-year to a 4-year college 36 percent completed a bachelor's degree, and it usually took them five or six years from the time they had first enrolled in 1995-96. Unlike the college graduates who had started at 4year institutions, about one-half of the students who completed a bachelor's degree after transferring from a community college began postsecondary education as nontraditional students. The beginners at 4-year institutions were predominantly traditional students with no persistence risk factors when they started college, and they were usually enrolled full time. Among those with a bachelor's degree goal, 55 percent of the beginners at 4-year institutions completed a bachelor's degree within six years at the same institution where they had started. When transfer students who completed their degrees at a different institution are also included, a total of 63 percent of the students who began at a 4-year institution completed a bachelor's degree within six years. The beginners at 4-year institutions who were always enrolled full time, who were enrolled continuously, or who never transferred from their college had bachelor's degree completion rates of more than 65 percent. Those who started college with high SAT scores, who had received mostly A's in high school, or who had taken two or more AP tests had bachelor's degree completion rates of about 80 percent. Although the expected length of time required to complete a bachelor's degree is four years, 37 percent of all students with a bachelor's degree goal who started at a 4-year college or university in 1995-96 actually finished a bachelor's degree in that period of time. The characteristics of these students who did graduate in four years fit the common popular perception of what a college student looks likehe or she receives good academic preparation in high school, enters college immediately after high school, enrolls in college full time, and is continuously enrolled. The percentage of beginners in certificate programs who were first enrolled in public 2-year or in private for-profit less-than-2-year institutions was 38-39 percent. Associate's degree programs may either lead to a terminal degree in applied fields or may prepare to transfer to a 4-year institution for a bachelor's degree. Most of the beginners in associate's degree programs (89 percent) were enrolled in public 2-year institutions. Some 4-year institutions also offer sub-baccalaureate degrees. Four percent of the beginners in certificate programs and 5 percent of those in associate's degree programs attended 4-year institutions. The largest group of beginners in bachelor's degree programs (40 percent) were enrolled in public 4-year doctorate-granting universities. The percentage beginning in bachelor's degree programs at non-doctorate-granting 4-year institutions was 22 percent in public and 24 percent in private not-for-profit institutions. This table displays the percentage distribution of beginning students within first institution level and type by their initial degree goals in the first year, the highest degree they ever expected to attain, the sub-baccalaureate program or field of study at less-than-4-year institutions (not classified for the small proportions of sub-baccalaureate programs at 4-year institutions), and certain indicators of academic preparation when they first enrolled. Among 1995-96 beginning students, 65 percent of those who started at private forprofit less-than-4-year institutions wanted to earn a certificate, compared with 11 percent of those who started at public 2-year institutions. Conversely, students who 37 1 started at public 2-year institutions were more likely to have an associate's degree or a bachelor's degree goal. The percentage of beginning students at 4-year and at public 2-year institutions who did not know the highest degree they ever expected to pursue was about 10 percent. Students who began at 4-year institutions were more likely than those who began at 2year institutions to expect to earn an advanced degree (68 vs. 33 percent). Among students who began at 4-year institutions in 1995-96, those at private not-forprofit institutions were more likely than their counterparts at public institutions to have taken more than one Advanced Placement test, to score in the highest quartile on the SAT, and to have earned mostly A's in high school. For example, 46 percent of students who began at private not-for-profit 4-year institutions scored in the highest quartile on the SAT, compared with 31 percent of students who began at public 4-year institutions. Aspects of the enrollment patterns of the students and their GPA at the end of the first year, shown as the percentage distribution within first institution level and type, are displayed in Table   1.1-B. Thirty percent of the beginning students were enrolled in two institutions between 1995-96 and June 2001, and 10 percent were enrolled in three or more. This includes the students who transferred from one institution to another and those who were coenrolled at more than one institution at the same time. No difference could be detected between the percentage of students who began at 4year institutions and those who began at public 2-year institutions with respect to whether or not they were ever co-enrolled, meaning taking courses at two institutions at the same time. One-fourth (25 percent) of the students who began at public 2-year institutions eventually transferred upward to a 4-year institution, and 13 percent made a lateral transfer to another 2-year institution. Fifteen percent of the beginners at 4-year institutions made a lateral transfer to a different 4-year institution, and 11 percent transferred downward to a less-than-4-year institution. About 70 percent of students who began at private for-profit less-than-4-year institutions and at private not-for-profit 4-year institutions always attended full time when they were enrolled, compared with 61 percent of students at public 4-year institutions. About one-fourth (26 percent) of the students who began at public 2-year institutions always attended full time. In this study, continuous enrollment is defined as being enrolled in postsecondary education (even if the student transferred) without a break of more than 4 months, which allows for the normal summer vacations between academic years. The number of enrollment spells is the number of periods separated by an interval of 4 or more months of not being enrolled anywhere; these intervals are also referred to as stopout periods. About three-fourths (78 percent) of the beginners at 4-year institutions were always continuously enrolled; 18 percent had one stopout period (two enrollment spells) and 4 percent had two or more stopout periods during the six years in this study. Beginning students at public 2-year institutions were more likely to have had a gradepoint average of less than 2.25 at the end of their first year than beginners at 4-year institutions (41 and 27 percent, respectively). Among students at 4-year institutions, those beginning at public institutions were more likely than those at private not-forprofit institutions to have had a GPA of less than 2.25 at the end of their first year (31 and 21 percent). While the majority of all 1995-96 beginning students at both 4-year institutions and private for-profit less-than-4-year institutions were women, private for-profit less-than-4-year institutions had a higher concentration of women than 4-year institutions. Specifically, 68 percent of students at private for-profit less-than-4-year institutions and 55 percent of students at 4-year institutions were women. About one-half (52 percent) of beginning public 2-year students were women. Four-year institutions had a larger percentage of beginning students who were 18 years or younger than public 2-year institutions (80 and 47 percent, respectively). Private forprofit less-than-4-year institutions had the smallest percentage of traditional age students (22 percent). Among 4-year institutions, private not-for-profit institutions had a higher proportion of beginners who were 18 years or younger than public institutions (84 and 79 percent, respectively). Information about the students' race/ethnicity was gathered in 1995-96, before the categories introduced in the year 2000 census were used. Seventy-two percent of beginning students at 4-year and public 2-year institutions were White, non-Hispanic. However, White, non-Hispanic students only accounted for 57 percent of beginners at private for-profit less-than-4-year institutions. No differences could be detected in the percentage of Black, non-Hispanic and of Hispanic students at each institution type, with the exception of private for-profit less-than-4-year institutions, which had a larger percentage of Hispanic students than 4-year institutions (20 percent and 11 percent, respectively). Beginning students at 4-year institutions were more likely than those at less-than -4year institutions to be single with no children (dependent) in 1995-96. Ninety-three percent of beginners at private not-for-profit and 92 percent of beginners at public 4year institutions were single with no children and dependent on their parents for financial support. The proportion of dependent students among beginners was lower at public 2-year (66 percent) and private for-profit less-than-4-year institutions (33 percent), than at public or private not-for-profit 4-year institutions. Public 2-year and private for-profit less-than-4-year institutions had the highest percentages of beginning students whose parents' education was limited to a high school diploma or less, while beginners at 4-year institutions were the most likely to have at least one parent with an advanced degree. A higher percentage of beginners at private not-for-profit institutions 4-year institutions had a parent with an advanced degree than those beginning at public 4-year institutions (33 percent vs. 24 percent). In 1995-96 the beginners who worked while enrolled were asked if they considered themselves to be primarily students who worked or to be employees who were enrolled. At the public 2-year institutions 29 percent, and at the private for-profit lessthan-4-year institutions 23 percent, considered themselves to be an employee who is enrolled, compared with 7 percent of public and 6 percent of private not-for-profit 4year students who said the same. Beginning dependent students at private for-profit less-than-4-year institutions were more likely to come from a family with an income of less than $25,000 than students at any other institution type. Dependent students at private not-for-profit 4-year institutions were more likely to come from a family with an income of $70,000 or greater than students at the other types of institutions. The percentage of the students within first institution level and type who in 1995-96 had the characteristics associated with a higher risk of not completing a degree program is displayed in Table 1.1-D. Each of the persistence risk factors is indicated by an asterisk. The percentage distribution of the beginners by the number of these risk factors present in 1995-96 is displayed within each level and type of first institution attended. Private for-profit less-than-4-year institutions had the largest percentage of beginning students with four or more risk factors in 1995-96. Thirty-five percent of beginners at private for-profit institutions had four or more risk factors, compared with 25 percent at public 2-year institutions and 4 percent at 4-year institutions. A larger percentage of beginners at 4-year institutions had high school diplomas, were dependents, and had no children than at the less-than-4 year institutions. About one-half of 1995-96 beginning students at public 2-year institutions (53 percent) attended full time when first enrolled, which was less than the percentage of full-time beginners at the other types of institutions. Eighty-seven percent of students at private for-profit institutions, 89 percent of students at public 4-year institutions, and 94 percent of students at private not-for-profit institutions 4-year attended full time when they were first enrolled. Beginning students at 4-year institutions were more likely not to work while enrolled (38 percent) and less likely to work full time while enrolled (10 percent) than their counterparts at public 2-year institutions (19 percent and 35 percent, respectively).    Section 2 provides information about 1995-96 beginning students who attained a bachelor's degree, an associate's degree, or a certificate at any institution (not necessarily where they first enrolled in 1995-96) by June 2001, as well as about those who never attained any of these degrees, but were still enrolled at some 4-year or less-than-4-year institution in the spring of 2001 (either at the first or some other institution) or who were not enrolled anywhere and had never attained any degree anywhere in the six years. Priority was given to attainment, so those who attained a certificate or associate's degree and continued to be enrolled and were working towards another degree (usually as transfers) are classified as having attained. See section 3 for comparable six-year attainment and retention rates (including transfer rates) at the first institution attended."}, {"section_title": "Foreword", "text": "This report describes the enrollment, persistence, and degree attainment of a nationally representative sample of students who began postsecondary education for the first time in the 1995-96 academic year. It covers the experience of these students over 6 academic years, from 1995-96 to 2000-01, and provides information about rates of degree completion, transfer, and attrition for students who first enrolled at various types of postsecondary institutions. A particular focus of this report is on the rates at which students who began at public 2-year, public 4-year, and private not-for-profit 4-year institutions completed the bachelor's degree. The analysis and the supplementary tables examine both the degree completion rates at the first institution attended and the completion rates at any postsecondary institution attended during the 6 years. The report uses the data from the 1996/01 Beginning Postsecondary Students Longitudinal Study (BPS:96/01). The BPS survey is the longitudinal component of the 1996 National Postsecondary Student Aid Study (NPSAS:96), a nationally representative sample that includes students enrolled in all types of postsecondary institutions. The BPS:96/01 cohort consists of students in the NPSAS:96 sample who were identified as having enrolled in postsecondary education for the first time during the 1995-96 academic year. These first-time beginning students were interviewed in 1996, at the end of their first year in postsecondary education; interviewed again in 1998,3 years after they had started; and interviewed for the last time in 2001,6 years after they had started. The BPS:96/01 study consists of the data gathered in all three of these survey years. The BPS:96/01 Data Analysis System (DAS), an NCES microcomputer application that allows users to generate tables for many NCES surveys and produces design-adjusted standard errors to allow researchers to perform tests of statistical significance, was used to produce the estimates presented in this report. The DAS for BPS:96/01 and other NCES surveys, as well as many descriptive and methodology reports, can be accessed and downloaded from the NCES web site (nces.ed.gov). Consult appendix B for more information.  Table  Page   EXECUTIVE SUMMARY TABLES   A Percentage of students beginning at 4-year institutions in 1995-96 who had completed a bachelor's degree at the first institution attended or at any 4-year institution by June 2001, by subcategories of beginning students B Percentage of students beginning at 4-year institutions in 1995-96 with a bachelor's degree goal who completed a bachelor's degree at the first institution attended or at any 4-year institution by June 2001, and the number of years to complete the degree, by type of first institution, enrollment patterns, academic preparation, and student characteristics Percentage distribution of 1995-96 beginning postsecondary students according to degree attainment and persistence through June 2001, by initial degree goal 12 7 Percentage distribution of 1995-96 beginning postsecondary students according to degree attainment and persistence through June 2001, by first type of institution attended Table  Page   8 Percentage of students beginning at public 2-year institutions in 1995-96 with an associate's or a bachelor's degree goal who had completed an associate's or a bachelor's degree by June 2001, and the number of years to complete the degree, by enrollment characteristics and risk factors 9 Percentage of students beginning at 4-year institutions in 1995-96 who had completed a bachelor's degree at the first institution attended or at any 4-year institution by June 2001, by subcategories of beginning students 16 10 Percentage of students beginning at 4-year institutions in 1995-96 with a bachelor's degree goal who completed a bachelor's degree at the first institution attended or at any 4-year institution by June 2001, and the number of years to complete the degree, by type of first institution, enrollment patterns, academic preparation, and student characteristics"}, {"section_title": "11,", "text": "Percentage distribution of students who began at 4-year institutions or public 2-year institutions in 1995-96 and completed a bachelor's degree by June 2001, according to type of institution granting the bachelor's degree, academic preparation, and student characteristics COMPENDIUM TABLES Percentage distribution of 1995-96 beginning postsecondary students by degree plans at the first institution attended, according to characteristics of the first institution and degrees attained by June 2001 1.1-A Percentage distribution of 1995-96 beginning postsecondary students by the level and type of the first institution attended, according to degree goal in 1995-96, program, and academic preparation 1.1-B Percentage distribution of 1995-96 beginning postsecondary students by the level and type of the first institution attended, according to attendance patterns, GPA, and last institution type 1.1-C Percentage distribution of 1995-96 beginning postsecondary students by the level and type of the first institution attended, according to demographic characteristics 45 1.1-D Percentage distribution of 1995-96 beginning postsecondary students by the level and type of the first institution attended, according to persistence risk factors when they first enrolled xvi Table  Page 2.1-D Percentage distribution of 1995-96 beginning postsecondary students who began in public 2-year institutions according to the highest degree attained and 6-year persistence and attainment status anywhere as of June 2001, by persistence risk factors when they first enrolled xvii Table   Public 4-Year Institutions Page 2.2-A Percentage distribution of 1995-96 beginning postsecondary students who began in public 4-year institutions according to the highest degree attained and 6-year persistence and attainment status anywhere as of June 2001, by degree goal, first degree attained, and academic preparation 63 2.2-B Percentage distribution of 1995-96 beginning postsecondary students who began in public 4-year institutions according to the highest degree attained and 6-year persistence and attainment status anywhere as of June 2001, by attendance patterns, GPA, and last institution type 2.2-C Percentage distribution of 1995-96 beginning postsecondary students who began in public 4-year institutions according to the highest degree attained and 6-year persistence and attainment status anywhere as of June 2001, by demographic characteristics 2.2-D Percentage distribution of 1995-96 beginning postsecondary students who began in public 4-year institutions according to the highest degree attained and 6-year persistence and attainment status anywhere as of June 2001, by persistence risk factors when they first enrolled 66 Private Not-For-Profit 4-Year Institutions 2.3-A Percentage distribution of 1995-96 beginning postsecondary students who began in private not-for-profit 4-year institutions according to the highest degree attained and 6-year persistence and attainment status anywhere as of June 2001, by degree goal, first degree attained, and academic preparation 2.3-B Percentage distribution of 1995-96 beginning postsecondary students who began in private not-for-profit 4-year institutions according to the highest degree attained and 6-year persistence and attainment status anywhere as of June 2001, by attendance patterns, GPA, and last institution type 2.3-C Percentage distribution of 1995-96 beginning postsecondary students who began in private not-for-profit 4-year institutions according to the highest degree attained and 6-year persistence and attainment status anywhere as of June 2001, by demographic characteristics 2.3-D Percentage distribution of 1995-96 beginning postsecondary students who began in private not-for-profit 4-year institutions according to the highest degree attained and 6-year persistence and attainment status anywhere as of June 2001, by persistence risk factors when they first enrolled 70 xviii .0-A Percentage distribution of 1995-96 beginning postsecondary students according to the highest degree attained and 6-year retention and transfer status at first institution attended as of June 2001, by first institution type and first degree plans 3.0-B Percentage distribution of 1995-96 beginning postsecondary students according to the highest degree attained and 6-year retention and transfer status at first institution attended as of June 2001, by attendance patterns and GPA 3.0-C Percentage distribution of 1995-96 beginning postsecondary students according to the highest degree attained and 6-year retention and transfer status at first institution attended as of June 2001, by demographic characteristics 3.0-D Percentage distribution of 1995-96 beginning postsecondary students according to the highest degree attained and 6-year retention and transfer status at first institution attended as of June 2001, by persistence risk factors when they first enrolled Public 2-Year Institutions 3.1-A Percentage distribution of 1995-96 beginning postsecondary students in public 2-year institutions according to the highest degree attained and 6-year retention and transfer status at first institution attended as of June 2001, by first institution type and first degree plans 3.1-B Percentage distribution of 1995-96 beginning postsecondary students in public 2-year institutions according to the highest degree attained and 6-year retention and transfer status at first institution attended as of June 2001, by attendance patterns and GPA 3.1-C Percentage distribution of 1995-96 beginning postsecondary students in public 2-year institutions according to the highest degree attained and 6-year retention and transfer status at first institution attended as of June 2001, by demographic characteristics 3.1-D Percentage distribution of 1995-96 beginning postsecondary students in public 2-year institutions according to the highest degree attained and 6-year retention and transfer status at first institution attended as of June 2001, by persistence risk factors when they first enrolled xix Table  Page Public 4-Year Institutions 3.2-A Percentage distribution of 1995-96 beginning postsecondary students in public 4-year institutions according to the highest degree attained and 6-year retention and transfer status at first institution attended as of June 2001, by first institution type and academic preparation 3.2-B Percentage distribution of 1995-96 beginning postsecondary students in public 4-year institutions according to the highest degree attained and 6-year retention and transfer status at first institution attended as of June 2001, by attendance patterns and GPA 3.2-C Percentage distribution of 1995-96 beginning postsecondary students in public 4-year institutions according to the highest degree attained and 6-year retention and transfer status at first institution attended as of June 2001, by demographic characteristics 3.2-D Percentage distribution of 1995-96 beginning postsecondary students in public 4-year institutions according to the highest degree attained and 6-year retention and transfer status at first institution attended as of June 2001, by persistence risk factors when they first enrolled Private Not-For-Profit 4-Year Institutions 3.3-A Percentage distribution of 1995-96 beginning postsecondary students in private notfor-profit 4-year institutions according to the highest degree attained and 6-year retention and transfer status at first institution attended as of June 2001, by first institution type and academic preparation 3.3-B Percentage distribution of 1995-96 beginning postsecondary students in privatcnotfor-profit 4-year institutions according to the highest degree attained and 6-year retention and transfer status at first institution attended as of June 2001, by attendance patterns and GPA 3.3-C Percentage distribution of 1995-96 beginning postsecondary students in private notfor-profit 4-year institutions according to the highest degree attained and 6-year retention and transfer status at first institution attended as of June 2001, by demographic characteristics 3.3-D Percentage distribution of 1995-96 beginning postsecondary students in private notfor-profit 4-year institutions according to the highest degree attained and 6-year retention and transfer status at first institution attended as of June 2001, by persistence risk factors when they first enrolled Table  Page Section 4: Persistence and Attainment After Six Years by Initial Degree Goals in 1995-96 Certificate Goal 4.1-A Percentage distribution of 1995-96 beginning postsecondary students with a goal of attaining a certificate when they first enrolled, according to the highest degree attained anywhere and 6-year persistence status as of June 2001, by first institution type and degree plans 99 4.1-B Percentage distribution of 1995-96 beginning postsecondary students with a goal of attaining a certificate when they first enrolled, according to the highest degree attained anywhere and 6-year persistence status as of June 2001, by attendance patterns and GPA 100 4.1-C Percentage distribution of 1995-96 beginning postsecondary students with a goal of attaining a certificate when they first enrolled, according to the highest degree attained anywhere and 6-year persistence status as of June 2001, by demographic characteristics 101 4.1-D Percentage distribution of 1995-96 beginning postsecondary students with a goal of attaining a certificate when they first enrolled, according to the highest degree attained anywhere and 6-year persistence status as of June 2001, by persistence risk factors when they first enrolled 102 Associate's Degree Goal 4.2-A Percentage distribution of 1995-96 beginning postsecondary students with a goal of attaining an associate's degree when they first enrolled, according to the highest degree attained anywhere and 6-year persistence status as of June 2001, by first institution type and degree plans 103 4.2-B Percentage distribution of 1995-96 beginning postsecondary students with a goal of attaining an associate's degree when they first enrolled, according to the highest degree attained anywhere and 6-year persistence status as of June 2001, by attendance patterns and GPA 104 4.2-C Percentage distribution of 1995-96 beginning postsecondary students with a goal of attaining an associate's degree when they first enrolled, according to the highest degree attained anywhere and 6-year persistence status as of June 2001, by demographic characteristics Table  Page 4.2-D Percentage distribution of 1995-96 beginning postsecondary students with a goal of attaining an associate's degree when they first enrolled, according to the highest degree attained anywhere and 6-year persistence status as of June 2001, by persistence risk factors when they first enrolled Bachelor's Degree Goal 4.3-A Percentage distribution of 1995-96 beginning postsecondary students with a goal of attaining a bachelor's degree when they first enrolled, according to the highest degree attained anywhere and 6-year persistence status as of June 2001, by first institution type and academic preparation 107 4.3-B Percentage distribution of 1995-96 beginning postsecondary students with a goal of attaining a bachelor's degree when they first enrolled, according to the highest degree attained anywhere and 6-year persistence status as of June 2001, by attendance patterns and GPA 108 4.3-C Percentage distribution of 1995-96 beginning postsecondary students with a goal of attaining a bachelor's degree when they first enrolled, according to the highest degree attained anywhere and 6-year persistence status as of June 2001, by demographic characteristics 4.3-D Percentage distribution of 1995-96 beginning postsecondary students with a goal of attaining a bachelor's degree when they first enrolled, according to the highest degree attained anywhere and 6-year persistence status as of June 2001, by persistence risk factors when they first enrolled Bachelor's Degree GoalRecent High School Graduates 4.4-A Percentage distribution of 1995-96 beginning postsecondary students who were recent high school graduates with a goal of attaining a bachelor's degree when they first enrolled, according to the highest degree attained anywhere and 6-year persistence status as of June 2001, by first institution type and academic preparation..."}, {"section_title": "4.4-B", "text": "Percentage distribution of 1995-96 beginning postsecondary students who were recent high school graduates with a goal of attaining a bachelor's degree when they first enrolled, according to the highest degree attained anywhere and 6-year persistence status as of June 2001, by attendance patterns and GPA 4.4-C Percentage distribution of 1995-96 beginning postsecondary students who were recent high school graduates with a goal of attaining a bachelor's degree when they first enrolled, according to the highest degree attained anywhere and 6-year persistence status as of June 2001, by demographic characteristics Table  Page 4.4-D Percentage distribution of 1995-96 beginning postsecondary students who were recent high school graduates with a goal of attaining a bachelor's degree when they first enrolled, according to the highest degree attained anywhere and 6-year persistence status as of June 2001, by persistence risk factors when first enrolled Section 5: Last Year Enrolled in Postsecondary Education Without a Degree All Beginning Students 5.0-A Percentage distribution of 1995-96 beginning postsecondary students according to whether they attained any degree as of June 2001, or if they did not attain, the year they left postsecondary education, by first institution type and first degree plans 121 5.0-B Percentage distribution of 1995-96 beginning postsecondary students according to whether they attained any degree as of June 2001, or if they did not attain, the year they left postsecondary education, by attendance patterns, GPA, and last institution type 5.0-C Percentage distribution of 1995-96 beginning postsecondary students according to whether they attained any degree as of June 2001, or if they did not attain, the year they left postsecondary education, by demographic characteristics 123 5.0-D Percentage distribution of 1995-96 beginning postsecondary students according to whether they attained any degree as of June 2001, or if they did not attain, the year they left postsecondary education, by persistence risk factors when they first enrolled Public 2-Year Institutions 5.1-A Percentage distribution of 1995-96 beginning postsecondary students in public 2-year institutions according to whether they attained any degree as of June 2001, or if they did not attain, the year they left postsecondary education, by first degree plans and degree goal 125 5.1-B Percentage distribution of 1995-96 beginning postsecondary students in public 2-year institutions according to whether they attained any degree as of June 2001, or if they did not attain, the year they left postsecondary education, by attendance patterns, GPA, and last institution type 126 5.1-C Percentage distribution of 1995-96 beginning postsecondary students in public 2-year institutions according to whether they attained any degree as of June 2001, or if they did not attain, the year they left postsecondary education, by demographic characteristics 127 xxiii 2 5 Table  Page 5.1-D Percentage distribution of 1995-96 beginning postsecondary students in public 2-year institutions according to whether they attained any degree as of June 2001, or if they did not attain, the year they left postsecondary education, by persistence risk factors when they first enrolled Table  Page 5.3-D Percentage distribution of 1995-96 beginning postsecondary students in private notfor-profit 4-year institutions according to whether they attained any degree as of June 2001, or if they did not attain, the year they left postsecondary education, by persistence risk factors when they first enrolled 136 Section 6: Transfer Patterns All Beginning Students 6.0-A Percentage distribution of 1995-96 beginning postsecondary students according to their transfer status as of June 2001, and if they transferred, according to the last year enrolled at the first institution attended, by first institution type and initial degree goal 140 6.0-B Percentage distribution of 1995-96 beginning postsecondary students according to their transfer status as of June 2001, and if they transferred, according to the type of institution that was the destination of the first transfer, by first institution type and initial degree goal 141 Students Who Transferred 6.1-A Percentage distribution of 1995-96 beginning postsecondary students who transferred as of June 2001, according to the last year enrolled at the first institution attended, by first institution type, initial degree goal, and transfer type 142 6.1-B Percentage distribution of 1995-96 beginning postsecondary students who transferred as of June 2001, according to the type of institution that was the destination of the first transfer, by first institution type, initial degree goal, and transfer type 144 6.1-C Percentage distribution of 1995-96 beginning postsecondary students who transferred as of June 2001, according to the first year they enrolled at the destination institution of the first transfer, by first institution type, initial degree goal, transfer type, and last year enrolled at the first institution attended Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status at the first institution attended at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the first year, 1995-96 .... 152 xxv Table  Page 7.2 Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status at the first institution attended at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the second year, 1996-97 Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status at the first institution attended at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the third year, 1997-98 7.4 Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status at the first institution attended at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the fourth year, 1998-99 158 7.5 Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status at the first institution attended at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the fifth year, 1999-2000 160 7.6 Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status at the first institution attended at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the sixth year, 2000-01 Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status anywhere at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the first year, 1995-96"}, {"section_title": "8.2", "text": "Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status anywhere at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the second year, 1996-97 xxvi Table  Page 8.3 Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status anywhere at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the third year, 1997-98 172 8.4 Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status anywhere at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the fourth year, 1998-99 174 8.5 Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status anywhere at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the fifth year, 1999-2000 176 8.6 Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status anywhere at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the sixth year, 2000-01 Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to whether they stayed on the persistence track or the first type of exit from the persistence track during each academic year, by the first type of 4-year institution and student characteristics: End of first year, 1995-96 183 9.2 Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to whether they stayed on the persistence track or the first type of exit from the persistence track during each academic year, by the first type of 4-year institution and student characteristics: End of second year, 1996-97 Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to whether they stayed on the persistence track or the first type of exit from the persistence track during each academic year, by the first type of 4-year institution and student characteristics: End of third year, 1997-98 189 9.4 Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to whether they stayed on the persistence track or the first type of exit from the persistence track during each academic year, by the first type of 4-year institution and student characteristics: End of fourth year, 1998-99 Table  Page 9.5 Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to whether they stayed on the persistence track or the first type of exit from the persistence track during each academic year, by the first type of 4-year institution and student characteristics: End of fifth year, 1999-2000 9.6 Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to whether they stayed on the persistence track or the first type of exit from the persistence track during each academic year, by the first type of 4-year institution and student characteristics: End of sixth year, 2000-01 9.7 Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to whether they stayed on the persistence track or the first type of exit from the persistence track, by the first type of 4-year institution and student characteristics: Status in June 2001 Section 10: Student and Institutional Bachelor's Degree Completion Rates Public 4-Year Institutional Rates 10.1-A Percentage of 1995-96 beginning students at public 4-year institutions with a bachelor's degree goal who completed a bachelor's degree at the first institution attended in 4 years or less, in 5 years, or in 6 years, and the total percentage completing a bachelor's degree by June 2001 at the first institution attended, by academic preparation and attendance patterns 10.1-B Percentage of 1995-96 beginning students at public 4-year institutions with a bachelor's degree goal who completed a bachelor's degree at the first institution attended in 4 years or less, in 5 years, or in 6 years, and the total percentage completing a bachelor's degree by June 2001 at the first institution attended, by demographic characteristics 10.1-C Percentage of 1995-96 beginning students at public 4-year institutions with a bachelor's degree goal who completed a bachelor's degree at the first institution attended in 4 years or less, in 5 years, or in 6 years, and the total percentage completing a bachelor's degree by June 2001 at the first institution attended, by persistence risk factors when they first enrolled Private Not-For-Profit 4-Year Institutional Rates 10.2-A Percentage of 1995-96 beginning students at private not-for-profit 4-year institutions with a bachelor's degree goal who completed a bachelor's degree at the first institution attended in 4 years or less, in 5 years, or in 6 years, and the total percentage completing a bachelor's degree by June 2001 at the first institution attended, by academic preparation and attendance patterns Table  Page 10.3-C Percentage of 1995-96 beginning students at public 4-year institutions with a bachelor's degree goal who completed a bachelor's degree in 4 years or less, in 5 years, or in 6 years, and the total percentage completing a bachelor's degree anywhere by June 2001, by persistence risk factors when they first enrolled Private Not-For-Profit 4-Year Student Rates 10.4-A Percentage of 1995-96 beginning students at private not-for-profit 4-year institutions with a bachelor's degree goal who completed a bachelor's degree in 4 years or less, in 5 years, or in 6 years, and the total percentage completing a bachelor's degree anywhere by June 2001, by academic preparation and attendance patterns 213 10.4-B Percentage of 1995-96 beginning students at private not-for-profit 4-year institutions with a bachelor's degree goal who completed a bachelor's degree in 4 years or less, in 5 years, or in 6 years, and the total percentage completing a bachelor's degree anywhere by June 2001, by demographic characteristics xxix Table  Page 10.4-C Percentage of 1995-96 beginning students at private not-for-profit 4-year institutions with a bachelor's degree goal who completed a bachelor's degree in 4 years or less, in 5 years, or in 6 years, and the total percentage completing a bachelor's degree anywhere by June 2001, by persistence risk factors when they first enrolled 11.1-C Percentage of 1995-96 beginning postsecondary students who completed a bachelor's degree, according to post-baccalaureate enrollment and graduate degree program, by selected demographic and institutional characteristics Employment 11.2-A Percentage distribution of 1995-96 beginning postsecondary students who were employed full time as of June 2001 (and, if enrolled, were primarily employees), according to student-reported relationship between their current job and postsecondary education, by selected demographic and institutional characteristics 11.2-B Percentage distribution of 1995-96 beginning postsecondary students who were employed full time and were not self-employed as of June 2001 (and, if enrolled, were primarily employees), according to student-reported autonomy in their current job, by selected demographic and institutional characteristics 11.2-C Percentage distribution of 1995-96 beginning postsecondary students who were employed full time and were not self-employed as of June 2001 (and, if enrolled, were primarily employees), according to whether the student relocated for the current job, by selected demographic and institutional characteristics 228 11.2-D Percentage of 1995-96 beginning postsecondary students who were employed full time as of June 2001 (and, if enrolled, were primarily employees), according to the employer-provided benefits in the current job, by selected demographic and institutional characteristics Table  Page 11.2-E Percentage of 1995-96 beginning postsecondary students who were employed full time as of June 2001 (and, if enrolled, were primarily employees), according to occupational licensure and professional certification, by selected demographic and institutional characteristics 11.4-E Percentage distribution of 1995-96 beginning postsecondary students according to lifetime learning tax credit claims, by selected student characteristics Percentage distribution of students with a bachelor's degree goal who were first-time beginners at a 4-year institution in 1995-96, by their enrollment status or degree attainment at the first institution attended, at the end of each academic year through 2000-01 vi B Percentage distribution of students with a bachelor's degree goal who were first-time beginners at a 4-year institution in 1995-96, by their enrollment status or degree attainment at the first institution attended and anywhere in postsecondary education, as of Percentage distribution of students with a bachelor's degree goal who were first-time beginners at a 4-year institution in 1995-96, by their persistence and degree attainment anywhere in postsecondary education, at the end of each academic year through 2000-01 19   4Percentage distribution of students with a bachelor's degree goal who were first-time beginners at a 4-year institution in 1995-96, by institutional retention and degree attainment at the first institution attended, at the end of each academic year through 2000-01 20 5 Percentage distribution of students with a bachelor's degree goal who were first-time beginners at a 4-year institution in 1995-96, by their enrollment status or degree attainment at the first institution attended and anywhere in postsecondary education, as of Approximately 3 million undergraduates entered postsecondary education for the first time during the 1995-96 academic year, enrolling in a wide variety of institutions, including 4-year colleges and universities, community colleges, and private for-profit institutions offering vocational programs. A sample of these first-time beginning students was surveyed in 1996, at the end of their first year in postsecondary education.' They were interviewed again in 1998, three years after they had started, and interviewed for the last time in 2001, six years later. The Beginning Postsecondary Students Longitudinal Study of 1996-2001 (BPS:96/01) consists of the data gathered in all three of these survey years. This report summarizes some of the major findings from the BPS:96/01 study data that relate to the persistence and degree attainment of this cohort of beginning postsecondary students during the six academic years from 1995-96 to 2000-2001. A previous report described the 1995-96 beginning postsecondary students as of 1998 and focused on those enrolled in certificate or associate's degree programs that could have been completed in three years or less.2 After three years, about one-half (58 percent) of the students who began vocational certificate programs at less-than-2-year (primarily private for-profit) institutions had attained a certificate, and less than 10 percent of them were still enrolled anywhere. Among those who had started an associate's degree program at a public 2-year college, however, 7 percent had completed an associate's degree, and more than one-half were still enrolled in postsecondary education, including many transfers to 4-year institutions. Very few students who had started at a 4-year college or university had completed a bachelor's degree by 1998; after three years, however, 64 percent were still enrolled at the same college where they had started, and another 20 percent were still enrolled in postsecondary educationbut had transferred to a different institution. The role of transfers is critical in understanding student persistence and interpreting degree completion rates. Institutions do not know what happens to students once they have left whether they have really dropped out of postsecondary education or have transferred to another institution. As this report will show, rates of institutional retention and completion are substantially lower than rates of persistence and degree completion in the postsecondary education system as a whole.3 Using data from longitudinal studies of high school students, Adelman (1999) has shown that because so many students attend more than one institution, college students are actually more successful in completing bachelor's degrees than the average completion rates reported by institutions seem to suggest.4 This report focuses on the difference in degree completion and enrollment outcomes when viewed from the student (or systemwide) perspective as opposed to the institutional perspective. The terms institutional retention and institutional completion rates are used only when describing what happened to the students at the first institution they attended. The terms student persistence and student completion rates are used when de'scribing what happened to them anywhere in postsecondary education, regardless of whether or not they stayed at the original institution."}, {"section_title": "Organization of the Report", "text": "A number of studies describing the 1995-96 beginning students in 1998, three years after they started postsecondary education, have already explored topics that will not be covered here. The completion rates of students in short-term vocational certificate programs, comparing beginning students at private for-profit and at public 2-year institutions, have already been described in detail (Berkner, Horn, and Clune 2000). The relationship of academic preparation in high school and student persistence at 4-year institutions during the first three academic years has also been analyzed, demonstrating the importance of completing a rigorous high school curriculum (Horn and Kojaku 2001). In addition, two recent reports have examined the relationship of financial aid and persistence during the first three years: a study of students who received Pell Grants (Wei and Horn 2002) and a study of the reasons for early departure from postsecondary education (Bradburn 2002). 3This difference is stressed by both Tinto (1993) and Adelman (1999). 4lnstitutional completion rates are reported annually by ACT, based on a survey of institutions (available at http: / /www.act.org), and by the National Collegiate Athletic Association (NCAA) for its member institutions (available at http://www.ncaa.or,e). They are also reported to the U. S. Department of Education through the Integrated Postsecondary Education Data System (IPEDS). For 4-year institutions, ACT reports five-year bachelor's degree completion rates, while the NCAA and IPEDS report six-year rates. ACT and IPEDS also report three-year associate's degree completion rates for 2-year institutions. This report begins with a brief description of the types of institutions that the beginning students first attended in 1995-96, their transfer patterns during the six years under study, and where they were last enrolled as undergraduates. It then describes the beginners5 in terms of their initial degree goals, their attendance patterns, and the extent to which they possess characteristics associated with a higher risk of not completing a degree. This section is followed by a description of students' persistence in postsecondary education and their attainment of various degrees after six years, both by their initial degree goals and by the type of institution first attended. The next section examines the rates at which students who began at public 2-year institutions with an associate's or a bachelor's degree goal attained these two types of degrees, and the number of years they took to complete them. For the beginners at 4-year institutions with a bachelor's degree goal, this section shows their enrollment and degree attainment outcomes at the end of each of the six years under study, with a direct comparison of outcomes from the perspective of both the institution and the student. The report then covers in more detail the bachelor's degree completion rates of students who began at 4-year institutions with a bachelor's degree goal and describes the percentage of beginners who completed a bachelor's degree in the expected four years and those who took longer to finish. The report concludes with a profile of the 1995-96 beginning students who had completed a bachelor's degree and graduated by June 2001 (within six years of starting); this section compares selected characteristics of graduates who started at 4-year institutions and completed the bachelor's degree in four years with those of graduates who took longer to finish, as well as compares the graduates who had started at community colleges with those who had started at 4-year colleges. The rest of the report consists of a compendium of tables that provide more detail and additional information about the 1995-96 beginning students, including sections describing student persistence anywhere (section 2), institutional retention and transfers (section 3), and annual attrition (section 5) for those starting at public 2-year, public 4-year, and private not-forprofit 4-year institutions. The report also contains tables showing rates of persistence and degree attainment among beginners starting at any type of institution according to whether their initial degree goal was a certificate, an associate's degree, or a bachelor's degree (section 4), and tables that provide more information about transfer patterns (section 6). Tables in other sections show the annual enrollment or attainment status of students beginning at 4-year institutions with a bachelor's degree goal at the end of each of the six years from the perspective of institutional retention (section 7), student persistence anywhere (section 8), and staying on the persistence 5For ease of presentation the report uses the term beginners to describe the 1995-96 beginning postsecondary students. track to the bachelor's degree (section 9). Bachelor's degree completion rates for beginners at public and private not-for-profit 4-year institutions are shown in section 10, which includes rates of completion in four, five, and six years. Finally, section 11 provides additional information about distance education, academic performance, graduate school enrollment, employment, community service, student borrowing, and the use of credit cards and tuition tax credits."}, {"section_title": "40", "text": "Degree Goals, Attendance Patterns, and Persistence Risk Factors"}, {"section_title": "Degree Goals", "text": "Students begin their postsecondary education for a variety of reasons, but they usually intend to complete a program and earn a degree, although not necessarily at the institution where 8Ten percent of the students attended three or more institutions (see compendium table 1.1-B), so the last type of institution attended is not always the same as the first transfer destination. 9Although vocational certificates are not considered to be degrees in the strictest sense of the term, in this report they are considered as such, in the generic sense of a credential awarded to recognize the completion of an educational program. they first enrolled. At the 4-year institutions, most of the beginners (about 90 percent) said that they intended to complete a bachelor's degree (table 3). A small proportion (1 to 3 percent) of the beginners intended to complete a certificate or an associate's degree, which are also offered by some 4-year institutions.10 Five percent said that they did not expect to complete any degree. At the public 2-year institutions, about one-half (49 percent) of the beginners expressed a goal of completing an associate's degree, and one-fourth (25 percent) said that they intended to transfer to a 4-year institution and complete a bachelor's degree. Eleven percent intended to complete a vocational certificate program, and 16 percent were enrolled with no particular degree goals. At the private for-profit institutions that offered less-than-4-year programs, about twothirds (65 percent) of the beginners intended to complete a vocational certificate program, 16 percent wanted to complete an associate's degree, and 17 percent had no degree goal."}, {"section_title": "Attendance Patterns", "text": "The likelihood of actually achieving a degree goal within a specified period of time depends partly on the length of the program and the student's attendance intensity and enrollment continuity while in the program. Vocational certificate programs can usually be completed in less than two years, while associate's degree programs usually require at least two years and bachelor's degrees at least four years. Students who are always enrolled full time and are enrolled continuously can be expected to complete any degree program more rapidly than those who are enrolled part time or who take a break and are not enrolled continuously.11 Compared with beginners at other types of institutions, students who started at public 2year institutions were the least likely to be always enrolled full time (26 percent), the most likely to be always enrolled part time (22 percent), and the most likely not to be enrolled continuously (39 percent) (table 4). Among beginners at private for-profit less-than-4-year institutions (who were concentrated in vocational certificate programs), a majority were always enrolled full time (70 percent) and were continuously enrolled (77 percent) in their relatively short-term programs. At the 4-year institutions, beginners at private not-for-profit colleges were more likely than those who began at public colleges to be always enrolled full time (69 percent vs. 61 percent) and to be enrolled continuously (82 percent vs. 75 percent). "}, {"section_title": "Persistence Risk Factors", "text": "Part-time enrollment increases the time to get a degree, and it is one factor that puts students at risk of not completing their degree programs at al1.12 Another characteristic that has been linked to a decreased likelihood of attaining a degree is delaying entry into postsecondary 11 Continuous enrollment is defined as being enrolled without a break of more than four months, which allows for a summer vacation. Students who have an enrollment break of more than four months are also called stopouts. Students who transfer may be both transfers and stopouts if they delay more than four months before enrolling at the transfer destination institution. 12The negative effect of the various risk factors discussed here has been documented in many NCES publications. See, for example, Carroll (1989); Horn and Premo (1995); Horn (1996);Berkner, Cuccaro-Alamin, and McCormick (1996); and Berkner, Horn, and Clune (2000). Adelman (1999) also includes some of these risk factors in his discussion of degree completion. education immediately after high school. Recent high school graduates who do not start college within a year of high school graduation are less likely to complete a higher education degree program than those who enroll immediately. Other factors that have been identified as increasing the risk of not completing a college degree are not having a regular high school diploma, having children, being a single parent, being financially independent of parents, and working full time while enrolled. In prior studies, a persistence risk index was developed that is based on the number of these adverse characteristics associated with a student (Horn 1996). All of these risk factors are also associated with nontraditional students, and the higher the risk index, the more nontraditional the student may be considered to be. Conversely, students with none of the risk factors may be considered to be highly traditional students: they enroll immediately after receiving a high school diploma, attend full time in the first year, are financially dependent on their parents, and work part time or not at all while enrolled. Beginners at the 4-year institutions were predominantly traditional: a minority had delayed starting college immediately after high school, and the majority (72-80 percent) had no risk factors at all (table 5). Those students who started at private not-for-profit 4-year institutions were more likely to be traditional than those starting at any other type of institution. By contrast, almost one-half (46 percent) of the beginners at public 2-year institutions had delayed entry after high school, and about one-half (53 percent) had two or more risk factors when they enrolled. The students who started postsecondary education in private for-profit less-than-4-year institutions were the most nontraditional of all: about three-fourths (71 percent) had either delayed their enrollment after high school or had two or more risk factors. \nRecent high school graduates who went to college immediately were more likely to complete a bachelor's degree in six years than the beginners who had delayed entry (67 percent vs. 37 percent). The six-year completion rate for traditional students who started college with no persistence risk factors was 71 percent, compared with 49 percent for those who had one risk factor and 21 percent for those who had two or more risk factors. Moreover, students with no persistence risk factors were more likely to complete a bachelor's degree in four years than they were to finish in more than four years (42 percent vs. 28 percent); however, among those with one risk factor, no difference could be detected between the percentage who took more than four years to finish and the percentage who finished in four years (24-25 percent).\nAs discussed earlier, the beginners who started at 4-year institutions in 1995-96 were predominantly traditional students: most of them had entered college without delay after high school, and most had none of the characteristics associated with a high risk of not completing a degree. This pattern is reflected in the profile of those who had started at a 4-year institution and had completed a bachelor's degree by June 2001: 91 percent had entered college immediately after high school, and 86 percent had no persistence risk factors when they first enrolled in 1995-96. Those with no persistence risk factors represented a higher proportion among the graduates who completed a bachelor's degree in four years (88 percent) than among those who took longer to finish (83 percent). The beginners at public 2-year institutions, on the other hand, were more likely to have been nontraditional students than those who began at 4-year institutions. As shown earlier, about one-half of the beginners at public 2-year institutions had delayed starting college after high school, and about one-half had two or more persistence risk factors when they started. Among those who had started at a community college and had completed a bachelor's degree within six years, 18 percent had delayed entry after high school and 17 percent had two or more risk factors when they began (compared with 9 percent and 3 percent, respectively, among college graduates who began at 4-year institutions). Traditional students with no risk factors when they began represented about one-half (56 percent) of the bachelor's degree recipients who had transferred from a public 2-year institution. The other half were nontraditional students who began their education with a higher risk of not completing any degree, but had been able to gain entry to a bachelor's degree program through a community college."}, {"section_title": "4 4 Institution Type", "text": "In summary, most of the beginners at 4-year colleges and universities were traditional undergraduates pursuing a bachelor's degree as full-time students, and at least three-fourths were continuously enrolled. Those who began at private not-for-profit institutions were somewhat more likely than those at public institutions to be traditional, to be always enrolled full time, and to be enrolled continuously. As will be discussed later, beginners at private not-for-profit 4-year institutions were also more likely than those beginning at public 4-year institutions to enter college with mostly A's in high school, with more than one Advanced Placement test, and with SAT scores in the highest quartile.13 At the public 2-year institutions, on the other hand, about one-half of the beginners were nontraditional students, about three-fourths were not always enrolled full time, and about 40 percent were not enrolled continuously. About one-half of them had an associate's degree goal, one-fourth were pursuing a bachelor's degree, and about one-fourth were intending to get a vocational certificate or had no degree goals. At the private for-profit institutions, the majority of beginners were highly nontraditional students and had a goal of completing a vocational certificate program. Most of them were always enrolled full time and always enrolled continuously, in part because their programs could be completed in a relatively short period of time and because many of these institutions require full-time enrollment.14"}, {"section_title": "Student Degree Attainment and Persistence After Six Years", "text": "The distribution of all the undergraduates who began postsecondary education in 1995-96 according to their initial degree goals is compared with their distribution by degree attainment or enrollment status after six years in figure 2. About one-half (49 percent) of all postsecondary beginners initially had a bachelor's degree goal (including those starting in less-than-4-year institutions), one-fourth (26 percent) had an associate's degree goal, and 14 percent had a certificate goal. Six years later in June 2001, 29 percent had actually attained a bachelor's degree, 10 percent had attained an associate's degree, and 12 percent had completed a certificate program. Fourteen percent had not attained any degree, but were still enrolled in postsecondary education. Of all 1995-96 beginning students, about one-third (35 percent) had left without attaining any type of degree and were no longer enrolled anywhere in June 2001.15 13See compendium table 1.1-A. 14Berlcner, Horn, and Clune (2000) describe beginning students at less-than-4-year institutions in detail. 15Some of the students who had left without a degree may return and complete a program after June 2001, however.  Among those with an initial bachelor's degree goal (including students who began at lessthan-4-year institutions), about one-half (53 percent) had attained a bachelor's degree by 2001, 7 percent had attained a lower-level degree, and about one-fourth (23 percent) had not attained any degree and were no longer enrolled (table 6). Among those with an initial associate's degree goal, about one-fourth (24 percent) had attained an associate's degree, 8 percent had earned a bachelor's degree, and 8 percent had completed a vocational certificate program. Among those with an initial certificate goal, about one-half (53 percent) had completed a certificate program, and a few (4 percent) had attained an associate's degree. Students with no degree goals when they started were the least likely to have attained any degree at all (28 percent) and the most likely to have left postsecondary education without a degree (56 percent). Compared with the beginners at the other types of institutions, undergraduates who began at private not-for-profit 4-year institutions in 1995-96 had the highest rates of attainment and the lowest rates of attrition without a degree (table 7). Among all undergraduates who began at private not-for-profit 4-year institutions, 69 percent had attained a bachelor's degree within six years, although not necessarily at the institution where they had first enrolled. A small percentage  (about 5 percent) had attained associate's degrees or certificates, 9 percent had not attained any degree but were still enrolled somewhere, and 17 percent had left postsecondary education by June 2001 without attaining any degree. Undergraduates who began at public 4-year institutions were not as successful: 53 percent had attained a bachelor's degree, 17 percent were still enrolled somewhere but had not attained a degree, and 23 percent had attained no degree and were no longer enrolled. Sixty percent of those who began at private for-profit less-than-4-year institutions had attained some type of degree, primarily certificates in short-term programs (51 percent). As shown in previous reports, students' failure to complete short-term certificate programs at private for-profit or any less-than-2-year institutions was not related to the number of risk factors they had.16 The majority of beginners at private for-profit institutions were nontraditional students, but the majority were also enrolled full time and were able to complete their short-term programs at relatively high rates. The beginners at private for-profit institutions were concentrated in two categories: they had either completed a program (60 percent) or had left postsecondary education without a degree (37 percent); 3 percent were still enrolled at some institution without a degree by June 2001. The types of degrees attained by the students who began at public 2-year institutions reflected the diversity of their degree goals and their background characteristics, as well as their high transfer rates. After six years, 10 percent of the beginners at public 2-year institutions had attained a certificate, 16 percent had attained an associate's degree, and another 10 percent had completed a bachelor's degree after transferring to a 4-year institution. However, after six years, the beginners at public 2-year institutions were less likely to have attained a degree anywhere (36 percent) than those beginning at the other types of institutions. They were also more likely to have left postsecondary education without any degree (47 percent), although 17 percent were still enrolled somewhere without a degree in 2001. In part, this high rate of attrition reflects the high rates of part-time attendance and discontinuous enrollment noted earlier among the beginners at community colleges."}, {"section_title": "Attainment Rates Among Students Beginning at Public 2-Year Institutions", "text": "Public 2-year institutions serve a diverse body of students who enroll with a variety of educational goals. Two important missions of community colleges, among others, are to offer associate's degree programs in applied fields and in the liberal arts, either as terminal degrees or as the first two years of for-credit courses that the students can use to transfer to a 4-year institution and complete a bachelor's degree program. As shown earlier, about one-half of the beginning students at public 2-year colleges intended to attain an associate's degree, and another one-fourth intended to transfer to a 4-year institution and complete a bachelor's degree. As also shown earlier, about one-fourth of the beginners at public 2-year institutions did transfer to a 4year institution. Because it is not necessary to complete an associate's degree before transferring to a 4-year institution, the associate's degree attainment rates are only partially valid as a measure of student success at public 2-year institutions. Those students who began at public 2-year institutions and had expressed an associate's or bachelor's degree goal in 1995-96 represented about three-fourths of the beginners at those institutions.17 Aftet six years, 31 percent of these students had attained either an associate's or a bachelor's degree: 23 percent had completed an associate's degree, and 13 percent had completed a bachelor's degree, including 5 percent who had completed both (table 8). Those with an initial bachelor's degree goal were more likely to attain a bachelor's degree (23 percent) than those with an associate's degree goal (8 percent), but about 5 percent of both groups earned both degrees. However, among those students who actually did transfer to a 4-year institution (regardless of their initial goals), 36 percent attained a bachelor's degree within six years of starting community college. The low percentage of all beginners at public 2-year institutions who were always enrolled full time and the high percentage who were not enrolled continuously are reflected in the number of years that they took to attain an associate's degree. Four percent of the beginners at public 2year institutions completed an associate's degree in the expected two years; 10 percent took three years; and another 9 percent took more than three years. Among those who were always enrolled full time, 11 percent completed an associate's degree in two years. Beginners who were always enrolled part time (about one-fifth of those starting at public 2-year institutions) were unlikely to attain any degree: 2 percent completed associate's degrees in six years. The most traditional students (those with no persistence risk factors) were more likely than nontraditional students with two or more risk factors to complete their programs, both for associate's degrees (35 percent vs. 16 percent) and for bachelor's degrees (24 percent vs. 5 percent)."}, {"section_title": "Bachelor's Degree Completion at 4-Year Institutions After Six Years Institutional Versus Student Completion Rates", "text": "The attainment rates displayed so far reflect the persistence of students anywhere in postsecondary education, and not necessarily their degree attainment at the first institution attended. When 4-year colleges and universities report their graduation rates, they are reporting the percentage of first-time freshmen who completed a bachelor's degree at that institution within l7See compendium table 1.1-A. BEST COPY AVAILABLE' 5 a certain time period.18 Institutions usually do not know what happened to the students who left without a degree. When students leave an institution, they may either leave postsecondary education permanently or transfer somewhere else.19 From the institutional perspective, all of the students who leave before completing a degree at that institution are considered to be dropouts. From the perspectives of the students as well as of the postsecondary education system as a whole, transfers are not dropouts: they are persisting students who have decided to attend a different institution. This section of the report examines the bachelor's degree completion rates after six years for the students who started at 4-year institutions in 1995-96. It compares students' completion rates at the first institution attended (institutional completion rates) with students' completion rates at any 4-year institution (student completion rates). Among all beginners at 4-year institutions in 1995-96,51 percent completed a bachelor's degree within six years at the first institution attended (table 9). However, when those who transferred out of the first institution are also included, the percentage of beginners who actually completed a bachelor's degree within six years (at any 4-year institution) increases to 58 percent. 18lnstitutional completion rates are reported to the U.S. Department of Education in IPEDS and to the NCAA, as well as in an annual ACT survey. See note 4 for more details. 19They may also leave temporarily and return later as \"stopouts.\" These situations present a particular measurement problem that is discussed later."}, {"section_title": "16", "text": "Bachelor's degree completion rates not only differ by whether they reflect the institutional or student perspective, but also by which subcategories of beginning students are being included when calculating the rates. Four-year institutions often report the completion rates only for entering first-time freshmen who were enrolled full time when they began postsecondary education (90 percent of the 1995-96 beginners): this group had an institutional completion rate of 54 percent. As shown earlier, about 10 percent of the beginners at 4-year institutions did not expect to attain a bachelor's degree, sometimes because they were enrolled in associate's degree or certificate programs also offered at the institution. Including only those beginners with a bachelor's degree goal (90 percent), the institutional completion rate was 55 percent. Including only first-time beginners who were enrolled full time when they started and who also had a bachelor's degree goal (83 percent of all beginners), then the bachelor's degree completion rate at the first 4-year institution was 58 percent, and 66 percent for students at any 4-year institution. Sometimes interest centers on recent high school graduates who started college immediately after high school (83 percent of the beginners at 4-year institutions). As shown in table 9, the institutional completion rate for all the beginners at 4-year institutions who were recent high school graduates was 55 percent. If the focus is only on beginners who were recent high school graduates and who also had a bachelor's degree goal (77 percent of the beginners), the bachelor's degree completion rate was 59 percent at the first institution attended, and the comparable completion rate for these students anywhere was 67'percent. Finally, if only firsttime beginners who were recent high school graduates, had a bachelor's degree goal, and also started as full-time students at 4-year institutions are included (73 percent of the beginners), then the six-year completion rate at the first institution attended was 61 percent, and the student , . completion rate anywhere was 69 percent. The bachelor's degree completion rates reported by institutions are lower than the student completion rates because the institutions cannot include those who transferred and completed a bachelor's degree at a different institution. In addition, both the institutional and student completion rates may differ according to which subcategories of beginners are included in the calculations. The institutional completion rates at the first 4-year institution could be stated as any of the following: 51 percent of all beginners; 55 percent of the beginners with a bachelor's degree goal; 55 percent of the beginners who were recent high school graduates; or 61 percent of the beginners who were recent high school graduates, had a bachelor's degree goal, and were enrolled full time the first year. Similarly, the student completion rate for beginners who completed a bachelor's degree anywhere could be stated as 58 percent of all beginners at 4-year institutions; 63 percent of those with a bachelor's degree goal; 64 percent of those who were recent high school graduates; or 69 percent of those who were recent high school graduates, had a bachelor's degree goal, and began as full-time students. That is, of all the recent high school graduates who started full time at any 4-year college or university with a bachelor's degree goal in 1995-96, about two-thirds completed a bachelor's degree within six years. Although any of the subcategories discussed above could have been chosen, the rest of this report focuses on the beginners at 4-year institutions who had a bachelor's degree goal (90 percent of the total). This proportion excludes those who had certificate or associate's degree goals at 4-year institutions and those who had no degree goals, but it includes those who started as part-time students and those who had not started college immediately after finishing high school."}, {"section_title": "Enrollment Status of Beginners With a Bachelor's Degree Goal at the End of Each Year", "text": "The attainment or enrollment status at the end of each of the six academic years for firsttime beginners who had a bachelor's degree goal and started at any 4-year institution in 1995-96 is displayed in figure 3. It presents the student perspective by focusing on the proportion of students who had attained a degree anywhere by the end of that academic year and the proportion who had left postsecondary education by then and had not re-enrolled anywhere else by June 2001. The attrition rates shown at the end of each academic year at the top of each bar are cumulative: in June 1996,3 percent of the beginners were no longer enrolled and had never reenrolled anywhere by 2001; at the end of the second year (June 1997), 6 percent of the beginners were not enrolled anywhere and had never returned (this number includes the 3 percent who left by the end of the first year), and so on. By the end of the sixth year (June 2001), a total of 18 percent had left postsecondary education without a degree and had not returned to any institution. The percentages of stopouts who were not enrolled at any time during that academic year, but who returned in a following year and enrolled at some postsecondary institution, are also shown in figure 3. The percentages presented here are not cumulative because in each year stopouts are reclassified as enrolled or as having attained a degree. Stopouts who were not enrolled at all during the year represented 2 to 4 percent of the students in the second through fifth academic years. Because the survey period ended in June 2001, the percentage of stopouts in the last year cannot be known (because we do not know who might return in some future year); they are included with those who left postsecondary education (permanently, as far as we know). The inability to detect the proportion of stopouts means that the true rate of permanent attrition (leaving without a degree) from postsecondary education will always be somewhat lower than that measured at any particular point in time.  -96 1996-97 1997-98 1998-99 1999- At the end of the fourth year (June 1999), 36 percent of the students had completed a bachelor's degree (including the 2 percent who had already attained a bachelor's degree by the end of the third year). At the end of the fifth year, 57 percent of the beginners at 4-year institutions with initial bachelor's degree goals had attained a bachelor's degree at some 4-year institution, and at the end of the sixth year, 63 percent had done so. The attainment and enrollment outcomes at the end of each academic year for the same students are presented in figure 4, but only at the first 4-year institution attended. From this institutional perspective of retention, beginning students who leave and do not return are counted as dropouts, whether they actually leave postsecondary education from that institution or transfer elsewhere. The cumulative percentage who had left but then transferred to a different institution BEST COPY AVM 19 54 BLE Figure 4.Percentage distribution of students with a bachelor's degree goal who were first-time beginners at a 4-year institution in 1995-96, by institutional retention and degree attainment at the first institution attended, at the end of each academic year through 2000-01  1995-96 1996-97 1997-98 1998-99 1999- was 10 percent by the end of the first year, 18 percent by the end of the second year (including the 10 percent at the end of the first year), 22 percent by the end of the third year, and about 23 percent through the end of the sixth year (because there were few additional transfers in the fifth and sixth years). The cumulative percentage of beginning students who were not enrolled at the first institution at the end of the academic year and had never enrolled anywhere else by June 2001 was 3 percent at the end of the first year, 6 percent at the end of the second year (including the 3 percent at the end of the first year), 9 percent at the end of the third year, and so on. By the end of the sixth academic year (June 2001), 13 percent had left postsecondary education permanently (as far as we know) directly from the first institution, 23 percent had transferred somewhere else and 20 5 5 BEST COPY AVAILABLE therefore could not have completed a bachelor's degree at the first institution, and 55 percent had completed a bachelor's degree at the 4-year college where they had started in 1995-96. The relationship between the rates of institutional attainment and retention and the rates of student attainment and persistence anywhere in postsecondary education are illustrated in figure 5. After six years, 13 percent of the beginners had left postsecondary education directly from the institution where they had started and never re-enrolled elsewhere. Another 23 percent were not retained at the first institution, but had transferred to a different institution. The percentages of  BEST COPY AVAILABLE 21 5 6 students who transferred from the first institution and then either left postsecondary education or continued their studies are represented by the numbers in the arrows that point to their status anywhere in postsecondary education after six years. Six percent had transferred and then left postsecondary education without a degree after attending the transfer institution. Another 5 percent had transferred and were still enrolled without a degree at a different 4-year institution, and 2 percent had transferred and were enrolled without a degree at a less-than-4-year institution. Three percent had transferred and then completed an associate's degree or a certificate at a lessthan-4-year institution. Seven percent, however, had transferred and then completed a bachelor's degree at a different 4-year institution. Bachelor's Degree Completion Rates, Enrollment Patterns, and Student Characteristics This section of the report examines the bachelor's degree completion rates of the 1995-96 beginners at 4-year institutions who had a bachelor's degree goal by student enrollment patterns, academic preparation, and demographic characteristics. It addresses both the institutional rates of completion at the first 4-year institution attended and the student completion rates for the same students at any 4-year institution, which includes the transfers. In addition to presenting the total bachelor's degree attainment rates after six years, this section presents the percentage of beginners who completed a bachelor's degree in the expected four-year period (48 months or less since beginning) and those who took five to six years to finish (49 to 72 months since beginning).20 Institutional Completion Rates at Public and Private Not-for-Profit Institutions By June 2001,34 percent of the 1995-96 beginners with a bachelor's degree goal had completed that degree at their initial institution within four years, and another 21 percent had finished in five to six years, for a total of 55 percent completing a bachelor's degree at the initial institution within six years of starting there (table 10).21 Those who began at a private 20The compendium tables in section 10 show the individual completion rates for four, five, and six years at public and at private not-for-profit institutions. 21These completion rates are based on the number of months between the date of first enrollment and bachelor's degree completion. The four-year rate includes those who completed in 48 months or less after they first enrolled, and the five-to sixyear rate includes those who took more than 48 months to finish. Since some of the 1995-96 beginners did not start until spring 1996, these rates may differ slightly from the bachelor's degree attainment percentages displayed in other tables in this report, which measure the rates of bachelor's degree attainment at the end of the fourth or fifth academic years (as of June 1999 and June 2000, respectively) rather than the percentage of students who completed the degree within 48 or 49-60 months after beginning. Students who started in spring 1996 and completed the degree in 48 months, for example, would have finished during the fifth academic year of this study (1999)(2000).  "}, {"section_title": "59", "text": "BEST COPY AVAILABLE not-for-profit institution were more likely to have completed their bachelor's degree at that institution within six years than those who began at a public institution (65 percent vs. 50 percent) and to have completed in four years (52 percent vs. 24 percent). In both the public and the private not-for-profit sectors, those who began at a doctorategranting university were more likely to have completed their degrees at that institution within six years than those who began at a 4-year college that did not grant doctorates. The completion rates after six years at the first 4-year institution attended were about 40 percent at public colleges that did not have doctoral programs, about 60 percent at public universities that granted doctorates or at private not-for-profit colleges that did not have doctoral programs, and about 70 percent at private not-for-profit doctorate-granting universities.22 At the public 4-year institutions, about one-fourth (24 percent) of the beginners completed a bachelor's degree at their first institution within four years, and another one-fourth (26 percent) took five to six years to finish there. The percentage completing in four years was higher for beginners at public doctorate-granting institutions than for those at public institutions that did not offer doctoral programs (27 percent vs. 19 percent). Beginners at private not-for-profit colleges and universities were more likely than their counterparts at public institutions to complete a bachelor's degree in four years instead of taking longer: about one-half (51 percent) of the beginners at private not-for-profit institutions completed a bachelor's degree at the same institution where they had started in the expected four years, and 14 percent took longer."}, {"section_title": "Student Completion Rates at Any Institution Transfer Status", "text": "The bachelor's degree completion rates of students at any institution include those who transferred out of their initial institution (about one-fourth of the beginners at 4-year institutions) (table 10). The beginners who stayed at their original college or university had higher completion rates than those who transferred to another 4-year institution: 72 percent of those who never transferred had completed a bachelor's degree within six years, compared with 51 percent of those who transferred to a private not-for-profit institution and 45 percent of those who transferred to a public 4-year institution. Transfer students were also less likely to have completed a bachelor's degree in four years than those who never transferred. One reason for the lower completion rates of students who transferred was that about 30 percent of them were also stopouts who delayed before enrolling in the second institution.23"}, {"section_title": "Enrollment Patterns", "text": "Full-time attendance and enrollment continuity were associated with high rates of bachelor's degree completion for students. Among the beginners who were always enrolled full time and those who were continuously enrolled, about three-fourths (73-74 percent) had completed a bachelor's degree at some 4-year institution within six years. By contrast, among those students who had a break in enrollment continuity of more than four months (not continuously enrolled), 20 percent had completed a bachelor's degree by June 2001. The beginners who were always enrolled full time were more likely to complete a bachelor's degree in four years than those with a mixed full-time and part-time enrollment pattern (45 percent vs."}, {"section_title": "percent).24", "text": ""}, {"section_title": "Academic Preparation", "text": "To measure their level of academic preparation before students started college, this analysis used three indicators: the number of Advanced Placement (AP) tests taken; their grade-point average in high school; and their combined SAT I test scores. All of these measures were related to completing a bachelor's degree in the expected four-year period. The students who had taken two or more AP tests, who had mostly A's in high school, or who had high SAT test scores were more likely than those who were less well prepared to complete a bachelor's degree in four years. The better-prepared students completed bachelor's degrees at relatively high rates: more than one-half (55-61 percent) graduated in four years, and about 80 percent graduated within six years.\nThe students who graduated in four years were well prepared when they entered college. More than one-half had received mostly A's in high school (62 percent) and had SAT test scores in the highest quartile among college freshmen (56 percent), and 30 percent had taken two or more AP tests. Those who took longer than four years to complete a bachelor's degree were less likely than those who finished in four years to have had all A's in high school (44 percent), to have had SAT scores in the highest quartile (32 percent), and to have taken two or more AP tests (15 percent). Compared with the graduates who had started at 4-year institutions, those who had transferred from a public 2-year institution were less likely to have had A's in high school (26 percent), to have had high SAT scores (22 percent), and to have taken two or more AP tests (3 percent). "}, {"section_title": "Demographic Characteristics", "text": "Some demographic characteristics of the beginners were also related to differences in their completion rates. Women were more likely than men to have completed a bachelor's degree after six years (66 percent vs. 59 percent) and to finish in four years (41 percent vs. 31 percent). Hispanic and Black, non-Hispanic beginners were less likely to have completed a bachelor's degree by June 2001 (46-47 percent) than White, non-Hispanic or Asian/Pacific Islander beginners (67-71 percent). Completion of a bachelor's degree within six years was also related to 23BPS:96/01 Data Analysis System. Not shown in tables. 24A mixed enrollment pattern includes students who were ever enrolled part time during the six years, even if they were primarily enrolled full time. 26 61 the family income of dependent students when they began: 54 percent of students in the lowest income group completed their degrees, compared with 77 percent of those in the highest income group.\nWomen represented a majority (62 percent) of the college graduates who had started at a 4year institution in 1995-96 and completed a bachelor's degree in four years. There were no detectable differences between men and women among the college graduates who began at 4year institutions and took longer than four years to complete their degrees, or among those who had started at public 2-year institutions. White, non-Hispanic beginners at 4-year institutions represented a higher proportion among those who graduated in four years (80 percent) than among those who took longer (73 percent). White, non-Hispanic students also represented a larger proportion (86 percent) of those receiving a bachelor's degree among the beginners who had started at public 2-year colleges than among those who had started at 4-year institutions (77 percent)."}, {"section_title": "Summary", "text": "In summary, beginners at private not-for-profit colleges and universities had higher bachelor's degree completion rates than those who began at public 4-year institutions and were also more likely to graduate in four years. Regardless of where they had started, students who did not transfer, who were always enrolled full time, or who were continuously enrolled without a break had relatively high six-year completion rates (72-74 percent), and about 45 percent graduated in four years. Students who entered college with good academic preparation had high completion rates. About 80 percent completed a bachelor's degree within six years, and more than one-half (55-61 percent) graduated in four years. Women had higher completion rates than men and were more likely to finish in four years. Hispanic and Black, non-Hispanic students had lower completion rates than Asian/Pacific Islander or White, non-Hispanic students, and low-income dependent students had lower completion rates than high-income dependent students. Finally, traditional students with no risk factors (who entered college immediately after high school, enrolled full time, and were dependent on their parents for support) had higher bachelor's degree completion rates (71 percent within six years) than nontraditional students, who started college with one or more risk factors."}, {"section_title": "Profile of the 1995-96 Beginners Who Had Completed a Bachelor's Degree and Graduated by June 2001", "text": "This section provides a profile of the 1995-96 beginning students who had completed a bachelor's degree by June 2001 and a comparison of the characteristics of graduates who began at a 4-year college or university and completed a bachelor's degree in four years with the characteristics of their counterparts who took longer to finish. It also compares the characteristics of college graduates who started at a 4-year institution with those of graduates who transferred to a 4-year institution from a community college."}, {"section_title": "Institution Type", "text": "Among those who completed a bachelor's degree in the expected four-year period, about one-half (54 percent) received their degrees at a private not-for-profit 4-year institution, and most (93 percent) had never left their original institution (table 11). Among those who took longer than four years to complete a bachelor's degree, about three-fourths (77 percent) had graduated from a public institution and about one-fifth (21 percent) had transferred from a 4-year institution. Eighty percent of the transfers from public 2-year institutions who completed a bachelor's degree within six years graduated from a public 4-year institution, reflecting the predominant transfer pattern from public 2-year institutions noted earlier."}, {"section_title": "Family Income", "text": "Dependent students who were from high-income families when they began college (parental income of $70,000 or more in 1994) represented about one-third of the college graduates, both among those who had started at a 4-year institution and among those who had started at a community college (33-37 percent). Low-income dependent students (parental income under $25,000 in 1994) represented a smaller proportion of college graduates who had started at a 4-year institution (17 percent) than did high-income students (37 percent). No difference could be detected in the proportion of low-income students among college graduates who had started at a public 2-year institution and among those who had started at a 4-year institution. Dependent students from lower middle-income families (parental income of $25,000 $44,999 in 1994) were the only income group that made up a larger proportion of college graduates among those who had started at community colleges than among those who had started at 4-year colleges (30 percent vs. 19 percent)."}, {"section_title": "All Beginning Students", "text": "Since these tables include all beginning students at any type of institution and in any type of program, the last column for no degree, not enrolled anywhere in June 2001 is of particular interest. This category is the percentage of students who had left postsecondary education without completing any degree anywhere by June 2001, and therefore represents the rate of postsecondary attrition after six years (although some stopouts may return in the future after the end of this study period).\nBeginning students who enrolled initially in a private not-for-profit 4-year institution in 1995-96 were more likely than those who started in a public 4-year institution to have attained a bachelor's degree at that institution by June 2001 (61 percent compared with 46 percent). Among all students who began postsecondary education in 1995-96, those who started in an associate's degree program were more likely to have transferred and more likely to have left postsecondary education from the first institution than those who were in a bachelor's degree program at a 4-year institution. Table 3.0-B: Enrollment patterns Among students who left the first institution by the end of their first year in postsecondary education (in 1995-96), 45 percent transferred to another institution and another 46 percent left postsecondary education directly from the first institution. Beginning students who had two separate enrollment spells at the first institution (stopouts) were more likely to still be enrolled without a degree at that institution than those who were continuously enrolled at the first institution (24 percent vs. 2 percent). Among all 1995-96 beginning students, those whose GPA was under 2.25 at the end of the first year were more likely to have left postsecondary education permanently from the first institution than those who had higher first-year grades (42 percent compared with 21-22 percent). Table 3.0-C: Demographic characteristics Those students who worked while enrolled during the first year and considered themselves to be primarily students were more likely to transfer than either students who did not work or those who considered themselves to be primarily employees (32 percent compared with 19-24 percent). High-income dependent students (parental income of $70,000 or more in 1994) were less likely to leave postsecondary education permanently from the first institution attended than those in the lower income groups (12 percent compared with 21-27 percent).\nAmong 1995-96 beginning postsecondary students, those who started at 4-year institutions were less likely than those who began at either 2-year or at less-than-2-year institutions to have left without a degree during the first year (5 percent vs. 17-21 percent). No significant difference was detected in the first year departure rates of students beginning at the latter two types of institutions. Students who had either no degree goal or a certificate goal were more likely to leave without a degree in the first year than those with an associate's degree goal (22-33 115 i 4 9 percent vs. 11 percent). Beginners with a bachelor's degree goal when they first started in 1995-96 were less likely to leave during the first year than any of the others (5 percent). Table 5.0-B: Enrollment patterns About one-half (46 percent) of all beginning students who were always enrolled part time left postsecondary education by the end of their first year, and 14 percent had attained any degree by June 2001. Among students who were always enrolled full time, 12 percent left by the end of the first year, and 64 percent had attained a degree by June 2001. About one-fifth (18 percent) of all beginning students who never transferred from their original institution left postsecondary education without completing a degree by the end of their first year, about one-half (51 percent) had attained a degree by 2001, and 9 percent were still enrolled without a degree in 2001. Among students who transferred, about one-fourth (24-28 percent) were still enrolled without a degree in 2001. Students who were continuously enrolled after they started postsecondary education in 1995-96 were more likely than those with two or more enrollment spells to have attained a degree by 2001 (58 percent vs. 29-35 percent). Table 5.0-C: Demographic characteristics Among 1995-96 beginning postsecondary education students, those who were 18 or younger at the time of initial enrollment were less likely than any other age group to have left without a degree in the first year (6 percent compared with 11-30 percent). Beginning students who considered themselves to be primarily employees rather than students were more likely to leave postsecondary education without a degree by the end of their first year than either those who did not work while enrolled or those who worked but considered themselves to be primarily students (28 percent vs. 7-10 percent)."}, {"section_title": "Table 2.0-A: Degree programs", "text": "Students who began postsecondary education in certificate or associate's degree programs were more likely to have left postsecondary education without having completed any degree program (43 percent of each) by June 2001 than those who began in bachelor's degree programs (19 percent). Of the beginners who had attained an associate's degree, about one-fifth (19 percent) went on to complete a bachelor's degree within six years of starting postsecondary education. Table 2.0-B: Enrollment pattern and first year GPA Among students who began their postsecondary education in 1995-96, those who were always enrolled part time were more likely to have left postsecondary education by June 2001 without having completed any degree (74 percent) than those who were always full-time students (28 percent). Beginning students with a low grade-point average (below 2.25) at the end of the first year enrolled in postsecondary education were more likely to have left without a degree by 2001 (52 percent) than those whose first-year grade-point average was higher. Table 2.0-C: Student demographics About one-third (35 percent) of both men and women had left postsecondary education without attaining a degree and had not returned by June 2001. Students who were 18 years old or younger when they began postsecondary education in 1995-96 were the least likely (26 percent) to have left postsecondary education without a degree by June of 2001, compared with students who began postsecondary education when they were 19 years old or older. Black, non-Hispanic students were more likely than White, non-Hispanic or Asian/Pacific Islander students to have left postsecondary education without return by 2001 (45 percent compared with 33 and 26 percent, respectively). No difference could be detected in the six-year attrition rates of any other groups by race/ethnicity. Beginners whose parents had advanced degrees were less likely to leave postsecondary education without any degree within six years than those whose parents only had bachelor's degree (17 percent compared with 25 percent). In general, students whose parents had bachelor's degrees or higher were less likely to leave postsecondary education without any degree than those whose parents had no college degrees. Among dependent students who began postsecondary education in 1995-96, attrition without a degree was higher among low-income students (whose parents' income was less than $25,000 in 1994) than among high-income students (whose parents' income was $70,000 or more in 1994). Among low-income dependent beginners, 35 percent had not attained a degree and were no longer enrolled in June of 2001, compared with 20 percent of high-income dependent beginners."}, {"section_title": "Table 2.0-D: Persistence risk factors", "text": "Among all students who began postsecondary education in 1995-96, those who had no persistence risk factors were least likely to leave postsecondary education without any degree by June 2001 (20 percent). The rate of attrition increased as the number of persistence risk factors increased from none to two or three (37 percent had one and 47 percent had two or three risk factors). The rates of attrition without a degree were higher for beginners who had delayed entry after high school compared with those who did not delay (46 percent vs. 27 percent), for those who were enrolled part time when they started compared with those who were enrolled full time (50 percent vs. 28 percent), for those who were independent compared with those who were dependent of their parents financially (49 percent vs. 29 percent), and for those who had children when they started compared with those with no children (50 percent vs. 31 percent). Beginners who worked full time while enrolled their first year had higher rates of attrition by 2001 (52 percent) than both students who did not work and those who had worked part time during their first year enrolled. There was no difference detected in the rate of attrition without a degree between students who did not work and those who worked part time."}, {"section_title": "Public 2-Year Institutions", "text": "Because of the relatively small size of the sample of beginners at public 2-year institutions, the standard errors of the estimates are quite large. Often where there appear to be differences among categories in the following tables, no differences can be detected when applying tests of statistical significance."}, {"section_title": "Table 2.1-A: Degree goals and programs", "text": "Among the beginners at public 2-year institutions who had a bachelor's degree goal in 1995-96,23 percent had transferred to a 4-year institution and attained a bachelor's degree by June 2001. No difference could be detected between those beginners at public 2-year institutions who were in associate's degree programs in applied fields and those who were in liberal arts (or undeclared) programs in the percentage who attained bachelor's degrees or the percentage whose highest degree was an associate's degree."}, {"section_title": "Table 2.1-B: Enrollment patterns and transfers", "text": "One-fifth (20 percent) of the 1995-96 beginners at public 2-year institutions who were always enrolled full time attained a bachelor's degree, compared with 10 percent of those who had a mixed enrollment pattern (those who had been enrolled both full time and part time). About one-fourth (24 percent) of the beginners at public 2-year institutions who had been co-enrolled at two institutions attained a bachelor's degree by June 2001. Among students who began at public 2-year institutions and transferred upward to a 4year institution, 38 percent had completed a bachelor's degree by June 2001 and 24 percent were still enrolled at a 4-year institution without having completed either an 49 83 associate's or a bachelor's degree. Sixteen percent of these students were no longer enrolled and had attained no degree by June 2001. Table 2.1-C: Demographic characteristics Beginners at public 2-year institutions who had a parent with an advanced degree were more likely to go on to complete a bachelor's degree than those whose parents were not college graduates (28 percent compared with 7-8 percent)."}, {"section_title": "Table 2.1-D: Persistence risk factors", "text": "Students who began at public 2-year institutions in 1995-96 without any persistence risk factors present were the least likely to have left postsecondary education without a degree after six years (29 percent). No difference could be detected in the rates of attrition among those who had one or more than one risk factor. The rate of attrition of students enrolled full time when they started at a public 2-year institution in 1995-96 was lower than attrition among those who were enrolled part time during the first year (40 percent vs. 53 percent). Similarly, students who did not delay entry after high school were less likely to have left postsecondary education without a degree by June 2001 than those who delayed entry (40 vs. 54 percent). Public 4-Year Institutions Table 2.2-A: Institution type and academic preparation Students who started at public 4-year doctorate-granting institutions were more likely than those who started at public 4-year non-doctorate-granting institutions to have attained a bachelor's degree at some institution (not necessarily the first one) by June 2001 (59 percent compared with 43 percent). Among public 4-year beginners in 1995-96, those who had taken one or more Advanced Placement tests were more likely to have attained a bachelor's degree by 2001 than those who had not taken any (67-77 percent vs. 48 percent). Students who began at public 4-year institutions whose SAT combined scores fell into the lowest quartile (a score between 400-700) were the least likely to have attained a bachelor's degree by 2001 compared with students who scored higher (29 percent vs. 54-72 percent). Beginners at public 4-year institutions whose grade-point averages in high school were between a B+ and A-or were mostly A's were more likely than those whose gradepoint averages were B or below to have attained a bachelor's degree by 2001 (57-77 percent vs. 36 percent, respectively)."}, {"section_title": "Table 2.2-B: Enrollment patterns", "text": "Students who began at public 4-year institutions and were always enrolled full time were more likely than those whose enrollment intensity was mixed to have attained a bachelor's degree within six years (65 percent compared with 37 percent). Of the beginners who were always enrolled part time 81 percent had left postsecondary education without completing a degree program by June 2001. As of June 2001, beginning students who had mixed part time and full time enrollment were more likely to still be enrolled in a 4-year institution without a degree than those who were either always enrolled full time or always enrolled part time (24 percent compared with 9-11 percent). Among 1995-96 beginning students who first attended public 4-year institutions, those who did not transfer were more likely to have attained a bachelor's degree by June 2001 than those whose first transfer was a lateral transfer to another 4-year institution (62 percent compared with 45 percent). Students whose first transfer was a lateral transfer were more likely to still be enrolled in a 4-year institution without a degree than those who did not transfer (33 percent compared with 11 percent). Students who began at public 4-year institutions in 1995-96 who were continuously enrolled were more likely to have attained a bachelor's degree by June 2001 (65 percent) than stopouts who had two or more spells of enrollment (19 and 4 percent). Among 1995-96 public 4-year beginners, those with higher grade-point averages during their first year of enrollment were more likely to have attained a bachelor's degree by June 2001 than those with lower GPA's in the first year."}, {"section_title": "Table 2.2-C: Demographic characteristics", "text": "Women who began at public 4-year institutions were more likely than their male counterparts to have attained a bachelor's degree by June 2001 (56 percent vs. 50 percent). Students who were 18 years old or younger (traditional age) when they were first enrolled in a public 4-year institution were more likely to have attained a bachelor's degree within 6 years (59 percent) than those who were 19 years old or older: 45 percent of students who began at age 19,18-20 percent of 20-to 29-year-old beginners, and 9 percent of beginners aged 30 or older earned a bachelor's degree by June 2001. Among 1995-96 beginning students who first attended a public 4-year institution, White, non-Hispanic students and Asian/Pacific Islander students were more likely than Black, non-Hispanic students and Hispanic students to have attained a bachelor's degree by 2001. No differences were observed in bachelor's degree attainment rates between White, non-Hispanic students and Asian/Pacific Islander students or between Black, non-Hispanic students and Hispanic students. Beginners at public 4-year institutions whose parents had a bachelor's degree or higher were more likely to have attained a bachelor's degree (62-67 percent) than those whose parents had less than a bachelor's degree (39-48 percent). Financially dependent students who began at a public 4-year institution and whose parents earned $45,000 or more in 1994 were more likely to have attained a bachelor's degree by June 2001 (58-67 percent) than those whose parents earned less than $45,000 (48-50 percent)."}, {"section_title": "Table 2.2-D: Persistence risk factors", "text": "Students who began at public 4-year institutions with no persistence risk factors were more likely to have attained a bachelor's degree by June 2001 (62 percent) than those who had one or more risk factors. Students who had only one risk factor were more likely to have attained a bachelor's degree by June 2001 (42 percent) than those who had two or more risk factors (11-14 percent). Among 1995-96 beginning students who first attended a public 4-year institution, those who delayed enrollment after high school were less likely than those who did not delay to have attained a bachelor's degree by June 2001 (30 percent compared with 58 percent). Students who began their postsecondary education in 1995-96 at a public 4-year institution and enrolled full time were more likely than those who were enrolled part time to have attained a bachelor's degree by 2001 (57 percent compared with 28 percent). Among beginners at public 4-year institutions, those who did not work while enrolled in 1995-96 were more likely than those who did work to have attained a bachelor's degree by June 2001 (61 percent vs. 29-52 percent). Students who worked part time were more likely than those who worked full time to have attained a bachelor's degree by 2001 (52 percent compared with 29 percent). Private Not-for-Profit 4-Year Institutions Table 2.3-A: Institution type and academic preparation Among students who began in 1995-96 at a private not-for-profit 4-year institution, those who started at doctorate-granting institutions were more likely than those who started at non-doctorate-granting institutions to have attained a bachelor's degree by June 2001 (77 percent compared with 65 percent), although not necessarily at the institution where they started. Students who began at private not-for-profit 4-year institutions and had taken more than one Advanced Placement tests were more likely than those who took one and those who did not take any AP tests to have completed a bachelor's degree by 2001: 86 percent of students who took more than one AP test had attained a degree within six years, compared with 78 percent of those who took one and 63 percent of students who did not take AP tests. The likelihood of attaining a bachelor's degree within six years among private not-forprofit 4-year beginners was related to SAT combined scores. Students whose SAT scores fell into the middle quartiles were more likely than those who scored in the low quartile to have completed a bachelor's degree (66 percent of middle and 44 percent of low-quartile scorers attained by June 2001), and students who scored in the high quartile (86 percent) were more likely to have attained within 6 years than students with middle-or low-quartile SAT scores. Private not-for-profit 4-year beginners who earned mostly A's in high school were more likely than students whose grades were lower to have attained a bachelor's degree within 6 years (85 percent compared with 54-74 percent, respectively)."}, {"section_title": "Table 2.3-B: Enrollment patterns", "text": "Among private not-for-profit 4-year beginners, those who were always enrolled full time were more likely than those whose enrollment intensity was mixed to have attained a bachelor's degree by 2001 (77 percent compared with 53 percent). Private not-for-profit 4-year beginners who did not transfer were more likely to have attained a bachelor's degree by June 2001 than those whose first transfer was a lateral transfer to another 4-year institution (80 percent vs. 45 percent). Students whose first transfer was a lateral transfer were more likely to still be enrolled in a 4-year institution without a degree than those who did not transfer (21 percent vs. 4 percent). Among 1995-96 beginning students who first attended a private not-for-profit 4-year institution, those who had been continuously enrolled were more likely than stopouts who had two or more spells of enrollment to have attained a bachelor's degree by June 2001 (78 percent vs. 13-30 percent). Beginning students who first attended a private not-for-profit 4-year institution and whose grade-point average during their first year of enrollment was above 3.25 were less likely to have left postsecondary education without a degree (9 percent) than those whose grade-point averages were below 3.25 (14-38 percent). Beginning students who first attended a private not-for-profit 4-year institution but transferred and last attended a public 4-year institution were more likely to still be enrolled without a degree as of June 2001 (24 percent) than those who last attended a private not-for-profit 4-year institution."}, {"section_title": "Table 2.3-C: Demographic characteristics", "text": "Students who were 18 years old or younger when they enrolled in a private not-forprofit 4-year institution in 1995-96 were more likely than those who were 19 years old to have attained a bachelor's degree (74 percent compared with 56 percent). Students 53   8iwho were 19 years old were more likely than those who were between 20 and 23 years old to have attained a bachelor's degree within six years. White, non-Hispanic students and Asian/Pacific Islander students who began at 4-year private not-for-profit institutions were more likely than their Black, non-Hispanic and Hispanic peers to have attained a bachelor's degree by June 2001. No difference could be detected in the bachelor's degree attainment rates of White, non-Hispanic students and Asian/Pacific Islander students or between Black, non-Hispanic students and Hispanic. Among 1995-96 beginning dependent students who first attended a private not-forprofit 4-year institution, those whose parents earned less than $25,000 in 1994 were less likely than those whose parents earned $70,000 or more to have attained a bachelor's degree within 6 years (56 percent vs. 83 percent)."}, {"section_title": "Table 2.3-D: Persistence risk factors", "text": "Among private not-for-profit 4-year beginners in 1995-96, those who had no risk factors when first enrolled were more likely to have attained a bachelor's degree by June 2001 (76 percent) than those who had one or more risk factors. Students who had only one persistence risk factor were more likely than those who had two or more to have attained a bachelor's degree by 2001 (52 percent compared with 21-33 percent). Private not-for-profit 4-year beginners who delayed enrollment after high school were less likely to have attained a bachelor's degree than those who did not delay (39 percent vs. 74 percent). Among 1995-96 beginning students who first attended a private not-for-profit 4-year institution, those who worked full time while enrolled were less likely than those who did not work or only worked part time to have attained a bachelor's degree by June 2001. No difference could be detected in the bachelor's degree attainment rates between students who did not work and those who worked part time while enrolled.  "}, {"section_title": "58", "text": "' 2        "}, {"section_title": "67", "text": "x.01   The tables in section 3 display the attainment and enrollment outcomes after six years at the first institution attended. The tables show the percentage of beginning students who attained a bachelor's degree, an associate's degree or a certificate at that institution. These are the institutional degree completion rates after six years. The tables also show the percentage of beginning students who had attained no degree at the first institution, but were still enrolled there after six years (including stopouts who had left and then returned), the percentage who had left postsecondary education from the first institution and had never enrolled anywhere else by June 2001, and the percentage who transferred out of the first institution before attaining any degree and then enrolled at a different institution. Priority is given to the highest degree attained at the first institution, and there is no separate category for those who attained a sub-baccalaureate degree at the first institution and then transferred. From the institutional perspective of retention at that institution, both those who transferred without a degree and those who left postsecondary education before degree completion were not retained. Persistence from the student perspective, which includes what happened to those who transferred, is displayed in the tables in section 2. Since two-thirds of the beginners did not transfer, many of the patterns in this section are the same as in section 2, but the attainment rates at the first institution will almost always be lower than the attainment rates of the students anywhere. Table 3.0-A: First institutions and programs By June 2001, about one-fourth (26 percent) of all 1995-96 beginning postsecondary students had transferred from their first institution before attaining a degree."}, {"section_title": "Table 3.0-D: Persistence risk factors", "text": "Among all 1995-96 beginning students, those who had delayed entry after high school were more likely to leave postsecondary education permanently from the first institution attended than those who enrolled immediately after high school (41 percent vs. 20 percent). Public 2-Year Institutions Table 3.1-A: Degree Goals and Programs About one-half (52 percent) of the beginners at public 2-year institutions who had a bachelor's degree goal transferred to another institution, and about one-quarter (29 percent) left postsecondary education directly from the first institution they attended. Among 1995-96 students beginning at public 2-year institutions, no difference could be detected in the proportion of those in associate's degree programs who transferred compared with the proportion who left postsecondary education from the first institution by June 2001. Table 3.1-B: Enrollment patterns Of the students who began at a public 2-year institution in 1995-96 and also left that institution after the first year, 42 percent had transferred to a different institution. Table 3.1-C: Demographic characteristics Among students who began postsecondary education at public 2-year institutions in 1995-96, men were more likely than women to transfer from the first institution (37 vs. 27 percent), and men were less likely than women to leave postsecondary education directly from the first institution (35 percent vs. 43 percent). Beginning students at public 2-year institutions who worked while enrolled and considered themselves to be primarily employees were more likely to leave postsecondary education without a degree directly from the first institution than those who considered themselves to be working students (51 percent compared with 31 percent). Among 1995-96 beginners at public 2-year institutions, high-income dependent students (whose parents' income was $70,000 or more in 1994) were more likely to transfer than those whose income was less than $45,000 (54 percent compared with 32-35 percent)."}, {"section_title": "Table 3.1-D: Persistence risk factors", "text": "Among 1995-96 beginning students at public 2-year institutions, those without any risk factors when they began were less likely to leave postsecondary education from the first institution than those who had one or more risk factors and more likely to transfer than those who had two or more risk factors. Public 4-Year Institutions Table 3."}, {"section_title": "2-A: Institution type and goals", "text": "Among 1995-96 beginning students who first attended a public 4-year institution, those who attended doctorate-granting institutions were more likely than those who attended non-doctorate-granting institutions to attain a bachelor's degree at that institution (52 percent compared with 35 percent)."}, {"section_title": "1 0 7", "text": "Students who started at a public non-doctorate-granting institution were more likely to transfer from that institution (30 percent) than students who began at a doctorategranting institution (24 percent). Those students who began postsecondary education in 1995-96 at a public 4-year institution without a specific degree goal were more likely than those who had a degree goal to transfer from the first institution (64 percent compared with 15-24 percent). Beginning students at public 4-year institutions whose SAT combined scores fell into the lowest quartile (a score between 400-700) were less likely than those whose scores fell into the middle or highest quartiles (a score between 710-1600) to have attained a bachelor's degree at the first institution (25 percent vs. 45-65 percent). Table 3.2-B: Enrollment patterns at the first institution Those students who were enrolled full time during their first enrollment spell at the public 4-year institution where they began were more likely than those whose enrollment intensity was mixed to have attained a bachelor's degree at the first institution (51 percent vs. 34 percent). Students who began at a public 4-year institution in 1995-96 and were also last enrolled in that institution during the 1995-96 academic year (that is, students who left during the first year) were more likely to have transferred elsewhere (71 percent) than to have left postsecondary education permanently (28 percent). Students who were last enrolled during the 1996-97 academic year (who left during the second year) were also more likely to have transferred elsewhere (63 percent) than to have left postsecondary education permanently (28 percent). Among 1995-96 beginning students who first attended a public 4-year institution, those whose grade-point average at the end of their first year was below 2.25 were more likely than those whose grade-point average was above 2.25 to have transferred from the first institution without earning a degree (39 percent vs. 22 and 19 percent). Those whose grade-point average during the first year was below 2.25 were also more likely than those whose grade-point average was above 2.25 to have left postsecondary education permanently from the first institution (29 percent vs. 12 and 9 percent)."}, {"section_title": "Table 3.2-C: Demographic characteristics", "text": "Among 1995-96 beginning students who first attended a public 4-year institution, women were more likely than men to have attained a bachelor's degree at the first institution (48 percent compared with 43 percent). However, no difference could be detected between men and women in the percentage who transferred without a degree from the first institution. Among public 4-year beginners, those whose parents had no more than a high school degree were more likely than those whose parents attained a bachelor's degree or an 74 advanced degree to have left postsecondary education directly from the first institution (27 percent compared with 10 percent). Public 4-year dependent beginners whose parents earned $70,000 or more in 1994 were more likely than those whose parents earned less than $70,000 to have attained a bachelor's degree at the first institution (58 percent compared with 41-49 percent)."}, {"section_title": "Table 3.2-D: Persistence risk factors", "text": "Those public 4-year beginners who delayed enrollment after high school were less likely than those who did not delay to have attained a bachelor's degree at the first institution; about one-quarter of those who delayed (27 percent) compared with about one-half (50 percent) of those who did not delay enrollment attained their bachelor's degrees at the first institution. Students who began at public 4-year institutions who did not work while enrolled in the first year were more likely than those who worked part time to have attained a bachelor's degree at the first institution (52 percent compared with 45 percent). Students who worked part time were more likely than those who worked full time during the first year to have attained a bachelor's degree from the first institution (45 percent compared with 24 percent). No difference could be detected in transfer rates among students by how much they worked while enrolled. Private Not-for-Profit 4-Year Institutions Table 3.3-A: Institution type and academic preparation Among 1995-96 beginning students who first attended a private not-for-profit 4-year institution, those who started at doctorate-granting institutions were more likely than those who started at non-doctorate-granting institutions to have attained a bachelor's degree at that first institution (68 percent compared with 57 percent). Private not-for-profit 4-year beginners who first attended non-doctorate-granting institutions were more likely than those who first attended doctorate-granting institutions to transfer without a degree from the first institution (26 percent vs. 19 percent). Those students who began at private not-for-profit 4-year institutions who took any Advanced Placement tests were more likely to have attained a bachelor's degree at the first institution than those who had not taken any Advanced Placement tests (55 percent). No difference could be detected in the bachelor's degree attainment rates at the first institution between students who took one AP test and those who took more than one. Among 1995-96 beginning students who first attended a private not-for-profit 4-year institution, those who scored in the highest quartile (a score between 1030-1600 on the 75 109 SAT) were more likely than those who scored in the middle or low quartiles to have attained a bachelor's degree at the first institution (77 percent vs. 41-57 percent). Beginners at private not-for-profit 4-year institutions whose grade-point averages in high school were above a B+ were more likely than those whose grade-point averages were B or below to have attained a bachelor's degree at the first institution (64-77 percent vs. 46 percent)."}, {"section_title": "Table 3.3-B: Enrollment patterns", "text": "Beginning students in 1995-96 who first attended a private not-for-profit 4-year institution and were also last enrolled in that institution during the 1995-96 academic year (their first year at the institution) were more likely to have transferred elsewhere than to have left postsecondary education (74 percent vs. 25 percent). Students who were last enrolled in the first institution during the 1996-97 academic year (their second year at the institution) were also more likely to have transferred elsewhere than to have left postsecondary education (72 percent vs. 24 percent). Among 1995-96 beginning students who first attended a private not-for-profit 4-year institution, those whose grade-point average during the first year of enrollment was between 2.25 and 3.25 were more likely than those whose grade-point average was below 2.25 to have attained a bachelor's degree at the first institution (64 percent vs. 30 percent). However, students with the highest GPA in their first year of enrollment (over 3.25) were the most likely to have attained a bachelor's degree from the first institution (76 percent)."}, {"section_title": "Table 3.3-C: Demographic characteristics", "text": "Among students who began at private not-for-profit 4-year institutions, White, non-Hispanic students and Asian/Pacific Islander students were more likely than Black, non-Hispanic students and Hispanic students to have attained a bachelor's degree at the first institution. No differences could be detected between the bachelor's degree attainment rates of White, non-Hispanic students and Asian/Pacific Islander students or between Black, non-Hispanic students and Hispanic students. Among 1995-96 beginning students who first attended a private not-for-profit 4-year institution, students who worked during the first year and considered themselves to be primarily employees were less likely to have attained a bachelor's degree from the first institution than those who did not work or considered themselves to be primarily students (33 percent compared with 61-66 percent)."}, {"section_title": "Table 3.3-D: Persistence risk factors", "text": "Those students who began at private not-for-profit 4-year institutions who delayed enrollment after high school were less likely than those who did not delay to have attained a bachelor's degree at the first institution (37 percent vs. 65 percent).                The tables in section 4 display the degree attainment or enrollment outcomes after six years by degree goals for 1995-96 beginning students. The tables are separated by those whose goals were either to complete a certificate (tables 4.1-A through D), an associate's degree (tables 4.2-A through D), or a bachelor's degree (tables 4.3-A through D). There is an additional set of tables (4.4-A through D) limited to those with a bachelor's degree goal in 1995-96 who were also recent high school graduates who entered college without any delay. Table 1.0 in the earlier section shows that most of the beginners in certificate programs started either in public 2-year (38 percent) or in private for-profit less-than-2-year institutions (39 percent) and most of those in associate's degree programs started in public 2-year institutions (89 percent), but initial degree goals were not necessarily limited to the degrees offered in these programs. About three-fourths of those with a bachelor's degree goal started at a 4-year institution and about one-fourth started at a public 2-year institution. The latter were in associate's degree programs but expected to transfer and complete a bachelor's degree at a 4-year institution. The distribution of the students with these degree goals within each type of first institution is shown in table 1.1-A. There is a more detailed discussion of the relationship of initial degree goals and degree programs among beginners starting at less-than-4-year institutions in the descriptive report of the three-year follow-up of the 1995-96 beginning postsecondary students in 1998 (Berkner, Horn, and Clune 2000). Because of the small sample sizes for students beginning with a certificate or an associate's degree goal, the standard errors of the estimates are often large. What may appear to be significant differences among categories in the tables for students with certificate or associate's degree goals often cannot be detected when tests of statistical significance are applied."}, {"section_title": "Beginners With a Certificate Goal Table 4.1-A: First institution", "text": "Among 1995-96 beginning postsecondary students who had a certificate goal, those who first attended less-than-2-year institutions were more likely than those who 93 .127 attended 2-year institutions to attain a certificate within six years (67 percent compared with 38 percent). However, 6 percent of the beginners at 2-year institutions who had a certificate goal attained an associate's degree. In this table the highest degree a student attained is given precedence if the student earned more than one degree. The rate of attrition without completing a program among students who began with a certificate goal was higher for those who started at 2-year institutions than for those who started at less-than-2-year institutions (48 percent vs. 29 percent)."}, {"section_title": "Table 4.1-B: Enrollment patterns", "text": "Students who began with a certificate goal who were always enrolled full time were more likely to attain a certificate than those who were always enrolled part time (61 percent vs. 29 percent)."}, {"section_title": "Table 4.1-C: Demographic characteristics", "text": "Among 1995-96 beginning postsecondary students who had a certificate goal, 63 percent of those who did not work while enrolled attained a certificate. About one-half of those who worked while enrolled attained a certificate: 49 percent of those who considered themselves to be primarily students and 42 percent of those who considered themselves to be primarily employees."}, {"section_title": "Table 4.1-D: Persistence risk factors", "text": "The following two persistence risk factors had a negative effect on the certificate attainment of beginners with a certificate goal: part-time attendance when first enrolled (37 percent attained certificates vs. 62 percent of those enrolled full time) and working full time the first year (46 percent attained a certificate vs. 63 percent of those who did not work). Single parents with a certificate goal were more likely to complete a certificate program than those beginners who were not single parents (63 percent vs. 50 percent). However, 5 percent of those who were not single parents attained an associate's degree while none of the single parents with a certificate goal attained any degree higher than a certificate. No difference could be detected in the rate of attrition (no degree, not enrolled anywhere) between single parents and those who were not single parents. No differences were detected in certificate attainment rates among students who entered with a certificate goal in terms of the number of persistence risk factors present when they first enrolled."}, {"section_title": "I 8", "text": "Beginners With an Associate's Degree Goal Among those beginners with an associate's degree goal who actually attained an associate's degree, 18 percent went on to complete a bachelor's degree by June 2001."}, {"section_title": "Table 4.2-B: Enrollment patterns", "text": "Those students who began with an associate's degree goal who were always enrolled part time had a 71 percent rate of attrition (no degree, not enrolled anywhere after six years), compared with the 38 percent attrition rate of those who were always enrolled full time or had a mixed enrollment pattern. Among the beginning students with an associate's degree goal who transferred upward to a 4-year institution, one-third (32 percent) had attained a bachelor's degree. Another 29 percent had attained an associate's degree, and 25 percent were still enrolled at a 4year institution without any degree in June 2001. Eleven percent of these transfers were not enrolled anywhere and had attained no degree after six years."}, {"section_title": "Table 4.2-C: Demographic characteristics", "text": "Those students who were 18 years or younger when first enrolled with an associate's degree goal were more likely to have attained a bachelor's degree (15 percent) after six years than any older age group."}, {"section_title": "Table 4.2-D: Persistence risk factors", "text": "Among 1995-96 beginning postsecondary students who had an associate's degree goal and no persistence risk factors were present, 36 percent attained an associate's degree and another 19 percent attained a bachelor's degree by June 2001. The rate of attrition after six years (no degree, not enrolled anywhere) was 24 percent among those with no risk factors when they began, while about half (51-52 percent) of those who had one or more risk factors were no longer enrolled and had not attained any degree. Students who entered postsecondary education directly from high school (with no delay) with an associate's degree goal were more likely to have attained an associate's degree (28 percent) or a bachelor's degree (13 percent) than those who delayed (19 and 3 percent, respectively). However, those who delayed postsecondary enrollment were more likely to have completed a certificate than those who did not delay (13 percent vs. 5 percent)."}, {"section_title": "95", "text": "Students with an associate's degree goal who were enrolled part time when they began postsecondary education had a higher rate of attrition than those enrolled full time when they started (53 percent with no degree, not enrolled anywhere in June 2001, compared with 37 percent of those enrolled full time the first year). Among students who began in 1995-96 with the goal of attaining an associate's degree, those who were financially dependent on their parents were more likely than independent students to attain an associate's degree (27 percent vs. 19 percent)."}, {"section_title": "All Beginners With a Bachelor's Degree Goal Table 4.3-A: First institution", "text": "Among all 1995-96 beginning postsecondary students who had a bachelor's degree goal, those who started at a 4-year institution were more likely to have attained a bachelor's degree by June 2001 than those who started at a 2-year institution (63 percent vs. 23 percent)."}, {"section_title": "Table 4.3-B: Enrollment patterns", "text": "Among all students who began in 1995-96 with a bachelor's degree goal, those who were always enrolled full time were more likely to have attained a bachelor's degree in six years than those who had a mixed attendance pattern (68 percent vs. 36 percent). Students with a bachelor's degree goal who were enrolled continuously were more likely to have attained a bachelor's degree within six years than stopouts who had two or more enrollment spells (65 percent vs. 5-18 percent)."}, {"section_title": "Table 4.3-C: Demographic characteristics", "text": "Among 1995-96 beginning postsecondary students who had a bachelor's degree goal, women were more likely than men to have attained a bachelor's degree after six years (58 percent vs. 48 percent). White, non-Hispanic and Asian/Pacific Islander students who enrolled in postsecondary education with the goal of attaining a bachelor's degree were more likely than their Black, non-Hispanic and Hispanic peers to have attained a bachelor's degree after six years. No differences could be detected between the bachelor's degree attainment rates of White, non-Hispanic students and Asian/Pacific Islander students or between Black, non-Hispanic students and Hispanic students. Among dependent students whose goal was a bachelor's degree, those whose parents had an income of $45,000 or more in 1994 were more likely to have attained a bachelor's degree in six years than those whose parents had incomes below $45,000 (60-70 percent vs. 44-49 percent). Those students whose parents had incomes below"}, {"section_title": "96", "text": ".130 $45,000 were more likely to have left postsecondary education without any degree than those whose parents had incomes of $70,000 or more (24-25 percent vs. 15 percent)."}, {"section_title": "Table 4.3-D: Persistence risk factors", "text": "Students with a bachelor's degree goal who had no persistence risk factors when beginning postsecondary education were more likely to have attained a bachelor's degree within six years (66 percent) than those who had one or more risk factors. Those who had one risk factor were more likely than those who had two or more to have attained a bachelor's degree (39 percent vs. 12-19 percent). Among 1995-96 beginning postsecondary students who had a bachelor's degree goal, each of the seven individual risk factors had a negative effect on bachelor's degree attainment. This included the following (bachelor's degree attainment rates are in parentheses): no regular high school diploma (16 percent); delayed enrollment after high school (30 percent); part-time attendance when first enrolled (25 percent); financially independent of parents (23 percent); having children when first enrolled (22 percent); single parent when first enrolled (24 percent); working full time the first year (23 percent). Table 4.4-A: First institution and academic preparation Among 1995-96 beginning postsecondary students with a bachelor's degree goal who did not delay enrollment after high school, two thirds (67 percent) attained a bachelor's degree by 2001 if they had started at a 4-year institution, compared with one-fourth (26 percent) if they had started at a 2-year institution. Of those who started at a 4-year institution in 1995-96, 16 percent were not enrolled anywhere and had not completed any degree by June 2001, compared with 35 percent of those who had started at a 2year institution."}, {"section_title": "Recent High School Graduates With a Bachelor's Degree Goal", "text": "Students with a bachelor's degree goal who entered postsecondary education directly from high school in 1995-96 but had not taken any Advanced Placement tests were less likely to have attained a bachelor's degree by June 2001 than those who had taken one or more Advanced Placement tests (53 percent vs. 71-84 percent). Among recent high school graduates who entered postsecondary education with a bachelor's degree goal, those who had higher SAT test scores and those with higher grades in high school were more likely to have attained a bachelor's degree within six years than those with lower SAT scores and lower high school grades."}, {"section_title": "Table 4.4-B: Enrollment patterns", "text": "Among students who enrolled in postsecondary education directly from high school with a goal of attaining a bachelor's degree, 72 percent of those who were always 97 131 enrolled full time attained a bachelor's degree by June 2001, compared with 41 percent of those with a mixed full-time/part-time enrollment pattern. Among recent high school graduates with a bachelor's degree goal who began postsecondary education in 1995-96, 70 percent of those who never transferred from their first institution and 71 percent of those who were continuously enrolled had attained a bachelor's degree by June 2001. Eighty percent of the recent high school graduates with a bachelor's degree goal who had a grade-point average of 3.25 or higher at the end of the first year in college attained a bachelor's degree by June 2001."}, {"section_title": "Table 4.4-C: Demographic characteristics", "text": "Among recent high school graduates with a bachelor's degree goal who began postsecondary education in 1995-96, women were more likely to complete a bachelor's degree by June 2001 than men (63 percent vs. 54 percent). White, non-Hispanic and Asian/Pacific Islander students who were recent high school graduates with a bachelor's degree goal were more likely than either Hispanic or Black, non-Hispanic students with the same characteristics to have attained a bachelor's degree by June 2001. No difference could be detected in bachelor's degree attainment rates between White, non-Hispanic and Asian/Pacific Islander students or between Black, non-Hispanic and Hispanic students. Among recent high school graduates who had a bachelor's degree goal and started postsecondary education in 1995-96, dependent students whose parents' income was $70,000 or more in 1994 were more likely to have attained a bachelor's degree by June 2001 than students whose parents' income was less than $70,000 in 1994 (71 percent compared with 46-62 percent)."}, {"section_title": "Table 4.4-D: Persistence risk factors", "text": "The bachelor's degree attainment rates of recent high school graduates who had a bachelor's degree goal and started postsecondary education in 1995-96 were inversely related to the number of risk factors present when they first enrolled. Two-thirds of those with no risk factors attained a bachelor's degree after six years, compared with 37 percent of those with one risk factor and 18 percent of those with 2 or 3 risk factors. Recent high school graduates who had a bachelor's degree goal and did not work while they were enrolled the first year were more likely to have attained a bachelor's degree by June 2001 than those who worked part time while enrolled the first year (70 percent vs. 56 percent).          Reporting standards not met. (Too few cases for a reliable estimate.) tNot applicable. NOTE: Details may not sum to 100 due to rounding. Total persistence and attainment rates include students who transferred out of the first institution attended. Recent high school graduates are those who did not delay entry into postsecondary education (received regular high school diplomas in 1995 and were enrolled in the 1995-96 academic year). For students who attained more than one degree only the highest degree earned is shown. SOURCE: U.S. Department of Education, National Center for Education Statistics, 1995-96 Beginning Postsecondary Students Longitudinal Study, Second Follow-up (BPS:96/01). NOTE: Details may not sum to 100 due to rounding. Total persistence and attainment rates include students who transferred out of the first institution attended. Recent high school graduates are those who did not delay entry into postsecondary education (received regular high school diplomas in 1995 and were enrolled in the 1995-96 academic year). For students who attained more than one degree only the highest degree earned is shown."}, {"section_title": "SOURCE: U.S. Department of Education, National Center for Education Statistics, 1995-96 Beginning Postsecondary Students", "text": "Longitudinal Study, Second Follow-up (BPS:96/01). The tables in section 5 show the distribution of all beginning students by the last academic year that they were enrolled anywhere in postsecondary education if they left without a degree and never returned by June 2001, or whether they were still enrolled somewhere in the spring of 2001 or whether they had attained any degree anywhere by June 2001. The percentage who left permanently is based on their non-enrollment by the end of each academic year (in June). The departure of those who were enrolled at the end of one year but did not return the next year is counted as occurring in the second year, rather than in the first year. Although the percentages are displayed for the types of institutions first attended, they do not necessarily reflect what happened at the first institution. The difference between the beginners who stayed at the first institution and those who transferred is shown under first transfer direction on the tables designated with a \"-B.\" The percentage of beginners who left permanently during the first year is of particular interest. The rates of first-year attrition were especially high among beginners who were always enrolled part time and among those who worked and considered themselves to be primarily employees rather than students. Table 5.0-A: First institution and goal A higher percentage of beginning students left postsecondary education without a degree during the first year of their enrollment in 1995-96 than in any later years (12 percent)."}, {"section_title": "Table 5.0-D: Persistence risk factors", "text": "Among all 1995-96 beginning students, the likelihood of leaving postsecondary education without a degree during the first year was directly related to the number of persistence risk factors associated with the students when they first enrolled, ranging from 3 percent for those with no risk factors to 29 percent for those with four or more risk factors. Beginners with a high school diploma were less likely than those without a regular diploma to have left without a degree during the first year (11 percent vs. 24-35 percent). No significant difference was detected between those who had a GED or high school equivalent and students with no high school credential. Beginning students with any of the following individual risk factors were more likely to leave postsecondary education without a degree by the end of the first year than those who did not have that risk factor present: delayed entry after high school (22 vs. 6 percent); began as part-time students (22 vs. 9 percent); were financially independent of parents (26 vs. 7 percent); had children, whether married or unmarried (27 vs. 9 percent); or were single parents (21 vs. 11 percent). Students who worked full time while enrolled when they started postsecondary education were more likely than students who either did not work or worked only part time to have left without a degree by the end of the first year (23 vs. 9-10 percent). Public 2-Year Institutions Table 5.1-A: Degree programs Among 1995-96 beginners at public 2-year institutions, a higher percentage left postsecondary education without a degree in the first year (17 percent) than in any other year. Among 1995-96 public 2-year beginners, those who began in a vocational certificate program were more likely than students in associate's degree programs (either in the applied field fields or liberal arts/undeclared) to have left without a degree during the first year (33 percent vs. 13-15 percent). No difference was detected among the three groups in the percentage who had attained a degree by 2001. Table 5.1-B: Enrollment patterns About one-half (47 percent) of the students beginning at public 2-year institutions who were always enrolled part time left without a degree by the end of the first year, compared with 17 percent of those who were always enrolled full time. About one-third (31-38 percent) of the beginners at public 2-year institutions who were not continuously enrolled (2 or more enrollment spells) were still enrolled without a degree somewhere in postsecondary education in 2001, compared with 8 percent of those who were continuously enrolled. Students who started at public 2-year institutions in 1995-96 and had a first-year GPA over 3.25 were more likely to have attained a degree somewhere by 2001 than those who had a first-year GPA below 2.25 (47 percent vs. 23 percent), but no difference was detected in the percentage who left during the first year. Among beginners at public 2-year institutions who transferred to 4-year institutions, 57-58 percent of those who last attended a public or a private not-for-profit 4-year institution had attained a degree, and 28 percent were still enrolled without a degree in 2001. Table 5.1-C: By demographic characteristics Among 1995-96 beginners at public 2-year institutions, Asian/Pacific Islander students were less likely to leave without a degree during the first year (2 percent) than any other racial/ethnic group. No significant difference could be detected in the first-year attrition rates among students of any other racial/ethnic backgrounds. The first-year attrition of the beginners at public 2-year institutions who worked while enrolled and considered themselves to be primarily employees was about one-third (31 percent). No difference was detected among dependent student family income levels in the percentage of beginners at public 2-year institutions who eventually attained a degree of some type at some postsecondary institution by June 2001. Table 5."}, {"section_title": "1-D: By persistence risk factors", "text": "Among 1995-96 beginners at public 2-year institutions, those who began with two or more risk factors were more likely than those with either one or no risk factors to have left without a degree by the end of the first year (20-32 percent vs. 5-9 percent). Beginners at public 2-year institutions with any of the following individual risk factors were more likely to leave without a degree by the end of the first year than those who did not have the risk factor present: delayed enrollment after high school (25 vs. 10 percent); part-time attendance intensity when first enrolled (23 vs. 12 percent); financially independent of parents (30 vs. 10 percent); or, having at least one child at time of initial enrollment (31 vs. 13 percent). Beginners at public 2-year institutions who worked full time while enrolled in 1995-96 were less likely to have attained any degree at any institution by June 2001 than those who worked part time or did not work in the first year (24 vs. 41-43 percent). Public 4-Year Institutions Table 5.2-A: Total by last year enrolled Among the beginners at public 4-year institutions who had a bachelor's degree goal in 1995-96, just 5 percent left postsecondary education without a degree by the end of the first year. In fact, no difference could be detected in the percentage who left postsecondary education without a degree in any of the first five years from 1995-96 to 1999-2000. Among the students who began at public 4-year institutions in 1995-96 and had not attained any degree anywhere, 44 percent were still enrolled in postsecondary education in the spring of 2001."}, {"section_title": "Table 5.2-B: Enrollment patterns", "text": "About one-half (49 percent) of the beginners at public 4-year institutions who were always enrolled part time left postsecondary education without a degree by the end of the first year. Among the 1995-96 beginners at public 4-year institutions who were always enrolled full time, 70 percent attained some type of degree by June 2001. Among the 1995-96 beginners at public 4-year institutions who never transferred from their original college or university, 7 percent left postsecondary education by the end of the first year, and about two-thirds (66 percent) attained a degree of some type by June 2001. Compared with those who never transferred, the 1995-96 beginners at public 4-year institutions who transferred to another 4-year institution (lateral transfers) were less likely to have attained a degree (51 vs. 66 percent) and more likely to be still enrolled without a degree in 2001 (34 vs. 12 percent). Among beginning students who started at public 4-year institutions, those whose first year GPA was less than 2.25 were more likely than those with a first year GPA of 2.25 or higher to leave postsecondary education by the end of the first year (11 percent vs. 2-3 percent)."}, {"section_title": "Table 5.2-C: Demographic characteristics", "text": "Asian/Pacific Islander students were less likely to leave postsecondary education by the end of the first year than beginners at 4-year public institutions from any other racialethnic background. No significant difference in first-year attrition could be detected among the other racial-ethnic groups."}, {"section_title": "Table 5.2-D: Persistence risk factors", "text": "Among 1995-96 beginning students who started at public 4-year institutions, those who had no risk factors at time of initial enrollment were less likely than those who started with one or more risk factors to have left without a degree in the first year. Beginning students at public 4-year institutions who had any of the following individual risk factors present when they first enrolled in 1995-96 were more likely to leave postsecondary education by the end of the first year than beginners who did not have that risk factor present: delayed enrollment after high school, part-time attendance in the first year enrolled, financial independence, having children, and full time employment when first enrolled. Beginning students at public 4-year institutions who did not work at all while enrolled during their first year were less likely to leave postsecondary education by the end of the first year than those who worked part time (3 percent compared with 5 percent). Private Not-for-Profit 4-Year Institutions Table 5.3-A: Total by last year enrolled Among 1995-96 beginning students at private not-for-profit 4-year institutions, about 3 percent left postsecondary education without a degree in each of the first five academic years. Table 5.3-B: Enrollment patterns About one-third (38 percent) of the 1995-96 beginners at private not-for-profit 4-year institutions who were always enrolled part time left postsecondary education by the end of the first year and never returned. Among the 1995-96 beginning students who started at private not-for-profit 4-year institutions, those with a first year GPA of less than 2.25 were more likely than students whose GPA was 2.25 or above to have had left postsecondary education without a degree by the end of the first year (10 percent compared with 2 percent). Among 1995-96 beginning students who started at a private not-for-profit 4-year institution and were also last enrolled at a private not-for-profit 4-year institution (either the same one or a different one), 82 percent had attained a degree by June 2001, compared with 50 percent of those who transferred and were last enrolled at a public 4year institution. About one-fourth (24 percent) of the transfers to public 4-year institutions were still enrolled without a degree in the spring of 2001."}, {"section_title": "Table 5.3-C: Demographic characteristics", "text": "Those students beginning at private not-for-profit 4-year institutions who worked and considered themselves to be primarily employees while enrolled in 1995-96 were more likely to leave postsecondary education during the first year than students who did not work or students who worked but considered themselves to be primarily students (17 percent vs. 2-3 percent)."}, {"section_title": "Table 5.3-D: Persistence risk factors", "text": "Among 1995-96 students who started at private not-for-profit 4-year institutions, just 2 percent of those with no risk factors left postsecondary education by the end of the first year, compared with 6 percent of those with one risk factor and 17-21 percent of those with two or more risk factors. The first-year attrition of 1995-96 beginning students at private not-for-profit 4-year institutions who worked full time while enrolled was 13 percent, compared with 2-3 percent of those who worked part time or did not work while enrolled.   BEST COPY AVAILABLE 125 i 5 9     BEST COPY AVAILABLE   1995-1996-1997-1998-1999-2000-enrolled 1995-1996-1997-1998-1999-2000-enrolled any degree 1996 1997 1998 1999 2000 2001 2001 by 2001 Students who began in private not-for-profit 4-year institutions "}, {"section_title": "135", "text": ":1 6 9 "}, {"section_title": "136", "text": "The tables in section 6 display the patterns of the transfer from the first institution attended to the second institution. In this study a transfer is defined as occurring when a student is no longer enrolled in one institution (the origin) and subsequently enrolls in a different institution for a period of at least 4 months (the destination). This definition is intended to exclude short summer school or occupational courses at a different institution. This transfer definition is not based on whether course credits were accepted at the destination institution. About one-third of the beginning students transferred from one institution to another during the six years under study. Since 10 percent of the students attended three or more institutions, the last type of institution attended is not necessarily the same as the destination of the first transfer. The tables in this section only describe the first transfer type and years, however. Transfer students may enroll at the destination institution soon after leaving the first institution attended or they may delay enrolling somewhere else by more than four months, in which case they are classified as both transfers and stopouts. The tables that follow show the last academic year that the transfer student was enrolled at the first institution, the type of institution that was the first destination, and the first academic year that the student was enrolled at the transfer destination institution. Tables 6.0-A and B show the distribution of all beginning students, including those who did not transfer; tables 6.1-A through C focus only on the distribution of those who did transfer. Table 6.0-A: Last academic year at first institution before transfer (all students) Two-thirds (68 percent) of all students who began postsecondary education in 1995-96 stayed at the same institution and never transferred. Thirteen percent left the first institution attended after the first year and transferred to another institution; another 10 percent left after the second year and transferred elsewhere. Table 6.0-B: Type of institution of first transfer destination (all students) Fourteen percent of the 1995-96 beginning postsecondary students transferred to a public 4-year institution, 10 percent transferred to a public 2-year institution, and 4 percent transferred to a private not-for-profit 4-year institution. 1371 r Table 6.1-A: Last academic year at first institution (among transfers) About one-half (49 percent) of the 1995-96 beginners who transferred from a 4-year institution left their original institution by the end of the first academic year. Another 31 percent of the transfers left by the end of their second year and 13 percent left by the end of the third year at the first institution. Beginners who transferred from their original 2-year institution were more evenly distributed, with 23-34 percent leaving by the end of each of the first three years. No difference could be detected in the percentage of students that left to transfer in each of those years. Beginning students who transferred from one 4-year institution to another 4-year institution were most likely to leave their original institution by the end of the first year (45 percent), and then decreasingly likely to leave by the end of the second (33 percent), third (15 percent), and fourth (6 percent) years. Beginning students who started at a 4-year institution and then transferred downward to a 2-year institution were also most likely to leave by the end of the first year (55 percent), less likely to leave by the end of the second year (30 percent), and then decreasingly likely to leave by the end of the third (10 percent) and fourth (4 percent) years. Among beginning students who started at 2-year institutions and transferred up to a 4year institution, no difference could be detected in the percentage who left their original institution by the end of any of the first three years. Beginning students who started at a 2-year institution and transferred laterally to another 2-year institution were more likely to leave the original institution by the end of the first year (49 percent) than by the second (26 percent) or any later year. Table 6.1-B: Type of institution of first transfer destination (among transfers) About one-half (49 percent) of beginning students who transferred from public 2-year institutions enrolled at public 4-year institutions, about one-fourth (27 percent) enrolled at a different public 2-year institution, and 11 percent enrolled at a private notfor-profit 4-year institution. Beginners who transferred from the first private not-for-profit 4-year institution where they started were more likely to enroll at a public 4-year (42 percent) or public 2-year institution (32 percent) than at a different private not-for-profit 4-year institution (18 percent). Among students who had attained an associate's degree before they transferred, about two-thirds (66 percent) enrolled at a public 4-year institution and about one-fourth (23 percent) enrolled at a private not-for-profit 4-year institution. Table 6.1-C: First academic year at transfer destination institution (among transfers) Among all the 1995-96 beginning students who transferred, 30 percent enrolled at the destination institution in 1996-97 and another 32 percent enrolled in 1997-98. Among all the beginners who transferred and left their original institution by the end of the first year (1995-96), 18 percent enrolled at the destination institution during the same academic year and about one-half (53 percent) enrolled in the next academic year (1996-97). Among those transfers who left the original institution by the end of the second year (1996-97), about one-fourth (27 percent) enrolled at the destination institution that same year and 58 percent enrolled in the next year (1997-98).   "}, {"section_title": "143", "text": ".177   Table 6.1-C.--Percentage distribution of 1995-96 beginning postsecondary students who transferred as of June 2001, according to the first year they enrolled at the destination institution of the first transfer, by.first institution type, initial degree goal, transfer type, and last year enrolled at the first institution attended First academic year at transfer destination 1995-96 1996-97 1997-98 1998-99 1999-00 2000-01 Students who transferred  Table 6.1-C.-Percentage distribution of 1995-96 beginning postsecondary students who transferred as of June 2001, according to the first year they enrolled at the destination institution of the first transfer, by first institution type, initial degree goal, transfer type, and last year enrolled at the first institution attended-Continued First academic year at transfer destination 1995-96 1996-97 1997-98 1998-99 1999- The tables in section 7 show the retention and attainment of 1995-96 beginning students who had a bachelor's degree goal (90 percent of the beginners at 4-year institutions) at the first (4-year) college or university they attended. The section contains six separate tables that show the percentage distribution of the beginners by their attainment or enrollment status at the first institution at the end of each academic year from 1995-96 to 2000-2001. At the end of each of the six academic years, the tables show the cumulative percentage who had attained any degrees (by highest type of degree) at that institution, the cumulative percentage who had transferred from the first institution and enrolled elsewhere, and the cumulative percentage of students who had left postsecondary education directly from the first institution and never enrolled anywhere else by June 2001. The percentage of students still enrolled at the first institution without a degree at the end of each year is the residual after classifying all those who had attained degrees at that institution in that year and prior years, who had transferred out of that institution in that year and prior years, or who had left postsecondary education from that institution in that year or prior years. Table 7.1: At the end of the first year  Among the students who started at a 4-year institution with a bachelor's degree goal in 1995-96, 86 percent were still enrolled at that institution at the end of the first academic year. Ten percent had left to transfer somewhere else and 3 percent had left postsecondary education and never enrolled anywhere in the subsequent five years."}, {"section_title": "Institutional Retention", "text": "About one-fourth of the beginners who were always enrolled part time at the first institution transferred by the end of the first year, and another fourth of the part-time students left postsecondary education without a degree by the end of the first year. Among the beginners who had a GPA of less than 2.25 at the first institution during the first year, 20 percent had transferred elsewhere and 9 percent had left postsecondary education by the end of the first year. Table 7.2: At the end of the second year  At the end of the second academic year (1996-97), three-fourths (73 percent) of the 1995-96 beginners who had a bachelor's degree goal and first attended a 4-year institution were still enrolled at that first institution. Those who had left the first institution by the end of the second year included 18 percent who had transferred (including the 10 percent who had transferred by the end of the first year) and 6 percent who had left postsecondary education permanently (including the 3 percent who had left by the end of the first year at the institution). Institutional freshmen \"dropout rates\" are sometimes measured as the percentage of first-time first-year freshmen who did not return to the same institution at the beginning of the second year. Such freshmen dropout rates, based on a survey of about 1,500 4-year institutions and about 900 2-year institutions, are reported annually by the American College Testing program (ACT). For many years these institutional freshmen dropout rates have averaged about 25 percent at 4-year institutions (see the ACT website: www.act.org). The ACT approach is different from the one used in this study, which measures what happened during each academic year and reports the cumulative percentage of students who had left the institution at the end of each academic year, rather than their status at the beginning of the next academic year. The closest equivalent to the ACT freshmen dropout measure is the percentage of 1995-96 beginners who were not enrolled at the first institution at the end of the second year, which includes all those beginners who did not return in the second year. It also includes those who returned but then left before June of the second year (so the second year rate should be somewhat greater than the ACT dropout rate). The results are similar. By the end of the second academic year (1996-97) approximately one-fourth of the beginners had dropped out of the first institution. However, 6 percent had actually left postsecondary education, and 18 percent had transferred to a different institution. (Not shown are another 2 percent who were stopouts not enrolled in the second year, but returned to the institution later. These would also be reported as first-year dropouts by institutions.) Table 7.3: At the end of the third year  By the end of the third year, two-thirds (65 percent) of the beginners with a bachelor's degree goal who started at a 4-year institution were still enrolled there, and a small percentage had attained degrees there. Twenty-two percent had transferred elsewhere and 9 percent had left postsecondary education since 1995-96. By the end of the third year, about one-half (50 percent) of the beginners who had combined SAT scores in the bottom quartile (400-700) were still enrolled at the college or university where they had started in 1995-96. Thirty-one percent had transferred to a different institution and 15 percent had left postsecondary education without a degree by the end of the third year after they had started. Table 7.4: At the end of the fourth year  By the end of the fourth year, about one-third (34 percent) of the beginners had completed a bachelor's degree at the same institution where they had started, about one-third (30 percent) were still enrolled there without having completed a degree, and about one-third had left the institution (sum of the 23 percent who had transferred and the 11 percent who had left postsecondary education). Table 7.5: At the end of the fifth year (1999)(2000) By the end of the fifth year, about one-half (51 percent) of the beginners who had a bachelor's degree goal and first enrolled at a 4-year college or university in 1995-96 had completed a bachelor's degree at that same institution and 11 percent were still enrolled there without a degree. Table 7.6: At the end of the sixth year  At the end of the sixth year in June 2001,55 percent of the beginners with a bachelor's degree goal who started at a 4-year institution in 1995-96 had completed a bachelor's degree at that same institution, and 7 percent were still enrolled there without a degree. Among those who had not been continuously enrolled at the first institution (stopouts), 30 percent were still enrolled without a degree in 2001. By June 2001,23 percent of the 1995-96 beginners with a bachelor's degree goal who had first enrolled in a 4-year institution had left that institution and transferred somewhere else and another 13 percent had left postsecondary education without a degree directly from that institution and were not enrolled anywhere else.  153 ins Table 7.2.-Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status at the first institution attended at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the second year, 1996-97  2.-Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status at the first institution attended at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the second year, 1996-97-Continued  Table 7.3.-Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status at the first institution attended at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the third year, 1997-98 x-89 Table 7.3.-Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status at the first institution attended at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the third year, 1997-98-Continued "}, {"section_title": "157", "text": "1 0 Table 7.4.-Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status at the first institution attended at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the fourth year, 1998-99 158 1 9 1 Table 7.4.-Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status at the first institution attended at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the fourth year, 1998-99-Continued 159 X92 Table 7.5.-Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status at the first institution attended at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the fifth year, 1999-2000  Table 7.5.-Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status at the first institution attended at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the fifth year, 1999-2000-Continued 161 9 4 Table 7.6.-Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status at the first institution attended at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the sixth year, 2000-01  Table 7.6.-Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status at the first institution attended at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the sixth year, 2000-01-Continued "}, {"section_title": "196", "text": "Section 8: Student Persistence and Attainment Anywhere at the End of Each Year (Beginners at 4-Year Institutions) The tables in section 8 show the persistence and attainment of 1995-96 beginning students who had a bachelor's degree goal (90 percent of the beginners at 4-year institutions) at any postsecondary institutions they attended in the six years under study. The section contains six separate tables that show the percentage distribution of the beginners by their attainment or enrollment status at any institution at the end of each academic year from 1995-96 to 2000-2001. These tables are comparable to the tables in section 7, which show retention and attainment of the same students at the first institution attended. The difference is that the categories used in the tables in this section include what happened to the students who were classified as transfers in section 7. At the end of each of the six academic years, the tables in section 8 show the cumulative percentage who had attained any degrees (by highest type of degree) at any institution, and the cumulative percentage who had left postsecondary education and were never again enrolled anywhere by June 2001. The tables also show the percentage of stopouts who were not enrolled at any time during that academic year, but returned in a following year and enrolled at some postsecondary institution. The stopout percentages are not cumulative, because in a future year the stopouts will again be classified as enrolled or as having attained a degree. Stopouts who were not enrolled at all during the year represented 2 to 4 percent of the students in the second through fifth academic years. Since the survey period stopped in June 2001, the percentage of stopouts in the last year cannot be known (since we do not know who might return in some future year), and they are included with those who left postsecondary education (permanently, as far as we know). This means that the true rate of permanent attrition (without a degree) from postsecondary education will always be somewhat lower than that measured at any particular point in time. The percentage of students still enrolled in postsecondary education without a degree at the end of each year is the residual after classifying all those who had attained degrees in that year and prior years, all those who had left postsecondary education permanently in that year and prior years, and those who were stopouts and not enrolled at all that year. The yearly percentage distributions from the tables in section 8 are equivalent to those shown in figure 3 in the text of the report. Table 8.1: At the end of the first year  By the end of the first academic year that they were enrolled, 97 percent of the 1995-96 beginning students with a bachelor's degree goal who had started at a 4-year institution were still enrolled in postsecondary education."}, {"section_title": "Student Persistence Anywhere", "text": "Just 3 percent of the beginners had left postsecondary education permanently by the end of the first year and never enrolled anywhere in the subsequent five years. Among the students who were always enrolled part time in the first year, 41 percent had left postsecondary education by the end of the first year. Table 8.2: At the end of the second year  By the end of the second academic year, 89 percent of the 1995-96 beginning students with a bachelor's degree goal who had started at a 4-year institution were still enrolled in postsecondary education. Another 4 percent were stopouts who were not enrolled at all in the second year, but returned in a subsequent year. Among the students who were not always continuously enrolled during the six years (that is, had a stopout period of more than 4 months at some time), 18 percent stopped out in the second year and were not enrolled anywhere in 1996-97. By the end of the second year, 6 percent of the 1995-96 beginning students with a bachelor's degree goal who had started at a 4-year institution had left postsecondary education permanently (including the 3 percent who had left by the end of the first year). However, among those who started as financially independent students, one-fifth (20 percent) had left postsecondary education by the end of the second year. Table 8.3: At the end of the third year  By the end of the third academic year, 82 percent of the 1995-96 beginning students with a bachelor's degree goal who had started at a 4-year institution were still enrolled in postsecondary education, and a small percentage had attained some degree. By the end of the third year, 10 percent of the 1995-96 beginning students with a bachelor's degree goal who had started at a 4-year institution had left postsecondary education permanently (including the 6 percent who had left by the end of the second year). Another 3 percent were stopouts who were not enrolled at all in the third year, but returned in a subsequent year. Among beginning students who were always enrolled part time, about one-half (54 percent) had left postsecondary education without a degree by the end of the third year. Table 8.4: At the end of the fourth year  By the end of the fourth academic year, 36 percent of the 1995-96 beginning students with a bachelor's degree goal who had started at a 4-year institution had completed a bachelor's degree, 43 percent were still enrolled in postsecondary education without a degree, and 13 percent had left postsecondary education. Among the beginners who had a GPA of less than 2.25 at the end of the first year, and among those who had started with a combined SAT score in the lowest quartile (400-700), about one-fourth (27 and 24 percent, respectively) had left postsecondary education without a degree by the end of the fourth year after they had started. Table 8.5: At the end of the fifth year (1999)(2000) By the end of the fifth academic year, 57 percent of the 1995-96 beginning students with a bachelor's degree goal who had started at a 4-year institution had completed a bachelor's degree, 19 percent were still enrolled in postsecondary education without a degree, and 17 percent had left postsecondary education. Table 8.6: At the end of the sixth year  By the end of the sixth academic year, 63 percent of the 1995-96 beginning students with a bachelor's degree goal who had started at a 4-year institution had completed a bachelor's degree, 14 percent were still enrolled in postsecondary education without a degree, and 18 percent had left postsecondary education. Students who may have stopped out in this last year cannot be identified until they return in some future year, and they are included in the percentage that had left postsecondary education. Table 8.1.-Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status anywhere at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the first year, 1995-96  Table 8.2.-Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status anywhere at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the second year, 1996-97-Continued   173 4UO Table 8.4.-Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status anywhere at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the fourth year, 1998-99  Table 8.4.-Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status anywhere at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the fourth year, 1998-99-Continued     Table 8.6.-Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to the highest degree attained or enrollment status anywhere at the end of each academic year (cumulative), by first type of 4-year institution and student characteristics: End of the sixth year, 2000-01  The persistence track concept was developed by Carroll as a tool for analyzing the persistence path of beginners with bachelor's degree goals starting at 4-year institutions (Carroll 1989). Students are classified as staying on the persistence track of progress towards a bachelor's degree as long as they remain continuously enrolled at 4-year institutions during each academic year. This includes students who transfer from one 4-year institution to another without a break in enrollment continuity. They are classified as leaving the persistence track once they start a stopout period (defined in this study as a break in enrollment continuity of more than 4 months), transfer downward to a less-than-4-year institution, or leave postsecondary education entirely before completing a bachelor's degree. In these tables it is also assumed that if a student with a bachelor's degree goal attains a sub-baccalaureate degree (certificate or associate's degree), the student has left the persistence track. The tables in section 9 show the status of beginning students with a bachelor's degree goal who started at a 4-year institution on the persistence track at the end of each academic year. The tables show the percentage of all beginning students who are still \"on track\" (enrolled continuously at 4-year institutions) each year or complete a bachelor's degree in a given year. Then they show the percentage who left the persistence track that year because they started a stopout period, transferred to a less-than-4-year institution, attained a sub-baccalaureate degree, or left postsecondary education entirely. Those who stopped out and then transferred are classified as delayed transfers (rather than stopouts). In order to maintain a percentage distribution that includes all of the beginners each year, the percentage who had left the persistence track in prior years and the percentage who had attained bachelor's degrees in prior years are cumulated on each table. The percentages may also be interpreted as representing the persistence track status of 1,000 beginners (100.0 percent of the initial cohort) at the end of each academic year. For example, at the end of the first year, 857 (85.7 percent) of 1,000 beginners were still on the persistence track (table 9.1). At the end of the second year, 760 (76.0 percent of the total) were still on the persistence track (table 9.2). The conditional persistence rate between the first and the second year may be estimated by calculating 760/857=88.7 percent. At the end of the third year, 674 of the initial 1,000 were still on the persistence track and 23 attained a bachelor's degree that year (table 9.3). Combining the latter, the conditional persistence rate between the second and third years may be estimated as (674+23)/760=91.7 percent. Tables 9.1 through 9.6 show the persistence track status of the students at the end of each of the six academic years. Table 9.7 displays the percentage of students who stayed on the persistence track and the cumulative percentage of students who experienced the four types of departure from the persistence track as of June 2001. By interpreting the percentages as representing 1,000 beginning students, table 9.7 shows that of the original 1,000 beginners, 578 were continuously enrolled at 4-year institutions and completed a bachelor's degree by June 2001 (the 45 who attained in the sixth year plus the 533 who had attained in prior years as shown in table 9.6), and 52 had been enrolled continuously but had not yet completed a bachelor's degree. Of the original 1,000 beginners, 369 had left the persistence track towards a bachelor's degree: 127 had transferred to a less-than-4-year institution, 110 had stopped out for more than 4 months, Table 9.1.-Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to whether they stayed on the persistence track or the first type of exit from the persistence track during each academic year, by the first type of 4-year institution and student characteristics: End of first year, 1995-96       Table 9.3.-Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to whether they stayed on the persistence track or the first type of exit from the persistence track during each academic year, by the first type of 4-year institution and student characteristics: End of third year, 1997-98    Table 9.4.-Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to whether they stayed on the persistence track or the first type of exit from the persistence track during each academic year, by the first type of 4-year institution and student characteristics: End of fourth year, 1998-99  Table 9.4.-Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to whether they stayed on the persistence track or the first type of exit from the persistence track during each academic year, by the first type of 4-year institution and student characteristics: End of fourth year, 1998-99-Continued  Table 9.4.-Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to whether they stayed on the persistence track or the first type of exit from the persistence track during each academic year, by the first type of 4-year institution and student characteristics: End of fourth year, 1998-99-Continued     ST COPY AVAILABLE Table 9.6.-Percentage distribution of 1995-96 beginning students at 4-year institutions who had a bachelor's degree goal, according to whether they stayed on the persistence track or the first type of exit from the persistence track during each academic year, by the first type of 4-year institution and student characteristics: End of sixth year, 2000-01-Continued    The tables in section 10 display the bachelor's degree completion rates of the 1995-96 beginning students who had a bachelor's degree goal and started at a public 4-year or a private not-for-profit 4-year college or university. The tables show the percentage of these beginning students who completed a bachelor's degree in 4 years or less (48 months or less after they had started), in five years (49-60 months) or in six years (61-72 months), and the total percentage who had completed a bachelor's degree by June 2001, the sixth year since the beginning of the study in 1995-96. The tables show the completion rates from two perspectives, completion rates at the first institution attended and student completion rates at any 4-year institution. As shown previously, institutional attainment rates understate the attainment of students in postsecondary education because they do not account for the experience of students who have transferred elsewhere. The difference is discussed in detail in the text of the report. These completion rates are based on the number of months between first enrollment and the bachelor's degree completion date. These rates may differ slightly from the bachelor's degree attainment percentages displayed on other tables in this report which measure the bachelor's degree attainment at the end of the fourth or fifth academic years (as of June 1999 and June 2000, respectively) rather than the percentage who completed the degree within 48 or within 49-60 months after beginning. Some of the 1995-96 beginners did not start until the spring of 1996. Students who started in the spring of 1996 and completed the degree in 48 months, for example, would have finished during the fifth academic year (1999)(2000) of this study. The relationships of academic preparation, enrollment patterns, demographic characteristics of students, and persistence risk factors to bachelor's degree completion is discussed in the text of the report, and was previously shown in detail for beginners at public 4-year and at private not-for-profit 4-year institutions in compendium sections 2 (student attainment anywhere) and section 3 (institutional attainment) of this compendium.          About one-fifth (20 percent) of respondents who had ever been enrolled part time had taken a distance education course, compared with 14 percent of respondents who had never been enrolled part time."}, {"section_title": "203", "text": "Those students who were not continuously enrolled were more likely to have taken a distance education course than those who were continuously enrolled (22 vs. 15 percent, respectively). Table 11.1-B: Academic performance Men were more likely than women to repeat a course for a higher grade (27 vs. 21 percent, respectively) and withdraw from a course they were failing (21 percent of men, 15 percent of women), while women who earned bachelor's degrees were more likely than their male counterparts to graduate with honors; 43 percent of women and 33 percent of men graduated with honors. About 7 percent of students who were age 30 or older when they began postsecondary education had received an incomplete or repeated a course for a higher grade, and about 5 percent had withdrawn from a course they were failing. Students who were 18, 19 or 20-23 when they began postsecondary education were more likely to have experienced academic difficulties: 19-21 percent of these age groups had received an incomplete, between 15 and 31 percent had repeated a course for a higher grade, and between 15 and 22 percent had withdrawn from a course. No differences were detected between students aged 24 to 29 and those who were 30 or older. Those students who attained their bachelor's degree within four years were less likely than those who took longer to attain their bachelor's degrees to have received an incomplete (7 vs. 16 percent), repeated a course (15 vs. 42 percent), or withdrawn when failing (11 vs. 24 percent). Students who completed their bachelor's degrees more quickly were more likely to have graduated with honors than students who took five or six years to complete their degrees; 46 percent of students who finished in four years graduated with honors compared with 31 percent of students who finished in five to six years. Table 11.1-C: Graduate school enrollment About two-fifths (42 percent) of college graduates who had expected to attain a doctoral or professional degree when they began their postsecondary education in 1995-96 had enrolled in graduate school by June of 2001. While about 6 percent were just taking classes, the rest were split between master's degree programs and doctoral or professional degree programs (47 percent each). No differences could be detected in graduate school enrollment by dependent student family income in 1994. Students who were employed part time or full time while enrolled in graduate school were more likely to be enrolled in a master's degree program (74 percent of part-time and 77 percent of full-time students) than were graduate students who did not work while enrolled (38 percent). The latter were more likely to be enrolled in doctoral or professional degree programs (60 percent) than were part-time (20 percent) or full-time (6 percent) employees."}, {"section_title": "Table 11.2-A: Relationship between job in June 2001 and courses taken", "text": "Among respondents who were employed full time, those with the lowest annual salaries (less than $20,000) were more likely than respondents who earned more than $20,000 annually to report that their coursework was unrelated to their current job (58 percent of respondents earning less than $20,000 compared with 34 percent of respondents earning between $20,000 and $60,000 and 27 percent who earned over $60,000 per year). Likewise, respondents who earned less than $20,000 per year were less likely than those earning more to report that the classes they took while enrolled were closely related to their current jobs; 27 percent of respondents earning less than $20,000 reported a close relationship between their job and classes, compared with 45-52 percent of those earning more than $20,000. Respondents who had not attained any degree were less likely to be working in fields related to the courses they took while enrolled. About one-half (55 percent) of respondents who had not attained a degree reported no relationship between the courses they took and their current jobs (compared with 21 to 34 percent of respondents who attained degrees). About one-half of respondents with certificates (55 percent), associate's degrees, or bachelor's degrees (53 percent each) reported a close relationship, compared with 28 percent of respondents who had no degree. In general, respondents whose job required a degree and respondents who were satisfied overall with their jobs were more likely to report a close relationship between their jobs and the courses they took while enrolled; 64 percent of respondents working in jobs that required a degree reported a close relationship compared with 30 percent of those whose jobs did not require a degree, and 45 percent of satisfied respondents compared with 27 percent of unsatisfied respondents reported that their jobs were related to their coursework. 243 Table 11.2-B: Autonomy in current job Among respondents who were employed by someone else full time in 2001, men reported having more autonomy, in their jobs than women, with 15 percent of men reporting being basically their own boss, compared with 7 percent of females. In 2001, respondents working for someone else and earning over $60,000 per year were three times more likely than those earning less than $20,000 per year to report having the highest level of autonomy (18 vs. 5 percent, respectively). Table 11.2-C: Relocated for current job Younger respondents were more likely to have relocated for their current job than older students; 19 percent of respondents who began postsecondary education when they were 18 years old relocated for their current job, compared with between 4 and 9 percent of respondents who began their education at age 20 or higher. Respondents with higher paying jobs had been more willing to move-31 percent of respondents whose annual salary in 2001 exceeded $60,000 moved for the job, compared with 11 percent of respondents earning below $20,000 annually."}, {"section_title": "Table 11.2-D: Benefits", "text": "In 2001, most full-time employees were receiving medical insurance (88 percent) and dental or vision insurance (81 percent). About three-fourths of them were receiving retirement benefits (78 percent) and life insurance (71 percent), 40 percent were receiving stock options. About one-third (31 percent) had employer-provided flexible spending accounts, and 26 percent received a fitness benefit. Those respondents with higher paying jobs in 2001 (over $60,000) were more likely than those with jobs paying less than $20,000 per year to receive each benefit. Respondents who considered the job they had in 2001 to be the beginning of their careers were more likely to receive each benefit than those who did not see their job as the beginning of a career."}, {"section_title": "Table 11.2-E: Licenses and certifications", "text": "Men were more likely than women to hold a professional certification (19 vs. 13 percent, respectively), but the opposite was true for occupational licensure; 23 percent of women and 19 percent of men reported holding an occupational license. Asian/Pacific Islander respondents were less likely than White, non-Hispanic or Hispanic respondents to hold a professional certification (7 percent vs. 16-20 percent). Respondents whose highest degree was a certificate in 2001 were more likely than respondents who had not attained any degree and those who had attained an associate's or a bachelor's degree to hold a professional certification (33 vs. 11-19 percent), and more likely than those who had not attained any degree and those who had attained a bachelor's degree to hold an occupational license (39 vs. 14 and 22 percent, respectively). Table 11.3-A: Community service About one-half (47 percent) of respondents who earned over $60,000 annually reported participating in community service in 2001, compared with one-quarter (25 percent) of those with salaries less than $20,000. However, those with the lowest income were more likely to volunteer more than 20 hours per month than those who earned more than $60,000 per year (25 percent vs. 10 percent). Respondents who had attained a bachelor's degree were more likely to participate in community service (46 percent) than those who had not attained any degree (29 percent) and those who had attained a certificate (22 percent) or an associate's degree (31 percent). Nearly one-half (47 percent) of respondents who last attended a private not-for-profit 4-year institution performed community service, compared with 20 to 27 percent of respondents who had attended less-than-4-year institutions, and 38 percent of respondents who had attended public 4-year institutions. Although no difference could be detected in community service participation by hours worked per week, full-time employees were more likely than part-time employees to volunteer less than 10 hours per month, with one-half (51 percent) of full-time employees and 38 percent of part-time employees doing so. Respondents who reported that volunteer work was required as a part of their education were more likely to have participated in community service activities than respondents for whom community service work was not required (42 percent vs. 32 percent). Single, never married respondents who participated in community service were more likely than those who were married to volunteer with kids in an education-related activity-18 percent of single respondents volunteered with kids, compared with 8 to 10 percent of respondents who were married. Women were more likely than men to volunteer in the health services field (15 vs. 6 percent, respectively), while men (19 percent) were more likely than women (11 percent) to volunteer for neighborhood improvement or cleanup. Respondents who volunteered more than 20 hours per month were more likely to do other work with kids (such as coaching or mentoring) than any other volunteer activityone-third (33 percent) volunteered with kids, compared with 4-16 percent in each of the other volunteer types. Table 11.3-C: Voting and political participation Respondents who had attained bachelor's degrees were more likely than respondents who had attained certificates and those who had not attained any degree to have voted in the 2000 presidential elections (67 vs. 55-56 percent), written to a public official (15 vs. 8-12 percent), and participated in political activities (15 vs. 7-11 percent). Respondents who performed community service were more active in the political arena as well; 68 percent voted compared with 55 percent of non-volunteers, 23 percent wrote to public officials and 20 percent participated in political activities compared with 7 percent each of non-volunteers. Table 11.4-A: Cumulative student loan amounts Fifty-five percent of students who attained associate's degrees and 59 percent of students who attained bachelor's degrees received student loans. The amounts borrowed, however, were quite different: students who attained associate's degrees borrowed an average of about $11,000, compared to the $18,000 average loan amount for bachelor's degree recipients. Although no difference could be detected between respondents who last attended a public institution and those who last attended a private not-for-profit institution in the proportion who borrowed, respondents who last attended private not-for-profit institutions borrowed larger amounts than those who last attended public institutions (about $19,000 and $14,000, respectively). Among respondents who last attended a private not-for-profit 4-year institution, onethird had undergraduate student loans of more than $20,000, compared with 5 to 18 percent of respondents who last attended public 2-year, public 4-year, or private forprofit less-than-4-year institutions. Respondents who took more than four years to attain their bachelor's degrees were more likely to have borrowed than respondents who graduated within the normal four years; nearly two-thirds (63 percent) of respondents who took five to six years to complete a bachelor's degree borrowed compared with 55 percent who finished in four years. However, no difference could be detected in the average amounts borrowed by the two groups."}, {"section_title": "Table 11.4-B: Student loan repayment", "text": "One quarter (25 percent) of respondents were repaying student loans in 2001. Of these, one-half (50 percent) were paying more than $150 per month. Respondents who had attained bachelor's degrees were more likely to be in repayment (37 percent) than respondents who had attained no degree (14 percent), a certificate (16 percent), or an associate's degree (21 percent). Respondents who last attended a private not-for-profit 4-year institution were more likely to be in repayment in 2001 than respondents who last attended public 2-year or public 4-year institutions (37 percent vs. 11 and 26 percent, respectively); these respondents were paying more each month ($222 monthly, on average) than were respondents who last attended public 2-year institutions ($113 per month) and public 4-year institutions ($170 monthly). About one-third (35 percent) of those who paid off their credit card balances each month had 3 or more credit cards, compared with 42 percent of those who carried balances. Table 11."}, {"section_title": "4-D: Credit card balance", "text": "Respondents with three or more credit cards were more likely than respondents with one or two credit cards to have a balance over $2,000 (36 percent vs. 17 percent, respectively). Respondents who were enrolled in graduate school in 2001 were less likely than those who were not enrolled in graduate school to have a credit card balance higher than $2,000; 15 percent of graduate students had a balance over $2,000, compared with onefourth (25 percent) of respondents who did not enroll in graduate school. Those student who had borrowed to finance their postsecondary education were more likely than those who had not borrowed to have a credit card balance of over $2,000; 30 percent of borrowers, compared with 18 percent of non-borrowers had balances that high. Table 11.4-E: Lifetime learning tax credit Black, non-Hispanic respondents were less informed about the lifetime learning tax credit than were White, non-Hispanic students; 27 percent of Black respondents had never heard of the lifetime learning tax credits, compared with 16 percent of White students. Married respondents were more likely to have claimed the lifetime learning tax credit in 1999 than were single respondents (28 vs. 17 percent).       "}, {"section_title": "227", "text": ""}, {"section_title": "X57", "text": ""}, {"section_title": "230", "text": "BEST COPY AVAILABLE         Indicates whether or not the students had ever enrolled at a public 2-year institution as an undergraduate. Never attended public 2-year institution Attended public 2-year institution Enrollment continuity through 2001 ENSENU2B Number of enrollment spells at any institution through June 2001. An enrollment spell is defined as a period of continuous enrollment without a break of more than four months. Students with two or more enrollment spells are stopouts. Continuously enrolled Student was continuously enrolled without any interruption of more than 4 months. Indicates whether or not the students had attained any degree and/or were still enrolled as undergraduates as of June 2001. If the students were enrolled during February through June of 2001, they were considered to be still enrolled. Student had attained a degree and was no longer enrolled as an undergraduate; this includes all bachelor's degree recipients. Student had not attained any degree but was still enrolled somewhere. Student had left postsecondary education without any degree."}, {"section_title": "DAS Variable", "text": "Holds professional certification QDCT1 Response to the question \"Do you hold professional certification in an occupational area?\" Intensity of graduate attendance QDFT1 Response to the question \"Have you been/were you enrolled mainly as a full-time or part-time graduate student?\" Part-time Full-time Holds occupational license QDLIC1 Response to the question \"Do you hold an occupational license that was required by the federal, state, or local government before you could practice in a profession?\" Worked while enrolled in graduate school QDWKHR1 Response to the question \"About how many hours per week do/did you work for pay while enrolled at [GRADUATE SCHOOL NAME]?\" Worked part time Worked full time Autonomy in current job QEAUTOC Response to the question \"Please tell me which of the following statements best describes your job?\" Response to the question \"Did you vote in the 2000 presidential election?\" Asked only of citizens."}, {"section_title": "Subcategories of beginners SB4YRBEG", "text": "This variable combines three characteristics of beginners who started at a 4-year institution: a) who enrolled full-time when first began enrollment; b) who had a bachelor's degree goal; and c) who did not delay enrollment after high school. Enrolled full-time first year Had a bachelor's degree goal Had a bachelor's degree goal and enrolled full-time first year Recent high school graduates (did not delay entry) Recent high school graduates with a bachelor's degree goal Recent high school graduates with a bachelor's degree goal and enrolled full-time first year Took remedial courses in 1995-96 RMANYY1 Respondent reported taking one or more remedial instruction or developmental courses in reading, writing, math, study skills, or English language skills during the first year enrolled. Student dependency status for federal financial aid during 1995-96. Students age 23 or younger were assumed to be dependent unless they met the independent student criteria. Students were considered independent if any of the fol- Student/employee role 1995-96 SEROLEY1 Response to the question \"While you were enrolled and working, would you say you were primarily a student working to meet expenses or an employee who's decided to enroll in school?\" Did not work while enrolled Student working Employee who is enrolled 264 294 1998, were eligible to be interviewed. Over 9,100 students were located and interviewed. The weighted response rate was 83.6 percent overall, but was somewhat higher among respondents to both the 1996 and the 1998 interviews (87.4 percent).28 Nonresponse among cohort members causes bias in survey estimates when the outcomes of respondents and nonrespondents are shown to be different. A bias analysis was conducted of the 2001 survey results to determine if any variables were significantly biased due to nonresponse.29 Considerable information was known from the 1996 and 1998 surveys for nonrespondents to the 2001 interviews, and nonresponse bias could be estimated using variables with this known information. Weight adjustments were applied to the BPS:1996/2001 sample to reduce any bias found due to unit nonresponse. After the weight adjustments, some variables were found to reflect zero bias, and for the remaining variables the bias did not differ significantly from zero. This analysis was performed on variables found on the frame where the true value is known for both respondents and nonrespondents. For other variables collected in the survey, where data is available only for respondents, it is not known whether the weight adjustments completely eliminate bias."}, {"section_title": "Accuracy of Estimates", "text": "The statistics in this report are estimates derived from a sample. Two broad categories of error occur in such estimates: sampling and nonsampling errors. Sampling errors occur because observations are made only on samples of students, not entire populations. Nonsampling errors occur not only in sample surveys but also in complete censuses of entire populations. Nonsampling errors can be attributed to a number of sources: inability to obtain complete information about all students in all institutions in the sample (some students or institutions refused to participate, or students participated but answered only certain items); ambiguous definitions; differences in interpreting questions; inability or unwillingness to give correct information; mistakes in recording or coding data; and other errors of collecting, processing, sampling, and imputing missing data."}, {"section_title": "Data Analysis System", "text": "The estimates presented in this report were produced using the BPS:1996/2001 Data Analysis Systems (DAS). The BPS:1996/2001 Data Analysis System includes all of the variables 28For more information on the BPS:1996/2001 survey, consult U.S. Department of Education, National Center for Education Statistics, Beginning Postsecondary Students Longitudinal Study:1996-2001Methodology Report (NCES 2002 (Washington, DC: 2002). 29Thid. 297 from the BPS:1996/1998 study and several sample weights for a cross-sectional analysis of the students in either 1995-96, 1998, or 2001 as well as weights for the longitudinal analysis of students who responded in any two or in all three of the survey years. All of the tables and estimates in this report used the longitudinal analysis weight BOILWT2 for about 9,000 sample students who responded in both the first (1996) and the last year (2001). The DAS software makes it possible for users to specify and generate their own tables. With the DAS, users can replicate or expand upon the tables presented in this report; the table parameter files (tpf) that produced these tables are available to users on the NCES website. In addition to the table estimates, the DAS calculates proper standard errors30 and weighted sample sizes for these estimates. For example, tables B1-A through D contain standard errors that correspond to compendium tables 2.0-A through D, generated by the DAS. If the number of valid cases is too small to produce a reliable estimate (less than 30 cases), the DAS prints the message \"low-N\" instead of the estimate. In addition to tables, the DAS can also produce a correlation matrix of selected variables to be used for linear regression models. Included in the output with the correlation matrix are the design effects (DEFTs) for each variable in the matrix. Since statistical procedures generally compute regression coefficients based on simple random sample assumptions, the standard errors must be adjusted with the design effects to take into account the BPS:1996/2001 sample design. The DAS can be accessed electronically at http://nces.ed.gov/das. For more information about the BPS:1996BPS: /2001  Internet address: Aurora.D'Amico@ed.gov 30The BPS:1996/2001 samples are not simple random samples, and therefore simple random sample techniques for estimating sampling error cannot be applied to these data. The DAS takes into account the complexity of the sampling procedures and calculates standard errors appropriate for such samples. The method for computing sampling errors used by the DAS involves approximating the estimator by the linear terms of a Taylor series expansion. The procedure is typically referred to as the Taylor series method.    "}, {"section_title": "298", "text": ""}, {"section_title": "302", "text": "where p is the proportion of the total group contained in the subgroup.33 The estimates, standard errors, and correlations can all be obtained from the DAS. There are hazards in reporting statistical tests for each comparison. First, comparisons based on large t statistics may appear to merit special attention. This can be misleading since the magnitude of the t statistic is related not only to the observed differences in means or percentages but also to the number of students in the specific categories used for comparison. Hence, a small difference compared across a large number of students would produce a large t statistic. A second hazard in reporting statistical tests for each comparison occurs when making multiple comparisons among categories of an independent variable. For example, when making paired comparisons among different levels of income, the probability of a Type I error for these comparisons taken as a group is larger than the probability for a single comparison. When more than one difference between groups of related characteristics or \"families\" are tested for statistical significance, one must apply a standard that assures a level of significance for all of those comparisons taken together. Comparisons were made in this report only when p< .05/k for a particular pairwise comparison, where that comparison was one of k tests within a family. This guarantees both that the individual comparison would have p< .05 and that for k comparisons within a family of possible comparisons, the significance level for all the comparisons will sum to p< .05.34 For example, in a comparison of males and females, only one comparison is possible (males vs. females). In this family, k=1, and the comparison can be evaluated without adjusting the significance level. When students are divided into five age categories (18 or younger, 19, 20-23, 24-29, 30 or older) and all possible comparisons are made, then k=10 and the significance level of each test must be p< .05/10, or p< .005. The formula for calculating family size (k) is as follows: where j is the number of categories for the variable being tested. In the case of age, there are five age groups, so substituting 5 for j in equation 4, results in the following family size. 3311id. 34The standard that p<_ .05/k for each comparison is more stringent than the criterion that the significance level of the comparisons should sum to c6.05. For tables showing the t statistic required to ensure that .05/k for a particular family size and degrees of freedom, see Olive Jean Dunn, \"Multiple Comparisons Among Means,\" Journal of the American Statistical Association 56 (1961): 52-64."}, {"section_title": "304", "text": "Appendix BTechnical Notes and Methodology k =5(5 1) 10 2 Linear Trends 5While many descriptive comparisons in this report were tested using Student's t statistic, some comparisons among categories of an ordered variable with three or more levels involved a test for a linear trend across all categories, rather than a series of tests between pairs of categories. In this report, when differences among percentages were examined relative to a variable with ordered categories, Analysis of Variance (ANOVA) was used to test for a linear relationship between the two variables. To do this, ANOVA models included orthogonal linear contrasts corresponding to successive levels of the independent variable. The squares of the Taylorized standard errors (that is, standard errors that were calculated by the Taylor series method), the variance between the means, and the unweighted sample sizes were used to partition total sum of squares into within-and between-group sums of squares. These were used to create mean squares for the within-and between-group variance components and their corresponding F statistics, which were then compared with published values of F for a significance level of .05.35 Significant values of both the overall F and the F associated with the linear contrast term were required as evidence of a linear relationship between the two variables. Means and Taylorized standard errors were calculated by the DAS. Unweighted sample sizes are not available from the DAS and were provided by NCES. 35More information about ANOVA and significance testing using the F statistic can be found in any standard textbook on statistical methods in the social and behavioral sciences."}]