[{"section_title": "Main Findings", "text": "The Gulf of Mexico Large Marine ecosystem has been subject to increasing anthropogenic influences over the past three decades, primarily as a result of human population growth, energy extraction, and coastal development in the region. Sea surface temperatures have increased continuously over recent decades. Viewed in isolation, temperature increases may act as a stressor on the system; temperature increases may also have interactive effects, ameliorating or exacerbating other ecosystem pressures. The Gulf of Mexico has experienced wide-scale losses of numerous critical habitat types for over three decades. Some species of primary commercial importance have increased in abundance over recent decades, while commercial species of secondary importance have generally decreased in abundance. The average trophic level of both Mexican and U.S. landings has increased over time. Fishing effort has decreased in the past 20 years in the majority of sectors, in both the United States and Mexico. Landings of most species have also decreased or remained constant throughout this period. An overall lack of data for years prior to the 1980s makes it challenging to differentiate recent trends from natural cycles of variability in the system, linked to large-scale climate patterns such as the Atlantic Multidecadal Oscillation."}, {"section_title": "INTRODUCTION", "text": "The Gulf of Mexico Large Marine Ecosystem encompasses over 1.6 million km 2 of coastal and open ocean, making it the ninth largest body of water in the world. It is one of the most ecologically and economically productive ecosystems in North America. In the United States, the Gulf of Mexico generates over 1.3 billion pounds in fishery landings, and supports a tourism industry estimated to be worth $20 billion annually. In Mexico, the Gulf of Mexico alone supplies 90% of oysters and roughly half the shrimp and fish supply for the country, and its coastal areas support an extensive tourism industry. Mineral extraction in the northern Gulf of Mexico is a major activity, with approximately 470 million barrels of oil and 2.9 x 10 9 thousand cubic feet of natural gas extracted per year in U.S. waters. Given the economic importance of the Gulf of Mexico to a range of industries, it is not surprising that this ecosystem is under increasing pressure from anthropogenic activities. This is perhaps best represented by the rapid human population growth in Gulf of Mexico coastal counties over the past 50 years. Successful management of the Gulf of Mexico is challenging not only due to the wide range of anthropogenic impacts affecting the ecosystem, but also due to political constraints; the ecosystem is shared and managed by three different nations (United States, Mexico, and Cuba). To achieve sustainable management of any ecosystem, it is necessary to employ indicators which serve to communicate changes in the state of an ecosystem. Indicators are specific, well-defined and measurable variables that have been proven to reflect the status of some component of the ecosystem. They should provide timely information regarding the state of the ecosystem [1] and be easily understood and accepted by scientists, managers, politicians, and stakeholders [2]. To aid in the selection of indicators for the whole ecosystem it is often useful to employ a conceptual modeling framework that identifies the focal ecosystem components. Here, the DPSER (Drivers -Pressures -States -Ecosystem Services -Responses) conceptual modeling framework was employed to aid indicator selection [3]. This ensures indicators are selected that reflect the status of key drivers, pressures, states, ecosystem services, and responses in the ecosystem. In addition to these indicators, it is essential that indicators be employed to measure human well-being, particularly those aspects dependent upon the ecosystem. A suite of indicators, reflecting the focal ecosystem components identified in the above frameworks, should adequately capture the important biophysical and human dimensions attributes of the ecosystem necessary to inform ecosystem-based management. The goal of this report is to summarize the various focal ecosystem components in the Gulf of Mexico necessary to consider from an ecosystem perspective. The report highlights potential indicators that could be used to track these focal ecosystem components. Broadly following the DPSER framework, selected indicators span a wide range of ecosystem components, from climatic and physical drivers of ecosystem change, to the states of biological and human communities. The intention of the work is to cover the entire Gulf of Mexico Large Marine Ecosystem, including U.S., Mexican, and Cuban waters. However, due to the difficulty in obtaining data from Cuba, only remotely sensed observations are available for this report from this section of the Gulf. Where possible, we have developed indicators based on the Southern Gulf of Mexico using Mexican data sources, but much of the information in the report is weighted heavily towards the Northern Gulf of Mexico. We expect that this interdisciplinary report will serve to elucidate linkages not only between these geographical regions, but also between different components of the Gulf of Mexico Large Marine Ecosystem, and that it will provide context as we move toward ecosystem-based management of this ecosystem. To aid readers in the interpretation of the indicators presented following, we have standardized the figures to the extent possible. For time series containing more than ten years of data, we display the means (faded solid lines) and 5% / 95% quantiles (faded dashed lines) for each indicator. When time series values indicated a significant trend according to a Kendall rank correlation test, we show the Kendall tau slope (faded solid lines) and 95% prediction interval associated with the slope (faded dashed lines). When multiple time series appear on a single plot, faded lines are plotted in colors matching their respective time series. These standardizations are intended to help readers efficiently interpret each figure and visualize trends and anomalies in the indicators."}, {"section_title": "CLIMATE DRIVERS", "text": "Variations in large-scale climate patterns are influential in shaping the physical environment of marine organisms, and affect many aspects of their physiology such as feeding, migration, and reproductive success. With significant climatological changes predicted to occur in coming decades, it is increasingly important to understand the major physical forces impacting the Gulf of Mexico, and the effects these forces may have on the biology and management of the ecosystem. Remote sensing of the sea surface via satellites gives us a synoptic view of the entire Gulf of Mexico, and provides an opportunity to understand changes in the physical environment over time and space. Here we present a number of physical indicators derived from such data sources, which may be useful for tracking and predicting changes in the physical state of the Gulf of Mexico."}, {"section_title": "Atlantic Multidecadal Oscillation", "text": "The Atlantic Multidecadal Oscillation (AMO) is a climate mode in the North Atlantic, occurring on multidecadal time scales. The AMO index is typically calculated by taking the mean of sea surface temperatures over the North Atlantic (0°N to 60°N and 75°W to 7.5°W) and detrending the time series to account for the effects of global warming [4,5]. Like other modes of variability (e.g., El Niño Southern Oscillation), the AMO has impacts on a large part of the earth via atmospheric teleconnections, and has been linked to climate patterns in North America, Europe and Africa [6,7]. The AMO has been linked to a number of drivers and pressures influencing the Gulf of Mexico, such as precipitation in the Midwest [7], hurricane activity [8], depth of the mixed layer, and the size of the Atlantic Warm pool [9] (see below and Section 3: Physical Pressures). Additionally, the AMO can influence marine organisms directly through temperature-dependent physiological effects, or indirectly via changes in physical ocean properties due to mechanisms such as those mentioned above [10]. There is no universal agreement as to how much of the AMO is caused by natural variability in the climate as opposed to anthropogenic variability, but likely it is a mix of both [11]. The AMO was in a warm phase from the 1920s to the 1960s, a cold phase from 1970s to the early 1990s, and then changed back to a warm phase in the mid-1990s ( Fig.  2.1). The long period of fluctuation of the AMO, together with the lack of data for the Gulf of Mexico prior to the 1980s, makes it difficult to distinguish the effects of broad climate variability versus other anthropogenic pressures which have consistently increased over the same time period. Overall, the effect of the AMO on marine ecosystems is not yet well understood [10]."}, {"section_title": "Atlantic Warm Pool", "text": "The Atlantic Warm Pool (AWP) is a large body of warm water in the Gulf of Mexico, Caribbean Sea and the western tropical North Atlantic (TNA), immediately east of the Lesser Antilles. The AWP index is calculated by summing the total area of sea surface temperature greater than 28.5°C in the Atlantic basin [12]. Typically, the maximum annual extent of the AWP is reached in August or September. Historically, when the spatial extent of the AWP is large and the associated maximum temperature of this region is high, the boreal summer climate patterns tend to be characterized by greater hurricane activity, weakened trade winds across the TNA and Caribbean, and reduced moisture transport into North America across the U.S. Gulf coast, resulting in increased rainfall in the Caribbean region and decreased rainfall east of the Rocky Mountains [7]. A large AWP tends to reflect an increase in SSTs over the Gulf of Mexico, and possibly an increase in the depth and intensity of the surface mixed layer, thought to be of importance for intensification of landfalling hurricanes in the United States [8], as well as the schooling and spawning behaviors of certain  fish species [13]. Certain remote climate fluctuations during the late boreal winter and early spring are associated with subsequent large warm pools: 1) Pacific El Niño conditions that persist into the early spring; 2) a persistent negative phase of the North Atlantic Oscillation (NAO); and 3) a weak atmospheric convection and rainfall over the Amazon basin. Conversely, La Niña conditions, a positive NAO phase, and strong rainfall over the Amazon basin, are associated with subsequent small warm pools [14,15]. Currently, the AWP is somewhat larger than the historical average ( Fig. 2.2, bottom), primarily due to a persistently negative North Atlantic Oscillation over the last half year, associated with weakened easterly trade winds and reduced evaporation across the TNA. Over the last 25 years, the AWP area has gradually increased, consistent with a generalized warming of the North Atlantic associated with a change in phase of the Atlantic Multidecadal Oscillation from cool to warm, and with a positive secular trend in SST globally due to the warming influence of greenhouse gases. Because a large summer AWP tends to be associated with an early expansion of the warm pool in the late spring and early summer, there is a gradual tendency for the maximum AWP size to occur earlier in the year (Fig. 2.2, top)."}, {"section_title": "Sea surface temperature", "text": "Similar to the Atlantic Warm Pool index, the average offshore sea surface temperature reflects the general trend in warming over the past several decades. Mean and maximum monthly mean sea surface temperatures were calculated for the offshore domain (>200m depth) of the Gulf of Mexico using Advanced Very High Resolution Radiometer (AVHRR) satellite data ( Fig. 2.3). Maximum monthly mean temperatures are increasing at a faster rate than mean temperatures, indicating that extended periods of anomalous warm temperatures, particularly in the summer months, are becoming increasingly common. Increasing temperatures will have consequences for marine organisms, particularly those living near their upper threshold [16]. For example, coral bleaching and subsequent death are common when temperatures are sustained above 30.5°C. Range shifts in both fish stocks and their associated fishing fleets are commonly seen in response to temperature [6,17]. The Gulf of Mexico is unique in that it is a semi-enclosed basin with a terrestrial border to the North. Thus, stocks which may normally migrate north to find cooler waters will have to employ other mechanisms for adaptation or migration, or may suffer additional mortality. The effects of increased warming on species within the Gulf of Mexico are somewhat uncertain. For example, Muhling et al. [13] have predicted that by the end of the 21 st century, the Gulf of Mexico will contain almost no suitable bluefin tuna spawning habitat during the typical months of spawning. In such situations, it is difficult to predict whether the spawning stock will respond by adaptation or migration to alternative spawning locations, adding uncertainty to forecasts of future stock states. "}, {"section_title": "Northern extent of the Loop Current", "text": "The Loop Current (LC) is the dominant circulation feature in the Gulf of Mexico and thus is responsible for driving many physical and biological processes in the region. The LC emerges through the Yucatan Channel, transporting warm water from the Caribbean into the Gulf, and then loops Eastward through the Florida Straits to eventually become the Florida Current. The location of the LC varies widely through time, and with a frequency of 3-17 months, the current separates from itself and forms a large anticyclonic eddy in a process known as ring formation [18]. One metric of the location of the LC is its northernmost location, which acts as a measure of its overall intrusion into the Gulf. The weekly location of the LC front has been determined for the period of 1993 -2010 from remotely sensed data on sea surface height [19,20]. The northernmost monthly latitude of the LC is 28.30ºN, and location varies from 24ºN to 28ºN (Fig. 2.4). The location of the LC in summer (July through August) is significantly farther north than in the fall season, with winter and spring having values closer to the mean. Between 1993 and 2002, the mean location of the LC northward penetration was 26ºN, below the annual mean. Conversely, between 2003 and 2009 the mean location of the LC northward penetration was 27ºN, above the annual mean [20]. Because the LC is largely responsible for spatial differences in water mass properties throughout time, its behaviour is expected to drive changes in phytoplankton, zooplankton, and ichthyoplankton communities. For example, higher abundances of fish larvae occur during years of high northward penetration in a region that was crossed by the LC during its excursions [19]."}, {"section_title": "Geostrophic transport in Yucatan Channel and Florida Current", "text": "Transport across the Yucatan Channel carries warm upper ocean water from the Caribbean Sea into the Gulf of Mexico, and thus plays an important role of maintaining the temperature in the Gulf of Mexico. Geostrophic volume transports across the Yucatan Channel and the Florida Current transport at 27 o N, are estimated from altimetry-derived weekly sea surface height fields and are in the units of Sverdrup (m 3 s -1 ). The geostrophic balance equation dictates that the east-west difference in sea surface elevation should be balanced by northward geostrophic current. Thus, the volumetric transport across the Yucatan Channel can be estimated from the sea surface height difference between the two sides of Yucatan Channel. The same methodology is used to estimate the Florida Current transport, by using the sea surface height difference between the coast of Florida and Bahamas [21]. Both the Yucatan Channel transport and the Florida Current transport exhibit large amplitudes of variability at the seasonal and interannual time scales (Fig. 2.5). It is widely believed that both the wind-driven and thermohaline-driven components contribute more or less equally to the mean Florida Current transport. However, earlier studies have suggested that interannual variability in the Florida Current transport is largely wind-driven and associated with the North Atlantic Oscillation [22]. The variability of volume transport across the Yucatan Channel may have strong impacts on the marine ecosystem in the Gulf of Mexico. For instance, while bluefin tuna can tolerate colder waters than other tropical tunas, they are adversely affected by warm (> 28°C) waters, and show spawning patterns to avoid warm features in the Gulf, such as the Loop Current [13]. Therefore, a long-term increase in the volume transport across the Yucatan Channel may reduce the bluefin tuna's spawning habitat, while a decrease in the transport may increase the spawning habitat [23]."}, {"section_title": "PHYSICAL PRESSURES", "text": "Physical pressures on the ecosystem may result from either climatic or anthropogenic causes, or a combination thereof. Human development near coastlines will inevitably increase the risk of chemical and biological contaminants entering the ecosystem. Activities and development far from coastlines may also have an effect on marine ecosystems. The Gulf of Mexico is the drainage basin for the Mississippi River watershed, the largest watershed in North America. The watershed covers at least part of 31 states, including heavily farmed lands of the Midwestern United States, as well as parts of Canada. The Gulf of Mexico is thus directly affected by land use and habitat changes throughout a large portion of the United States. Such changes can be exacerbated by climatologically-driven pressures; for example, increased precipitation could increase the transport of land-based pollution into the marine environment. Here we present a range of physical pressures which have potential to influence the integrity of both human and biological communities."}, {"section_title": "Hurricane activity", "text": "The Gulf of Mexico is a major area of hurricane activity, receiving an average of 4 named storms per year. The Accumulated Cyclone Energy (ACE) index is a measure of storm activity which takes into account both the number and strength of storms [24]. The ACE index was calculated for the Gulf of Mexico basin alone, using averaged 6-hour storm tracks from the National Climate Data Center's International Best Track Archive for   Climate Stewardship (IBTrACS) database. The index shows a decreasing trend in hurricane activity from 1960 -1990, followed by an increasing trend since the 1990s (Fig. 3.1). The ACE index peaks in 2005, the most active hurricane season on record for the Atlantic basin. Trends in the ACE mimic those seen in the Atlantic Multidecadal Oscillation, which is thought to have an influence on Atlantic hurricane activity [8]. While hurricanes typically have negative effects on human communities, they may indirectly provide certain benefits to some biological communities. For example, hurricane passage and subsequent mixing of surface waters may alleviate heat stress on coral reefs, preventing bleaching and death [25]. Appropriately-timed hurricanes in the northern Gulf of Mexico can also alleviate bottom hypoxia by promoting mixing between oxygenated surface layers and deeper hypoxic waters [26]."}, {"section_title": "Northern Gulf hypoxia and drivers of hypoxia", "text": ""}, {"section_title": "Mississippi River basin load, streamflow and watershed precipitation", "text": "Low dissolved oxygen, or hypoxia (defined as oxygen levels <2mg l -1 ) is a growing global phenomenon, particularly in coastal shelf waters adjacent to highly productive coastal estuaries. The northern Gulf of Mexico shelf is home to one of the largest seasonal hypoxia events in the world. Hypoxia in this region results from riverinederived nutrients, primarily nitrogen, from the Mississippi River watershed, as well as salinity stratification of oceanic waters which reduce mixing of bottom waters. Nutrient inputs in the Mississippi River watershed occur from a variety of nonpoint sources, the largest of which is agricultural lands in the Midwest region [27]. Upon entering the Gulf, excess nutrients stimulate the production of large amounts of phytoplankton, not all of which can be incorporated into the food web. These phytoplankton eventually die and sink to the bottom of the ocean where they decompose, consuming large amounts of bottom water oxygen. When the oxygen consumption rate is greater than the rate of oxygen replenishment from the surface, dissolved oxygen concentrations decrease, leading to hypoxia. Total nutrient inputs to the Gulf of Mexico are a function of the amount of nutrients input within the watershed, precipitation which causes runoff of unused nutrients into water bodies, and stream flow which carries the nutrients to the ocean. Because agricultural activities are a major source of nutrient input in the watershed, an index of fertilizer consumption is developed. Fertilizer consumption by state is reported by the U.S. Department of Agriculture, and values for states within the Mississippi River watershed are summed to estimate changes in consumption for the watershed (Fig. 3.2). This index shows an overall increasing trend from 1960 -2008, likely due to increasing agricultural growth and productivity over this period. Estimates of annual Mississippi River basin mean precipitation are derived by merging river gauge data, satellite estimates, and numerical model predictions ( [28]; K. Dunne, pers. comm.). These estimates vary greatly from year to year, reflecting the influence of large-scale climactic variation throughout the region. Stream flow estimates, based on river gauge data and total basin loads, extracted from water quality sampling protocols, are reported by the U.S. Geological Survey. Because stream flow is the delivery mechanism for nutrients to the Gulf, estimates of stream flow and basin loads are highly correlated (Fig 3.2; [29]). The average annual basin load of nitrogen is approximately 140,000 metric tons. Nitrogen load into the Gulf of Mexico reached a maximum in 1993, as a result of extensive flooding in the upper Mississippi River drainage basin, which was brought on by anomalously high precipitation in the fall and winter of 1992-1993 and the ensuing spring snowmelt [30]."}, {"section_title": "Area and spatial extent of the hypoxic zone", "text": "Sufficient concentrations of oxygen in the subsurface depths of the ocean are critical to maintaining a healthy and productive marine ecosystem. Benthic organisms may die when exposed to extended hypoxic conditions, and mobile organisms may move out of the area, reducing fishery catch rates. In the Gulf of Mexico, hypoxic events are most common during the summer months (June-August), and in the shelf waters off of the Louisiana coast. The spatial extent of the Gulf of Mexico hypoxic zone has been monitored regularly since 1985 by the Louisiana Universities Marine Consortium. Bottom water dissolved oxygen is also measured regularly as part of the fishery-independent Southeast Area Monitoring and Assessment Program (SEAMAP) trawl and hydrographic survey which has been conducted bi-annually since 1981. Estimates from these two monitoring programs are in agreement, and show an overall increasing trend in the spatial extent of hypoxia ( Fig. 3.3), most likely in response to a large increase in nitrogen load to the Gulf in past decades [31]. An increasing trend in extent of hypoxia can also be seen in the average dissolved oxygen concentrations on the continental shelf, which appear to be decreasing over time (Fig. 3.4). The largest  declines in shelfwide bottom dissolved oxygen levels have occurred during the summer on the Louisiana shelf, although levels have also been declining off of Texas, where hypoxia is typically less severe. The severity and spatial extent of the hypoxic zone varies greatly from year to year, due to local and regional climate variability and ocean dynamics [31]."}, {"section_title": "Chemical contaminants", "text": ""}, {"section_title": "Mercury and cadmium concentrations", "text": "Chemical contaminants in the marine environment may be indicators of human activities far from the ecosystem, as well as more localized sources of pollution. NOAA's National Status and Trends Mussel Watch Program (MWP) monitors organic and metal contamination in coastal sediments and bivalve mollusks, which are efficient accumulators of toxins. Theoretically these contamination levels should be good measures of current pollution in coastal and estuarine waters. However, contaminant levels may undergo short-term fluctuations due to episodic events. For example, the concentrations of heavy metals tend to increase in the soft tissues of oysters after the passage of hurricanes, which cause flooding and transportation of pollutants [32]. Mercury is a highly toxic heavy metal that is found both naturally and as an introduced contaminant in the environment.   Total mercury in sediment (ppm) Methyl mercury in oyster tissue (ppm)  Inorganic mercury can be transformed by bacteria to methyl mercury, the most toxic form of mercury. Sources of mercury in the Gulf of Mexico are also linked to contributions from the Mississippi River transport, offshore oil and gas operations and past chlor-alkali plants. The primary routes of mercury pollution of the Gulf of Mexico's aquatic ecosystems are via wet depositions, whereby contaminants are flushed from the atmosphere by precipitation events. The highest total mercury concentrations were found in sediment at the sites located in Tampa Bay (FL) and Matagorda Bay (TX; Fig. 3.5, top). Methyl mercury concentrations were also elevated in oysters from these areas, as well as Florida Bay (Fig. 3.5, bottom). Total mercury in tissues shows fairly static temporal trends along the central and western Gulf coast, while strong decreasing trends were observed in the eastern Gulf (Fig. 3.6). Gulf of Mexico oyster and tissue samples showed slightly elevated mercury concentrations relative to the longterm Mussel Watch national medians. The heavy metal cadmium is also of particular interest in the Gulf because it is potentially toxic to humans and aquatic wildlife at high concentrations, and it has anthropogenic sources that are likely to impact coastal and estuarine concentrations. Cadmium concentrations in sediment have been found to be significantly correlated with human population, implying that they may to some extent be linked to urban development [33]. However, Cd concentrations in sediment and those in oyster tissues are poorly correlated, perhaps due to the diagenetic nature of Cd, which influences Cd bioavailability in the redox layer of sediment [33]. High tissue concentrations of Cd were mainly found in bivalves from the northwestern and central Gulf of Mexico, but at none of the monitoring sites did Cd concentrations exceed the U.S. FDA's permissible action level for human exposure through shellfish consumption. A study of Mexican lagoons in the 1990s showed that Cd oyster tissue concentrations were lower in Mexican waters than in those of the United States, but that concentrations of Cd in sediments were comparable between regions [34]."}, {"section_title": "Oil rigs and oil spills", "text": "The Gulf of Mexico is one of the most important regions for U.S. energy resources and infrastructure, both onshore and offshore. Gulf of Mexico federal offshore oil production accounts for 23 percent of total U.S. crude oil production, and federal offshore natural gas production in the Gulf accounts for 7 percent of total U.S. dry production. Over 40 percent of total U.S. petroleum refining capacity is located along the Gulf coast, as well as 30 percent of total U.S. natural gas processing plant capacity [35]. Besides energy production, oil platforms also provide structural habitat for many species of fish, and as such are focal points for fishing   (Fig 3.7). However, the annual rate of increase has been declining since the mid-1980's ( Fig. 3.8). The number of oil spills occurring in the Gulf of Mexico has shown a slight increasing trend since 1992 (Figure 3.7), likely due to increased hurricane activity in the last decade which has brought on a higher number of minor spills."}, {"section_title": "Biological contaminants", "text": ""}, {"section_title": "Sediment concentration in rivers", "text": "Sediment eroded from land and streambeds is transported towards the Gulf as both: 1) a suspended load, traveling in the water column at about the same speed as the water, and 2) a bed load, which bounces and rolls along the bottom at a substantially lower speed. The suspended load is typically measured as concentration designated as total suspended solids or suspended sediment concentration, with the difference lying in how water plus sediment samples are analyzed. Bed load measurements are difficult and data are limited in the coastal zone. Most sediment transport measurements are of the suspended load, so they are heavily weighted toward the finer grain sizes -clays, silts, and very fine sands -and underestimate the total sediment load. Defining the delivery of river sediments to the Gulf is complicated by the physical processes of the coastal zone -estuarine circulation traps sediments originating from the river and from the Gulf, and the constantly changing slope of the water surface makes discharge measurements difficult. As one result, few permanent measurement stations are located close to the coast. The best long-term data for total suspended solids for the Mississippi River is from the Corps of Engineers gage at Tarbert Landing, about 524 km upstream from the Gulf (Fig. 3.9) [36]. A trend of decreasing sediment load in the Mississippi River at Tarbert Landing, over the  past 50 years, has been confirmed at other measurement locations. Speculated causes of the decline have included sediment trapping by upstream dams, reduction of bank erosion by armoring, and reduction of land erosion by improved farming and soil conservation practices; however, solid evidence for any of these is lacking [37]. Large declines since 1950 may simply be a natural cycle, or the tail of a 1930's era dustbowl pulse of sediment."}, {"section_title": "Bacterial water quality indices", "text": "Enterococcus bacteria are typically used as an efficient indicator of water quality, as their presence is well-correlated with other disease-causing bacteria which are more difficult to detect. Bacterial water quality is typically expressed as a function of colony forming units per unit volume of water. Water quality monitoring programs have been carried out for approximately a decade at recreational beaches in four states [38]. Beaches are recommended for closure when the concentrations of Enterococci exceed 104 CFU per 100mL [39]. The concentration of Enterococcus in beach waters is intended to be a measure of fecal contamination into the water body, from either human-or non-human sources. However recently it has been suggested that these bacteria can survive and reproduce on beach sand, and then can be resuspended into sea water during large tidal or precipitation events [40]. Large anomalies in beach water quality exceedances, such as those occurring in Alabama in 2003 ( Fig. 3.10) are likely be more indicative of isolated weather events than the overall human population pressure affecting an area."}, {"section_title": "STATE OF BENTHIC HABITATS", "text": "Within the northern Gulf of Mexico there are numerous benthic habitat types of both ecological and economic value. By area, the greatest of these is the soft sediment abyssal plain. It is expected that broad scale pressures such as climate change will eventually impact this vast region. However, scant data are available for understanding and quantifying spatial and/or temporal changes within this region. Similarly, there are few long-term synoptic datasets available with which to quantify the status and trends of corals inhabiting the Gulf of Mexico. From an areal perspective corals comprise a relatively small proportion of benthic habitat within  the Gulf of Mexico, particularly if the well-studied Florida Reef Tract, located at the boundary of the Gulf of Mexico and the southeastern United States, is excluded. Within the Gulf, corals are divided into two broad groups: deepwater/coldwater coral reefs (i.e. reefs > 50m water depth; [41]) and shallow/mesophotic coral reefs. Deepwater coral habitats are becoming better understood, but their depth makes them challenging to study, and relative to shallow corals reefs investigations of these unique ecosystems have been few. Arguably the best-studied coral reefs in the northern Gulf of Mexico are located within the Flower Garden Banks National Marine Sanctuary (FGBNMS). The FGBNMS coral reefs are relatively remote; they are approximately 160 km from mainland near the Texas/Louisiana state border. Three distinct regions, East and West Flower Garden and Stetson Banks, are protected as part of the FGBNMS. The two Flower Garden Banks cover approximately 150 km 2 of which ~1.4 km 2 is coral reef. Relative to coral reefs in the wider Caribbean these reefs have low coral species diversity (n = ~21 species at Flower Garden banks and ~10 species at Stetson Bank; [42]). In contrast, percent live coral cover of Gulf of Mexico coral reefs is almost twice as high as coral cover at other reefs in the wider Caribbean (~ 50% at depths shallower than 30m, and up to 70% in deeper waters; [43]). However these data have only been generated over the past 10-15 years, and time series data describing status and trends of deep/coldwater corals are shorter still. Continued monitoring will be required to understand how these coral reefs respond to potential stressors, and to ensure our ability to accurately assess spatial and temporal changes in the future. Nearshore benthic habitats have been more thoroughly studied for longer periods of time, and hence our understanding of status and trends in these areas is greater.  [44] for an example application of CMECS)."}, {"section_title": "Oyster Reefs", "text": "Oyster reefs are important structural components of estuaries, lagoons, and bays. The dominant species comprising oyster reef communities of the east and Gulf coast is Crassostrea virginica. Within the Gulf of Mexico the preferred habitats of oysters are shallow bays, mud flats, and offshore sandy bars [45]. Oyster reefs create important habitat for more than 200 species including a multitude of fish and invertebrates. When feeding, adult oysters filter large volumes of water -up to 1500 times the volume of an individual per hour. Through the active filtration of water, oysters play a critical role in maintaining the quality and clarity of estuarine waters. Due to a number of factors including habitat degradation, overfishing, changes in hydrology, pollution and disease, there has been widespread loss of oyster reefs within estuaries of the east and Gulf coasts of the United States. Over the past century data suggest the areal coverage and biomass of oyster reefs has declined 64% and 88%, respectively [46]. Within estuaries of the Gulf coast states, similar declines in areal extent and associated filtration capacity have been documented. In six of eight estuaries spanning from Corpus Christi Bay, Texas to Apalachicola, Florida there has been a decrease in the areal extent of oyster reefs, and in seven of those eight estuaries decreases in oyster density and filtration capacity have been documented ( Fig. 4.1)."}, {"section_title": "Seagrasses", "text": "Seagrasses are a form of submerged aquatic vegetation that comprises a critical component of coastal ecosystems. In the northern Gulf of Mexico six species of seagrasses are common. Despite the fact that seagrasses can tolerate a wide range of temperatures and salinities, these six species, like all seagrasses, require overall high water quality and clarity to thrive. Seagrasses act as valuable habitat for various species of marine plants and animals that are both economically and ecologically important. These include protected species such as manatees (Trichecus manatus) and green sea turtles (Chelonia mydas), commercially important finfish including sea bass and snapper species, and shellfish such as spiny lobster and pink shrimp. Based on a recent compilation of monitoring data on the status of seagrasses throughout the northern Gulf of Mexico [47], it appears that most locations have experienced degradation and/or loss of cover in recent decades (Fig. 4.2). These losses have been attributed to natural and anthropogenic perturbations. Natural perturbations such as hurricanes have typically acute impacts on seagrass beds through increased wave action and erosion, as well as through increased turbidity which limits the ability of seagrass to photosynthesize. Anthropogenic impacts are typically chronic in nature, resulting in more widespread and protracted degradation; losses of seagrass beds caused by nutrient loading, total area of seagrass (hectares)  coastal development, dredging, and boating activities can result in the permanent loss of valuable habitat."}, {"section_title": "Mangroves", "text": "Mangroves inhabit tidally influenced regions along sheltered coastlines of lower latitudes, commonly along intertidal mud flats and the shorelines of estuaries. They inhabit the zone inshore of seagrasses and offshore of salt marshes. In regions with large tidal amplitudes mangroves may extend their range inland along the banks of rivers, at times forming large stands in river deltas. Mangrove keys may also occur within lagoon complexes associated with barrier reefs and tidally influenced bays. In the continental United States there are three species of mangrove: Avicennia germinans (black mangrove), Laguncularia racemosa (white mangroves), and Rhizophora mangle (red mangroves). Through their dense stands mangroves form critical nursery habitat for a diversity of animals, reduce erosion, and mitigate damage from coastal storms. Over the past century mangroves have experienced large declines in abundance and areal extent, due primarily to habitat loss associated with the conversion and development of coastal regions of the world (see Section 8. Socioeconomic Indicators -Population and Development Trends). In the northern Gulf of Mexico, the largest losses of mangrove habitat have been around expanding urban centers; but in recent years there has been a slight increase (0.26%) in the areal extent of mangrove forests (calculated as a percent change in mangrove cover for coastal counties; Fig. 4.3). This apparent increase between 1996 and 2006 could be attributed to various factors. First, coastal counties of the Gulf Coast region represent the northern range of mangrove habitat; fewer frost days associated with climate change may enable the survival of mangrove seedlings through the winter [48]. Additionally, eustatic sea level rise results in greater and more frequent inundation of coastal regions (see Marsh Flooding below). This increased inundation creates novel mangrove habitat in coastal estuaries and may enable the colonization and expansion of mangroves in the northern portion of the Gulf of Mexico."}, {"section_title": "Coastal Wetlands", "text": "Numerous habitats are classified as coastal (or emergent) wetlands within the Gulf of Mexico. These include hydro-and often halophytic vegetative communities inhabiting tidally influenced freshwater, brackish, and saltwater marshes spanning the entire Gulf coast from Texas to Florida. The vegetative communities comprising these regions are frequently found in parallel zones of biological communities with similar tolerance limits; gradients in tidal inundation, salinity, temperature, and water chemistry set the upper and lower boundaries of communities. Because of the diversity of biotic communities found within coastal wetlands, they represent critical habitat for a wide range of associated  plant and animal species, and provide a multitude of ecosystem services to the human population, from solely recreational to fully extractive opportunities. Coastal communities within the Gulf of Mexico, like other regions of the United States, have experienced tremendous growth over the past 50 years. This increase in anthropogenic influences to coastal zones, through increased demand for natural resources and associated transformation of the natural biotic communities, will place growing pressure on coastal wetlands. In the decade spanning from 1996 -2006 the percent cover of coastal wetlands in coastal counties of the Gulf of Mexico decreased by 1.04% (Fig. 4.3). If this rate of habitat loss remains constant through the next century an additional 10% of the already diminished area comprising aquatic wetlands will be lost by 2100. However, if population-related pressures increase more rapidly over the next century, this value represents only a conservative estimate of the percentage of coastal wetlands that may be lost to coastal development. Trends of wetland loss are likely very important in the Gulf of Mexico as an indicator of system health and fishery production [49]. The CCAP data provides a synoptic look at trends over the entire northern Gulf of Mexico, although it only provides a glimpse into a few select time periods [50]. Trends of higher temporal resolution may be obtained for smaller spatial domains within the Gulf of Mexico, particularly in the state of Louisiana (e.g., [51]) and these should be considered for further indicator development."}, {"section_title": "Marsh flooding", "text": "Salt marshes in estuaries of the Gulf of Mexico are important habitats that support many fishery species including penaeid shrimps, blue crabs, red drum, and spotted seatrout [52]. Because salt marshes are intertidal habitats, flooding of the vegetated edge controls access to the marsh surface and appears to be important in determining the value of this habitat for fishery species [53,54]. Annual flooding of the marsh edge from Aransas Bay, TX to Barataria Bay, LA, has been shown to be positively correlated with use of the marsh surface by shrimp and crabs [54]. Thus, the extent and duration of marsh flooding may act as valuable indicators of productivity for decapod crustaceans. The fate of salt marshes in relation to sea level rise is uncertain because the rate that marshes can adjust to changing water levels depends on a variety of factors, such as organic content of sediment, sources and availability of inorganic sediment and nutrients, and productivity of marsh plants [55,56,57]. The close relationship, however, between tidal range and the elevation of the marsh edge in relation to Mean Low Water over a wide geographic range, suggests that the elevation of marsh edge will respond to changes in sea level if the tidal range does not change. A potential marsh flooding indicator is presented here using data from the Grand Isle tide gauge in Barataria Bay, LA. The longterm annual trend in water level on this gauge shows an average increase of 0.64 cm year -1 from 1981 to 2011 ( Fig. 4.4). Assuming that eustatic sea level rise in the Gulf of Mexico was around 0.18 cm year -1 [58], these data   (Fig. 4.5). Additional information is needed to understand how this flooding indicator is affected by sea level rise, and whether the indicator can be associated with temporal trends in shrimp and crab abundance."}, {"section_title": "STATE OF LOWER TROPHIC LEVELS", "text": "In this section we present indicators of lower trophic levels, spanning from primary production up to some of the lower-trophic level species of commercial importance. Changes in primary productivity may be caused by physical forces, such as hurricane activity which can serve to drive increased mixing of oceanic surface layers, or anthropogenic forces, such as increased nutrient inputs into the Gulf. Variations in primary production patterns in turn drive changes in zooplankton, invertebrates, and forage fishes. Indicators of ichthyoplankton abundance are also included in this section; while these species are considered members of upper trophic levels in their adult stages, the larval stages are often linked to patterns in primary and secondary production."}, {"section_title": "Primary Productivity", "text": "Phytoplankton form the base of the pelagic food chain and thus are the primary energy source for many species. Chlorophyll a is an accepted proxy for phytoplankton biomass and an accepted indicator of eutrophication in the marine environment [59]. Primary productivity and thus chlorophyll a in the Gulf of Mexico is largely driven by riverine nutrient inputs. Monthly median chlorophyll a was calculated from Sea-viewing Wide Field-of-view Sensor (SeaWiFS) satellite imagery for 3 coastal regions and the offshore region (>200m depth) in the Gulf of Mexico, on a weekly basis from 1998 through 2010. As expected, chlorophyll a in the coastal regions is higher than offshore, and the area surrounding the Mississippi River has higher concentrations of chlorophyll a than either the Campeche Bank or the west Florida shelf (Fig.  5.1). The timing of peak chlorophyll a concentrations, indicative of seasonal phytoplankton, blooms vary among the regions. Seasonal phytoplankton blooms typically occur during the winter in the offshore region, from September through February on the west Florida shelf, from January through July near the Mississippi River, and from October through January on the Campeche Bank. This variability in timing is likely due to differences in riverine discharge. Runoff from the Florida Peninsula peaks during and after the wet season in the late summer to early winter [60]; whereas, Mississippi River discharge typically peaks from January through June. The Campeche Bank has a secondary peak in chlorophyll during the summer as well. On the west Florida shelf there was an anomalous year with high chlorophyll a concentrations for a longer period than typical in 2005. This might be a result of the four hurricanes that passed over % observations above detrended edge height % observations above edge before detrending the west Florida shelf and a red tide bloom that persisted for that entire year. A second anomaly in 1998 was present in both the west Florida shelf and Mississippi River regions, when chlorophyll a was higher than typical and remained elevated throughout nearly the entire year in both areas."}, {"section_title": "Harmful Algal Blooms", "text": "The Florida Fish and Wildlife Conservation Commission maintains a large database of red tide events on the southwest Florida shelf that details the occurrence of red tide blooms on the southwest Florida shelf starting in 1844 [61]. However, a statistical analysis of this dataset found that it could not be used to investigate if red tide frequency or severity has been increasing over its period of record, due to a lack of consistent sampling effort."}, {"section_title": "Zooplankton biomass", "text": "Zooplankton are a vital link in the trophic web, transferring energy from singlecelled primary producers to upper trophic levels [62]. They are often the dominant herbivores in the marine environment and responsible for a large proportion of secondary production. Zooplankton are sampled in the northern Gulf of Mexico as part of the Southeast Area Monitoring and Assessment Program (SEAMAP). These data were standardized to develop an      abundance index of overall zooplankton biovolume (ml/m 3 ). The standardization kept only sample locations that were repetitively sampled during the same season. Only the spring and fall sample surveys had enough data to develop standardized time series. These two surveys are also spatially distinct with the fall sampling located in nearshore environments; whereas the spring sampling occurred further offshore ( Fig. 5.2). Given these spatial differences, it is not surprising that zooplankton biomasses in the spring are roughly 25% of those observed in the more nearshore environment during the fall. The spring zooplankton index displays no clear trend across the observed time period. In contrast, the fall zooplankton abundance shows a decreasing trend from 1998 until the last samples available in 2002. Prior to 1998, the mean abundance in the fall was relatively stable."}, {"section_title": "Ichthyoplankton abundance", "text": "Abundance indices based on larval fish collections have been used as population monitoring tools for decades in several Large Marine Ecosystems. Larval abundances are expected to track adult spawning stock biomass, and have been shown to be useful for this purpose for both exploited and unexploited species in the California Current region (e.g., [63]). Plankton samples have been collected across the northern Gulf of Mexico under the Southeast Area Monitoring and Assessment Program (SEAMAP) since 1982. Larval fish data from these collections were used to formulate indices of abundance for benthic, pelagic and mesopelagic fish families. To account for variability in sampling practices over the years, the influence of water depth, day of the year, and longitude on abundances of each family were first modeled using multilayer perceptron neural network models. Observed larval abundances were then subtracted from predicted values to give residuals, which were used in all further analyses. These residuals thus describe departures from an expected long-term mean, given position in the Gulf of Mexico, and day of the year. Two key results from these analyses were the apparent increase in abundance of common mesopelagic fish larvae over the past 25 years (Fig. 5.3, top two panels), and a decrease in abundance of some flatfish larvae (Fig. 5.3, bottom two panels). These larval time series may reflect changes in adult biomass caused by environmental variability, such as warming temperatures, changes in fishing pressure, and changes in survival and recruitment rates of early life stages [64]. In addition, effects of top predator removal and habitat modification may be significant, but are difficult to quantify. The role of mesopelagic species, in particular, in Gulf of Mexico food webs is unclear. Improved understanding of food web dynamics may be required before the drivers behind observed changes in larval abundances are more fully understood."}, {"section_title": "Northern Gulf shrimp abundance", "text": "Since its inception in the early 1900s, the Gulf of Mexico shrimp fishery has been one of the most valuable fisheries in the United States, with over 20,000 vessels making greater than 300,000 fishing trips a year and generating over $500 million in landed value during the peak of the fishery. The fishery primarily targets three species: brown shrimp (Farfantepenaeus aztecus), white shrimp (Litopenaeus setiferus), and pink shrimp (F. duorarum). Abundance indices are regularly calculated for important fishery stocks to examine historical trends in production, and to assess the long-term sustainability of fishery resources. An index of relative abundance for all penaeid shrimp has been calculated based on an annual trawl survey, conducted as part of the Southeast Annual Monitoring and Assessment Program (SEAMAP; Fig. 5.4) [65]. These data apply to the continental shelf, from the shore to approximately 100 m depth, but are not reflective of trends in inshore estuaries. Temporal trends in shrimp abundance show a long period  of relative stability in abundance, followed by a 9 year period of increasing abundance culminating in an almost doubling of the relative abundance of shrimp since the early 2000s. This period of rapid increase in relative abundance coincides with reductions in commercial shrimping. Declines in effort in the last decade have been driven by increasing imports of lessexpensive farm-raised shrimp, rising fuel  costs, and loss of shrimp vessels and infrastructure associated with hurricanes (e.g., Katrina) and other recent storms."}, {"section_title": "Southern Gulf shrimp abundance", "text": "As in the United States, shrimp forms the basis of one of the most important fisheries in Mexico, and is the leading fishery in terms of value, exports, and employment [66]. Because of their economic value, shrimp species are the most studied fishery resource, and basic data on growth, fecundity and recruitment have been collected. Trawling for shrimp in Mexico started in the late 1920s, and from the 1960s to early 1970s, U.S. vessels were allowed to fish in Mexican waters; this was ended by treaty by the late 1970s. Currently there are both artisanal fleets, fishing inshore lagoons and estuaries (numbering approximately 80,000 vessels 6-9 m in length), and industrial fleets which concentrate effort offshore (approximately 700 vessels in number; [66]). In the Gulf of Mexico, the primary exploited shrimp species are: northern brown shrimp (Farfantepenaeus aztecus), pink shrimp (F. duorarum), white shrimp (Litopenaeus setiferus), redspotted shrimp (F. brasiliensis), Atlantic seabob (Xiphopenaeus kroyeri) and crystal shrimp (Sicyonia brevirostris). Shrimp indices of abundance were extracted from stock assessment summaries listed in the National Fisheries Report Card (Carta Nacional Pesquera), published by the Mexican governmental institution SAGARPA (Secretaría de Agricultura, Ganadería, Desarrollo Rural, Pesca y Alimentación) [67]. Generally, catch-per-unit-effort for most species has declined over the past several decades (Fig. 5.5). This is likely due to increasing effort, as well as reduced recruitment, which has declined since the 1970s for unknown reasons [68]. Overcapacity in the shrimping fleet has been recognized as a problem, and currently there are voluntary decommissioning projects taking place to reduce effort on shrimp species [66]. Assessments carried out on shrimp species have shown that F. aztecus is not overfished, but that F. duorarum and Litopenaeus setiferus are overfished.  "}, {"section_title": "Menhaden abundance", "text": "The Gulf menhaden fishery is one of the largest fisheries by volume in the United States, and the highest volume fishery in the northern Gulf, averaging about 447,000 metric tons annually during 2005-2009 with an ex-vessel value of about $58.5 million. The fishery is primarily a purse seine reduction fishery for Brevoortia patronus. Fish schools are located with spotter planes, and run-around boats are used to set the large purse seines. The fishery occurs in nearshore waters (<10 miles) from Alabama to North Texas, with most of the effort focused off Louisiana. Menhaden is an important forage species, providing a mid-trophic level link between primary producers and higher-level piscivores. Annual estimates of Gulf menhaden abundance were taken from the most recent menhaden stock assessment [69] (Fig. 5.6). Estimates of abundance declined gradually from the 1950s to the late 1970s, followed by an increase in the mid-1980s. Abundance was estimated to be lowest in the late 80s to early 90s, and has been increasing since. This increase coincides with a declining number of reduction plants since the 1980s, presumably due to economic considerations (see Section 8: Socioeconomic Indicators -Fishing effort)."}, {"section_title": "STATE OF UPPER TROPHIC LEVELS", "text": "Determining the abundance of upper trophic level species, particularly those that are of commercial or recreational importance, is of primary importance to fisheries management and ultimately to society. Our ability to determine the abundance of marine organisms in the Gulf of Mexico is generally limited -for example, of the approximately 60 stocks managed in the Gulf, the status is known for fewer than half [70]. Even among species with known overfishing status, data previous to the 1980s are limited, and thus understanding current abundance patterns in reference to historical unfished conditions is challenging. Here we present abundance indices for fish species based on survey data and stock assessment reports. We also report some of the limited data that exist on potential key indicator species, such as sea turtles and mammals."}, {"section_title": "Abundance indices of fished species in the northern Gulf of Mexico", "text": "Stock assessment models incorporate a wide range of data sources, such as landings, catch-per-unit-effort trends, and life history characteristics, in order to produce estimates of stock abundance. Stock abundance trends are presented for all species in the Gulf of Mexico assessed through the SEDAR (Southeast Data, Assessment and Review) process (Fig. 6.1). Species of primary importance to commercial and recreational fisheries (e.g., red snapper, gag grouper, red grouper, and mackerel) appear to be increasing in abundance over time, whereas species of secondary importance (e.g., tilefish, sharks, and yellowedge grouper) are decreasing in abundance. One explanation for this pattern might be that the primary stocks have received the greatest amount of management attention. As these become increasingly protected through various regulatory actions, fishers may turn their efforts to secondary species to compensate for lost catches. Environmental forces may also drive increases and decreases in the abundances of some species, but the effects of physical drivers on the wider suite of species in the Gulf of Mexico has not been studied."}, {"section_title": "Abundance indices of fished species in Mexican waters", "text": "Status of stocks in the Mexican portion of the Gulf of Mexico is largely unknown, with the exception of shrimp species (see Section 5: State of lower trophic levels). For fish species, only a few assessments have been carried out for Mexican stocks. Abundance indices for two species, tarpon and yellowfin tuna, were reported in the National Fisheries Report Card (Carta Nacional Pesquera), published by the Mexican governmental institution SAGARPA (Secretaría de Agricultura, Ganadería, Desarrollo Rural, Pesca y Alimentación) [67]. The indices are highly variable from year to year, suggesting that factors other than abundance, such as gear type, vessel type, or fishing season, are influencing the values (Fig. 6.2). No other updated indices of abundance or estimates of stock abundance were found for Gulf species in Mexico from the most recent report card.   "}, {"section_title": "Green sea turtle growth rates", "text": "Somatic growth rates of sea turtles influence the age at which they reach sexual maturity, which in turn affects their population status. A number of different factors are thought to collectively influence somatic growth rates for sea turtles [71], including environment (e.g. temperature, forage availability) [72], genetic origin, and behavior [73]. Few long-term data are available to fully investigate potential effects of these factors and how they might vary over space and time, largely because overall slow growth and highly migratory behavior make it difficult to monitor sea turtles directly by recapturing individuals. As part of an effort to increase understanding of sea turtle growth patterns, bone samples were collected from juvenile green sea turtles (Chelonia mydas) that died during a cold event in St. Joseph Bay in the Florida panhandle, so that growth marks within the bones could be analyzed in a manner similar to tree rings [74]. Both these analyses and others for green turtles in different geographic regions support the hypothesis that one growth mark is deposited each year, allowing age to be estimated and for a calendar year to be assigned to each mark [75,76]. In addition, demonstration of a consistent relationship between growth mark measures and turtle carapace (shell) length made it possible to retrospectively describe lengthat-age and growth rates throughout large portions of each turtle's life, over a total time period spanning from 1998 to 2009. The results indicate that growth is highly variable among individuals, and also within individuals from year to year. Mean growth rates of different juvenile size classes varied significantly across years; patterns were most similar for the intermediate size classes that predominantly inhabit St. Joseph Bay (Fig. 6.3). Although further study is needed to characterize underlying causes, the consistency in these fluctuations suggests that growth for these size classes may be influenced by environmental factors specific to this habitat, such as water temperature and seagrass availability."}, {"section_title": "Kemp's ridley sea turtle nesting", "text": "More than 98% of nesting by Kemp's ridley sea turtles occurs near Rancho Nuevo, Tamaulipas, Mexico, with the rest of the nesting by this species scattered along the coast of the Gulf of Mexico and the southeastern United States. Nests have been counted and monitored at the Rancho Nuevo site since 1966 ( Fig. 6.4), providing a long term record of nesting that is likely representative of the population as a whole. Counts of sea turtle nests provide an index of annual population productivity and an approximate index of abundance for adult females. As with other sea turtles, individual Kemp's ridleys do not nest every year, and when they do nest, they lay a variable number of nests. Nest counts are likely to be affected by several aspects of the physical and biological environment, such as food availability, water quality, nest site availability, and water temperatures. As a result, while fluctuations in nest counts may be expected due to long-term changes in the adult female population, such as decadal increases or decreases, large annual changes would likely represent shorter-term changes in ecosystem productivity. Variation in annual sea turtle nest counts likely indicate ecosystem processes integrated over at least 2-4 year time spans and over a large spatial area in the Gulf of Mexico, particularly costal foraging areas. These foraging areas include much of the costal northern Gulf of Mexico as has been shown from telemetry studies [77]. Observed increases in nest counts, a proxy for female population size, may also be the result of protracted sea turtle protection efforts in past decades. While there is potential for use of Kemp's ridley nesting numbers as an ecological indicator, variation in remigration interval and the number of nests per female have not been well studied, and further investigation is needed."}, {"section_title": "Number of cetacean strandings", "text": "Due to their position as top predators and their ability to bioaccumulate toxins, bottlenose dolphins and other mammals can be good indicators of contaminant levels in ecosystems. In addition, marine mammal stranding data can be used to assess anthropogenic impacts on marine mammals and the marine food chain [78]. In particular, significant marine mammal die-offs may signal shifts in the ecosystem that could otherwise be difficult to detect. Cetacean strandings are reported by the U.S. marine mammal stranding network, which consists of a variety of organizations including federal, state, or local government agencies, non-profit and academic institutions, private businesses, and the public. The number of strandings reported is influenced by a number extraneous factors, including: the coverage of that geographic area by an active stranding network organization, the public's awareness of knowing where to report a stranded marine mammal and willingness to do so, and the probability of a stranded marine mammal being found. Stranding response effort varies spatially and temporally, and much of the network is operating in a volunteer capacity with limited funding. Thus, trends in the number of strandings by year should be interpreted with caution.  From 1986 -2011, an average of 384 strandings were reported in the Gulf of Mexico per year and 84% of those were bottlenose dolphins (Fig. 6.5). Unusual Mortality Events (UMEs) are defined under the Marine Mammal Protection Act as a stranding that is unexpected, involves a significant die-off of any marine mammal population, and demands immediate response (16 U.S.C. 1421h). From 1991 through 2009, 48 marine mammal UMEs have been declared in the United States. Of these, 33% included the Gulf of Mexico, and 21% involved bottlenose dolphins (Tursiops truncatus) in the Gulf of Mexico. Morbillivirus or biotoxins were confirmed or suspected contributing factors in the majority of these UMEs [79]. The largest and longest cetacean UME in Gulf of Mexico history began in February 2010 and is currently ongoing in the northern Gulf of Mexico (the Florida Panhandle through Louisiana). The investigation into this UME is ongoing and the cause is currently unknown, though morbillivirus and biotoxins do not appear to be major contributing factors to this event [80]."}, {"section_title": "Marine bird abundance", "text": "Eastern brown pelicans (Pelecanus occidentalis carolinensis) and roseate spoonbills (Platalea ajaja) were chosen as potential indicators to represent the avian portion of the Gulf of Mexico ecosystem. One of them, the brown pelican, is piscivorous, while the spoonbill is a benthic invertebrate feeding species. These avian species not only represent some of the more iconic and visible species in the Gulf, but also provide a view of the condition of higher trophic levels. Because these birds eat at or near the upper trophic level, their trends in abundance may also reflect conditions in lower trophic levels. Additionally, both of these species nest in colonies usually within mangroves, so their abundances may represent the condition of this important habitat type. The average number of observations per party-hour was calculated for the two species using the National Audubon Society Christmas Bird Count (CBC) database [81]. An abundance index was also derived from the U.S. Geological Survey Breeding Bird Survey (BBS), a large-scale roadside survey of North American birds carried out by experienced birders [82]. Brown pelicans were common residents of the coasts of all five Gulf States. In Louisiana, nesting ceased in 1961 and they disappeared from the state in 1963 due to the use of pesticides such as DDT and dieldrin. However, since the 1972 U.S. ban on the use of these chemicals went into effect, the populations have shown significant recovery in all the Gulf States [83]. The increase in abundance of brown pelicans throughout US Gulf of Mexico from 1966 to 2000 is evident in both the CBC as well as the BBS data ( Fig. 6.6, bottom). However, after 2000 the CBC indicates a slowdown in the rate of recovery, while the BBS indicates a substantial drop during this time period. According to the CBC data, roseate spoonbill populations have been trending down since about 1990 ( Fig. 6.6, top). However, the BBS data shows a marked increasing trend during this same period. Closer inspection of the data reveals that trends for the two databases in Texas are similar, while trends for Louisiana are opposing. Data for Florida from the BBS data were too sparse to support any robust conclusions. The greatest current threat to the brown pelican and roseate spoonbill is habitat loss, particularly coastal marshes and mangrove forests [84]."}, {"section_title": "FISHING INDICATORS", "text": "As increasing attention is being directed towards developing an ecosystem approach to fisheries management, more emphasis has been put on developing metrics which can describe the state of the entire biological community subject to fishing. Composite fishing indicators, such as mean trophic level, species richness, or species diversity, can be used to signal major changes in a fishery as a whole. These calculations may be based on survey data, in which case they likely reflect changes in the actual abundance of different species groups, or based on catch data, where they can reflect changes in either species abundance, or changes in fishing practices. "}, {"section_title": "Fishery-independent indicators", "text": ""}, {"section_title": "Mean trophic level", "text": "Mean trophic level index (MTLI) is a descriptive community metric used to characterize the dominant trophic level of an ecosystem. If a community or ecosystem is experiencing intense fishing pressure, or undergoing a shift in the target trophic level of its recreational or commercial fisheries, a corresponding shift in the MTLI is expected. The MTLI is calculated as the average catch per unit effort (CPUE) weighted by trophic level for all the species in a given year. In the Gulf of Mexico, the annual MTLI was calculated based on samples from the Southeast Area Monitoring and Assessment Program (SEAMAP) trawl survey, based on the 50 most abundant species in the survey. "}, {"section_title": "3.3", "text": "The index shows a variable trend, with a small increase from 3.0 to 3.2 over the 29 years of survey data analyzed (Fig. 7.1). Prior studies have suggested that increasing fishing effort should produce a negative trend in MTLI due to higher trophic level species being depleted over time [88]. In the Gulf, however, the major fisheries are for low-to mid-trophic level species that appear fairly resilient to fishing. Our results based on fishery-independent bottom trawl surveys indicate there has been little to no shift in the MTLI in the Gulf of Mexico over the last years, and are in agreement with prior studies based on other data sources [89]."}, {"section_title": "Species richness and diversity metrics", "text": "Species richness and diversity are often used as indicators of ecosystem stability, and are important to help understand the effects of natural and anthropogenic stressors on the state of the biological community. Three common measures of community richness and diversity are: species richness, species evenness, and Shannon diversity. These three metrics were calculated based on all species captured in the SEAMAP trawl survey in the northern Gulf of Mexico. Metrics were calculated separately by state (Louisiana and Texas) and season (summer and fall surveys). Species richness in Louisiana waters (Fig. 7.2, top left) shows a period of increase from 1983 until the early 1990s, a period of stability through the 1990s, and a period of rapid decline after 2002. Fall and summer surveys for the Louisiana shelf show the same general pattern, although species richness is generally higher in the fall than the summer. Species richness on the Texas shelf shows a rapid increase until 1987 for both seasons, after which richness values gradually decline, particularly for the fall season. Overall there seems to be an increase in the number of species caught in trawls starting in the late 1980s through the early 2000s, followed by a decline throughout the survey area in more recent years. In Louisiana and Texas species evenness (Fig. 7.2, middle) has declined gradually throughout the 29 years period, with fall showing consistently higher evenness values than summer. However, since 2002 the rate of decline in evenness on the Louisiana shelf has increased; this pattern of decline is similar to that for diversity measures for the Louisiana shelf. This suggests that abundance is becoming increasingly concentrated in a smaller number of species. Annual Shannon diversity measurements (Fig. 7.2, right) show an overall decline for the 29 year period as well. The pattern is similar across the summer and fall seasons, though diversity is generally higher in the fall than the summer. While diversity appears to be declining in both Louisiana and Texas shelf waters, the rate of decline in diversity occurring in Louisiana waters since 2002 is greater than in Texas. The greater decline in diversity in Louisiana coastal waters compared to Texas waters suggests a spatially-limited change in community dynamics that could be tied to regional environmental variation (e.g., see Section 3: Physical Pressures) or to declines in shrimping effort and associated bycatch (e.g., see Section 8: Socioeconomic Indicators)."}, {"section_title": "Pelagic to demersal ratio", "text": "The ratio of pelagic to demersal (P/D) species is thought to be responsive to nutrient inputs and the quality of benthic habitat in marine ecosystem [90]. As an ecosystem becomes increasingly eutrophic, there should be an observable increase in the biomass of pelagic species compared to demersal species. The temporal trends in P/D ratio in the Gulf of Mexico were calculated based on catch data from the SEAMAP trawl survey. The index shows a clear decreasing trend for the northern Gulf from its peak in 1995 ( Fig. 7.3, top). The abundance of pelagic species has been relatively stable throughout this period, but the abundance of demersal species has increased, particularly since the early to mid-2000s ( Fig.  7.3, bottom)."}, {"section_title": "Fishery-dependent species-level indicators", "text": ""}, {"section_title": "Mean length by species", "text": "Organism size influences various biological and ecological processes within an ecosystem, including life history traits and foodweb dynamics [91]. Fishing pressure has the potential to negatively impact ecosystem function by changing the size distributions across harvested species. Sized-based indicators, such as the mean length in the catch, provide a method to track fishing impacts on a community because high-value, larger sized fish are generally targeted by fisheries [92,91]. Mean length is a simple size-based indicator that can highlight potential fishing impacts on an ecosystem [93,94]. Average fork lengths are available through National Marine Fisheries Service's Recreational Fisheries Statistics, for key species within U.S. fisheries. Average fork lengths are calculated by taking the mean of straight fork lengths for each species by year, for all fishing modes and across the entire Gulf of Mexico (Fig. 7.4). Except for Atlantic croaker and southern kingfish, the general trend among key species is that average fork length has been increasing over time. Out of these species, the average fork length for red drum, Spanish mackerel and spotted seatrout appear to have leveled over the last 20 years. If these levels are approximately the maximum length of the species, and recreational fisheries continue harvesting at these levels, there may be a gradual decrease in average fork length size over time due to changes in the species size dynamics. Average fork length for Atlantic croaker is oscillating around 22.6 cm, and the average fork length for southern kingfish has decreased approximately 14% since the early 80s. Changing environmental conditions can also impact average fish length, and thus this indicator should not be interpreted in isolation [95]."}, {"section_title": "Individual species growth rates", "text": "Variability in growth rates can be determined by analyzing otolith growth increments from a sample of individuals in a population. The chronologies presented here represent anomalies in population-wide otolith growth for red snapper and gray snapper in the northern Gulf of Mexico (Fig. 7.5). Given that snapper are upper-level predators, these indices may be a good representation of ecosystem productivity. Chronologies for red and gray snapper were generated by applying dendrochronology (tree-ring analysis) techniques to annual otolith growth-increment widths. Increments were assigned the correct calendar year of formation via the dendrochronology technique of crossdating. Next, increment widths were measured, agerelated growth declines were removed by detrending, and detrended measurements were averaged with respect to calendar year to generate the chronology for each species. Values above 1 indicate above-average growth and values below 1 indicate below-average growth. The red and gray snapper chronologies significantly correlate with one another. They also relate to March and April winds and sea surface temperatures [96]. In particular, snapper growth appears to be associated with a strong springtime Bermuda High and an early transition from a wintertime pattern of cool temperatures and offshore (northerly) winds to a summertime pattern characterized by warm temperatures and onshore (southerly) winds. The mechanisms are unclear, but warmer temperatures may stimulate metabolism while winds and wind-mixing may influence the availability of nutrients and nearshore transport of freshwater. An early transition to a summertime pattern may elongate the growing season, corresponding to anomalously wide otolith increments. The detrending techniques used to remove age-related growth declines would have also removed any long-term trends induced by change in climate or environment. The two chronologies are, however, characterized by considerable interannual growth variability that may be correlated with environmental conditions."}, {"section_title": "Fishery-dependent community-level indicators", "text": ""}, {"section_title": "Mean trophic level in the catch", "text": "The mean trophic level index (MLTI) based on landings data is considered a trophodynamic indicator for marine ecosystems, and is used to make inferences concerning the impacts of fishing pressure on an ecosystem [95]. A decrease in landings MTLI over time may indicate fishing down the food web within the ecosystem, which can have negative impacts on food web structure and various ecosystem functions. Proportion of predatory fish is another trophodynamic indicator, considered to reflect fishing pressure impact on food web functionality. A species is deemed predatory if it is piscivorous or feeds on invertebrates >2cm in length [94]. Catch MTLI is determined by calculating a weighted average of the trophic level for individual species in the catch, and proportion of predatory fish is calculated by summing predatory fish landings and dividing by total landings. These indicators have been calculated for U.S. recreational landings, U.S. commercial landings, and Mexican commercial landings, based on the data sources mentioned in the introduction to this section. Because menhaden landings are much higher than all other fisheries combined, and thus any trends in this single low-trophic level fishery will mask trends in the rest of the ecosystem, the MLTI was also calculated for finfish excluding menhaden. The MLTI based on landings data should be interpreted with caution in reference to changes in the ecosystem, since changes in fleet dynamics can drive changes in the mean trophic level landed, and thus there is potential for misinterpretation [95,97]. U.S. commercial landings MTLI appears to decrease very slightly over time; however, U.S. commercial finfish landings excluding menhaden MTLI has increased over time (Fig. 7.6). Thus, the large menhaden and invertebrate catches mask changes in the MTLI across the other fisheries within the Gulf of Mexico. The U.S. recreational fishery is primarily harvesting predatory fish feeding at high trophic levels, and has been stable over the last several years. The Mexican commercial landings MTLI dropped drastically in the 1950's and 1960's, but has been steadily increasing since the 1970's. Because finfish fisheries have declined while shrimp fisheries have increased and leveled off, the increase in this index is due to increasing catches of higher trophic levels in the finfish portion of the fishery. In contrast to many other systems, where \"fishing down the food web\" is occurring [98], the Gulf of Mexico appears to show a consistent pattern of increasing trophic level in the catch.    unknown or undefined status were calculated from 1997-2010 ( Fig. 7.7). During this time, the percentage of overfished stocks has undergone little change, while the percentage of not overfished stocks has increased. Thus, the ratio of overfished to not overfished has decreased. This indicator should be interpreted cautiously, as it is not necessarily representative of the status of all stocks in the Gulf of Mexico. Firstly, only a small percentage of stocks falling under management plans have been assessed, and for the majority of stocks, their status remains unknown. Secondly, the index does not account for the majority of the species in the Gulf of Mexico, both commercially important and unexploited, which are not listed under a specific management plan."}, {"section_title": "Number of overfished stocks", "text": ""}, {"section_title": "Commercial landings", "text": "Total commercial landings can provide a crude estimate of fishing effort or of relative abundance over time. Commercial landings in weight were calculated for the United States and Mexico separately, for the period 1950-2010. For the United States, landings are calculated separately for menhaden, invertebrates, and finfish excluding menhaden (Fig. 7.8). For Mexico, landings are calculated separately for fish and invertebrates. Landings in the United States are dominated by menhaden, which peaked in the mid-80s. Invertebrate landings, the majority of which are shrimp, also peaked near the mid-80s and declined slightly afterwards. Finfish excluding menhaden, which make up the smallest portion of U.S. Gulf landings in weight, peaked in the mid-70s, then declined suddenly and remained relatively stable up to the 90s, but since then has experienced a steady decline. In Mexico, invertebrate and finfish fisheries have contributed approximately equal amounts to the total landings from 1950 -2010. Finfish catches have increased from 1950 up to 1998, and have been decreasing throughout the remainder of the time series. Invertebrate catches, which are dominated by shrimp species, have increased continually since 1950 but appear to have leveled off in the last decade."}, {"section_title": "Recreational landings", "text": "In the U.S. recreational sector, roughly half of the total recreational catch for the Gulf of Mexico is released, but those fish that are landed make up a significant portion of all fish extracted. From 1981-2010, the recreational sector was responsible for roughly 25% of all finfish catches from the Gulf. Harvest from the recreational sector is reported by the National Marine Fisheries Service as both observed (i.e., fish that are brought back to the dock in a form that can be identified by trained interviewers) and reported (i.e., fish used for bait, released dead, or filleted, and identification is made by individual anglers). Catch statistics for both observed and reported harvest are available from the Recreational Fisheries Statistics online query [86]. From 1980 -2010, total recreational landings in weight showed only a slight increase (Fig. 7.9). This increase has been driven by increases in landings of drum species, and slight increases in landings of seatrout and sheepshead. Landings of snapper and grouper have remained stable, while mackerel landings have decreased slightly. In 1990 a drop occurred in the total recreational landings; this was driven largely by a drop in seatrout landings in this year. The decline in this year may be due to a series of regulations introduced into the seatrout fishery at that time."}, {"section_title": "SOCIOECONOMIC INDICATORS", "text": "The Gulf of Mexico ecosystem provides valuable goods and services to the U.S and Mexican economies. Fisheries and associated support businesses are important contributors to the Gulf economy. In the United States, 68% of shrimp landings, 55% of oyster landings, and 31% of recreational marine fishing trips were taken in the Gulf of Mexico alone [100]. In Mexico, fishing accounts for 0.31% of the national employment, and fishing activity is responsible for 0.8 % of the country's entire gross domestic product GDP [66]. While this section offers economic values for selected ecosystem goods, it is important to recognize that many ecosystem goods and services provide valuable economic benefits to society. However, these tend to be hard (or impossible) to value because they are not traded in markets and therefore there are no market prices for them. Here we present indicators representing the economic impacts of fishing activities in the Gulf of Mexico, as well as information on changes in fishing effort and coastal communities surrounding the Gulf. In the United States, economic data are available from NOAA's Office of Science and Technology [101], and in Mexico, they are available from the Mexican government's fishery department, CONAPESCA (Comisión Nacional de Acuacultura y Pesca) [102]. Expanding on these indicators to provide measures on other aspects of human wellbeing should be a major focus of future work."}, {"section_title": "Fishing revenues", "text": ""}, {"section_title": "Commercial dockside revenues from the U.S. side of the Gulf of Mexico", "text": "Commercial fisheries are an important source of income, employment and sustenance in the Gulf. In 2010, the Gulf of Mexico region was responsible for about 16% of the total landings and 14% of the total dockside revenue of the United States. The dockside value of finfish and shellfish landings rose from $49.3 million in 1950 to $992 million in 2000, and then declined to $622 in 2010. However, in 2010 dollars (inflation-adjusted dollars) -exvessel revenues increased from $373.6 million to $1,402 million in 1986, and then dropped to $622.4 million in 2010 ( Fig. 8.1). Since the 1950s, on average, menhaden and invertebrates (largely shrimp), comprised 71% and 20% of the overall landings but contributed 10% and 78% of the overall ex-vessel revenues, respectively. The fluctuations in invertebrate revenue are due to a growing supply of imported shrimp, which has impacted dockside prices. Inflation-adjusted shrimp dockside prices have been declining since the early 1980s [103]."}, {"section_title": "Commercial dockside revenues from the Mexican side of the Gulf of Mexico", "text": "In 2010, the Gulf of Mexico was responsible for about 18% of the total landings and 28% of the total dockside revenues of Mexico [102]. Dockside revenues from finfish and shellfish fisheries decreased from $379.5 million in 1980 to $364.7 million in 2010 ( Fig. 8.2). Caution must be exercised when interpreting these revenue figures because during the 1980's and early to mid-1990's Mexico devalued their currency several times. In 1994, Mexico joined the North American Free Trade Agreement (NAFTA). Shrimp is the most economically important fishery, followed by tuna and baitfish."}, {"section_title": "Economic impacts of commercial and recreational fishing activities in the United States", "text": "Commercial and recreational fisheries generate considerable economic activity in the U.S. portion of the Gulf of Mexico. The seafood industry is composed of commercial harvesters, primary dealers and processors, secondary seafood wholesalers and distributors, grocers, and restaurants. Between 2006 and 2009, the Gulf seafood industry generated, on average, about $4 billion in annual sales impacts and $1.65 billion in income impacts, which includes wages, salaries, benefits, and proprietary income generated from the industry (Fig. 8.3). The seafood sector also generated about 82.6 thousand full-time and part-time jobs. During the same period, the recreational sector generated, on average, $13 billion in sales impacts and $8 billion in value added impacts, which represent the contribution of recreational fishing to the GDP. The recreational sector supported about 189.2 thousand full-time and part-time jobs."}, {"section_title": "Fishing effort", "text": ""}, {"section_title": "Commercial fishing effort", "text": "Fishing effort in the northern Gulf of Mexico can be expressed in terms of dealer reports, which are made each time all or a portion of a fisher's catch is sold to a dealer, or trips and days at sea, which are reported by captains as part of the U.S. Fisheries Logbook System. Commercial fishing effort appears to have declined over the past two decades (Figs. 8.4, 8.5). Trips landing reef fish are the primary driving force in the decline shown in the logbook effort measures. Non-reef fish trips, such as shark and mackerel, do not show the same rate of decline in effort as reported to the logbook program. The decline in fishing activity may be due to the introduction of regulations, increasing fuel prices, and competition from imports. Possible regulatory actions having an impact on declining fishing activity include the introductions of grouper and tilefish annual catch limits (ACLs) in 2004, the red snapper individual fishery quota (IFQ) program in 2007, gray triggerfish and amberjack ACLs in 2008, and the grouper-tilefish IFQ program in 2010. In addition to the introductions of ACLs and IFQ programs, there has been a reduction in the reef fish fleet, as the number of active reef fish permits and vessels has been steadily declining since 2000."}, {"section_title": "Menhaden fishing effort", "text": "As the Gulf menhaden purse-seine fishery expanded during the 1950s through the early 1980s, nominal or observed fishing effort for Gulf menhaden increased, with landings peaking in  1983 at 923.5 kmt (Fig. 8.6). By the mid-1980s, prices for the fishery's processed products, such as fish meal and fish oil, plummeted due to a glutted supply of these commodities on the world market. For example, in the early 1980s fish meal typically sold for $300-350 per ton; by 1985, fish meal prices dropped below $200 per ton. Partly because of these conditions along with rising fuel prices, considerable consolidation within the menhaden fishery occurred during the late 1980s and 1990s. While 11 processing plants were active through 1984, only six plants operated by 1992. Since 2000, only four plants have been active on the Gulf coast. Concurrent with these changes have been declines in the number of fishing vessels, nominal fishing effort, and total menhaden landings."}, {"section_title": "Recreational fishing effort", "text": "Recreational fisheries are of great importance to the Gulf region; the Gulf of Mexico alone accounts for about 50% of all of the marine recreational harvest in the United States. Charter vessels tend to be smaller than headboats, carry fewer passengers, and charge on a vessel-basis rather than per passenger. Angler days are reported from the NMFS Headboat Survey, which covers for-hire vessels that primarily operate as headboats (large fishing vessels that carry multiple recreational anglers who pay on a per capita basis). Angler trips are individual trips, not vessel trips, and are calculated regardless of trip duration, whereas angler days are stated in terms of normalized 12hour trips (e.g., two 6-hour trips would equal a single angler day). Overall, the two indicators of recreational effort appear to be at odds, with the number of recreational trips increasing over time while the number of angler days decrease (Fig. 8.7). These indicators are  difficult to interpret given that they are likely affected by a wide range of economic, biological, and social issues. For example, increasing gas prices, lower levels of tourism, and increasing regulatory restrictions can all lead to decreased recreational effort. The number of angler days in the Gulf of Mexico has been related to regulatory factors (e.g., length of closed season) as well as environmental factors [104]. The private and charter boat modes, which are generally composed of smaller boats with fewer passengers, may have more flexibility in the decision to go fishing than headboats, which may need a higher minimum number of customers to warrant the costs of a trip. These modes, and the shore mode, may therefore be better able to adapt to various stressors, by making shorter but more frequent trips. This could be one explanation for the increase in total number of angler trips. Headboats, on the other hand, may have less capability to adapt as they require larger numbers of anglers and may be less flexible in scheduling. Additionally, the decrease in angler days may be a result of both fewer individual trips by headboat fishermen, and a decrease in the average duration per trip, resulting in fewer angler days when the trips are normalized to 12-hour trips. Overall, the available metrics of recreational effort are influenced by a number of complex factors, and any trends should be interpreted with caution."}, {"section_title": "Mexican fishing effort", "text": "Information on the number of registered fishing vessels in Mexico is published by CONAPESCA (Comisión Nacional de Acuacultura y Pesca). Numbers were extracted from CONAPESCA's Anuario Eestadístico de Acuatultura y Pesca [102]. The total number of registered boats for Mexican states bordering the Gulf of Mexico was summed by year ( Fig. 8.8). According to these statistics, overall the total number of registered fishing vessels has remained stable over the past three decades, despite some decadal-scale periods of increase and decrease in numbers. In the 1980s, approximately 40% of all registered vessels were shrimp boats, and by the 2000s the percentage of shrimp boats declined to about 30%. A drop in numbers of shrimp boats in recent years may be due to government efforts to reduce overcapacity issues in the fishery [66]."}, {"section_title": "Human population growth", "text": "Human population estimates are available on a county-level basis in the United States and a state-level basis in Mexico. In the United States, coastal counties are defined as those with at least 15% of their total area falling within a coastal watershed, and Mexican coastal states are those bordering the Gulf of Mexico. In both countries, population growth was relatively gradual for the period from 1900 -1950, after which rates of growth suddenly increased (Fig. 8.9). In the United States, this increase was attributable, in large part, to a post-World War II population explosion in Florida due to net migration. In Mexico, the state of Veracruz has been the largest The devastating effects of the 2005 hurricane Katrina can be seen in the population decline in Louisiana in that year. In the United States, the Gulf of Mexico is now bordered by what are now two of the four most populous states: Texas and Florida."}, {"section_title": "Changes in land use", "text": "Land cover data can give an overall picture of the existing development conditions in coastal areas, and changes in the rates of development of these areas over time, which may serve as indications of coastal pressures that will be experienced in the future. NOAA's Coastal Change Analysis Program (CCAP) produces standardized land cover data for coastal regions throughout the United States [50]. Developed lands are classified as either low-density (21 to 49 percent impervious surfaces), medium-intensity (50 to 79 percent impervious surfaces), or high-intensity (80 to 100 percent impervious surfaces). These data, produced by remote sensing techniques, are compiled and updated approximately every five years. For coastal counties of the Gulf of Mexico, rates of development appear to be decreasing over time (Fig. 8.10 "}, {"section_title": "INTEGRATED ECOSYSTEM PERSPECTIVES", "text": "An ecosystem-wide perspective of the Gulf of Mexico can be obtained by considering the entire suite of indicators presented here, through a series of summary figures and multivariate analyses. Analyses were carried out on each of the six groups of indicators: 1) climate drivers, 2) physical pressures, 3) lower trophic levels, 4) upper trophic levels, 5) ecosystem impacts, and  ) socioeconomic responses and drivers. The indicators of benthic habitat changes were not available on a fine enough temporal scale to allow for quantitative analysis. To more clearly elucidate trends within these complex data sets, a principal components analysis (PCA) was carried out on each group of indicators. The PCA is an ordination technique that allows for information on trends in the indicators to be condensed into a smaller number of representative variables. The PCA is carried out on a matrix of indicator values by year; the matrix is first scaled to ensure that indicators of different relative magnitudes are given equal weight in the analysis. The first principal components axis, or linear combination of synthetic variables, explains the maximum amount of variation in the matrix; subsequent axes explain decreasing portions of the variability in the matrix. The yearly principal component scores from the principal component axes allow for a quantitative description of the entire assemblage of indicators to be contained within a single number. Similar scores from year to year indicate similarity in indicator trends and values; large changes in the score from one year to the next indicate larger fluctuations in indicator values and/or directions. Plotting the yearly scores from the first two principal components then gives a twodimensional visualization of overall ecosystem  change, in terms of the available indicators. These time series plots are produced separately for each category of indicators (Fig. 9.1). Multivariate analysis of the climate indicator group portrays a period of relative stability from 1980 up to 1996, with the exception of select years in the 1980s. In 1997, rapid changes in these indicators took place, particularly from 1997 -1998 and 1998 -1999. The year 1998 was clearly an anomalous year; whether this was related to the severe El Niño event is unknown. After 2000, climate indicators appeared to return to a relatively stable state with a few outlying years -most notably 2010. Principal components analysis of indicators of physical pressures shows no real trend or pattern over time. This reflects the nature of these indicators as measures of sporadic disturbances, such as oil spills, hurricanes, and hypoxia events. While there are some gradual trends in the magnitude or frequency of such events, these indicator time series are typically dominated by large year-to-year fluctuations in indicator values, which result from complex dynamics in the system. The years 1988 and 1993 appear as anomalous years; these low and high score values respectively are driven by low and high values of northern Gulf hypoxia and drivers of hypoxia. The analysis of lower trophic level indicators suggest that this component of the ecosystem was relatively stable up until 2005, at which point larger changes in the indicator values occurred. The years 2006 and 2010 appear to be the most anomalous, with above average indices of abundance for shrimp species, and above average primary productivity in several regions. Caution should be taken when interpreting this plot, however, due to the scarcity of data and the short time series for many of these indicators. Development of new indicators using data collected further back in time may help to clarify changes in this component of the ecosystem over the past three decades. Indicators of upper trophic level state, ecosystem impacts, and socioeconomic responses show more gradual changes over time, and this can be seen in the PCA plots where the time series appear to follow more of a single, jagged trajectory. This pattern is due simply to the nature of these indicators, which are not expected to change rapidly. Indicators of upper trophic levels are largely based on estimates of abundance from stock assessment models, which inherently represent somewhat of a \"smoothed\" estimate of the actual abundance over time. Ecosystem impact indicators are largely based on landings data, which tend to be relatively similar from year to year. Socioeconomic indicators include measures of human population, fishing effort, and revenues, which typically do not fluctuate across short time scales. For these last three groups of indicators, more interesting than the magnitude of indicator change from year to year is perhaps the overall direction of change as suggested by the PCA plots. All three PCA analyses show an initial trajectory of increasing first principal component scores and decreasing second principal component scores, followed by a rather sharp shift, when the second principal component scores suddenly begin increasing. While it is not clear what process these second principal components might represent, it is interesting to note the coincident nature of the shifts displayed by each indicator group. For the group of upper trophic level indicators, the major shift appears from 1994 -1998, somewhat coincident with shifts in the climate driver indicators. A large shift in ecosystem impacts also occurs from 1995 -1996. Shifts in the socioeconomic responses appear slightly later, with 1995 -1999 being a relatively stable period, and a major shift in magnitude and direction of scores occurring in 2000. Whether or not the shifts in these separate measures of the ecosystem are mechanistically related should be the topic of further investigation. Traffic light plots are also useful in identifying coincident changes in different parts of the ecosystem over time. The traffic light plot is created by color-coding the value of the indicator each year according to quintiles; dark red signifies that the indicator is well below average (0-20%), light red signifies below average (20-40%), yellow signifies a near average value (40-60%), light green signifies an above average value (60-80%) and dark green signifies well above average (80-100%). The indicators are again grouped by category, and appear on the plot sorted by their loading (i.e., their influence) on the first principal component (Fig. 9.2). In this way, indicators showing similar patterns across time are grouped more closely together. Within the group of climate drivers, multiple indicators suggest an overall increase in temperature through time. Geostrophic transports, however, appear to decrease over the time series. Within the group of physical pressures, hypoxia and drivers of hypoxia appear to be linked as they show similar trends over time. Hurricane activity and numbers of oil spills show similarly increasing trends, and also appear to be correlated with each other. Indicators of lower trophic levels spanning large time series are lacking, and only limited conclusions can be drawn regarding this component of the ecosystem. Overall, however, it appears that primary productivity indices and indices of abundance of shrimp and forage fish decreased through the 1980s, were low throughout the 1990s, and increased again in the 2000s. Indicators within the upper trophic level, ecosystem impacts, and socioeconomic categories show clearer trends in either consistent increases or decreases over time. Within the upper trophic level, the most notable increases in commercial species abundances were gag grouper, red snapper, mutton snapper, and black grouper in the northern Gulf of Mexico. Turtle nesting and one measure of brown pelican abundance also  displayed increases across time. The most notable decreases were in tilefish abundance indices, as well as the abundance of several shark species. Ecosystem impacts indicators included a range of diverse measures intended to represent effects of fishing pressure on the biological community. These included species-level and community-level fishing indicators, developed from fishery-independent and -dependent data sources. Length in the recreational catch increased consistently for most species, as did the proportion of predatory species in the catch for both Mexican and U.S. landings. Species diversity and evenness based on survey data decreased across time. U.S. landings of finfish decreased consistently from 1980 -2010, although this was preceded by large increases in landings not shown on this plot. Data across long time series were lacking for many of the socioeconomic indicators, so the traffic light plot reflects only a subset of these indicators pertaining to fishing effort, fishing revenues, and human population growth. Fishing effort in the United States has consistently decreased across time, while effort in Mexico has fluctuated up and down through the time series. Human population has increased consistently in both U.S. and Mexican coastal states."}, {"section_title": "SUMMARY", "text": "Numerous stressors have impacted the Gulf of Mexico Large Marine Ecosystem in recent years. These pressures occur over different spatial and temporal scales, and their impacts can be acute (e.g. oil spills, hurricanes) or chronic (e.g. climate change, sea level rise). To some degree, the ability of managers to address these impacts with local or regional actions extends along this same continuum. Acute perturbations tend to be caused by actions occurring within the Gulf or its surrounding watersheds, and can be addressed by local, state, and national resource management agencies. However broad-scale chronic stressors are due typically to wider, globalscale changes in climate and physical dynamics, underscoring the importance of international conservation and management accords. Gaining a fundamental understanding of how these stressors interact and impact the vast Gulf of Mexico ecosystem will require synoptic and persistent monitoring. Through these observational programs, we will generate baseline data and time series of sufficient quality and quantity to assess: 1) if an event has an impact on the greater ecosystem, 2) what are the magnitude, direction, and rate of that change, and 3) what management actions have the highest probability of success in returning the system to its pre-impact state. From a holistic ecosystembased management standpoint, this will require data that can be used to describe the linkages and feedbacks within this complex human-natural system. Armed with this understanding, we will be better able to successfully and sustainably manage the marine ecosystem in an integrated manner, protecting marine resources for future generations while strengthening the resilience of our coastal communities. As a step toward that goal, here we describe a set of ecosystem indicators that capture the current status and trends of the physical, biological, and socioeconomic sub-components comprising the Gulf of Mexico marine ecosystem. At the broadest scales, changes in climate are influencing the physical and biological properties of the Gulf of Mexico, with resultant impacts on the sustainability and resilience of coastal communities. Teleconnection patterns link the Gulf of Mexico with regions as distant as the North Atlantic and South Pacific. While we lack a comprehensive understanding of all the ways in which climate change may impact the marine environment, notable trends can be observed in both individual indicators and the integrated analyses above. Three of the most frequently cited environmental issues impacting the Gulf of Mexico are hurricanes, hypoxia, and oil spills. Hurricanes are a natural source of disturbance that has always affected the Gulf region; however, with possible changes in circulation and temperature in the future, their intensity may increase. Hypoxia and oil spills are more directly attributable to anthropogenic activities, from nonpoint nutrient inputs in the upstream portions of the Mississippi River watershed, to oil and gas industry exploration and extraction activities. Finding ecosystem-based methods to explore and understand the costs and benefits associated with these human activities is paramount to the continued resilience of the ecosystem. Spatially-and temporally-resolved data on benthic habitats in the Gulf of Mexico are lacking, particularly for the deep-sea abyssal plain. For coastal benthic habitats such as oyster reefs, seagrasses, mangroves and other coastal wetlands, the majority of locations where they occur in the Gulf have experienced degradation and/or decline in areal cover. This is attributable in large part to an expanding human population base and associated development in coastal watersheds over the past several decades. Continued growth and development may lead to degradation of the resilience and adaptive capacity of the natural environment. Lower trophic levels are critical to the health of fisheries within the Gulf of Mexico. Primary productivity within the Gulf of Mexico is driven in large part by riverine inputs of nutrients. As nutrients from upstream sources flow into the Gulf, they increase the abundance of phytoplankton, which form the base of the pelagic food web. However an excess of nutrients, particularly nitrogen, results in unnaturally high growth rates of phytoplankton. As the excess phytoplankton sinks and decomposes, oxygen levels decrease, resulting in large seasonal hypoxic zones. These low-oxygen \"dead-zones\" negatively impact benthic communities, and in particular species of low mobility such as shrimp. Knowledge on the overall status of upper trophic level species is limited by data availability. For the majority of species, including key indicator and endangered species, longterm time series data necessary for understanding population trends and abundance patterns do not exist. Fisheries indicators based on both fishery-dependent and fishery-independent data provide a way to understand the impacts of fishing on the ecosystem as a whole. These indicators paint a rather positive picture about recent trends and the current state of the Gulf of Mexico. For example, dissimilar to many other ecosystems around the world which are undergoing a \"fishing down the food web\" syndrome, mean trophic level based on both catch and survey data in the Gulf of Mexico is increasing. At the same time, however, species diversity indices have decreased, and further conclusions should be drawn based on careful consideration of a wider suite of indicators. From a holistic viewpoint, the Gulf of Mexico is a complex and multi-faceted ecosystem. There are numerous linkages of varying strength between the natural and human processes and states comprising this vast region. To capture this diversity of ecosystem processes and states, indicators capturing the status of the Gulf ecosystem span the breadth of spatial and temporal scales, and from the purely physical to the purely economic. To date, most indicators have but a few years of data; sustained monitoring will be necessary to provide the time series necessary to fully understand and predict future conditions of the Gulf ecosystem. However, managing this region in a sustainable manner that ensures the resilience of our coastal communities will require a move toward integrated ecosystem assessments that capture and synthesize the status and trends of both natural and human indicators describing the ecosystem. Only then will we be able to explore, understand, and predict the trade-offs faced by different user groups deriving benefits from the Gulf of Mexico, and only then we will be able to find optimal ecosystem-based management solutions that balance benefits among all stakeholders."}, {"section_title": "RESEARCH RECOMMENDATIONS", "text": "The Gulf of Mexico ecosystem is influenced by both natural climate variability and anthropogenic climate change. However, climate models such as those used in the IPCC-AR4 cannot properly simulate important physical features in the Gulf of Mexico. Thus, regional dynamic-biogeochemical downscaling model simulations are recommended for future ecosystem risk assessment. The Loop Current is a major oceanographic feature of the Gulf of Mexico that likely exerts considerable influence on ecosystem functioning and productivity. Studies to investigate the effect of wind stress and other atmospheric modulations on the delay of Loop Current ring shedding would be beneficial. Comprehensive indicators for this complex feature and associated eddies should be developed to assess its biological impacts. An increasing number of studies suggest that the northern Gulf of Mexico undergoes a \"spring transition\" from a wintertime climate pattern dominated by northerly offshore winds to a summer pattern dominated by southerly onshore winds with implications for ocean circulation, mixing, and freshwater and nutrient transport. The nature of this spring transition, which is likely tied to the strength and location of the wintertime Bermuda High, could be better described and related to the biology of the system. Development of proxies for Gulf of Mexico climate and productivity from such sources as sediments or growth increments in calcified structures of fish, bivalves, or corals would useful. This information could serve to better calibrate climate-biology relationships and provide longer-term perspectives on historical ranges of variability, especially in data-poor regions. Lagrangian transport models could be used to investigate connectivity of spawning grounds and between populations. Such models could also be used to investigate the potential influences of oil spills and other stressors on spawning areas. Future ecosystem modeling efforts in the Gulf of Mexico should consider mesopelagic fishes. These species are highly abundant and likely pivotal to ecosystem function, but have not been studied in depth. Time series of larval fish abundances should be investigated for use in developing fisheries-independent indicators. This may require additional effort devoted to species-level identifications. Sediment transport processes are among the most poorly understood of the physical environment. Key areas of research need include: 1) Sediment movement through river diversions and distributaries, 2) Muddy coast dynamics and morphological evolution, and 3) Estuarine sediment circulation, dynamics, and morphological evolution. While freshwater and nutrients are critical inputs to marine habitats, excessive inputs of freshwater and nutrients appear to reduce fishery production in estuaries. We need to better understand these tradeoffs, particularly since we are modifying these variables in estuaries of the coast (e.g., river diversions in Louisiana). Coastal wetlands provide numerous ecosystem services to coastal communities. Yet despite their value, well-documented threats such as the development and conversion of coastal wetlands, land subsidence, and sea level rise continue. Strategies for better mitigating these causes of wetland loss, quantifying the value of wetland ecosystem services, and exploring how these ecosystem services contribute to human well-being are necessary Flooding and inundation patterns of wetlands are important and apparently controlled by tidal range. We need to develop a better understanding of variability in wetland flooding over time and space in Gulf of Mexico estuaries. The most valuable and largest volume fisheries (shrimp and menhaden, respectively) are supported by species that use estuaries as nurseries. We need better information on environmental factors in these estuaries that affect production. In particular, studies are needed to understand why some estuarine systems more productive than others, and how larval recruitment varies among estuaries. Bio-economic models should be developed for transboundary or shared fish stocks to examine the potential benefits of joint management. The development of 'benefit transfer' models would be useful to estimate the economic benefits from mitigating the impacts of environmental stressors (e.g., anoxia) in both the U.S. and Mexican sides of the Gulf of Mexico. It would be useful to investigate trade flows of key commodities (e.g., fish, oil, agriculture) and evaluate the impact of trade related actions on the health of the Gulf ecosystem (e.g., by-catch reduction). Linkages and feedbacks among ecosystem components -human, physical, and biological -are poorly understood. They must be explored by interdisciplinary teams in order to make significant progress in understanding and quantifying them. The NMFS Southeast Fisheries Science Center has been engaged with Mexico over the past decade, via the Gulf of Mexico LME Program (http://gomlme.iwlearn.org). Similar to NOAA's Integrated Ecosystem effort, the Gulf of Mexico LME project seeks to create a framework for ecosystem-based management throughout the larger region. Given the aligned objectives of these two initiatives, participants from both the United States and Mexico should seek to share resources, data, research findings, and other products that can advance ecosystem science in the larger region."}, {"section_title": "ACKNOWLEDGMENTS", "text": ""}]