[{"section_title": "Introduction", "text": "In recent years, considerable effort has been made to develop questionnaire construction guidelines for how questions should appear in establishment surveys. Examples include guidelines developed by the Australian Bureau of Statistics (2006) and Statistics Norway (Nøtnaes 2006). These guidelines have utilized the rapidly emerging research on how the choice of survey mode, question wording, and visual layout influence respondent answers, in order to improve the quality of responses and to encourage similarity of construction when more than one survey data collection mode is used. Redesign efforts for surveys at the Central Bureau of Statistics in the Netherlands (Snijkers 2007), Statistics Denmark (Conrad 2007), and the Office for National Statistics in the United Kingdom (Jones et al. 2007) have similarly worked to identify questionnaire design attributes that are most effective for helping respondents complete establishment surveys. In addition to the work on developing guidelines for establishment surveys, the U.S. Census Bureau has developed guidelines for designing Decennial Census questionnaires for administration to households in different survey modes (Martin et al. 2007). Development of these guidelines was motivated by the recognition that separate efforts to construct instruments for mail, in-person enumeration, telephone, and handheld computers had resulted in quite different questions being asked across survey modes. The 30 guidelines were aimed at collecting equivalent information across modes (i.e., the meaning and intent of the question and response options should be consistent across modes). The influence of question wording on how respondents interpret the meaning of questions and the answers they report has long been recognized (Schuman and Presser 1981;Sudman and Bradburn 1982). The work on this has significantly expanded in recent years (e.g., Krosnick 1999;Sudman et al. 1996;Tourangeau et al. 2000). In the last decade, new research has emerged on how the visual design of questions may change and sometimes override how respondents interpret the wording of questions. This research has provided both theories and experimental findings for understanding how different visual layouts of questions impact respondents' answers in paper surveys (e.g., Jenkins and Dillman 1997;Christian and Dillman 2004;Redline et al. 2003) and web surveys (e.g., Tourangeau et al. 2004;Christian et al. 2007). Although these journal articles have reported the results of various experiments, few articles have been published that link this growing body of knowledge on how respondents are influenced by the combined effect of question wording and the visual appearance of questions to the development of questionnaire construction guidelines. An exception is a set of \"rules\" proposed for the redesign of the USDA's Agricultural Resource Management Survey (ARMS), which was transitioning from being exclusively an interviewer-administered survey to a self-administered paper instrument so most of the survey responses could be collected by mail (Dillman et al. 2005). These rules for wording and visual layout sought to combine visual design theory with usability principles developed by Norman (1988Norman ( , 2004. A shortcoming of these rules is that they were specific to the construction of a particular questionnaire to be filled out by farm operators, and thus may or may not be applicable more broadly. Our purpose in this article is to build on previous research and propose specific guidelines for the construction of establishment surveys within statistical agencies. We apply the rapidly growing research on visual design to the important need of achieving common questionnaire construction across the many different establishment surveys conducted within individual agencies. The primary focus of this article is paper surveys, for two reasons. First, the testing that underlies preparation of the article has focused in large part on paper economic surveys at the U.S. Census Bureau. Second, research has shown that many of the same principles that apply to the construction of paper surveys also applies to web surveys, e.g., how amount of space affects answers to open-ended questions and the construction of scalar questions (Dillman et al. 2009). That being said, we recognize that the design of web survey questions raises a host of issues the resolution of which will not be the same as in the case of mail surveys. Web examples include automatic branching through skip questions, edit checks to assure answers are within expected ranges, use of answers to earlier questions to formulate answers to later ones, and required answers for certain questions. Thus, our attention to web surveys receives somewhat less emphasis, and issues pertaining only to web surveys are omitted from consideration here."}, {"section_title": "Background", "text": "Design guidelines are intended as recommendations as to how certain kinds of questions, ranging from requests for monetary amounts to complete matrices, may be most effectively communicated to establishment survey respondents. We propose that developing guidelines for business surveys requires taking into account at least three distinct considerations: the influence of agency context, visual design research, and respondent perspectives. These considerations form the overall framework used for developing the proposed guidelines."}, {"section_title": "Influence of Agency Context", "text": "Statistical agencies throughout the world provide quite different contexts for the development of question design guidelines. Some agencies rely mostly on paper and interview surveys. Others are moving rapidly to the Internet as their primary means of data collection, while paper versions of web instruments are often used to complement the web or for businesses that are unwilling to use the web or do not have access to it. For guidelines to be usable across a variety of survey contexts, they need to support the use of multiple modes of data collection, as done by, for example, the Australian Bureau of Statistics (2006). In establishment surveys, where surveys may need to be completed by multiple respondents and the release of data provided may require approval by the organization, paper forms or printouts of web questionnaires are typically used to support the preliminary process of identifying what information needs to be compiled for reporting and of preparing preliminary drafts that will be reported electronically (Snijkers 2007;Dowling 2006). Respondents often use paper forms as rough drafts before attempting to enter the data and answer the sequence of questions that appear on successive screens of a web survey. In addition, many establishments need to keep records of the survey data for organizational needs or to assist them in completing future surveys when they are repeated over time. Thus, our effort to develop guidelines is further shaped by the importance of constructing similar questionnaires for both mail and web surveys. The guidelines proposed in this article reflect the heterogeneous design environment of the U.S. Census Bureau where establishment surveys are done in the following ways. . Some economic area questionnaires are developed uniquely for a particular survey, and are constructed by forms designers located centrally within the agency. Forms designers attempt to respond to the needs and preferences of individuals who oversee the survey. . In addition to paper, some economic surveys are conducted on the web. Several U.S. Census Bureau surveys use an in-house system called Census Taker, which is in the process of being replaced by a more advanced system known as Centurion. Census Taker was developed to follow set standards in a way that encourages similarity in construction and data collection processes for a set of U.S. Census Bureau economic surveys. An alternative for collecting data over the Internet is Harvester. This system has many built-in editing capabilities and is able to design electronic forms that look very similar to their paper counterparts. Both Census Taker and Harvester allow respondents to enter data via the Internet, without having to download any additional files or software. . Other U.S. Census Bureau establishment surveys are designed using the Questionnaire User Interface and the Generalized Instrument Design System (QUI-GIDS). The system was initially developed for the 2002 Economic Census and its approximately 550 industry-specific questionnaires. It uses the same content (questions and related materials) from a metadata repository to build both paper and electronic questionnaires. Building questionnaires using QUI-GIDS has two distinct advantages: the paper instruments are ready for key-from-image data capture, and the electronic instruments have built-in edit capabilities. However, the system is designed to follow economic census and key-from-image standards and thus does not provide much flexibility to customize forms design. Thus, for design guidelines to be broadly usable there is a need to consider their application in quite different situations."}, {"section_title": "Visual Design Research", "text": "Words are the primary means of communication used to convey information in the survey conversation. Thus, to develop these guidelines, wording principles from many different sources, e.g., Sudman et al. (1996), and Dillman (2000), are applied. Respondents also draw information from graphical features of visual layout through their interpretation of numbers and symbols (such as arrows), as well as of boldness, spacing, contrast, and other features of questionnaire construction (e.g., Jenkins and Dillman 1997;Redline and Dillman 2002;Dillman et al. 2009;Toepoel 2008). The development of guidelines for constructing U.S. Census Bureau establishment surveys is heavily influenced by this expanding body of visual design research that shows when, why and how people are influenced by visual characteristics of written information. Although research on visual design and layout effects in government surveys has appeared occasionally in the literature (e.g., Wright and Barnard 1975;Smith 1995), it is only during the last decade that systematic experiments have shown how and why visual layout and design makes a difference in the interpretation of survey questions. For the most part, these experiments have been guided by theoretical developments in how individuals see and process visual information (e.g., Palmer 1999;Hoffman 1998;Ware 2004), which help to provide an understanding of why some visual formats work better than others for obtaining accurate information from respondents. In addition, researchers have drawn from Gestalt psychology to interpret their empirical observations, e.g., the principle of proximity (objects that are closer together tend to be seen as belonging together), the principle of similarity (objects that are similar in font, color, size, or other characteristics tend to be seen as belonging together), and the principle of pragnanz (simpler objects are easier to perceive and remember) (Jenkins and Dillman 1997). The following are examples of specific experimental findings relevant to developing the design guidelines: . Mistakes in following branching instructions are significantly less likely to be made if designers use arrows (a symbol), bolding of instructions for greater contrast with response categories, and parenthetic information at the beginning of the next question such as \"(If Yes) : : : \" indicating to which respondents the question applies (Redline et al. 2003). . Labeling response categories with clarifying information on what information is being requested, using appropriate symbols, and providing answer spaces sized appropriately for the information being requested improves the likelihood that respondents will provide information desired by the survey sponsor (Couper et al. 2001;Christian et al. 2007). . Placing information directly in the navigational path at the location where it is to be used improves the likelihood that respondents will use that information (Christian and Dillman 2004). . The greater the effort required to find appropriate instructions (e.g., multiple vs. single clicks on web surveys), the less likely that survey respondents will go to the instructions (Tourangeau 2007). . Certain heuristics -(1) middle means typical, (2) left and top means first, (3) near means related, (4) up means good and (5) like (in appearance) means close (in meaning) -appear to influence how some respondents interpret and choose response categories in questionnaires, particularly for scalar questions (Tourangeau et al. 2004;Tourangeau 2007). The above list of findings is far from complete (see Dillman 2007, pp. 447 -503 for additional topics and results of recent experimentation). Together they suggest a patterning of visual design behavior by people that must be taken into account when attempting to formulate guidelines that will achieve effective communication with respondents."}, {"section_title": "Respondent Perspectives", "text": "Establishment surveys are completed by individual people whose perception and interpretation of questions are clearly affected by the wording and visual design principles mentioned above. However, it is also important to recognize that respondents to these surveys tend not to be answering questions for themselves as individuals, but as representatives of their businesses. Because of the emphasis on numerical and business transaction information in establishment surveys, many respondents have accounting or other backgrounds that other respondents do not, so they are more comfortable working with tables, matrices, and numerical information. This may mean question formats that might be problematic for surveys of individuals or households, but not for establishments. For this reason, it seems important that the evaluation of the process of filling out questionnaires be a consideration in the development of questionnaire guidelines. Cognitive interviews with members of populations about to be surveyed have evolved as a powerful technique for improving survey design (e.g., Gower 1994;Presser et al. 2002). Cognitive interviewing has therefore been extensively used to test proposed question formats and provide additional evaluation of the guidelines presented here. These interviews (e.g., Dowling and Stettler 2007) are used to both suggest and evaluate refinements to principles derived from the published experimental research mentioned above. Thus, results from cognitive interviews constitute a third set of information used to provide a basis for the specific guidelines outlined below, one that is critical for evaluating the effects of specific wording and visual layout. In summary, these design guidelines link the rapidly growing theory and research on how wording and visual layout influence respondents to results from cognitive interviews that evaluate how the actual target population to be surveyed responds to proposed questionnaire formats. Both of these considerations are in turn affected by the agency context and consideration of the use of multiple survey modes. The development of guidelines involves a careful triangulation of these distinct and individually important issues."}, {"section_title": "Guidelines", "text": "Good visual design will not fix a poorly written question, and a well-written question can be misinterpreted or ignored due to bad visual design. Furthermore, words are the primary means of communicating to respondents what data are being requested. Therefore, we focus our attention first on wording. Since there is a well-developed literature on question wording, readers are advised to refer to standard textbooks, such as Converse and Presser (1986), Fowler (1995), Mangione (1995), and Dillman et al. (2009), for principles of question wording. In addition to these basic principles, we propose the following two guidelines: 3.1. Guideline 1 -Phrase Data Requests As Questions or Imperative Statements, Not Sentence Fragments or Keywords Typically, establishment surveys request information in one of three ways: as questions, imperative statements, or sentence fragments. Questions are sentences with a question word (e.g., when, how many, which) and a question mark at the end. With imperative statements the subject (\"you\") is implied and a command or request is expressed. Sentence fragments consist of a keyword or series of keywords without a verb or punctuation. The 2002 Economic Census, collected by the U.S. Census Bureau, used both questions and sentence fragments for the data requests. For instance, one item used a question (\"Is this establishment physically located inside the legal boundaries of the city, town, village, etc.?\") while the following item used a sentence fragment (\"Type of municipality where this establishment is physically located\"). Sometimes, the form that the intended answer is supposed to take is not adequately communicated using sentence fragments. Complete sentences help respondents determine what type of information is required without having to refer to other sources of information such as instructions (Dillman 2007). When rules were developed for converting the USDA's Agricultural Resource Management Survey questionnaire from interviewer-administered to self-administered, Rule 5 emphasized converting sentence fragments used throughout the questionnaire to complete sentences that could stand alone (Dillman et al. 2005). Recent research by Tourangeau (2007) also shows, based upon multiple experiments, that respondents to web surveys tend not to go to separate instructions, and the more difficult it is (e.g., multiple clicks vs. single clicks) the less likely it is that separately located instructions will be used. Writing complete sentences is important in reducing the need for separate instructions. Gernsbacher (1990) conducted multiple experiments that explored how people read words, sentences, and paragraphs. Her research demonstrated that people \"spend more cognitive capacity processing initial words and initial sentences than later-occurring words and later-occurring sentences\" (p. 9). The initial words lay the foundation for comprehending the remainder of the sentence. After processing the initial words, readers attach each new piece of information to the foundation, and build a structure to comprehend. A question word at the beginning of a sentence implies to the reader that a response is expected. However, a sentence fragment often does not adequately convey what type of answer is expected. Though questions and imperative statements are more effective than sentence fragments, cognitive evaluations done by the U.S. Census Bureau suggest that respondents prefer questions over imperative statements (Morrison 2003). Interviews with 11 business respondents to the Survey of Industrial Research & Development addressed this issue. Respondents went through a questionnaire that employed either imperative statements or questions. Near the end of the interview, they were presented with the opposite questionnaire, and asked which version they preferred and why. Though the sample size was small, the findings suggested that respondents preferred questions to imperative statements. They said the questions were clearer and more direct; they favored the \"sentence structure\" of the questions. Converting sentence fragments into questions can be relatively easy. In the 2007 Economic Census, fragments were converted into questions. Instead of using a series of keywords to get at the type of municipality, a question was asked: \"In what type of municipality is this establishment physically located?\""}, {"section_title": "Guideline 2 -Break Down Complex Questions into a Series of Simple Questions", "text": "Asking additional, simple questions is preferable to asking fewer, more complicated ones because it reduces cognitive burden by making the task easier and less time-consuming. Gernsbacher's research (1990) indicated that sentences with a more complex structurefor example, ones with multiple clauses -require readers to spend more time figuring out the meaning. Using commas in a sentence to separate clauses generally indicates to the reader that there is a change in the direction of the sentence. A change in direction requires additional time to process, due to the time needed to focus on the change and its meaning. Tourangeau et al. (2000) discuss this concept in terms of the brain's working memory. Complex questions overload working memory, which leads to reduced cognitive processing ability and items being dropped from working memory. Long questions can pose difficulty for respondents for this reason. As a result, they pay more attention to some words than others (Beatty et al. 2007). McCarthy and Safer (2000) found that only 15% of respondents considered all three explicitly mentioned key pieces of information when answering a question about number of cattle brought to market. Furthermore, they determined that this omission was not due to respondents' lack of understanding the terms, but was a result of not comprehending the lengthy and complex introduction. Breaking up complicated questions into more simple ones reduces the overall process into manageable steps, which are individually less taxing for the working memory. Complex questions might involve multiple clauses or long lists of response options along more than one dimension. An example of a complex question comes from the 2002 Survey of Industrial Research & Development. One question from this paper survey ( Figure 1) attempted to elicit information about the breakdown of research and development costs by the type of technology. It also attempted to obtain information about what percentage of that R&D was attributable to nanotechnology. The nanotechnology part of the question, in the white column furthest to the right (labeled Column 2), was not seen by respondents. Instead, many of them thought they were supposed to convert their reported dollar costs into percentages, and the nanotechnology question above the percentage instruction was not being answered (Morrison 2003). This problem is predictable based upon the limitation in focus of people's vision to the foveal view (8 -10 characters) when attentively focused on processing information (Jenkins and Dillman 1997). The issue is expressed slightly differently by Tourangeau et al. (2004) as people conforming to the heuristic of \"near means related.\" In essence, nanotechnology is blocked from view by the more accessible request for percent. It also seemed that respondents were misunderstanding that the nanotechnology question was, in fact, a new question; since it was near the question concerning dollar values, respondents thought the columns were related. In cases where the question itself is complex, the sentence may be simplified by first looking at the number of clauses and the number of times the words \"and\" and \"or\" are used. Identifying the different parts of complex questions can help when deciding how to divide the question into smaller more manageable ones. Another option might be to add a filter question, as the Survey of Industrial Research and Development did in order to improve the accuracy of people's responses (see Figure 2). In some cases, when a complex sentence structure cannot be simplified and a question contains several important pieces of information that must be understood in order to provide a proper answer, simple diagrams may be useful. One question on the U.S. Bureau of Economic Analysis quarterly form measuring foreign direct investment includes three clauses and two parenthetical clarifications ( Figure 3). Cognitive interviews with 60 respondents showed that respondents had to read through the question more than once in order to fully comprehend it. However, the addition of the accompanying diagram helped respondents comprehend the meaning of the sentence and answer correctly (Tuttle and Morrison 2006). Dividing complex questions into smaller component pieces will likely result in a larger number of questions on a given survey. However, the cognitive effort required to read, process, and answer those questions will be reduced. On the 2002 Survey of Business Owners (SBO), one question ( Figure 4) asked respondents to read through and select from a list of options that describes the ownership of the business. This list of options proved to be particularly difficult for respondents. It required them to think of a variety of ownership arrangements, including some in very diverse dimensions such as ownership by foreign entities vs. domestic entities, the legal form of the organization, and ownership by American Indian or Alaska Native entities. Because the options were, in fact, in different dimensions, they were cognitively burdensome to process. In addition, research has shown that the check-all format used for questions like the one in Figure 4 results in greater marking of earlier items and less overall (Smyth et al. 2006;Smyth et al. 2008). Consequently, the check-all format is especially prone to satisficing and should be avoided when possible. The format shown in Figure 5 was adopted for use in the 2007 Survey of Business Owners in order to get discrete responses for each type of ownership. In this instance, a yes answer to an item would direct respondents to a later item. This is a format that encourages respondents to evaluate each type of ownership individually (rather than view them as a group), and not contemplate whether a later response option overlaps or differs sufficiently from an earlier marked answer to warrant being marked as well. Asking more individual questions often requires additional space, which may in turn increase the number of questionnaire pages. While some might be concerned that the Fig. 4. 2002 Survey of Business Owners' question on ownership that was likely to produce respondent errors in reporting increase in the number of pages will negatively affect response rates, research has shown the contrary when a questionnaire's design is based on cognitive principles and pretesting (Dillman et al. 1993;Subar et al. 2001). The guidelines above have addressed the issue of question wording. Theory, research and cognitive interview findings have shown that respondents are better able to respond to questions that (a) are phrased as questions or imperative statements and (b) address only one topic or response dimension at a time. We now turn our attention to guidelines for visual design and layout. Some specific guidelines have been linked under larger themes."}, {"section_title": "Establish a Clear Navigational Path", "text": "Since there is no interviewer present to guide respondents as they complete selfadministered questionnaires, establishing a clear navigational path helps to ensure that respondents complete the questions in the intended order and answer all the questions in the survey (or at least all that apply to them). Effectively applying visual design principles can help survey designers develop questionnaires with a clear navigational path that helps respondents move through questions in the desired sequence. A number of specific principles for establishing a navigational path and guiding respondents from one question to the next are discussed by Dillman (2000, pp. 105 -129). An example of a very complex navigational path can be seen in Figure 6 from the first page of the Bureau of Economic Analysis (BEA) former quarterly foreign direct investment questionnaire, which was used before 2007. This form was on legal-sized paper where respondents had to process information horizontally and vertically. Since respondents had to read through multiple columns of information at the top and then the bottom of the page, it was as if two different newspapers had been placed on top of each other. In addition, respondents were supposed to begin answering in the middle of the top half of the page. Section numbers such as \"Part 1\" were in reverse print to help respondents identify that this was a new part of the survey; however, individual question numbers were often difficult to perceive. This example illustrates the importance of several questionnaire design features in helping respondents navigate through the survey. For example, respondents need to be able to: discern where to begin, clearly differentiate each question, distinguish where to provide their responses, and accurately move or navigate between questions. Together, effective use of visual design features can help guide respondents as they complete the survey. The U.S. Census Bureau assisted with redesigning this form to help improve the navigational flow and other aspects of the design of the questionnaire. Several features of the general layout were modified to improve the usability and reduce respondent burden ( Figure 7). First, the questionnaire was moved from legal to letter-sized paper because respondents prefer letter-sized paper, which makes it easy for business respondents to print, photocopy, fax, and file forms (Sudman et al. 1999). Second, a one-column vertical layout was adopted, rather than using multiple columns, so respondents did not have to process information horizontally across the page and vertically down the page."}, {"section_title": "Guideline 3 -Use a Consistent Page or Screen Layout", "text": "To help respondents move between pages or screens in the questionnaire, it is important to use a consistent page layout so respondents do not have to reorient themselves to each new page or screen. Using a booklet format in paper surveys can also help respondents easily navigate among pages because this format closely resembles a book, where pages are read from the top left to the bottom right (Dillman 2000). Generally, a one-column format is easier for respondents because they only have to process information in one direction. They are being assisted visually, so information is less likely to be missed. This is particularly important for establishment surveys where questions often ask for detailed financial information and open-ended answer spaces are provided. It is rare to use a two-column format for web surveys. However, a two-column format may sometimes be desirable in paper surveys when the survey consists of many shorter questions where response options are provided to help improve readability and connections between the query and response options (Dillman 2007). For example, the U.S. Census Bureau's Survey of Business Owners asks for categorical information about the principal owners and the business itself. Due to printing costs, the questionnaire can not be more than 8 pages long. A two-column format allows all of the questions to appear on the form without going over the page limit. However, because the survey provides a list of response options for each question, collects no numerical information, and does not require complex instructions, the two-column format works well for collecting this type of survey information."}, {"section_title": "Guideline 4 -Align Questions and Answer Spaces or Response Options", "text": "Spacing is a particularly effective organizational tool that can help to establish groupings. As the Gestalt principle of proximity states, visual elements located closer together are perceived to be a group and more related to one another than elements placed further apart (Lidwell et al. 2003;Ware 2004). One of the most powerful ways to emphasize that elements are related is to place them in close proximity, as this will often overpower other competing visual cues (Ware 2004). Related to the Gestalt principle of proximity is the principle of good continuation where visual elements arranged along a straight line are more likely to be perceived as a group and more related to one another than elements not placed along a common line (Lidwell et al. 2003;Ware 2004). Aligning questions and their subcomponent parts along common rows or columns is a powerful design tool to help guide respondents as they complete the survey. It is particularly helpful to align answer spaces so respondents can easily identify where to report their responses. The example in Figure 7 shows that, in addition to adopting a one-column format, question numbers, questions, answer spaces and individual units (the set of three zeros, to indicate that data was to be rounded to thousands) were aligned to help visually establish a clear navigational path. Finally, by comparing Figures 6 and 7, one can see that alignment helps reduce the perceived complexity of the information presented and contributes to an overall sense of cohesion. Aligning response options in one single column below the question is preferable to listing them in multiple columns (see Figure 4 for an example). By putting response options in a single column, they are visually located together in a single group, thus taking advantage of the Gestalt principle of proximity. The visual separation of response options into multiple columns effectively increases the space between options, and increases the risk that some options will be missed. Also, some respondents may process the list horizontally and then vertically while others may process the list vertically and then horizontally."}, {"section_title": "Guideline 5 -Clearly Identify the Start of Each Section and Question", "text": "Sections may be used to help respondents recognize that groups of questions are related, discern the basic organization of information in the survey, and understand what is being asked of them. Section headings can help respondents identify that the information being requested is somewhat different than in the last section. To help respondents notice the section headings in the early stages of visual processing (Ware 2004), section headings in Figure 7 are made more prominent using reverse print with a dark blue background and white text. A similar convention was used for web surveys using the Harvester system, as shown in Figure 8. For web surveys in Census Taker, rather than using reverse print, section headings are made prominent by increasing the font size, as shown in Figure 9. Once respondents begin the task of answering each question, it is important to clearly identify questions by means of numbers or some other consistently applied font or symbol variation. This can help respondents know where to start each topical area as well as aiding movement from one question to the next. In addition to improving the alignment in the redesigned form in Figure 7, question numbers were highlighted using reverse print with a dark background and white text to help respondents clearly identify the start of each question. The use of consistent question numbers across modes can also be particularly helpful in establishment surveys, where respondents often move back and forth between the paper and web versions (Dowling 2006). The numbers can help orient respondents to ensure they are providing their response to the correct question. "}, {"section_title": "Guideline 6 -Use Strong Visual Features to Interrupt the Navigational Flow", "text": "Survey designers often need to interrupt the navigational flow to indicate a change in what is being asked of respondents. As discussed in Section 3.3.3, a new section can indicate to respondents that there is a change in the type of information being requested. In Figure 7, a large box is placed around the answer space requesting a total to visually indicate that the information requested for this answer space is different than what was requested for the ones above. One of the most compelling reasons to interrupt navigational flow in paper surveys is to encourage respondents to correctly follow branching instructions. For example, survey designers often want to ask follow-up questions that only apply to a subset of respondents based on their responses to previous questions. Although the computer can correctly execute branching instructions in web surveys, strong visual guides are needed to help respondents accurately comply with branching instructions in paper surveys. Redline et al. (2003) found that the combined use of an arrow and changes in the font and location of branching instructions in the 2000 U.S. Decennial Census significantly improved the number of respondents correctly executing the skip instructions. Overall, it is important to remember that once respondents understand and follow the navigational path, any change in what is being asked should be visually different to alert respondents to it. This guideline is based in part on a rule proposed by Dillman et al. (2005, p. 211), where strong graphical features were introduced in an agricultural survey to change reporting behavior from whole acres, asked about on several pages, to tenths of an acre, necessary for reporting certain commodities, such as tobacco."}, {"section_title": "Eliminate Visual Clutter from the Questionnaire", "text": "Visual clutter refers to the introduction of symbols and other graphical features on pages that compete for attention, drawing respondent's attention away from the desired navigational path. Clutter can result from placing information on web pages that is irrelevant to the completion process as seen from the respondent perspective. Examples include placing numerous graphics in different colors, such as sponsor organization logos and security information.  Figure 10 shows a page taken from an older version of Census Taker, one of the Internet data collection instruments for economic surveys at the U.S. Census Bureau. At the top of the page, the words \"Census Taker\" appear in blue text on a white background, while \"U.S. Census Bureau\" appears in white text on a blue background. In addition, there are graphics associated with \"Census Taker,\" \"Quarterly Services Survey,\" and \"Security Information.\" Below the headings, text is printed in black, red, and blue. Finally, the buttons labeled \"Go\" are not descriptive; rather, the text next to them is needed in order to understand which button to select. Clutter can also result from what seems to be a lack of information organization. Examples include successive questions that are not aligned with each other (see Section 3.3.2, Guideline 4, for more information), answer categories that are displayed inconsistently, and the use of different fonts (e.g., see Dillman 2000, pp. 110 -11, Figures 3.13 and 3.14). Differences in size, shape, brightness, color and contrast often contribute to the cluttered appearance of pages. In essence, competing graphical features draw the respondent's attention away from the desired navigational path. An example from a paper survey is the extensive use of lines in the BEA's quarterly foreign direct investment questionnaire that divided the page into many small units (see Figure 6), making it difficult to discern the desired navigational path. According to the Gestalt principle of pragnanz, the use of inconsistent, irregular and unfamiliar graphical features makes it hard to perceive and remember, thus making the response process more difficult. The Gestalt principle of proximity suggests that things that are close together are seen together as part of the same group (Jenkins and Dillman 1997). This is the basis of an interpretive heuristic identified by Tourangeau et al. (2004) as \"near means related.\" As a general rule, individual questions consist of the query, any needed instructions, and response spaces or categories (Dillman 2000). As mentioned earlier, when respondents are concentrating, they tend to have their vision focused on a small area of the page, about 8-10 characters in width. When answer spaces for a question get placed equidistant between the query for one question and that for a succeeding question, it is sometimes difficult to tell to which query the answer spaces belong (Dillman 2000). It follows that the spacing between a query and its answer categories should be less than the spacing between the answer space and the beginning of the next question. The design challenge for incorporating blank space is to use it in a way that helps respondents identify and group information that is related, and to keep respondents from grouping the wrong information when attempting to understand or respond to a question. Since respondents view information that is spatially close together as being related (Lidwell et al. 2003;Ware 2004), it is disadvantageous to spread out related information on a page or screen simply to fill the \"empty\" space. While it may help make the page less cluttered, it actually results in respondents not understanding which items are related. It is similarly disadvantageous to limit the space between items in order to save space on the page (Dillman et al. 2005). Not only does this make the page harder to process, due to the condensed space between items, but again causes the respondent to misinterpret which items are related. Figure 11 shows how spacing can be used effectively to separate questions. The space between the last two items in Question 5 is less than the space between the last item in Question 5 and the query in Item 6."}, {"section_title": "Guideline 8 -Avoid Unnecessary Lines That Break up or Separate Items That", "text": "Need to Appear As Groups In the 1997 Economic Census, paper questionnaires were arranged on legal-sized pages, in one or two columns. A segment of one of the forms is shown in Figure 12. The preponderance of lines found on the page was problematic. Lines separated items that needed to be grouped together, for instance lines 1a -1c. In fact, the lines served to separate what the visual cue of the indented, outline format tried to create -an indication that there are subparts within the item. As a result, respondents did not always understand that certain items were related. The lines also created a problem with navigation. Since the columns were adjoined, it was unclear whether respondents were supposed to work down columns or across rows. For instance, lines 2a through 2d line up with items 21 through 25. An extensive cognitive evaluation of 2000 U.S. Decennial Census Questionnaires revealed a tendency for respondents to jump from one column to the next when questions in the second column lined up perfectly with questions in the first column (Dillman et al. 2004). For the 2002 Economic Census, the questionnaires had only one column on each page, rather than two, which eased the problem with navigation. Lines between data items were removed. Between these two significant visual design changes, the indented, outline format (used to indicate subparts within an item) was more evident."}, {"section_title": "Guideline 9 -Use Visual Cues to Achieve Grouping Between Questions and Answer Categories", "text": "In some questionnaires the use of full pages causes answer spaces to become widely separated from the query they correspond to, as shown in Figure 7, where the queries are on the left side of the page and the answer spaces are on the right side. The principle of proximity, recognized by the heuristic of \"near means related,\" suggests that wide separation makes it difficult for respondents to see these components of a single question as belonging together. One solution for paper questionnaires is to use dot leaders to connect the question to its answer space. In addition to showing the respondent that they belong together, it helps respondents be sure they are on the right line when filling out each box. In electronic questionnaires, construction methods do not allow dot leaders to be used in the same way because of browser, screen configuration and other differences. The same effect can be created in electronic surveys by shading alternate lines in different colors across the page, as shown in Figure 13. Shading could also be used as a substitute for dot leaders in paper questionnaires, but it should be noted that shading is a powerful design tool and may lead to more visual clutter. "}, {"section_title": "Guideline 10 -Avoid Including Images or Other Graphics That Are Not Necessary", "text": "Respondents pay attention not only to the verbal language on the page, but also to the symbolic, numeric, and graphical languages, which have the potential to affect the answers to questions (Redline and Dillman 2002). Photographic images or other graphics shown on Fig. 13. An example of the use of shading in a web survey, from a customer satisfaction survey Fig. 12. An example of a questionnaire with unnecessary lines, from the 1997 Economic Census the screen during a web survey can affect responses, though it is unclear how the addition of images affects the accuracy of reporting (Couper et al. 2004). In some cases, the symbols used on a questionnaire can be beneficial. For instance, in Figure 11, a pointed finger at the top of the page was used to call attention to an introductory statement about what the upcoming questions would ask about. Cognitive testing with approximately 35 respondents indicated its necessity and usefulness. Respondents paid attention to the symbol and the text it drew attention to. Another example of a useful symbol comes from the Bureau of Economic Analysis quarterly foreign direct investment questionnaire, mentioned previously. Identifying the correct reporting unit is a critical component of the questionnaire. During respondent debriefings, researchers found that respondents often used corporate organizational charts to figure out which entities should be included and excluded. Simplified versions of organizational charts were developed and displayed with questions concerning the reporting unit (see Figure 3 for an example). The charts did not replace the question, but the visual representation of corporate entities, something respondents were already familiar with, assisted their comprehension of the question (Tuttle and Morrison 2006). There are times, however, when symbols can be confusing or unhelpful. In the Commodity Flow Survey (CFS), respondents must select a systematic sample of their shipping records in order to complete the survey correctly. The selection rate is based on the total number of outbound shipments made during a 1-week reporting period. In the 2002 survey, respondents were provided with instructions and a diagram to assist in this effort ( Figure 14). Each rectangle represented a single shipping record, and the white rectangles indicated the record that was to be selected. Cognitive testing revealed that most  (Barnett et al. 2005). Those that understood the concept of selecting every nth record often neglected to read the accompanying text that indicated the diagrams were examples. Rather than using their own selection rate, they picked a selection rate of either 2 or 5 since those were the examples shown. The diagrams were confusing and were removed when the form was redesigned for the 2007 survey. In the 2007 survey, respondents were guided through the process of selecting their systematic sample more explicitly, using improved step-by-step directions and a clearly marked example (see Figure 15). It should be noted that while this guideline applies to both paper and electronic questionnaires, the graphics in electronic surveys might not be as crisp as they appear on paper. Therefore, diagrams, symbols, and images should be evaluated thoroughly to ensure they are clear when they appear on a computer screen."}, {"section_title": "Use Visual Design to Help Respondents Process Instructions", "text": "Converse and Presser (1986) discuss the difficulties involved in building a common frame of reference between respondents and survey researchers, and the necessity of doing so. They also state that the process for writing clear definitions is not obvious, and no \"general prescription\" is likely to emerge, though they recommend that researchers pay attention and gather data or experiences that might assist in the endeavor. Finally, they acknowledge that getting respondents to use a common frame of reference is tougher than providing one. The use of instructions in surveys is one mechanism for providing a common frame of reference. Particularly in establishment surveys, the instructions are often very important for conveying the correct specifications or intent of the question, as they may contain information on the definition of the reporting unit, specific things to include or exclude in Fig. 15. 2007 Commodity Flow Survey: improved directions and example the response, and other types of instructional material. Respondents frequently do not refer to words they believe to be extraneous, including instructions or words located within parentheses. Respondents believe they understand exactly what the question is asking, or that they already know what the answer is without further clarification; as a result, they might miss information that refines the question's intent (Gower 1994). Visual design can be used to call attention to instructions that respondents might otherwise ignore."}, {"section_title": "Guideline 11 -Incorporate Instructions into the Question Where They Are", "text": "Needed. Avoid Placing Instructions in a Separate Sheet or Booklet Going from the middle of a questionnaire to a separate instruction book in order to find a definition or some other piece of information needed for answering that question requires initiative on the part of the respondent. Cognitive testing with respondents has demonstrated that to the extent that instructions are separated from the questions, respondents are less likely to look for them, look at them, or use them in formulating a response to the question presented. Dillman (2000) mentions the varying degree in respondents' usage of separate instruction booklets, \"resulting in some respondents being subjected to different stimuli than are others\" (p. 100). The likelihood of a respondent using instructions is greater when they are located with the question (Gower 1994). In addition, providing instructions between the query (or question) and the answer space further increases the likelihood they will be used. Recent research on web surveys (Tourangeau 2007) reveals that the greater the effort respondents have to expend to find instructions, the less likely they are to use them. An establishment survey example can be found in the 2002 Commodity Flow Survey (CFS), an eight-page questionnaire accompanied by a separate eight-page instruction guide. One of the most critical questions on the survey asked for the total number of outbound shipments made by the establishment during a 1-week reporting period (Figure 16). Cognitive testing showed that respondents defined \"shipment\" significantly differently from the survey program (Barnett et al. 2005). Though some important pieces of the definition were shown with the question, other pieces were located in the separate instruction booklet (see Figure 17), leading to an underestimate in the number of outbound shipments. For the 2007 CFS, the most critical information about the definition of \"shipment\" was moved to the questionnaire (see Figure 18), immediately prior to the question. Respondents were directed to a specific location within the separate instruction guide for further assistance (\"For further information, refer to the Instruction Guide, page 2.\"), where they found examples of things to be included or excluded in the response, rather than critical definitional points. As part of the redesign of the Bureau of Economic Analysis' quarterly foreign direct investment questionnaire, a significant change involving instructions was made. Rather than putting question-specific instructions in a separate booklet, they were placed on the page opposite from the questions. In the new design, questions were generally placed on the right side of two facing pages, while the appropriate instructions for those questions were placed on the left side. An example of two facing pages can be found in Appendix A. Results from cognitive testing showed that this placement of instructions was more easily accessible to respondents, and encouraged them to read and pay attention to them (Tuttle et al. 2007). When a paper instrument becomes electronic, the instructions that appeared with questions on the paper version should also appear with the question (not with a help link) in the electronic version. The mode guidelines that are used for the 2010 U.S. Decennial Census and American Community Survey refer to this as \"universal presentation.\" Universal presentation means that \"the meaning and intent of the question and response options must be consistent: : :the goal is that instruments collect equivalent information regardless of mode: : :that the same respondent would give the same substantive answer to a question regardless of the mode of administration\" (Martin et al. 2007). When electronic surveys require information to be entered in a specific way, notify respondents at the point where that information is most useful. For instance, the Census Bureau's Harvester web data collection system places mode-specific instructions below the question-specific instructions, as shown in Figure 19."}, {"section_title": "Guideline 12 -Consider Reformulating Important Instructions As Questions", "text": "Economic survey instruments often contain general -rather than question-specificreporting instructions prior to the first question. These instructions, for example, may inform the respondent that certain parts of a company or establishment should be included or excluded from the responses they provide on the questionnaire. One way of increasing the likelihood of getting people to attend to instructions is to convert the latter into questions (Willimack, personal communication). This method worked for the Bureau of Economic Analysis quarterly foreign direct investment questionnaire, especially for defining the reporting unit. Under the previous design, the definition of the reporting unit took up nearly one-quarter of the separate instruction booklet, where respondents seemed to rarely read it, to judge by observed reporting errors. Through the conversion of these instructions into questions and assignment of item numbers to them, respondents paid attention to the relevant points and reported accurate data (Tuttle et al. 2007). Another reason for converting instructions into questions is to help clarify or correct reported data, thus assisting the processing staff in adjusting reported data to meet the requirements for analysis. For example, the 2004 Medical Expenditure Panel Survey (and several prior years) asked a question about whether data reported in previous questions included information for the desired reporting unit at only the location specified on the cover sheet, rather than multiple locations (see Figure 20)."}, {"section_title": "Guideline 13 -Consider Converting Narrative Paragraphs into a Bulleted List", "text": "Instructions are often written in the form of long narrative paragraphs, which respondents tend to skim over rather than read carefully. Gernsbacher (1990) demonstrates that readers spend more time on the initial sentences of paragraphs, indicating that later sentences, and the details contained therein, receive less attention. Thus, by using bulleted lists, the number of initial sentences is effectively increased, so the details receive more attention than if they were located within a paragraph. Furthermore, bulleted lists encourage reading, because the density of text is reduced, and it becomes less intimidating. In the 2003 Service Annual Survey, respondents were asked about revenue from exports ( Figure 21). The question was hidden below a long paragraph that defined what an export was, as well as what elements were to be included in and excluded from the response. When the survey underwent a significant redesign for 2005, one change involved splitting the paragraph into pieces, and adding bullets for the include and exclude lists (Figure 22)."}, {"section_title": "Be Consistent in How Answer Spaces and/or Response Categories are Displayed", "text": "Answer spaces and response categories are both very important types of information in the survey questionnaire because this is where respondents report their responses. They can also be important tools for conveying the type of information or level of detail expected. Therefore, it is especially important that answer spaces and response categories are easy for respondents to locate and that they visually stand out from the question, instructions, and other information in the survey. When respondents are presented with visual information in the questionnaire, they quickly decide which elements to focus on and what is in the background (Lidwell et al. 2003;Ware 2004). The Gestalt principle of pragnanz suggests that visual features that are regular and simple are easier to perceive and remember. The Gestalt principle of similarity also suggests that respondents are more likely to perceive the answer spaces or response categories as being related to one another if they are the same color. To facilitate the comprehension process, answer spaces in white should be displayed against a lightly colored background for the questionnaire pages or screens (see Figure 7 for an example). Since the answer spaces are smaller against a larger colored background, the answer spaces \"rise\" above the colored background as figures -the objects of interest -and thus are seen as more prominent. This occurs because the eye associates convex angles with figures and concave angles with ground (Hoffman 1998). In addition, for paper questionnaires the contrasting, surrounding color provides a visual guide that helps respondents keep answers inside the answer space. Finally, white answer boxes against colored backgrounds are especially important when used in many optical imaging and scanning systems. When white answer spaces are employed, there is little need for lines to surround each answer space (see Figure 7). The visual rationale for eliminating lines is that the contrast between the background color and the white answer spaces is sufficient for the eye to distinguish one space from another, which makes black lines around answer spaces unnecessary (Dillman et al. 2005). Black dividing lines tend to focus visual attention between answer spaces, requiring the respondent to, in essence, read past them. However, lines around the answer space may be effective when they indicate a change in action, as in Figure 7, Question 20, when respondents must perform a mathematical operation on the information provided earlier on the page."}, {"section_title": "Guideline 15 -Use Similar Answer Spaces for the Same Task", "text": "Within the questionnaire, it is also important to use similar types of answer spaces when respondents are being asked for the same type of information. Research has shown that respondents use all the available information to help them formulate an answer. That is, in addition to the questions themselves, respondents use information provided by the response categories and answer spaces (Sudman et al. 1996). Labeling response categories with clarifying information about what is being requested, using appropriate symbols, and providing answer spaces sized appropriately for the information being requested improves the likelihood that respondents will provide the type of information desired by the survey sponsor (Couper et al. 2001;Christian et al. 2007). For economic surveys at the U.S. Census Bureau, where detailed numeric information is often requested, some paper questionnaires provide delineated answer spaces while others use one open answer space. For example, the Annual Retail Trade Survey uses open text boxes for dollar amounts (Figure 23). In contrast, the Annual Wholesale Trade Survey uses a delineated box where dashed lines separate spaces for billions, millions, and thousands of dollars ( Figure 24). Cognitive testing of these instruments has suggested that respondents do not have a strong preference for open answer spaces or delineated answer spaces, as long as the answer spaces are sized appropriately for the information being requested (Morrison and O'Neill 2007). Delineated answer spaces may be preferred because they decrease the cost of keying forms or increase accuracy when questionnaires are optically scanned and verified, since delineated answer spaces often require less interpretation on the part of the key entry person or the verifier. Overall, it is desirable to use the same type and size of answer spaces when requesting similar information. For example, if acreage or dollar amounts are requested in different parts of the questionnaire, it will help respondents if the same types of answer spaces are used (e.g., delineated or not) and if the size and labels (e.g., $ or %) are also similar across answer spaces. In addition, on web questionnaires, it is helpful to use radio buttons when asking respondents to select only one response and html boxes when respondents may select more than one response. However, these visual cues should also be reinforced with written instructions because some web respondents may not readily know the difference between radio buttons and html boxes. Matrices are often employed in establishment surveys, \"usually as a way to save space by reducing the number of times a question is asked or to avoid repetitive questioning about similar items\" (Hunter et al. 2005). Though efficient in terms of the amount of space needed on a page, matrices are burdensome in terms of the cognitive processing required of respondents. Respondents must keep multiple pieces of information -based on the row and column headers, as well as any accompanying information and instructions -in their heads at one time to provide their response. In his examination of the 1992 Manufacturing Energy Consumption Survey, Dillman (2000) referred to the difficulties involved in \"having to comprehend several different lines of information simultaneously in order to know what the actual survey question is\" (p. 343). Tourangeau et al. (2000) suggest that such an effort is taxing on the brain's working memory; as a result, some pieces of information may be dropped. The matrix in Appendix B comes from the Bureau of Economic Analysis former quarterly foreign direct investment questionnaire, in use before 2007. It is quite complex, because in order to provide appropriate data, respondents must keep the following pieces of information in mind: a specific country, only certain entities within the respondent's corporate structure, beginning of-and end of-quarter balances for long-term liabilities, and other specific types of liabilities (e.g., interest, royalties, film and television tape rentals). The matrix makes it somewhat clear where respondents should enter their data (in the white answer spaces, though the column for \"BEA Use Only\" is also in white), but the cognitive burden associated with completing the matrix is still present. Eliminating the matrix by converting each data item into an individual question might significantly reduce the cognitive burden associated with completing it, though linkages among them might be lost. However, doing so was not a feasible option for this survey, which is true for many establishment surveys. Reading tables and matrices is a learned skill that is highly developed in the case of accountants who typically work with spreadsheets. Matrices may be appropriate under certain circumstances, namely when the survey's respondents are likely to have acquired the skill of working with tables. In determining whether or not using a matrix is appropriate, it is best to consult with respondents, whether through qualitative or quantitative pretesting, or through examinations of record-keeping practices, to learn as much as possible about their perspective. When a survey's respondents are not likely to be familiar with tables, it would be better to minimize the use of matrices, or at a minimum provide more open space to make them look less intimidating. The example shown in Appendix B is part of a matrix that spreads across two sheets of legal-sized paper. This matrix is a critical component of the data collection effort for the Bureau of Economic Analysis quarterly foreign direct investment survey. Interviews conducted with approximately 25 respondents indicated that most of them had a background in accounting and were familiar with reading tables and spreadsheets. It was reasonable to retain a matrix format; however, it was redesigned to be less intimidating and more visually appealing (see Appendix C). Details follow in 3.7.2."}, {"section_title": "Guideline 17 -If a Matrix is Necessary, Help Respondents Process Information by Reducing the Number of Data Items Collected and by Establishing a Clear Navigational Path", "text": "When matrices must be employed as a way of collecting information in establishment surveys, survey designers can help ease the cognitive burden on respondents through improved visual layout, by taking advantage of the Gestalt principles of proximity (items that are close together appear related) and connectedness (items that are connected to each other appear related). Once the expected path through a matrix has been determined, survey designers can communicate that path to respondents by connecting items and increasing or decreasing space accordingly. One way to make matrices easier for respondents is by reducing the number of data elements that are collected in the matrix. This could be done by condensing several rows or columns, as was done as part of the redesign of the Annual Survey of Local Government Finances (F-28). As can be seen in Figure 25, Part VII of the 2003 version of the questionnaire asked respondents to split their long-term debt among systems for public Fig. 25. A difficult matrix from the 2003 Annual Survey of Local Government Finances (F-28), long-term debt schools, water supply, electric power, gas supply, and transit (Rows 1-5), as well as privately owned housing or industrial or business purposes (Row 6). The matrix had six columns and seven rows. When the survey was redesigned, the rows for the various systems (water supply, electric, gas, transit) were condensed into \"long-term debt for public purposes.\" The longterm debt for public purposes was then asked about separately from the \"long-term debt for private purposes,\" which had been collected in Row 6 in Figure 25. Also, rather than collect this collapsed information in a matrix, two separate questions -each with four subitems -were asked, as seen in Figure 26. The end result was the elimination of the matrix. Another way of reducing the number of data elements to be collected is to avoid requiring respondents to copy data reported previously in the questionnaire, or asking them to perform calculations on the data they are reporting. Calculations could instead be handled as part of post-collection processing. When the 2006 Manufacturing Energy Consumption Survey was fielded, a shorter version of the questionnaire was created that reduced the number of data items that were collected using both of these techniques. The decision to create a shorter questionnaire came as a result of an analysis of response rates for the 2002 survey that indicated different reporting patterns for smaller establishments than larger ones. Once the data elements, rows, and columns of a matrix have been determined, it would be helpful to establish the expected navigational path through the matrix. Usually, this involves guiding respondents through the matrix either row-by-row or columnby-column. In some cases, testing with respondents will indicate that most respondents take a similar course. In other cases, testing with respondents will not provide an indication of a \"typical\" path. In this event, the survey designers should take the lead in setting up a navigational path, so as to minimize the possibility of measurement error arising from inconsistencies in the way respondents choose to complete the matrix. This can be done using dominant vertical or horizontal lines. If the matrix should be completed by rows, use a dominant horizontal line; if it should be completed by columns, use a dominant vertical line. The matrix shown in Appendix B gave no indication as to the expected path of completion. Lines were of equal shading, and spacing was uniform. The redesigned matrix (Appendix C) utilizes a light blue background with white answer spaces. A darker shade of blue was used to separate one row from another, indicating that respondents should complete the matrix row-by-row. The spacing of the matrix's columns was not altered significantly. However, the addition of the \"000\" in a column that shared shading with the background (indicating that responses should be reported in thousands of dollars, rather than dollars) at the end of each answer space served to add space between data elements. Cognitive testing and a pilot test on the redesigned matrix showed that it performed better than the old version (Tuttle et al. 2007). The improvement cannot be attributed solely to the usage of lines and spacing, however. Additional factors included a clearer navigational path (made clear with the reverse-print bubble numbers), more open space, and a reduction in the number of data elements that were collected."}, {"section_title": "Guideline 18 -Use Font Variations Consistently and for a Single Purpose Within a Questionnaire", "text": "Survey designers can vary the fonts used in the questionnaire in different ways by changing the size, contrast (bolding and color), and style (italics, capitalization, serif vs. sans serif fonts, etc.). Using the same font or text style for different purposes in one questionnaire can confuse respondents. For example, bolding can be used to draw people's attention to a particular word or phrase so that people quickly and easily process that information. However, when many items are bolded in the questionnaire it reduces the effect of highlighting any one item (Ware 2004). The 2004 Annual Survey of Local Government Finances used bold text for several purposes on the first page of the questionnaire (see Figure 27). Bolding was used to denote: 1. The \"Return To\" information 2. \"Census Use Only\" information 3. The header for \"Basic Instructions and Suggestions\" 4. Emphasis within instructions (e.g., \"ended between July 1, 1998 and June 30, 1999\"), and 5. The Part 1 Section Header \"Revenues\" Cognitive interviews with 28 respondents to the survey indicated that they did not understand why bold text was being used and were confused because bolding was used for different purposes. The Annual Survey of Local Government Finances later underwent a significant redesign. As part of that redesign, bold print was reserved for headings and questions. In addition to being bold, headings were printed in upper case letters with a larger font. This made the bolded headings stand out from the bolded questions, which is another good example of applying multiple font variations in a consistent manner. Applying font variations consistently -for example, where bold text is used for one purpose and reverse print for another -can reduce the complexity of the information presented in the questionnaire and help respondents see how information is related. The Gestalt principle of similarity states that people are more likely to see information as related when similar in color, size, style, and shape (Lidwell et al. 2003;Ware 2004). With presentation of the same type of information by means of similar font variations, respondents can more easily distinguish between different types of survey information in the questionnaire (Dillman et al. 2005). Consistency in how textual information is displayed is important in improving usability, helping people learn new things quickly, and focusing people's attention on relevant information (Lidwell et al. 2003). For each questionnaire, it can be helpful to establish rules for how font variations such as color, size, bolding, italics, capitalization, reverse print, etc. should be used so that only one meaning is assigned to each variation. Although we do not suggest which font variation should be used for a particular meaning, as this may vary from questionnaire to questionnaire, we now discuss several examples of using font variations consistently. At the U.S. Census Bureau, there have been several different methods for formatting text in questionnaires. Based on cognitive pretesting of different questionnaires with respondents to the agency's establishment surveys, using the following font variations consistently for specific types of information has been shown to work well. First, it can be helpful to distinguish item numbers by using reverse print bubbles (e.g., , , ) to help respondents complete the questions in the intended order. To aid in reading, sans serif fonts in sizes greater than 8-points are generally used. One way to help respondents focus on the query is to use a larger sized font; this helps the question stand out from other information, such as response options or instructions. As an alternative to using plain text for instructions, italics can be helpful if other information, such as response options, is provided in plain text. Using italics for instructions, definitions, or examples occurs more often in paper than web questionnaires. Using a font variation to distinguish instructions, examples, and definitions can help draw respondents' attention to this important information that is necessary for answering the question. Bolding is a very powerful tool, since increasing the contrast helps to make the bolded text stand out from other information on the page or screen (Ware 2004). Bolding can be used effectively to emphasize information within questions, for separating lists of items into categories, and for totals where respondents need to sum across a number of responses. Figure 11 shows a consistent use of font variations. For that survey, questions were printed in bold text, while instructions were in italics. Response options were in plain text. In paper questionnaires, it is often necessary to include information needed only for the agency, say for processing purposes, such as key entry codes. While it is important to consistently display these codes to help with data entry, this information should also be de-emphasized or made less visible to the respondent. One way to make processing information less visible is to reduce the size of its text compared to the other survey information that it is important for respondents to make use of. Another strategy is to use a darker shade of the background color for key entry codes, which helps to make them visually recede into the background (see Figure 28). If no background color is used, Fig. 28. Keycodes that recede visually, because of being printed with a darker shade of the background color agency-only information can also be put in gray font, where respondents are more likely to focus on the high contrast black text. Finally, processing information should be located at the bottom of the page instead of the top, or outside the navigational path and answer spaces, to help ensure that respondents pay less attention to this type of information. Overall, we suggest applying font variations consistently throughout the questionnaire. Different guidelines may be developed for specific questionnaires based on whether paper and/or web is used, the complexity and type of information being requested, and the respondents who will be answering the survey. However, most respondents are likely to be confused if one font variation, such as bolding, is used for multiple purposes within the questionnaire."}, {"section_title": "Conclusions", "text": "Historically, the design of establishment surveys at many statistical agencies was a paperonly environment, which emphasized getting as much information as possible on individual pages in order to keep mailing costs low. The introduction of web and other electronic forms of reporting has brought into question many of these construction methods, and research is now making it evident that the visual layout of questionnaires, as well as the wording of questions, can help ease the cognitive burden on respondents. In this article we have proposed 18 guidelines for constructing establishment survey data collection forms, applicable to both paper and electronic instruments. These guidelines are grounded in visual design theory and experimental evidence on how alternative visual layouts influence people's answers to survey questions. The guidelines are also based on research into how people read and process verbal information presented to them. Finally, the guidelines proposed here have been informed by evidence from cognitive interviews with establishment survey respondents, while recognizing the multiple mode environment prevalent for establishment surveys in many statistical agencies. The guidelines include: 15. Use similar answer spaces for the same task. 16. Limit the use of matrices. Consider the potential respondent's level of familiarity with tables when deciding whether or not to use them. 17. If a matrix is necessary, help respondents process information by reducing the number of data items collected and by establishing a clear navigational path. 18. Use font variations consistently and for a single purpose within a questionnaire. The guidelines presented here are only a beginning. They were developed for use by one agency's establishment surveys. Many more issues can and should be addressed in order to develop more comprehensive guidelines, and there is a need for testing (cognitive or otherwise) to evaluate the applicability of these guidelines across many diverse establishment survey populations in multiple countries. The proposed guidelines can be corroborated by embedding experiments into establishment surveys. Additions and adjustments to the guidelines might be made, especially when it comes to matrices, their display, and how to get respondents to complete them correctly. Grounding question construction guidelines in theories of how people process information, along with evidence from experimental research and cognitive testing, provides an opportunity to move beyond the inherent limitation of rules of construction developed for one survey being applied differently in different surveys. By applying guidelines that incorporate theory and research on wording and visual design, survey designers can move from making decisions based on \"what looks good to me\" to \"what encourages respondents to process and pay attention to what is important.\" We can begin to envision comprehensive sets of guidelines that can be applied far more broadly by statistical agencies that will improve the quality of data collected from establishments throughout the world."}]