[{"section_title": "Abstract", "text": "A central question in ecology is how individual ®tness interacts with the spatial variation in population density and habitat characteristics across species' ranges. We used uctuating asymmetry (FA) as a measure of developmental stability (DS) in individuals of Tyrannus for®catus to estimate the suitability of sites of varying abundance and position within the species' range. FA in the inner-tail feathers of males and females is not spatially correlated across the species' range. FA in males increases towards the centre of the range and is not correlated with abundance. FA in females is not correlated with position in the range or abundance. Our results suggest that optimal sites are found throughout the range of the species, whereas suboptimal sites are mainly found towards the centre of the range. Additionally, our results suggest that abundance may not re¯ect the suitability of sites across species' ranges."}, {"section_title": "I N T R O D U C T I O N", "text": "One of the central problems in ecology, biogeography and conservation biology is the identi®cation of habitat suitability across heterogeneous landscapes. Theory and empirical evidence suggest that populations vary spatially in their rates of survival and reproduction and that this variation may be related to spatial variation in habitat suitability. For example, species may occur in``sink'' habitats where local reproduction is insuf®cient to balance local mortality; such populations persist by immigration of individuals from more productive``source'' habitats (Pulliam 1988; Pulliam & Danielson 1991; Dias 1996) . Because population densities are often higher towards the centre of a species' range (Hengeveld & Haeck 1982; Brown 1984 Enquist et al. 1995) , some researchers postulate that biotic and abiotic conditions must be less favourable, on average, to individual ®tness closer to the edge of a species' geographical range (Mayr 1963; Dobzhansky 1970; Brown 1984; Gaston 1990; Lawton 1993; . However, the relationship between spatially averaged population densities and``suitability'' or individual ®tness may vary in a complex manner and depend on rates of dispersal among habitat types. In addition, unexpected density effects, such as increased frequency of disease and parasitism, may obscure, or even reverse, the expected relationship between local population density and overall suitability of a site. Furthermore, infrequent but severe environmental disturbances could lead to a large within-site variation in individual ®tness in what is otherwise high-quality habitat.\nBecause it is often dif®cult to assess individual ®tness at broad spatial scales, it is advantageous to identify alternative correlates of individual ®tness that can be measured across the geographical range of a species. One such correlate is developmental stability (DS) (Mùller 1997 (Mùller , 1999 ; but see also Clarke 1998) . DS is the capacity of the genotype to counteract the disruptive effects of random deviations during ontogeny (Parsons 1990 (Parsons , 1992 Palmer 1996) . In bilaterally symmetrical traits, the idealized shape of the structure is usually known. As a result, small deviations from perfect symmetry, known as¯uctuating asymmetry (FA), are commonly used as a measure of DS. Because high stress disrupts proper development (Parsons 1992) , FA has been proposed as a way to measure perceived environmental and genetic stress in populations. FA has been shown to respond to a large variety of genetic (inbreeding, hybridization, disruption of genetic balance) and environmental (population density, parasite load, pollution, climatic extremes) stresses (Parsons 1990; Palmer 1996; Mùller & Swaddle 1997; Mùller 1998; Mùller & Shykoff 1999) . Nonetheless, different studies show evidence of contradictory relationships (e.g. Fowler & Whitlock 1994; Heard et al. 1999; Quek et al. 1999) .\nEnvironmental stress has been shown to reduce the survival and reproduction of individuals. For example, Boonstra et al. (1998) have demonstrated a positive relationship between stress and population decline. In Lepus americanus (snowshoe hare), stress provoked by high predation risk resulted in a marked deterioration in reproduction. Hence, less suitable habitats can be considered sites of high environmental stress. Identifying levels of DS across individuals and populations can therefore help to identify habitat suitability at a regional scale.\nIn this study, we examined patterns of DS across the breeding distribution of the scissor-tailed¯ycatcher (Tyrannus for®catus (Gmelin); Passeriformes: Tyrannidae). Tyrannus for®catus is a Nearctic±Neotropical migrant with a breeding distribution in the south-central U.S.A. Within its breeding range, the¯ycatcher exhibits a consistent decrease in average abundance towards the edge of the range (Brown 1984) . In general, sites of high density tend to be concentrated towards the centre of the range, whereas sites found towards the edge have consistently low densities . The pattern of abundance has been used to postulate that habitat suitability decreases towards the edge of the range (Brown 1984; . Tyrannus for®catus has many bilateral traits that could potentially exhibit FA. For example, it has a high degree of sexual dimorphism in its tail feathers, a characteristic that might enhance a lower degree of DS and thus more opportunity for developmental noise to operate (Mùller & Pomiankowski 1994) .\nEvidence supporting an association between DS and position within the range in species has come from plants, lizards and birds. These studies have compared marginal and central populations (e.g. Mùller 1995; Carbonell & Tellerõ Âa 1998; Siikamaki & Lammi 1998) or restricted gradients in elevation (Zakharov 1981) . Here, we ask whether patterns of DS across the scissor-tailed¯ycatcher range vary as predicted by the hypothesis that habitat suitability increases towards the centre of a species' range. As a result, we expect, on average, an increase in FA towards the edge of the range. At the same time, if abundance re¯ects the habitat suitability of a site, we expect a negative correlation between FA and abundance. Because drift and inbreeding may reduce genetic variation in the frequently small and isolated populations at the range margins (Mayr 1963; Levin 1970; Lawton 1993) , higher levels of FA towards the edge of the range could be the result of both higher genetic and environmental stresses."}, {"section_title": "M A T E R I A L S A N D M E T H O D S The species", "text": "Tyrannus for®catus is a common breeding migrant of central North America with a north±south distribution from southern Nebraska to north-east Mexico and an east±west distribution from Arkansas to eastern Colorado and New Mexico (Fitch 1950 ) (see Fig. 1 ). Wintering scissor-tailed ycatchers are found from southern Mexico through central Costa Rica, and also in southern Florida (Regosin 1998) . The breeding and wintering habitat of Tyrannus for®catus is mainly open areas, including savannas, shrub and brush patches, agricultural ®elds, pastures, landscaped areas, second growth and edges of tropical deciduous forests (Regosin 1998) . During spring and autumn migration, thē ycatcher can be found in open grasslands, agricultural lands and towns (Regosin 1998) . The¯ycatcher feeds almost exclusively on insects, especially grasshoppers, crickets and beetles. The bird usually forages at heights ranging from ground level to 10 m (Regosin 1998) . Breeding occurs once a year mainly during the months of May±July. Some birds of both sexes are thought to breed in the ®rst year, but there are no conclusive data (Regosin 1998) . Natal philopatry is low, as none of 108 banded nestlings returned to the natal site (Regosin & Pruett-Jones 1995) . However, breeding site Figure 1 Breeding distribution of scissor-tailed¯ycatchers. Crosses indicate sites where specimens were collected. The full line indicates the approximate normal boundary of the breeding range, as digitized from Robbins et al. (1986) .\nEnvironmental stress across a species, range 445 ®delity is high: 47.8% of males and 57.6% of females returned in subsequent years to the same breeding site (Regosin & Pruett-Jones 1995) ."}, {"section_title": "Studied individuals", "text": "We obtained specimens from the bird collections of the American Museum of Natural History, Carnegie Museum of Natural History, Cornell University Ornithology Collection, Delaware Museum of Natural History, Field Museum, Harvard Museum of Comparative Zoology, Los Angeles County Museum, Michigan State University Museum, Museum of South-western Biology, Smithsonian Institution, University of California at Berkeley Museum and University of Oklahoma Museum. We chose to measure individuals deposited in museums to avoid the high costs and large amount of time involved in sampling natural populations across large geographical scales. Using museum specimens may add noise to the data, but is unlikely to change a strong FA signal. For example, unless a highly improbable bias during specimen collection caused the sampling of low-FA individuals from the centre and high-FA individuals from the edge of the range, a major bias in the data is unlikely. We measured all individuals available in the museum samples. However, only non-moulting breeding adults (collected from May±July) that were collected mostly within the known distribution of the species were included in the analysis. We determined the age and sex of individuals from specimen tags and by using Pyle et al. (1987) .\nThe abundance and position within the range were determined using data from the North American Breeding Bird Survey (BBS; Robbins et al. 1986; Peterjohn 1994) . The BBS data provide information on the relative abundance within standardized censuses conducted annually at sites across the U.S.A. and Canada. At each site, on one morning of June, an experienced observer drives a prescribed 39.4 km route, stopping for 3 min every 0.8 km to record all birds seen or heard. We calculated the mean breeding season abundance at each BBS sample site over all years of data available (1966±92). We used the mean abundance through time as our abundance variable for three reasons. First, have demonstrated that the scissor-tailed¯ycatcher maintained generally similar abundances at the same sites over a period of 20 years. Second, the dates of collection of specimens (1878±1978) are much wider than the width of the time of the BBS. Third, using the mean abundance over time provides a way to control for sampling and observer error occurring at any given year of the census. The geographical coordinates of each BBS site were entered into a Geographic Information System (GIS), which was used to construct a continuous abundance surface across the range of the species. The geographical coordinates of the studied museum specimens were also entered into the GIS (see Fig. 1 ). To calculate the position within the range, the peak of the abundance surface was used as the centre of the abundance distribution of thē ycatcher and the GIS was used to calculate the straight-line distance from each museum specimen location to this point. We decided to use the peak of abundance as the centre of the species' range as previous studies have demonstrated that abundance increases towards the centre of the range in the¯ycatcher (Brown 1984; . We determined the abundance of the species at each specimen collecting site by using the GIS to ®nd the closest BBS site to each specimen location; the abundance at that site was then considered to be the¯ycatcher abundance at the specimen location. The median distance between each collecting site and the closest BBS site was 23.7 km, the minimum distance was 2.3 km and the maximum 57.3 km. The distances between the collecting and BBS sites are, for the most part, smaller than the actual distance of the BBS route. Moreover, abundance is positively autocorrelated across space in the scissor-tailed¯ycatcher . Hence, the technique is unlikely to cause a large misallocation of the abundance value for the specimens."}, {"section_title": "Asymmetry", "text": "FA measures the degree of environmental and genetic stress experienced by individuals during ontogeny. Thus, stress perceived at different stages of development will be re¯ected in the FA of a given structure. In birds, plumage is generally moulted twice a year. In Tyrannus for®catus, all feathers are moulted during basic moult, while mainly primaries and feathers related to prenuptial plumage are changed during alternate moult (Pyle et al. 1987; Regosin 1998) . Tail feathers do not seem to be moulted during the alternate moult (J. Regosin, personal communication, 1999) . Alternate moult occurs in the breeding grounds from April to May (Pyle et al. 1987 ). As we sampled breeding adults collected between May and July, wing feather FA is more likely to measure environmental stress in the breeding grounds. According to Pyle et al. (1987) , basic moult occurs from August to December, in both the breeding and wintering grounds. Bent (1942) and Sutton (1986) stated that adult basic moult occurs immediately after reproduction (August±September). Because there is agreement between two independent sources of information, we follow Bent and Sutton's basic moult timing. Hence, we assume that tail feather FA measures environmental stress in the breeding grounds immediately after reproduction. However, it is important to note that a few individuals could also be undergoing moult in the wintering grounds. Most breeding adults exhibit a high rate of breeding site ®delity (Regosin & Pruett-Jones 1995; Regosin 1998 ). Moreover, post-breeding movements, if any, seem to be con®ned to the formation of premigratory roosts that may serve an area up to 5 km in diameter (Regosin 1998) . Hence, our feather FA measurement is likely to re¯ect DS at the site of specimen collection.\nWe measured, to the nearest 1 mm, the wing chord of the left and right wings, outer-tail feathers (OTF, sixth pair of rectrices), middle-tail feathers (MTF, ®fth pair) and inner-tail feathers (ITF, fourth pair) (see Fig. 2 ) and, to the nearest 0.05 mm, the tarsus length of a total of 151 breeding adult specimens of Tyrannus for®catus (94 males and 57 females). The ®nal sample size within each trait varied as some individuals either lacked or had damaged feathers. We separated males from females in the analysis as males are more likely to show lower levels of DS in secondary sexual characters (Mùller & Pomiankowski 1994) . We measured FA as the signed difference between the left and right side in all traits. We tested whether FA exceeded measurement error using a mixed-model analysis of variance (ANOVA) on 35 birds measured four times each (Palmer & Strobeck 1986) ."}, {"section_title": "Analysis", "text": "We used a Mantel test to assess whether FA was spatially autocorrelated across the breeding range of males and females. We used 1000 permutations to test for the signi®cance of the correlation between the distance matrices of the FA values within sites and the distance between sites. We performed Spearman rank correlations to determine the relationships of FA with abundance and distance from the centre of the range for males and females separately. Because relatively few individuals were sampled in the low abundance sites near the edge of the range, we iterated a randomization procedure 5000 times to test the robustness of the patterns observed. The randomization consisted of reshuf¯ing the symmetry values, while constraining the abundance and position within the range values. Specimens were collected from 1878 to 1978; hence, we tested for the possibility of temporal change in our results by performing correlation analyses across different decades. Because distance from the centre and abundance are correlated to each other, we performed a partial correlation analysis to establish if any relationship between FA and one variable persisted after controlling for the effect of the other. Because the data have a non-normal distribution, we tested the signi®cance of the correlations using permutation analyses. We iterated the FA values 10,000 times while maintaining constant the abundance and distance from the centre values."}, {"section_title": "R E S U L T S", "text": "The asymmetry in tail feathers, but not wings or tarsi, exceeded the measurement error (Table 1 ). The statistical de®nition of FA is that the asymmetry is normally distributed with a mean of zero (Palmer & Strobeck 1986; Zakharov 1989) . The asymmetry of the ITF meets this de®nition, but neither MTF nor OTF asymmetry does ( Table 2 ). The statistical distribution of MTF and OTF is leptokurtic for both males and females (see kurtosis level in Table 2 ), suggesting that the stabilizing selection against high levels of FA is occurring on these feathers (Palmer 1996) . The main consequence of this selection is a decrease in FA levels of these traits (Palmer 1996) .\nHigh levels of FA in the OTF may be selected against because of aerodynamic constraints in birds (Balmford & Thomas 1992; Balmford et al. 1993) . Researchers have argued that birds with deep and shallow forked tails will be more likely to suffer from decreases in lift and manoeuvrability if FA increases in the OTF (Balmford et al. 1993) . Hence, we decided to use only the ITF feather absolute FA to associate DS with position across the range and abundance. As there was no effect of trait size on ITF FA (Spearman rank correlation; males: N 79, R 0.13, Environmental stress across a species, range 447 t(N ± 2) 1.20, P 0.23; females: N 49, R 0.17, t(N ± 2) 1.17, P 0.25), we did not correct for size effects during the analysis (Palmer 1994) .\nIn both males and females, ITF FA is not spatially autocorrelated across the range (males: N 1000, r )0.05, P 0.86; females: N 1000, r )0.02, P 0.64).\nThe ITF FA in males was negatively correlated with distance from the centre of the range and positively correlated with abundance (position within the range: N 79, R )0.33, t(N ± 2) )3.04, P 0.00; average abundance: N 79, R 0.25, t(N ± 2) 2.26, P 0.03; Fig. 3 ). In females, however, the ITF FA was low and did not change with position within the range or abundance (position within the range: N 49, R )0.72, t(N ± 2) )0.50, P 0.62; average abundance: N 49, R 0.09, t(N ± 2) 0.64, P 0.52; Fig. 4) .\nIn six out of seven decades (with N ³ 4), male ITF FA showed a negative correlation with distance from the centre of the range, and a positive correlation with abundance. This suggests that the pattern holds across time.\nWhen we controlled for the effect of a lower number of individuals towards the edge of the range, distance from the centre and ITF FA were still negatively associated (P 0.01), but the relationship between abundance and ITF FA was marginally non-signi®cant (P 0.07).\nWhen we performed the partial correlation analyses, distance from the centre and ITF FA were still negatively associated (N 10,000, partial R )0.16, P 0.05), but there was no relationship between abundance and ITF FA (N 10,000, partial R 0.03, P 0.39)."}, {"section_title": "D I S C U S S I O N", "text": "We used DS to investigate whether abundance and position within the range are related to habitat suitability in a bird species. DS was associated with position within the range in males but not in females. A non-linear relationship between DS and position within the range was observed. DS decreased towards the centre of the range and, although variable, increased on average towards the edge. DS was not related to abundance in females or males. DS at a given location across the range was not similar to neighbouring locations. Because DS is high towards the edge of the range, its variation is unlikely to be the result of genetic stresses. Our results suggest that environmental suitability does not OTF, outer-tail feathers; MTF, middle-tail feathers; ITF, inner-tail feathers. Bonferroni adjusted P values were used: *P < 0.0001, ns = P > 0.01.\ndecline gradually towards the edge of the range of a species. Rather, it occurs as a mosaic of low-and high-quality sites across the range. Contrary to most theoretical accounts, we found evidence for suboptimal sites to be more common towards the centre of a species geographical distribution. Moreover, abundance may not re¯ect habitat suitability of sites across regional scales. Non-random specimen collection is not likely to be responsible for the patterns observed. First, it is improbable that collectors biased the specimen sample by targeting low-FA individuals towards the edge of the range. Second, it is unlikely that the high and low FA values observed towards the centre of the range are the result of studying specimens collected at different times, as the same pattern persisted when the data were partitioned by decades. Third, it is doubtful that high levels of FA towards the centre of the range are the result of museum specimens obtained through range-wide mortality events that may select against high-FA individuals (Brown & Brown 1998 ). The number of specimens collected at each site is small and sporadic, suggesting specimen collection by individual researchers.\nOne potential explanation for the higher average levels of DS towards the range margins is a variation in natural selection across the landscape. Natural selection in more stressful marginal environments may favour high-quality (low-FA) individuals. Individuals of higher genotypic quality are thought to produce symmetric structures even in conditions of high stress (Mùller & Pomiankowski 1994; Palmer 1994) . Hence, small FA values towards the range margins may be the result of selection for high-quality (low-FA) individuals. If selection against low-quality individuals was stronger at the edge of the range, we would only expect to ®nd individuals with low FA at these sites. Figure 3(a) shows that some male individuals near the range margins Environmental stress across a species, range 449 can have FA values as high as those found towards the centre. Moreover, high and low FA values are also observed at the range margins in females (Fig. 4a) . Hence, our results suggest that different selection regimes do not cause the variation in DS across the¯ycatcher distribution. Nonetheless, further empirical and experimental evaluation of this hypothesis is needed.\nDS was associated with position within the range in males but not in females. The reason for this pattern is unclear. One possibility is that females are less likely to respond to environmental stresses than males. Nonetheless, females invest lots of energy during the breeding season and even show an average net energy de®cit during brooding (Regosin 1998) . Thus, if anything, females should be more sensitive to environmental stress than males during the breeding season. A second possibility is that the ITF acts as a secondary sexual trait in males. Therefore, weak stabilizing selection may favour the production of higher FA levels in males (Mùller 1991) . Nonetheless, the feathers of both males and females have similar coef®cients of variation, with females showing even larger levels of variation (Table 2) . Hence, it is unlikely that males use the ITF during courtship. Finally, it is possible that the difference between sexes is the result of the rate of moult being much faster and more variable in males than in females. Consequently, male feather moult may be more sensitive to stress than female moult. Information on moulting rate is clearly needed to determine whether this mechanism is behind the differences between male and female FA.\nOur results suggest that abundance may not re¯ect the suitability of sites across species' ranges (Van Horne 1983). Furthermore, they also imply that overall habitat quality does not decline in a gradual and uniform way towards the edge of the range, but instead occurs as a mosaic of highand low-quality patches whose frequency varies in a complex manner.\nHigh abundance towards the centre may be the result of higher connectivity of suitable sites in the region. For example, it is often the case that occupied habitats are more frequent and less isolated from each other towards the centre of the range (Mayr 1963; Brown 1984) . As a result, dispersal events may in¯ate the number of individuals observed across these populations. In areas closer to the edge, where habitat patchiness increases, individuals cannot accumulate in high numbers. Hence, high abundance towards the centre is the result of a gradient in habitat patchiness rather than suitability. That is, instead of the environment varying in quality, the environment varies on how connected it is across the landscape (Holt & Keitt 2000) .\nIn the scissor-tailed¯ycatcher, postnatal dispersal is likely to increase the number of individuals in populations close to the centre of the range. In one population, postnatal dispersal occurred in 100% of the individuals sampled (Regosin & Pruett-Jones 1995) . Moreover, a map of the spatial variation in abundance across the scissor-tailed ycatcher's range demonstrated that occupied sites tended to be more frequent and closer to each other towards the centre of the range . Hence, the dispersal of individuals will increase the abundance of neighbouring populations at the centre.\nThe connectivity scenario is congruent with our results and known patterns on the dynamics of species' ranges. The connectivity hypothesis suggests that high-quality sites can be found across the entire range of a species (Carter & Prince 1981) , but vary in frequency and connectedness. As a result, individuals occupying these high-quality sites will experience low environmental stress independent of position within the range. A recent study on the dynamics of geographical ranges in 245 species belonging to very different taxonomic groups has shown that range contractions occur towards the periphery of the geographical range (Channell & Lomolino 2000) . Hence, this study also supports the idea that optimal habitats are found towards the edge of a species' range.\nOur results suggest that suboptimal sites are found across the whole range, but are more frequently observed towards the centre. Dispersal can provide individuals to populations where conditions are of low quality and which can persist only through immigration (Pulliam 1988; Dias 1996) . Occupied sites are more numerous and connected towards the centre of the range (Mayr 1963; . Hence, immigration from neighbouring populations will favour the persistence of high-FA (suboptimal) sites in areas closer to the centre of the range.\nThe suboptimal nature of sites close to the centre of thē ycatcher range may be the result of a high incidence of severe thunderstorms. In the scissor-tailed¯ycatcher, both predation and weather are considered to be major environmental factors causing egg destruction and nestling mortality (Regosin 1998) . The highest incidence of storms, tornadoes and hail in the U.S.A. occurs in south-central Oklahoma, close to the centre of the scissor-tailed¯ycatcher's range (NOAA 1999) , supporting the idea that severe thunderstorms may cause high stress at central populations. In our study, FA values at a given location were not similar in neighbouring sites. This suggests that storms may not have a similar effect in all populations near the centre. Hence, in sites where frequent storms produce large juvenile and nestling mortality, dispersal of new individuals from less weather-affected sites can overcome the reduction in individual numbers. Further empirical studies are needed to determine if weather or a combination of several factors is behind the suboptimal nature of sites at the centre of thē ycatcher distribution. The generality of our results across taxa is mixed. Previous research on nine species of North American and European bird by Mùller (1995) , the perennial herb Lynchis viscaria by Siikamaki & Lammi (1998) and Sylvia atricapilla (blackcap) by Carbonell & Tellerõ Âa (1998) has found that DS tends to decrease at the periphery of the range. However, none of these studies sampled DS across the entire distribution of a species. Thus, it is dif®cult to determine what part of the results is due to random¯uctuations in environmental stress across one dimension of the range. Moreover, only Siikamaki & Lammi (1998) demonstrated that environmental rather than genetic stresses might cause the increase in FA towards marginal and isolated populations. Nonetheless, this study was mainly performed at the periphery of the species' range, as even though the species has a central European distribution, the populations compared were separated by only 150 km in northern Scandinavia. On the other hand, T. Armijo & D. Sias (unpublished work, 1999) observed no change in FA across the range of Cnemidophorus inornatus (striped whiptail lizard). A recent study on a gradient of increasing dryness found that peripheral populations of the robin Erithacus rubecula did not show evidence of higher environmental stress as measured by FA and¯edging size (Pe Ârez-Tris et al. 2000) . In a study similar to ours, Ki¯awi et al. (2000) compared the DS of populations belonging to 30 mollusc species collected at one site in the Gulf of California. The populations were differentially located in relation to the centre of each species' geographical range. Overall, they found that the majority of low-abundance peripheral populations exhibited relatively high levels of DS. The results of the last three studies are consistent with ours and suggest that habitats towards the range margins are suitable and that abundance may not re¯ect the quality of sites across species' ranges. Nonetheless, further empirical research using a variety of ®tness measurements is needed to determine any generalities in the variation of environmental suitability across the geographical distributions of species."}, {"section_title": "A C K N O W L E D G E M E N T S", "text": "We thank all the museums that kindly provided us with specimens. Bob Dickerman facilitated the storage of specimens at the Museum of South-western Biology. Beth Dennis created the illustrations of the tail-feathers. D.W.M. was funded by a National Science Foundation Dissertation Improvement Grant. Most of the work on this paper was completed while the authors were graduate students at the University of New Mexico. This paper would not have been possible without the major contribution of D.A. Gray."}]