[{"section_title": "", "text": "By the year 2030 in the United States, over 20% of the population will be over the age of 65 years 1 (Figure 1), up from 15% of the population today 2 . The fastest growing demographic are the 'oldest old', individuals aged over 85 years. Much of the demographic shift is due to the emergence of baby boomers, adults born mid-1946 to mid-1964, into older adulthood (aged ≥65 years). Improvements in medical care, chronic disease management and infection control over the past century has also led to increases in life expectancy 3,4 . Based on recent census data, life expectancy at age 65 is now 82.8 years in males and 85.3 years in females 5 . The demographic changes observed during the aging process leads to a trajectory of disability 6 , independent of other influencing comorbidities. For instance, individuals surviving into old age are at risk of functional impairments -inability to transfer, walk, dress, eat, toilet, and bathe 7 -which subsequently lead a loss of independence, impairment Many epidemiological and intervention-based studies have used BMI as a surrogate for adiposity. Standard BMI categories are used ubiquitously in clinical practice and are based on the World Health Organization cut-points of underweight (BMI<18.5kg/m 2 ), normal weight (18.5-24.9), overweight (25-29.9), and obese (30+). BMI is easy to use, cheap and can be measured using a simple stadiometer and a weight scale; however, BMI is a poor measure of adiposity in older adults. First, individuals lose height as they age. The Baltimore Longitudinal Study of Aging noted that both males and females lost height with age 21 which impacts the BMI's denominator, possibly leading to an overestimation of its overall value in this population. Second, while BMI is clearly valuable as a population-level measure, it has poor diagnostic accuracy for identifying older adults with obesity 22,2324 . Using data from the 1999-2004 National Health and Nutrition Examination Survey, the sensitivity of BMI in accurately identifying adiposity was 32.9% in males and 38.5% in females. Third, as previously described, older adults tend to gain weight in central regions of their body. BMI fails to distinguish between peripheral and visceral obesity, an important consideration in individuals who are classified as having normal weight central obesity 25 . Based solely on BMI, this category of individuals would often not be a target for obesity therapy because they fall within the normal range (BMI of 18.5-24.9kg/m 2 ). Individuals with central obesity presenting with a normal BMI may also be at risk for adverse cardiometabolic dysfunction including dyslipidemia, coronary disease, hypertension, and early mortality [26][27][28] . One large scale epidemiological study using 15,184 adults aged 18-90 years with normal BMI and central adiposity based on waist-to-hip ratio 29 found that individuals with normal weight central obesity had a higher risk of total and cardiovascular mortality (HR of 1.87 [1.53,2.29] in males and 1.48 [1.35,1.62] in females). These relationships have been observed in older adults as well, whereby women have higher short-term cardiovascular mortality than males, and males have higher long-term cardiovascular mortality than females 27 . Irrespective of sex, individuals with normal weight central obesity (waist-hip ratio or waist circumference) are at higher risk of long-term disability 28 . Identifying and evaluating individuals in clinical practice who otherwise may not be identified as high risk is needed. Such misclassification can be problematic from a population-based management standpoint. Lastly, BMI accounts for both fat-free (muscle) and fat mass, the former of which declines during the aging process. This can further lead to misclassification and potential underestimation of adiposity and risk. Unfortunately, gold-standard methods for identifying adiposity with accuracy, including magnetic resonance imaging and computer tomography, are non-covered indications in clinical practice unless performed for other reasons. Dual-energy absorptiometry is more routinely available, but assessment of body composition is not covered by Medicare. Bioelectrical impedance can be a crude measure for body composition assessment in older adults and portable devices are available; however, the alterations in fluid balance in older adults 30 , along with a higher incidence of prosthetic implants 31 and implantable cardiovascular devices 32 makes this modality less favorable. As such, BMI combined with a marker of central adiposity may provide a cost-effective approach to improved diagnostic accuracy within a clinical practice. Established BMI cut-points correspond to adverse disease processes, including mortality 33 . Multiple population-based cohort studies have examined the relationship between obesity and premature death. In one study, obesity led to an estimated 111,909 excess deaths 34 . While obesity in mid-life is associated with reduced life-expectancy, the duration of obesity has a considerable effect on long-term mortality 35 , disability 36 and nursing home placement 37 as evidenced in numerous epidemiological studies. The relationship between BMI and mortality in populations has been shown to be representative of a \"U\" shaped curve 34 ; individuals classified as underweight and obese are at the extremes with higher risks of mortality. With age, the curve flattens and shifts to the right, indicating that standard BMI cut-points differ in older adults than in younger populations. A meta-analysis that evaluated 32 studies between 1990-2013 (including 197,940 adults aged 65 and over) also demonstrated a \"U\" shaped curve 38 . Yet, the lowest risk of mortality was observed in those with a BMI of ~27.5kg/m 2 . In fact, the risk of death only increases at a BMI>33.0 (HR 1.08 [95%CI: 1.00,1.15]). In select older adult populations, not all participants with elevated BMIs should be considered at high risk. An 'obesity paradox' exists whereby elevated body weight may be protective, mitigating death in select populations. For instance, a nursing home systematic review evaluated 19,538 subjects with a BMI≥30kg/m 2 and found that the risk of death was significantly lower than for the referent (normal BMI) group (HR 0.69 [95% CI: 0.60,0.79];p<0.001) 39 . A number of factors are thought to explain this: first, issues related to the inability of BMI to discern between visceral and subcutaneous fat; second, cardiovascular fitness likely moderates the relationship between obesity and death. Individuals with high levels of cardiovascular fitness irrespective of their obesity classification portend to better outcomes 40 ; third, excess adiposity in high risk populations at risk for frailty, itself a predictor of death, may be protective. Populations such as hemodialysis patients, congestive heart failure, or nursing home residents all tend to lose weight (consisting of both fat and muscle) with aging which promotes wasting, cachexia and mortality 41 . Fourth, there may be self-selection-individuals with excess adiposity who have survived to old age may have a survival advantage as compared to those who have died earlier in life. As such, practitioners should be made aware of these considerations in select populations, particularly when using BMI as a measure for adiposity in older adults with these specific co-morbidities."}, {"section_title": "Impact of Obesity on Physical Function/Disability", "text": "Overweight and obesity predisposes to disability and decreased physical functioning. Using the Health, Aging and Body Composition data, adults classified as overweight or with obesity using BMI at ages 25, 50 and 70-79 years had a HR 2.38 of incident disability over a 7 year period 35 . Similar relationships have been observed using either waist circumference or body fat percent, both in males and females. A systematic review by Schaap et al 42 demonstrated that adults with a BMI≥30kg/m 2 aged 65years and older had a 60% higher risk of incident disability (95%CI:1.43,1.80). A \"U\" shaped relationship is also observed between BMI and nursing home admission from community-dwelling adults 43 . Longitudinally, there appears to be a relationship. As the obesity epidemic has emerged in the past few decades, recent evidence suggests that its relationship with disability continues to be problematic, yet may be leveling off 44 . A recent study evaluated three consecutive time periods using National Health and Nutrition Examination Surveys (1988-1994, 1999-2004, and 2005-2012) and evaluated the association between obesity and disability. The population attributable fraction for obesity having a functional impairment and severe ADL impairment was 23.2% (95%CI: 20.5,25.7) and 24.6% (95%CI: 12.3,35.2), respectively, in individuals aged 60 years and older. Individuals classified as having obesity were still at much higher risk of limitations, yet limited wave-to-wave variability was observed. Other measures of adiposity, including body fat percent and waist circumference have also been associated with impaired physical function and disability and parallel these estimates. A study evaluating the cross-sectional association between obesity using body fat and disability demonstrated a significant odds of disability 45,46 . While there are challenges in the diagnostic accuracy of obesity, irrespective of the body composition or anthropometric measure used, in community dwelling adults, obesity is associated with a poorer prognosis of physical function. Obesity is also associated with increased risk of falling in older adults. Over one-third of adults aged 65 years and older fall each year 47 , making it necessary to screen for fall risk in the primary care setting 48,49 . Two studies using Health and Retirement Study 1998-2006 50 52 . Evaluating individuals who are at risk can prevent falls that may otherwise lead to restriction of social function, fractures and death 48,50 ."}, {"section_title": "Sarcopenic Obesity -a subset of high-risk individuals", "text": "Sarcopenia in individuals with obesity is a subgroup that deserves specific attention. Sarcopenia is derived from the Greek word, \"sarcos\" meaning flesh and \"penia\" meaning lack of. Infiltration of fat occurs within muscle tissue that can lead to impairments in muscle physiological parameters 53,54 . The definition of sarcopenia and obesity (sarcopenic obesity) continues to be fraught with methodological challenges 55 and discrepancies in defining sarcopenia (muscle mass vs. muscle strength) and obesity (body fat vs waist circumference vs BMI). Nonetheless, such individuals are at considerably higher risk than those with either of the two conditions independently. While the medical definition has evolved over the past three decades 55 , based on the 2014 Foundations for the National Institutes of Health Conference 20 , sarcopenia is simply the loss of muscle mass and function with aging. Specific cut-points have been developed for use. While several earlier studies focused on loss of muscle mass as the key determinant of sarcopenia 56 , emerging evidence suggests that muscle strength may be a more powerful determinant of incident disability 57 . The development of sarcopenia in old age is a natural phenomenon that can be partially mitigated with lifestyle interventions altering the threshold at which disability ensues 16,58 . Short-and long-term changes of both muscle mass and strength occur. Yet, changes in strength may occur without corresponding changes in muscle mass as observed in an earlier study using Health, Aging, Body Composition data 59 . Earlier work using the New Mexico Aging study demonstrated that individuals with sarcopenic obesity had a HR 2.63 [95%CI: 1.19-5.85] of developing an impairment of their instrumental activities of daily living over the course of a 8 year period 60 . This study defined sarcopenic obesity using appendicular skeletal muscle mass and body fat cutpoints 61 . Data from the InChianti study demonstrated that individuals with low muscle strength and obesity (based on knee extensor strength and BMI) had lower walking speeds than their counterparts over a 6-year period of time 62 . Much of our own work has revolved around using dual x-ray absorptiometry-defined muscle mass with the FNIH cutpoints with body-fat defined obesity (men>25%, females>35%), suggesting a significant relationship with limitations 63 and mortality 64 . Mortality is less clear as demonstrated using NHANES III data 65 (using BIA-defined muscle mass) and NHANES 1999-2004 data (using dual x-ray absorptiometry-defined muscle mass) 64 . Impaired muscle strength in conjunction with obesity, irrespective of its definition, is associated in crosssectional and longitudinal studies with adverse and negative outcomes, more so than muscle mass 42 . Thus, the importance of identifying patients with both sarcopenia and obesity is of paramount importance."}, {"section_title": "Evidence for Weight Loss in Older Adults?", "text": "Previous epidemiologic studies have provided conflicting findings on outcomes following weight loss in older adults; however, these studies failed to differentiate between intentional vs. unintentional weight loss and do not account for important confounding variables and reverse causality 66,67 . A joint consensus statement, published in 2005 by members of The Obesity Society, American Society of Nutrition and The National Association for the Study of Obesity, provided some evidence on managing this disease in older adults, 68 and several randomized controlled trials have since been published demonstrating the benefits and the harms of weight loss in older adults 69 . (Note that we define 'weight loss' as intentional in the section below.) A healthy lifestyle has been shown to compress the number of years of disability, according to data from the Cardiovascular Health Study 1989-2015 70 . Monitoring multiple lifestyle factors, including physical activity, diet, and BMI, 5,248 community adults aged 65 years and older who were not wheelchair dependent were identified. Activities of Daily Living were assessed and the ratio of the number of years living without any disability to the total number of years lived was ascertained to indicate compression or expansion of the disabling period. Obesity was associated with a decrease of 7.3% (95%CI: 5.4-9.2) as compared to normal weight individuals. The lowest quintile of the Alternative Healthy Eating Index was associated with a 3.7% (95% CI: 1.6-5.9) lower score than the highest quintile. Yet, engaging in physical activity demonstrated that for every 25 blocks walked in a week, 0.5% (95% CI: 0.3-0.8) higher proportion of years was gained disability-free. The article concluded that healthy lifestyles can compress the duration of disability in a person's remaining lifetime. A recent qualitative systematic review evaluated six randomized controlled trials from 2005-2015 in adults aged 60 and older (mean age >65 years) 69 . Obesity was defined as BMI≥30kg/m 2 or waist circumference ≥88cm/102cm in females/males respectively. Of 5,741 citations, 19 trials were identified, of which 6 were unique cohorts. Results suggested that a dietary weight reduction program combined with a physical activity program (aerobic and resistance) improved physical performance and quality of life and lowered the risk of reduced muscle mass, strength and bone loss. Weight loss ranged from 0.5 to 10.7kg. A recently published randomized trial with 141 participants, demonstrated that weight loss inclusive of both aerobic and resistance exercises led to improvements in the physical performance test, peak oxygen consumption, and muscle strength, despite only marginal reductions in lean muscle mass 71 . Additionally, there was no difference in exercise-related adverse events. In a separate review, weight loss in older adults with obesity was associated with reduced risk of death 72 . The authors identified 15 randomized controlled trials including 17,186 participants with a mean age of 52 years at randomization. The mean BMI was 30-46 kg/m 2 with an average follow-up period of 27 months (ranging from 18 months to 12.6 years). The weight loss group experienced a 15% lower all-cause mortality risk (relative risk 0.85 [95% CI:0.73,1.00]). While further evidence is needed to ascertain the impact on long-term mortality, weight loss appears safe and effective in older adults with obesity."}, {"section_title": "Cautions of Losing Weight in Older Adults", "text": "There are important risks that often get overlooked in this population by practitioners. Loss of weight leads not only to loss of fat mass, but also to loss of muscle mass, thereby promoting sarcopenia and its ensuing adverse outcomes 73 . The general principle that each pound lost equates to 75% fat and 25% muscle has been debated but is generally accepted 74 . Moreover, loss of weight impacts bone metabolism and turnover promoting osteoporosis [75][76][77] . Although sarcopenia is a natural phenomenon of the aging process, its acceleration with weight loss efforts is of considerable concern. Diet or diet and exercise-induced weight loss induces hormonal changes that negatively impact muscle mass and strength and is exacerbated by moderate caloric restriction. A review of 33 interventions demonstrated significant decreases from baseline in knee extensor strength (−7.5%) and handgrip strength (−4.6%) following diet-induced weight loss with moderate energy restriction 76 . Failure to engage patients in isokinetic resistance exercises will lead to likely loss of muscle mass and strength and reduce the impact of the gains in function individuals may otherwise attain with weight loss 78 . A number of randomized controlled trials have demonstrated that caloric restriction alone leads to loss of bone mineral density (BMD). Villareal's group demonstrated that a loss of hip BMD was attenuated, in part, when resistance exercise was coupled with a weight loss program, preventing an increase in bone turnover 58,71 . In another study, a meta-analysis of 32 randomized controlled trials, weight loss had no significant effect on total BMD 75 . However, the pooled study data suggested that hip and lumbar spine BMD were significantly lower after 4 months, particularly in adults who were classified as having obesity. Lumbar spine BMD was also lower after calorie restriction in interventions longer than 13 months. While these results were in adults age 50 years and older, their sensitivity analysis stratified by age revealed that hip BMD loss was highest in adults age 65 and older. This finding has considerable implications for the older adult who is at risk of falling. Approximately 30% of falls among older adults result in injury, 10% of which are fractures 79 . Hip fractures are especially devastating in this population and portend considerable morbidity and mortality 80 . Generally, obesity in the older adult population is safe and effective and can lead to considerable improvements in cardiometabolic risk and physical function. While there are important known risks associated with weight-loss in this population, they likely can be mitigated with appropriate health promotion interventions. As with all patients in a geriatrics practice, practitioners need to manage the benefits vs. the risks of any interventions, and in select individuals, weight loss should be encouraged."}, {"section_title": "Obesity in the Primary Care Setting", "text": "Obesity prevention efforts should be based in primary care settings, where front-line clinicians have longitudinal relationships to provide brief, motivational interviewing to engage patients in behavioral change. Intensive behavioral counseling can induce clinically meaningful weight loss of between 0.3-6.6kg, but little research is available on primary care practitioners providing this care. A systematic review suggested that different interventionists can deliver counseling, both in person or by telephone in this setting 81 . An additional review suggested that a multidisciplinary team approach consisting of collaborative care was much more effective 82 . This review conflicts with a recent two-arm randomized trial of 2,728 patients that demonstrated that a behaviorally informed, very brief (30 second) physician-delivered opportunistic intervention was acceptable and effective to reduce population mean weight (1.43kg [95% CI: 0.89,1.97]) 83 . In 2011, in the United States, the Centers for Medicare and Medicaid Services began reimbursing obesity counseling (current procedural terminology code G0447) for clinicians in a primary care setting to provide 22 targeted,15-minute intensive behavioral therapy counseling in a continuous 12-month period 84 . The goal was to achieve a mean weight loss of 3kg in beneficiaries whose BMI was ≥30kg/m 2 . Practice management barriers 85 exist in implementing this benefits, although novel technologies 86 may be helpful in addressing these issues. In 2012, the first full year of data, 27,338 (0.1%) of Medicare beneficiaries over age 65 availed of the benefit 87 . This increased slightly in 2013 to 46,821 (0.17%). The estimated proportion of persons with obesity using the benefit increased from 0.35% to 0.60%, with a mean of 1.99 and 2.16 claims/user. This data suggests its low uptake may not only be due to poor implementation patterns, but other support staff such as health coaches and dieticians should be integrating in delivering this important service. Novel delivery modalities to engage patients may be a strong consideration moving forward that include transition to value-based care models or increased reimbursements."}, {"section_title": "Medical Evaluation Specific to Older Adults with Obesity", "text": "The nutritional needs and caloric intake for healthy older adults is known to decrease with age in both sexes. The caloric difference between early adulthood and older adulthood ranges between 300-500 kCal/day. Much of this is due to age-related phenomena related to basal metabolic rate which drops considerably with age 88 . The following section will discuss specific concerns that a primary care provider should consider using a 'geriatric specific' approach, as compared to a middle aged adult with obesity 89 . Communication in clinical settings with older adults requires careful communication strategies that are often overlooked by clinicians. Behavioral techniques must be adapted to accommodate not only the sensory deficits the older adult faces such as hearing and vision, but need to be adapted to changes in cognition and executive function 90 , and their preference for shared-decision making 91 . Others have noted of a 'gap' between intentions and behavioral change 92 , which itself can be predicted by measures of executive function 93 . An inability to implement intentions will lead to poor execution of the desired change 94 . Older adults may also be better focused on single health behavior change interventions as compared to multiple 95 , focusing on a specific content. These approaches are less confusing and can be understood much more adequately. On the contrary, though, complex conditions in older adults require multiple strategies to deliver health promotion efforts which can be challenging to the clinician. Engaging individuals in strategies to improve self-efficacy through social support and change can be helpful to provide information to set goals, engage in change, and to promote self-monitoring 96 . Researchers continue to caution clinicians in applying behavioral change principles to older adults as they may require adaptation from a younger population. While primary care providers care for older adults, the lack of specific geriatric training can be problematic in delivering behavioral change interventions. First, motivational interviewing, a core tenant in eliciting change and in the Medicare Obesity Benefit is heavily influenced by the contextual aspects of delivery and by the clinician 97 -internists may approach elements differently than geriatricians. Second, geropsychological principles are often not integrated in routine interventions 98 . This includes social participation which is strongly related to better health and can lead to forming new goals in one's life 99 . This allows for a reframing of the discussion to engaging in change. Third, goals in seniors are different, in part due to multimorbidity 100 , but also due to the changing perceptions on aging and health [101][102][103][104] . Fourth, aging individuals have limited lifespans and, hence, patients focus more on the present day than the future. These elements lead to significant challenges in a busy primary care setting. A thorough medical evaluation is needed in older patients that wish to improve their health and physical function through weight loss. The primary care clinician (or obesity medicine specialist) should identify whether there are any recent changes in health status (medical or economic). Recent hospitalizations and changes in functional status (e.g. joint replacement leading to physical inactivity) that may lead to weight gain 105 . Other standard questioning on weight history, previous strategies and alcohol use parallel methods used in the general population. Notably, we highlight two main concerns specific to older adults including medications and social support. The number of medications prescribed increases with age and with the number of chronic conditions. Polypharmacy is a significant risk in older adults as it is associated with increased risk of cognitive impairment, urinary incontinence, falls and declines in physical function 106 . The American Geriatric Society has developed the Beers Criteria 107 , which clearly identifies potentially inappropriate medications in older adults and assists healthcare providers in improving medication safety for this population. Its purpose is to inform clinical-decision-making concerning the prescribing of medications for older adults in order to improve safety and quality of care. There are a number of medications that are considered 'obesogenic' that should be re-evaluated as part of the evaluation. As older adults have a higher incidence of diabetes 108 , depression 109 , pain 110 and hypertension 111 , medications treating these chronic diseases may increase the risk of a person gaining weight. Additionally, a number of these medications are listed on the Beer's criteria. The primary care practitioner, in concert with a clinical pharmacist on the multidisciplinary team can assist in streamlining not only the number of medications, but also the class of medications that promote weight gain. Table 1 briefly highlights some of the commons medications that predispose to weight gain. Socioeconomic and ethnic disparities are two specific social determinants of health that increasingly are being recognized as important predictors in obesity management and adverse health. An elder on a fixed income (often a social security income) and must make choices between their food consumption and other care needs. Food insecurity is defined as the limited or uncertain availability of nutritional adequate and safe foods, or the limited or uncertain ability to acquire acceptable foods in socially acceptable ways 112 . Food insecure older adults individuals have poorer dietary intake, nutritional status and health status than food secure older adults 113 . Simple questions that should be asked include: • Where is your food coming from?"}, {"section_title": "•", "text": "Who purchases your food? • Do you have to pay for your medical bills and scrimp on food? Such questions are helpful in that it leads to information on affordability of food. A true multidisciplinary team led by the physician that embodies a dietician, social worker and care manager can be helpful in intervening in this population. A dietician is of utmost importance in that they are able to perform, not only the usual functions of evaluation and counseling, but can assist this population in engage in substituting choices that they can afford. Most established trials have evaluated calorie-restricted diets ranging from 500-750 kCal/day under the guidance of a registered dietician 69 . In older adults, there is ample evidence that diets such as the Dietary Approaches to Stop Hypertension 114 or the Mediterranean diet 115 have demonstrated improvements in metabolic parameters, weight loss, long-term disability, mortality and cognition. Very low energy or protein sparing diets should be avoided in older adults due to risks of dramatic fluid and electrolyte shifts and proportionally can lead to augmented muscle mass loss. Villareal, in his studies, proposed a loss of ~10% of baseline weight at six months 58,71 . Supplemental vitamin D of ~800-1000units and 1200mg of calcium should be considered. The latter can be from dietary or supplement sources, although we emphasize the consumption from dietary calcium if at all possible considering the recent controversies. Protein intake should also be augmented in older adults. Recommended dietary allowance is 1.0g/kg/day, yet since older adults produce less protein than younger persons, this should be revised to 1.0-1.2g/kg/day 116 . Also, a larger amount of protein is required to produce an equal response 116 . Notably, a recent Cochrane review demonstrated that protein supplements did not lead to improved outcomes 117 . Early pilot studies during weight loss interventions suggest improved short performance physical battery measures. The MeasureUP 118 in 67 subjects demonstrated, at 6-months, a −8.7±7.4kg and −7.5±6.2kg weight loss in the protein and control groups, respectively. The authors observed improvements in physical function based on the short physical performance battery of +2.4±1.7units and +0.9±1.7 units, respectively (p=0.02). Future studies should determine the amount of protein intake, the type of protein (meat vs. plant-based) and whether advised supplements for the treatment of sarcopenia (whey, leucine carnitine) can augment physical function and further mitigate sarcopenia. Primary care providers have little training in counseling on physical activity 119 . They can, however, provide targeted information on exercise prescriptions. Such prescriptions should be individually tailored based on the individual's functional status and capacity. The American College of Sports Medicine suggest at least 150 minutes of low to moderate intensity aerobic activity in all patients, including older adults 120 . Seniors who may not have sufficient cardiovascular fitness may subdivide this time period into smaller increments to not only build their endurance but assist in ongoing behavioral change. The practitioner and their team can encourage patients to slowly increase their capacity to do so. During weight loss efforts, resistance exercises are of paramount importance for the prevention of sarcopenia. All individuals should engage in flexibility, balance, and strengthening activities with resistance bands or weights that can be free or be attached to wrists or legs. In those with financial difficulties, we advise individuals to utilize common household items (i.e. soup cans or jugs of milk). The weekly goals are 2-3 days, with at least 48 hours rest between sessions. Each of these sessions should last between 30-40minutes, rotating muscle groups and exercises, with 10-12 repetitions for each sessions. Fatigue normally occurs between 8-12 repetitions and a bit of fatigue is advisable, but it is important to prevent injuries by starting low and going slow, starting with 1-2 pounds or with the lowest resistance color band. Physical therapists can assess a person's 1-repetition maximum and advise advancement. We advocate that current multidisciplinary physical activity programs should be based on the Life Study 121 , a multi-center randomized controlled study that demonstrated reduced disability over a mean 2.6 year follow-up in 818 patients. Compared to a self-instructed exercise program, participants in this structured program demonstrated a 28% reduction in incident major mobility disability (95% CI:0.57,0.91). These materials are freely available on <https://www.thelifestudy.org>. Additionally, the National Institute on Aging has a booklet of exercises that can be accessed and downloaded at <https:// www.nia.nih.gov/health/publication/exercise-physical-activity/introduction>, free of charge for clinicians and patients to engage at home. Clinicians can play a paramount role in the monitoring of their older patients undergoing weight loss. While there is no firm evidence pertaining to monitoring parameters, we recommend the following. First, consideration should be given to assess baseline bone density during such efforts. Medicare indications for women are quite broad (ie: postmenopausal) yet those for men may be slightly more challenging to find. The United States Preventive Services Task Force recommendations for osteoporosis screening in men do not provide a firm statement and conclude that the evidence is insufficient to assess the balance of benefits and harms of screening 122 . Some potential indications in men include: x-ray evidence of possible osteopenia, osteoporosis or vertebral fractures; a person taking steroids; hyperparathyroidism; monitoring if osteoporosis drug therapy is working. Some examples of biomarkers of bone turnover that can be considered in the evaluative process, including osteocalcin, type I procollagen, urine collagen type-1 cross-linked N-telopeptide. These may help direct the impact of weight loss on bone turnover. Baseline and longitudinal monitoring of grip strength is an office procedure that can be easily integrated in any busy practice. The recent approval of an ICD-10 code for sarcopenia may allow for further screening and routine integration in practice. Last, monitoring of vitamin D levels may be helpful. Different societies have different views on monitoring of levels 49 . Our practice is to assess baseline Vitamin D levels during routine weight loss management. As with any intervention in older adults, risks vs. benefits of monitoring is needed, and further studies should best inform the appropriate indices clinicians should considering during such efforts."}, {"section_title": "Pharmacotherapy", "text": "With the emergence of newer medications effective in weight management, older adults are increasingly asking about the possibility of taking such medications. The AACE/ACE guidelines explicitly state that there is insufficient evidence to recommend weight-loss medications in older adults 123 . As is the case with most pharmaceutical-based clinical trials, to prove efficacy, older adults were excluded from most trials, biasing outcomes towards younger patients. Unfortunately, we caution extrapolating such results to older adults whose pharmacokinetics and pharmacodynamics properties differ from those in younger, robust populations who often have fewer comorbid conditions and are on fewer medications. Of the obesity medications available, two trials (phentermine/topiramate and liraglutide) have documented efficacy analyses between older adults and younger counterparts. These trials enrolled 7% (n=254) and 6.9% (n=232) older adults, respectively, of their study subjects [123][124][125][126][127][128] . There were no observed differences in efficacy, safety and pharmacokinetics between subgroups. The other commercial medications had insufficient study sample to make any statistical comparisons. Preliminary data suggest that pharmacokinetic data on phentermine/topiramate, liraglutide, lorcaserin or naltrexone/bupropion were no different between younger/older. The propensity to add to an older adult's polypharmacy should not be overstated as this leads to medication errors and subsequent adverse drug events, increased risk for falls, delirium and costs. Table 2 highlights some of the absolute contraindications to these medications and some of the common side effects and major risks that older adults may face, irrespective of the lack of evidence. Given the need for obesity treatments and the limited data currently available, further research in older adult populations is important."}, {"section_title": "Bariatric Surgery", "text": "An effective treatment approved by the NIH in 1991 is bariatric surgery 129 . This procedure has gained considerable popularity and is increasingly being performed in persons with obesity who are at high risk of medical complications and/or have co-morbidities. In the general population, there is considerable epidemiologic and trial data demonstrating its safety, efficacy, and effectiveness [130][131][132][133][134][135] . The extent of the safety and efficacy in older adults continues to be debated in the surgical literature. Many studies have used varying cut-points for older adults (ranging from 50-65 years), and are fraught with considerable methodological problems, including reduced study power, study time period bias, and inconsistent definitions. Additionally, the evolving surgical and medical care of this patient population, and the establishment of high volume Bariatric Surgery Centers of Excellence have led to considerably improved outcomes 136,137 . A number of systematic reviews have been published discussing the short-and long-term outcomes of bariatric surgery in an older adult population 138 , and are outside the scope of this particular review. European guidelines 139 have noted that the procedure should be considered in carefully selected patients. We previously developed an approach in older adults that highlights physiologic as opposed to chronologic age 140 . A laparoscopic approach is favored as compared to an open approach. By applying the principles of a comprehensive geriatric assessment on patients evaluated for surgery, the hope is that those carefully selected individuals will have improved short-and long-term outcomes. Highlighting the importance of future life expectancy, presence of undiagnosed cognitive impairment, medical comorbidity that could be impacted by the surgical procedure, and important social support mechanisms for the immediate post-operative care are of utmost importance. Previous history of post-operative delirium and impairments in vision and hearing are also important factors in successful recovery. Understanding such limitations could sway a decision to consider surgical intervention or not in a given patient. Being classified as 'geriatric' should not preclude evaluation of surgery in those motivated older adults who fulfill many of the above noted elements in the geriatric evaluation."}, {"section_title": "Conclusions", "text": "The epidemic of geriatric obesity will continue to impact the role of a primary care provider with time. The importance of lifespan prevention measures cannot be overstated to delay the onset of disability and impairments in health-related quality of life. Effective lifestyle modifications for weight loss can easily be implemented within a busy primary care setting to engage individuals. Community-based physical activity interventions are easy, costeffective ways to delay disability and enhance physical function. Future studies should focus on disseminating and implementing practical ways to integrate established evidence-based practices into routine clinical care, without overburdening clinical staff. The use of emerging technologies may be helpful adjuncts. Evaluation of pharmacotherapy in this high-risk population remains a priority and including older, robust adults may be a reasonable first step in evaluating their safety and efficacy. We recommend that bariatric surgery be considered for older adults following a comprehensive geriatric assessment and interdisciplinary team-based approach is helping in evaluating and engaging these patients in this process.   "}]