[{"section_title": "Introduction", "text": "In December 2019, a new coronavirus called severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) caused an epidemic in Wuhan, a central city in central China. This novel coronavirus has never been reported before and was found to have the ability to infect humans for the first time after nearly one month of spread. Subsequently, it spread rapidly throughout China and caused outbreaks in many other countries, such as Japan, South Korea, Italy and the United States . On January 31, 2020, the World Health Organization (WHO) declared that SARS-CoV-2 caused coronavirus disease 2019 , a public health emergency of international concern, and then designated it a pandemic on March 11, 2020. According to the latest data as of April 9, 2020 from the WHO, there are 89,931 deaths and 1,503,900 confirmed cases worldwide, with the mortality reaching approximately 5.980%, and the epidemic has followed a rapid growth model. A series of initiatives and statistical data hinted at the unusually strong destructive effect of SARS-CoV-2, which should merit adequate attention and active prevention from all over the worldwide. Although we are confident that a resolution will eventually come, no specific vaccines or ideal drugs for SARS-CoV-2 have been formally utilized clinically at present, so it is critical to understand the exact pathogenic mechanism and develop effective drugs and vaccines to respond to SARS-CoV-2 outbreaks (Cabrini et al., 2020) . Several studies demonstrated angiotensin converting enzyme 2 (ACE2) as an important therapeutic target of SARS-CoV-2 entry and infection, and many potential targets were subsequently proposed, such as the spike (S) protein and transmembrane serine protease 2 (TMPRSS2). Additionally, multiple potential drugs have been suggested and verification work for virus treatment is underway. Excitingly, several vaccines that have proven safety, efficacy and quality were also proven in early clinical trials. However, information on these works is distributed and diverse, which makes it difficult to form a comprehensive understanding for reference. Therefore, in this review, we comprehensively summarize the potential therapeutic targets involved in the processes of virus transmission, infection and pathogenesis, based on recent studies.\nAdditionally, we discuss in depth the advancements, possibilities and significance of promising drugs based on these targets in the treatment of SARS-CoV-2. This review will This article is protected by copyright. All rights reserved.\nfacilitate the identification of potential targets and provide promising clues for promising drug discovery and development that can be translated into clinical applications for combating SARS-CoV-2."}, {"section_title": "Epidemiological and clinical characteristics of SARS-CoV-2", "text": "Coronaviruses (CoVs) are nonsegmented, positive sense, single-stranded RNA viruses that belong to the subspecies Coronaviridae. The length of CoV genomes ranges from 26 to 32 kilobases, which makes it the largest viral RNA known (Livingston et al., 2020a) . Currently, six kinds of CoVs are known to cause human diseases, which can be classified into two groups: slightly pathogenic and highly pathogenic CoVs. Among the highly pathogenic CoVs, both severe acute respiratory syndrome coronavirus (SARS-CoV, 2002, southern China) and\nMiddle East respiratory syndrome coronavirus (MERS-CoV, 2012, Saudi Arabia) , which mainly infect the lower airways and cause serious fatal pneumonia, are known and can affect humans (Cui et al., 2019) . The third known highly pathogenic CoV has been identified as the pathogen causing outbreaks of SARS-like clinical symptoms in Wuhan city of China and was officially designated SARS-CoV-2 by the WHO.\nSARS-CoV-2 belongs to lineage B of the β-CoVs, a subgroup of Sarbecovirus, which contains a positive-sense single-stranded RNA as the hereditary substance and is wrapped by nucleocapsid protein in the core region and a peripheral envelope consisting of the Spike protein, Envelope protein, and Membrane protein ( Figure 1A ) (Chan et al., 2020) . After conducting in-depth research, researchers found that the genomic organization of SARS-CoV-2 was consistent with a single-stranded positive-sense RNA, which contains 5'-methylated caps and 3'-polyadenylated tails and is arranged in the following order: 5' end; replicase ORF1a/b; Spike (S); Envelope (E); Membrane (M); Nucleoprotein (N); accessory proteins such as ORF 3, 6, 7a, 7b, 8 and 9b; and the 3´ end ( Figure 1B) . Phylogenetic analysis studies found that SARS-CoV-2 has the closest relationship with bat-derived SARS-CoV but is not completely identical to SARS-CoV (approximately 79% identity) or MERS-CoV (approaching 50% identity) (Paraskevis et al., 2020) .\nTo date, studies have shown that the transmission of SARS-CoV-2 is spread mainly between people by means of the respiratory system and droplets (Phan et al., 2020) . At present, several studies have put forward that SARS-CoV-2 can be transmitted not only by droplets but also This article is protected by copyright. All rights reserved.\npotentially via the oral faecal route (Huang et al., 2020a) , but the latter requires formal proof."}, {"section_title": "Long-term observation and statistical analysis demonstrated that the incubation time is", "text": "approximately 2 to 14 days after infection, with a median period of 4 days (interquartile range, 2 to 7 days) (Livingston et al., 2020b) . The lungs and immune organs are the two main targets attacked by SARS-CoV-2. In addition, the virus also attacks other organs, such as the heart, kidney, oesophagus and multiple specific cell types (including alveolar cells, myocardial cells, renal proximal tubule cells, oesophageal epithelial cells, etc.), and the most likely reason is related to infections and ACE2 distribution Zou et al., 2020) .\nEpidemiological surveys have found that the clinical features of SARS-CoV-2 infection are similar to those of SARS-CoV and are characterized by fever (>37.3℃), dry cough, dyspnoea or shortness of breath in most patients, whereas nonrespiratory clinical symptoms such as diarrhoea, sore throat, muscle ache, headache, and vomiting have also been reported in a minority of patients (Meo et al., 2020) . Confirmed patients have also developed acute respiratory distress syndrome, while critical illness may present with respiratory and lung function failure, even multiple organ dysfunction and septic shock, which require extracorporeal membrane oxygenation (ECMO) and intensive care support . The major pathological characteristics of the lung include pulmonary alveolitis and bronchiolitis with epithelial cell proliferation, desquamation, squamous metaplasia and the production of mucus and oedema fluid. Meanwhile, massive diffuse pulmonary interstitial fibrosis accompanied by excessive inflammation, a certain amount of hyaline degeneration, and variable levels of pulmonary haemorrhagic infarction have been observed at the lesion site (Luo et al., 2020) . Moreover, several kinds of immune cells, including focal monocytes, lymphocytes, plasma cells and several multinucleate giant cells along with intracytoplasmic viral inclusion bodies, infiltrate into the pulmonary interstitium . In addition, immunohistochemistry results indicated positive results for immune cells, and pathological staining also showed extensive pulmonary interstitial fibrosis. Eventually, these abnormal pathological changes result in lung function failure or multiple organ failure.\nAlthough there has been some progress in the investigation and research of SARS-CoV-2, knowledge about this virus is still insufficient (Chen et al., 2020a) . At present, the number of new confirmed cases and mortality are rapidly increasing daily under symptomatic treatment, This article is protected by copyright. All rights reserved.\nwhich requires research to confirm potential therapeutic targets and discover promising drugs as soon as possible, as the current priorities for the response to the SARS-CoV-2 outbreak."}, {"section_title": "Potential therapeutic targets and promising drugs for the treatment of SARS-CoV-2", "text": "We know that the outbreaks of SARS-CoV-2 will be controlled with ideal drugs or effective vaccines to eventually end the pandemic. However, what worries us most is that many existing traditional models of drug and vaccine development are inadequate for this outbreak; a long-term process (maybe a few months or years) cannot rescue those patients who are dying as well as the slumping economy in a timely manner. Vaccine/drug research and development should be given great attention because there is currently no ideal solution to clear SARS-CoV-2 infection, despite a pressing need to identify symptomatic strategies to ease suffering and preclude potential death (Morse et al., 2020a) . Therefore, accelerating research for potential therapeutic target confirmation, promising drug discovery, and clinical verification development will speed up efforts to combat SARS-CoV-2. Based on the current studies, we summarize the potential therapeutic targets involved in virus transmission, infection and pathogenesis processes. Additionally, we discuss the advancements, possibilities and significance of promising drugs based on these targets for combating SARS-CoV-2 (Figure 2 )."}, {"section_title": "Potential for targeting the spike protein and promising drugs", "text": "In the initial stage of infection, the spike (S) protein of SARS-CoV-2 first combines with a cell surface receptor (Wrapp et al., 2020) . The S protein consists of two subunits, the S1 (bulb) and S2 (stalk) subunits. S1 is responsible for receptor binding, while S2 is responsible for membrane fusion . More specifically, S1 combines with the cognate receptor to induce a strong conformational change in S2, thereby resulting in the fusion of the virus envelope and host cellular membrane and then releasing the nucleocapsid into the cytoplasm (Sekimukai et al., 2020) . In view of this mechanism, targeting the S protein is likely to cut off SARS-CoV-2 infection, which can be regarded as the primary factor that needs to be studied in depth. Based on past experience, SARS-CoV-2 S protein-neutralizing antibodies (nAbs) are most likely to become the preferred research and development strategy that should be modelled and considered by researchers and drug R&D institutions to provide passive immunization against the infection . According to the functional This article is protected by copyright. All rights reserved.\nanalysis of the S2 subunit, the interaction between heptad repeat 1 (HR1) and HR2 of S2 can form a six-helical bundle (6-HB), hence facilitating the fusion process of the viral and host cell membranes. Drawing on experience with SARS-CoV, Xia et al designed HR1-and HR2-derived peptides, designated SARS-CoV-2-HR1P (aa 924-965) and SARS-CoV-2-HR2P (aa 1168-1203), respectively . Since SARS-CoV-2 and SARS-CoV S-HR2 sequences are 100% identical, SARS-CoV-2-HR2P most likely acts as a membrane fusion inhibitor in a way similar to SARS-HR2P, the reported SARS-CoV fusion inhibitor . A fusion experiment of SARS-CoV-2-HR2P showed a potent fusion inhibitory effect with a half maximal inhibitory concentration (IC50) of 0.18 µM, while SARS-CoV-2-HR1P exhibited no obvious fusion inhibitory activity up to 40 µM, indicating that SARS-CoV-2-HR2P may be a promising therapeutic agent for SARS-CoV-2; however, the safety and actual effect await verification . Research did not end there, so in a subsequent experiment, a pancoronavirus fusion inhibitor denoted as EK1 was designed based on the properties of the HR1 region (Xia et al., 2019) . The results showed that EK1 also exhibited a potent fusion inhibitory effect with an IC50 of 0.19 µM, suggesting that EK1 is also a promising treatment as a SARS-CoV-2 drug pending verification and development.\nAccording to other research results, we know that SARS-CoV-2 enters the host cell by binding to membrane angiotensin-converting enzyme 2 (ACE2) via the S protein receptor-binding domain (RBD) . Based on this situation, Zhang et al synthesized a first-in-class peptide binder, named 23-mer peptide binder (SBP1), by using automated fast-flow peptide synthesis technology. After careful analysis, they found that SBP1 can potentially restrain the entry process of SARS-CoV-2 into human cells through binding to the SARS-CoV-2-RBD with extremely low affinity (KD value = 47 nM) . Moreover, the human protein-derived sequence of SBP1 prevented the binder from being immunogenic, which further promoted the peptide binder SBP1 as a promising preclinical drug lead for anti-SARS-CoV-2 drug discovery and development."}, {"section_title": "2 Potential ACE2 targets and promising drugs", "text": "Receptor binding is one of the major determinants of tissue tropism and host range for CoVs.\nA study showed that CoVs adopt cell surface enzymes as their binding receptors, such as the ACE2 receptor for SARS-CoV and the dipeptidyl peptidase 4 (DPP4) receptor for This article is protected by copyright. All rights reserved. (Fung et al., 2019) . Recently, a study found that SARS-CoV-2 can enter into the identical set of cell lines as SARS-CoV, suggesting that they have a similar receptor, ACE2."}, {"section_title": "MERS-CoV", "text": "The results of sequence analysis showed that some but not all SARS-CoV-2 clusters can use ACE2 for host cell entry . According to receptor-binding motif (RBM) analysis, the majority of amino acid residues indispensable to ACE2 binding were retained in the S protein of SARS-CoV-2, which was consistent a previous conclusion that the virus used ACE2 for host cell entry . In agreement with these findings, SARS-CoV-2 uses ACE2 for cellular entry, similar to SARS-CoV. Therefore, targeting ACE2 can prevent the replication of SARS-CoV-2, which can be regarded as a potential therapeutic strategy that needs to be studied in depth. A recent hypothesis proposed that ACE inhibitors (ACEIs), such as captopril and enalapril, or angiotensin receptor 1 (AT 1R) inhibitors, including losartan and valsartan, might be beneficial for those patients who experienced pneumonia induced by SARS-CoV-2 . However, unfortunately, this is just a plausible speculation without basic or clinical research verification. At present, researchers envision administering a kind of antibody that could bind to the host cell membrane ACE2 protein, thus preventing the entry and infection of SARS-CoV-2. This promising intervention strategy was shown to significantly block viral entry and replication in experiments, but additional tests are needed to identify any anti-SARS-CoV-2 infection effects (Li et al., 2003) . Alternatively, people could simply develop a single chain variable fragment (scFv) that binds to the ACE2 receptor to inhibit its complexation with SARS-CoV-2. In addition, VHH domains or nanobodies from camelids are two possible choices for consideration as well (Desmyter et al., 2013) . A potentially more promising strategy was proposed by a researcher, who claimed that an antibody-like molecule could be created that would bind to the virus itself rather than protecting host cells against infection. Based on this strategy, researchers proposed using clinical-grade soluble human ACE2 (hrsACE2) to bind the S protein of SARS-CoV-2, thereby neutralizing the virus. Research on SARS-CoV indicated that this strategy is quite promising. Thus, the hrsACE2 is feasible to inhibit SARS-CoV-2 infection of cells, including Vero-E6 cells, human capillary organoids and human kidney organoids, in a dose-dependent manner (Vanessa, 2020) . Since ACE2 is a valuable therapeutic target and hrsACE2 shows good therapeutic properties in vitro, it may be another good choice to fuse hrsACE2 to an This article is protected by copyright. All rights reserved.\nimmunoadhesin to form an immunoglobulin-Fc domain to prolong the availability of the circulating molecule and boost immune system functions to fight SARS-CoV-2 infection.\nThis research offers solid evidence that hrsACE2-immunoglobulin-Fc may similarly suppress SARS-CoV-2 both in vitro and potentially in patients (Kruse, 2020) . Overall, the aforementioned therapeutic strategies indicated that ACE2 must be a potential therapeutic target in the treatment of SARS-CoV-2. Meanwhile, an ACE2 antibody, ACE2-scFv, ACE2 nanobody and ACE2-Fc may be promising anti-SARS-CoV-2 drugs after animal testing and clinical trials."}, {"section_title": "3 Potential TMPRSS2 targets and promising drugs", "text": "In addition to the S protein and ACE2, another study suggested that proteases may help activate the S protein by priming it to promote SARS-CoV-2 cellular entry. The endosomal cysteine proteases cathepsin B and L (CatB/L) and the serine protease TMPRSS2 are two critical proteases contributing to the pathogenicity of coronavirus infections(Iwata-Yoshikawa et al., 2019). Research has found that SARS-CoV-2 can use TMPRSS2 rather than CatB/L for S protein priming, and the spread of SARS-CoV-2 might also be intimately associated with TMPRSS2 activity. In addition, an in vitro study found that the serine protease inhibitor camostat mesylate could significantly block the activity of TMPRSS2, which can efficiently prevent the virus from entering Caco-2 (TMPRSS2 + ) cells rather than 293T (TMPRSS2 -) cells (Hoffmann et al., 2020) . This result indicates that blocking TMPRSS2 should be considered a potential therapeutic target for the treatment of SARS-CoV-2-infected patients. More remarkably, camostat mesylate has already been approved for safety for the treatment of pancreatic inflammation disease in Japan, which reminds us that camostat mesylate should be given sufficient consideration as a promising therapeutic drug for combating SARS-CoV-2 without safety concerns (Gibo et al., 2005) .\nAccording to a new finding from the University of Tokyo, a comparable drug named nafamostat mesylate can prevent TMPRSS2-triggered SARS-CoV-2 membrane fusion at a concentration less than one-tenth that of camostat mesylate, which indicated that nafamostat mesylate may also be a promising inhibitor of SARS-CoV-2 infection by targeting TMPRSS2 (Inoue, 2020) . As the two drugs have been prescribed in Japan for many years and have adequate clinical data with regard to safety, we expect that they can enter clinical trials This article is protected by copyright. All rights reserved.\nfor treating SARS-CoV-2 as soon as possible. More importantly, the research process of the two TMPRSS2 inhibitors for treating SARS-CoV-2 reminds us that searching for therapeutics from marketed drugs that have been confirmed to be safe (drug repurposing) appears to be a good strategy and extremely worthwhile."}, {"section_title": "4 Potential CD147 targets and promising drugs", "text": "Previous studies have focused on ACE2 in host cells and its partner molecule TMPRSS2.\nAlthough progress has been made in determining the structures and binding domains and in drug screening, it is unclear whether there are other receptors on the host cell membrane for S protein binding, which reminds us of the challenges of identifying drug targets for SARS-CoV-2. Therefore, as a result of in-depth study, another receptor was discovered recently to be involved in SARS-CoV-2 infection. CD147, usually referred to as extracellular matrix metalloproteinase inducer (EMMPRIN) or basic immunoglobulin (Basigin), is a kind of transmembrane glycoprotein belonging to the immunoglobulin family, which is closely associated with many disease processes, such as tumour progression, plasmodium invasion and virus infection (Lu et al., 2018; Nguyen et al., 2018; Zhang et al., 2018) . Previous studies showed that CD147 can promote the entry of SARS-CoV into host cells, while the CD147-antagonistic peptide (AP)-9 has high binding activity to effectively prevent SARS-CoV infection of HEK293 cells (Chen et al., 2005) (Chen et al., 2005; . Additionally, multiple studies showed the tissue distribution specificity of CD147 in tumour tissues, inflamed tissues and pathogen-infected cells, which indicates relatively low cross-reactivity with normal cells (Kosugi et al., 2015; Su et al., 2018) . Therefore, the route of viral entry involving CD147 suggests a novel potential target with promising druggability for specific anti-SARS-CoV-2 drug (such as metuximab, metuzumab and meplazumab, etc.) verification and exploration."}, {"section_title": "5 Potential viral replicase targets and promising drugs", "text": "In a review of past research, we found that coronavirus genomic RNA acts as the transcript to induce ORF1a translation in a cap-dependent manner to form the polyprotein ppan after entering and uncoiling in the host cell. Near the end of ORF1a, there are two important structures, i.e., a slippery sequence and an RNA pseudoknot, which were reported to be important for inducing 25-30% of ribosomes to undergo frame shifting, thereby promoting ORF1b translation to provide the longer polyproteins pp1a and pp1ab (Masters, 2006) . After autoproteolytic separation, the polyproteins pp1a and pp1ab produce several nonstructural proteins, i.e., the well-known nsps. Through the functional study of nsps, researchers found that nsp12 encodes RNA-dependent RNA polymerase (RdRP) (Xu et al., 2003) , while nsp5\nThis article is protected by copyright. All rights reserved. and nsp3 encode the main protease (Mpro) and papain-like protease (PLpro) (Ziebuhr et al., 2000) , respectively.\nDuring the replication process of RNA viruses, RdRP determines the fidelity and the rates of replication and mutation of the virus to condition its adaptation to the environment and even to a new host, thus influencing the evolution of the virus(Hukowska-Szematowicz, 2020).\nTargeting for SARS-CoV-2. Aurintricarboxylic acid (ATA), a known anionic polymer, is known to combine with several protein targets, such as gp120 and E-selectin, and to prevent the replication of SARS-CoV through binding to RdRP with an IC50 of 0.2 mg/mL (Cushman et al., 1991; He et al., 2004; Yap et al., 2005) , which indicates its potential for anti-SARS-CoV-2 drug development. Ribavirin (RBV), a broad-spectrum antiviral drug, has been studied in MERS-and SARS-infected patients to combat MERS/SARS-CoV, but its efficacy against SARS-CoV-2 is unclear. However, whether to choose RBV as a candidate drug is unclear, as some studies have shown a worsening of patient outcomes by RBV administration, indicating that RBV (at least itself) is not a good choice for anti-SARS-CoV-2 drug development (Stockman et al., 2006; Zhang et al., 2020) . Favipiravir is a new type of RdRP inhibitor. Research shows that favipiravir is activated through phosphoribosylation in cells to form favipiravir-RTP, which is considered a substrate for viral RNA polymerase, thereby binding with RdRP to inhibit its activity (Furuta et al., 2017) . A favipiravir clinical trial (ChiCTR2000029600) for treating SARS-CoV-2 infection achieved the expected results.\nIn the clinical trial, a total of 80 patients were divided into two groups, i.e., a control group and a favipiravir intervention group. The results showed that favipiravir has a better anti-SARS-CoV-2 effect than similar drugs (lopinavir/ritonavir). In addition, another This article is protected by copyright. All rights reserved.\nprospective, multicentre, open-label, randomized superiority trial (ChiCTR200030254) has come to the similar conclusion that favipiravir (1600 mg/time/bid on the first day; 600 mg/time/bid from the second day to the end of treatment) should be regarded as one of the most promising candidate drugs for combating SARS-CoV-2 due to its higher rate of 7-day clinical recovery and more effectively decreasing the incidence of clinical symptoms, such as fever and cough, than the currently recommended drug, arbidol . Moreover, no significant adverse reactions were observed, and relatively high patient compliance was noted in the favipiravir treatment group, indicating that favipiravir is a potential anti-SARS-CoV-2 drug that requires the greatest attention . Remdesivir is also a nucleotide analogue inhibitor of RdRP (Brown et al., 2019) . Recently, Wang et al.\nfound that remdesivir can effectively prevent the infection of SARS-CoV-2 at a very low concentration with a relatively high efficiency of selection (EC50 = 0.77 μM and a half-cytotoxic concentration (CC50)>100 μM (SI>129.87)), suggesting that remdesivir is very likely to be a potential drug against SARS-CoV-2 infection . Furthermore, a report that remdesivir achieved the expected treatment effect in a patient infected with SARS-CoV-2 in the United States attracted much attention (Holshue et al., 2020) . Currently, remdesivir has become the most promising drug that has entered the phase III clinical trial stage, shedding new light on the treatment of SARS-CoV-2-induced disease. Based on the above research, RdRP is one of the most promising therapeutic targets, and RdRP inhibitors (such as aurintricarboxylic acid, favipiravir and remdesivir) will be the most promising drugs for SARS-CoV-2.\nPLpro is a kind of protease responsible for processing the polypeptide translated from the independently (Cheng et al., 2015) . To date, no inhibitor targeting PLpro has been confirmed to be effective against SARS-CoV-2. However, the successful experience of designing inhibitors targeting SARS-CoV and MERS-CoV PLpro enzymes with antiviral activity and selectivity reminds us that it is a good choice to design specific inhibitors targeting SARS-CoV-2 PLpro.\nThe main protease is also known as 3C-like main protease (3CLpro) due to its similar cleavage site specificity to that of picornavirus 3C protease (3Cpro) (Zhao et al., 2013) .\nPrevious studies demonstrated that 3CLpro is one of the most vital proteases for RdRP generation, virus replication and infection (Zhou et al., 2019) . Similar to the RdRP protein, SARS-CoV-2 and SARS-CoV share approximately 96 percent 3CLpro sequence identity at the protein level (Morse et al., 2020a) . Research has discovered that 3CLpro easily forms a dimer under natural conditions through hydrogen bonds. In-depth structure analysis found that each monomer contains two main regions, the N-terminal catalytic region and the C-terminal region, and that the difference is dependent mainly on the catalytic region located on the protein surface (Lee et al., 2005) . Because SARS-CoV-2 may share with SARS-CoV similar possible interactions of substrates or inhibitors towards its active sites, imperceptible This article is protected by copyright. All rights reserved.\nstructural alterations from A to S residues are not expected to significantly affect the binding characteristics of substrates and inhibitors to those active sites. Therefore, 3CLpro is expected to become another potential enzyme target for the treatment of SARS-CoV-2. Lopinavir and ritonavir, two inhibitors of 3CLpro, were originally designed to treat HIV (Pillaiyar et al., 2020) . As the two major 3CLpro inhibitors, lopinavir and ritonavir are used mainly for clinically treating HIV in combination with other drugs, that is, the commonly discussed antiviral cocktails. At present, several studies have shown that the two 3CLpro inhibitors have anti-CoV properties both in vitro and in MERS-CoV-infected primates (not humans), and they have also shown activity in nonrandomized trials of SARS-CoV patients (Wu et al., 2004 indicating that this combination most likely failed .\nAlthough hopes are fading for treatment with lopinavir and ritonavir, targeting 3CLpro is still a potential therapeutic strategy for combating SARS-CoV-2. As research has continued, a growing number of small molecule inhibitors have been found to have high potential therapeutic effects against SARS-CoV-2 by targeting 3CLpro. Chen et al found nine promising small molecule inhibitors for the treatment of SARS-CoV-2 after optimization based on targeting 3CLpro by 32,297 potential antiviral medicinal plant compounds (Sun et 11b can likely prevent SARS-CoV-2 replication with an IC50 of 0.67 μΜ .\nBased on the above research, we believe that small molecule inhibitors that potently inhibit 3CLpro are promising drugs for SARS-CoV-2.\nIn addition to RdRP, PLpro and 3CLpro, helicases and glycogen synthase kinase 3 (GSK3)\nshould also be of interest because they are essential components during the coronavirus replication process in host cells and could act as viable targets for anti-SARS/MERS chemical therapies, according to studies that have already been confirmed by researchers (Adedeji et al., 2012; Adedeji et al., 2014; Mizutani et al., 2006; Wu et al., 2009) .\nAlthough there have been no related approved inhibitor-based anti-SARS-CoV-2 therapies so far, those candidate compounds, especially remdesivir, could serve as potential leads and clinical medicines for developing effective anti-SARS-CoV-2 drugs with interpretation of the crystal structure of replicases."}, {"section_title": "Targeting the viral genome and promising drugs", "text": "With the publication of the RNA genome sequence of SARS-CoV-2 (GenBank: MN908947), one strategy could aim to target the viral RNA genome itself for degradation, in addition to targeting the surface proteins and viral replicases. Therefore, using small interfering RNAs (siRNAs), RNA aptamers or antisense oligonucleotides (ASOs) against the SARS-CoV RNA genome may provide important insights and promising therapeutic targets for SARS-CoV-2 treatment (Ahn et al., 2009; Asha et al., 2018; Qureshi et al., 2018; Shum et al., 2008) .\nRecent studies have shown that two double-stranded RNAs (dsRNAs) specifically bind to SARS-CoV M protein gene were greater than 70% . In addition, the patent application CN1569233 describes promising siRNAs targeting SARS-CoV genes that encode main components, including RdRP, the nucleoprotein N, and proteolytic enzymes. These siRNAs are reported to have a significant inhibitory or killing effect of approximately 50-90% of the SARS-CoV virus BJ01 strain, in which the most effective are proteolytic enzyme-targeted siRNAs. Based on these findings, siRNA may be a potential biological agent for consideration as a great treatment strategy to kill SARS-CoV-2.\nTwo patents in Korea present the usage of RNA aptamers for inhibiting SARS-CoV. One ASOs have also been designed to detect SARS-CoV infections and to prevent or cure SARS-CoV-related disease (Lim et al., 2006) . Before the occurrence of SARS-CoV-2, a patent application submitted by Ionis Pharmaceuticals (WO2005023083) showed hybrid DNA/RNA ASOs designed for disrupting the pseudoknot in the site of the SARS-CoV RNA frame shift. In addition to inhibiting the virus directly, ASOs are also expected to target the disease-related proteins involved in the inflammatory cytokine storm process, which could be considered a promising therapeutic strategy for combating SARS-CoV-2 .\nTherefore, ASOs may be a kind of potential biological agent useful for the treatment of SARS-CoV-2, similar to the situation for SARS-CoV.\nIn addition, nucleoside analogues (such as EIDD-1931 and EIDD-2801) should be considered a class of biologic resources with potential antiviral effects. Although the viral genome may be a potential target of siRNAs, RNA aptamers, ASOs and nucleoside analogues for SARS-CoV-2, as was observed for SARS-CoV, this approach presents several challenges.\nOne of the most important challenges is the delivery of oligonucleotides into the lungs (Youngren-Ortiz et al., 2016) . In addition, even if siRNAs, RNA aptamers, ASOs and other biologic resources are effective clinically, how to scale up the mass production of these potential biological agents to cover the large infected population will be a problem worthy of This article is protected by copyright. All rights reserved.\nstudy . Therefore, we have a long way to go to reach the goals for the production of these potential biological agents (siRNAs, RNA aptamers and ASOs)."}, {"section_title": "Targeting the inflammatory cytokine storm and promising drugs", "text": "Although many strategies have been used to block the attachment, entry, replication and release processes to inhibit SARS-CoV-2 infection, how to prevent viral evasion from host immune responses and virus-induced cytopathic effects is considered one of the most urgent problems that need to be solved in SARS-CoV-2-induced pneumonia-associated respiratory syndrome (PARS) patients. Studies from SARS-CoV-induced deaths and animal models have shown that an aberrant and excessive host inflammatory cytokine storm results in a strong immunopathological response and lethal disease (Hui et al., 2019; Rockx et al., 2009; Smits et al., 2010) , which was also confirmed in SARS-CoV-2-induced PARS patients based on pathological features and autopsies. Inflammatory cytokine storm refers to the dysfunction of the immune system and an excessive inflammatory response that becomes uncontrollable , and it is closely associated with multiple infectious and non-infection conditions and diseases including graft-versus-host disease, autoimmune disease, severe virus infection, multiple organ dysfunction syndrome and chimeric antigen receptor (CAR)-T cell therapy (Channappanavar et al., 2017; Giavridis et al., 2018; RIddell, 2018) . During infection, CD4-positive T cells (CD4 + T cells) are rapidly activated to form pathogenic T helper (Th) 1 cells and to produce granulocyte-macrophage colony-stimulating factor (GM-CSF). The cytokine condition contributes to CD14 + CD16 + monocyte recruitment and IL-6 secretion, which further aggravate the inflammatory response after SARS-CoV-2 infection . Recently, several clinical reports revealed that most patients infected with SARS-CoV-2 have increased plasma concentrations of inflammatory cytokines, such as interleukins (IL-2/7/10), granulocyte/-macrophage-CSF, monocyte chemoattractant protein-1 (MCP-1), and tumour necrosis factor  (TNF-), especially the critically ill patients (Chen et al., 2020b; Huang et al., 2020b; Peeri et al., 2020) . These clinical indicators reveal the occurrence of severe pulmonary inflammation and the production of inflammatory cytokine storms during SARS-CoV-2 infection.\nTherefore, symptomatic treatments, especially strategies to eliminate inflammation and inflammatory cytokine storms, combined with organ support, in these critically ill patients are This article is protected by copyright. All rights reserved.\nthe most critical part of clinical management (Zumla et al., 2020) . Therefore, the inflammatory cytokine storm is a promising research and therapeutic target that may not only identify the immunopathological mechanism but also benefit the discovery of potential drugs.\nAs it takes a long time to evaluate and develop specific new drugs targeting SARS-CoV-2, several currently marketed drugs that target inflammatory cytokine storms and reduce immunopathology could be considered at this critical moment. Tocilizumab, which can specifically bind to both the soluble IL-6 receptor and membrane-bound IL-6 receptor to inhibit related signal transduction, is the first IL-6-blocking antibody approved for marketing and shows proven safety and effectiveness in therapy for rheumatoid arthritis (Safy-Khan et al., 2020; Verhoeven et al., 2019) . To date, a treatment programme utilizing tocilizumab based on conventional therapy has been administered to 20 patients (including 18 severe cases and 2 critical cases). The elevated body temperature was reduced to normal within 24 hours, which was accompanied by varying degrees of improvement in the oxygenation index of respiratory function. After two weeks of careful treatment by the scheme, 19 patients recovered, and only one patient became severely ill due to critical illness .\nThis treatment programme utilizing tocilizumab based on conventional therapy has been carried out in many hospitals in Wuhan, China, and has achieved good results, which indicates that tocilizumab is a drug with great potential for targeting the inflammatory cytokine storm on the basis of conventional treatment(Xinhua, 2020). Ge et al reported a poly-ADP-ribose polymerase 1 (PARP1) inhibitor named CVL218, which was identified by their data-driven drug repurposing framework. Their study showed that CVL218 could effectively inhibit SARS-CoV-2 replication with an EC50 of 5.12 µM. Additionally, it significantly suppressed CpG-induced IL-6 production by 50% and 72.65% in peripheral blood mononuclear cells at 1 µM and 3 µM concentrations after 12 hours, respectively. The aforementioned finding suggests that CVL218 has a significant anti-inflammatory cytokine storm effect, which is closely associated with SARS-CoV-2-induced immunopathology prevention, especially for intensive care unit (ICU) patients (Ge et al., 2020) . Further in vivo pharmacokinetic and toxicokinetic studies showed that CVL218 is distributed mainly in lung tissue without apparent toxicity, which makes it an appealing and promising drug candidate for the treatment of SARS-CoV-2 induced inflammatory cytokine storms.\nThis article is protected by copyright. All rights reserved.\nAbove all, the basic research/results of clinical treatment with tocilizumab and CVL218 based on conventional therapy reminds researchers that exploring novel uses of marketed drugs may also be an effective strategy for treating SARS-CoV-2-induced PARS."}, {"section_title": "Promising vaccines and passive antibodies from convalescent patient sera", "text": "Vaccination is the most ideal strategy to prevent infections and diseases by exposure to specific pathogens, especially in vulnerable populations (Ralph et al., 2020) . Therefore, it is absolutely critical for us to develop safe and efficient vaccines to control the spread of the pandemic and prevent the future recurrence of SARS-CoV-2 outbreaks. In the early stages of the outbreak, the Chinese government said that at least five vaccine technologies would be explored in China, including an inactivated vaccine, a subunit protein vaccine, a nucleic acid vaccine, an adenoviral vector vaccine and a recombinant vaccine (Zhang, 2020a) . On January 23, 2020, the Coalition for Epidemic Preparedness Innovations (CEPI) declared that they would fund three vaccine technology platform to develop effective vaccines against SARS-CoV-2 in the shortest period including DNA, mRNA, and \"molecular clamp\"\nplatforms (Lu, 2020) . It was encouraging that on March 16, 2020, the NIH announced that the first vaccine against SARS-CoV-2, named mRNA-1273, entered the phase I human study NCT04283461, which represented a total of 63 days from sequence selection to first human dosing by using the mRNA platform (Moderna, 2020) . Subsequently, on the same day, another exciting development of a subunit vaccine (adenovirus type 5 vector) against SARS-CoV-2 was created by experts of the Academy of Military Medical Sciences of China, and was approved for clinical trials (Zhang, 2020b) . The subunit vaccine, which has been approved in terms of safety, efficacy and quality by a third party, is a type of vaccine containing only a fragment of the SARS-CoV-2 pathogen to induce a protective immune response, according to the WHO. Since the start of the SARS-CoV-2 outbreak, the world's major academic institutions and biopharmaceutical companies have joined the race to develop a safe and effective prophylactic vaccine through multiple platforms such as mRNA, DNA, adenoviral vector and recombinant protein platforms (Pang et al., 2020 SARS-CoV-and MERS-CoV-related vaccine experience may promote the design and development of anti-SARS-CoV-2 vaccines due to the remarkable sequence homology among SARS-CoV-2, SARS-CoV and MERS-CoV . We believe that there will be good news regarding SARS-CoV-2 vaccines soon as a result of joint efforts in scientific research.\nIn addition to vaccines, a simple but potentially very effective strategy that can be used for combating SARS-CoV-2 is using convalescent patient sera, which can be obtained from patients who have recovered from virus infection. This passive strategy has been proven applicable according to experiences in the treatment of other viral diseases (Mire et al., 2016) .\nBased on experience, patients with resolved infection will develop viral antibodies at a high titre in response to different antigens of SARS-CoV-2 . One or more passive antibodies derived from convalescent patient sera will likely neutralize SARS-CoV-2 and prevent new rounds of infection. During the outbreak of Ebola in 2014-2015, this rationale was used to treat Ebola patients with convalescent serum and achieved very good results (Kraft et al., 2015) . At present, in China, many patients with resolved cases of SARS-CoV-2 said they are willing to donate plasma if necessary. If possible, this plasma can be transfused into other infected patients to help them overcome viral infections. Since plasma donation is a mature technology, and plasma transfusion is also a part of routine medical care, this proposal is the simplest and most feasible under consideration (Thorpe et al., 2020) . At the same time, we also need to consider that this proposal is not a long-term solution because the growing number of cases is far outpacing the speed of the recovery."}, {"section_title": "The potential of molecules derived from traditional Chinese medicine to treat infections caused by SARS-CoV2", "text": "As SARS-CoV-2 infection has become more rampant worldwide, all researchers are trying to search for potential therapeutic targets and promising drugs. In China, many researchers have been trying to find clues from traditional Chinese medicine (TCM), and now, significant progress has been achieved in the treatment of SARS-CoV-2. Since January 25, 2020, the early intervention of TCM has played an important role in this epidemic situation. According to statistics, a total of 60,107 patients infected with SARS-CoV-2 in China were treated with TCM by February 17th, 2020.\nThis article is protected by copyright. All rights reserved.\nA recent study screened eighty-three chemical structures from TCM compounds, and found that theaflavin (ZINC3978446) has a low idock score (-9.11 kcal/mol) and binding energy (-8.8 kcal/mol) in the catalytic pocket of SARS-CoV-2 RdRP. The results from the protein-ligand interaction profiler (PLIP) showed that theaflavin can form extra π-cation interactions and hydrogen bonds with the catalytic pocket (at the site of Asp452, Lys545, Arg555, Thr556, Tyr619, Lys621, Cys622, Asp623, Arg624, and Asp760) of SARS-CoV-2\nRdRp (Lung et al., 2020) , which indicated that thealfavin should be recognized as a lead compound for developing promising anti-SARS-CoV-2 drugs. Moreover, an in silico integrative model of absorption, distribution, metabolism and excretion (ADME) was used to screen promising ingredients or compounds from TCM for directly inhibiting SARS-CoV-2 . Of the screened compounds, 13 (such as kaempferol, moupinamide and dihydrotanshinone I, etc.) that exist in TCMs were found to have potential anti-SARS-CoV-2 activity related to similar possible targets, including PLpro, 3CLpro and S protein. Furthermore, 125 TCMs were detected to contain 2 or more of these 13 compounds,\nand 26 (such as Forsythiae fructus, Coptidis rhizome and Mori cortex, etc.) of them are classically catalogued as treating viral respiratory infections. In addition, network pharmacology analysis predicted that these 26 TCMs have general roles, including regulating viral infection, immune/inflammation reactions and the hypoxia response in vivo (Zhang et al., 2020b) . The aforementioned results of this research showed that many ingredients or compounds of TCMs could be considered lead compounds for developing promising anti-SARS-CoV-2 drugs. Therefore, researchers should also concentrate a certain effort on screening, discovery and development of promising TCM compounds/extracts for the treatment of SARS-CoV-2."}, {"section_title": "Concluding Remarks", "text": "Although the outbreak of SARS-CoV-2 in China was contained by the joint efforts of the government, society, and medical staff, outbreaks in other countries and regions outside of China have become increasingly severe and uncontrollable. By April 9, 2020, the number of cumulative confirmed cases is estimated to be close to 1,503,900 leaving approximately 89,931 people dead worldwide. As the epidemic spreads, scientists around the world are attempting to investigate the virus to understand its pathogenesis and explore potential targets This article is protected by copyright. All rights reserved. and promising drugs that would be effective in combating SARS-CoV-2. Although there have been some clues regarding viral pathogenesis and potential targets, there are no verified antiviral drugs with specific effects against SARS-CoV-2. The efficacy and safety of these promising candidate drugs in the treatment of SARS-CoV-2 need to be confirmed in further preclinical and clinical trials. With unremitting efforts to block the outbreak of SARS-CoV-2 worldwide, we hope that the infection and transmission of this virus will recede in a few months, as was observed for SARS-CoV and MERS-CoV. Although it will be a long and difficult road, the outbreak of SARS-CoV-2 worldwide has underlined the urgent need for renewed efforts to develop potential broad-spectrum and targeted antiviral drugs to overcome this virus."}, {"section_title": "Nomenclature of targets and ligands", "text": "Key protein targets and ligands in this article are hyperlinked to corresponding entries In http://www.guidetopharmacology.org, the common portal for data from the IUPHAR/BPS Guide to PHARMACOLOGY (Harding, Sharman et al., 2018) , and are permanently archived in the Concise Guide to PHARMACOLOGY 2019/20 (Alexander, Kelly et al., 2019) ."}]