[{"section_title": "ACKNOWLEDGMENTS", "text": "The conduct of the 1995 Survey of Doctorate Recipients, maintenance of the resulting data file, and publication of this report were funded by the National Science Foundation (NSF). Kelly Kang, who served as project officer for NSF, Susan Hill and Nirmala Kanankutty of NSF assisted the project staff of the Office of Scientific and Engineering Personnel (OSEP) with helpful advice on the draft report. The 1995 survey was conducted under the administrative supervision of Susan Mitchell and Peter Henderson. Prudence Brown and Peter Henderson analyzed the survey results and drafted the text. Julie Clarke prepared the report's figures and Martha Bohman prepared the tables and finalized the manuscript for publication. Special appreciation is expressed to Eileen Milner, who supervised the coding and editing of the data, and to her data processing support staff-Kevin Williams, Gedamu Abraha, and Kevin Kocur. Thanks are also extended to Cindy Woods, senior analyst, and SiuChong Wan, statistical programmer, who were responsible for system design and file generation. This report has been reviewed by individuals chosen for their diverse perspectives and technical expertise, in accordance with procedures approved by the NRC's Report Review Committee. The purpose of this independent review is to provide candid and critical comments that will assist the authors and the NRC in making the published report as sound as possible and to ensure that the report meets institutional standards for objectivity and evidence. The content o the review comments and draft manuscript remain confidential to protect the integrity of the deliberative process. We wish to thank the following individuals for their participation in the review of this report: Stephen J. Lukaski, independent consultant; and Carol B. Lynch, University of Colorado. While the individuals listed above provided many constructive comments and suggestions, responsibility for the final content of this report rests solely with the authors and the NRC. The work of this report was overseen by the Advisory committee of OSEP, which is concerned with the activities of the National Research Council that contribute to the effective development and utilization of the nation' scholars and research personnel. During the development of this report, Charlotte V. Kuh, Executive Director of OSEP, provided helpful guidance, as did Marilyn Baker, Associate Executive Director. Finally, thanks go to all of the doctorate recipients who have completed the survey over the years. Without their continuing cooperation, this survey project would not be possible."}, {"section_title": "M.R.C. Greenwood, Chair", "text": "Advisory Committee Office of Scientific and Engineering Personnel This report profiles the demographic and employment characteristics of doctoratelevel scientists and engineers in the United States in a descriptive manner. The data presented in the report were collected through the 1995 Survey of Doctorate Recipients (SDR), twelfth in a series of surveys initiated in 1973 by the National Research Council (NRC) in response to the needs of the federal government for demographic and employment information on scientists and engineers trained at the doctoral level. This survey is sponsored by NSF, NIH, and DOE. The purpose of the SDR, since its inception, has been to estimate the number of people holding research doctorates from U.S. institutions in science and engineering who reside in the United States and to characterize their demographic and employment patterns. The sampling frame for the SDR is the Doctorate Records File (DRF), a census of all research doctorates earned in the United States since 1920. The SDR sample for 1995 included 49,829 doctorate-level scientists and engineers, drawn from a population of 594,300. This report focuses on those doctorates who earned their degrees in a science or engineering field from a U.S. institution between January 1942 and June 1994 and were age 75 or younger and residing in the United States in April 1995. The estimated size of this population is 542,500. This profile report is organized as follows: Chapter 1 describes the size and composition of the doctorate-level scientist and engineer population, including such characteristics as gender, race/ethnicity, citizenship, and age. Chapters 2 and 3 profile the employment status of these doctorates in 1995. Special attention is given to the academic sector. Chapter 4 focuses on postdoctoral appointments held by doctoral scientists and engineers, and Chapter 5 covers second jobs held. Chapter 6 presents data on changes in employment for the population since 1993. Chapter 7 presents data on articles published, papers presented at conferences, and inventions patented by doctoral scientists and engineers. Chapter 8 describes professional development activities. Appendix A discusses survey methods and outcomes, including response rates, sampling and nonsampling errors, and weighting procedures. Appendix B contains a copy of the survey cover letter and questionnaire. Appendix C provides a description of terms used in the text and tables. Appendix D is a list of the Ph.D. fields covered by the SDR and aggregated into the broad groups shown in this report. Appendix E contains the occupation codes aggregated into broad groups."}, {"section_title": "DOCTORAL POPULATION IN THE SCIENCES AND ENGINEERING", "text": ""}, {"section_title": "Distribution by Field", "text": "The estimated population of science and engineering doctorates' in 1995 was 542,500. For this project, the population was defined to include Ph.D.s who earned their degrees in a science or engineering field from a U.S. institution between January 1942 and June 1994 and who were age 75 or younger and residing in the United States in April The population of science and engineering doctorates was 84 percent white, 12 percent Asian, 2 percent black, 2 percent Native American, and less than 1 percent Hispanic. Asians comprised 29 percent of the doctorates in computer sciences and engineering. The highest concentrations of blacks were in health and social sciences, both 4 percent. The racial/ethnic composition of science and engineering Ph.D. cohorts changed over time as each successive cohort included a higher proportion of Asians, Native Americans, and blacks. Of the doctorates who earned degrees more than 25 years earlier, 6 percent were Asian; for the most recent 5-year cohort, the proportion who were Asian was 22 percent. Looking at these same two cohorts, the proportion of doctorates who were Native American increased from 1 to 4 percent, and the proportion who were black increased from 1 to 3 percent"}, {"section_title": "Age in 1995", "text": "Of all science and engineering doctorates, 42 percent were age 44 or younger. Doctorates age 55 or older accounted for 25 percent of the population. The youngest doctorates were in computer sciences: 81 percent were age 44 or less. Chemistry had the highest proportion of doctorates age 55 or older (31 percent); Year of Doctorate About 7 percent of all science and engineering doctorates received their degrees before 1960. Another 44 percent were earned between 1960 and 1979, and 50 percent were earned after 1979. Fifty-one pereent of the degrees in computer scienCes were earned since 1989, due primarily to.the burgeoning number of programs in that field. A relatively high proportion of health science doctorates were also earned within the most recent 5 years-730 percent, compared with 19 percent for science and engineering doctorates overall. Thirteen percent of chemistry doctorates received their degrees before 1960, the highest proportion by field, compared with 7 percent of science and engineering doctorates overall."}, {"section_title": "Citizenship Status", "text": "Eight percent of science and engineering doctorates were foreign citizens in 1995 (including both permanent and temporary residents). Computer sciences and engineering had the highest proportions of foreign citizens, 28 and 16 percent, respectively. The lowest proportion (2 percent) was in psychology. Foreign citizens comprised 24 percent of science and engineering doctorates earned within the most recent 5 years. This chapter presents the employment status of science and engineering doctorates in 1995, describing the proportions who were employed full-time, employed part-time, or not employed (including those seeking employment, those retired, and all others not working). Those who held postdoctoral appointments were included as either full-time employed or part-time employed as appropriate. In 1995, 84 percent of science and engineering doctorates were employed fulltime. By field of doctorate, full-time employment rates ranged from a high of 97 percent in computer sciences to a low of 81 percent in psychology (see Table 4). Just over 5 percent of the science and engineering doctorates were employed parttime. Part-time employment was highest for psychology doctorates (12 percent) and lowest for doctorates in computer sciences (1 percent). "}, {"section_title": "15", "text": "In 1995, 1.5 percent of all science and engineering doctorates in the labor force were unemployed and looking for work. Chemistry doctorates, at 2.2 percent, had the highest unemployment rate, whereas computer sciences and social sciences had the lowest rates, 0.9 percent and 1.1 percent, respectively. (see Table 7). By gender, there was no difference in the unemployment rate for science and engineering doctorates overall. Two fields, however, had notable differences in the rates by gender: physics/astronomy with female unemployment rates at 3.7 percent compared with men at 1.4 percent and engineering with rates for females at 4.7 percent compared with 1.6 percent for men.   Chemistry and engineering doctorates were most likely to be employed in private for-yrofit companies (55 and 54 percent, respectively). Only 11 percent of social sciences Ph.D.s were similarly employed. Twenty percent of psychology Ph.D.s were self-employed. Doctorates in this field were also most likely to work in not-for-profit organizations (9 percent, compared with 5 percent of the total). Earth/atmospheric/marine sciences doctorates were employed in government at the highest rate, 21 percent."}, {"section_title": "Occupation", "text": "Occupation2 was defined on the survey as the \"kind of work you were doing on your principal job held during the week of April 15, 1995.\" Thirty-eight percent of science and engineering doctorates were working as scientists (including social scientists and psychologists), 28 percent were postsecondary teachers of science or engineering, 13 percent were top/mid-level managers, and 9 percent were engineers. These occupations were distributed differently within employment sectors and by years since doctorate (see Tables 9 and 10). Predictably, most of those working in educational institutions were teachers (62 percent), but 8 percent were top/mid-level managers, including deans, administrators, and department chairs. Another 27 percent were scientists or engineers, with biological scientists being the largest single component of this group (10 percent of the total in educational institutions). In private for-profit companies, 21 percent were engineers, 19 percent were top/mid-level managers, and 11 percent were chemists. Nearly one-half of those self-employed were psychologists (48 percent). The occupations most frequently listed by those in private not-for-profit organizations were top/mid-level managers (21 percent), psychologists (19 percent), and biological scientists (13 percent). These same occupations were the three largest components of the government sector (18, 12, and 15 percent, respectively). As years since the doctorate increased, the proportions who were either top/midlevel managers or postsecondary teachers of science or engineering increased. Top/mid-level managers grew from 4 percent for those with 5 or less years since the degree to 18 percent for those who were more than 25 years since doctorate 2 See Appendix E for the occupation codes and broad groupings. 19 13 award. Postsecondary teachers of science and engineering went from 23 to percent of the total. The proportions working as scientists or engineers, on the other hand, decreased as years since doctorate increased. Of those with 5 years or less since doctorate 52 percent were scientists and 13 percent were engineers; of those more than 25 years since doctorate 33 percent were scientists and 7 percent were engineers."}, {"section_title": "Retention and Mobility", "text": "In this report, the percentage of employed individuals with degrees in a particular field that were also working as practitioners or postsecondary teachers in that specialty is called the \"retention rate\" of the field. In 1995 the retention rates ranged from highs in computer sciences and psychology, 72 and 71 percent, respectively, to a low of 41 percent for agricultural/environmental sciences doctorates (see Table 11). Mobility between science and engineering fields was evident among certain groups of doctorates. Among both health and agricultural/environmental sciences doctorates, between 16 and 17 percent were employed in biological sciences. Conversely, a high proportion (14 percent) of biological sciences doctorates was employed in health sciences. The other fields with notable proportions working in another science/engineering specialty were mathematical sciences where 13 percent worked as computer scientists and physics/astronomy where 12 percent worked as engineers."}, {"section_title": "Primary Work Activity", "text": "As distinguished from occupation, primary work activity was defined as the activity on which the most hours were spent during a typical week on the job. In 1995, 22 percent of science and engineering doctorates listed teaching as their primary work activity. Applied research was listed by 20 percent and basic research by 14 percent. These activities were followed in frequency by professional services and managirig/ supervising, each at 12 percent, and development/design at 7 percent (see Table 12). Mathematical sciences and social sciences had the highest proportions of doctorates with teaching as their primary work activity (44 and 42 percent, respectively). These were also the fields with the highest proportions employed in educational institutions. Doctorates in biological sciences and earth/atmospheric/marine sciences were most likely to be engaged in applied or basic research (51 and 48 percent, respectively). Psychology Ph.D.s were least likely to be engaged primarily in research (15 percent). Managing/supervising as a primary work activity ranged from a high of 15 percent for health science and engineering doctorates to a low of 7 percent for computer sciences doctorates. As expected, some activities were concentrated in certain fields: 48 percent of psychology doctorates were primarily engaged in professional services; computer applications was the primary activity for 24 percent of computer sciences Ph.D.s; and 20 percent of engineers were primarily doing development/design. The proportion reporting applied research as the primary work activity declined as years since the doctorate increased, from 26 percent for recent Ph.D.s (those with 5 years or less since the doctorate) to 16 percent for those more than 15 years since doctorate award (see Table 13)."}, {"section_title": "21", "text": "On the other hand, the proportion primarily teaching grew as time since the Ph.D. increased, from 19 percent for recent Ph.D.s to 29 percent for those with more than 25 years since the degree. The proportion primarily engaged in managing/supervising also increased, from 4 percent of recent Ph.D.s to between 16 and 17 percent of those with more than 15 years since the degree. "}, {"section_title": "Salary", "text": "In 1995 the median salary for science and engineering Ph.D:s was $60,200. (Median annual salaries were computed for full-time employed individuals, including postdoctoral appointees.) By field, engineering doctorates had the highest median salaries, at $70,000, followed closely by chemistry and physics/astronomy doctorates (both $68,000). By gender, doctorates from these three fields also earned the highest median salaries, between $69,000 and $70,000 for men and between $57,000 and $58,800 for women. However, while men with doctorates in health sciences were among the top earners ($69,000), women from this field were not ($52,000) (see Table 14). Those working in the private for-profit sector had the highest median annual salaries, $75,000. The median annual salary for those working in educational institutions was $52,000. Within that sector, the salaries ranged from $45,000 for those in 2-year colleges to $56,000 for those working in university-affiliated research institutes (see Table 15). By sector, median salary differences between men and women ranged from $3,000 in elementary/secondary schools to $16,200 in university-affiliated research institutes. "}, {"section_title": "4°E", "text": "i Male D Female *There were too few women in computer sciences to estimate the median salary."}, {"section_title": "23", "text": ""}, {"section_title": "Government Support Status", "text": "In 1995, percent of employed science and engineering doctorates received support from the federal government3 in the form of contracts or grants (see Table 16). Doctorates in physics/astronomy were most likely to receive government support, 47 percent, while doctorates in social sciences and psychology were least likely (18 and 16 percent, respectively). The agencies most frequently cited as the sources of support were the National Institutes of Health (30 percent), the Department of Defense (22 percent), and the National Science Foundation (20 percent) (see Table 17). By sector, the proportion receiving support was highest in private not-for-profit organizations, 44 percent, followed by educational institutions, 40 percent (see Table 18)."}, {"section_title": "Relationship of Principal Job to Doctoral Degree", "text": "Science and engineering doctorates were asked about the relationship between their principal job and their doctoral field as one measure of the link between education and careers. Overall, 68 percent of science and engineering doctorates indicated that their jobs were closely related to their doctoral degrees, 24 percent said their jobs were somewhat related, and 8 percent said their jobs were not related to their degrees (see Table 19). Doctorates in computer sciences, psychology, and health sciences had the highest proportions reporting that their job was closely related to their doctoral education (between 79 and 81 percent). Doctorates in physics/astronomy most frequently reported that their jobs and education were not related (15 percent), followed by doctorates in chemistry, 11 percent. Of those science and engineering doctorates whose jobs were not related to their doctoral degrees, 29 percent said the most important reason for working outside their field was a change in career or professional interests. For 27 percent, \"job in doctoral degree field not available\" was the most important reason for working out of field, and 22 percent cited pay or promotion opportunities as the most important reason (see Table 20). Focus on Academe The following is a more detailed look at the 44 percent of employed science and engineering doctorates who were working in academe in 1995, excluding those on postdoctoral appointments.4 (Academe includes 2-year and 4-year colleges, universities,' medical schools, university-affiliated research institutes, and \"other\" educational institutions. It does not include elementary, middle, or secondary schools.) This section examines the rank and tenure status of scientists and engineers, how quickly they moved through the ranks, and whether this progress differed by field or gender."}, {"section_title": "Academic Rank", "text": "In 1995, 38 percent of science and engineering Ph.D.s employed in academe were full professors, 24 percent were associate professors, 20 percent were assistant professors, and 3 percent were instructors or lecturers. The remaining doctorates employed in academe were adjunct faculty members (2 percent), held some other position (2 percent), or responded that rank was not applicable to their position or at their institution (12 percent) (see Table 21). The highest proportion of full professors was in mathematical sciences (46 percent); the lowest was in computer sciences (10 percent). Since 95 percent of the computer sciences doctorates graduated within the past 15 years, it is not surprising that the proportion of full professors in this field was low. Concentrations of associate and assistant professors were highest in computer sciences (82 percent) and health sciences (62 percent) and lowest in physics/astronomy (29 percent). Doctorates in physics/astronomy and earth/atmospheric/marine sciences said rank was not applicable more frequently than doctorates in any other field (25 percent and 20 percent, respectively). This might be explained by the fact that higher than average proportions of Ph.D.s in these two fields were working in universityaffiliated research institutions. Of those with 5 years or less since the Ph.D., only 2 percent were full professors and 61 percent were assistant professors. Between 6 and 15 years since the doctorate, 14 percent were full professors and 41 percent had become associate professors. After 16 to 25 years, 59 percent were full professors and after 25 years more than three-quarters (76 percent) had attained that rank (see Table 22)."}, {"section_title": "20", "text": "Women, however, did not achieve the rank of full professor in the same proportions as men. At years or less since the doctorate, women actually had a slight edge in the full professor category (2 percent, compared with 1 percent for men). For the cohort 6 to 15 years since degree, the proportion of men who were full professors was nearly twice that of women (16 and 9 percent, respectively). The gap widened with time and after 25 years, only 55 percent of women were full professors compared with 78 percent of men. It should be noted that these comparisons are made by years since doctorate, rather than years in the work force. Women are likely to have more career interruptions than men, which could account for some of the observed disparities. "}, {"section_title": "Tenure", "text": "In 1995, 56 percent of science and engineering doctorates employed in academe were tenured, 18 percent were on a tenure track, and 9 percent were not on a tenure track. Of the rest, 5 percent were at institutions without a tenure system and 13 percent were in positions to which tenure did not apply (see Table 23). As in the previous section on faculty rank, those on postdoctoral appointments were excluded from the analysis in this section. Mathematical sciences had the highest proportion with tenure, 72 percent, and the proportions for both agricultural/environmental sciences and social sciences were higher than average, 63 percent for each. While doctorates in computer sciences had the lowest proportion with tenure (42 percent), a much higher than average proportion of these doctorates were on tenure track, 45 percent compared to 18 percent overall. These figures reflect the relative youth of the doctorates in this field. Achievement of tenure is directly corelated with years since doctorate. At years or less since the Ph.D., only 6 percent had tenure. At 6 to 15 years since the doctorate, 47 percent had tenure. By the time 16 to 25 years had passed, 77 percent had tenure, and this proportion increased to 82 percent for those with more than 25 years since the doctorate (see Table 24). Women with 5 years or less since the doctorate held tenure in higher proportions than men from the same cohort, 8 percent compared with 5 percent. After 5 years, however, the proportion of men with tenure was between 13 and 14 percent higher than for women in each cohort. As with faculty rank differences between men and women by cohort, the tenure rate differences may be partially explained by the tendency of women to have more gaps in their careers. 29 23"}, {"section_title": "POSTDOCTORAL APPOINTMENTS", "text": "This chapter examines the postdoctoral appointment' (postdoc) as a component of the career of doctoral scientists and engineers. Discussed here will be the total number of postdocs held, the postdoctoral status of the population in 1995, characteristics of those on postdocs in 1995, reasons for holding postdocs, and the relevance of the postdoc to the principal job held in 1995."}, {"section_title": "Number of Postdocs", "text": "Overall, 34 percent of science and engineering doctorates had held at least one postdoc and 9 percent had held multiple postdocs since award of the doctorate. Ph.D.s in the biological sciences were most likely to have held at least one postdoc (62 percent). Roughly half of those in chemistry and physics/astronomy also had held at least one postdoc. Least likely were doctorates in computer sciences and social sciences (10 and 12 percent, respectively). Biological sciences Ph.D.s were also most likely to have held multiple postdocs (20 percent) (see Table 25). "}, {"section_title": "4te", "text": "A postdoctoral appointment was defined on the survey as \"a temporary position awarded in academe, industry, or government primarily for gaining additional eilucation and training in research.\" The proportion having held at least one postdoc was inversely related to the number of years since the Ph.D. was granted, ranging from 27 percent for those more than 25 years since degree award to 40 percent for those with 5 years or less since doctorate. By field, the trend toward holding a postdoc was also evident. Doctorates in physics/astronomy showed the largest increase in the proportion who.held a postdoc, from 36 percent of the Ph.D.s with more than 25 years since the degree to 72 percent of those 5 years or less since the doctorate. Of biological sciences Ph.D.s with more than 25 years since the doctorate, 45 percent held a postdoc; of those 5 years or less since the doctorate, 71 percent held at least one. Only doctorates in social and health sciences shOwed a decline in the percentage wifh at least one postdoc from the cohort more than 25 years since degree to the most recent 5 year cohort."}, {"section_title": "Reasons for Holding Postdocs", "text": "Of those who had held postdocs at some time in their careers, \"additional training in Ph.D. field\" was most frequently cited as the primary reason for taking the first postdoc (47 percent), followed by \"work with a specific person or place\" (21 percent). This distribution was similar for those with only one postdoc and those who held more than one (see Table 26). By field among those who had ever held a postdoc, additional training was the primary reason cited most frequently (with the exception of doctorates in earth/atmospheric/marine science § whose primary reason was most often work with a specific person). A higher than average proportion of doctorates in engineering and'agricultural/ environmental sciences cited employment not available as the reason for their first postdoc (25 and 26 percent, respectively, compared with 11 percent for doctorates overall). For those doctorates with multiple postdocs, the primary reasons for the second postdoc were still most likely to be additional training and work with a specific person, but the proportions were closer, 35 and 25 percent, respectively. For those holding multiple postdocs, \"other employment not available\" was cited as the primary reason for the second postdoc by 14 percent (compared With 9 percent citing this reason for their first postdoc)."}, {"section_title": "25 1995 Postdocs", "text": "In 1995, 4 percent of science and engineering doctorates were on postdocs, with doctorates in biological sciences having the highest proportion (10 percent). The lowest proportion was in social sciences, less than 1 percent (see Table 27). Predictably, doctorates earning their degrees within the last 5 years had the highest proportion on postdoc.s, 19 percent. This proportion dropped to 2 percent for doctorates from 6 to 10 years out, and to less than 1 percent for those more than 10 years out. By field within the most recent 5-year cohort, 44 percent of biological sciences Ph.D.s and 39 percent of physics/astronomy Ph.D.s were on postdocs. The next several comments in this section pertain to those science and engineering doctorates who were on postdocs in April 1995 (see Table 286). Of those on postdocs in 1995, 85 percent were from the most recent 5-year cohort and 58 percent were less than 35 years old. In 1995, those on postdocs were more likely to be Asian (27 percent) and non-U.S. citizens (29 percent) than the most recent 5-year cohort of science and engineering doctorates overall (22 percent Asian and 24 percent non-U.S. citizens). The most recent 5-year cohort is used as the comparison group because most of the 1995 postdoctoral appointees were from this cohort (see above). Approximately one-third of both the postdoctoral appointees and the most recent cohort overall were female. Most postdoctoral appointees in 1995 were working in educational institutions (55 percent), followed by government (33 percent), business/industry (7 percent), and other sectors (5 percent). This distribution by sector was similar for postdoctoral appointees with doctorates in chemistry, physics/astronomy, and biological sciences. The exceptions were psychology, where 20 percent reported \"other\" sector, and engineering, with 12 percent in business/industry. Generally, most of those on postdocs in 1995 received health benefits (84 percent) but not pension benefits (37 percent). However, the proportions receiving these benefits varied by field. Ninety percent of physics/astronomy doctorates on postdocs received health benefits and 50 percent received pension benefits. On the other hand, only 57 percent of psychology doctorates received health benefits and 18 percent received pension benefits."}, {"section_title": "Relevance of Postdoc to 1995 Principal Job", "text": "Those individuals who had held a postdoc but were not on a postdoc appointment in April 1995 were asked to rate the relevance of their most recent postdoc to the work on their 1995 principal job. Table 29 shows the proportion who said the aspects of their most recent postdoc were \"a great deal\" or \"somewhat\" relevant to their job. \"General approach or problem solving skills\" was rated relevant by 90 percent of the doctorates. \"Subject matter knowledge or expertise\" was relevant for 85 percent, followed by \"contacts established with colleagues in your field\" at 80 percent and \"use of specific skills or techniques\" at 73 percent. \"Use of specialized equipment\" was considered relevant by the smallest proportion, 58 percent. Even for doctorates graduating more than 25 years earlier and presumably furthest removed from the postdoc experience, all aspects were considered relevant to the 1995 job by at least 50 percent. Even though a relatively small proportion of psychology doctorates ever held postdocs (25 percent), they rated all aspects of the postdoc (except use of equipment) relevant as or more frequently than doctorates in any of the other selected fields. This section looks at which doctorates were likely to hold a second job and what those jobs were. Doctorates in psychology were most likely to hold a second job (33 percent), followed by doctorates in health and social sciences (21 and 19 percent, respectively) (see Table 30). The occupation of the second job was most frequently scientist (44 percent), followed by postsecondary teachers of science or engineering (20 percent). Another 19 percent were in \"other\" occupations which included such diverse categories as artists/broadcasters/entertainers/writers, farmers/foresters/fishermen, sales and marketing occupations, and service occupations.   Ph.D.s whose principal employment was in a private not-for-profit organization were most likely to hold a second job (23 percent), while those in private forprofit companies were least likely to do so (8.9 percent) (see Table 31). Sixty-six percent of Ph.D.s holding second jobs said those jobs were closely related to their doctoral degrees. In psychology this proportion was 82 percent. For all science and engineering doctorates with second jobs, 15 percent said the second job was not related to their doctoral degree. The field with the highest proportion saying \"not related\" was physics/astronomy (37 percent) (see Table 32). 3 5   29   6EMPLOYMENT CHANGES SINCE 1993 This chapter examines changes in the employment situation of science and engineering doctorates between April 1993 and April 1995, including changes in status, employer, and job. Under examination here are those science and engineering doctorates employed in April 1995. Of these, 74 percent were employed in 1993 and did not change either employer or job in the interim. Ten percent changed both employer and job, while 5 percent changed employer only and another 7 percent changed job only. Five percent reported that they were not employed in April 19938 (see Table 33). Doctorates in computer sciences were most likely to have made any type of employer and/or job change (32 percent). Change rates for all other fields were between 18 and 24 percent.  Computer sciences doctorates were also most likely to change both employer and job (19 percent), while mathematical and agricultural/environmental sciences doctorates were least likely to have done so (7 percent). Changes in employer ranged from 12 percent in both agricultural/environmental and social sciences to 17 percent in health sciences and 24 percent in computer sciences. (Employer changes include those doctorates who changed both employer and job and those who changed employer only.) Computer sciences doctorates also made job changes most frequently (27 percent). For other fields, job changes ranged from 13 percent in mathematical sciences to 20 percent for chemistry. (Job changes include those doctorates who changed both job and employer and those who changed job only.) The reason cited most frequently by science and engineering doctorates for changing job or employer was \"pay, promotion opportunities\" (52 percent). Computer, agricultural/environmental, and health sciences doctorates were more likely than those in other fields to give this reason (between 59 and 60 percent), while physics/astronomy Ph.D.s were least likely (42 percent). The second most cited reason was working conditions (28 percent) and the third was job location (21 percent) (see Table 34). 3 7 31 7 ARTICLES, PAPERS, AND PATENTS Productivity of science and engineering Ph.D.s can be measured by the numbers of published articles, presented papers, and applications for patents."}, {"section_title": "Articles", "text": "Sixty-three percent of science and engineering.Ph.D.s had an article published in a refereed journal between April 1990 and April 1995. The mean number of articles published was 4.7 for all science and engineering doctorates (see Table 35). Publication of articles varied by field. The mean number of articles ranged from a low of 2.8 for doctorates in psychology to a high of 7.0 for doctorates in biological sciences. Ph.D.s in biological and earth/atmospheric/marine sciences were the most likely to have published at least one article (78 and 77 percent, respectively). Twenty-one percent of doctorates in biological sciences had more than 10 published articles during the five-year period compared to 12 percent for all science and engineering doctorates. The least likely to have published were psychology Ph.D.s (44 percent). By sector, the mean number of articles was 6.7 for science and engineering doctorates employed in educational institutions, 4.4 for those in the nonprofit sector or governmental sector, 2.4 for those in private firms, and 1.1 for the selfemployed. Those most likely to have published at least one article were science and engineering doctorates in educational institutions (78 percent) and those least likely were the self-employed (28 percent). For all science and engineering doctorates holding academic positions, the mean number of articles published between April 1990 and April 1995 was 6.9, and 79 percent had published at least one article. Full professors had the highest mean number of published articles (9.2). More than one-quarter had published more than 10 articles. Adjunct faculty and instructors/lecturers had the lowest mean number of articles (3.2 and 3.0, respectively) (see Table 36). By contrast, those holding postdoctoral appointments were the most likely to have published at least one article (94 percent). About 77 percent of full professors had published at least one article, compared to 61 percent of instructor/lecturers and 58 percent of adjunct faculty. By tenure status, those with tenure had the highest mean number of articles published (8.2). Postdoctoral appointees, who were the most likely to have had at least one article published (94 percent), had a lower mean number of articles (5.4). Those for whom tenure was not applicable had the lowest mean number of articles (5.1) and were the least likely to have published (68 percent). 3 9 Papers Seventy-three percent of science and engineering Ph.D.s had authored or coauthored papers for presentation at regional, national, or international conferences between April 1990 and April 1995. The mean number of papers presented was 6.4 overall (see Table 35). Variances in the number of papers produced for conferences by field, sector, academic position, and tenure status were similar to those in the number of articles published (see above). An exception was that doctorates in computer and earth/atmospheric/marine sciences were most likely to have authored a conference paper (86 and 85 percent, respectively)."}, {"section_title": "Patents", "text": "The productivity of science and engineering doctorates can also be examined by looking at the number of patent applications on which they were named, the number of patents granted, and the number of patents that were commercialized. Overall, 12 percent said they had been named as an inventor on a patent application between April 1990 and April 1995 (see Table 37). The number of times science and engineering doctorates were named as an inventor on a patent varied by field. Almost no social science or psychology Ph.D.s were named as an inventor on a patent application (less than 1 percent for each). Other fields with a low, percentage of doctorates named as inventor included mathematical sciences (4 percent), earth/atmospheric/marine sciences (5 percent), health sciences (6 percent), and agricultural/envirimmental sciences (8 percent). Those fields with a high percentage named on a patent application were chemistry (31 percent) and engineering (25 percent). Of those who had been named as an inventor on a patent application between April 1990 and April 1995, 59 percent had been named on 1 to 2 patent applications, 36 percent on 3 to 10 applications, and 5 percent had been named on 10 or more. However, 30 percent had no patents granted, while 46 percent had 1 to 2 granted, 21 percent had 3 to 10 granted, and 4 percent had 10 or more granted. Ph.D.s in chemistry and physics/astronomy had the highest rates of success in obtaining patents (79 and 78 percent, respectively), followed by engineering doctorates (72 percent). An interesting follow-on question is whether the patents granted resulted in commercialized products or processes or were licensed. Overall, 52 percent of those granted patents said that their patents had been licensed or commercialized. Thirteen percent of all those who had been granted a patent indicated that more than 2 of their patents had been commercialized or licensed. "}, {"section_title": "PROFESSIONAL DEVELOPMENT", "text": "Scientists and engineers trained at the doctorate level undertook a number of activities to further develop the skills they needed for their field, to enhance their work or research, and to interact with others with similar professional interests."}, {"section_title": "Professional Societies", "text": "In 1995, 84 percent of all science and engineering Ph.D.s belonged to at least one professional society or association. By field, health and earth/atmospheric/marine sciences had the highest proportions (93 and 91 percent, respectively) and physics/astronomy had the lowest proportion (79 percent) (see Table 38)."}, {"section_title": "Foreign Work or Research", "text": "Since completing their doctorates, 38 percent of science and engineering Ph.D.s traveled outside the United States to work or conduct research. There was considerable variation by field. High percentages of Ph.D.s in earth/atmospheric/marine sciences (59 percent), social sciences (52 percent), and agricultural/environmental sciences (50 percent) had worked or done research outside the United States. Percentages were relatively low for health sciences (29 percent) and psychology (20 percent) (see Table 39). For those who traveled outside the United States, the length of their last trip for work or research was typically one month or less: 22 percent traveled for less than a week and 43 percent for 7 to 30 days. Another 19 percent traveled for 1 to 6 months and 17 percent for more than 6 months. Biological sciences, chemistry, and physics/astronomy had the highest percentages traveling for more than 6 months (between 19 and 20 percent). For those not working or conducting research outside the United States, the reason most often cited (39 percent) was \"not relevant to my career.\" Other principal reasons for not traveling were \"family-related reasons\" (37 percent) and \"no time\" (36 percent). Also about one-third said they were \"unaware of funding available\" for work or research outside the United States. The reason most often cited for not working or conducting research outside the United States varied by field. Computer science doctorates were most likely to say they had \"no.time\" (47 percent); psychology doctorates were most likely to say it was \"not relevant\" (45 percent); and computer, health, and biological sciences doctorates were most likely to cite \"family-related reasons\" (between 41 and 42 percent). Only 16 percent of scientists and engineers who had not worked or conducted research outside the United States said they were deterred by a \"lack of foreign language skills\" or that they were \"concerned about losing my place in U.S. job market.\""}, {"section_title": "Work-Related Training", "text": "Fifty-two percent of science and engineering doctorates attended work-related workshops, seminars, or training in the year leading up to the survey (this excludes college courses or general sessions at professional meetings). By field, participation in work-related training ranged from a low of 39 percent among Ph.D.s in physics/astronomy to a high of 72 percent among psychology doctorates (see Table 40). By and large, the training in which science and engineering Ph.D.s participated was technical training in their occupational field. This was true for 78 percent of all who participated in work-related training, with variations by field from a low of 70 percent in physics/astronomy to 92 percent in psychology. Approximately 28 percent of those who attended training indicated they had attended management or supervisory training, a percentage that varied from a low of 17 percent for psychology to a high of 38 percent for chemistry."}, {"section_title": "3 37", "text": "The reason most often cited by doctorates for attending work-related training was to gain further skills or knowledge in their occupational field (92 percent). The second most frequent reason given for attending was that training was required or expected by their employers (33 percent).  "}, {"section_title": "Further Education", "text": "Between April 1993 and April 1995, about 6 percent of science and engineering doctorates took college or university courses or enrolled in a college or university for other reasons, such as completing another master's degree or Ph.D. (see Table 41). For those who took courses or enrolled in school, the most frequently cited reason for doing so was to gain further skills (63 percent). This ranged from a low of 49 percent for mathematical sciences doctorates to highs of 77 and 80 percent for agricultural/environmental and health sciences doctorates, respectively. Personal interest was the second most frequently listed reason (52 percent). Mathematical sciences doctorates were most likely to cite this reason (64 percent). For 45 percent of doctorates, their employers paid the school-related costs associated with taking courses. Employers were most likely to pay the costs of courses taken by engineering Ph.D.s (55 percent) and least likely to pay the costs of courses taken by psychology Ph.D.s (34 percent). About 16 percent of those taking courses completed a certificate or another degree.         ?0             NOTE: Percentages represent those who said the aspect of postdoc training was \"a great deal\" or \"somewhat\" relevant to their principal job. *Includes those who held at least one postdoc, but whose principal job was not a postdoc in April 1995. **Too few cases to estimate. SOURCE: National Research Council/National Science Founian Survey of Doctorate Recipients, 1995.        NOTE: Numbers are rounded to the nearest hundred; therefore, subcategories may not add to total. *Those who reported that they had never worked were excluded. **Percentages may total more than 100 because multiple answers were allowed."}, {"section_title": "4.5", "text": "12`-'4OURCE: National Research Council/National Science Foundation, Survey of Doctorate Recipients, 1995. population of 594,300. Across strata, however, the rates ranged from 4 to 67 percent. The range in sampling rates serves to increase the variance of the survey estimates."}, {"section_title": "Data Collection", "text": "In 1995, there were two phases of data collection: a mail survey and telephone follow-up interview for nonrespondents to the mail. Phase 1 consisted of two mailings of the survey questionnaire with a reminder postcard between the mailings. The first mailing was in May 1995 and the second (using Priority Mail) in July 1995. To encourage participation, all survey, materials were personalized with the respondent's name and address. The mail survey achieved a response rate of about 62 percent. Phase 2 consisted of conducting computer-assisted telephone interviewing (CATI) on a 60-percent sample of nonrespondents to the mail survey (the CATI subsample). Telephone numbers were located for about 90 percent of the subsample and interviews were completed with 63 percent. Telephone interviewing was conducted between November 1995 and February 1996."}, {"section_title": "Data Preparation", "text": "As completed mail questionnaires were received, they were logged into a receipt control system that kept track of the status of all cases. Coding staff then carried out a variety of checks and prepared the questionnaires for data entry. Specifically, they resolved incomplete or contradictory answers, reviewed \"other specify\" responses for possible backcoding to a listed response, and assigned numeric codes to open-ended questions (e.g., employer name). A coding supervisor validated the coders' work. Once cases were coded, they were sent to data entry. The data entry program contained a full complement of range and consistency checks for entry errors and inconsistent answers. The range and consistency checks were also applied to the CATI data via batch processing. Further computer checks were performed to test for inconsistent values; these were corrected and the process repeated until no inconsistencies remained. At this point, the survey data file was ready for imputation of missing data. As a first step, basic frequency distributions were produced to show nonresponse rates to each questionthese were generally less than 3 percent, with the exception of salary, which was 6 percent. Two methods for imputation were adopted. The first, cold decking, was used mainly for demographic variables that are static, i.e., not subject to change. Using this method, historical data provided by respondents in previous years were used to fill a missing response. In cases where no historical data were available, and for nondemographic variables (such as employment status, primary work activity, and salary), hot decking was used. Hot decking involved creating cells of cases with common characteristics (through the cross-classification of auxiliary variables) and then selecting a donor at random for the case with the missing value. As a general rule, no data value was imputed from a donor in one cell to a recipient in another cell. The next phase of the survey process involved weighting the survey data to compensate for unequal probabilities of selection to the sample and to adjust for the effects of unit nonresponse. The first step was the construction of sample weights, which were calculated as the inverse of the probability of selection, taking into account all stages of the sample selection process over time. Sample weights varied within cells because different sampling rates were used depending on the year of selection and the stratification in effect at that time. The second step was to construct a combined weight, which took into account the subsampling of nonrespondents at the CATI phase. All respondents received a combined weight, which for mail respondents was equal to the sample weight and for CATI respondents was a combination of their sample weight and their CATI subsample weight. The third step was to adjust the combined weights for unit nonresponse. (Unit nonresponse occurs when the sample member refuses to participate or cannot be located.) Nonresponse adjustment cells were created using poststratification. Within each nonresponse adjustment cell, a weighted nonresponse rate was calculated. This weighted nonresponse rate took into account both mail and CATI nonresponse. The nonresponse adjustment factor was the inverse of this weighted response rate. The initial set of nonresponse adjustment factors was examined and, under certain conditions, some of the cells were collapsed if use of the adjustment factor would create excessive variance. The final weights for respondents were calculated by multiplying their respective combined weights by the nonresponse adjustment factor. Estimates in this report were developed by summing the final weights of the respondents selected for each analysis."}, {"section_title": "Response Rates", "text": "The unweighted response rate, which is calculated as total returns divided by total sample, was 76 percent. The weighted response rate takes into account the different probabilities for selection to the sample and the CATI subsample and is calculated as the total returns multiplied by their combined weight divided by the total sample cases multiplied by their sampling weights. The weighted response rate was 85 percent. The unweighted response rate is a measure of how well the data collection methodology worked in obtaining responses, while the weighted response rate is an indicator of the potential for nonresponse bias and as such is a somewhat better indicator of data quality."}, {"section_title": "Reliability", "text": "The statistics in this report are subject to both sampling and nonsampling error. For a detailed discussion of both sources of error in the SDR, see the methodological report referenced in footnote 1 of this appendix. In this methodological report, tables are provided that allow the reader to approximate the standard error, associated with various estimates from the survey. In a few days, Dr. Bruce Alberts, Chairman of the National Research Council, will ask you to help with the 1995 Survey of Doctorate Recipients. Since 1973, we have sponsored this important biennial survey of people who earned doctorates in the United States. It helps government, businesses, and academic institutions do a better job of ensuring sufficient numbers of highly educated personnel in a variety of fields. We have asked the National Research Council to conduct this survey for us to take advantage of their experience in issues involving human resources. The letter from Dr. Alberts will explain more about this survey and our reasons for contacting you. I would greatly appreciate your participation in this important effort. I am writing to ask for your help with the 1995 Survey of Doctorate Recipients. This is an important biennial study of highly educated and trained persons, sponsored by the National Science Foundation, the National Institutes of Health, the Department of Energy, and conducted by the National Research Council. You have been chosen for this study as part of a scientifically selected sample of individuals holding doctoral degrees. Your response is needed whether or not you are employed, living in the United States, or working in your field of degree. The results of this study will be used by government and academic institutions to make decisions in such areas as graduate student support and R&D funding; to anticipate surpluses or shortages in personnel; and to study the relationship between graduate education and career outcomes. Results from earlier studies have been used to identify trends in faculty composition, in time spent teaching and doing research, and in characteristics of academic and nonacademic employment. Please complete the enclosed survey form and return it in the postage-paid envelope as soon as possible. The information you provide is voluntary and will be kept strictly confidential. Findings will be reported only in the form of statistical summaries. If you have any questions about the survey, please call 1-(800)-248-8649 between 9:00 a.m. and 5:00 p.m. Eastern Daylight Time. We would be happy to talk with you. Thank you for your help. We look forward to receiving your questionnaire."}, {"section_title": "Enclosure 136", "text": "Sincerely,"}, {"section_title": "Bruce Alberts Chairman May 1995", "text": "A few days ago, we sent you a questionnaire for the 1995 Survey of Doctorate Recipients. If you have already completed and returned it, we thank you very much. The survey will help the federal government and others to ensure a sufficient supply of personnel trained to the doctoral level in a variety of fields. The information you provide is very important to the accuracy and success of the survey. If you have not yet had time to complete the questionnaire, please do so as soon as possible. If you need another copy of the questionnaire, please call toll free between 9 a.m. and 5 p.m., EDT, on 1- 800 About 6 weeks ago, we asked you to participate in a nationwide survey of doctorate recipients sponsored by the National Science Foundation. To the best of my knowledge, we have not yet received your completed Survey of Doctorate Recipients questionnaire. In case you did not receive the questionnaire or have misplaced it, we are enclosing a replacement copy. We are writing to you again to stress the significance that your response has for the overall accuracy of the results and the usefulness of the survey. We know that the experiences of people with doctoral degrees vary. To understand these differences, we need your response even if you are retired, not working, or working in a field not related to your doctoral degree. The survey provides timely information for businesses, government, and educational institutions. It helps these groups understand where and in what fields doctorate recipients work and where we should place priorities in a time of limited resources. Because not all questions will apply to everyone, you may be asked to skip certain questions."}, {"section_title": "SURVEY OF", "text": "In order to get comparable data, we will be asking you to refer to the week of April 15, 1995(e.g., April 9-15, 1995, when answering most questions. Follow all \"SKIP\" instructions AFTER marking a box. If no \"SKIP\" instruction is provided, you should continue to the NEXT question. Either a pen or pencil may be used. When answering questions that require marking a box, please use an \"X\". If you need to change an answer, please make sure that your old answer is either completely erased or clearly crossed out. Thanks again for your help, we really appreciate it."}, {"section_title": "140", "text": "PART A -Employment Status During the Week of April 15, 1995 Al . Were you working for pay (or profit) during the week of April 15, 1995? This includes a postdoctoral appointment, being self-employed or temporarily absent from a job (e.g., iliness, vacation, or parental leave), even if unpaid. 2 0 A secondary school or system 3 0 A 2-year college, junior college, or technical institute 4 0 A 4-year college or university, other than a medical school 5 0 A medical school (including universityaffiliated hospital or medical center) 6 0 A university-affiliated research institute 7 Activity SECOND MOST hours (Enter \"0\" if no second most) A29. In A28, did you record \"2\" or \"3\" or \"5\" or \"6\" (applied/basic research or developmenV design)? -1 0 Yes   Cl . Please review the JOB CATEGORIES LIST on pages 16-17. Using that list, please record codes in Column 1 for those job categories where you have had ONE OR MORE YEARS OF WORK EXPERIENCE since completing your (first) doctoral degree (a single job category code can represent several jobs). Next, complete Columns 2-5 for each job category recorded in Column 1. Example: Chris was a regional sales director for a computer hardware company between 1980 and 1986. In 1986 she was offered a job teaching marketing at a local college, something she had always wanted to try and that would allow more time with her family. Between 1986 and 1995, she had taught at three different colleges. Chris would enter:  C4. How much would (or does) your work benefit from each of the following? Mark (X) one for each C8. Since completing your (first) doctoral degree how many \"postdocs,\" if any, have you held? A \"postdoc\" (postdoctoral appointment) is a temporary position awarded in academe, industry, or government primarily for gaining additional education and training in research. As with all the information provided in this questionnaire, complete confidentiality will be provided. This person will only be contacted if we have trouble contacting you in 1997. Precision/production occupations (e.g., metal workers, woodworkers, butchers, bakers, printing occupations, tailors, shoemakers, photographic process) 404 Operators and related occupations (e.g., machine set-up, machine operators and tenders, fabricators, assemblers) 405 Transportation/material moving occupations 500 Other Occupations"}, {"section_title": "167", "text": "The National Science Foundation promotes and advances scientific progress in the United States by competitively awarding grants for research and education in the sciences, mathematics arid engineering. To get the latest information about program deadlines, to download copies of NSF publications, and to access abstracts of awards, visit the NSF Web site at: hitp://www.nsf.gov To order SRS publications, fill out order form, cut on dotted line, fold in half, tape, and drop in the mail. No postage is necessary. Form can also be sent via fax, at 703-306-0510."}]