[{"section_title": "", "text": "Multiply foot (ft) mile (mi) . Altitude, as used in this report, refers to distance above or below sea level."}, {"section_title": "IV CONTENTS", "text": ""}, {"section_title": "EXPLANATION OF THE SITE-NUMBERING SYSTEM", "text": "Well locations in the NITROGEN.DAT and the WTRLVL.DAT files in the DATAJDTHER directory are specified by latitude and longitude in degrees, minutes, seconds, and by a local site-numbering system, which is the public land-survey location in Oklahoma. The local site-numbering system consists of the township number, north or south; range number, east or west; and the section number. Each section is divided into four quarters, A, B, C, and D. The township numbers are north of the third parallel and the range numbers are west of the Indian Meridian. A section is equal to one square mile and fractional parts are given from larger to smaller areas of the section. The final digit (1) "}, {"section_title": "ABSTRACT", "text": "The U.S. Environmental Protection Agency is working with the Caddo Indian Tribe to develop a Pesticide Management Plan to prevent contamination of ground water that may result from the registered use of pesticides. The purpose of this project was to assist the Caddo Indian tribe in developing a Pesticide Management Plan for about 900 square miles in parts of Caddo and Canadian Counties in Oklahoma by providing information about aquifer-sensitivity and groundwater vulnerability assessment methods and digital data that can be used to develop assessment maps.\nThe CD-ROM contains six digital datasets that describe various hydrologic components of the aquifer: aquifer boundaries, ground-water level elevations, hydraulic conductivity, net recharge, surficial geology, and land-surface elevations, and eight data files that describe physical and cultural features and boundaries in the study area. Additionally, the CD-ROM contains files of depth to ground-water measurements and nitrogen concentration in ground water, retrieved from the U.S. Geological Survey National Water Information System data base. The report also describes digital data and information from other sources that can be used with assessment methods. An annotated list of aquifer sensitivity and ground-water vulnerability assessment methods and a list of pesticides associated with some of the crops grown in Caddo County are included."}, {"section_title": "INTRODUCTION", "text": "The Rush Springs aquifer is a source of drinking water in most of Caddo County and the southwestern part of Canadian County. Various pesticides are applied to croplands that constitute more than a third of the land in Caddo County. The U.S. Environmental Protection Agency (EPA) is working with the Caddo Indian tribe to develop a Pesticide Management Plan to prevent contamination of ground water that may result from the use of registered pesticides. An important component in the development of a Pesticide Management Plan is ascertaining where the Rush Springs aquifer may be sensitive and where ground water may be vulnerable to contamination.\nThis project was developed through an interagency agreement between the EPA and the U.S. Geological Survey. The purpose was to assist the Caddo Indian tribe in developing a Pesticide Management Plan for about 900 square miles in parts of Caddo and Canadian Counties in Oklahoma ( fig. 1) , by providing information about aquifer-sensitivity and ground-water vulnerability assessment methods and digital data that can be used to develop assessment maps."}, {"section_title": "Purpose and Scope", "text": "The purpose of this report is to provide information on aquifer sensitivity and ground-water vulnerability assessment methods and to provide a CD-ROM with previously published digital data and other information that can be used to develop assessment maps for the study area. The project involved modifying digital data published by the U.S. Geological Survey, retrieving data from the U.S. Geological Survey National Water Information System (NWIS) data base, and locating other information that describes the Rush Springs aquifer or other features in the study area. The CD-ROM contains six digital datasets that describe various hydrologic components of the aquifer: aquifer boundaries, ground-water level elevations, hydraulic conductivity, net recharge, surficial geology, and land-surface elevations, and eight data files that describe physical and cultural features and boundaries in the study area. Additionally, the CD-ROM contains files of nitrogen concentration in ground water and depth to ground-water measurements retrieved from the NWIS data base. This report also describes digital data and information from other sources that can be used with assessment methods. An annotated list of aquifer sensitivity and ground-water vulnerability assessment methods and a list of pesticides associated with some of the crops grown in Caddo County are included."}, {"section_title": "Description of Study Area", "text": "The study area is about 900 square miles in the northern two thirds of Caddo County and the southwestern comer of Canadian County. The southern boundary is the Washita River ( fig. 2) , which drains most of the study area and the northern boundary is the Canadian River, which drains the far northern part of the study area.\nThe Rush Springs aquifer is the most important source of ground water for irrigation, livestock and domestic uses in Caddo County. The total estimated ground-water withdrawals in 1995 for Caddo County was 32.10 million gallons per day. About 29.27 million gallons per day were withdrawn for irrigation and 1.15 million gallons per day were withdrawn for water supply (Tortorelli, 1999 , tables 1 and 4).\nThe study area lies in the rolling plains of westcentral Oklahoma. Agriculture is the primary land use. In 1998, about 46 percent of the land in Caddo County was used for cropland, about 8 percent of which was irrigated; about 23 percent of the land was used for pasture land; and about 20 percent was used for rangeland (U.S. Department of Agriculture, 1999d) (table  1) . Wheat, sorghum, peanuts, and smaller amounts of soybeans, cotton, and corn are the principal crops.\nThe Rush Springs aquifer in the study area comprises the Rush Springs Formation, and overlying terrace and alluvial deposits along parts of the Canadian and Washita Rivers. Underlying the Rush Springs Formation is the Marlow Formation, a confining unit composed of interbedded sandstones, siltstones, mudstones, gypsum-anhydrite, and dolomite (Decker and Runkle, 1998) . The Rush Springs Formation is described as a massive to highly cross-bedded sandstone with some interbedded dolomite or gypsum (Becker, and Runkle, 1998, p. 7) . The terrace and alluvial deposits are composed of unconsolidated layers of gravel, sand, silt, and clay. The thickness of the Rush Springs Formation increases in a south-southwesterly direction and is thinnest along the northeastern boundary of the study area, where it has been truncated by erosion. The southwestern boundary of the aquifer is defined as the Washita River (Becker and Runkle, 1998, p. 3) because a high dissolved mineral content in the ground water limits use southwest of the river."}, {"section_title": "Acknowledgments", "text": "The author thanks the Caddo Indian Tribe of Oklahoma for their cooperation."}, {"section_title": "VULNERABILITY ASSESSMENT METHODS AND SELECTION CONSIDERATIONS", "text": "Assessment methods can be divided into two general categories: aquifer sensitivity and groundwater vulnerability (U.S. Environmental Protection Agency, 1993). Considerations when selecting an assessment method include: the scale and size of the area to be assessed, intended use of the results, availability and suitability of data required by assessment method, availability of software and hardware, and technical expertise available to conduct the assessment.\nAquifer sensitivity methods provide information about aquifer susceptibility or risk of pollution. These assessment methods usually consider the following geohydrologic components: depth to water, land slope, net recharge, soil characteristics, vadose zone characteristics, and aquifer lithology. Ground-water vulnerability methods consider additional components, including pesticide characteristics and soil properties. Pesticide characteristics include solubility, water to organic carbon partitioning ratio, and half-life. Organic carbon content and infiltration rate are the most important soil properties affecting the movement of pesticide into the ground water. Other components used by ground-water vulnerability methods may include: agricultural practices and method of pesticide application. Some of the documented aquifer sensitivity and ground-water vulnerability assessment methods, the data requirements, and a description of the method are shown in Appendices 1 and 2. The scale and size of area to be assessed should be considered when selecting an assessment method. Aquifer sensitivity methods are generally more appropriate for screening large areas (more than one county) or comparing the sensitivity of one aquifer to another. The data required for aquifer sensitivity methods are commonly small scale and generalize broad areas. At a subcounty level, ground-water vulnerability assessment methods may be more suitable. These methods focus on smaller areas and account for chemical and physical properties of soil and pesticide usage. The two methods can be used together in steps and at different scales. For example, an aquifer sensitivity method can be used to assess large areas. After sensitive areas have been located, large-scale data layers can be constructed that describe soil properties and pesticide usage to assess the ground-water vulnerability to contamination. The advantage of making separate maps is the ability to update the data layers for the ground-water vulnerability maps as information is collected or changed.\nThe use of the end product is considered when selecting an assessment method. The results should be easily interpreted and provide the information needed to manage a pesticide program. Some methods, for example DRASTIC (Aller and others, 1987) , show relative numerical scores that represent degree of potential for contamination. Other methods use a specific number of classes with sensitivity ratings. The VULPEST model produces a set of probability results (Villeneuve and others, 1990) .\nThe availability and suitability of data required for the assessment method is another important consideration. Some methods require data available from publications or data bases, such as depth to water, aquifer lithology, or slope of the land surface. Other models require crop management, transpiration, or hydrologic processes, which may be difficult to define or understand. Additionally, the format, accuracy, completeness, and scale of the data must be suitable to use.\nComputer software and knowledge about geographic information systems is needed to construct most assessment models; and the ability to understand and interpret data that may relate to hydrogeology, soils, pesticides, and agronomic practices."}, {"section_title": "PREVIOUS AQUIFER SENSITIVITY ASSESSMENT OF THE RUSH SPRINGS AQUIFER", "text": "The aquifer sensitivity assessment method DRASTIC (Aller and others, 1987) was used by Osborn and others (1998) to assess the sensitivity of major aquifers in Oklahoma, including the Rush Springs. The map, based on a grid cell size of 3,150 x 3,150 feet (960 x 960 meters) or about 227 acres, is shown for the study area in figure 3 .\nThe DRASTIC method compiles seven physical and geohydrologic characteristics of the aquifer: depth to water, net recharge, aquifer media, soil media, slope of topography, effect of the vadose zone, and hydraulic conductivity of the aquifer. The assessment method produces a map showing index numbers that represent a relative measure of aquifer sensitivity. The DRASTIC indices for the Rush Springs in the study area ranged from 70 to 139; less sensitive areas are represented by lower numbers, more sensitive areas are represented by higher numbers ( fig. 3 )."}, {"section_title": "CD-ROM DATA FORMATS", "text": "The CD-ROM has six digital datasets describing the Rush Springs aquifer and eight digital datasets describing physical and cultural features and boundaries. Twelve of the datasets were previously published (table 2) and are available from the Internet. The datasets on the CD-ROM have been cropped from the original maps to encompass only the study area, except for COUNTY, which contains all the county boundaries in Oklahoma and WATRSHD, which contains the watershed boundary that encompasses the study area.\nNitrogen-ion concentrations in ground water and depth to ground-water measurements were retrieved from the U.S. Geological Survey NWIS data base and are in the files NITROGEN.DAT and WTRLVL.DAT in the DATA_OTHER directory. Table  2 shows the directory organization on the CD-ROM."}, {"section_title": "6", "text": "A compilation of existing data for aquifer sensitivity and ground-water vulnerability assessment in parts of Oklahoma Figure 3. Aquifer-sensitivity map of the Rush Springs aquifer in the study area, parts of Caddo and Canadian Counties, Oklahoma, created by Osborn and others (1998) using DRASTIC aquifer-sensitivity method (Aller and others, 1987) and digital datasets created by Runkle and Rea (1997) . (Runkle and Rea, 1997) Ground-water level elevation contours (Runkle and Rea, 1997) Polygons of hydraulic conductivity values (Runkle and Rea, 1997) Polygons of recharge values (Runkle and Rea, .1997) Surficial geologic features (Cederstrand, 1996) Digital representation of land surface (U.S. Geological Survey, 1999)\nCounty boundaries (Rea and Becker, 1997) Land-surface elevation contours (Rea and Becker, 1997) Names of physical and cultural geographic features from 7.5-minute topographic quadrangles (Rea and Becker, 1997) Index of 7.5-minute topographic quadrangles (Rea and Becker, 1997) Roads, highways, and address ranges (Rea and Becker, 1997) Streams, rivers, and lakes (Rea and Becker, 1997) Township, range, and sections (Rea and Becker, 1997) 8-digit watershed boundary (Rea and Becker, 1997) Nitrogen-ion concentrations measured in ground water\nDepth to ground-water measurements \\DOCUMENT\\ 'FILE'.TXT Metadata files for each digital data layer in the ARC_DATA directory and descriptive text files for the two data files in the DATA_OTHER directory 8 A compilation of existing data for aquifer sensitivity and ground-water vulnerability assessment in parts of Oklahoma The digital data are provided in a PC ARC/INFO (ESRI, 1998) export-file format (.eOO). Complete documentation files are in the DOCUMENT directory. The documentation files comply with the Federal Geographic Data Committee Content Standards for Digital Geospatial Metadata (FGDC, 1998) The metadata files contain detailed descriptions of the datasets, and include narrative sections describing the procedures used to produce the datasets in digital form. The text files for NITROGEN.DAT and WTRLVL.DAT in the DATA_OTHER directory include a narrative section describing the data and formats.\nThe digital data are in the Albers Equal Area map projection (Snyder, 1987) (table 3) . The table provides map projection information. aquifer in the study area. The data layer represents the hydrologic boundaries of the Rush Springs aquifer used in a ground-water flow model (Decker, 1998) . The aquifer in the study area for the ground-water flow model, was considered to be composed of the Rush Springs Formation and overlying terrace and alluvial deposits along parts of the Canadian and Washita Rivers (Decker and Runkle, 1998) . Some of the aquifer boundaries were produced from a 1:250,000-scale surficial geology map (Carr and Dergman, 1976) .\nThe metadata contains more information about the AQDOUND file in the DOCUMENT directory. The original map extent of the AQDOUND file can be downloaded and the metadata viewed on the Internet at URL http://water.usgs.gov/pubs/ofr/ofr96-453/index.html"}, {"section_title": "DIGITAL DATA DESCRIBING THE RUSH SPRINGS AQUIFER", "text": ""}, {"section_title": "Aquifer Boundaries", "text": "The AQDOUND file (Runkle and Rea, 1997) contains digitized boundaries for the Rush Springs"}, {"section_title": "Ground-Water Level Elevation Contours", "text": "Depth to water (thickness of the unsaturated zone or vadose zone) is the distance in feet from land surface to the water table. Depth to water is a hydrologic parameter used in many aquifer sensitivity and ground-water vulnerability assessment methods. Generally, the closer the ground water is to land surface, the more susceptible it is to contamination from pesticides or fertilizers.\nThe WLELEV file (Runkle and Rea, 1997 ) contains digitized ground-water level elevation contours for the Rush Springs aquifer. The contours represent water-level eleva-tions in the aquifer prior to 1950, before the aquifer was developed for irrigation. A map showing the contours was originally published at a scale of 1:250,000 in a ground-water modeling report (Becker, 1998, fig. 4) . A map showing more recent ground-water level elevation contours (1986 to 1991) was published by Becker and Runkle (1998, fig. 8 ).\nDepth to water is calculated by subtracting ground-water level elevations from land-surface elevations. A geographic information system was used to subtract the data layer WLELEV from a digital representation of the land surface for the DRASTIC aquifer-sensitivity assessment of the Rush Springs aquifer (Osborn and others, 1998) . The National Elevation Dataset, referred to as NED on the CD-ROM, is a digital representation of the land surface.\nThe metadata contains more information about the WLELEV file in the DOCUMENT directory. The original map extent of the WLELEV file can be downloaded and the metadata viewed on the Internet at URL http://water.usgs.gov/pubs/ofr/ofr96-453/index.html"}, {"section_title": "Hydraulic Conductivity", "text": "Hydraulic conductivity describes the ability of an aquifer to transmit water and may be expressed in feet per day. An aquifer having a high hydraulic conductivity would allow ground water (and pesticides) to move at a faster rate than an aquifer having a lower hydraulic conductivity. Hydraulic conductivity for the Rush Springs aquifer, ranges from 0.8 to 10.0 feet per day (0.24 to 3.05 meters per day).\nThe COND file (Runkle and Rea, 1997) contains digitized polygons attributed with constant hydraulic conductivity values based on a grid cell size of 9,843 x 9,843 feet (3,000 x 3,000 meters). The data were used as input for the ground-water flow model of the Rush Springs aquifer (Becker, 1998) and were published in the model report (Becker, 1998, fig. 7 ). The COND dataset was used in the DRASTIC aquifersensitivity assessment of the Rush Springs aquifer (Osborn and others, 1998) . The grid cells were resized to 960 x 960 meters (3,150 x 3,150 feet) for the assessment.\nThe hydraulic conductivity values represented in the COND file are based on specific capacity data and aquifer tests (Becker, 1998, p. 3) . The values represent areal generalizations and do not reflect local variability of the aquifer. As a result, the value attributed to a grid cell may not accurately reflect the hydraulic conductivity of the aquifer within the cell. A large-scale vulnerability assessment may require field mapping or using aerial photographs to better define the extent of permeable sediments along creeks and rivers that were not included in the model.\nThe metadata contains more information about the COND file in the DOCUMENT directory. The . original map extent can be downloaded and the metadata viewed on the Internet at URL http://water.usgs.gov/pubs/ofr/ofr96-453/index.html"}, {"section_title": "Net Recharge", "text": "Aquifer recharge is a hydrologic parameter used in some assessment methods. Recharge describes the amount of water that enters an aquifer and is expressed as inches per year. Under normal conditions, an aquifer is in a state of equilibrium, meaning that the volume of water that enters the aquifer is equal to the amount discharged from the aquifer. Recharge is affected by precipitation, runoff, evapotranspiration, and vertical hydraulic conductivity of the soils and sediments in the unsaturated zone.\nThe RECHARG file (Runkle and Rea, 1997) contains digitized polygons attributed with constant recharge values based on a grid cell size of 9,843 x 9,843 feet (3,000 x 3,000 meters). The data were used as input for the ground-water flow model of the Rush Springs aquifer and are published in the model report (Becker, 1998, fig. 8 ). The RECHARG dataset was used as a data layer in the DRASTIC aquifer-sensitivity assessment of the Rush Springs aquifer (Osborn and others, 1998) . The grid cells were resized to 3,150 x 3,150 feet (960 x 960 meters) for the assessment.\nThe recharge values used in the ground-water flow model and presented in the RECHARG file are based on stream discharge measured at sites in drainage basins in the Rush Springs study area during low-flow periods in March 1989 and February 1991 (Becker, 1998 "}, {"section_title": "Surficial Geology", "text": "The lithology of the aquifer can play an important role in aquifer vulnerability to pesticides. For example, very vulnerable aquifers such as terrace and alluvial deposits and karstic limestone, typically have high vertical hydraulic conductivities and are more likely to allow the downward movement of pesticides into the aquifer than less vulnerable aquifers with lower hydraulic conductivities such as shales or silty sandstones.\nThe GEOLOGY file contains digital data for a l:250,000-scale surficial geology map (Cederstrand, 1996) . The GEOLOGY file shows the location and contacts of formations and overlying terrace and alluvial deposits in the study area. The GEOLOGY file was used to create data layers describing aquifer media and effect of the vadose zone for the DRASTIC aquifer-sensitivity assessment of the Rush Springs aquifer (Osborn and others, 1998) . The grid cell size for the model was 3,150 x 3,150 feet (960 x 960 meters).\nThe metadata in GEOLOGY.TXT in the DOCUMENT directory provides additional information about the data file and geologic descriptions of the formations depicted on the map. The original map extent of the GEOLOGY file can be downloaded and the metadata viewed on the Internet at URL http://ok.water.usgs.gov/gis/geology/index.html"}, {"section_title": "National Elevation Dataset, NED", "text": "The NED file is a high resolution digital representation of the land surface. This dataset was developed in a seamless raster format with a grid cell size of 98.43 x 98.43 feet (30 x 30 meters) (U.S. Geological Survey, 1999).\nThe NED file can be used to construct two data layers describing hydrologic components of the aquifer. The first layer is the percent slope of land surface, which is an important factor in assessing rates of runoff. Precipitation that falls on an area having a high slope may runoff into streams or creeks instead of infiltrating into the aquifer. The second data layer is thickness of the unsaturated zone. The NED file can be used to construct a digital representation of the land surface from which a data layer representing groundwater level elevations can be subtracted, as described in the WLELEV section.\nThe metadata contains more information about the NED file in the DOCUMENT directory. "}, {"section_title": "DIGITAL DATA DESCRIBING THE STUDY AREA", "text": "Eight files on the CD-ROM in the DATA_ARC directory contain digital data describing physical and cultural features and boundaries in the study area. The data files were originally published by Rea and Decker (1997) and are available for all 77 counties in Oklahoma. The datasets are based on l:100,000-scale source maps and can be used for project planning and management, data organization, and map making. The COUNTY file contains county boundaries and names. The ELEVCON file contains land-surface elevation contours in meters and feet above the National Geodetic Vertical Datum of 1929. The NAMES file contains the names and locations of physical and cultural geographic features of the U.S. Geological Survey 7.5-minute topographic quadrangles. The QUAD24 file contains an index for the U.S. Geological Survey 7.5-minute topographic quadrangles with boundaries and names. The ROADS file contains highways, roads, and addresses. The STREAMS file contains streams, rivers, lakes, and other surface-water features (names of the surfacewater features are in the NAMES file). The TNRGSEC file contains township, range, and section line boundaries and numbers. The WATERSHD file contains the area, boundary, and hydrologic-unit codes, for the 8-digit watershed boundary that encompasses the study area."}, {"section_title": "ADDITIONAL SOURCES OF INFORMA-TION", "text": "Additional sources of information on pesticides, nitrogen-ion concentrations, land use and land cover, soils, and depth to ground-water measurements are described in this section. Pesticide usage information for the study area is only available at a county level. Nitrogen-ion concentrations in ground water for the study area are in a file on the CD-ROM and may help locate areas where the aquifer is sensitive to contamination. Digital datasets for land use and land cover, and soil characteristics are available for the study area at a scale of 1:20,000."}, {"section_title": "Pesticide Use and Pesticide Concentrations in Surface Water, Ground Water, and Streamside Seeps", "text": "Pesticides are applied to the soil and plant foliage to control weeds, fungus, insects, and nematodes in the study area. County-level pesticide use information is available from the U.S. Department of Agriculture, U.S. Geological Survey, and Oklahoma State University County Extension Service. The county-level information is limited and does not provide pesticide usage for specific crops, the application rates, or the application locations. Available measurements of pesticide concentrations in surface water, ground water, and streamside seeps for the study area were limited.\nThe U.S. Department of Agriculture, 1997 Census of Agriculture provides an estimate of the number of acres and farms that pesticides and fertilizers were applied to in Caddo County (U.S. Department of Agriculture-National Agricultural Statistics Service, 1999). The census shows that in 1997 herbicides were applied on 131,757 acres of crops and pasture land and insecticides were applied on 48,719 acres of hay and other crops in Caddo County (table  4) .\nA report by Battaglin and Goolsby (1994; originally reported in Gianessi and Puffer, 1991) compiles annual use estimates of 96 herbicides for all counties in the conterminous United States for 1989. The data are published as digital data and are intended for estimating regional herbicide use, and for producing maps showing relative rates of herbicide use across broad regions (Battaglin and Goolsby, 1994) . Table 5 shows use estimates from the report for 26 herbicides, including atrazine, metolachlor, and simazine, in Caddo County. Use estimates show that 2,4-D and Other types of pesticides used in Caddo County include fungicides, insecticides, and nematocides. A list of pesticides associated with wheat, peanuts, and corn production and commonly used in Caddo County is provided in Appendix 3 (David Nowlin, Oklahoma Cooperative Extension Service, Division of Agricultural Sciences and Natural Resource, Caddo County, written commun., 1999) . This list shows that in addition to the herbicides on table 5, the herbicides trisulfuron and imazethapyr are commonly used in Caddo (. County.\nThe U.S. Geological Survey, Pesticide National Synthesis Project, reported that the most commonly found pesticides in ground water in agricultural areas were atrazine, deethylatrazine (a breakdown product of atrazine), metolachlor, and simazine (U.S. Geological Survey, 1998, table 7). At the time of this report (1999), there have been few ground-water samples analyzed for pesticides in Caddo County. Consequently, the extent and scope of pesticides in ground water is unknown. No analyses for pesticides in the study area were available from the U.S. Geological Survey NWIS data base. Ten analyses from the Oklahoma Department of Environmental Quality showed no detectable concentrations of pesticides in groundwater samples. The samples were taken from private wells and distribution points for public supply wells. Eight wells were sampled in 1995 and two wells were sampled in 1996 (Jay Wright, Oklahoma Department of Environmental Quality, written commun., 1999).\nPesticides have been detected in creeks and streamside seeps in the Fort Cobb Reservoir watershed. Oklahoma Department of Agriculture personnel sampled surface water north of Fort Cobb Reservoir at four sites along Lake Creek and one site along North Eakley Creek 11 times from April to October 1990 ( fig. 2 and Table 6 shows the pesticides detected. The four most commonly detected pesticides in surface water were aldicarb, alachlor, triclopyr, and carbofuran. The four most commonly detected pesticides in streamside seeps were aldicarb, alachlor, carbofuran, and 2,4-D (Chris Hise, Oklahoma Conservation Commission, written commun., 1999)."}, {"section_title": "Nitrogen-Ion Concentrations", "text": "A potentially large nonpoint source of nitrogen in ground water is synthetic nitrogen fertilizer in Caddo County. Nitrogen is applied to croplands as anhydrous ammonia, ammonium nitrate, urea, and ammonium sulfate. A yearly application rate of 10.52 tons of nitrogen fertilizer per square mile in Caddo County was estimated by Battaglin and Goolsby (1994) from nitrogen-fertilizer sales for Caddo County between 1986 and 1991. The sales data reflect the total sales of fertilizer in Caddo County and do not consider the land use for which it was bought, or the county where the fertilizer was used (Battaglin and Goolsby, 1994) .\nNitrate, the predominant nitrogen ion in water, is the most widespread agricultural contaminant found in drinking water. Nitrate concentrations can be used as an indicator of general ground-water quality and may be useful in predicting where the ground water is vulnerable to pesticides in agricultural areas (U.S. Environmental Protection Agency, 1996, p. 15) .\nNitrate is known to exceed the U.S. Environmental Protection Agency primary drinking water standard for nitrate of 10 milligrams per liter as nitrogen (U.S. Environmental Protection Agency, 1999) in ground water in Caddo County. Nitrogen concentrations measured in ground water were retrieved from the U.S. Geological Survey NWIS data base. Figure 4 shows the locations of the 135 wells sampled and the 47 wells in which nitrogen-ion concentrations exceeded the primary drinking water standard. These data sites and associated nitrogen-ion concentrations are in the NITROGEN.DAT in the DATA_OTHER directory. The data are in a comma-delimited text format and consist of a location for each site defined by latitude and longitude in degrees, minutes, seconds, date of sample, a site identification number, a legal sample, a site identification number, a legal location, and the measured concentrations in milligrams per liter. The file NITROGEN.TXT in the DOCUMENT directory contains information about the file structure and how nitrogen concentrations are reported."}, {"section_title": "Land Use and Land Cover", "text": "Land use and land cover data can provide information about where pesticides and fertilizer may be applied, where crops are irrigated, or where urban development occurs. The National Land Cover datasets are high resolution digital data describing ., land cover for the conterminous United States. The data were developed as part of the Multi-Resolution < Land Characteristics Consortium, an interagency : project involving the U.S. Geological Survey, U.S. A Environmental Protection Agency, National Oceanographic and Atmospheric Administration, and the U.S. Forest Service. Land cover was mapped using 21 general land cover classes and is based upon 30-meter Landsat thematic mapper satellite data. The data are organized by state and can be downloaded and the metadata viewed on the Internet at URL http://www.epa.gov/mrlc/nlcd.html "}, {"section_title": "16", "text": "A compilation of existing data for aquifer sensitivity and ground-water vulnerability assessment in parts of Oklahoma\nCurrently (2000) the National Land Cover Data set describing land use for Oklahoma was preliminary and the accuracy assessment of the dataset was not completed.\nDigital data describing land use and land cover are available from the U.S. Department of Agriculture at a scale of 1:20,000 for the study area. The Map Information Assembly and Display System (MIADS) Land Use/Land Cover dataset was developed between 1981-1988 from aerial photography and is described as a general purpose dataset (U. "}, {"section_title": "Soils", "text": "The physical and chemical properties of soils help determine the transport of pesticides into the ground water. Pesticide adsorption onto soil is dependent on chemical properties of the pesticide and properties of the soil, such as pH, organic carbon content, infiltration rate, and clay content. Two digital soil geographic data bases containing soil property data are available for the study area. The Map Information Assembly and Display System/Map Unit Interpretation Database (MIAD/MUIR) and State Soil Geographic Database (STATSGO) were developed by and are available from the U.S. Department of Agriculture-National Resource Conservation Service.\nThe MIAD geographic (U.S. Department of Agriculture-National Resource Conservation Service, 1999) and the MUIR soil attribute (U.S. Department of Agriculture-National Resource Conservation Service, 1999b) data bases have a mapping scale of 1:20,000 and are appropriate for county and subcounty level projects. The MUIR data base contains the soil property attributes and is related to the soil unit polygons in MIAD by the soil unit symbol. Each soil unit or soil cell in the MIAD data base represents a soil that is composed of multiple layers with each layer having a high and a low value for each soil property. When using the MIAD data base, a weighted vertical average for the desired soil property for each soil cell must be calculated so each soil cell has only one value for each soil property (Alan Rea, U.S. Geological Survey, oral commun., 1999) .\nThe STATSGO geographic data base (U.S. Department of Agriculture-National Resource Conservation Service, 1999c) was made by generalizing the county soil survey maps (U.S. Department of Agriculture, 1973 Agriculture, , 1976 and is not appropriate for countylevel decisions. STATSGO is mapped at a scale of 1:250,000, and was designed for regional, state, or multi-state planning. The STATSGO digital soil surveys were used to calculate the DRASTIC ratings for soils overlying the Rush Springs aquifer by Osborn and others (1998) ."}, {"section_title": "Depth to Ground-Water Measurements", "text": "Six hundred forty-two measurements of depth to water from land surface in the study area are in the file WTRLVL.DAT in the DATA_OTHER directory on the CD-ROM. The depth to water measurements were retrieved from the U.S. Geological Survey NWIS data base and were collected between 1986 and 1999 by the U.S. Geological Survey. The data in WTRLVL.DAT are in a comma delimited text format and consist of a location for each site defined by latitude and longitude in degrees, minutes, seconds, a site identification number, a legal location, and the depth to water in feet. The average depth to water was calculated for wells having more than one measurement. The WTRLVL.TXT file in the DOCUMENT directory on the CD-ROM contains more information about the WTRLVL.DAT file."}, {"section_title": "SUMMARY", "text": "The U.S. Environmental Protection Agency is working with the Caddo Indian tribe to develop a Pesticide Management Plan to prevent contamination of ground water that may result from the registered use of pesticides. An important component in the development of a Pesticide Management Plan is ascertaining where the Rush Springs aquifer may be sensitive and where ground water may be vulnerable to contamination.\nThe purpose of this report is to provide information on aquifer sensitivity and ground-water vulnerability assessment methods and to provide a CD-ROM with previously published digital data and other information that can be used to develop assessment maps for the study area.\nAssessment methods can be divided into two general categories: aquifer sensitivity and groundwater vulnerability. Considerations when selecting an assessment method include: the scale and size of the area to be assessed, intended use of the results, availability and suitability of data required by assessment method, availability of software and hardware, and technical expertise available to conduct the assessment.\nThe CD-ROM associated with the report contains six data files that describe various hydrologic components of the aquifer: aquifer boundaries, ground-water level elevations, hydraulic conductivity, net recharge, surficial geology, and land-surface elevations, and eight data files that describe physical and cultural features and boundaries in the study area. Additionally, the CD-ROM contains files of nitrogen concentration in ground water and depth to groundwater measurements, retrieved from the U.S. Geological Survey National Water Information System data base.\nCounty-level pesticide use information is available from the U.S. Department of Agriculture, U.S. Geological Survey, and Oklahoma State University County Extension Service. In 1998, herbicides were applied on 131,757 acres of crops and pasture land and insecticides were applied on 48,719 acres of hay and other crops in Caddo County. Pesticide use estimates show that 2,4-D and chlorsulfuron were applied to the largest number of acres and 2,4-D and metolachlor were used in the largest amounts in Caddo County in 1989.\nCurrently (2000), there have been few groundwater samples analyzed for pesticides in Caddo County. Consequently, the extent and scope of pesticides in ground water is unknown. Pesticides have been detected in creeks and streamside seeps in the Fort Cobb Reservoir watershed. The Oklahoma Department of Agriculture detected atrazine in North Eakley Creek in April 1990, and at four sites along Lake Creek in June 1990. Oklahoma Conservation Commission sampled five streamside seeps and five surface-water locations along Lake Creek between August 1998 and September 1999. The four most commonly detected pesticides in surface water were aldicarb, alachlor, triclopyr, and carbofuran. The four most commonly detected pesticides in streamside seeps were aldicarb, alachlor, carbofuran, and 2,4-D.\nThe National Land Cover datasets are high resolution digital data describing land cover for the conterminous United States. Land cover was mapped using 21 general land cover classes and is based upon 30-meter Landsat thematic mapper satellite data. The data are organized by state and can be downloaded from the Internet.\nTwo digital soil geographic data bases containing soil property data are available for the study area. The Map Information Assembly and Display System/Map Unit Interpretation Database and State Soil Geographic Database were developed by and are available from the U.S. Department of Agriculture-National Resource Conservation Service. od a c c o u n t s for whe t he r the pot ent i al s o u r c e of c o n t a mi n a n t i"}, {"section_title": "SELECTED REFERENCES", "text": "; nt r a t e d or di s pe r s e d. me t hod e v a l u a t e s soil a t t e n u a t i o n pot e nt i a l s wi t hi n s e l e c t e d onsi n c o u n t i e s . A t t e n u a t i o n pot e nt i a l s are pr e s e nt e d on count a-ŝŵ "}]