[{"section_title": "INTRODUCTION 1", "text": "As part of its mission to save lives and protect property, the National Weather Service (NWS) issues coastal flood watches and warnings for flooding caused by extra-tropical cyclones, events which can produce storm surge and waves on top of the normal tide cycle. To provide NWS forecasters with extra-tropical storm surge guidance, the NWS' Meteorological Development Laboratory (MDL) uses a modified version of the Sea Lake and Overland Surges from Hurricanes (SLOSH) model (Jelesnianski et al. 1992) to predict the impacts of extra-tropical storms. SLOSH was modified in the 1990s to: (1) use the Global Forecast System (GFS) winds as input instead of a parametric wind model and (2) not compute overland flooding so it could run efficiently on operational computers. The result was the Extra-Tropical Storm Surge (ETSS) model (Kim et al. 1996), which runs operationally four times daily along the Gulf of Mexico and U.S. East, West, and Alaskan Coasts. As of October 2014, ETSS uses 0.5 degree GFS winds and pressure as inputs and creates hourly storm surge guidance out to 96 hours (Taylor et al. 2015). It performs well for both positive and negative surge events (negative surge occurs when strong offshore winds drive water levels below what they normally are at a given time) however; it does not simulate tides, waves, river effects, or overland flooding. NWS is moving beyond the coastal flood watch and warning to develop an experimental tropical storm surge watch and warning. Unlike the coastal flood watch and warning, the tropical storm surge watch and warning is intended to extend overland. NWS is also considering an extra-tropical storm surge watch and warning which will extend overland. * Corresponding Author: Huiqing Liu, 1325 East-West Hwy, #10328, Silver Spring, MD 20910-3280; phone: 301-427-9464; e-mail: huiqing.liu@noaa.gov MDL has recently enhanced the ETSS model to compute overland flooding from surge and provide guidance for future overland extra-tropical storm surge watches and warnings. Enhancements included: 1) Re-introducing the inundation algorithm based on storm surge. 2) Nesting the tropical and extra-tropical grids to leverage both the expanse of the large extratropical grids and the finer overland details contained within the tropical grids. The purpose of this study is to describe and evaluate the impact of these modifications to the ETSS model. The details of the inundation algorithm are described by Jelesnianski (Jelesnianski et al. 1992), so they are omitted here. Section 2 describes why and how the grids were nested. Section 3 describes historical storms and observations used for validation. Results are presented in section 4, and section 5 provides a discussion and summary."}, {"section_title": "NESTING GRIDS", "text": "One could ignore large extra-tropical grids and simply run the model using GFS winds on smaller tropical grids to provide overland flooding guidance. While such an approach is computationally more efficient, it is also less accurate. Computing on the larger grid allows the model to capture (a) the impact of winds located outside the tropical grid domain (necessary for both extra-tropical and large tropical storms), and (b) the storm surge fore-runner phenomena caused by disrupting circulation patterns. Via the boundary conditions, the model then provides this information to the smaller tropical grids which have the necessary resolution to compute overland flooding. Currently, thirty tropical grids exist on the US East Coast and Gulf of Mexico 2 , where they are nested with two extra-tropical grids (Fig. 1). Nesting grids involves running the model on extratropical grids to compute boundary conditions which it then uses while running on the tropical grids. The resulting 32 model runs (two with extratropical grids and 30 with tropical grids) are merged onto both (a) text products at various stations and (b) a gridded product. For station-based text products, the wet grid cell value closest to the station is used. If multiple tropical basins overlap at a station, the maximum value from any of the overlapping basins is used. The gridded product is created by taking the value (or maximum value when there is overlap) of the 30 tropical basin model runs. Model results from the two extra-tropical grids are only used if no tropical grids cover a particular station or area on the gridded product. Accurate prediction of overland flooding requires an accurate representation of overland features such as barriers, cuts, channels, etc. Due to the ephemeral nature of those features, their representation in the model must be updated frequently. Fortunately the Federal Emergency Management Agency (FEMA) funds the National Hurricane Program (NHP) to develop and maintain tropical grids for tropical evacuation studies. By utilizing the finer tropical grids for overland information, ETSS is able to leverage NHP work, thereby allowing ETSS to maintain accuracy without recurring costs"}, {"section_title": "VALIDATION", "text": "Four storms (Hurricane Irene-2011, Hurricane Sandy-2012, Extra-Tropical March-2013, and Extra-Tropical February-2013) were chosen to validate the performance of the model at 31 Center for Operational Oceanographic Products and Services (COOPS) tidal gauges (Fig. 2). While ETSS is intended to provide guidance for extra-tropical rather than tropical storms, including Hurricanes Sandy and Irene to expand the number of cases is justified here since both were large storms at landfall and Sandy was transitioning to extra-tropical. To reduce the impact of random errors within different wind forecast cycles on the model performance, five different forecast start times (00Z, 06Z, 12Z, 18Z on day one and 00Z on day two) were selected. Model performance was then assessed based on the average of the five model runs. A 48-h period for computing skill was chosen to include the peak surge event at all 31 stations. The first day of each storm was then chosen based on the criterion that the start of the 48-h period would correspond with the start of the second day. The first days for each storm were:  Aug 26, 2011 for Hurricane Irene-2011,  Oct 28, 2011 for Hurricane Sandy-2012,  Mar 5, 2013 for Extra-Tropical March-2013,  Feb 12, 2014 for Extra-Tropical February-2014 Three statistical scores were used to assess model performance: Fig. 2 indicates, ETSS outputs storm surge time series at a number of different stations. Only green stations were used to assess model performance for various reasons, including: (a) the station was retired, (b) the station failed during the storm, and (c) the station was too far from the storm to be affected."}, {"section_title": "RESULTS", "text": "Forecast hydrographs at select stations are shown in Figs. 3, 4, 5 and 6 for Hurricane Irene-2011, Hurricane Sandy-2012, Extra-Tropical March-2013 and Extra-Tropical February-2014, respectively. Results of the enhanced ETSS model (ETSS 2.0) more closely resembled observations (with the tide removed) than the operational version (ETSS 1.5). The figures indicate that ETSS 2.0 simulates peak surge with more skill than ETSS 1.5 at some stations. Simulating peak surge correctly is important during storm events as it is a key parameter that the model uses to determine inundation. NWS forecasters and emergency managers are particularly interested in peak surge simulations for determining how the storm will impact their respective areas of responsibility. Statistical scores (RMSE, PAE, and ME) are calculated at each of the 31 stations to avoid focusing on a select set of stations and to evaluate the overall performance of ETSS 2.0. The scores, which are then averaged per storm, are presented in Table 1. Blue numbers indicate that ETSS 2.0 out-performed ETSS 1.5 and some of them indicate significant improvement. Average RMSEs, PAEs and MEs all indicate improved performance of ETSS 2.0 over ETSS 1.5 for all four storms. For example, average RMSE for Hurricane Sandy-2012, improved by 0.24 feet or 20%, average PAE by 0.39 feet or 25% and average ME by 0.26 feet or 29%. Overall, PAE improved significantly (larger than 10%) in three of the four storms (Hurricane Irene-2011, Sandy-2012 and Extra-Tropical March-2013); ME improved significantly in two of the four storms (Hurricane Sandy-2012 and Extra-Tropical March-2013) and RMSE improved significantly in one of the four storms (Hurricane Sandy-2012)."}, {"section_title": "SUMMARY AND DISCUSSION", "text": "ETSS 2.0 showed improved performance over ETSS 1.5. The updated model predicted more accurate peak surge at most stations. Nesting tropical with extra-tropical computational grids leverages finer overland details contained within tropical grids. Resolution of coastal features is improved by the finer grid's updated bathymetry and topography without the sacrifice of wind information from outside the tropical grids. Likewise, re-introducing an inundation algorithm based on storm surge leads to a more realistic simulation and avoidance of storm surge bounce-back from the coastlines. A number of actions can be undertaken to further improve ETSS performance. In the near term, surge and tide nonlinear interactions will be incorporated by introducing a tidal algorithm. That work will benefit from previous efforts at MDL to add tide calculations to SLOSH (Hasse et al. 2012;Fritz et al. 2014). Additionally, the separate Bering Sea and Arctic computational grids will be replaced with a single new grid, allowing water to flow through the Bering Strait and providing overland guidance for West and North Alaska. In the long term, MDL may improve ETSS to: (a) model the impacts of waves and river flow on storm surge, (b) adopt spatially varying surface wind drag coefficients dependent on sea surface roughness and wind speed, and (c) utilize spatially varying bottom friction coefficients dependent on different types of sea bottoms and water depth.     Wind forcing is an important factor for storm surge models to correctly predict storm surge and flooding. However, errors will always exist in input wind and pressure forecasts for both tropical and extra-tropical storms. Therefore, as with Probabilistic Hurricane Storm Surge (Taylor and Glahn 2008;Taylor et al. 2014), MDL plans to develop Probabilistic Extra-Tropical Storm Surge (P-ETSS) guidance. P-ETSS will be initially based on the 21 GFS wind ensemble members but it will be scalable to include other ensemble members."}]