[{"section_title": "Abstract", "text": "BACKGROUND-Although the increased prevalence of childhood obesity in the United States has been documented, little is known about its incidence. We report here on the national incidence of obesity among elementary-school children.\nClass of 1998-1999, a representative prospective cohort of 7738 participants who were in kindergarten in 1998 in the United States. Weight and height were measured seven times between 1998 and 2007. Of the 7738 participants, 6807 were not obese at baseline; these participants were followed for 50,396 person-years. We used standard thresholds from the Centers for Disease Control and Prevention to define \"overweight\" and \"obese\" categories. We estimated the annual incidence of obesity, the cumulative incidence over 9 years, and the incidence density (cases per person-years) overall and according to sex, socioeconomic status, race or ethnic group, birth weight, and kindergarten weight.\nRESULTS-When the children entered kindergarten (mean age, 5.6 years), 12.4% were obese and another 14.9% were overweight; in eighth grade (mean age, 14.1 years), 20.8% were obese and 17.0% were overweight. The annual incidence of obesity decreased from 5.4% during kindergarten to 1.7% between fifth and eighth grade. Overweight 5-year-olds were four times as likely as normal-weight children to become obese (9-year cumulative incidence, 31.8% vs. 7.9%), with rates of 91.5 versus 17.2 per 1000 person-years. Among children who became obese between the ages of 5 and 14 years, nearly half had been overweight and 75% had been above the 70th percentile for body-mass index at baseline."}, {"section_title": "", "text": "during the first decade of the 21st century. 4, 5 Although trends in the prevalence of obesity are documented, surprisingly little is known about the incidence of childhood obesity. Examining incidence may provide insights into the nature of the epidemic, the critically vulnerable ages, and the groups at greatest risk for obesity. National data on the incidence of pediatric obesity to date have pertained only to adolescents transitioning to adulthood. A study that was based on data from the National Longitudinal Study of Adolescent Health showed that the 5-year cumulative incidence of obesity among persons who were 13 to 20 years of age in 1996 and 19 to 26 years of age in 2001 was 12.7%, ranging from 6.5% among Asian girls to 18.4% among non-Hispanic black girls. 6 However, since many of the processes leading to obesity start early in life, 7 data with respect to incidence before adolescence are needed.\nWe report here the incidence of obesity according to data from a large, nationally representative longitudinal study of children who were followed from entry into kindergarten to the end of eighth grade (ages 5 to 14 years); the study included direct anthropometric measurements at seven points between 1998 and 2007."}, {"section_title": "METHODS", "text": ""}, {"section_title": "STUDY POPULATION", "text": "We analyzed data from the Early Childhood Longitudinal Study, Kindergarten Class of 1998-1999, which was designed and conducted by the National Center for Education Statistics (NCES) of the Department of Education. The NCES selected a nationally representative cohort using multistage probability sampling, in which the primary sampling units were counties or groups of counties, the second-stage units were schools within the sampled units, and the third-stage units were students within schools. 8 The study enrolled 21,260 children who were starting kindergarten in the fall semester of 1998 (mean age, 5.6 years) and followed 9358 children through sequential phases of data collection, in 1999 (spring semester of kindergarten; mean age, 6 The survey included extensive data collection from caregivers, school staff, teachers, and children, along with direct measurements, as described previously. 8 Trained assessors measured children's height in inches (to the nearest 0.25 in.) with the use of a Shorr board and recorded weight in pounds with the use of a digital scale. For this analysis, in order to track the incidence of obesity, we selected variables -height, weight, and parent-reported age, sex, race or ethnic group, socioeconomic status, and birth weight -from among the variables in the restricted-use data set for children from kindergarten through eighth grade. The analytic sample consists of the 7738 children with data on these variables across phases of data collection."}, {"section_title": "EVALUATION OF DATA", "text": "We used the 2000 Centers for Disease Control and Prevention (CDC) Growth Charts to calculate each child's BMI, standardized to the reference population for the child's age and sex. 9 We determined cutoffs for normal weight, overweight, and obesity using the CDC's standard thresholds of the 85th percentile for overweight and 95th percentile for obesity. The use of alternative specifications with cutoffs set by the Child Obesity Working Group of the International Obesity Task Force 10 showed consistent results.\nWe calculated the prevalence of obesity as the proportion of all children in each age group who were obese. Incidence was defined as the occurrence of a new case of obesity in a child who was not previously obese. We calculated the incidence of obesity on the basis of the follow-up data for 6807 children who were not already obese in kindergarten and thus were at risk for incident obesity. We also calculated incidence proportions by dividing the number of newly obese children by the number of children at risk during the follow-up period. Because the intervals between the study phases varied, we calculated the annual incidence by dividing the incidence by the length of the interval between the study phases in years. Cumulative incidence shows the 9-year risk of obesity.\nIn prespecified alternative analyses, we calculated incidence density rates, which better account for the unequal intervals between study phases and nonconstant incidence according to age. We divided the number of new obesity cases by the number of person-years of follow-up, which was expressed as a rate per 1000 person-years. We measured person-years at risk using age in months, beginning at baseline and continuing either to the midpoint between the last study phase in which the child was not obese and the study phase in which incident obesity was noted or to the end of follow-up in eighth grade -whichever occurred first. 11"}, {"section_title": "STATISTICAL ANALYSIS", "text": "To assess the incidence of obesity in the major population groups, we stratified the estimates of prevalence and incidence according to sex, quintile of the kindergartners' household socioeconomic status, and race or ethnic group (non-Hispanic white, non-Hispanic black, Hispanic, or \"other\"). To understand the importance of weight early in life, we also stratified the data according to birth weight (<2500 g, 2500 to 3999 g, and ≥4000 g) and baseline weight in kindergarten (normal weight vs. overweight but not obese). To compare the risk of obesity between normal-weight and overweight children, we calculated risk ratios for the incidence of obesity in overweight kindergartners divided by the incidence in normal-weight kindergartners. Finally, we used logistic regression to determine clinically relevant predictive risks by calculating the marginal predicted probabilities of being obese in eighth grade as a function of the percentile of BMI and z score at younger ages.\nWe used variance estimates for constructing 95% confidence intervals with Taylor series linearization to account for the complex sample design. 12 We used longitudinal weights and survey adjustments constructed by the National Center for Education Statistics to make nationally representative inferences. All analyses were performed with the use of SUDAAN software, version 10.1 (Research Triangle Institute)."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "PREVALENCE OF OBESITY", "text": "When children were entering kindergarten, at a mean age of 5.6 years, 14.9% were overweight ( Table S1 in the Supplementary Appendix, available with the full text of this article at NEJM.org), and 12.4% were obese (Table 1 and Fig. 1A and 1B, left panels). The prevalence of obesity increased at subsequent ages, reaching 20.8% by eighth grade (mean age, 14.1 years). There were no significant increases in prevalence between the ages of 11 and 14 years.\nThe prevalence of obesity was higher among Hispanic children than among non-Hispanic white children at all ages ( Table 1) . Starting in third grade, non-Hispanic black children also had a significantly higher prevalence of obesity than non-Hispanic white children. Among all children during the follow-up period, the greatest increase in the prevalence of obesity was between first and third grades, when the prevalence increased from 13.0% to 18.6%. Between kindergarten and eighth grade, the prevalence of obesity increased by 65% among non-Hispanic white children, 50% among Hispanic children, nearly 120% among non-Hispanic black children, and more than 40% among children of other races (Asian, Pacific Islander, Native American, and multiracial children).\nChildren from the wealthiest 20% of families had a lower prevalence of obesity in kindergarten than did those in all the other socioeconomic quintiles (7.4%, vs. 13.8% and 16.5% among children in the two poorest quintiles, respectively); these differences increased through eighth grade. At all ages, the prevalence of obesity was highest among children in the next-to-poorest quintile, reaching 25.8% by eighth grade.\nThere were no significant differences in the prevalence of obesity between kindergartners with a low birth weight (<2500 g) and those with an average birth weight (2500 to 3999 g) (9.3% and 11.2%, respectively), but there was a significantly higher prevalence at all ages among children who had a high birth weight (≥4000 g) than among children in the other two birth-weight groups."}, {"section_title": "INCIDENCE OF OBESITY", "text": "Although the prevalence of obesity increased with age, incident obesity was highest at the youngest ages and declined through eighth grade. The annual incidence of obesity among kindergartners from fall to spring was 5.4% but fell to 1.9% (among boys) and 1.4% (among girls) per year during the period between fifth grade and eighth grade ( Fig. 1A and 1B , right panels, and Table S2 in the Supplementary Appendix).\nBetween the ages of 5 and 14 years, 11.9% of children became obese (10.1% of girls and 13.7% of boys) ( Table 2) . By eighth grade, 16.8% of non-Hispanic black children became obese, as did 10.1% of non-Hispanic white children and children of other races or ethnic groups and 14.3% of Hispanic children. The lowest cumulative incidence of obesity according to socioeconomic status was among children from the wealthiest 20% of families (7.4%), and the highest was among children from the middle socioeconomic quintile (15.4%).\nIncidence density rates were consistent with cumulative incidence, with a rate of 26.5 per 1000 person-years between the ages of 5 and 14 years ( Table S3 in the Supplementary Appendix). The magnitude of differences between groups varied slightly according to the incidence measure used, probably because incidence is not constant through time, as the incidence proportion method assumes."}, {"section_title": "INCIDENCE OF OBESITY ACCORDING TO WEIGHT IN KINDERGARTEN", "text": "A total of 45.3% of incident obesity cases between kindergarten and eighth grade occurred among the 14.9% of children who were overweight when they entered kindergarten ( Table  S4 in the Supplementary Appendix). The annual incidence of obesity during kindergarten among these children was 19.7%, as compared with 2.4% among children who entered kindergarten with normal weight (Fig. 1A and 1B , right panels, and Table S2 in the Supplementary Appendix). Consistent with these data, incidence density rates were 91.5 vs. 17.2 per 1000 person-years for overweight and normal-weight kindergartners, respectively ( Table S3 in the Supplementary Appendix).\nThe high incidence of obesity among children who were overweight in kindergarten fell with increasing age, so that between the ages of 11 and 14 years, the annual incidence was 3.7% (4.8% for boys and 2.6% for girls) ( Table S2 in the Supplementary Appendix). A total of 31.8% of the children who were overweight at kindergarten entry had become obese by the age of 14 years, as compared with 7.9% of their normal-weight kindergarten classmates ( Table 2) . Even among kindergartners from families with the highest socioeconomic status, the incidence was much higher among those who had been overweight rather than normal weight in kindergarten. There were no significant differences in incidence among children of various races or ethnic groups who were already overweight in kindergarten.\nOverweight kindergartners had four times the risk of becoming obese by the age of 14 years as normal-weight kindergartners ( Table 2 ). The relative risks of obesity among overweight kindergartners, as compared with normal-weight kindergartners, were highest among children from the two highest socioeconomic groups. Thus, overweight children from the two highest socioeconomic groups had five times the risk of becoming obese as normalweight children of similar socioeconomic status, whereas an overweight child from the lowest socioeconomic group had only 3.4 times the risk of obesity as a normal-weight child of similar socioeconomic status. Non-Hispanic white and black kindergartners who were overweight had higher incidences of obesity (by factors of 4.4 and 4.3, respectively) than did normal-weight children; among Hispanic children, the incidence was higher by a among children who had a birth weight of more than 4000 g and had become overweight by the age of 5 years. These children were 5.1 times as likely to become obese during the subsequent 9 years as were children with the same high birth weight whose growth trajectories led to a normal weight at the age of 5 years."}, {"section_title": "QUANTIFYING WEIGHT TRAJECTORIES", "text": "Children at the 50th percentile of body-mass index at the age of 5 years had a 6% probability of being obese at the age of 14 years (Table 3) . This probability increased to 25% among 5year-olds at the 85th percentile and to 47% among those at the 95th percentile. Among children who were at the 99th percentile in kindergarten, 72% could expect to still be obese as they finished eighth grade."}, {"section_title": "DISCUSSION", "text": "The incidence of obesity between the ages of 5 and 14 years was 4 times as high among children who had been overweight at the age of 5 years as among children who had a normal weight at that age. Consequently, 45% of incident obesity between the ages of 5 and 14 years (kindergarten and eighth grade) occurred among the 14.9% of children who were overweight (85th to 95th percentile for age-and sex-specific BMI) at the age of 5 years. Furthermore, 87% of obese eighth graders had had a BMI above the 50th percentile in kindergarten, and 75% had been above the 70th percentile; only 13% of children who were normal weight in eighth grade had been overweight in kindergarten.\nThe annualized incidence of obesity was fairly constant among normal-weight kindergartners but fell with increasing age from high levels among children who were overweight at kindergarten entry. The results are consistent with incident obesity occurring largely among the minority of children who become overweight at young ages, with incidence tapering off as this susceptible pool is exhausted.\nOur estimates are consistent with nationally representative data, which showed the prevalence of obesity at 16.9% among all children and 18.0% among elementary-school children between the ages of 6 and 11 years in 2009 and 2010. 4 The incidence of obesity between adolescence and adulthood in the United States was estimated at 2.5% annually from 1995 through 2000. 6 In a study of 386 children between the ages of 5 and 7 years attending Philadelphia health care centers from 1996 through 2003, the incidence of obesity was 2% annually among normal-weight children and 14% among overweight children. 13 Although prevalence estimates provide information on the burden of obesity, understanding incidence is key to understanding risk over a lifetime and identifying potential ages for intervention. We uncovered several important points by examining incidence. First, a component of the course to obesity is already established by the age of 5 years: half of childhood obesity occurred among children who had become overweight during the preschool years, even after the exclusion of the 12.4% of children who were already obese at the age of 5 years. There is evidence that body weight and eating patterns early in life are strongly related to subsequent obesity risks. 7 Second, obesity incidence among overweight children tended to occur early in elementary school. This pattern is consistent with exhaustion of the population of persons who are highly susceptible to becoming obese. 14 In contrast, among children who entered school at a normal weight, the incidence of obesity was low and constant between the ages of 5 and 14 years.\nEmerging from the finding that a substantial component of childhood obesity is established by the age of 5 years are questions about how early the trajectory to obesity begins and about the relative roles of early-life home and preschool environments, intrauterine factors, and genetic predisposition. Although these questions are beyond the scope of our study, we have shown some evidence that factors that are established before birth (indicated by birth weight) and those that occur during the first 5 years of life (indicated by weight at kindergarten entry) are important. Even though high-birth-weight children made up 12% of the population, they represented more than 36% of those who were obese at the age of 14 years. Thus, more than one third of high-birth-weight children became obese adolescents, as did almost half the children (45.3%) who entered kindergarten overweight.\nThis study has certain limitations. First, to maintain the sample size for stratified analyses, we grouped into an \"other race\" category Asian, Pacific Islander, Native American, and multiracial children. Second, we did not have information on weight between birth and kindergarten or after eighth grade, so we cannot map the entire trajectory of incidence or identify the age at which children who entered kindergarten overweight or obese had become overweight or obese. Lacking data before and after a period of observation, called \"left and right censoring,\" is common in studies of disease incidence. 15 Third, the cohort is representative of children who were in kindergarten in 1998 and 1999 and may not reflect the experiences of earlier or later cohorts. Still, this cohort is of particular interest because they were growing up during the 1990s and 2000s, when obesity became a major health concern. Finally, given the focus on documenting obesity incidence, it was beyond the scope of this study to model the factors associated with the development of obesity.\nA question regarding statistical analysis is how to treat data for children who are obese at one point but subsequently lose weight and become overweight or normal weight. In the analysis of incidence, we considered everyone who was not obese at a given study phase to be at risk for becoming obese by the next study phase, regardless of whether they had previously been obese. In alternative models of incidence density rates, we reported cumulative obesity risks, considering as incident cases only children who became obese during the period of observation and remained obese through the end of follow-up. The patterns from these methods are consistent, as are results from sensitivity analyses separating children who reversed weight trajectories from those who remained obese through the end of follow-up.\nBy the time they enter kindergarten, 12.4% of American children are already obese, and 14.9% are overweight. Almost half the obesity incidence from kindergarten through eighth grade occurs among children who were overweight as kindergartners. Furthermore, 36% of incident obesity between the ages of 5 and 14 years occurred among children who were large at birth. These findings highlight the importance of further research to understand the factors associated with the development of overweight during the first years of life. We speculate that obesity-prevention efforts that are focused on children who are overweight by the age of 5 years may be a way to target the children who are most susceptible to becoming obese during later childhood and adolescence."}, {"section_title": "Supplementary Material", "text": "Refer to Web version on PubMed Central for supplementary material."}, {"section_title": "Figure 1. Prevalence and Incidence of Obesity between Kindergarten and Eighth Grade", "text": "Shown are the age-specific prevalence of overweight and obesity (left graph on each panel) and annual incidence of obesity according to the weight status at baseline (right graph on each panel) among boys (Panel A) and girls (Panel B). The black vertical lines and I bars represent 95% confidence intervals. "}]