[{"section_title": "Abstract", "text": "It is becoming increasingly recognized that cerebrovascular disease is a contributing factor in the pathogenesis of Alzheimer's disease (AD). A unique 4D-Flow magnetic resonance imaging (MRI) technique, phase contrast vastly undersampled isotropic projection imaging, (PC VIPR), enables examination of angiographic and quantitative metrics of blood flow in the arteries of the Circle of Willis within a single MRI acquisition. Thirty-eight participants with Mild Cognitive Impairment (MCI) underwent a comprehensive neuroimaging protocol (including 4D-Flow imaging) and a standard neuropsychological battery. A subset of participants (N=22) also underwent lumbar puncture and had cerebrospinal fluid (CSF) assayed for AD biomarkers. Cut-offs for biomarker positivity in CSF resulting from a Receiver Operating Characteristic (ROC) curve analysis of AD cases and controls from the larger Wisconsin Alzheimer's Disease Research Center cohort were used to classify MCI participants as biomarker positive or negative on amyloid-β (Aβ 42 ), total-tau and total-tau/Aβ 42 ratio. Internal carotid artery (ICA) and middle cerebral artery (MCA) mean flow were associated with executive functioning performance, with lower mean flow corresponding to worse performance. MCI participants who were biomarker positive for Aβ 42 had lower ICA mean flow than did those who were Aβ 42 negative. In sum, mean ICA and MCA arterial flow was associated with cognitive performance in participants with MCI and lower flow in the ICA was associated with amyloid positivity. This provides further evidence for vascular health as a contributing factor in the etiopathogenesis of AD, and could represent a point to intervene in the disease process."}, {"section_title": "Introduction", "text": "Mild Cognitive Impairment (MCI) is defined as cognitive decline below age, sex and education adjusted population norms on neuropsychological tests that does not disrupt independent functioning in daily life [1, 2] . As MCI can result in variable clinical outcomes including dementia due to Alzheimer's disease (AD), it is important to identify markers that might predict these outcomes, such as deposition of extracellular aggregates of amyloid-β (Aβ) [3] [4] [5] . An amyloid positron emission tomography (PET) study using Pittsburgh Imaging Compound B (PiB) as a measure of amyloid deposition found that amongst 65 individuals with MCI, 69% presented with high PiB binding (cortical standard uptake value ratio (SUVR) > 1.5); of these, 67% progressed to dementia due to AD over the following 1-2 years [6] . Interestingly, only 5% of MCI patients with low amyloid burden progressed to dementia due to probable AD during the same study period [6] . However, as the presence or absence of amyloid binding does not perfectly predict conversion to AD, it is important to examine contributions of other health and pathological markers.\nThe role of vascular health in the pathogenesis of MCI and AD is increasingly being understood as an important contributing factor. The presence of periventricular white matter hyperintensities of presumed vascular origin among 698 participants that were either cognitively normal or diagnosed with MCI was associated with high amyloid in the brain (as measured by florbetapir-PET) and low cerebrospinal fluid (CSF) concentration of the 42 amino acid (aggregation-prone isoform of amyloid-β (Aβ 42 ) that correlates inversely with plaque load in the brain). Interestingly, this relationship persisted when age, APOE genotype, and vascular risk factors were controlled for in their analyses [7] . Given that the link between periventricular white matter hyperintensities and amyloid accumulation persisted even when accounting for standard vascular risk factors [7] , a possible explanation is that the mechanics and health of the intracranial vasculature play a role.\nOur group has been focusing on intracranial arterial health in particular, using a 4D flow magnetic resonance imaging (MRI) technique that allows for imaging of large and medium sized cerebral vessels in the Circle of Willis with high spatiotemporal resolution in clinically feasible scan times [8] [9] [10] . We employ a specific technique termed phase contrast vastly undersampled isotropic projection imaging, or PC VIPR. Compared to conventional MRI methods for examining flow, such as traditional 3D phase contrast imaging, PC VIPR increases the product of volume coverage and spatial resolution by a factor of 30 without increasing scan times, as it does not require time consuming phase encoding [10] . Furthermore, the technique facilitates measurements of flow, pulsatility, and vessel area that can be determined retrospectively. Using this technique, we have previously shown decreased mean blood flow and increased pulsatility (a metric of vessel stiffness) in the intracranial arteries, from cognitively healthy middle-aged individuals, to cognitively healthy older adults and lastly to clinically diagnosed MCI and AD patients [11] . Rivera-Rivera and colleagues extended this to examine the properties of the venous system, particularly flow and pulsatility, in the superior sagittal sinus, straight sinus, and transverse sinus. In participants with AD, transit time of peak flow from the arterial system (middle cerebral artery) to the venous system (superior sagittal sinus) was significantly shorter than that in age-matched controls, which may be a contributing factor in the impaired clearance of toxic metabolites [12] . Furthermore, decreased blood flow in the internal carotid artery (ICA) was associated with reduced levels of Aβ 42 in the CSF in a mixed sample of cognitively healthy and impaired adults [13] ; reduced Aβ 42 in the CSF is a pathological biomarker profile associated with amyloidosis [14] and AD [15] . Decreased blood flow and increased pulsatility were also associated with a greater degree of brain atrophy in this same sample [13] .\nIn addition to research using the 4D-Flow technique, other recent work has also suggested that vessel health may be related to the brain's capacity to clear metabolites from the interstitial space. Toxic metabolites may travel directly from the interstitium to the CSF, or from the interstitial space into the perivascular space [16] . Aβ is believed to enter the basement membranes of capillaries and arteries that surround smooth muscle cells, move along these capillaries and arteries until it reaches the leptomeningeal arteries, and from there, is subsequently drained into cervical lymph nodes for clearance [16, 17] . Arterial pulsation specifically has been shown to promote exchange of perivascular CSF with interstitial fluid [18] . Furthermore, cerebral amyloid angiopathy, whereby amyloid deposits along blood vessel walls, is proposed to be a reflection of impaired Aβ clearance [19, 20] .\nWe previously examined 4D flow metrics of blood vessel health in individuals throughout the entire AD spectrum; we chose to focus the current study on MCI because it is a stage with highly disparate outcomes, ranging from reversion to normal cognition to development of clinical dementia syndromes. Given that many of our most significant results have been found when examining the ICA and MCA in our previous studies, we chose to focus on these intracranial arteries for the present analyses. We identified participants from the Wisconsin Alzheimer's Disease Research Center (WADRC) with a research diagnosis of MCI and 4D flow imaging, with a subset also having CSF biomarker data. We hypothesized that amongst MCI patients, those with greater blood flow would have more preserved cognitive faculties, as measured via performance on neuropsychological tests. Furthermore, we hypothesized that blood flow to the brain would be diminished in individuals with MCI with positive biomarkers of CSF Aβ or tau compared to MCI participants who were biomarker negative."}, {"section_title": "Methods", "text": ""}, {"section_title": "Study Population", "text": "Participants were selected from a large cohort, the WADRC, consisting of approximately 700 individuals spanning the AD spectrum: middle-aged participants both with and without a family history of AD, cognitively healthy older control participants, and subjects with clinically diagnosed MCI and AD [11, 13] . Participants with MCI are recruited primarily from local clinics (or control subjects in longitudinal studies that have shown cognitive decline) and diagnosis is confirmed by clinical consensus conference based on established clinical criteria [1, 21] . Participants in this study were diagnosed with MCI due to probable or possible AD. In addition to having an MCI diagnosis, inclusion criteria included having undergone a PC VIPR scan that allowed for measurement of both the left and right internal carotid arteries (measured in the distal petrous segment), resulting in a sample of 38 participants for the present study. All but two (5.3%) of the participants entered the study with an MCI diagnosis from a local clinic, with the other two subjects receiving a diagnosis of MCI after neuropsychological testing done as part of the WADRC clinical core study. One subject entered the study with a presumed diagnosis of dementia due to AD and was changed to MCI at consensus conference, whereas the other subject entered as cognitively healthy and changed to a diagnosis of MCI at consensus conference. A subset of N=22 participants underwent a lumbar puncture (LP), which is an optional study procedure. All procedures were approved by the University of Wisconsin School of Medicine and Public Health Institutional Review Board, in accordance with the Helsinki Declaration of 1975."}, {"section_title": "MR Imaging Protocol", "text": "Subjects were scanned using an 8-channel head coil (Excite HD Brain Coil, GE Healthcare) on a clinical 3T MRI system (MR750, GE Healthcare, Waukesha, WI). The PC VIPR method was used to acquire four dimensional flow data [10] . Scan parameters for the PC VIPR acquisition were as detailed: venc = 80 cm/s, imaging volume = (22 cm) 3 , acquired isotropic spatial resolution = (0.7 mm) 3 , TR/TE=7.4/2.7ms, flip angle α=10°, bandwidth = 83.3KHz, 14,000 projection angles, scan time ~ 7 min, retrospective cardiac gating reconstructed into 20 cardiac phases with temporal interpolation [22] . "}, {"section_title": "Flow Analysis", "text": "Velocity vector fields were extracted from the PC VIPR data sets and used for hemodynamic evaluation. Matlab (The Mathworks, Natick, MA) was used for segmentation of the arterial tree from PC angiograms generated from the 4D-Flow MRI data. Interactive flow visualization and selection of planes for quantitative analysis were conducted in EnSight (CEI, Apex, NC); flow analysis planes were manually placed orthogonal to the vessel orientation in the distal petrous ICA and the middle of the M1 segment of the MCA. Using a customized Matlab tool, 2D-cine image series with through-plane velocities were generated from 4D-Flow MRI data at the selected planes of interest [23] . Measurements were taken from both the left and right ICA and the left and right MCA, and these values were averaged to obtain mean ICA and MCA flow metrics, respectively [13, 24] . In three participants the MCA was not able to be segmented successfully, so those participants were excluded from the MCA analyses only."}, {"section_title": "Neuropsychological Testing", "text": "Longitudinal cognitive data is collected annually for cognitively healthy older adult (>65y Neuropsychological data from the study visit closest to the MRI was included in analyses (mean interval 53.68 days; SD: 41.83). In order to reduce the number of comparisons and the likelihood of Type 1 error, we created composite Z scores for executive function (TMT-B, WAIS-DS and Animal Naming; TMT-B was first reverse-scored so that higher scores indicated better performance) and memory (RAVLT and logical memory immediate and delay). One subject did not complete the RAVLT or logical memory measures at the neuropsychological visit closest to the MRI scan date, so was excluded from the memory composite analyses only."}, {"section_title": "CSF Collection and Analysis", "text": "LP for CSF collection was conducted in the morning following at least a 12 hour fast. The LP procedure was performed as follows: a Sprotte spinal needle was inserted into the L3-L4 or L4-L5 vertebral interspace, with slow suction used to withdraw CSF. Within 30 minutes of collection, centrifugation of the CSF to remove red blood cells or other debris was performed. The CSF was then aliquoted into 0.5ml polypropylene tubes and stored at −80˚C [25] until being sent in bulk for analysis at the Clinical Neurochemistry Lab at the Sahlgrenska Academy of the University of Gothenburg, Sweden. The CSF samples were assayed for total-tau and amyloid beta 1-42 (Aβ 42 ) using commercially available enzymelinked immunosorbent assay (ELISA) methods (INNOTEST assays, Fujiurebio, Ghent Belgium) as described previously [26] [27] [28] . Board-certified laboratory technicians blinded to clinical diagnosis performed all analyses on one occasion per batch sent, with two batches sent. 17 of the participants had CSF analyzed in batch 1, and 5 in batch 2; a statistician (DN) created a conversion factor to account for inter-batch variability (Norton et al., in preparation). All samples were analyzed according to protocols approved by the Swedish Board of Accreditation and Conformity Assessment (SWEDAC) using either of two batches of reagents (intra-assay coefficient of variation <10%)."}, {"section_title": "Statistical Analysis", "text": "Multiple linear regression analyses were conducted in SPSS Version 22. Models included either bilateral mean blood flow in the ICA or MCA or the difference in flow between the left and right ICA or left and right MCA (components used to generate the mean flow variable) as the predictor variable, memory or executive function composite scores as the outcome variable, with age at MRI scan, sex, years of education, and interval between MRI scan and cognitive test date as covariates. The absolute value of the difference between left and right flow was examined to test whether it was an overall impairment in blood flow to the brain, or a more localized/lateral arterial issue affecting cognitive performance.\nReceiver operating characteristic (ROC) curves were used to develop cut-offs of biomarker positivity in a separate sample of 38 participants with dementia due to AD and 40 cognitively healthy adults described in more detail elsewhere ( To compare demographic and clinical features between biomarker positive and negative groups, nonparametric tests were used due to small group sizes. Mann Whitney U Tests and Fisher's Exact Tests were used for continuous data and categorical data, respectively. Of particular interest to the study were the Mann Whitney U tests performed to examine if ICA and MCA flow differed based on positivity or negativity for the following biomarkers: Aβ 42 , total-tau or total-tau/Aβ 42 ratio. Post hoc multiple linear regression models for significant biomarker positivity results were run adding standard covariates from the literature; age, sex, and APOE ε4 carrier status (with biomarker positivity status as the predictor of interest and flow as the outcome). The reason for running both Mann Whitney U tests followed by linear regression models with covariates was to balance possible over-modeling in this small sample size with the desire to include covariates that are standard in the literature; if the general conclusions hold up in both models (one more basic that is more appropriate for the small sample size, while another that incorporates standard covariates), then this provides further confidence in our findings. Although biomarker cut-offs can simplify interpretation and improve clinical applicability, they ignore the potentially important underlying continuous distribution of the biomarker, especially for individuals whose biomarker levels are very close to the cut-off. Therefore, for associations where the Mann Whitney U test was significant, we also performed post-hoc multiple linear regression models with continuous CSF biomarker data (in place of the binary factor of biomarker positivity or negativity), with the same covariates as the model above, to determine whether biomarkers on a continuous scale predicted blood flow. Furthermore, multiple linear regression models were checked to prevent against significant violations of the normality (via Kolmogorov-Smirnov tests) or homoscedasticity assumptions. Statistical significance was set at p <.05, and trends were reported when p < .1."}, {"section_title": "Results", "text": "Demographic and clinical information for the N=38 participants with MCI is detailed in Table 1 ."}, {"section_title": "ICA and MCA Mean Flow and Cognition", "text": "Higher flow in the ICA measured using PC VIPR was found to be associated with a higher executive composite Z score, with an unstandardized B estimate of .466 (SE: "}, {"section_title": "Biomarker Positivity and Mean Flow", "text": "Half (N=11 out of 22, 50%) of MCI participants with assayed CSF were Aβ 42 positive, 59.1% (N=13 out of 22) were total-tau positive and 63.6% (N=14 out of 22) were total-tau/ Aβ 42 positive. In regards to demographic and clinical characteristics, participants who were total-tau positive had lower MMSE scores (p =.011), and had a trend towards a lower prevalence of diabetes (p=.055) compared to the tau negative group; there was a trend towards increasing prevalence of ε4 carriage in the amyloid positive group (p = .08) compared to the amyloid negative group. In the total-tau/Aβ 42 positive group, there was a trend towards increased age (p=.082) and decreased MMSE scores (p=.059). All other demographic and clinical variables did not differ between groups, including executive and memory composite scores. Compared to Aβ 42 negative participants, MCI participants with "}, {"section_title": "Discussion", "text": "In this study examining intracranial arterial health metrics of the ICA and MCA in participants with MCI, we found that lower flow correlated with worse performance on neuropsychological tests of executive function, and that participants with lower mean flow in the ICA were more likely to be amyloid positive. No relationships were observed in this sample between flow and performance on a composite memory metric, nor with tau or tau/ Aβ 42 ratio positivity. Lastly, laterality of blood flow did not predict any of the outcomes examined.\nPrior studies have demonstrated associations between reduced cerebral perfusion measured via arterial spin labeling (ASL) and cognitive decline in MCI. For example, a study of 48 older adults with MCI (mean age 76.3y at baseline) found that decreased cerebral perfusion predicted cognitive decline over an average of 2.7 years on the Clinical Dementia Rating (CDR) Scale Sum of Boxes, Stroop Switching, and California Verbal Learning Test [29] . Although cross-sectional, our results also support that reduced cerebral blood flow even within the larger arterial vessels (e.g., ICA and MCA mean flow) is associated with lower cognitive performance. Evidence suggests vascular disease often negatively impacts cognitive performance specifically in the executive functioning domain [30, 31] . In a study of 130 individuals with hypertension, increased small vessel disease was associated with poorer executive functioning performance, but not with memory performance [32] , a similar pattern to what we observed in our study. Additionally, in a separate sample (n=94) of cognitively healthy older adults, subcortical ischemic vascular disease significantly predicted worse performance on executive functioning metrics, but not memory measures [33] .\nReduced cortical perfusion has also been associated with elevated amyloid burden in addition to cognitive impairment. Analysis of 182 participants (cognitively normal, early and late MCI, and AD) from the Alzheimer's Disease Neuroimaging Initiative (ADNI) found that an increased amount of amyloid (as measured via florbetapir-PET) was associated with reduced perfusion in the entorhinal, inferior temporal, inferior parietal, and precuneus cortices [34] . Furthermore, a study of 27 cognitively normal older adults and 16 adults with amnestic MCI found a trend towards lower cerebral blood flow in adults with positive neuroimaging markers for amyloid compared to adults negative for amyloid markers [35] .\nWhat differentiates the present research from prior studies is that we are examining macroscopic blood flow in large intracranial arteries, as opposed to local cerebral tissue perfusion measured via ASL. Although our prior studies suggest a positive correlation between measurements of blood flow in the large arteries and cortical perfusion [36] , there is utility in using both methods in the study of the etiopathogenesis of AD as they assess different aspects of cerebrovascular health.\nOur finding that lower mean ICA and MCA blood flow are associated with greater cognitive impairment and that lower flow in the ICA is associated with amyloid positivity provides further evidence for a relationship between vascular health and AD pathogenesis. A recent review stressed the importance of research on vascular health in cognitively impaired populations and proposed that vascular metrics may help to explain heterogeneous biomarker profiles [37] . While effects on amyloid clearance may be one mechanism, vascular dysfunction may also affect cognitive decline through a non-clearance dependent mechanism. For instance, differences in vascular health could partially explain the oft-cited observation that cognitively healthy individuals can be amyloid positive yet not display clinical symptoms of dementia due to AD [38] [39] [40] . Perhaps a more optimal vascular health status protects these individuals with AD pathology from manifesting the disease clinically, though this is speculative and requires further research. Interestingly, in our study, MCI participants who were biomarker positive for amyloid had lower ICA blood flow than did those who were amyloid negative, further suggesting a link between vascular pathology and amyloid pathology. Perhaps the reason only amyloid, rather than tau, showed a relationship with ICA flow is that amyloid is particularly toxic to the vasculature [17] or because Aβ abnormalities are more pronounced in CSF earlier in the AD trajectory while tau abnormalities accumulate in the CSF as the disease progresses [41] . A possible explanation for why ICA flow was significantly associated with amyloid positivity and MCA flow was not is that given the small sample size, there is a larger probability for type II error, but this merits further study in a larger group of participants with MCI.\nOur study has limitations that should be mentioned. Data was not collected for potentially confounding factors that may affect cerebral hemodynamics, such as sleep apnea, ejection fraction or RR interval. The sample size of participants with MCI who have PC VIPR data is small, and this is reduced further when examining 4D blood flow in concert with CSF biomarkers; future studies plan to conduct analyses in larger sample sizes to confirm the present results. Due to this small sample size, there is a higher likelihood of type II error, which may explain why no relationships were seen with blood flow and memory performance nor with amyloid positivity and MCA mean flow. Furthermore, although CSF biomarker values are not dichotomous by nature, we chose to examine cut-offs for biomarker positivity because we wanted to stratify the patients using a more clinically interpretable variable; however, we also examined significant results post-hoc as continuous variables and observed a trend level relationship for amyloid. Although a linear trend of time was accounted for in some statistical models, having a more condensed time frame of the MRI, LP and neuropsychological visits could lend greater strength to the conclusions, however, despite the elapses in time, we were able to detect relationships in this small sample. In regards to cognition, analyses presented herein are cross-sectional in nature, and efforts are underway to examine the role of 4D blood flow metrics on longitudinal cognitive performance and conversion from MCI to AD. Furthermore, we plan to incorporate pulsatility index, a surrogate metric of vessel stiffness, into future analyses, as an additional metric of vessel health and also examine the relationship between arterial health metrics and performance on visuospatial cognitive tests. Overall, this study examines blood flow in the ICA and MCA using a unique methodology, four-dimensional flow MRI, and relates it to established biomarker and cognitive phenotypes associated with AD pathology. The results provide additional evidence of the interrelationship between vascular factors and AD that could have important implications for research and clinical care of patients with MCI. "}]