[{"section_title": "Abstract", "text": "Background Hippocampal avoidance prophylactic cranial irradiation (HA-PCI) techniques have been developed to reduce radiation damage to the hippocampus. An inter-observer hippocampus delineation analysis was performed and the influence of the delineation variability on dose to the hippocampus was studied. Materials and methods For five patients, seven observers delineated both hippocampi on brain MRI. The intra-class correlation (ICC) with absolute agreement and the generalized conformity index (CI gen ) were computed. Median surfaces over all observers' delineations were created for each patient and regional outlining differences were analysed. HA-PCI dose plans were made from the median surfaces and we investigated whether dose constraints in the hippocampus could be met for all delineations. Results The ICC for the left and right hippocampus was 0.56 and 0.69, respectively, while the CI gen ranged from 0.55 to 0.70. The posterior and anterior-medial hippocampal regions had most variation with SDs ranging from approximately 1 to 2.5 mm. The mean dose (D mean ) constraint was met for all delineations, but for the dose received by 1% of the hippocampal volume (D 1% ) violations were observed. Conclusion The relatively low ICC and CI gen indicate that delineation variability among observers for both left and right hippocampus was large. The posterior and anterior-medial border have the largest delineation inaccuracy. The hippocampus D mean constraint was not violated."}, {"section_title": "Introduction", "text": "Of all lung cancers, about 10-15% are diagnosed as small cell lung cancers (SCLC) [1] . Without radiological or clinical evidence of brain metastases, prophylactic cranial irradiation (PCI) is used to treat microscopic brain metastases and reduce the risk of developing larger metastases [2, 3] . It has been shown that PCI in SCLC has a positive effect on overall survival [4, 5] .\nRecent radiation therapy oncology group (RTOG, https ://www.rtog.org/) studies in patients with SCLC treated with PCI have observed that PCI could cause short-term, progressive as well as irreversible neurotoxicity leading to cognitive decline [6] [7] [8] . Furthermore, a reduction of short-term quality of life has been reported [9, 10] . Therefore, especially in patients receiving PCI it is important to introduce techniques to prevent neurocognitive toxicity.\nThe hippocampus is an important archicortical brain structure playing a crucial role in episodic and spatial memory and in neurogenesis [11, 12] . Several studies have found that even small doses of radiation can injure the neural stem cell (NSC) compartment located in the dentate gyrus of the hippocampus [13] [14] [15] [16] [17] .\nBased on these findings, the RTOG has performed a phase II hippocampal avoidance (HA) study to investigate the feasibility of this approach in 42 patients [18] . The hippocampus was delineated on structural brain MRI and a 5-mm planning organ at risk volume (PRV) margin was placed around the hippocampus defining the 'hippocampal avoidance zone'. This 5-mm margin covers the radiosensitive and memory-specific neural stem cell compartment. A reduction of mean dose to this compartment by at least 80%, while maintaining dose homogeneity and good coverage to the rest of the brain, was shown to be possible with intensity-modulated radiation therapy (IMRT) techniques in [19] . In this multi-institutional non-randomized phase II RTOG 0933 trial, memory preservation was associated with hippocampal sparing in patients treated with whole brain radiation therapy (WBRT) for brain metastases compared to a historical group that received WBRT without HA [18] . Some studies state that metastasis incidence in the hippocampi, and hippocampus avoidance region is low (about 5%) compared to other parts of the brain [20] [21] [22] . Such low incidence is in agreement with its relatively small volumes [23] , i.e., it is assumed that distribution of brain metastases in the HA region is not significantly different than in other brain regions [23] . A recent prospective study in 20 patients treated with HA-PCI has found that one patient developed a metastasis in the HA zone [24] , and a recent case study described a patient developing a metastasis in the perihippocampal region 7 months after receiving HA-PCI [25] . These studies suggest that hippocampal sparing has the potential to reduce neurocognitive decline, but the risk of development of brain metastases in the spared region also needs to be considered. Evaluating the risk and benefit of hippocampus sparing PCI is the subject of on-going phase III trials, which are investigating neurocognitive functioning in patients treated with PCI or HA-PCI, including an international study hosted by the Netherlands Cancer Institute (NCT01780675). Hippocampus sparing radiotherapy treatment planning techniques were introduced in the last few years [19, 26, 27] .\nDue to the low grey value contrast with adjacent structures [28] , precise hippocampus delineation on MRI scans is difficult. Therefore, hippocampus sparing techniques can be expected to suffer from delineation variability among radiation oncologists and technicians. However, until now the precise influence of delineation inaccuracy has not been studied in depth. Therefore, it is currently unknown how precise hippocampus delineation is, and how accurate it needs to be for successful hippocampus avoidance strategies. In this study, we determine whether the accuracy of hippocampus delineation by radiation oncologists or technicians is high enough to meet the hippocampus dose constraints for patients treated within the Dutch-Belgian randomized phase III HA-PCI trial (NCT01780675)."}, {"section_title": "Materials and methods", "text": ""}, {"section_title": "Patients' and observers' characteristics", "text": "Four radiation oncologists, two radiation technicians and one neuroradiologist were recruited from different centres in the Netherlands and Belgium. The observers delineated the hippocampus on five patient datasets (two women and three men), selected from a multicentre phase III trial where patients with SCLC are randomized to receive standard PCI or HA-PCI treatment (Clinical trials.gov identifier: NCT01780675). The mean patient age was 62 years, range 51-71. The observers were instructed to follow the RTOG-atlas hippocampus outlining protocol [29] , but had little experience in hippocampus delineation. MRI and CT scans for each patient were collected at the Netherlands Cancer Institute in Amsterdam, the Netherlands. The MRI acquisition protocol was adopted from the Alzheimer's Disease Neuroimaging Initiative (ADNI, http:// adni.loni.usc.edu), which investigated MRI protocols to capture the brain morphometry with minimum patient burden. A detailed description of the MRI acquisition protocol can be found in [30] . MRI scans of the cerebrum were acquired with a sagittal 3D T1-weighted magnetisation-prepared rapid gradient echo (MP-RAGE) sequence using 3T. All MRIs had an in-plane square pixel size of 1 mm 2 and a slice thickness of 1.2 mm. Treatment planning CT scans of the brain had a 1 3 slice spacing of 1 mm with in-plane pixel sizes between 0.6 and 0.7 mm 2 . Following the RTOG guidelines, the MRI scans were rigidly registered and resampled to the CT scans using the bony anatomy and using in-house software (WorldMatch) [31] . Registered MRI and CT scans were distributed in DICOM format to the different centres, and the left and right hippocampus were delineated on the resliced MRI scans. Delineated hippocampal contours could be defined at in-plane sub-pixel level. To obtain 3D closed surface meshes, 2D contours on consecutive slices were connected with straight lines.\nFurthermore, we asked each observer to fill out a questionnaire to rate their delineation experience in years or number of previously performed hippocampus delineations, delineation time and to judge the difficulty for each delineation (easy, moderate or difficult)."}, {"section_title": "Inter-rater delineation comparison", "text": "For each subject, hippocampus delineations of the seven observers were compared by determining hippocampal volumes and reporting the intra-class correlation coefficient (ICC) with absolute agreement in a two-way mixed model. The ICC for absolute agreement is defined as the ratio between the variance due to subjects and the total variance. To determine the overlap of observers' delineations, the generalized conformity index (CI gen ) [32] was computed. CI gen is defined by:\nwith A i representing delineated structures. To compute CI gen , hippocampal surface meshes were converted to voxel-wise\nsegmentations. Interpolation errors were minimised by enclosing all surfaces with a fine regular grid [33] . Hippocampus segmentations were then approximated by marking voxels inside the hippocampal meshes. Next, as described by Steenbakkers et al. [34] , a median surface for each hippocampus of the same patient was created, where each point inside the median surface is designated by at least 50% of all observers' hippocampus delineations (Fig. 1) . Then, a delineation variability analysis was performed by calculating the perpendicular distance from each point of the median surface to each observer's delineation [34] . Local observer variation was expressed by calculating the standard deviation (SD) at each point of the median surface using the seven observers distances."}, {"section_title": "Dose plan evaluation", "text": "We exported the five median surfaces and corresponding treatment planning CT scans to the treatment planning system, Pinnacle 3 version 9 (Philips Medical Systems, Eindhoven, The Netherlands). Using these, volumetric modulated arc therapy (VMAT) hippocampus sparing radiotherapy plans were generated. According to the trial protocol (NCT01780675), for the HA arm a dose of 25 Gy in ten fractions was prescribed to the planning target volume (PTV) defined as the whole brain plus 4-mm margin minus the PRV. The PRV was the hippocampus delineation plus 5-mm margin. The percentage volume of the PTV which was determined to receive 95 and 115% of the prescription dose (V 95% PTV and V 115% PTV) was ≥ 95 and ≤ 1%, respectively. The doses delivered to 98 and 1% of the PTV (D 98% PTV and D 1% PTV) were to be ≥ 18.75 Gy and ≤ 27.5 Gy, respectively. The maximum dose received by the PTV (D max PTV) was set to ≤ 28.75 Gy. The mean dose constraint to the left and right hippocampus (D mean ) was ≤ 8.5 Gy, which correlates to a mean biological dose (D mean biological ) of ≤ 6.2 Gy (α/β = 2 Gy). The dose received by 1% (D 1% ) of the left and right hippocampal volume was set to be ≤ 10 Gy and the maximal dose for the eye lenses was ≤ 10 Gy.\nWe transferred all hippocampus delineations to the generated HA-PCI VMAT dose plans generated on the median surface and computed the organ at risk constraints described above for all hippocampus delineations to observe if all dose constraints could be met in spite of observer variation."}, {"section_title": "Results", "text": ""}, {"section_title": "Delineation variability", "text": "The Fig. 2 corresponding volumes are illustrated graphically. The ICC with absolute agreement was 0.56 and 0.69 for the left and right hippocampus, respectively. Table 1 shows the CI gen , ranging from 0.55 to 0.70.\nLocal shape variation between outlines from different observers was projected onto the median surface for each patient and each hippocampus (Fig. 3) . It can be seen that for both left and right hippocampus the posterior and anterior-medial border have the largest inter-observer variation with SDs ranging from approximately 1 to 2.5 mm.\nFive of the seven observers filled out the questionnaires. The radiation oncologists and technicians only had little (five previous hippocampus delineations) or no delineation experience. The neuroradiologist rated his experiences as 10 years, but did not use the RTOG protocol for hippocampus delineation before. The delineation time ranged from 10 to 25 min with an average of 16 min. Most hippocampi were rated as moderately hard to delineate. One of the observers commented that the posterior and medial border were difficult to delineate."}, {"section_title": "Planning organ at risk volumes and dose plan results", "text": "The mean left PRV volumes ranged from 13 Supplementary Fig. 1 .\nDose parameters for the PTV of the VMAT plans obtained using the median surfaces are summarised in Table 2 . For all five patients, the dose constraints and constraints for the eye lenses could be met. In patient 5, the D max constraint seems exceeded, but this occurs in a single pixel in air, which is considered irrelevant.\nAll D mean , D mean biological and the D 1% planned to the hippocampus are presented in Fig. 4 for all patients and observers delineations. The dashed lines in these bar plots represent the dose constraint value for the given parameter. For most hippocampus delineations, the dose constraints could be met; however, a few outliers can be observed in the hippocampus D 1% . For those outliers, parts of the delineations deviated too much from the median surfaces and, therefore, the D 1% is above the constraint. "}, {"section_title": "Discussion", "text": "In this study, we analysed hippocampus delineation variability in seven observers and reported the influence of this variability on the dose distribution.\nSo far, only one abstract, by Diwanji et al., was published comparing hippocampus delineations of three different observers in patients with brain metastases [35] . Their conclusion was that hippocampus delineations had fairly high concordance with mean hippocampal volumes Fig. 3 Local shape variation in mm projected on the median surfaces of each patient for left (top) and right (bottom) hippocampus. For each point of the median surface, the distance to each observer's delineation was determined and the SD of all seven distances was projected. From the most posterior to the most anterior point, the hippocampus is approximately 3.5 cm long 3 . Differences between left and right hippocampal volumes and observers delineation experience were not reported. According to the abstract, hippocampi were delineated on two different sets of MRI with two different sequences. Recent atlases were used for delineation, but no reference was given. Therefore, it is difficult to compare our results with theirs.\nThe difference between average left and right hippocampal volumes can be confirmed with other literature in which hippocampal volumes were measured on structural MRI in neuroradiology [33, [36] [37] [38] [39] . In our inter-observer variation analysis, we grouped delineations of the radiation oncologists, technicians and the neuroradiologist together, because of the relatively small number of raters per expertise group. Moreover, raters roughly showed the same level of experience in using the RTOG outlining protocol. With ICCs of 0.56 and 0.69 for the left and right hippocampus, respectively, our volume correlation scores are relatively low compared to hippocampus segmentations performed in neuroradiology, where inter-observer variability scores are usually higher than 0.85 [40] . Of note, in neuroradiology experts are trained to delineate the hippocampus accurately because the aim is often a precise volume measurement. The CI gen is a numerical extension of the Jaccard index for multiple observers, and a Jaccard index of 0.67 is considered to reflect relatively good accuracy for a small structure such as the hippocampus [41] . Our CI gen scores ranged from 0.55 to 0.70, indicating that the observer delineation variation is large. We did not consider the delineation of the neuroradiologist as the \"gold standard\", because of his/her limited experience in using the RTOG outlining protocol.\nOne reason for the high observer variation in our study could be the inexperience of the observers in delineating the hippocampus. In this context, the instructions of the RTOG protocol might not be clear enough as it depicts and describes hippocampal boundaries on an MRI in axial direction only. Extending this protocol to a description of hippocampal boundaries in coronal and sagittal direction may help improving observer's hippocampus delineation. Furthermore, the RTOG atlas describes a hippocampus delineation on \"optimal\" MR brain images. Delineating the hippocampus on brain images of elderly patients with SCLC is more difficult, because the MRI scans can be prone to artefacts and brain anatomy can differ due to age-related atrophy. Finally, Di Biase et al. showed that the head position on the treatment table can affect hippocampal appearance. To solve the problem, they developed a practical guide for hippocampus delineation based on three different head position setups [42] .\nWe computed local shape variation and showed that most delineation inaccuracy appeared in the posterior and anterior-medial borders (SD range 1-2.5 mm). These regions were also mentioned by one observer in the questionnaires as difficult to delineate. This is most probably due to similar grey value intensities of adjacent structures. The RTOG-atlas hippocampus outlining protocol describes to exclude the fimbria, which was included in some cases. Furthermore, part of the amygdala was sometimes taken into the delineation. Therefore, it may be helpful to switch from axial to sagittal view if possible in those regions to improve consistency. This observation might help to improve the delineation protocol, by adding non-axial images for these boundaries. Furthermore, there is considerable shorter delineation time reported for our study (~ 16 min) compared to the reported hippocampus segmentation performed in neuroradiology (~ 2 h [43] ). A multidisciplinary delineation procedure by adding expertise from trained neuroradiologists could be considered for training purposes and to improve hippocampus delineation. For instance, in the field of Alzheimer's and dementia it has been shown that training positively increased delineation accuracy [25] . Another approach may be to organise central review platforms to support and improve delineation in the real-life setting. The Belgian College for physicians in radiation oncology has finalised two such projects, for rectal and for breast cancer, which resulted in increased uniformity of clinical target volume delineation per centre and at national level [44, 45] . Such quality assurance projects may safeguard the benefits of HA-PCI in the broader population, even if the dosimetric impact in this study seems limited.\nIn this study, we created median hippocampus delineations from all observers' delineations to estimate delineations being closer to the ground truth. The resulting VMAT dose plans were used to evaluate if all dose constraints for each observer's delineation could be met. All dose constraints of the trial for D mean and D mean biological were met for all observers' hippocampus delineations. For completeness, we also reported violations of the hippocampus D 1% constraint, but this constraint is considered of less importance in hippocampal avoidance dose planning. Our dose analysis shows that hippocampal delineation accuracy is not crucial to fulfil the trial protocol (NCT01780675) dose constraints, given the current PRV margin of 5 mm. However, more accurate hippocampus delineations might allow a reduction of the PRV margin in the future. Such a reduction would reduce the perihippocampal volume receiving lower dose than prescribed and it might lower the chance that metastases develop. There is about a factor 6 difference in volume between PRV and hippocampus, indicating that each mm margin reduction would reduce under-dosed brain significantly.\nTo reduce manual outlining labour, applying automatic or semi-automatic contouring methods to delineate the hippocampus might also be an interesting option. For instance, FSL-FIRST [46] and FreeSurfer [28, 47] are well known public available segmentation methods, used in numerous studies [33, [48] [49] [50] [51] [52] . There are also recent developments reported towards multi-atlas segmentation methods, where lot of work is dedicated to reduce the registration time for such methods [53, 54] . As we have shown, even if hippocampus delineation would differ from the \"ground truth\", hippocampal dose constraints can still be met. Validating (semi-)automatic delineation methods in this context would be highly desirable."}, {"section_title": "Conclusion", "text": "Even though substantial inter-observer delineation variation was observed, for hippocampi the required dose constraints for all observers' delineations were met due to applied PRV margin. We think that hippocampus delineation could be improved by adjusting the RTOG-atlas protocol and by adding expertise from neuroradiology. Improving hippocampus delineation accuracy might allow reducing the PRV margin."}]