[{"section_title": "Christine LeBard EDUC 263 Professor Arthur Cohen", "text": "As individuals who assume leadership positions are likely to perceive their leadership abilities as high, it is important to understand the extent to which American community colleges influence the ways in which students perceive their leadership abilities. Recognizing the factors of community college environments that positively influence students' perceptions of their leadership abilities may determine whether these institutions facilitate an environment for developing future,_community leaders. With respect to both the mission of community colleges and America's social and economic development, community colleges can play a critical role in developing future community leaders. Purpose: There are two main objectives of this experimental study. First, I seek to explore the relationship between community college academic and extracurricular programs and students' perceptions of their leadership abilities. I will analyze correlations between extracurricular activities and students' perception variables such as participation in school events, volunteer and community service, and the students' self-rating on the importance of \"being a leader in your community\" with students' perceptions of there leadership abilities. Secondly, I seek to ascertain the characteristics of community college curricular programs that influence students' perceptions of their leadership abilities through the Data Analysis System (DAS)1. The community college curricular variables will be characterized as degree programs and academic disciplines by which students participate. Tabulating  variables such as degree program and academic discipline and students' perceptions of their leadership abilities. My intentions for researching community colleges and students' perceptions of their leadership abilities are influenced by my belief in the mission of community colleges to serve their respective communities. Thus, I hope my analyses of the relationship between curricular and extracurricular programs and students' perceptions of their leadership abilities encourages future researchers to examine the effects of community college environments on students' perceptions of their leadership abilities. Research findings on the effect of community college environments will enable community colleges to develop and maintain programs that implement leadership skills and foster students' perceptions of their leadership abilities."}, {"section_title": "Literature Review:", "text": "Research on leadership issues within higher education has focused on professionals-the styles of leadership they practice, and the attributes that make them effective leaders (Nieva & Gutek, 1981;Nix, 1969). This limited scope of inquiry leaves a gap, a pronounced need for research on the effect of higher education on students as potential, future leaders. More specifically, few researchers or scholars have addressed issues pertaining to the impact of the community college environment on students' perceptions of their leadership abilities. As the majority of research focuses on professionals, literature pertaining to both professionals and college students are included to provide a description of leadership styles, and the types of environmental stimuli that positively and negatively effect students' perceptions of their leadership ability. In hopes of expanding this scope, I intend to ascertain the characteristics of community college2 environments that influence students' perceptions of their leadership abilities by focusing on students' experiences while enrolled in two-year institutions. In order to determine whether community college students are more likely to assume leadership roles in different sub-environments, it is important to first discuss the characteristics of leaders and the different styles of leadership practiced. Positional and non-positional leaders (Astin & L1and, 1991)_characterize the different types of leadership styles. Positional leaders are typified as leaders because of their position or title. Non-positional leaders, however, are those who are leaders because of their charisma and vision and not because of their position (Astin & Leland,1991). As leadership is a relative term, I will focus my research to the review positional leadership, where leaders are defined by positions they assume. In 1991, Harvard Business Review facilitated a debate in which scholars, researchers, and professionals discussed The Ways in Which Men and Women Lead. Results implied that women were more likely to apply transformational leadership styles than were men. \"Our data also found women were somewhat more likely to be described as charismatic leaders, leaders with whom subordinates want to identify, leaders with whom they could form strong emotional attachments (Bass, 1991;p.151).\" Likewise, as women leaders practice transformational leadership styles (Harvard Business Review, 1991) and strive to raise social consciousness (Astin & Leland, 1991), their perceptions of their leadership abilities and skills may be best developed in social science, humanities, or political science courses. Much research indicates that female leaders agree that role models positively influenced women to assume leadership positions (interview with H. Astin, 1999). Rosener's reference that subordinates regard females leaders as individuals with whom they can identify and build relations strengthens the importance for using community colleges, to help develop potential female leaders (Rosener, 1990). With respect to Rosener's emphasis on distinguishing the influence of gender on leadership and relative perceptions of leadership accentuates the need to review leadership from the positional role, or the leader's title. I chose to review positional leadership in community colleges by students who assume positions of leadership, as in student government and students who actively partake in volunteer and community service organizations, while at the community college. Focusing on positional leadership enables me to determine whether students' involvement in these sub-environments influenced students' perceptions of their leadership abilities. Rosener further characterizes leadership styles by gender by describing women as transformational leaders. Transformational leaders endeavor to have subordinates reconstruct their individual, self-interests for the welfare of the aggregate with a focus on the broader goal. More specifically, Rosener emphasized that women encourage collaboration, share authority, and enhance others' self-worth (Rosener, 1990). Getskow (ERIC digest, no date) reviewed the literature on women in community college leadership roles and likewise found that women leaders encourage employees by sharing power and information while males tend to lead through a series of exchanges that involve rewarding and punishing employees according to job performance. Interestingly, however, with all the literature on gender distinction among leaders, many found that gender differences in leadership are insignificant (Nieva&Gutek, 1981). This insignificant relationship further poses that students with intentions of pursuing future leadership roles from both genders will likewise benefit from research about the factors of the community college environment that may positively influence students' perceptions of their leadership abilities. Student Involvement: Understanding the effect of the college environment on student leaders further develops my review of students' perception of their leadership abilities. On account of the literature disproportionately focusing on professionals rather than on students in leadership positions, few authors have discussed the impact of American community colleges on student leaders. In which case, my review includes literature pertaining to four-year institutions. Although Astin (1993) focused on four-year institutions, some evidence on the influence of college students' perceptions of their leadership abilities can be applied to the study of twoyear institutions. Astin's research on the impact of the college environment on students' perceptions of their leadership abilities influenced the inclusion of some variables in this research. In What Matters in College? Four-Critical Years Revisited, Astin analyzed pertinent variables found in the Cooperative Institute Research Program (CIRP) data3 to emphasize the impact of four-year college environments on students' perceptions of leadership abilities. Astin's (1993) analysis of student leadership determined that \"student leaders,\" positional leaders, are 3 UCLA's Higher Education Research Institute (HERI). Data sampled from Freshman Survey in 1985 and Followup Survey in 1989. likely to have affluent and well-educated parents, earn varsity letters in sports, and may be elected to a student government position. In addition, Astin found that students with high leadership scores are highly represented in private institutions, and underrepresented in two-year institutions. However, conclusions that can be drawn from the CIRP data are limited because CIRP surveys focus on college freshman and disregard many transfer students and many first year community college students. Furthermore, few community colleges participate in CIRP. Despite CIRP limitations, Astin found variables such as frequent interaction with peers, participation in Greek Life, and playing sports as positively correlated with students' perceptions of leadership abilities. These variables may likewise be applied to the analysis of students from community colleges. Informed by Astin's work, I will include variables that relate to student government, playing sports, involvement in volunteer and community service, and program-type or major were reviewed in the Beginning Postsecondary Students (BPS) Survey4 as pertaining strictly to two-year institutions. In reviewing positional leadership pertaining to student government. Holloway (1998) designed a study to assess how candidates and non-candidates for student leadership positions perceive themselves on such characteristics as motivating and inspiring others, decision making, counseling skills, management of self, and adaptability of self. The results of the study indicate that there was a significant difference between candidates and non-candidates for Student Government Association and Greek Life student leadership positions on selected individual, family and demographic characteristics. The results revealed positive relationships between students' participation in civic and community-based groups and student development and student leadership. By asking whether involvement in student government had increased students' perceptions of their leadership abilities, one representative from Santa Barbara City College' expressed that her knowledge of her abilities increased as a result of her involvement in student government at SBCC. Knowing that she \"influences the school\" was the most rewarding aspect of her position as a student representative (SBCC survey interview). Major Field: As mentioned by Astin (1993), analysis of the major degree variable allows researchers to interpret academic programs that best enhance students' academic and personal development. The correlation between students' academic program and perceptions of leadership abilities help determine whether involvement in particular vocational or academic courses affect students differently. For example, Nix (1969) determined that a large number of community leaders in three Georgia communities were from business, industry, or politics (Refer to Table 1F."}, {"section_title": "Methodology:", "text": "The question that guides this research is what are the specific characteristics of community colleges that relate to students' perceptions of their leadership abilities? In attempts to determine the specific characteristics of community colleges that positively correlate with students' perceptions of their leadership abilities, this research focuses on the change in degree programs and academic disciplines that positively correlate with students' perceptions of their leadership abilities. However, a comparative review of degree programs and academic disciplines that may hinder students' perceptions of their leadership abilities is likewise Education Statistics (NCES). These data include a nationwide sample of information from over 8,000 college students. Data and results from the 1994 (FUS) enabled the compilation of this research. The sample in this study is limited to 1,393 students from 239 institutions throuehout the United States. All 2 -3 year public institutions and 2 -3 year private, not-for-profit institutions were controlled to focus on students from two-year institutions. Students' perceptions of their leadership abilities in 1989-90 and again in 1990-91 were controlled to determine possible correlations with degree programs and academic disciplines. As the students' perceptions of their leadership abilities variable was not included in the 1994 FUS. change in students' perceptions are unavailable. However, as the 1991 FUS included the students' perceptions of their leadership abilities variable, changes in students' perceptions one year after are available and correlations were tabulated between students' perceptions and community college curricular variables. Procedure: A) In using the BPS survey to determine the relationships between the community college environment and students' leadership abilities, several correlations were run to determine relationships between the curricular and extracurricular variables and students' perceptions of their leadership abilities."}, {"section_title": "Results:", "text": "Findings: To determine whether participation in school activities influenced students' perceptions of their leadership abilities, correlations were tabulated in Table 1 based upon students' perceptions and students' ratings of their participation level when compared to their peers. In 1994, students responded to the following question: \"How often did you do each of the following during the (sample term)? Would you say never, once, sometimes, or often?\" Survey: First-time freshman only (for this particular question). In addition tb discovering the relationship between stddents' perceptions of their leadership abilities and participation in school events, students' perceptions of their leadership abilities and involvement in volunteer and community service are likewise evaluated to show relationships. To determine correlations between students' perceptions of their leadership abilities and participation in volunteer and community service activities, students rated their participation level when compared to their peers. The survey question asked: \"During the past 2 years (from the start of 92' to present), have you petformed volunteer or community service work, other than court-ordered work?\" (PTA, Little League, Scouts, service clubs, church groups, social action groups, etc.)?\" Prevailing notions imply that environmental factors, such as academic and extracurricular involvement, influence students' views (Astin, 1993). Consequently, it is important to determine the relationship between students' perceptions of their leadership abilities and students' views of leadership. The correlations for Table 1C were based upon students' perceptions and students' ratings on the following question: \"As I read the following statements, please tell me the importance of the statement to you personally. 'Being a leader in your community.\" BEST COPY AVAILABLE Community colleges grant different types of degrees for different programs, and thus many students are able to follow unique paths through vocational programs, transfer programs, or community service programs (Cohen, 1996). In following such unique paths, outcomes for community college students are varied. However, many colleges offer certificates, associate's degrees, and transfer articulation. As outcomes for community college students vary, the relationship between students' perceptions of their leadership abilities and student outcomes, four years later, is a necessary topic of review. Table 1D shows the relationship between students' perceptions of their leadership abilities and students' highest degree attained in 1994. Differences among degree outcomes are further accentuated by examining the type of degree programs that students follow and how such programs relate to students' perceptions of their leadership abilities. In Table 1E, students responses to the type of program they followed in the academic years of 1989-90 and again, in 1990-91 are reported.  Review of the relationship between whether students transferred between two-and fouryear institutions and students' perceptions of their leaderslzip abilities influenced my awareness that students who perceive their leadership abilities as above average, are more likely to transfer than students who perceive their leadership abilities as below average. Table 1H shows the relationship between students' perceptions of their leadership abilities and whether students transferred between two-and four-year institutions. BEST COPY AVAILABLE Interpretations: By interpreting the data from Table 1A, it appears that participating in school events is positively associated with students' perceptions of their leadership abilities. When reviewing the students who participate \"often-in school events, only 1.6 percent considered their leadership abilities as \"below average.-Furthermore, most students who participated at least \"sometimes\" in school events perceived their leadership abilities as at least \"average\" when compared to their peers. Therefore, it seems that participation in school events positively correlates with students' perceptions of their leadership abilities. As students' participation in school events increases, the percentage of those who perceive their leadership abilities as \"below average.' decreases. Of the students who participated in volunteer and community service activities, nearly 96 percent considered their leadership abilities at least \"average.\" Of those, 43 percent viewed their leadership abilities as \"above average.\" When further reviewing information gathered in the BPS:94 Survey, nearly 44 percent of the students who participated in volunteer and conmamity service activities because they \"wanted to help others, and felt it was a sense of duty\" were \"above average\" in perceptions of their leadership abilities. More than half of those who agreed that \"being a leader in your community\" is \"very important\" considered themselves above average on leadership abilities when compared to their 1 4 peers. Nearly 13 percent of the students who considered \"bein2 a leader in your community-as \"not important\" perceived their leadership abilities as \"below average. nearly triple the number of \"below average\" perceptions that agreed that \"being a leader in the community\" is \"somewhat\" or \"very important.\" From the data in Table 1C, it appears that there is a higher proportion of students with -below average\" perceptions that do not regard \"being a leader in the community\" very positively. Students' perceptions proportionately show that the students who considered their leadership abilities as \"above average\" were most likely to earn a bachelor's degree. Those who considered their leadership abilities as \"average\" were most highly correlated with earning an associate's degree, and those students who considered their leadership abilities as \"below average\" were most highly correlated with earning a certificate. Vocational and academic programs had an interesting association with students' perceptions of their leadership abilities. Twenty-eight percent of those who enrolled in vocational programs from 1989-90 considered their leadership abilities as \"above average.\" However, in the following year. 33.4 percent of those enrolled in vocational programs considered their leadership abilities as \"above average,\" an increase of 5.3 percent. This increase in perceptions of leadership abilities leads to implications that perhaps vocational programs encourage student leadership. What's more, in 1989-90, 8.1 percent of those enrolled in vocational programs considered their leadership abilities as \"below average,\" but only 5.8 percent enrolled in vocational programs considered their leadership abilities as \"below average\" the following year. Enrollment in vocational programs positively correlates with decreasing percentages of \"below average\" perceptions, and positively correlates with percentage increases BEST COPY AVAILABLE in students' perceptions of their leadership abilities. Fewer students perceived their leadership abilities as \"below average\" after one year of involvement in vocational programs. In the 89-90 academic year, students' perceptions of their leadership abilities increased less in academic programs than in vocational programs. However, these programs enrolled more students from the above average category: 35.5 percent in 89-90 and 35.2 percent in 90-91. Although there are more students who perceived their leadership abilities as -above average\", there is a slight drop in leadership perceptions. With reference to academic programs, the most notable observations for students who perceived their leadership as \"above average\" were found in social/behavioral sciences where students' perceptions of their leadership abilities increased by 10 percent. Business/management programs tended to increase students' perceptions of their leadership abilities by 5 percent, and other technical/vocational programs tended to increase students' perceptions of their leadership abilities by 8.2 percent. Clearly students enrolled in other technical/professional programs have both high perceptions of leadership abilities upon entrance and notable increases in their students' perceptions of their leadership abilities after experiences within this academic program for one year. Some majors were found to negatively correlate with students' perceptions of their leadership abilities. For example, after one year, students enrolled in engineering experienced negative relationships in their perceptions of their leadership abilities by 2.2 percent. Students enrolled in vocational technical programs experienced decreased perceptions of their leadership abilities by 5.6 percent. Table 1F shows the disparity between academic programs and students' perceptions of their leadership abilities. Interestingly, all students who transferred perceived their leadership abilities as at least \"average.\" Within that sample, for both students who transferred from two-year to four-year institutions and for reverse transfer students6, there was a representative number of both \"average\" and \"above average\" perceptions in leadership abilities. Implications: Research: By examining the community college environmental variables that associate with students' perceptions of their leadership abilities, my implications for future researchers are to determine causal relationships between community_ college environmental variables and . . _ _ students' perceptions of their leadership abilities. Longitudinal studies and tracking of community college students will enable researchers to determine whether they assumed leadership positions may further extend possibilities for research on the potential of community colleges to train society's future leaders. From research that indicates causal relationships between curricular and extracurricular programs and students' perceptions of their leadership abilities, practitioners can implement necessary program reform that will positively influence students' perceptions of their leadership abilities on two-year college campuses. Practice: Practitioners and institutional researchers can benefit from my research by comparing this national study with that of their specific institutions. Practitioners can formulate incentives and goals for institutions to further develop students' perceptions of their leadership abilities by evaluating curricular and extracurricular programs on students' perceptions of their leadership abilities and determine necessary program reform. Likewise, my research may help to inform students who enter with intentions of assuming leadership positions of specific curricular and extracurricular programs that may positively associate and with their perceptions of their leadership abilities. For example, the most notable observations for students who perceived their leadership as \"below average\" were found in 1) humanities, engineering, and business/management. Students who perceived their leadership abilities as low and enrolled in humanities courses were 1 percent less likely to hold below average perceptions after one year. In engineering courses, students who perceived their leadership abilities as low were 2.2 percent less likely to perceive their abilities as below average after one year. Other programs where students who perceived their leadership abilities as low and were less likely to continue with low perceptions were in business/management by 1.6 percent and in other technical/vocational by 3.3 percent. Interestingly, students who enrolled in health programs experienced notable increases in perceptions of leadership abilities by 2.4 percent, and likewise those who enrolled in vocational and technical programs experienced increases by 1.3 percent. Although these relationships are not causal, the relationships found in my study may inform students of choices to participate in different programs based on their perceptions and specific skills that they seek to develop."}, {"section_title": "Conclusion:", "text": "Community colleges provide curricular and extracurricular programs that show positive and negative relationships with students' perceptions of their leadership abilities. For community college students, positive change in increased perception of leadership ability occurs most notably in social/behavioral sciences, business/management programs, and other technical and professional programs for students' with \"above average\" perceptions of their leadership abilities. Involvement in volunteer and community service and participating in school events likewise promoted students' perceptions of their leadership abilities. In terms of students' views, \"being a leader in my community\" accentuated possibilities that students may assume leadership positions in the future.  oe A4, Le.4,,,\" Corporate Source: Publication Date: II. REPRODUCTION RELEASE: In order to disseminate as widely as possible timely and significant materials of interest to the educational community, documents announced in the monthly abstract journal of the ERIC system, Resources in Education (RIE), are usually made available to users in microfiche, reproduced paper copy, and electronic media, and sold through the ERIC Document Reproduction Service (EDRS). Credit is given to the source of each document, and, if reproduction release is granted, one of the following notices is affixed to the document. If permission is granted to reproduce and disseminate the identified document, please CHECK ONE of the following three options and sign at the bottom of the page. LI Check here for Level 2B release, permitting reproduction end dissemination In microfiche only Documents will be processed as indicated provided reproduction quality permits. If permission to reproduce is granted, but no box Is checked, documents will be processed at Level 1. I hereby grant to the Educational Resources Information Center (ERIC) nonexclusive permission to reproduce and disseminate this document as indicated above. Reproductidn from the ERIC microfiche or electronic media by persons other than ERIC employees and its system contractors requires permission from the copyright holder. Exception is made for non-profit reproduction by libraries and other service agencies to satisfy information needs of educators in msponse to discrete inquiries. "}]