[{"section_title": "Abstract", "text": "Context: Precocious amygdala enlargement is commonly observed in young children with autism. However, the age at which abnormal amygdala enlargement begins and the relative growth trajectories of the amygdala and total brain remain unclear.\nObjective: To determine whether the rate of amygdala growth is abnormal and disproportionate to total brain growth in very young children with autism spectrum disorders (ASDs).\nDesign: Longitudinal structural magnetic resonance imaging study.\nSetting: Neuroimaging and diagnostic assessments were performed at an academic medical center. Participants were recruited from the community.\nParticipants: Baseline scans were acquired in 132 boys (85 with ASD and 47 control subjects with typical development [TD]; mean age, 37 months). Longitudinal magnetic resonance images were acquired in 70 participants (45 with ASD and 25 TD controls) 1 year later.\nMain Outcome Measure: Amygdala volumes and total cerebral volumes (TCVs) were evaluated at both time points, and 1-year growth rates were calculated.\nThe amygdala was larger in children with ASD at both time points, but the magnitude of enlargement was greater at time 2. The TCV was also enlarged in the children with ASD by the same magnitude at both time points. When we controlled for TCV, amygdala enlargement remained significant at both time points. The rate of amygdala growth during this 1-year interval was faster in children with ASD than in TD controls. The rate of TCV growth did not differ between groups. Post hoc exploratory analyses revealed 3 patterns of amygdala and TCV growth rates in the ASD group.\nConclusions: Disproportionate amygdala enlargement is present by 37 months of age in ASD. The amygdala continues to grow at an increased rate, but substantial heterogeneity exists in amygdala and TCV growth patterns. Future studies aimed at clinical characterization of different growth patterns could have implications for choice and outcomes of treatment and behavioral therapy."}, {"section_title": "Results:", "text": "The amygdala was larger in children with ASD at both time points, but the magnitude of enlargement was greater at time 2. The TCV was also enlarged in the children with ASD by the same magnitude at both time points. When we controlled for TCV, amygdala enlargement remained significant at both time points. The rate of amygdala growth during this 1-year interval was faster in children with ASD than in TD controls. The rate of TCV growth did not differ between groups. Post hoc exploratory analyses revealed 3 patterns of amygdala and TCV growth rates in the ASD group.\nConclusions: Disproportionate amygdala enlargement is present by 37 months of age in ASD. The amygdala continues to grow at an increased rate, but substantial heterogeneity exists in amygdala and TCV growth patterns. Future studies aimed at clinical characterization of different growth patterns could have implications for choice and outcomes of treatment and behavioral therapy."}, {"section_title": "Arch Gen Psychiatry. 2012;69(1):53-61", "text": "A UTISM IS A NEURODEVELOPmental disorder characterized by impairments in social behavior and communication and by the presence of repetitive or restricted interests. 1 Although much remains to be determined regarding the biological features of autism, one prominent theme is the altered trajectory of brain development, both globally as reflected in total brain volume [2] [3] [4] and in specific structures, such as the amygdala. 5 Substantial evidence of precocious amygdala and brain enlargement in young children with autism exists, [6] [7] [8] but their relative growth patterns remain unclear. Longitudinal studies of brain development could identify critical periods of abnormal brain enlargement as a first step toward establishing neurobiological factors responsible for the abnormal growth.\nPrevious cross-sectional magnetic resonance imaging (MRI) studies have demonstrated that the time course of development for the total brain and the amygdala is altered in autism, but the overall patterns may be different. Courchesne and colleagues 3 demonstrated that total brain enlargement is present in children aged 2 to 4 years but not in older children and adolescents. This has led to the proposal that the maturational process is more rapid in children with autism but that the end result, in terms of overall volume, is similar to that of children with typical develop-ment (TD). A similar abnormal growth trajectory occurs within the amygdala, although the time frame appears to be quite different. In TD, the amygdala undergoes a preadolescent growth phase that is disproportionate to the change in total brain size. 9 It is not clear if, or when, the amygdala of children with autism undergoes a comparable growth phase. It is clear that the amygdala is larger in children with autism into middle childhood (7-12 years). 5 Previous studies [6] [7] [8] of the amygdala in young children with autism report volumetric enlargements in agematched control subjects as young as 2.5 years. In the only longitudinal study of amygdala development in autism, Mosconi et al 6 reported that the amygdala was larger in children with an average age of 2.6 years but that the rate of growth of the amygdala during a 2-year interval was no different than the rate in their control group, which consisted of TD children and children with developmental delays. In an earlier cross-sectional study from our group, we found that the amygdala in boys with autism reached adult size by approximately 8 years of age, whereas the amygdala of TD children did not reach adult size until several years later. 5 Thus, accelerated growth of the amygdala must occur at some point during early childhood. The early trajectory of amygdala growth from infancy through middle childhood remains unclear.\nIn the present longitudinal study, we endeavored to extend previous work by evaluating the rate of amygdala growth relative to total brain growth during a 1-year interval in a large sample of children with autism spectrum disorders (ASDs). We hoped to shed light on the following questions: (1) What is the early developmental trajectory of amygdala growth? (2) What are the relative growth rates of amygdala and total brain volume? and (3) How consistent is abnormal amygdala growth across a large population of children with autism?"}, {"section_title": "METHODS", "text": ""}, {"section_title": "PARTICIPANTS", "text": "Participants were recruited through the MIND (Medical Investigation of Neurodevelopmental Disorders) Institute of the University of California, Davis (UCD), as part of the Autism Phenome Project. Baseline MRIs were acquired in 132 boys (85 with ASD and 47 with TD) at 2 to 4 years of age. Longitudinal MRIs were collected 1 year later in a subset of 70 boys (45 with ASD and 25 with TD).\nDiagnostic instruments included the Autism Diagnostic Observation Schedule-Generic (ADOS-G) 10, 11 and the Autism Diagnostic Interview-Revised. 12 All diagnostic assessments were conducted or directly observed by trained, licensed clinical psychologists (S.R.) who specialize in autism and had been trained according to research standards for these tools. Inclusion criteria for ASD were taken from the diagnostic definition of ASD in young children formulated and agreed on by the Collaborative Programs of Excellence in Autism (CPEA). Participants met ADOS-G cutoff scores for autism or ASD. In addition, they exceeded the Autism Diagnostic Interview-Revised cutoff score for autism on the social or communication subscale and were within 2 points of this criterion on the other subscale. The CPEA definition includes a distinction between autistic disorder and pervasive developmental disorder not otherwise specified (PDD-NOS). From the algorithm scores on the various modules of the ADOS-G, we calculated an ADOS severity score 13 that allows for comparison of autism severity across participants undergoing testing with different ADOS-G modules.\nDevelopmental ability was determined for all participants using the Mullen Scales of Early Development.\n14 The developmental quotient (DQ) was based on the average of the ageequivalent scores on the visual reception, fine motor, receptive language, and expressive language subscales divided by the chronological age and multiplied by 100. A score of 100 indicates that the child is functioning at an age-appropriate level.\nFor TD controls, inclusion criteria included developmental scores within 2 SDs of the mean on all subscales of the Mullen Scales of Early Development. Exclusion criteria for TD controls were a diagnosis of mental retardation, pervasive developmental disorder, or specific language impairment or any known developmental, neurological, or behavioral problems. The TD controls were screened and excluded for autism with the Social Communication Questionnaire-Lifetime Edition (scores Ͼ11).\nAll TD controls and children with ASD were native English speakers, were ambulatory, and had no suspected vision or hearing problems. In the ASD group, 1 child with fragile X disorder and 5 with a history of abnormal electroencephalographic findings were excluded. Additional exclusionary criteria were limited to those with physical contraindications to MRI. This study was approved by the UCD institutional review board, and informed consent was obtained from the parent or guardian of each participant."}, {"section_title": "GENERAL IMAGING PROCEDURES", "text": "All scanning was performed during natural nocturnal sleep. 15 Earplugs, headphones, or both were used to attenuate the MRI gradient sounds. Each child underwent careful monitoring during the scan. If the child moved or woke up during the scan, the imaging session was halted. Scans were visually inspected for motion artifact. Because scans were acquired during natural sleep, there was minimal motion artifact. For any large movements (eg, twitching or shifting of the head position), scanning was halted and repeated. The success rate in acquiring images during natural sleep was 88.0%. Scans were not obtained for 18 of the candidate children (11 with ASD and 7 with TD). The mean DQ for ASD cases with unsuccessful scanning, although on the more impaired end of the range (mean [ Siemens Medical Solutions, Erlangen, Germany) using an 8-channel head coil. For each participant, a 3-dimensional T1-weighted magnetization-prepared rapid gradient echo (MPRAGE) scan (repetition time, 2170 milliseconds; echo time, 4.86 milliseconds; matrix, 256ϫ256; 1-mm isotropic voxels) was obtained. A T2-weighted scan was also obtained for clinical evaluation when possible (ie, when the child remained asleep). All MRPAGE and available T2-weighted scans were reviewed by a pediatric neuroradiologist and screened for significant, unexpected clinical findings. The radiologist identified several clinically benign incidental findings in the ASD and TD groups that were not exclusionary. These included pineal cysts, Chiari malformation type I, and cavum septum pellucidum or cavum vergae."}, {"section_title": "IMAGE DISTORTION CORRECTION", "text": "We performed image distortion correction on all T1-weighted images before volumetric analyses. Hardware-induced variations have been recognized as an important source of error in volumetric measurements of brain regions obtained from MRI. 16 Even within a single MRI system, geometric distortion in images can arise from normal variability of hardware performance over time. Baseline and longitudinal images for this study were acquired during the 4 years from 2006 to 2010. To monitor and correct for hardware-induced geometric distortion, a calibration phantom (ADNI MAGPHAM, Phantom Laboratory, Inc, Salem, New York [http://www.phantomlab.com]) was scanned at the end of each MRI session using an MPRAGE pulse sequence matched to the study sequence. The phantom was imaged using the same landmark and shim as the participant, ensuring an accurate measurement of the spatial characteristics of the MRI volume for each individual during every imaging session.\nThe calibration phantom contains 165 polycarbonate spheres measuring 1 cm in diameter and filled with copper-sulfate aqueous solution. On the MRIs, the spheres appear bright against a dark background. A 3-dimensional image distortion map is derived from the differences in the geometric location of the spheres within the phantom compared with their known physical locations. Participant images are then corrected on the basis of this distortion map (Image Owl, Inc, Salem, New York [http: //www.imageowl.com/])."}, {"section_title": "VOLUMETRIC MEASUREMENTS", "text": "Image preprocessing included removing nonbrain tissue using the Oxford Centre for Functional MRI of the Brain (FMRIB; http://www.fmrib.ox.ac.uk) brain extraction tool (BET) 17 and correcting inhomogeneity using the nonparametric nonuniformintensity normalization method (N3). 18 Total cerebral volume was measured using an automated method. First, a studyspecific template was created. Each participant image was brought into template space using a linear affine transformation followed by a high-dimensional nonlinear warping procedure (cubic B-splines). A mask with the brainstem and cerebellum removed was created on the template by manually tracing the TCV. 5 The mask was then applied to all participant images. Images were transformed back to native space and segmented into gray matter, white matter, and cerebrospinal fluid using FMRIB's automated segmentation tool (FAST; http://www.fmrib.ox.ac.uk/fsl/fast4/index.html). 19 The TCV was quantified by summing gray and white matter volumes. This automated protocol was validated by performing reliability checks with 10 manually defined volumes. The intraclass correlation coefficient was 0.98.\nThe amygdala was manually defined using Analyze software, version 10.0, 20 based on an anatomically defined protocol. 5 Images were first resampled to 0.5-mm isotropic voxels and aligned along the long axis of the hippocampus. For longitudinal scans, orientation from the baseline scan was preserved to reduce variability. Boundaries were traced in the coronal plane in a caudal-to-rostral direction. Axial views were used to aid in defining the boundary between the amygdala and the putamen, and sagittal views were used to aid in determining the rostral extent of the amygdala. Two blinded raters (C.W.N. and R.S.) performed all manual tracings and had an intraclass correlation coefficient of 0.93 for the left amygdala and 0.96 for the right amygdala."}, {"section_title": "STATISTICAL ANALYSIS", "text": "Normality of amygdala and TCV distributions was confirmed using 1-sample Kolmogorov-Smirnov tests. Group-averaged differences in amygdala volume at the time 1 and time 2 MRIs were evaluated using analysis of covariance (ANCOVA), with age as a covariate. The DQ was not correlated with amygdala or TCV for the ASD or TD group and was therefore not included as a covariate in these analyses. The ANCOVAs were performed with and without TCV as an additional covariate.\nFor longitudinal analyses, the mean percentage increase in amygdala volume was calculated for each participant by the following equation:\n(Time 2 Volume−Time 1 Volume)/Time 1 Volume.\nMean group differences were evaluated using ANCOVA, with the interval between scans and the percentage increase in TCV as covariates. As a secondary analysis, we also evaluated the relative rates of amygdala and TCV growth for each individual. Here, we first calculated a normalized amygdala volume as a proportion of TCV (raw amygdala volume/TCV) for each participant. The rate of change for the normalized amygdala was then calculated, accounting for the interval between MRI scans, using the following formula:\n(Normalized Amygdala Volume at Time 2 − Normalized Amygdala Volume at Time 1)/(Age at Time 2−Age at Time 1).\nGroup differences in the relative growth rates of the amygdala and TCV were evaluated using an unpaired t test. This analysis was used as a basis for a post hoc exploration of the heterogeneity of the ASD sample."}, {"section_title": "RESULTS", "text": "Participant demographic, diagnostic, and behavioral measures are presented in Table 1 . The mean age for participants was 36.9 months at time 1 and 49.8 months at time 2. There were no group differences in age at either MRI time point (time 1, P =.90; time 2, P =.10). There was also no group difference in the interval between MRI scans (P=.63). As expected, DQ was significantly higher in TD controls (PϽ.001). Of the 85 participants with ASD, 6 had PDD-NOS."}, {"section_title": "EFFECTS OF DISTORTION CORRECTION", "text": "Maximal distortion (defined as the maximum distance between a point in the uncorrected image to the corresponding point on the distortion-corrected image) ranged from 1. ages. The average difference in TCV for uncorrected and distortion-corrected images was 4.5%. Group differences in TCV between the ASD and TD groups are within the same range. 3, 21, 22 Thus, distortion correction of images proved to be a critical step to attaining accurate volumetric measurements."}, {"section_title": "CROSS-SECTIONAL ANALYSES OF AMYGDALA VOLUME AT TIMES 1 AND 2", "text": "Raw amygdala volumes at both MRI time points and ANCOVA results are presented in Table 2 . Group differences at each time point are depicted in Figure 2 . The amygdala was enlarged at both time points, even when controlling for TCV. The magnitude of amygdala enlargement was greater at time 2. At time 1, the difference in volume of the amygdala between the ASD and TD groups was approximately 6%; this increased to approximately 9% at time 2. In contrast, although the TCV was significantly enlarged in the ASD group at both time points, the magnitude of enlargement was similar (approximately 4%) at times 1 and 2."}, {"section_title": "RATE OF GROWTH IN AMYGDALA DURING 1-YEAR INTERVAL", "text": "Individual and group-averaged trajectories of amygdala volume growth during the 1-year interval between scans are depicted in Figure 3 . The mean percentage increase from time 1 to time 2 for each diagnostic group is presented in Figure 4 . The rate of growth was significantly increased in children with ASD for the right amygdala (F=8.62; P =.005) and the left amygdala (F=4.65; P =.03). The rate of TCV growth did not differ between diagnostic groups (ANCOVA with interval between scans as the covariate, F=0.02; P =.88)."}, {"section_title": "RATE OF AMYGDALA GROWTH IN RELATION TO GROWTH OF TCV", "text": "Next, we investigated the relative growth rates of the amygdala and TCV for each individual (described in the \"Statistical Analysis\" subsection). Figure 5A depicts the rate of right and left amygdala growth relative to TCV growth. A value of 0 indicates that the rate of growth of the amygdala and TCV is the same (ie, the ratio of amygdala to TCV for each individual remains the same for both time points, signifying that both regions are growing at the same rate). A value greater than 0 signifies that the amygdala is growing faster than total brain volume. Negative values occur when total brain volume is increasing more rapidly than amygdala volume. Group comparison revealed a significant group difference for the right amygdala (t = 7.83; P=.007) and left amygdala (t=4.65; P=.03). Thus, the rate of amygdala growth relative to the rate of TCV growth during this period was faster for the ASD group than for the TD group. In addition, the ASD group had significantly Abbreviations: ADOS-G, Autism Diagnostic Observation Scale-Generic; ASD, autism spectrum disorder; DQ, development quotient; ellipses, not applicable; PDD-NOS, pervasive developmental disorder not otherwise specified; RBRI, repetitive behavior restricted interest; TD, typical development.\na Unless otherwise indicated, data are expressed as mean (SD). "}, {"section_title": "POST HOC EXPLORATORY ANALYSES OF MULTIPLE BRAIN GROWTH PATTERNS", "text": "Given that the variance of the rate of amygdala growth normalized to the TCV was significantly larger in the ASD group, we sought to identify whether there may be different patterns of development discernible in the ASD group ( Figure 5 ). The purpose of identifying subgroups is to attempt to characterize the heterogeneity within autism. Although there are a number of ways that subgroups could be identified, we opted for a straightforward approach that looked for individuals with ASD outside the TD range. We calculated the 95% CI for the TD controls for normalized right and left amygdala growth rates (depicted by the dashed lines in Figure 5A ) and used these as cutoffs to define the following 3 subgroups of ASD: (1) a rapid amygdala, normal TCV growth subgroup (ASD-amygdala rapid); (2) a slow amygdala, rapid TCV growth subgroup (ASD-amygdala slow); and (3) a subgroup that overlaps with TD controls with normal rates of amygdala and TCV growth (ASD-typical).\nAn individual was classified as belonging to the ASDamygdala rapid subgroup if the rate of growth of the left or the right normalized amygdala volume exceeded the 97.5% threshold for TD controls. An individual was classified as belonging to the ASD-amygdala slow subgroup if the rate of growth of the left or right normalized amygdala volume was lower than the 2.5% threshold. In this group, the amygdala growth rate was slower than the TCV growth rate. Individuals whose amygdala growth rate was within the 95% CI were classified as belonging to the ASDtypical subgroup ( Figure 5A ).\nFigure 5B depicts raw percentage increases in TCV and amygdala volume for the 3 ASD subgroups and TD controls. Although the amygdala growth rate for the TD group and the ASD-typical subgroup was approximately 8%, the amygdala growth rate for the ASD-amygdala rapid subgroup was greater than 15%. Conversely, in the ASDamygdala slow subgroup, the amygdala increased by only about 4.5% ( Figure 5B ) from time 1 to time 2, whereas TCV increased by almost 7%.\nOf the 45 children in the ASD group, 19 (42%) were characterized as belonging to the ASD-amygdala rapid subgroup, 19 (42%) in the ASD-typical subgroup, and 7 (16%) in the ASD-amygdala slow subgroup. The subgroups did not differ by age at the time 1 scan or by the interval between scans. The groups also did not differ significantly for mean DQ and ADOS severity score at time 1."}, {"section_title": "COMMENT", "text": "We sought to determine (1) the early developmental trajectory of the amygdala; (2) the relationship between abnormal total brain growth and abnormal amygdala growth; and (3) how consistently abnormal amygdala growth is observed across a large population of children with ASD. Total brain volume was significantly larger in the ASD group relative to the TD group at 37 and 50 months of age. The magnitude of total brain enlargement was similar at both ages. Relative to children with TD, the amyg- The amygdala is enlarged in the autism spectrum disorder (ASD) group at both time points, but the magnitude of the difference is greater at time 2. TD indicates controls with typical development. *P Ͻ .05. †P Ͻ .01. P values are adjusted for age and total cerebral volume. dala in children with ASD was enlarged at both time points, but the magnitude of enlargement was even greater at 50 months. This suggests that the pathological enlargement of the amygdala begins before age 3 years but is still accelerating for some time thereafter. We also found that there was substantial heterogeneity in the growth patterns of the amygdala and total brain in the ASD group. Although many children with ASD exhibited accelerated growth of the amygdala, not all children did. The clinical implications of different trajectories of amygdala and brain growth will be important to determine in future follow-up studies.\nOne limitation of this study is that diagnostic reassessment and behavioral follow-up were not performed at the time 2 MRI. The Autism Phenome Project is ongoing, and additional diagnostic and behavioral testing is being performed at a time 3 MRI, 1 year after the time 2 MRI. Data collection is proceeding for that phase of the project. Another limitation is that, to fully characterize subgroups within the ASD group, even larger sample sizes will be needed. Although our sample size was quite large, we recognize that our attempts to classify subgroups within the ASD sample are preliminary.\nIn general, our findings are consistent with other published studies of amygdala volume in children with autism. Our longitudinal data at 37 and 50 months of age are consistent with 2 cross-sectional studies of children in the same age range. Schumann et al 7 reported a 6% enlargement in the right amygdala in boys with an average age of 36 months. Sparks et al 8 reported a 12% enlargement in the right amygdala in boys with an average age of 47 months. This is consistent with results from our present study showing that the magnitude of amygdala enlargement is approximately 6% at 37 months of age and increases during a 1-year interval to about 9% at 50 months. In our earlier study of slightly older children, 5 the amygdala in boys aged 7 to 12 years was about 14% larger. Thus, the magnitude of amygdala enlargement depends closely on the age of the sample, with older samples showing increasing magnitude of amygdala enlargement. Collectively, these findings suggest that the abnormal growth of the amygdala begins before 3 years of age and accelerates during the next several years.\nThere is only 1 published longitudinal analysis of amygdala growth in young children with ASD. Mosconi and colleagues 6 evaluated the rate of growth in the amygdala in children with an average age of 2.6 years, with follow-up scanning when the average age was 5 years. They found that the amygdala in their autism group was enlarged relative to their control group at both ages. However, when they controlled for total tissue volume, the enlargement was not significant at either time point. The most notable difference between the study by Mosconi et al 6 and the findings presented in this report is that Mosconi et al did not observe a difference in the rate of amygdala growth for individuals with autism compared with controls. The control group in their study was different from the present control group as well as those in all other published studies on amygdala volume. Their control group consisted of a mixture of age-matched TD controls and children with developmental delays without autism. It is difficult, therefore, to directly compare their findings with the published literature or the results from the present study.\nA more rapid rate of amygdala expansion in the autism group is consistent with our earlier finding that the amygdala in children with autism reaches an adult volume earlier than in TD control children. 5 Based on our previous study, we predicted that the amygdala should undergo a period of accelerated growth at some point before 7 years of age. Results from the present study suggest that this period has already begun by 3 years of age.\nThe neurobiological underpinnings of early amygdala enlargement in autism remain unknown. Without neuropathological assessments of the amygdala at early developmental time points, it is possible to only speculate about the mechanisms of enhanced growth. There are a variety of potential mechanisms to explore, such as investigating whether there are increased numbers of neurons and/or glia in the amygdala and whether dendritic arborization is altered or even whether amygdala enlargement is due to edema consequent to an inflammatory process. 23 Our laboratory is working to acquire pediatric postmortem brain tissue so that we can address these questions.\nOne interesting observation in this study was that the relative growth rates of the amygdala were significantly more variable in the children with autism than in the TD children. We explored this further by attempting to classify subgroups of children with autism according to their relative rates of amygdala and TCV growth. We determined that 42% of children with ASD exhibited rapid . Patterns of development of the amygdala and total cerebral volume (TCV) in subgroups of patients with autism spectrum disorder (ASD). A, Rate of amygdala growth relative to TCV growth plotted against age at the time 1 magnetic resonance imaging. Individuals in whom the amygdala was growing more rapidly than the TCV are plotted above 0 (gray line), whereas those whose rate of TCV expansion exceeded the rate of amygdala expansion are plotted below 0. Three ASD subgroups are defined according to the 95% CIs for the control subjects with typical development (TD) (dashed lines). Relative to the TD group, the ASD-amygdala rapid group exhibited double the rate of amygdala growth. Conversely, ASD-amygdala slow group exhibited normal amygdala growth rates but increased rate for TCV growth. A final subgroup, the ASD-typical group, exhibited amygdala and TCV growth rates that were very similar to those of the TD group. B, Percentage increases during the 1-year interval for amygdala and TCV for the 3 ASD subgroups and TD group.\nARCH GEN PSYCHIATRY/ VOL 69 (NO. 1), JAN 2012 amygdala growth that was more than double the rate of TD controls. In another 16%, the amygdala growth rate was slower than that of TD controls, but the TCV growth was increased. Finally, the remaining 42% of children with ASD exhibited growth trajectories similar to those of the TD children for amygdala and total brain volume. Behavioral correlates of different amygdala growth patterns in the present study await further exploration and would provide substantial validation of the significance of the observed amygdala growth trajectory differences.\nIn particular, we might expect that the children with ASD and rapid amygdala growth may demonstrate higher levels of anxiety. However, these higher levels are not likely to clearly manifest themselves until the children are substantially older. Data collection is ongoing, and additional behavioral assessments are being performed in conjunction with the time 3 MRI, 2 years after study entry.\nThere is substantial genetic heterogeneity that is now known to be associated with autism. 24 Several recent investigations have examined how specific mutations may be associated with brain morphologic features. For example, 7% to 17% of individuals with autism and macrocephaly exhibit a mutation in the PTEN tumor suppressor gene. [25] [26] [27] There is also evidence of an association between the short allele of the serotonin transporter gene (5-HTTLPR) and increased cerebral gray matter in children, 28 but not in adults. 29 Genetic associations with brain growth trajectories have yet to be explored, but the present findings of different patterns of brain growth suggest that this may be a worthwhile endeavor."}, {"section_title": "CONCLUSIONS", "text": "Our findings provide further evidence that the amygdala and TCV are abnormally enlarged in children with autism. Our longitudinal data suggest, however, that the trajectories of abnormal growth for total brain volume and amygdala differ between autistic individuals. The starting point for precocious amygdala growth is before age 3 years, but the rate of amygdala growth continues to accelerate. Total brain enlargement is also present by age 3, but the rate of growth is comparable to that of TD controls at that age. These findings suggest that different pathophysiological processes may underlie the amygdala and total brain growth at this stage of development.\nUnfortunately, the paucity of longitudinal brain imaging data has precluded a comprehensive analysis of trajectories of brain growth in autism. Although the relationship between amygdala growth and brain growth may not ultimately be the best algorithm for defining phenotypes of brain growth in autism, our data provide suggestive evidence that different trajectories of brain growth will be identified. Autism is a heterogeneous disorder, 24, 30 and multiple behavioral, biological, and neuropathological phenotypes will undoubtedly be discovered. Our findings suggest that different brain growth phenotypes exist and should be explored further in conjunction with clinical outcomes. It is our hope that the identification of various phenotypes of autism will translate into more targeted treatments and better outcomes for children with autism. We especially thank all the families and children who participated in the Autism Phenome Project."}]