[{"section_title": "INTRODUCTION 12", "text": "The demand for high-resolution forecasts of coastal processes, including wind, water levels, currents and waves has been steadily increasing over the past decade. The global operational multi-grid WAVEWATCH III ® wave model (WW3, Tolman et al. 2002;Chawla et al. 2013), run by the National Weather Service's (NWS) National Centers for Environmental Prediction (NCEP), features a grid resolution of up to 4 arc-min (≈7.5 km) in these coastal regions, which does not provide sufficient forecaster guidance. Centralized modeling at NCEP at these nearshore scales is impractical from a computational point of view. In addition, regions differ with respect to the relevant physical processes, resolution requirements, and so on. It is therefore desirable that forecasters at local Weather Forecast Offices (WFOs) have control over the local model setup, and produce wave forecasts that are consistent with their local wind forecasts. For these reasons, the NWS is following an approach of decentralized nearshore wave computation. The Advanced Weather Interactive Processing System (AWIPS) is an information processing, display, and telecommunications system that is the cornerstone of the NWS's operational forecasting infrastructure at WFOs and National Centers such as the National Hurricane Center (NHC) and the Ocean Prediction 1 MMAB Contribution 306 2 Corresponding author address: André van der Westhuysen, UCAR at NOAA/NWS/NCEP/EMC/ MMAB, College Park, MD 20740; e-mail: Andre.VanderWesthuysen@noaa.gov Center (OPC). The NWS is currently in the process of upgrading to the more advanced AWIPS II, offering the opportunity to integrate local model guidance systems, such as high-resolution wave and surge models. The aim of this work is to develop a real-time, deterministic modeling system, run locally at WFOs, which would provide high-resolution, wave model guidance to forecasters, and which would be fully integrated into AWIPS II. The resulting system is called the Nearshore Wave Prediction System (hereafter NWPS). It is intended to consolidate and extend the earlier successful pilot systems IFP-SWAN (Willis et al. 2010) and SR-SWAN (Settelmaier et al. 2011). The NWPS provides high-resolution wave model guidance over a given WFO or National Center's marine domain of responsibility. The wave model SWAN (Booij et al. 1999), or a nearshore version of WW3 (Tolman et al. 2002), is applied as the underlying nearshore wave model, with boundary conditions and forcings being provided by a number of NOAA modeling systems. Within the WFO domain, the model is forced by forecaster-developed local wind fields from the Graphical Forecast Editor (GFE) inside of AWIPS II. Details of these design elements and input sources are given in Section 2. The system is being calibrated and validated for a number of tropical and extratropical storms in the U.S. coast. Section 3 presents an example validation case for Hurricane Isaac (2012). Section 4 closes the paper with conclusions. Figure 1 shows the architecture and data flow of the NWPS system within the AWIPS II framework. Shown are the main structural components of AWIPS II, namely the EDEX data server and the CAVE data visualization and editing interface, and the NWPS computational unit. The block around these elements represents the AWIPS II Wide Area Network (WAN). The process starts by the forecaster preparing a series of official forecast wind fields in CAVE/GFE, and storing these in the EDEX data server. These wind fields are subsequently ingested into the NWPS computational unit. In addition, a number of model or observational data sets are used as input. These are either present in the AWIPS II WAN, or are ingested from NCEP's production ftp server via FTP/Local Data Manager (LDM) on the Local Data Acquisition and Dissemination (LDAD) system. Once the forecaster wind fields and supplementary model inputs have been received, the wave model is run. The NWPS provides two core wave model options, namely SWAN and WW3. In the future, the hydrodynamic model ADCIRC will be added to more accurately account for storm surge (see Section 5). Once the model run is complete, the output is sent to the EDEX data server for storage. The forecaster subsequently extracts these nearshore wave model guidance products and views them in CAVE/GFE. These are used to produce nearshore wave forecasts, which are posted to the National Digital Forecast Database (NDFD). NWPS represents the first numerical model to reside inside of AWIPS II, and therefore presents unique challenges to this framework. The primary design is for NWPS to reside inside of the AWIPS II WAN, and to physically run the numerical model simulations on a 64-bit PX machine in the AWIPS II server rack. However, to accommodate more demanding numerical computations, a second design option is being supported, in which the numerical computation can be carried out on a separate workstation or cluster, physically residing outside of the AWIPS II WAN, and interfacing with AWIPS via the LDAD system. This is in fact the option being used during alpha and beta testing prior to national deployment, and will continue to be supported afterwards. In addition, cloud computing options are being considered."}, {"section_title": "METHOD", "text": ""}, {"section_title": "System architecture", "text": ""}, {"section_title": "Model grids and boundary conditions", "text": "NCEP's global multi-grid WW3 model (hereafter NWW3) computes wave fields over the globe on a 0.5 degree grid, with a series of nested regular grids that increase the resolution to 4-10 arc-min in coastal regions (Chawla et al. 2013). Two instances of NWW3 are run, namely a non-tropical version that is forced with the Global Forecast System (GFS) atmospheric model (NWW3 Multi-1 run) and a tropical cyclone version that is forced with a blend of NOAA Geophysical Fluid Dynamics Laboratory's (GFDL) cyclone atmospheric model and a background GFS field (NWW3 Multi-2 run). Four cycles are produced daily (00Z, 06Z, 12Z and 18Z), each out to 192 hours. The NWW3 results on the 4-10 arc-min coastal shelf grids provide the boundary conditions to a series of high-resolution nested grids (one for each coastal WFO) along the contiguous United States coastline, Alaska, and island regions, which comprises the NWPS system ( Figure 2). In addition, domains have been defined for the national centers NHC/TAFB and OPC ( Figure 3). Two operating modes of NWPS are distinguished: first, under extra-tropical conditions, all NWPS domains receive their wave boundary conditions directly from the NWW3 Multi-1 (non-tropical). During tropical cyclone events, the official NHC wind forecast (Tropical Cyclone Message, or TCM) can differ strongly from the GFDL-GFS results, potentially rendering the NWW3 Multi-2 boundary conditions inconsistent. Therefore, NHC/TAFB will run an instance of NWPS on their Atlantic model grid forced with the TCM wind fields, and provide the wave boundary conditions to the tropical NWPS grids within their domain (Figure 3). The baseline computational grid setup of NWPS is a regular grid with a 1 arc-min resolution at each WFO, and a 18 km resolution over the larger NHC/TABF and OPC domains. These computational grids are denoted as the primary or CG1 grids. Where required, WFOs can implement further sequential nested grids (CG2, CG3, etc.) to achieve higher resolutions over limited-area domains where more detail is required. For some WFOs, the wide range in spatial scales over their domains makes the application of unstructured grids more practical. This feature will be included in upcoming versions of NWPS."}, {"section_title": "Input sources", "text": "Bathymetric and topographic input to NWPS are taken from various digital elevation models (DEMs) composed by the National Geophysical Data Center (NGDC). The baseline bathymetric data for the CG1 computational grids is provided by NGDC's 1 arc-min ETOPO1 Global Relief Model (Amante and Eakins 2009). This global data set provides coverage over all U.S. domains, with a vertical accuracy of ≈10 m, which is considered adequate offshore of the surf zone. ETOPO1 is also the source for bathymetric data applied in the NWW3 model, ensuring consistency. On a regional scale, NGDC's 3 arc-second Coastal Relief Model provides coverage of the contiguous U.S. coastal zone, Puerto Rico, and Hawaii. The 24 arc-second Coastal Relief Model for Southern Alaska (Lim et al. 2011) provides coverage of the Bering Sea, Aleutian Islands and Gulf of Alaska. The vertical accuracy of these models is estimated at ≈1 m. These sources of more detailed data are used to provide bathymetric data to the higher-resolution CG2, CG3, etc. nested computational grids in NWPS. In the present version of NWPS, the influence of the water level and currents on the wave field is considered only in terms of one-way coupling. The often significant influence of the waves on water levels and coastal currents will be incorporated in future versions through local two-way coupling. Large-scale circulation currents such as the Gulf Stream can have a significant impact on coastal wave fields (e.g. Haus 2007;Zhang et al. 2009). The effect of ocean currents are taken into account in NWPS by including surface current fields from NCEP's Global Real-Time Ocean Forecast System (RTOFS-Global, Mehra et al. 2011). RTOFS-Global is based on a 1/12 o eddy-resolving 3D baroclinic implementation of the HYbrid Coordinates Ocean Model (HYCOM, Chassignet et al. 2009), run once daily at NCEP. In shallow coastal areas, good estimates of total water depths are important for accurate wave transformation. Water depths are determined by a combination of the topography-bathymetry and the contributions to the water level from tides and surge. Two modes of NWPS operation, related to the water level field source, are again distinguished: During extra-tropical events, the uncertainty in the atmospheric forcing is comparatively small. The National Weather Service therefore opts to provide single deterministic, but detailed, hydrodynamic model guidance. Therefore, for these conditions,  (Luettich et al. 1992;Luettich and Westerink 2004), featuring both tidal and surge influences. Tropical events, on the other hand, are characterized by a high uncertainty in the atmospheric forcing. As a result, a probabilistic approach is followed by NHC to produce cyclone-related coastal surge forecasts during tropical cyclone events using the P-Surge system, based on the highly-efficient Sea, Lake, and Overland Surges from Hurricanes (SLOSH) model (Jelesnianski et al. 1992). One type of output from P-Surge is the composite surge level fields associated with a given exceedance level (e.g. 10-50%). Since these exceedance fields represent a single water level surface, they can be applied in a single deterministic NWPS run. Typically WFOs apply fields with low exceedance levels (e.g. 10%) far ahead of the time of landfall, and greater exceedances (e.g. 50%) close to landfall as the uncertainty decreases. Since SLOSH does not presently include tidal effects, external tidal fields have to be applied. For this, the (deterministic) tidal component of ESTOFS is combined with the P-Surge fields to obtain the final cyclone-related water level fields. Note, however, that P-Surge results will account for tide in the near future. Since the P-Surge fields include inundation of overland regions, it enables the computation of overland wave in flooded areas in NWPS, as will be shown below."}, {"section_title": "Wave model version and physics", "text": "As mentioned above, NWPS offers SWAN and WW3 as core wave model options. The validation example presented here was produced using the SWAN model, version 40.81. The following settings for model physics are applied: • Wind input and whitecapping according to Komen et al. (1984), as modified by Rogers et al. (2003). • Quadruplet interactions using the DIA formulation by Hasselmann et al. (1985), with Cnl4 = 3x10 7 and λ = 0.25. • JONSWAP formulation of Hasselmann et al. (1973) for bottom friction with the coefficient Cf,JON = 0.038 m 2 /s 3 . • Depth-induced wave breaking according to Battjes and Janssen (1978), with αBJ = 1.0 and λBJ = 0.73."}, {"section_title": "•", "text": "Triad interactions using the LTA formulation by Eldeberky (1996), with αEB = 0.05. In addition, the following numerical settings were applied: • Gibbs et al. (2012) studied time stepping and iteration options for SWAN, from which a time step of 600 s combined with 1 iteration was selected as an optimal balance between accuracy and computational speed. These settings are also applied here."}, {"section_title": "Post-processing", "text": "The high-resolution nearshore wave output from NWPS is post-processed into a number of model guidance products, including integral wave fields, wave spectra, and partitioned wave data. These are described below."}, {"section_title": "a) Integral wave fields wave spectra", "text": "The basic model output from NWPS are fields of the integral parameters significant wave height, peak wave period, and peak direction, typically produced every 3 h out to 90 h. In addition, frequency spectra are output at select locations. These outputs are all available for viewing and editing in the AWIPS II CAVE/GFE visualization module, from where it is posted to the NDFD.  "}, {"section_title": "b) Partitioned wave fields and time series", "text": "In order to provide forecasters with a comprehensive overview of the wave systems in their region of responsibility, the directional wave spectrum at each grid point is partitioned using the inverse catchment method of Vincent and Soille (1991) and Hanson and Phillips (2001). With this method, various coherent regions of variance density in the directional spectrum are identified as separate partitions. To ensure spatial and temporal coherence, these partitioning results are consolidated into wave systems by means of spatial and temporal tracking algorithms (Van der Westhuysen et al. 2013). The resulting wave systems are presented in terms of spatial fields and Gerling-Hanson time series plots. The latter show the progression of the wave height, period and direction of the various wave systems in time, along with the variation of local wind."}, {"section_title": "VALIDATION", "text": "To demonstrate the full functionality of the NWPS during a tropical cyclone event, a hindcast of Hurricane Isaac is discussed in the following sections. In this demonstration, Isaac was initially simulated over the NHC/TAFB domain (Figure 3) with a spatial resolution of 18 km, producing boundary conditions for a 1.86 km resolution nest over the WFO New Orleans/Baton Rouge domain, followed by a higherresolution 500 m inner nest over New Orleans and Lake Pontchartrain (Figure 4), where Isaac made landfall. Considering the limited wave observations over this nested domain during this event, aside from NDBC 42012, the primary focus of this hindcast is to illustrate the significant influence that increasing water levels due to surge has on the modeled wave fields over very shallow water regions. The current pilot system described in the SR-SWAN configuration across Southern Region (Settelmaier et al. 2011) does not include water level as input. As a result, wave heights computed can contain significant lowbiases over the very shallow shelf waters of the Gulf of Mexico during tropical events."}, {"section_title": "Model setup", "text": "The bathymetry for the NHC/TAFB domain grid was taken from NGDC's 1 arc-min ETOPO1 model, whereas those for the WFO New Orleans/Baton Rouge domain and its high-resolution nest were compiled from NGDC's 1 arc-sec (≈30 meter) Northern Gulf Coast DEM. For this hindcast, atmospheric forcing was not taken from the usual TCM fields, but rather from reanalysis H*Wind fields (Powell et al. 1996), overlaid on background, 3-hourly, short-range forecast fields from GFS. The H*Wind fields represent the maximum sustained 1-min wind speeds over a sampling period of 5-10 min, denoted as V60,600. These were converted to 10 min mean values (V600), which are more appropriate for use in wind wave models. These quantities are related via a gust factor G60,600, such that V60,600 = G60,600*V600 (Powell et al. 1996). Note that a similar conversion should be applied to TCM wind fields during forecast operations. A gust factor of G60,600 = 1.05 was selected based on a sampling period of 10 min and a \"at sea\" surface type (see Harper et al. 2010, Table 1.1). This composite wind field time series was produced for the Figure 6. NWPS wave results at NDBC 42012, near Mobile, AL, showing hindcast significant wave height (Hm0), peak period (Tp) and peak directions against observations. period 22 Aug-31 Sept 2012, to capture the cyclone generation over the Atlantic. For water levels, ESTOFS (tides)/P-Surge fields are applied as input to the wave model, as outlined in Section 2. Three runs are presented, each with a different treatment of the imposed water level fields: (i) an inundation run with P-Surge surge levels and ESTOFS tidal levels, in which the inundation of overland areas are included, (ii) a non-inundation sensitivity run with P-Surge surge levels superimposed on ESTOFS tides, but with overland regions excluded (treated as dry points in the wave model), and (iii) a sensitivity run featuring only tides from ESTOFS (no surge component and no inundation). At present, the P-Surge water level fields are issued as spatially-varying, but stationary values, corresponding to the peak of the storm. Therefore, in order to obtain a realistic temporal variation, the water level field was interpolated from the ESTOFS meteorological tide input to this P-Surge level field (20% exceedance) on either side of the storm, as shown in Figure 5. In future, time varying, incremental exceedance P-Surge fields will become available, avoiding the need for this interpolation procedure."}, {"section_title": "Storm Overview and Results", "text": "Although Isaac was a minimal category 1 hurricane Figure 7. Field output from NWPS displaying the total water depth several days in advance of landfall (top) compared to the total water depth at or around landfall (bottom). Note the large inundation areas over the Mississippi Delta marshes and around Lake Pontchartrain. Hurricane best track included (white line). prior to landfall (1200 UTC 28 August at 139 km or 75 nmi southeast of the Mississippi River), the combination of its slow forward movement toward the southeast Louisiana coast and large easterly wind field north of its track generated large waves and allowed an extensive amount of water to build up against the levees east of the Mississippi River. Estimated inundation (above ground level) calculated from USGS tide pressure sensors, USGS high-water marks, and NOS tide gauges in southeastern Louisiana ranged from 4-5 m (13-17 ft) at the peak of the surge (Berg 2013). Total significant wave heights of up to around 7 m were recorded at NDBC 42012, southeast of Mobile Bay (Figure 4). Figure 6 shows a time series of the modeled significant wave height, period and direction against observations. These all agree generally well during the second half of the run, as Isaac was approaching and making landfall.  Figure 7 shows the spatial distribution of the total water depths used in this model simulation several days leading up to the time of landfall (hr 0 of the simulation) versus the total water depths during the peak of the surge (hr 169 of the simulation) at or around landfall. Peak inundation output from P-Surge (20% exceedance height) reached approximately 4 m between the Mississippi Delta and Lake Borgne, as Isaac was making landfall. Inundation between Lake Borgne and Pontchartrain ranged from 1.2-2.3 m (4-7.5 ft) just south of the Rigolets. These inundation levels are in close agreement with those reported by Berg (2013). Furthermore, water level rises due to surge over portions of the shallow Lake Maurepas, Pontchartrain and Borgne ranged from 1.5-2 times higher than the normal levels. Figure 8 shows the Figure 9. Field output from NWPS displaying the total significant wave height and peak wave direction several days in advance of landfall (top) compared to the total significant wave height and peak wave direction at or around landfall (bottom). Hurricane best track included (white line). time series of the ESTOFS/P-Surge water levels used in the model at the stations Dauphin Island (DPHA1) and Shell Beach (SHBL1), and compares them to observations. Although there are some differences between the total magnitudes and timing at and during the peak of the surge, the results generally agree well, with no conclusive positive or negative biases. Figure 9 shows wave height and peak direction output from NWPS over the New Orleans and Lake Pontchartrain domain at hr 0 and at hr 169 (peak of the surge). Note the large areas of inundation over which wave energy is predicted. Figure 10 shows a time series comparison of simulated wave heights at SHBL1 and over the very shallow waters of the far eastern section of Lake Pontchartrain (point 1), suggesting large increases at the storm peak. One caveat noted in this inundation test is that we are not precisely resolving terrain during the wave computations, with regard to structures overland. Therefore, wave results could contain a rather high bias downstream of flooded overland areas. Further testing will be necessary in this regard."}, {"section_title": "b) Non-Inundation test, excluding overland areas", "text": "Next, we investigate model results when inundated overland areas, alluded to above, are excluded (i.e. remain dry in the model). All wet grid points contain identical water levels as the first test. This test is important, since present nearshore wave and surge model systems (e.g. SR-SWAN and ESTOFS) often exclude overland regions. Figure 11 shows a spatial distribution of the total water levels used in this simulation, where only the sea points (grid points that are wet at MSL) were included. By excluding inundated land points, modeled wave heights over the wet grid points downstream of the previously flooded dry areas are notably different. The time series results ' Figure 11. Same as Figure 6, except without dry grid points. in Figure 10 shows that significant wave heights at point 1 were reduced by up to 20% compared to the test run that included the inundated dry grids upstream of sample point 1, south of the Rigolets. At SHBL1, the difference in wave height is as much as 50%. This general pattern was consistent at other sample points just downstream of the previously flooded dry grid points. Including overland grid points therefore has a significant influence on both overland and sea points in the present case."}, {"section_title": "c) Tide-only sensitivity test", "text": "To demonstrate the full effects that surge can have on the model-estimated wave heights, the final test included only the tidal component from ESTOFS for the water level input. Figure 12 clearly shows a strong correlation between increasing water levels and higher simulated significant wave heights across shallow water regions of New Orleans, in this case. This shows that significant wave heights reached as high as two times the magnitude when surge was included. These significant differences are further illustrated in the wave height time series comparisons in Figure 10. Similar results were alluded to by Figure 12. Field output from NWPS at Isaac's landfall, showing fractional increase of significant wave height due to the inclusion of the P-Surge surge levels (inundation zones omitted). Scale in the image ranges from 1-2 m (from blue to red). Huang et al. (2010) across the Tampa Bay region, where an Ivan-like hurricane was simulated making landfall just north of Tampa Bay."}, {"section_title": "CONCLUSIONS", "text": "This paper presented the development of the Nearshore Wave Prediction System, a real-time, deterministic modeling system, which will be run locally at every coastal Weather Forecast Office, providing high-resolution, wave guidance to forecasters that incorporates one-way surge and tide coupling. The validation of the proposed system was shown for the field case of Hurricane Isaac (2012). Based on the results of this study, the following conclusions can be drawn: • With NWPS, coastal Weather Forecast Offices nationwide will be able to produce detailed nearshore wave model guidance consistent with their local wind forecast. • During tropical cyclone events, WFOs will be able to initialize their local wave model grid boundaries with the output of a coarser NHC/TAFB wave model run (forced by the official NHC wind forecast) and utilize the P-Surge forecast guidance (i.e. 10-50% exceedance heights) as water level input. This will lead to a seamless mosaic of digital marine forecasts between coastal WFOs impacted. • Increased water levels due to surge have an enormous impact on the computed total significant wave heights across shallow water regions, such as the domain of responsibility of WFO New Orleans/Baton Rouge. • A higher density of overland wave observations is needed for further validation of the wave height sensitivity results presented here."}]