[{"section_title": "Abstract", "text": "Foliar nitrogen (N) in plant canopies is central to a number of important ecosystem processes and continues to be an active subject in the field of remote sensing. Previous estimates of foliar N at the landscape scale have primarily focused on intact forests and grasslands using aircraft imaging spectrometry and various techniques of statistical calibration and modeling. The present study extends this work by examining the potential to estimate the foliar N concentration (%N) of residential, agricultural and other cultivated grassland areas within a suburbanizing watershed in southeastern New Hampshire. These grasslands occupy a relatively small fraction (17.5%) of total land area within the study watershed, but are important to regional biogeochemistry and are highly valued by humans. In conjunction with ground-based vegetation sampling (n = 20 sites with 54 sample plots), we developed partial least squares regression (PLSR) models for predicting mass-based canopy %N across management types using input from airborne and field-based imaging spectrometers. Models yielded strong relationships for predicting canopy %N from both ground-and aircraft-based sensors (r 2 = 0.76 and 0.67, respectively) across sites that included turf grass, grazed pasture, hayfields and fallow fields. Similarities in spectral resolution between the sensors used in this study and the proposed HyspIRI mission suggest promise for detecting canopy %N across multiple forms of managed grasslands, with the possible exception of areas containing lawns too small to be captured with HyspIRI's planned 60 m spatial resolution."}, {"section_title": "Introduction", "text": "Through its association with proteins and plant pigments, foliar nitrogen (N) plays an important regulatory role in photosynthesis, leaf respiration and net primary production in terrestrial ecosystems (Field & Mooney, 1986; Ollinger & Smith, 2005; Reich et al., 2006) . Because N is a common and widespread limiting resource to plants, spatial patterns of foliar N are also related to fluxes of carbon, water and energy, and are therefore central to understanding the role terrestrial ecosystems play within the larger Earth system Ustin, 2013) . At the landscape scale these patterns are driven by environmental attributes including climate, species composition, soil condition, disturbance history and management practices. Given its importance, foliar N has been the focus of considerable attention in the field of remote sensing spanning several decades (e.g., Martin, Plourde, Ollinger, Smith, & McNeil, 2008; Ramoelo et al., 2012; Wessman, Aber, Peterson, & Melillo, 1988) . Many investigations use high spectral resolution data from airborne and orbital platforms for their ability to distinguish subtle reflectance features that relate to plant biophysical status, including N (Chambers et al., 2007) . While the foundational methods are rooted in sample-based spectroscopy in laboratory and agricultural settings (Marten, Buxton, Brink, Halgerson, & Hornstein, 1984; Park, Agnew, Gordon, & Steen, 1998) , more recent efforts at estimating foliar N using high spectral resolution data have primarily concentrated on intact forests and grasslands due to their spatial extent and documented importance to the Earth system (He, Guo, & Wilmshurst, 2006; McNeil et al., 2008; Ramoelo et al., 2012; Smith et al., 2002; Townsend, Foster, Chastain, & Currie, 2003) . Although these and other investigations have successfully classified N status in forests and grasslands, difficulties associated with the diversity of land ownership and land management objectives have been an impediment to applications in developed landscapes (Milesi et al., 2005) . Several studies have successfully delineated lawns and other urban plant canopies using high spatial resolution imagery (Walton, Nowak, & Greenfield, 2008; Wu & Bauer, 2012) , but the use of remote sensing for estimating biochemistry and nutrient status in developed landscapes remains in its infancy (Davies, Edmondson, Heinemeyer, Leake, & Gaston, 2011) .\nThe cultivation of grasses for animal forage or esthetic purposes is a near ubiquitous practice in human-dominated landscapes and often represents important shifts in terms of ecosystem function and services from surrounding ecosystems (Foley et al., 2005) . Turf grass surface area in the United States has been estimated at 163,812 km than that of corn, the nation's largest irrigated crop (Milesi et al., 2005) . When pastures and hayfields are included, cultivated grasses comprise 707,627 km 2 , or 8.76%, of total land area in the conterminous United States (Fry et al., 2011) . As with many intensively managed systems, these grasslands embody tradeoffs among various ecosystem services, with consequences affecting both human and environmental welfare (Kaye, Groffman, Grimm, Baker, & Pouyat, 2006) . They comprise an important base of our food system and help define the locations we inhabit, while often requiring inputs of chemical fertilizers, irrigation water, and energy to meet desired management goals (Cassman, Dobermann, & Walters, 2002; Falk, 1976) . Through these pathways, and by altering soil structure, ground water penetration, and surface water flow, the cultivation of grass has substantial influence on terrestrial and aquatic biogeochemical cycles (Kaushal, McDowell, & Wollheim, 2014; Pataki et al., 2011; Trowbridge, Wood, Underhill, & Ellsworth, 2013) .\nAccurate estimates of grassland N status in developed landscapes would stand to advance our understanding of management decisions and their implications at a variety of scales -vis-à-vis estimation of nutrient use efficiency and yield estimation, as well as tradeoffs of nutrient additions versus runoff, to name a few examples. High fidelity, groundbased remote sensing provides a tool for characterizing canopy N at fine spatial and temporal scales (e.g., lawns and small pastures at frequent intervals throughout a growing season), while airborne remote sensing platforms offer the potential for characterizing N across larger landscapes. The proposed HyspIRI sensor, with a repeat cycle of nineteen days, would provide an opportunity for mapping N at landscape to regional scales, holding particular promise for grass management and adaptive grazing practices aimed at maximizing rangeland and pasture resources.\nFrom a remote sensing standpoint, the diversity of management objectives in developed systems poses challenges that are less prevalent in more natural ecosystems (Boegh et al., 2002; Booth & Tueller, 2003) . Moreover, while remote sensing imagery has been used to detect water stress (Gao, 1996; Tilling et al., 2007) , N status (Boegh et al., 2002; Gamon, Field, Roberts, Ustin, & Valentini, 1993; Ramoelo et al., 2012) and plant biomass (Paruelo, Epstein, Lauenroth, & Burke, 1997; Running et al., 2004) in grasslands, our understanding of the combined effect of these factors on whole canopy reflectance is incomplete (Ollinger, 2011) . It remains unclear whether a generalizable approach for estimating foliar N via remote sensing can accommodate the range of management strategies encountered within a developed landscape. Resolving this is particularly pertinent in light of the proposed HyspIRI mission, which will provide global coverage of high-fidelity imaging spectrometer data from an orbital platform. To address this question, we sought to examine the use of high spectral resolution remote sensing from both airborne and ground-based platforms for detecting foliar N within cultivated grasslands. Calibrations of measured canopy N with reflectance were developed using spectral data from both platforms to explore questions regarding scaling and to address the utility of each towards developing a generalized approach of estimating N in grasslands. Our study focused on a mixed-use landscape in southeastern New Hampshire that included a wide range of grass management strategies including turf grass, hayfields, actively grazed pastures, and fallow fields. Results are presented with respect to the utility of methods we tested and their potential application to environmental modeling, resource management and for future applications with HyspIRI."}, {"section_title": "Methods", "text": ""}, {"section_title": "Study sites", "text": "The study was conducted within the Lamprey River Watershed (LRW) in southeastern New Hampshire (43.10°N, 71.11°W), a coastal area encompassing 479 km 2 and nine towns that drains into the Great Bay National Estuarine Research Reserve. The watershed has a diverse history with more than 300 years of land use change following European settlement (Hamilton, 1882) . Today, rural to urban development gradients are present throughout the watershed with human population ranging from zero in state park lands to greater than 620 people km −2 within larger towns. Although the watershed is predominately forest, non-forested land accounts for 17.5% of the total area. Residential turf and agricultural grasslands are mixed throughout this fraction and represent important loci for human-environment interactions. The cultivation and maintenance of grasses has a strong influence on biogeochemistry within the watershed (Fissore et al., 2012) and the U.S. Environmental Protection Agency has established that water quality in both the Lamprey River, and the Great Bay estuary, is impaired by excess N. Twenty-seven percent of the total non-point source N pollution coming into Great Bay is attributed to residential and agricultural fertilizer use (Trowbridge et al., 2013) , highlighting the need for methods to better understand the N status of managed grasses. In 2012, twenty field sites representing four management types (7 residential & commercial turf, 4 pasture, 3 hayfield, and 6 fallow) were selected for the purpose of vegetation sampling and image calibration (Fig. 1) . The sites were selected using a stratified random sampling design with access to private property influencing the final number included in each management type."}, {"section_title": "Vegetation sampling", "text": "In 2012, field sampling was conducted between late July and midAugust to ensure that samples were collected within fourteen days of the aircraft imaging spectrometer data collection (Section 2.4). Additional sampling in 2013 was conducted to expand the number of observations available for comparison with coincident ground-based spectra, but were not used in the calibration against 2012 aircraft image data. Sampling dates in 2013 were chosen to match 2012 in terms of position within the growing season and to capture similar conditions relative to time since mowing and other management practices. In total, 270 biomass samples were collected for foliar %N analysis (see Section 3.2).\nAt each of the twenty field sites, two to five plots were established for vegetation sampling such that a minimum of ten plots represented each management type (54 in total). Plots were 5 m by 5 m in size and were located within a larger homogeneous area (minimum of 15 m by 15 m) to best characterize each site's management practices while avoiding potential edge effects of adjacent parcels. The mixed nature of management on a given site allowed some sites to include plots of more than one management type.\nPlots were sampled for aboveground biomass to facilitate measurement of canopy nitrogen concentration (%N). Plot-level values represent the mean of data collected at the five sample locations within the plot boundaries. Biomass sampling consisted of shearing all standing foliage to ground level within a randomly placed 10 × 50 cm sampling frame. Once collected, samples were dried at 70°C for 48 h and ground using a Wiley mill with a 1 mm mesh screen. Canopy %N (g N·100 g biomass − 1 ) for all dried and ground samples was determined using a FOSS NIR 6500 bench-top spectrometer as described by Bolster, Martin, and Aber (1996) . Because dried, ground samples included total biomass from grass species present within the sampling area; %N values represent multi-species means and were inherently weighted by the fractional abundance of each species present. Although existing calibration equations have proven accurate for grassland systems generally (Park, Gordon, Agnew, Barnes, & Steen, 1997; Park et al., 1998) , we derived a calibration equation specific to this study in order to ensure that the full range of conditions would be captured. The calibration was based on a random subset of 103 samples collected during 2012, for which canopy %N values were measured with a mass spectrometer and validated using leave-one-out repeat calibration (Shetty, Rinnan, & Gislum, 2012) ."}, {"section_title": "Ground-based spectroscopy", "text": "Ground-based reflectance was measured with an ASD FieldSpec 4 handheld spectroradiometer (www.asdi.com) under clear sky conditions at all sites, coincident with vegetation sampling. Data were collected within 2 h of solar zenith in order to minimize the effect of shadows.\nThe ASD has three detectors that measure radiance over the spectral range of 350-2500 nm. The visible and near-infrared (VNIR) sensor measures the region of the spectrum from 350 to 1000 nm at 1.4 nm intervals, with~3 nm spectral resolution; radiance in the short-wave infrared (SWIR) region is measured with two detectors-one for the wavelength range of 1000-1800 nm, and another for the range of 1801-2500 nm-both with 2 nm sampling interval and 10 nm spectral resolution. The ASD was equipped with an 18°fore optic and positioned 1 m above the canopy, resulting in a target ground sampling resolution of 0.08 m 2 . A Spectralon® reference panel calibrated to the U.S. NIST standards was used as a white standard, so that collected reflectance data were represented as absolute reflectance. Fifty spectral reflectance signatures were logged during a random walking survey of each 25 m 2 plot. Care was taken to avoid sampling areas where vegetation had been trampled by fieldworkers. Each of the 50 spectra represented the average of 10 sample measurements over a 1-second integration time, and interpolated to 1 nm intervals within the 350 to 2500 nm spectral range (i.e., 2151 spectral channels). Canopy reflectance for each plot represented the average of these 50 spectral reflectance signatures. Spectral surveys conducted during the 2012 field season occurred within two weeks of the airborne remote sensing mission to minimize temporal variation between the two datasets. During the 2013 field season, spectral surveys were conducted during the same time of year in conjunction with field sampling."}, {"section_title": "Airborne remote sensing data collection", "text": "Airborne imaging spectrometer data were acquired for the entire LRW in 33 flight lines on August 4th and 7th in 2012 to coincide with peak growing season conditions. Flight lines were oriented in the principal plane of the sun to minimize cross-track brightness gradients.\nData were obtained by the ProSpecTIR VNIR/SWIR (VS4) imager (SpecTIR LLC, Reno, Nevada). The ProSpecTIR VS4, a co-boresighted imaging system that integrates VNIR and SWIR sensors (400-2450 nm) into a single system with real-time pixel co-registration (see Wong, 2014) , was flown on a Cessna fixed wing aircraft at an average altitude of 4180 m, yielding a spatial resolution of 5 m and swath width of 1600 m with 35% sidelap between flight lines. The VNIR sensor measures radiance in the 400-970 nm range, with a 9.2 nm sampling resolution and~4 nm spectral interval; the SWIR sensor measures radiance in the 970-2450 nm range, with a 5.8 nm sampling interval and~9.5 nm spectral resolution. With this configuration, the ProSpecTIR VS4 provided calibrated radiance data in 360 spectral channels over the range from 400 to 2450 nm."}, {"section_title": "Data processing and analysis", "text": ""}, {"section_title": "Spectral preprocessing", "text": "Reflectance spectra from ground and aircraft instruments were processed using a combination of R version 2.15.1 (www.r-project. org) and ENVI 4.7 (Exelis Visual Information Solutions, www.exelisvis. com). Airborne data were converted by SpecTIR LLC from calibrated radiance to apparent surface reflectance using ATCOR4. Field plots were located within the aerial imagery using GPS coordinates collected during field surveys and were represented as single 5 × 5 m pixels centered at these locations. To facilitate comparison between datasets for developing spectral calibrations (Section 2.5.2), ground-based spectra from the ASD were saved as spectral libraries in the ENVI software, and convolved to the ProSpecTIR VS4 data with the spectral library resampling tool using sensor band centers and the FWHM of the band with an assumed Gaussian shape. Spectral channels measured by the ASD that fell outside the range of the airborne sensor spectral range, and those that fell within visibly noisy regions or where atmospheric absorption resulted in no usable data (i.e., b400 nm, 1350-1450 nm, and 1800-2000 nm) were removed from both datasets.\nGround-based spectral data were further processed to remove spectra that were dominated by non-vegetation surfaces or shadows. This typically resulted in the removal of 0-5 of the 50 spectra collected per plot. At the plot level, and across management types, simple linear regression was used to compare the overall shape and agreement of canopy reflectance from ground-and aircraft-based spectra."}, {"section_title": "Partial least squares regression model development", "text": "Relationships between canopy reflectance and vegetation variables (canopy %N, water content, height, and biomass) were assessed using partial least squares regression (PLSR) and validated using leave-oneout repeat calibration in JMP Pro 10 (JMP®, Version 11. SAS Institute Inc., Cary, NC, 1989 -2013 . Leave-one-out cross validation techniques, such as those contained within the JMP PLS routine, estimate error by iteratively withholding each data point and using them to calculate the aggregated error of models developed in their absence. Although this approach is an established and robust method of estimating internal error in PLSR models, it should not be confused with validation using data that are fully independent of determining a models' structure as well as coefficients. PLSR is an Eigen-based analysis designed to maximize the covariance between two datasets. In practice, PLSR reduces the full spectrum into a smaller set of ordinated factors to optimize the covariance within prediction factors (i.e., spectra) and observed data simultaneously Wold, 1994) . PLSR excels over traditional regression techniques with data containing many more prediction variables relative to the number of observations, making it particularly well suited for high spectral resolution data. The final number of latent factors incorporated in each PLSR prediction model was determined by minimizing the root mean predicted residual sum of squares (PRESS), generated by leave-one-out cross validation (Denham, 2000; Tobias, 1995) . Models incorporating data from all plots were generated using the ground-based and airborne spectral datasets discretely. Predictive models that used ground-based spectra incorporated data collected during both study years and therefore had larger sample sizes when compared with models based on airborne spectra, where data were only available for the 2012 season (see Table 2 ). The prediction accuracy and precision of the PLSR models were assessed by the coefficient of determination (r 2 ) and root mean square error (RMSE), respectively."}, {"section_title": "Image application for %N estimation", "text": "Developed, cultivated, and grassland pixels were extracted from the aerial imagery using the 2010 NOAA C-CAP land cover classification (DOC-NOAA, 2013) . Pixels classified as developed were included in the initial extraction due to the finely mosaicked nature of commercial and residential grasslands in our region of study. Buildings and roads within these pixels were then masked using the 2010 Impervious Surfaces in Coastal New Hampshire and Southern York County, Maine dataset (CSRC, 2011). Both classification datasets are based on Landsat 5 imagery with a spatial resolution of 30 m. Pixels classified as having less than 30% impervious surfaces were included in the final classification scheme in an effort to include grassland parcels smaller than 30 × 30 m. Canopy %N was then estimated for the remaining image data by applying the airborne PLSR model (described in the previous section)."}, {"section_title": "Results", "text": ""}, {"section_title": "Summary of field measurements", "text": "Canopy %N, and aboveground biomass differed significantly (p b 0.05) by management type, with the exception of agricultural grasses (i.e., pasture and hay; Table 1 ). Pasture and hayfield canopy %N and biomass were not statistically significantly different from each other, but were significantly different from turf and fallow grasslands. Average nitrogen concentration was highest in turf grasses (2.82%) followed by agricultural grasses (2.71% combined) and lowest in fallow fields (1.73%). Fig. 2 shows foliar %N values measured by mass spectroscopy in relation to those predicted by the study-specific NIRS calibration. This calibration was based on a random subset of 103 samples (collected in 2012) and was used to determine the N concentration of the remaining samples (n = 163). Of the total 270 biomass samples collected and analyzed for %N using laboratory NIRS (see Section 2.2), six samples fell well below the range of %N values included in the calibration dataset and were not included in the development of regression models used to estimate %N with airborne and ground-based spectra. These samples are believed to have included a large portion of dead biomass resulting in low N values relative to the rest of the sample set."}, {"section_title": "Lab-based canopy %N calibration", "text": ""}, {"section_title": "Calibration of ground-and aircraft-based spectra", "text": "PLSR models incorporating data from all plots and management types produced strong predictive calibrations for canopy %N using both aircraft and ground-based datasets (Fig. 3, Table 2 ). The calibration using ground-based spectra yielded a better fit (r 2 = 0.76, RMSE = 0.29) than that based on aircraft data (r 2 = 0.67, RMSE = 0.36) although both were highly significant (p b 0.0001)."}, {"section_title": "Relative importance of spectral bands in calibrations", "text": "The contribution of individual spectral bands in each of the significant PLSR calibration models described above was assessed using standardized model coefficients and the variable importance of projection (VIP) statistic of Wold (1994) (Fig. 4) . The VIP score describes the importance of a given predictor in the projection of the latent variables that underlie a PLSR model (Chong & Jun, 2005) . According to Wold (1996) , predictors with a VIP score of one or higher are typically important in the resulting projection and those less than 0.8 tend to add little. VIP scores for both airborne and ground-based canopy %N calibrations indicate the importance of NIR bands located between 750 and 1300 nm and, to a lesser extent, 1550-1750 nm. These peaks are also important in the prediction of canopy height, biomass and water content. "}, {"section_title": "Sensor comparison", "text": "At the plot level and across management types, canopy reflectance derived from airborne and ground-based sensors showed agreement in the overall shape of spectral reflectance curves (Fig. 5) , with differences in brightness observed between sensors across some regions of the spectrum (Table 3) . Generally, airborne spectra tended to be brighter in the visible region and dimmer throughout the NIR (750-1800 nm) as compared to ground-based spectra, likely a result of atmospheric scattering of light and water vapor that were not fully accounted for during the processing of radiance to surface reflectance."}, {"section_title": "Predicted canopy %N for grasses within the study region", "text": "The distribution of cultivated grasslands in the LRW follows regional development trends concentrated in southern and eastern portions of the watershed (Fig. 6) . Predicted foliar %N values across the watershed exhibited a normal distribution with a mean of 2.24% and a range of 0.25% to 5.0%. These values fall within the range of foliar %N values of grasses compiled by Reich and Oleksyn (2004) for their global study of plant N and phosphorous. While visual inspection of the watershed N prediction revealed a wide range of canopy %N values in all management groups, direct comparison of canopy %N across the four management types at the landscape level proved difficult due to the lack of an existing detailed classification that differentiates cultivated grasslands by management type. Existing classification schemes for the study area have a minimum spatial resolution of 30 m. While this scale is adequate for discriminating a large number of pasture, hay and fallow fields, it is too coarse to delineate many of the residential turf and other small grasslands in the study area. For example, degrading the airborne %N map for the Durham, NH area to spatial resolutions comparable to Landsat (30 m) and HyspIRI (60 m) illustrates continued utility to detect canopy %N in moderate to large scale cultivated grasslands, but also suggests a weakened sensitivity to within-field estimates of %N, and a loss in the ability to detect small residential lawns (Fig. 7) ."}, {"section_title": "Discussion", "text": ""}, {"section_title": "N detection in cultivated grasslands: challenges and opportunities", "text": "Management actions and the plant responses they induce affect canopy light interactions in complex ways posing challenges in the interpretation of remotely sensed data of cultivated grasslands (e.g., Booth & Tueller, 2003) . Mowing and grazing-the primary mechanisms used to maintain these grasslands-alter aboveground biomass, leaf area index (LAI), leaf water content, soil background and leaf angle distribution (LAD), all of which affect canopy reflectance in multiple ways (Lee & Lathrop, 2006; Wu & Bauer, 2012) . Reflectance features throughout the NIR plateau and short-wave infrared regions played important roles in the prediction of canopy %N within this study. The role of NIR reflectance with respect to canopy %N estimation, likely results from covariation of %N with a suite of plant traits that affect NIR reflectance (Bartlett, Ollinger, Hollinger, Wicklein, & Richardson, 2011; Ollinger, 2011; Sullivan et al., 2013; Wicklein et al., 2012) . Although not measured explicitly in this study, factors such as soil background, LAI, and LAD affect canopy reflectance and therefore also have implications for mapping %N in cultivated grasslands.\nAirborne and ground-based predictions of foliar %N were relatively similar both in terms of the contribution of spectral features and overall predictive ability. However several factors may contribute to disparities between models. First, ground-based calibrations benefited from additional field sampling conducted during the summer of 2013, which resulted in fifteen additional samples available for ground-based calibration (Table 2) . Second, aerial data were atmospherically corrected from at-sensor-radiance to surface reflectance (see Section 2.5.1). While the The drop off in airborne reflectance past 2300 nm, is likely an artifact of the atmospheric correction, however these wavelengths added little to the prediction of %N in both PLS models (Fig. 4) ."}, {"section_title": "Table 3", "text": "Results of linear regression of ground-based and airborne spectra by management type. Coefficient of determination (r 2 ) represents agreement across spectral shape and differences in slope away from 1 indicate change in overall brightness. algorithm used for atmospheric correction is based on implementation of the MODTRAN4 radiative transfer code, a widely accepted industry standard, some atmospheric artifacts can remain (e.g., Burakowski et al., 2015) . In contrast, ground-based spectra were collected 1 m above the canopy and calibrated against a white reference panel during sampling and therefore are not subject to the same magnitude of atmospheric interference. Moreover, airborne data were not calibrated to ground reflectance (e.g., with the ASD). Differences in overall reflectance between airborne and ground-based sensors (Fig. 5 ) therefore seem to point to the existence of residual artifacts from the atmospheric correction resulting in weaker calibrations with airborne data.\nMethods of estimating error in PLSR calibration models include the leave-one-out cross validation approach used here, the split calibration/validation used by Serbin, Singh, McNeil, Kingdon, and Townsend (2014) , and use of independent data that are withheld entirely from model development. These approaches represent tradeoffs between the amount of data available for model building and the degree to which validation data are independent. Here, we used the leave-oneout cross validation approach because it is a long-established method (e.g., Coops, Smith, Martin, & Ollinger, 2003; Martin et al., 2008; Ollinger & Smith, 2005) of validation and offered an efficient way to maximize use of our relatively small dataset. However, because the data used for validation are not completely independent of those used for model development, this approach can exaggerate accuracy estimates over those obtained using withheld data. Permutation-based calibration/validation approaches may permit a more optimal balance between model development and testing in the future (e.g., Serbin et al., 2014) .\nDespite the potential sources of error discussed above, results of our study suggest promise for the use of both ground-and aircraft-based high spectral resolution reflectance data and PLSR models to accommodate a range of grass conditions in predicting canopy %N. As with all PLSR-based approaches, the relationships we describe are based on empirical observations and their application should be restricted to the range of conditions under which they were derived. Determining functional linkages between individual plant properties and spectral reflectance features at the canopy scale would help extend the application of these relationships; however this is often challenging given the complexity of plant canopies and the interrelated nature of many plant traits (Ollinger, 2011) . Defining these causal mechanisms has been an active field of research and often relies on the use of canopy light models (e.g., Zhang et al., 2006) . Although such models have advanced our understanding of canopy light dynamics, they rarely include N because N itself has no distinct optical properties and because our understanding of relations between N and other optically important plant traits is incomplete (Kokaly, Asner, Ollinger, Martin, & Wessman, 2009; Ollinger, 2011) . Grasses are potentially well suited to studying these relationships because, relative to other systems, they are straightforward to measure, quickly respond to nutrient and water treatments and are easy to manipulate, enabling isolation of physical traits such as LAI and LAD (Baghzouz, Devitt, & Morris, 2006; Huang & Fu, 2000; Wilson, 1963) . In addition, their short stature allows collection of ground-based canopy reflectance data with relative ease. For this reason, future research to advance our understanding of causal mechanisms behind linkages between plant properties and spectral reflectance would do well to focus on grasslands."}, {"section_title": "Implications for land management", "text": "Detailed maps of canopy %N in cultivated grasslands have several potential applications with respect to land management. Through its association with plant proteins, foliar N represents an important measure not only of plant productivity but also of pasture and forage quality (e.g., Waramit, Moore, & Fales, 2012) . In watersheds where agricultural grasslands are prevalent, the ability to detect canopy %N could aid managers in the application of fertilizers and management of livestock. The use of remote sensing to tailor management practices is not a novel idea (Knox et al., 2011; Thulin, Hill, Held, Jones, & Woodgate, 2012) ; however its adoption at the watershed to regional scale could provide interesting insights into agricultural systems and efficiencies. The spatial and temporal coverage of the proposed HyspIRI mission has potential for estimating canopy %N and forage quality for large swaths of agricultural grasses that could lead to improved and adaptive grazing management practices (Thulin et al., 2012) .\nIn suburbanizing watersheds such as the LRW, the composition of grasslands often changes to include more residential and commercial turf over other cultivated grasslands (Wu & Bauer, 2012) . This trend can have significant implications in terrestrial and aquatic biogeochemical cycles, as turf grass often requires additional inputs of energy, nitrogen fertilizers, and irrigation water over agricultural grasslands, without the benefit of providing forage for livestock (Falk, 1976) . When paired with ecosystem production (e.g., Ollinger & Smith, 2005) and hydrologic flow models (e.g., Tague, 2009 ), data such as those presented here may prove useful in modeling productivity, helping to close watershed N budgets, and potentially identifying non-point sources of N pollution within river systems. Remotely sensed imagery offers the only effective means to produce the spatially explicit coverage necessary to study landscapes in this way. While it lacks the spatial coverage necessary for broad-scale studies, ground-based spectroscopy enables rapid estimation of canopy %N at relatively low costs and allows for repeated sampling throughout the growing season, making it useful as a monitoring tool in cases where the temporal coverage of aircraft or satellite platforms is insufficient."}, {"section_title": "Relevance to HyspIRI", "text": "Remote sensing applications involving aircraft sensors come with the inherent limitation of the relatively small spatial coverage that can be achieved. Because the spectral data used in our analysis are spectrally similar to those that would be provided globally by HyspIRI, our results suggest promise for %N estimation in cultivated grasslands over much larger areas. However, several hurdles will need to be overcome before this can be achieved. As an example, the spatial resolution of data used in our study was 5 × 5 m, which is typically adequate for capturing residential lawns (Zhou, Troy, & Grove, 2008) as well as larger areas of agricultural grassland. The suggested spatial resolution for HyspIRI is 60 m, which is likely to be adequate for pasture, hay and other agricultural grasslands, but could present a challenge in residential areas given the smaller size of many private lawns (Fig. 7B) . This challenge could potentially be addressed using spectral unmixing (Lee & Lathrop, 2006) , or through a multi-sensor scaling approach whereby small training areas within a HyspIRI scene are captured with aircraft data in order to aid in resolving sources of subpixel variation (e.g., Hope, Pence, & Stow, 2004) . Moreover, understanding the specific plant traits and management activities responsible for observed reflectance patterns will become more important as the areal extent of N estimation activities expands. A more mechanistic understanding would complement the empirical approaches used to date and aid in the effort to build leaf N concentrations and grassland management conditions into models that can be used to better interpret remote sensing signals (Fig. 7) to (A) 30 m (e.g., comparable to Landsat) and to (B) 60 m (e.g., comparable to HyspIRI). At these ground sampling resolutions, detail in residential areas is lost, but variability in %N for large grasslands is still largely captured.\nwhere intensive field data are not available (Ollinger, 2011) . Despite these challenges, results from this study suggest promise for applications of HyspIRI aimed at detecting patterns of vegetation condition in human-dominated landscapes as well as those containing native vegetation."}, {"section_title": "Conclusions", "text": "High spectral resolution remote sensing and PLSR calibration techniques produced effective prediction models for estimating canopy %N (airborne r 2 = 0.67, RMSE = 0.36; ground-based r 2 = 0.76, RMSE = 0.29) across a wide range of management and canopy conditions encountered within a suburbanizing watershed in southeastern New Hampshire. Although results from both ground and aircraft sensors were highly significant, differences between sensors and the likely presence of uncorrected atmospheric artifacts prevented development of predictive relationships that could be generalized across platforms. Nevertheless, similarities in spectral properties between the sensors used in this study and the proposed HyspIRI mission suggest promise for the detection of canopy %N across large swaths of managed grasslands, although the proposed 60 m spatial resolution of HyspIRI data will pose additional challenges to their application in residential areas containing small lawns. Future studies are needed to better understand the mechanisms through which individual grass plant traits are related to canopy reflectance and to develop improved models that can be applied to cultivated grasses more generally."}]