[{"section_title": "", "text": "solar radiation, is trapped by stratification after sea ice melt [e.g., McPhee et al., 1998;Perovich et al., 2008;Jackson et al., 2010]. The NSTM is often observed to overlie a weakly stratified remnant Winter Mixed Layer (rWML), a residual from the previous winter's mixed layer after seasonal restratification. The core of the PSW lies below these three layers, between $40 and 100 m deep in the Canada Basin [Steele et al., 2004]. The salinities of the Pacific water masses are typically used to distinguish them from one another and from the NSTM (see Figure 2). The seasonally warmed PSW may be subdivided into Alaskan Coastal Water (ACW), originating (as the name indicates) from the Alaskan coast, and saltier (and typically, cooler) summer Bering Sea Water (sBSW) thought to originate in the Gulf of Anadyr [Coachman et al., 1975]. The salinity range of ACW is typically taken to be 31 < S < 32, while that of sBSW is taken to be 32 < S < 33. The temperature maxima within these respective ranges are considered to be tracers for ACW and sBSW [Shimada et al., 2001;Steele et al., 2004] (Figure 2). Here we show some amendment to these traditional salinity bounds is required given PSW change in recent years. In addition to its distinct signature in temperature-salinity space, Pacific Water is characterized by low dissolved-oxygen (DO) content [e.g., Falkner et al., 2005], presumably because of respiratory activity and nutrient regeneration; Coachman et al. [1975] note that oxygen utilization rates in the near-bottom water in the Chukchi Sea appear to be extremely high. Marked DO minima in the Canada Basin are found in the salinity range of the sBSW [Timmermans et al., 2010]. Although much is still unknown of flow pathways and dynamics of PSW entering the Canada Basin interior, PSW properties in the interior Canada Basin bear some relationship to Pacific Water inflows to the Arctic. Mooring data indicate increased Pacific water transport through Bering Strait over the period 2001-2011, from about 0.7 Sv in 2001 to 1.1 Sv in 2011; this is associated with increased temperature and freshwater transports [Woodgate et al., 2012; see also Clement Kinney et al., 2014]. Woodgate et al. [2012] conclude that these increases in Bering Strait inflow resulted from an increased Pacific-Arctic pressure head; temperature transport increases were also attributed in part to warmer Bering Sea source waters. Woodgate et al.'s mooring analysis did not include the warm, fresh, Alaskan Coastal Current in the upper ocean, and they point out that the freshwater fluxes (and variability) they compute are likely underestimates since they do not account for changes in the shallowest layers. It is unclear to what extent changing source waters are reflected in the interior CCB; this will depend in large measure on prevailing wind and sea-ice conditions in any given year.  October 2006October , 2009October , and 2012. Contours indicate potential density anomaly (kg m 23 ) referenced to the surface (densities vary primarily in accordance with the salinities); the dashed line is the freezing line at 0 dbar. (b) Profiles of potential temperature corresponding to the curves in Figure 2a. The gray and black portions of the profiles mark the salinity ranges found here to be appropriate for the ACW (29 < S 32:2) and sBSW (32:2 < S 33), respectively. Notice in the latter 2 years, the absence of a maximal temperature in the salinity range of sBSW."}, {"section_title": "Journal of Geophysical Research: Oceans", "text": "\n10.1002/2014JC010273 temporally stable or laterally coherent, but rather is an intermittent feature in space and time. In some cases, the double peak can be attributed to a cold-core anticyclonic eddy rather than an intrusive layer, although existing data are insufficient for a detailed assessment. In 2011, multiple shallower halocline temperature peaks are associated with eddies of the same class as those analyzed by Timmermans et al. [2008].\n10.1002/2014JC010273\n10.1002/2014JC010273 et al., 2013] and sea-ice concentration data were downloaded from the NSIDC. Monthly means were calculated based on daily data, and all variables were linearly interpolated to the same 25 km Equal-Area Scalable Earth Grid (EASE-Grid; www.nsidc.org). Total stress curls were used to compute monthly mean distributions of Ekman downwelling and upwelling; full details are given in Yang [2006Yang [ , 2009. Note that this method does not take into account ocean geostrophic currents which, in addition to wind forcing, drive sea-ice motions. In summer, when wind forcing is typically weaker than in winter, there is likely some error induced by neglecting the ocean geostrophic flow; this is particularly true in frontal and boundary regions (and where ice cover is present) where geostrophic flows are strongest [see, e.g., McPhee, 2013]; however, the general patterns and magnitudes found here should remain the same. Maps of the summer and winter mean distributions of Ekman vertical velocity   Marshall, 1991]. Ekman pumping velocity w e (negative downward) is determined from wind and sea-ice stress fields, u h is the horizontal velocity of a water parcel at the base of the mixed layer (shown as the dashed line), and the subduction rate Su is the mass flux per unit surface area through the mixed layer base. Journal of Geophysical Research: Oceans 10.1002/2014JC010273 (2003)(2004)(2005)(2006)(2007)(2008)(2009)(2010)(2011)(2012) show the strongest region of downward Ekman pumping in the south-central Canada Basin region associated with the strong anticylonic Beaufort Gyre circulation; surrounding regions are characterized by weaker downward pumping (Figure 18). Closer to the coastal regions, Ekman upwelling dominates and transfers fluid from the halocline to the surface where it contributes to water mass transformation in the mixed layer. Ekman pumping has a strong seasonal cycle and month-to-month variability, with weakest values in summer and early fall [Yang, 2009;Proshutinsky et al., 2009]. In the two decades preceding 2013, there was an overall increase in summer Ekman downwelling over the entire Canada Basin associated with a transition to a more intense atmospheric anticyclonic circulation regime in the late 1990s (Figure 18b and see McPhee [2013] and Proshutinsky et al. [2009]). Proshutinsky et al. [2009] demonstrate a correlation between increased freshwater content and this enhanced wind stress curl over the Beaufort Gyre. In 2003-2012, we find only small interannual variability in Ekman pumping with no clear trend. In summer (July, August, September) mean Ekman downwelling is derived over a region of the Chukchi Sea (bounded by 160 W-180 W and 70 N-74 N, consistent with a region having PSW properties at the surface, Figure  19a); similarly small variability is noted in winter, although with mean downwelling about twice as strong as in summer. Between 2003 and 2012, summer-mean subduction in this region is 0.12 6 0.04 Sv (1 Sv 5 10 6 m 3 s 21 ). This rate of about 3310 11 m 3 month 21 implies that almost half of the PSW layer in the CCB could be renewed over a couple of years (taking the area of the CCB approximately 2310 5 km 2 , and PSW thickness of about 100 m). There is likely also some contribution to subduction from lateral induction. The above ventilation rate estimate simply assumes that all of the subducted water is brought along isopycnals to the CCB and does not flow elsewhere. It nevertheless suggests that changes in PSW characteristics in the CCB in any given year could reflect summer characteristics of PSW outcropping at the surface in the Chukchi Sea that same year (even considering the $300 km distance from the region of outcropping to the CCB). Using the estimates of Ekman downwelling computed here, we can show that the time scales for ventilation are consistent with the surface to interior temperature-salinity mapping illustrated in Figures 15b and 16b. September 2012 indicates Ekman downwelling in the region of the transect shown in Figure 15 of about 2 m/month ($6-7 cm/d). While the sea-ice drift velocity product [Fowler et al., 2013] is not yet available for Journal of Geophysical Research: Oceans 10.1002/2014JC010273 2013, computations using the wind-only field in September 2013 (a good representation of Ekman pumping in the region in summer when conditions were ice free) indicates 2 m/month is also an appropriate estimate for Ekman downwelling in the region of the transect shown in Figure 16. This may be enhanced by the lateral transfer of water below the mixed layer base. Estimating the gradient in mixed-layer depth to be about 10 m over 200 km and even a weak flow perpendicular to this of about 1 cm/s, yields about 1 m/ month. Estimating a horizontal separation of outcropping PSW isohalines at the surface of about 100 km and Su % 3 m/month, yields a downwelling flux of about 3310 5 m 2 month 21 . Therefore, for vertical spacing of the same isohalines at the most offshore part of the transects (Figures 15 and 16) of about 10 m, the speed at which water parcels could be ventilated is about 100 km in 3 months. This is sufficiently fast to preserve the mapping of horizontal temperature and salinity structure to the vertical, and likely to be faster with the influence of eddies. These estimates for penetration of PSW to the interior Canada Basin highlight the importance of changes in source-water properties. In 2007, for example, satellite sea-surface temperatures show anomalously warm temperatures in the Chukchi Sea (Figures 19a and 19b). This is consistent with the anomalously warm ACW Journal of Geophysical Research: Oceans"}, {"section_title": "10.1002/2014JC010273", "text": "North of Bering Strait, one flow characterization is that the sBSW component of PSW moves northward from Herald Canyon and the central Chukchi shelf into the northern Canada Basin while ACW flows primarily through Barrow Canyon and via the Pacific water boundary current in the Beaufort Sea (the Beaufort shelfbreak jet) to the southern Canada Basin (see Steele et al. [2004], although they point out that the pathways are likely to be much more complicated). Steele et al. [2004] relate interannual variations in the regional distribution of ACW and sBSW in the Canada Basin (in the 1990s) to the wind conditions associated with different phases of the Arctic Oscillation (AO) index [Thompson and Wallace, 1998]. They find ACW to be more prevalent in the southern Canada Basin, while sBSW is more commonly found in the northern Canada Basin, with a distinct geographical separation between the two during strongly positive AO years where the dominant sBSW pathway is via the Transpolar Drift Stream. In years characterized by a lower AO index, Steele et al. [2004] suggest reduced geographical separation of the PSW types as both the ACW and the sBSW are swept into a larger and stronger Beaufort Gyre. These large-scale flow patterns also modify the temperature and salinity of PSW in the surface ocean at the basin margins. Kwok and Morison [2011] show that the dynamic ocean topography pattern in 2008 suggests a surface circulation where shelf water, freshened by Eurasian river runoff, is carried eastward along the Russian coast, where it can freshen Pacific Waters at the surface. Morison et al. [2012] attribute freshwater content increases in the Pacific Water layers from 2005 to 2008 in the Canada Basin to this upper-ocean circulation pattern characterized by an increased AO Index. In this study, we will examine the mechanism by which Pacific Summer Water at the surface in the Chukchi Sea propagates to the interior Canada Basin where it resides at depth under the surface layers. The flow patterns just described are in fact highly variable on time scales much shorter than interannual or seasonal. For example, Pickart et al. [2009] analyze the flow across the outer Chukchi shelf that originates from Herald Canyon. They find that when easterly winds are weak, there is strong eastward flow (in contrast to a direct northward flow consistent with Pacific water properties in the northern Canada Basin in some years, Steele et al. [2004]) and the canyon outflow feeds the Beaufort shelfbreak jet. Idealized barotropic model experiments support the hypothesis that northeasterly to easterly winds can reverse the eastward flow along the Beaufort shelf, and force Pacific Water along a more northerly pathway across the Chukchi Sea and into the interior Canada Basin [see Winsor and Chapman, 2004]. Consistent with this, Nikolopoulos et al. [2009] observe reversals to the west of the mean eastward flow of the shelfbreak jet during strong upwellingfavorable wind events. Further, von Appen and Pickart [2012] analyze mooring measurements (summers 2002-2004) to find there are two configurations for the Beaufort shelbreak jet: a surface-intensified ACW configuration and a bottom-intensified sBSW configuration (note that the latter authors refer to sBSW as Chukchi Summer Water). They show how in 2002-2004, the eastward extent of the PSW shelfbreak current is limited by active baroclinic instability and eddy formation; eddies have been shown to be an important mechanism for offshore transport of Pacific Water [see Pickart et al., 2005;Spall et al., 2008;Watanabe, 2011]. von Appen and Pickart [2012] estimate that the shelfbreak current can only transport the PSW about 150 km (for the sBSW configuration) to 300 km (for the ACW configuration) east of 152 W (i.e., PSW enters the Canada Basin interior west of about 145 W) before waters are lost to the formation of eddies. Changes in Pacific Water flow patterns in recent years have been attributed to a general increase in easterly winds associated with a stronger Beaufort High and deeper Aleutian Low (E. T. Brugler et al., Seasonal to interannual variability of the Pacific water boundary current in the Beaufort Sea, submitted to Progress in Oceanography, 2014). Brugler et al. (submitted manuscript, 2014) analyze moored measurements across the Beaufort shelfbreak jet to show an 80% decrease in volume transport in the current (predominantly in the summer months) between 2002 and 2011. They propose that in recent years with stronger easterly winds, Pacific heat, and freshwater are being advected directly north into the Canada Basin interior instead of progressing eastward in the Beaufort shelfbreak jet. Much remains to be understood about how changes to PSW source-water properties and circulation pathways, as well as modification of source water by mixing and surface buoyancy fluxes, are reflected in property changes in the interior Canada Basin. For the interior Canada Basin, Jackson et al. [2011] found that ACW freshened between 2004 and 2008. Specifically, they report that the portion of the water column between the rWML and ACW temperature maximum freshened from 30 < S < 32 in 1993 to 28 < S < 32 in 2008, and suggest that this change resulted from surface buoyancy fluxes and vertical mixing rather than from changing source waters or pathways. However, as they acknowledge, the 1-D diffusion model they Journal of Geophysical Research: Oceans 10.1002/2014JC010273 employ does not account for lateral advection, wind mixing, or the freeze-melt cycle. In fact, to reconcile the discrepancies in the salinity field between their 1-D model and observations, they suggest that accumulation of freshwater in the surface layers is also required (namely, freshening by sea-ice melt, river runoff, and changes in the wind-driven circulation). In another recent study of PSW, Bourgain and Gascard [2012] examine the temperature maximum in the PSW range to show an increase by about 0.3 C between the periods 1997-2002 and 2007-2008 in the Canada Basin. In contrast to Jackson et al. [2011], they attribute this warming to changes in the Bering Strait inflows propagating into the basin, consistent with observations by Woodgate et al. [2010] of warmer Bering Strait inflows beginning in 2001. Woodgate et al. [2010] find monotonic increases in the temperatures of Bering Strait inflows from 1999 to 2007. Bourgain and Gascard [2012] note that the timing of the warmer Bering Strait influxes is consistent with the PSW signals they observe in the interior Canada Basin for advection speeds on the order of 1 cm s 21 . It is unclear in this scenario how PSW is advected to the interior. Here we analyze the considerable number of temperature and salinity measurements from Ice-Tethered Profilers (ITPs, www.whoi.edu/itp) [Toole et al., 2011;Krishfield et al., 2008], Beaufort Gyre Observing System (BGOS, http://www.whoi.edu/beaufortgyre/) moorings, and US/Canada BGOS/Joint Ocean Ice Studies (JOIS) hydrographic surveys in the Central Canada Basin from 2003 through 2013 ( Figure 1) to assess the recent variability of the Pacific Summer Water, and explore potential causes for this variability. We support our observational interpretation by employing a wind-forced Arctic Ocean model [see . The model is used to examine the transport of Pacific Water after it enters the Arctic Ocean both in the presence of a large-scale anticyclonic wind forcing and in the absence of winds. Measurements are described in the next section where we further examine the different components of PSW identified by the presence of potential temperature maxima, h max , within specified salinity ranges; we show how the proper choice of these salinity ranges is vital for the accurate identification of these water masses and for the characterization of their evolution. In section 3.1, we quantify the interannual variability in both the salinity and temperature of ACW h max (we find relatively little change from year to year in properties of the deeper sBSW h max ), as well as PSW freshwater and heat content. In section 3.2, we examine spatial patterns of PSW in the CCB. Section 4 presents a dynamical interpretation for the observed PSW variability in the CCB, including calculations of wind-forced Ekman pumping (section 4.2), and examination of idealized model experiments (section 4.3). Results are discussed and summarized in section 5.\n68-70. The CCB is the focus of our study because it had the densest data coverage in the deep Arctic (11,810 quality profiles between 2004 and 2013) from which the most reliable trends could be determined (Figures 1b and 1c). Furthermore, considering interannual shifts in the center of the Beaufort Gyre (see Proshutinsky et al. [2009], with updates in Proshutinsky et al. [2011Proshutinsky et al. [ , 2012), one can argue that this region encompasses the Beaufort Gyre center for each year studied [see also McPhee, 2013]. We also analyze measurements from the four BGOS moorings, each with a McLane Moored Profiler (MMP) that measures conductivity, temperature, depth (plus the two components of horizontal velocity, although variations in the PSW flow field are too weak to be reliably resolved by the velocity sensors) operating since 2003 in the Canada Basin (see Proshutinsky et al. [2009], for further details), denoted by the letters shown in Figure 1. MMP profiles are alternately separated by 6 and 48 h, spanning an approximate depth range of 50-2000 m. The shallow limit of this depth range precludes examination of the uppermost Pacific waters; however, we will show here that inferences can be made about the ACW through an examination of the sBSW at each of the four mooring sites. Accuracy of the final processed MMP salinity data is better than 0.005 [Proshutinsky et al., 2009]. In addition to the mooring measurements, we use CTD data collected under the US/Canada BGOS/JOIS projects (http://www.whoi.edu/beaufortgyre). Standard hydrographic sites revisited annually (during August to October) enable investigation of PSW properties covering most of the CCB region every year since 2003. Additional CTD measurements in the Chukchi Sea were obtained from hydrography archived at the 2013 World Ocean Database (WOD13; www.nodc.noaa.gov/OC5/WOD13/) and surveys of the R/V Mirai (Japan Agency for Marine-Earth Science and Technology, JAMSTEC) in 2012 and 2013.\nACW h max with a salinity close to this value is observed. To assess interannual variability of integrated freshwater and heat content of PSW, a saltier shallow bound must be considered so that the seasonally varying NSTM layer does not influence the results. Our analysis of the BGOS mooring data only includes an assessment of the deeper portion of PSW; the freshest salinities measured by the moorings are typically greater than S % 30 because the moorings sample no shallower than about 50 m below the ice-ocean interface. It is of note that within the ACW salinity range 29 < S < 32:2, two local temperature maxima are sometimes present. A second cooler local temperature maximum is occasionally observed in the range 31 S 32 in the same profiles that indicate temperature maxima in the range 30 S 31 (e.g., Figure 5). Jackson et al. [2011] attribute this double peak to an intrusion of cold water (possibly shelf water; see Shimada et al. [2001]) on the ACW temperature maximum in 2006, and show how the presence of two peaks in the ACW salinity range is most common in 2009. For the years and region studied here, the double-peak feature appears with no apparent seasonal or spatial bias. It appears in all years except 2003-2004, where it could be that a double peak was not observed because data coverage was not as extensive in those years. In each year for which a double peak is observed, it shows up only in a few percent of profiles, except in 2009, when a double peak is observed in about 8% of profiles. The feature does not appear to be Figure 3. (a) PDF of the salinity of the h max for S < 33 and deeper than 40 m for all CTD andITP profiles (2003-2013) in the CCB. A binsize of 0.05 is used in the calculation. (b) Yearly histograms of the salinity of the h max . Binsize is 0.1 and number in each bin is divided by the total number of observations in a given year. Each year is offset on the y axis by 0.25. Figure 4. Potential temperature versus salinity plot of h max and corresponding salinity (for all CTD and ITP profiles [2003][2004][2005][2006][2007][2008][2009][2010][2011][2012][2013] in the CCB) where the red dots indicate the shallowest temperature peak in the upper 40 m and the black dots indicate the warmest temperature peak that is deeper than 40 m with S < 32.2. The two clusters show a clear delineation between the NSTM (red dots) and the ACW h max (black dots).\nh max ( Figure 6) and submixed layer-averaged temperatures (Figure 7) in the CCB in that year, although with reduced temperatures from those found in the Chukchi, presumably because of some cooling during the transit. Further, if anomalously fresh and warm waters are found in the Chukchi Sea region of outcropping PSW, only the low-salinity portion of the PSW layer is ventilated in summer. Surface salinity measurements are limited in space and time ( Figure 19c) but anomalously fresh waters in summer 2007 in the Chukchi would be consistent with a fresher ACW h max observed at shallower depths in the CCB (Figure 6). The lateral transition in CCB water mass structure documented in Figures 11-13 is also consistent with changes in properties of the subducting source water in the Chukchi. The spatial/temporal transition in water mass properties indicates subduction not of sBSW, but of ACW. This is consistent with Brugler et al.'s (submitted manuscript, 2014) study showing that under increased easterly winds in recent years, there is a shift from eastward flow of ACW to a flow path that is more to the west and north (Brugler et al., submitted manuscript, 2014). Here the ACW is available for subduction from the Chukchi Sea into the interior basin. Of course in addition to the importance of source-water properties, the mechanism outlined here also demonstrates the importance of shifts in the distribution and intensity of Ekman pumping in setting the PSW property distribution in the interior CCB, which has strong seasonal and interannual variability. Expansion and contraction of the gyre circulation leads to position shifts of the surface front. Isopycnals also outcrop at the northern boundary of the gyre and a strong downward pumping in this region could dominate over the pumping of southern waters to the interior. Seasonal variability in subduction rates coupled with seasonal variability of surface properties in the region of PSW isopycnal outcropping is key to the presence of a warm PSW layer found year round in the CCB. In summer, influences from river runoff and sea-ice melt freshen the surface waters in the Chukchi and the outcropping isohalines are fresher there than in winter (when surface salinity is additionally increased by sea-ice growth). This leads to shallower (fresher and warmer) waters being ventilated in summer, and deeper (saltier and cooler) waters being ventilated in winter. The basic ventilation process is demonstrated numerically in the next section. The goal of the modeling is to demonstrate the general result of the combined forcing of Pacific Water inflow and winds. We employ a model that includes only the dynamical influences of idealized winds and inflowing Pacific Waters; sea-ice and buoyancy forcing (associated with surface heating, cooling and sea ice transformations) are neglected. While the actual flow field will depend on the characteristics of sea-ice, surface buoyancy forcing, the exact wind field, river inflows and other complexities, the model results show fundamentally how the large-scale wind forcing drives Pacific Water pathways to the interior by subduction and flow along geostrophic contours.\nparticularly at the periphery of the gyre corresponding to outcropping isopycnals, as well as upwelling along the continental slope and coastlines (Figures 20 and 23). Water is subducted while being swept along geostrophic contours such that water pathways along isopycnals approximate a helical structure ( Figure  25b). Although there are many complicating factors (e.g., the influence of sea ice) not represented in the model, results show water parcels are subducted and swept toward the interior at rates consistent with the estimates in section 4.2: of the order of a hundred kilometers over a few months (the magnitude of wind forcing is appropriate for typical annual-average values). Horizontal salinity (density) gradients are intensified at the frontal zone by convergence of fresh surface waters accumulated by Ekman transport to the center of the Beaufort Gyre, and the salinification of surface Chukchi Sea water driven by upwelling close to the coast. Downwelling is enhanced in the frontal region (further west than in the case of no winds) where it is responsible for transferring water along isopycnals into the interior basin (Figures 24 and 25). The anticyclonic wind forcing drives a clear steepening of isohalines (isopycnals) and a deepening of the mixed layer on either side of the front (Figure 23). The strong isopycnal displacements associated with spinup of the Beaufort Gyre circulation leads to increased Pacific Water layer thickness and enhanced ventilation of this layer. Although not captured in this model configuration, the deeper front and steeper isopycnal slopes forced by winds also increases the likelihood of baroclinic instability and eddy-driven transfer of water masses along isopycnals into the interior (model horizontal grid resolution is larger than the first baroclinic Rossby deformation radius in the region [see Nurser and Bacon, 2013])."}, {"section_title": "Measurements and Methods", "text": ""}, {"section_title": "ITP and BGOS Measurements", "text": "Extensive ITP data, collected between September 2004 and December 2013, are analyzed here. ITPs are automated profiling systems that are deployed in multiyear ice floes and sample the properties of the underlying ice-covered ocean for periods of up to 3 years [Krishfield et al., 2008;Toole et al., 2011]. Each system consists of a surface buoy, which sits on top of the ice with a tether extending through the ice into the ocean to a depth of about 750 m. An underwater profiling instrument cycles vertically up and down this tether, collecting temperature and salinity profiles and transmitting data via satellite to shore in near-real time. The ITP incorporates a Sea-Bird 41-CP CTD; conductivity data are adjusted for consistency with recent ship observations from the region. The conductivity calibration involves the derivation of profile-dependent multiplicative adjustments to match ITP potential conductivities on deep potential temperature surfaces (below the Atlantic Water core) to spatially varying reference fields produced with ship-based CTD data. The resulting ITP salinity data match the ship data to better than 0.005. For several of the later years of ITP data analyzed here, no adjustments were applied to the conductivity data; in these cases, profiles that show offsets in deep salinity values were excluded. On the basis of postdeployment calibration of three recovered ITPs, temperature and pressure sensor accuracies were found to be 60:001 C and 6 dbar, respectively. Detailed processing procedures are outlined at http://www.whoi.edu/itp. The high temporal and spatial resolution of ITPs enables a detailed assessment of the water mass structure. The entire ITP system drifts with the ice floe; for typical ice drift speeds of about 10-20 cm/s, a horizontal survey resolution of roughly 3 km is obtained for profiles collected every 8-12 h. The ITP system numbers relevant to the Central Canada Basin (CCB, Figure 1), operating between September 2004 and December 2013, are the following: 1-6, 8, 13, 18, 21, 32-3, 34, 35, 41-3, 52-5, 62, 64-5, and Journal of Geophysical Research: Oceans"}, {"section_title": "Methods", "text": "For each potential temperature (h)/salinity (S) profile in the CCB, we characterize ACW and sBSW by the maximum potential temperature h max in their respective salinity ranges, which we will determine in this section. Curvature maxima (peaks) are found in the salinity ranges specified to ensure temperature maxima associated with the boundaries of the range are not mistaken for h max of the water mass in question. Our procedure to determine these maxima is as follows. We begin by computing the warmest temperature peak that satisfies S < 33 and is deeper than 40 m, where this depth will be justified later in this section. A PDF of this PSW h max ( Figure 3a) shows a multimodal structure, with one mode centered around S % 32:6 (salinity of sBSW h max ), and others (salinity of ACW h max ) in the salinity range S % 30:7 to S % 31:7. This clustering of h max salinities in combination with visual inspection of individual profiles, suggests a salinity of 32.2 is the appropriate boundary between ACW and sBSW for this data set. Yearly histograms (Figure 3b) show that between 2004 and 2006 some profiles exhibited a sBSW h max that was warmer than the ACW h max . In later years, either a cooler sBSW h max was observed, or it was absent entirely. While we have delineated the ACW/sBSW boundary, it remains to ensure differentiation of the ACW h max from the NSTM. To this end, for each profile, we find the shallowest temperature peak in the upper 40 m, and the warmest temperature peak deeper than 40 m that satisfies S < 32.2 (the ACW h max ). A shallow h max (likely a NSTM) is only selected where it is found beneath a homogeneous surface layer. We identify two clusters in a plot of these h max values versus the corresponding salinity for (1) the shallowest temperature peak in the upper 40 m and (2) the warmest temperature peak that is deeper than 40 m with S < 32.2 (Figure 4). This demonstrates a clear delineation between the NSTM and the ACW h max . (Note that we found the technique of seeking a temperature minima, associated with the rWML, at a depth between the NSTM and the ACW h max to differentiate the water masses could not be used for much of the year when the NSTM did not exist.) The clear delineation between the NSTM and ACW suggests that each water type can be defined by salinity. From 2003 to 2013 in the CCB, no ACW h max is found to be fresher than S 5 29. Visual individual inspection of profiles where no ACW h max is found reveals that less than 5% of ACW h max are not identified by our algorithm because they are shallower than 40 m; the NSTM is always shallower than 40 m in the data set analyzed here. Note that Bourgain and Gascard [2012] require that the temperature maximum that defines PSW be deeper than 40 m, stating that this ensures differentiation from the NSTM. In summary, we characterize ACW by the range 29 < S < 32:2, with the h max deeper than 40 m (to ensure differentiation from the NSTM, with the understanding that fewer than 5% of profiles for which ACW h max are shallower than 40 m will be excluded from the analysis) and sBSW by the range 32:2 < S < 33. In some years, the fresh bound on ACW (S 5 29) will encompass the NSTM (e.g., Figure 2), while in other years, an Journal of Geophysical Research: Oceans"}, {"section_title": "Changing Characteristics of PSW", "text": "Having determined appropriate salinity ranges for the constituent water masses of PSW, it is possible to investigate the evolution of their properties over the study period, assuming temporal changes dominate spatial variability of PSW in the CCB. Spatial variability within the CCB, inferred from the large spread in PSW characteristics in the CCB in some years, will also be examined."}, {"section_title": "Temporal Variability", "text": "Salinity of the ACW h max in the CCB shows a general freshening trend from 2003 to 2013. Before 2009, the ACW h max lay predominantly within the conventional range of 31 < S < 32 considered by Steele et al. [2004] and others; a distinct freshening to S % 30:5 of the ACW h max occurred in 2010 ( Figure 6). Freshening and warming of the ACW h max are broadly related. The ACW h max shows a general warming temperature trend, with considerable interannual variability ( Figure 6). Bourgain and Gascard [2012] reported a warming of about 0.3 C in the temperature maximum in the salinity range 31 < S < 33 between the periods 1997-2002 and 2007-2008 in the Canada Basin. We find rather larger variability than this from year to year in the CCB between 2003 and 2013 ( Figure 6a). The depth of the ACW h max is in the range 40-90 m (with a mean and standard deviation of 60 6 10 m) in the CCB for the years examined ( Figure 6c); this depth range is not appreciably different from that found by Steele et al. [2004]. Fresher ACW h max are generally related to shallower ACW h max . Spatial variability (discussed in the next section) in the ACW h max properties over the CCB contributes to the large spread in values observed in some years; after 2008, relatively smaller spatial variability is observed. Importantly, the BG CTD data (with uniform spatial sampling distributions from year to year) show essentially the same temporal variability as the ITP data, indicating that the variable spatial distribution of available ITP profiles during any given month do not appear to bias the overall results. There does not appear to be significant seasonal variability in properties of the CCB ACW h max . Seasonal variability is limited to shallower layers, as evident in time series of layer-averaged temperature in the upper 40 m compared to the 40-70 m depths ( Figure 7). In contrast to the ACW h max , properties of the sBSW h max vary little over the analysis period (not shown), with mean (and standard deviation) sBSW h max around 21:260:1 C (i.e., sBSW is typically traced by a cooler h max than ACW) and salinity of the h max around 32.6. The sBSW h max is found at depths in the range 85-160 m (with a mean and standard deviation of 120 6 14 m). One key feature of the sBSW h max is that it Journal of Geophysical Research: Oceans is only observed in the northern sector of the CCB [cf. Steele et al., 2004] for the years studied here, and in the later years it is not observed at all in the CCB (see, for example, 2009 and 2012 profiles in Figure 2b, where there is no characteristic h max in the sBSW salinity range). We examine these spatial patterns in section 3.2. While the ACW and sBSW h max (and corresponding salinity) are useful water mass tracers, their properties must not be equated with the water masses themselves. We next examine the evolving freshwater and heat content of PSW. As noted above, the complicating influence of the strongly seasonally varying NSTM and surface layer are introduced if the freshwater content is calculated over a depth range that includes the fresher end of the ACW salinity range (see Figure 7). Therefore, we examine the integrated freshwater content (relative to a salinity of 33) in the range 31 < S < 33 ( Figure 8a). This is defined as where dðS533Þ is depth of the 33 isohaline [and similar for dðS531Þ], h PSW is the thickness of the layer bounded by the 31 and 33 isohalines, and S PSW is the layer-averaged salinity. As we saw for the evolution of the salinity of the ACW h max , a marked freshening trend is apparent. The two time series (Figures 6b and 8a) are significantly correlated; the correlation coefficient is r520:65. Likewise, temporal change in integrated heat content of the 31 < S < 33 layer relative to freezing temperature ( Figure 8b) is statistically significantly correlated with the ACW h max (r 5 0.80). Layer-averaged temperature and salinity of the 31 < S < 33 layer are also well correlated to ACW h max and salinity of ACW h max , respectively. Again, the ship based CTD data are in agreement with the ITP data that are more irregularly distributed in a comparable temporal window. Freshwater and heat content in the range 31 < S < 33 were also calculated at each of the four BGOS moorings: A, B, C, and D. Positive trends of freshwater and heat content from moorings B and C generally follow those of the spatially distributed ITP and hydrographic data (Figure 8, symbols). Moorings A and D (in the southern portion of the CCB, Figure 1) show relatively higher freshwater and heat content in the early part of the record (through 2007) than the northern moorings B and C. From 2008 to 2013, the freshwater and heat contents were similar at all moorings. These results indicate that there was a spatial shift in the properties of PSW over the study period. While freshwater and heat content time series show correlations with the salinity and temperature (respectively) of ACW h max (and layer-averaged salinity and temperature), the evolution of layer thickness is important ( Figure 9). Between 2003 and 2010, the thickness of the 31 < S < 33 layer increased from about 90 m to about 120 m. This thickness increase is due to a deepening of the S 5 33 isohaline, with relatively smaller change in the S 5 31 isohaline which showed a modest deepening through 2008 and a slight shoaling thereafter. The total thickness of the 31 < S < 33 layer increased between 2003 and 2013. The deepening Journal of Geophysical Research: Oceans 10.1002/2014JC010273 of the deep isohaline is a manifestation of the intensification of the Beaufort Gyre circulation [Proshutinsky et al., 2009], and this contributes to thickening of the PSW layer (because the shallow isohaline does not deepen at the same rate) and overall increases in PSW freshwater. The change in freshwater content, DFW PSW 5FW f PSW 2FW i PSW (superscripts f and i denote final and initial, respectively), can be expressed as (2)  Similar to the properties of the ACW h max , there is no strong seasonal signal in freshwater and heat content in the range 31 < S < 33. This is demonstrated in an example depthtime section showing the interannual variability of temperature and salinity, and time series of freshwater and heat content at mooring D ( Figure  10). While in winter there is some indication of increased Ekman pumping (due to strengthened anticyclonic wind stress curl; Figure 8. (a) Freshwater content (m) and (b) heat content (J m 22 ) in the range 31 < S < 33 in the CCB. Waters fresher than S 5 31 are not considered as in early years, the NSTM lies at the fresh end of the salinity range that encompasses the ACW for all years. Freshwater content is calculated relative to a reference salinity of 33. Heat content is calculated relative to freezing temperature. BG CTD data are shown in blue: mean values in a given year are plotted with bars indicating one standard deviation. ITP data are shown by the black lines: 60 day running means are plotted, and the shading represents one standard deviation. Mean values from each of the four BGOS mooring A, B, C (2003-2008), and D deployments are shown by the symbols (each symbol is plotted at the mean date for which MMP profiles were obtained during the yearly deployments). Journal of Geophysical Research: Oceans 10.1002/2014JC010273 e.g., Proshutinsky et al. [2009], see their Figures 5 and 6), causing isopycnal/isohaline deepening, there is no apparent seasonal variability in temperature on isohalines relevant to the ACW. Numerous mesoscale eddies manifest as short-time scale perturbations [see, e.g., Carpenter and Timmermans, 2012] in the history of integrated freshwater and heat content."}, {"section_title": "Spatial Variability of PSW in the CCB", "text": "While there is a clear interannual signal in properties of PSW, freshwater and heat content, for a given temporal window, we attribute the standard deviation in the estimates to spatial variability in the properties over the CCB. This spatial variability is evident in maps of freshwater and heat content ( Figure  11). It is understood that heat and freshwater content variability approximately follow temperature and salinity of the ACW h max . The maps show a clear gradient in heat and freshwater from lower values in the southwest to higher in the northeast, in addition to the overall increase in heat and freshwater content over the past decade in the region. To examine the spatial property gradients in detail, it is instructive to analyze the drift of ITP 6 between 1 September 2006 and 31 August 2007. Over this period the ITP drifted along an approximately North to South path (around 78.6 N to 74.8 N) in the vicinity of 140 W (Figures 11a and 12). This ITP had a dissolved-oxygen (DO) sensor in addition to the standard CTD (see Timmermans et al. [2010] for details, including data processing). DO measurements may be used as another tracer of the constituent water masses of PSW; sBSW is associated with anomalously low DO. Around 76.5 N-77 N, the ITP crossed a distinct lateral change in water mass properties ( Figure 12) between a cool ACW h max ð% 21 C at S % 31) to the north and a markedly warmer ACW h max (>0 C at S % 31) to the south (Figure 11 marks this change with respect to heat and freshwater content). Associated with this transition in vertical temperature-salinity structure of the water column is a clear temperature maximum in the salinity range of the sBSW (on S % 32:5) and a corresponding very low dissolved oxygen in the north, while on the south side of the front there is no sBSW h max (Figure 12b). This may appear to be temporal variability as the ITP drift spanned about Journal of Geophysical Research: Oceans 10.1002/2014JC010273 1 year; however, the drift track of the ITP is faster than the temporal variability in properties. Evidence from the localized moorings, as well as the effectively synoptic BG CTD stations spanning the entire CCB, confirms this. Potential temperature versus salinity plots in the region of h2S space for sBSW from the four BGOS moorings show the presence of an sBSW h max only in the two northernmost moorings. Furthermore, the northernmost moorings, B and C, show the disappearance of the sBSW h max starting in 2006 (mooring B) and 2007 (mooring C) ( Figure 13), consistent with the north-eastward progression of the water mass boundary (Figure 11). It would appear that the water mass structure that in 2013 occupies the full CCB (in an areal sense), and can be distinguished by the absence of sBSW h max , is related to spatial shifts in water masses spanning the full depth of the halocline (<200 m), coupled with warming and freshening. To summarize, results from ITP and CTD profiles from 2003 to 2013 show that the ACW h max warmed and freshened, and did not show any apparent seasonal variability. Our analysis distinguishes PSW from the seasonally varying overlying layers. Properties of the ACW h max are correlated with changes in layer-averaged temperature and salinity for the layer defined by 31 < S < 33. Over our study period, freshwater content increase in the PSW layer is due both to layer thickness increase, and freshening of the layer. A lateral transition in water mass properties characterized by a cooler ACW and a prominent sBSW h max to the north and warmer ACW with no apparent sBSW h max to the south was observed around 77 N-78 N in the CCB from 2003 to 2009. The transition appears to have shifted northeastward in recent years, which have seen overall increases in PSW temperature, heat and freshwater content averaged over the CCB."}, {"section_title": "What Drives PSW Changes in the CCB?", "text": "Here we show how Ekman transport convergence/divergence driving Ekman pumping in the Chukchi Sea, coupled with general freshening and warming there, can explain the observed PSW changes in the CCB. Several driving factors (reviewed in section 1) have been discussed with respect to Pacific Water variability in the Canada Basin. It is clear that in situ mixing, changes in source-water properties, shifting wind patterns, and changes in the strength of the large-scale wind forcing all influence PSW properties in the CCB. It is   (Figure 14). In winter, surface properties in the Chukchi Sea resemble the saltier, colder Pacific Winter Water. In all seasons there is a front in the vicinity of the Chukchi slope between the inflowing Pacific Water and the relatively fresh Beaufort Gyre surface water. The typical surface water structure is a lateral gradient in surface salinity from high salinity in the Chukchi Sea to low salinity in the CCB [i.e., the Beaufort Gyre freshwater center] (Figure 14, and see, e.g., Timmermans et al. [2014], their Figure 5.16). Example September salinity sections off the Chukchi shelf slope and into the deep basin show outcropping isopycnals in the PSW salinity ranges to the south (Figures 15a and 16a). The northern extensions of the transects are characterized by thinner mixed layers and increased stratification compared to the Chukchi Sea. An important feature is that lateral gradients in surface temperature-salinity values approximately map on to vertical profiles in the deep basin (Figures 15b and 16b). This mapping structure is consistent with water being transferred from the surface in the Chukchi Sea into the halocline below and thereafter isolated from the direct effects of wind stress. The temperature-salinity mapping suggests that properties at the surface in the Chukchi Sea set the temperature-salinity properties in the interior where there is relatively weak property modification by mixing; warm PSW can be traced to the deep basin in the section shown in Figure 16. Of course, at further distances from the source region (e.g., the CCB), maximum PSW temperatures are lower than their source waters due to small lateral and vertical diffusion, but we expect the trends in surface Chukchi Sea properties to be reflected in PSW property trends in the interior.  Figure 11); selected salinity contours are overlaid in the bottom plot. Note that oxygen % saturation shows essentially the same patterns as oxygen. (b) Top: potential temperature versus salinity from ITP 6 over the same time as in Figure 12a. Bottom: dissolved oxygen versus salinity from one of the northermost profiles in the top plot (thin black line) and one of the southernmost (thick black line). The sBSW is traced by a local minimum in DO (and a temperature maximum)."}, {"section_title": "Subduction", "text": "The flux of water (originating at surface-outcropping isopycnals) into the halocline is quantified by a subduction rate, defined as the vertical velocity of a water parcel with respect to the base of the mixed layer [see Iselin, 1939;Woods, 1985;Marshall, 1997]. For a steady mixed layer of depth h, subduction (on an f plane) is given by Su52w e 1u h Á rh; where w e is Ekman pumping velocity (negative downward) determined from wind and seaice stresses at the ocean surface, u h is the horizontal velocity of a water parcel at the base of the mixed layer where positive Su represents subduction ( Figure  17). The second term accounts for the lateral transport of fluid from the base of a deep mixed layer to below a shallower mixed layer over some horizontal distance (i.e., lateral induction). Subduction given by equation (3) will be enhanced by an eddy-induced transport, expected to be significant in baroclinically unstable regions with strongly sloping isopycnals [e.g., Marshall, 1997;Spall et al., 2008;Thomas, 2008]. In the mid to high-latitude ice-free oceans, the transfer of fluid from the surface to the pycnocline occurs over wind-driven gyres and in frontal regions. Thermocline ventilation takes place by subduction in regions   where water masses with thermocline properties outcrop at the surface [see, e.g., Iselin, 1939]. Waters in the mixed layer at the end of winter (when mixed layers reach their deepest and most dense as a result of intense cooling) are transferred to the permanent thermocline [e.g., Stommel, 1979;Marshall, 1997]. Below the mixed layer, water masses spread along isopycnals while being advected to greater depths as they are swept along geostrophic contours. In the Chukchi Sea, the front at which subduction is believed to occur is maintained continuously by inflowing Pacific Water, and strengthened by the large-scale wind-driven circulation associated with the Arctic High. Analogous to the thermocline in midlatitudes, the properties of this strong salinity front have a significant impact on the structure and variability of the Canada Basin halocline. Many different processes influence the structure of these water masses and their seasonal and interannual variability: sea ice thermodynamics, concentration and modification of wind stress input to the ocean, complicated surface stress gradients in the marginal ice zone, variations in inflowing Pacific Water, buoyancy forcing and river input. In the following sections, we illustrate only the influence of large-scale wind forcing (anticyclonic flow centered on the Beaufort Gyre) in combination with inflowing Pacific Water to demonstrate the halocline ventilation processes suggested by the data, with the additional processes to be examined in a future study."}, {"section_title": "Ekman Pumping", "text": "Rates of Ekman pumping (vertical velocities associated with Ekman transport convergence/divergence) are estimated here accounting for both air-water and ice-water stresses following the methodology of Yang [2006Yang [ , 2009. Surface wind stress is derived from the geostrophic wind [see Proshutinsky and Johnson, 1997] computed using the National Center for Atmospheric Research-National Centers for Environmental Prediction (NCAR-NCEP) reanalysis sea-level pressure. Ice-ocean stress is derived from sea-ice drift data. Sea-ice motion vectors (through December 2012) are derived from multiple remote and in situ sources [Fowler  Figure 15a; blue dots indicate surface potential temperature salinity values for the stations shown in the map, with values becoming fresher toward the north. Near-vertical gray lines are lines of constant potential density (with respect to the surface)."}, {"section_title": "Idealized Model Results", "text": "We employ the Institute of Computational Mathematics and Mathematical Geophysics (ICMMG) 3-D hydrostatic ocean model to investigate Pacific Water dynamics in the Canada Basin. The southern boundary of the model domain is Bering Strait in the Pacific sector and 20 S in the Atlantic Ocean, with all major Arctic straits included. In the Arctic Ocean region, model horizontal grid resolution is about 25 km, with 38 levels in the vertical (5 m increments in the upper 20 m, and 20-25 m vertical resolution through the halocline). Model bathymetry is from the 2.5 km International Bathymetric Chart of the Arctic Ocean (IBCAO) [Jakobsson et al., 2012]. Horizontal mixing is represented by a Laplacian diffusivity of 10 7 cm 2 /s, and vertical diffusion is treated as in Bryan and Lewis [1979] with vertical diffusivity 0.05 cm 2 /s; see Platov [2007, 2009] for full model details. We conducted experiments both in the absence of wind forcing and with wind forcing specified by an idealized sea-level pressure distribution with a central high at 147 W, 77 N ( Figure 20). This sea-level pressure distribution is used to compute a geostrophic wind, which is then converted to a surface wind stress following Proshutinsky and Johnson [1997]. The position of the central high corresponds to the climatological Arctic High center. This wind distribution yields a maximum Ekman pumping (computed from the wind stress curl) of about 2 cm/d around the core of the high and a maximum upwelling of about 3 cm/d at the Alaskan/Beaufort coastline. Idealized initial conditions with horizontally uniform salinity and vertically stratified salinity corresponding to typical conditions (i.e., consistent with observations presented here) in the Canadian Basin sector were prescribed in all experiments (Figure 21, bottom). There was no sea ice, and no surface buoyancy fluxes were applied in the experiments. Water temperature was prescribed to be uniform   Journal of Geophysical Research: Oceans 10.1002/2014JC010273 and the entire upper ocean becomes saltier as a result of vertical mixing. Analysis of particle concentrations (particle hours) in each experiment (after 48 h) allows us to understand differences in Pacific Water circulation patterns with and without wind forcing. In the absence of wind forcing, the Pacific Water flows northward and veers east to flow as a boundary current along the Alaska-Beaufort coast in the Chukchi Sea and Canada Basin; isohaline displacements are confined to the coastal regions ( Figure 21). Two main topographically steered branches are clear in the surface flow field over the shallow Chukchi Sea [e.g., see Weingartner et al., 2005]. At the surface, the density of the inflowing Pacific Water exceeds that of the interior surface Arctic water by about 2.4 kg m 23 . The strongest sinking of the inflowing dense water is evident at the shelf-slope boundary as the inflowing water sinks to its level of neutral buoyancy (Figures 24 and  25a) [see, e.g., Aagaard and Roach, 1990;Pickart et al., 2005]. Downwelling is effectively confined to this region and particle tracers show little penetration to the interior. The inflowing Pacific Water generates an intense frontal zone between salty inflowing waters and relatively fresh interior surface Arctic water (Figure 21). In the model, however, the strength of this front decreases over time as the entire region becomes increasingly salty due to mixing with the inflowing salty water. The neutral buoyancy level of the inflowing layer shoals over time. When the large-scale idealized wind forcing is applied in the absence of flow through Bering Strait (i.e., a closed strait), winds drive a flux of surface water from the Bering Strait region into the Canada Basin ( Figure 22); this suggests how the intensification of the anticyclonic circulation in recent years could play a role in the recent increase in Bering Strait  Journal of Geophysical Research: Oceans 10.1002/2014JC010273 transport observed by Woodgate et al. [2012]. In this case there is no eastward flow along the coast of Alaska/Canada. The wind-forced circulation is distinguished by a strong, anticyclonic Beaufort Gyre and an accumulation of fresh surface water here by converging Ekman transport (Figures 22 and 24). With both wind forcing and a prescribed flow through Bering Strait, the surface front set up by the Pacific Water inflow is intensified (Figure 23). The strongest sinking is again associated with relatively dense Pacific Water sinking to its level of neutral buoyancy along the Chukchi shelf slope (Figures 24 and 25a). In this case, however, the anticyclonic wind forcing drives additional downwelling over a large region of the Canada Basin,  Journal of Geophysical Research: Oceans"}, {"section_title": "Discussion and Summary", "text": "We have analyzed the constituent PSW masses in the CCB to show that salinity ranges of 29 < S < 32:2 for ACW and 32:2 < S < 33 for sBSW are appropriate for the years 2003-2013. The most important difference here to past accepted ranges is the significant freshening of the ACW. Because ACW and sBSW are fundamentally characterized by their salinities, ensuring the appropriate salinity ranges are examined is imperative for any study of the Pacific Water. For example, Bourgain and Gascard [2012] would have reached different conclusions for the temperature variability of ACW by considering a salinity range that included values fresher than S 5 31; Jackson et al. [2011] find PSW fresher than this in 2008, and we have found that the recent warm temperatures of the PSW are associated with fresh layers with h max having S < 31. The accurate identification of PSW is also essential to differentiate them from overlying water masses in the CCB that are modified in place by buoyancy fluxes and stronger mixing than at depth. The interannual variability in the ACW h max over 2003-2013 in the CCB is as large as 1 C, with warming of the ACW h max broadly congruent with freshening. ACW h max temperature and salinity display similar interannual variability and trends as layer-averaged temperature and salinity and PSW heat and freshwater content. No apparent seasonal variability of the PSW was observed in the CCB. While it is likely that different halocline depths are ventilated in different seasons, only extensive year-round hydrographic measurements in the Chukchi Sea will allow us to examine this further. Shoaling of the ACW h max is generally related to a freshening, although interannual variability in surface salinity in the Chukchi Sea is difficult to quantify, so it is unclear how this relates to Chukchi Sea properties. The deepening of the deep isohaline bound on the PSW in the CCB is consistent with intensification of the BG circulation in the recent decade. We have shown a mapping of horizontal temperature-salinity structure to vertical structure in transects from the Chukchi Sea to the deep Canada Basin, consistent with the CCB halocline being ventilated by subduction of surface Chukchi Sea water. The properties at the Chukchi Sea surface in summer (set by buoyancy fluxes, the properties of the inflowing Pacific Water, and contributions from surface wind-driven flows from the basin margins) set the temperature-salinity properties of PSW in the interior CCB, although with some property modification by weak mixing of the subducted waters. Unusually warm temperatures in the CCB (e.g., in 2007) appear to be linked to warm anomalies in the Chukchi Sea. Intensified subduction rates (due to increased Ekman pumping) can have significant consequences during times when Chukchi Sea surface waters are anomalously warm; this is because the additional heat can be archived in the CCB PSW layer where it can later influence the surface-ocean heat budget and sea ice. Note also that when fresher source water is available for subduction [see, e.g., Morison et al., 2012], increased freshwater content can arise in the CCB even when the strength of downward Ekman pumping does not increase. There is significant complexity in understanding upper-halocline properties because they involve Journal of Geophysical Research: Oceans 10.1002/2014JC010273 a combination of the strongly seasonally varying surface Chukchi Sea waters and the wind stress curl forcing which shows strong variations spatially, seasonally and interannually. For example, we have shown that the presence or absence of sBSW in the CCB (which relies on Ekman pumping and properties of outcropping isopycnals) influences integrated freshwater content in this region. Freshwater content is largest when ACW dominates over sBSW. This study highlights the need for additional data tracking the seasonal evolution and distribution of water-column properties in the Chukchi Sea analogous to the ITP data that exist in the CCB. It also underlines the need for detailed information on mixed-layer depth and horizontal velocity fields to quantify lateral induction of outcropping water masses, and understand how variability in atmospheric forcing and sea-ice cover is transferred to the interior Arctic Ocean. Finally, eddies are likely to play a significant role in transferring water along isopycnals in the interior. For example, Spall et al. [2008] have shown how mesoscale eddies are an important transport mechanism for flux of Pacific Water from the shelf/slope regions offshore into the interior Canada Basin. Frontal instabilities are also associated with subduction [e.g., Spall, 1995;Timmermans et al., 2008;Thomas and Joyce, 2010]. Further studies are required to examine the role of mesoscale and submesoscale eddies and frontal instabilities in modifying the subduction rate of PSW into the halocline."}]