[{"section_title": "Abstract", "text": "IMPORTANCE It is unclear whether female carriers of the apolipoprotein E (APOE) ε4 allele are at greater risk of developing Alzheimer disease (AD) than men, and the sex-dependent association of mild cognitive impairment (MCI) and APOE has not been established.\nTo determine how sex and APOE genotype affect the risks for developing MCI and AD.\nDATA SOURCES Twenty-seven independent research studies in the Global Alzheimer's Association Interactive Network with data on nearly 58 000 participants.\nSTUDY SELECTION Non-Hispanic white individuals with clinical diagnostic and APOE genotype data.\nHomogeneous data sets were pooled in case-control analyses, and logistic regression models were used to compute risks.\nAge-adjusted odds ratios (ORs) and 95% confidence intervals for developing MCI and AD were calculated for men and women across APOE genotypes.\nRESULTS Participants were men and women between ages 55 and 85 years. Across data sets most participants were white, and for many participants, racial/ethnic information was either not collected or not known. Men (OR, 3.09; 95% CI, 2.79-3.42) and women (OR, 3.31; CI,) with the APOE ε3/ε4 genotype from ages 55 to 85 years did not show a difference in AD risk; however, women had an increased risk compared with men between the ages of 65 and 75 years (women, OR, 4.37; 95% CI, 3.82-5.00; men, OR, 3.14; 95% CI, 2.68-3.67; P=.002). Men with APOE ε3/ε4 had an increased risk of AD compared with men with APOE ε3/ε3. The APOE ε2/ε3 genotype conferred a protective effect on women (OR, 0.51; 95% CI, 0.43-0.61) decreasing their risk of AD more (P value = .01) than men (OR, 0.71; 95% CI, 0.60-0.85). There was no difference between men with APOE ε3/ε4 (OR, 1.55; 95% CI, 1.36-1.76) and women (OR, 1.60; 95% CI, 1.43-1.81) in their risk of developing MCI between the ages of 55 and 85 years, but women had an increased risk between 55 and 70 years (women, OR, 1.43; 95% CI, 1.19-1.73; men, OR, 1.07; 95% CI, 0.87-1.30; P=.05). There were no significant differences between men and women in their risks for converting from MCI to AD between the ages of 55 and 85 years. Individuals with APOE ε4/ε4 showed increased risks vs individuals with ε3/ε4, but no significant differences between men and women with ε4/ε4 were seen.\nCONCLUSIONS AND RELEVANCE Contrary to long-standing views, men and women with the APOE ε3/ε4 genotype have nearly the same odds of developing AD from age 55 to 85 years, but women have an increased risk at younger ages."}, {"section_title": "", "text": "F or nearly 20 years, the prevalent view has been that women who carry copies of the ε4 allele of the apolipoprotein E(APOE) gene have a greater risk of developing Alzheimer disease (AD) than men with the same number of copies. 1 The ε4 allele is the main genetic risk factor for late-onset Alzheimer disease (AD), 2 and sex-based differences in AD risk have important implications for treatment trials, diagnostics, and therapeutics. 3 Additionally, the sex-dependent relationship between APOE and mild cognitive impairment (MCI), which is often a transitional phase from cognitively normal (NL) aging to dementia, 4 is unclear. Studies are in general agreement that the APOE ε4 allele is a risk factor for developing MCI, [5] [6] [7] [8] [9] [10] [11] but there is controversy as to whether it increases 10,12-14 or does not increase 9, 11, 15, 16 the risks of transitioning from MCI to AD or dementia. The 3 most common alleles of the APOE gene are ε2, ε3, and ε4; whereas carrying the ε4 allele increases one's risk of developing AD, the ε2 allele conversely has a putative protective effect that is associated with longevity and a lower AD risk."}, {"section_title": "17", "text": "Studies of participants with a family history of late-onset AD have reported that women with 1 copy of ε4 have a greater risk than male heterozygote ε4 carriers, who in turn have about the same risk as male ε3 homozygotes. 18, 19 This sex dependence was also found in first-degree (parents and siblings) relatives of individuals with AD, 20, 21 and in the meta-analysis of Farrer et al, 1 which aggregated data from 40 independent research studies. Among studies of residents in city suburbs and communities, there is general agreement that elderly female ε4 carriers have an increased risk of AD, dementia, and cognitive decline vs male ε4 carriers. [22] [23] [24] [25] However, when participants are randomly recruited from hospitals, retirement homes, and aging consortiums, most studies have found no sexspecific difference between men and women in the risks of AD and dementia associated with the APOE ε4 allele. [26] [27] [28] [29] The sexdependent role of APOE ε4 in the risks of developing MCI and in MCI conversions to AD has been recently investigated, 3, 30 and there is evidence that women are at greater risk than men."}, {"section_title": "Methods", "text": "We collected data sets from 27 independent research studies totaling nearly 58 000 participants. Information was collected on each participant's APOE genotype, sex, race, ethnicity, diagnosis (NL, MCI, or AD), and age at diagnosis. From these data sets we included only white participants who were mostly non-Hispanic. The Global Alzheimer's Association Interactive Network receives coded information and does not distribute data."}, {"section_title": "Global Alzheimer's Association Interactive Network Data Sets", "text": "Prospective participants for this meta-analysis were identified using resources 31 from the Global Alzheimer's Association Interactive Network. 32, 33 As shown in Table 1 , 34-58 we used multiple data sets from 12 research institutions in the Global Alzheimer's Association Interactive Network, with 2 institutions (National Institute on Aging Genetics of Alzheimer's Disease Data Storage Site and Coalition Against Major Diseases) managing data from several independent studies. Details of the data sets obtained through the Global Alzheimer's Association Interactive Network are given in the eAppendix in the Supplement.\nWe did not receive information about clinical diagnoses for all participants, and in some cases the ages of elderly participants were truncated downward to 90 years to protect their identities. We excluded patients with missing information and/or 90-year truncated ages from all data sets. In many data sets, birth dates were rounded to the nearest year as an extra measure to protect patient confidentiality. We excluded data from participants in the National Alzheimer's Coordinating Center (NACC) data set who were also known to have participated in the Alzheimer's Disease Neuroimaging Initiative Study; however, the full extent of the participant overlap between NACC and the Alzheimer's Disease Neuroimaging Initiative has not currently been established but is estimated to be at most 3%. Across data sets, most participants were white, and for many participants, racial/ethnic information was either not collected or not known. Owing to insufficient numbers of other races/ethnicities, we only included white participants (along with participants from the Fundació ACE and Australian Imaging, Biomarker and Lifestyle Flagship Study of Ageing data sets) with non-Hispanic or unknown ethnicities. Through our correspondences with data set providers, we estimate that Hispanic participants make up no more than 5% of all white participants with unknown ethnicities. After applying exclusion criteria, these data sets were representative of non-Hispanic white individuals in North America and Europe.\nThe descriptions of the clinical diagnoses we received were unstandardized 33 and the levels of detail varied across different data sets according to how each disease was defined (eg, mild or moderate AD) and how it was recorded (eg, AD associated with cerebrovascular disease). We worked directly with each data set provider to translate each set of diagnoses into our 3 general preplanned diagnoses: NL, MCI, and AD. In addition, we excluded all patients with a clinical history of stroke, cerebrovascular disease, Lewy bodies, amyloid precursor protein or presenilin gene mutations, or comorbidity with any other known neurological disease. All subtypes of MCI (eg, amnestic and nonamnestic) were combined into a single MCI diagnosis. "}, {"section_title": "1181", "text": "For longitudinal data sets (eg, NACC and Framingham Heart Study) that had multiple diagnoses per participant, we assigned each participant a single diagnosis. Each participant without a history of MCI or AD was assigned an NL diagnosis, each participant with a history of MCI and no history of AD was assigned an MCI diagnosis, and each participant with a history of AD and no history of MCI was assigned an AD diagnosis. Participants with a history of both MCI and AD were randomly assigned either an MCI or AD diagnosis. We used the latest examination age for the diagnosis age of participants with NL and the earliest recorded age of MCI or AD for participants with MCI and AD, respectively. With the exception of the FHS data set, no participants were followed up more than 10 years; therefore, our NL diagnosis ages were not significantly skewed toward very old ages. We used these diagnosis assignments to form 3 case-control study groups containing 22 AD-NL, 10 MCI-NL, and 7 AD-MCI data sets."}, {"section_title": "Statistical Analysis", "text": "Meta-analyses of the case-control study groups were conducted using the Mantel-Haenszel fixed-effects method to calculate odds ratios for each sex and APOE genotype, using the APOE ε3/ε3 genotype as the referent. We imputed missing NL data in the ACE, Coalition Against Major Diseases, Translational Genomics Research Institute series 2, and Religious Orders Study and Rush Memory and Aging Project data sets using available NL participant data as follows. The Mann-Whitney U test was used to compare the age distributions of participants with normal cognition from each research study, and dissimilar NL participant data was excluded. In particular, we excluded the Alzheimer's Disease Repository Without Borders and Wisconsin Registry for Alzheimer's Prevention data sets because the median age of their participants with NL was relatively young (mid-50s to mid-60s) and that of the Adult Changes in Thought data set was comparatively older (lower 80s). Variations in the total numbers of ε2, ε3, and ε4 alleles of participants with NL were then compared using the χ 2 test of homogeneity to exclude correspondingly heterogeneous data sets. Data from each ascertainment-adjusted case-control study group were then pooled together, and logistic regression was used to calculate ORs for each sex and APOE genotype ( Table 2) . For each sex, a continuous age variable and 5 indicator variables (values of 1 or zero) representing the 5 APOE genotypes (ε2/ε2, ε2/ε3, ε2/ε4, ε3/ε4, and ε4/ε4) were used, with the APOE ε3/ε3 genotype as the referent. We also conducted another pooled analysis where we added a sex indicator variable and 5 additional covariates that were products of the sex variable with each APOE genotype variable to test for sex interactions. The age-dependent curves shown in Figure 1 were derived by adding several quadratic covariate products to the logistic regression that were created by combining APOE genotype, sex, and age. Because the NACC data set was predominantly larger (48% to 85%) than other data sets in the pooled analysis, we separated it from the pooled data and repeated the analyses without it and exclusively with it. Results of all these analyses are listed in the eMethods and eTables 1-3 in the Supplement for the APOE ε3/ε4 genotype.\nStatistical analyses were performed in R, version 3.3.1, using the metafor meta-analysis package, version 1.9-9, along with the glm generalized linear model function (R Programming).\n60 Mathematica, 61 version 10.0, was used for curve fitting and plotting. The P value level of significance was .05, and P values were 2-sided."}, {"section_title": "Results", "text": "From an aggregation of 27 independent research studies with a total of 57 979 participants (Table 1) , meta-analyses were performed on 31 340 non-Hispanic white individuals, with clinical diagnoses between ages 55 and 85 years in 3 case-control analyses ( Figure 2 ). After excluding ascertainment-biased studies, the data in each analysis were pooled, and ORs for each sex and APOE genotype (Table 2) were calculated. In all casecontrol analyses, between-study heterogeneity was reduced after the removal of ascertainment-biased study data. However, P values from the Tarone 62 test of heterogeneity (Table 2) still detected significant study heterogeneity in the female APOE ε3/ε4 data (OR, 3.31; 95% CI, 3.03-3.61; P=.03) and in the APOE ε4/ε4 data (men, OR, 11.7; 95% CI, 9.24-14.7; P = .02; women, OR, 9.67; 95% CI, 8.07-11.6; P < .001) of the AD-NL analysis. On further investigation (eTable 1 in the Supplement), we found that the heterogeneity in the female APOE ε3/ε4 data was localized to ages 75 to 85 years (OR, 3.28; 95% CI, 2.92-3.68; P = .003). This determination was supported after comparing the ORs in that age range from analyses without the NACC data set (OR, 2.67; 95% CI, 2.23-3.21) and with the NACC data set exclusively (OR, 4.12; 95% CI, 3.41-4.98). Otherwise, between the ages of 55 and 85 years, the 95% confidence intervals of the ORs calculated from pooled data without the NACC data set overlapped the confidence intervals of the ORs calculated using the NACC data set alone. As shown in Table 2 , men and women with the APOE ε3/ε4 genotype had the same risks of developing AD (men, OR, 3.09; 95% CI, 2.79-3.42; women, OR, 3.31; 95% CI, 3.03-3.61; P = .47) between the ages of 55 and 85 years. Men with APOE ε3/ε4 had an increased risk of AD compared with men with ε3/ε3 (P < .001). The APOE ε2/ε3 genotype decreased the risk of AD more for women than for men (women, OR, 0.51; 95% CI, 0.43-0.61; men, OR, 0.71; 95% CI, 0.60-0.85; P = .01). Men and women with the APOE ε3/ε4 genotype had the same risks of developing MCI between ages 55 and 85 years (men, OR, 1.55; 95% CI, 1.36-1.76; women, OR, 1.60; 95% CI, 1.43-1.81; P value = .82). Alzheimer disease and MCI risk factors were calculated for men and women between ages 55 and 85 years for each APOE genotype. Age-adjusted odds ratios are listed in Table 2 and shown in Figure 1 as a function of age for the APOE ε3/ε4 genotype. All male odds ratios were calculated relative to men with ε3/ε3, and all female odds ratios relative to women with ε3/ε3. Three conversion cases were considered: (1) developing AD from a cognitively normal (NL) status, (2) developing MCI from an NL status, and (3) transitioning from MCI to AD. Each conversion is labeled AD-NL, MCI-NL, and AD-MCI, respectively, in Table 2 and Figure 1 .\nOdds ratio curves for men and women with the APOE ε3/ε4 genotype are shown in Figure 1 between age 55 and 85 years. The ORs calculated from the pooled data analyses in 3 age ranges (55-65 years, 65-75 years, and 75-85 years) are plotted for each sex, with error bars indicating their 95% confidence intervals. As shown in Figure 1A between ages 65 and 75 years, women with APOE ε3/ε4 had an increased risk of AD compared with men with ε3/ε4 (women, OR, 4.37; 95% CI, 3.82-5.00; men, OR, 3.14; 95% CI, 2.68-3.67; P = .002). In Figure 1B , the OR curves suggested that women with APOE ε3/ε4 were at higher risk for developing MCI than men between ages 55 and 70 years, which was confirmed in a separate analysis in that age range (women, OR, 1.43; 95% CI, 1.19-1.73; men, OR, 1.07; 95% CI, 0.87-1.30; P = .05). No significant risk differences between men and women for MCI to AD transitions were found in Figure 1C , but the OR curves parallel a previous study that found that APOE ε4 increased the risk of transitioning from MCI to AD between the ages of 70 to 85 years, but not between the ages of 55 to 69 years."}, {"section_title": "16", "text": ""}, {"section_title": "Discussion", "text": "When examining the entire age span from 55 to 85 years, men and women with the APOE ε3/ε4 genotype had nearly the same odds of developing MCI and AD, both in comparisons between data sets and in data set aggregation. Notably, women had an increased risk of MCI between ages 55 and 70 years and an increased risk of AD between ages 65 and 75 years. These results are consistent with a previous study that found a significant association between APOE ε4 and cognitive decline between ages 70 and 80 years in women only 24 and with another study that found that episodic memory was more impaired in women with APOE ε3/ε4 than in men with ε3/ε4 between ages 70 and 74 years. 25 Mechanisms that underlie these sex differences may be linked to physiologic changes associated with menopause and estrogen loss that begins at a mean age of 51 years 63 just prior to our risk groups. Studies in animals and humans have reported an interaction between APOE ε4, menopause, and cognitive decline (for a review, see Riedel et al 64 ). Furthermore, other evidence suggests that carrying 1 copy of APOE ε4 shifts the age at onset in women, but not in men.\n18 Collectively, our findings, along with previous work, warrant further investigation into a likely complex set of risk factors with consideration of sex-specific treatments for cognitive decline and AD. For example, if women are at increased risk for AD at younger ages, it is plausible that treatments for women may need to be initiated earlier, especially in those who carry an APOE ε4 allele. Both men and women with APOE ε3/ε4 had an increased risk of AD compared with men and women with ε3/ε3, respectively. The APOE ε2/ε3 genotype conferred more of a protective effect on women, decreasing their risk of AD more than men. No significant sexdependent differences were found for transitioning between MCI and AD. Our ORs for developing MCI are consistent with other studies."}, {"section_title": "6,65", "text": "After adjusting for NL participant differences between AD studies by replacing participants with NL with the data set we used for imputation, there was significant variation of AD risk between data sets; the male and female ε3/ε4 ORs were near 1 for the ACE data set and nearly 7 for the National Institute on Aging Late-Onset Alzheimer's Disease Family Study data set. In retrospect, high ORs were not remarkable for the National Institute on Aging Late-Onset Alzheimer's Disease Family Study, which recruited families with 2 or more affected siblings with AD because family history of AD is an AD risk factor and the probability of carrying a genetic mutation in a recognized AD gene increases with the number of first-degree relatives affected with AD. 66 The lowest ORs tended to be associated with community-based studies (eg, ACE, ARWIBO, and FHS) that ascertained participants from geographically specific cities and suburbs. As shown in eFigure 4 in the Supplement, most data points clustered around the NACC data point; these studies primarily recruited random participants who were unrelated to each other. These results are notably different from those of Farrer et al, 1 who found that the relative odds of women with ε3/ε4 compared with men with ε3/ε4 for developing AD were about 1.5, and that men with ε3/ε3 and ε3/ε4 had the same AD risks when participants were ascertained from clinics/ hospitals and autopsies/brain banks (n = 6305). Many of the participants in their meta-analysis had family histories of AD, they noted differences with population-based studies, and they aggregated participants with early-onset AD. Inclusion of the latter participants could help explain why their AD ORs curves for individuals with ε3/ε4 reached their maxima around ages 60 to 65 years, as opposed to ours, which reached their maxima around ages 73 to 80 years. These results are in closer agreement with studies that have found ε3/ε4 carriers to have a mean age at clinical onset of 76 years, and the risk for developing late-onset AD to occur primarily between ages 60 and 79 years. 26 We note that betw eentheag esof6 5t o75y ears,theORsofw omenand men with APOE ε3/ε4 differed by a factor of about 1.5, which is consistent with the results of Farrer et al 1 across all ages.\nOur result that the APOE ε2/ε3 genotype decreased the risk of AD more for women than for men is the opposite of what they found; this is likely owing to the fact that our analysis (n = 1482) used more than 3 times the number of participants than they used (n = 447).\nIn agreement with previous studies, 1, 67 we found that individuals with 2 copies of the APOE ε4 allele were at greater risk for developing AD than individuals with only 1 copy. No significant differences between men and women with ε4/ε4 were seen in their risks for developing AD, which is consistent with the results reported by Farrer et al. 1 Apolipoprotein ε4 homozygotes also had increased risks compared with ε4 heterozygotes for MCI and for transitioning from MCI to AD. Ascertainment biases are known to modify the true effects of APOE on the risks of developing AD, and they may have played a role in the variations we found between data sets. Men have higher rates of cardiovascular disease and stroke than women, so men who live to old age may be healthier than women of the same age and therefore have lesser risks of developing AD.\n68,69 On average, women live longer than men, which makes it difficult to locate older men with AD in sufficient numbers to study. "}, {"section_title": "Conclusions", "text": "In this meta-analysis of 27 independent research studies with 58 000 participants, women and men with 1 copy of APOE ε4 did not show a difference in risk of Alzheimer disease across the lifespan of 55 to 85 years. However, these women were at increased risk vs men between ages 65 and 75 years. Fundació ACE: A private organization 1 dedicated to the diagnosis, treatment, research, and support for people with dementia, especially focusing on people suffering from Alzheimer's Disease and their relatives and caregivers. There were 19,720 individuals evaluated and diagnosed between 1996 and 2015. Of these, 9,948 had AD, 6,181 had MCI, and 3,394 had no cognitive impairment. APOE genotyping was available in 3,300 subjects.\nAlzheimer's Disease Neuroimaging Initiative: ADNI 2 was launched in 2003 as a publicprivate partnership; its primary goal has been to test whether serial magnetic resonance imaging (MRI), positron emission tomography (PET), other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of MCI and early Alzheimer's disease. ADNI has 59 acquisition sites located across the United States and Canada. Through its 3 phases, it has targeted participants with AD, different stages of MCI, and normal controls.\nAustralian Imaging, Biomarker & Lifestyle Flagship Study of Ageing: AIBL 3 seeks to discover which biomarkers, cognitive characteristics, and health and lifestyle factors determine the development of AD. AIBL collects data at two centers in Australia; one at Perth in Western Australia and one in Melbourne, Victoria. AIBL follows ADNI protocols and has enrolled participants with AD, MCI, and healthy controls.\nAlzheimer's Disease Repository Without Borders: ARWIBO 4,5 is a cross-sectional data set including data from more than 2,700 patients enrolled in Brescia, Italy and nearby areas. The database contains clinical information and MRI images weighted in T1 and T2 as well as PET scans of healthy elderly controls, individuals with mild cognitive impairment (MCI), and patients with Alzheimer's disease.\nCoalition Against Major Diseases: CAMD 6 is a public-private partnership aimed at creating new tools and methods that can be applied to increase the efficiency of the development process of new treatments for Alzheimer's disease (AD) and related neurodegenerative disorders with impaired cognition and function. CAMD has developed an online repository for clinical trial data obtained in globally executed randomized controlled AD clinical studies. Because they do not share information about the masked therapeutic candidates, we refer to each of their data sets by its CAMD index: 1009, 1056, 1057, 1058, 1105, 1132, 1136, and Epidemiology study 21 is a family-based genetic epidemiological study of AD that enrolled AD cases and unaffected sibling controls at 17 clinical centers in the United States, Canada, Germany, and Greece, and contributed 1,262 subjects (509 AD cases and 753 cognitively normal elders). Although information on family history of dementia among first-degree relatives (parents, siblings, children) was collected, it was not available for our analysis.  NIA-LOAD (NG00032): The National Institute on Aging LOAD Family Study 22 recruited families with two or more affected siblings with LOAD and unrelated cognitively normal elders similar in age and ethnic background. A total of 1,819 cases and 1,969 cognitively normal elders from 1,802 families were recruited and one case per family was selected after determining the individual with the strictest diagnosis. The controls included only those samples that were neurologically evaluated to be normal and were not related to a study participant.  ACT (NG00034): The Adult Changes in Thought 23 cohort is an urban and suburban elderly population from a stable HMO that includes 2,581 cognitively intact subjects over age 65 and 811 subjects who were enrolled using the same methods except oversampling clinics with more minorities. New subjects are Prediction of cognitive properties of new drug candidates for neurodegenerative diseases in early clinical development: PharmaCog 26 (alias E-ADNI) is an industry-academic European project aimed at identifying biomarkers sensitive to symptomatic and disease modifying effects of drugs for Alzheimer's disease. Nine clinical sites participated in this study across Italy (Brescia, Verona, and Genoa), Spain (Barcelona), France (Marseille, Lille, and Toulouse) and Germany (Leipzig and Essen). 147 MCI patients have been studied along 7 time points (i.e.: BSL, T06, T12, T18, T24, T30 and T36) collecting multimodal image scans (MPRAGE, T2*, FLAIR, DTI, rsfMRI), clinical variables, and biospecimens.\nWisconsin Registry for Alzheimer's Prevention: WRAP 27 is a longitudinal cohort study involving middle-aged adult children with parents with Alzheimer's disease. The main goal of WRAP is to understand the factors (biological, medical, environmental, and lifestyle choices) that increase a person's risk of developing Alzheimer's disease. WRAP eFigure 4. Age-adjusted odds ratios of developing Alzheimer's disease for men and women with the APOE 3/ 4 genotype from 22 independent studies. Each data point shows the relative relationship of Alzheimer's disease risk between men and women from each data set; higher risks are associated with larger odds ratio values. The area of each data point is proportional to the total number of male and female Alzheimer's disease cases in each data set. The dashed line delineates where the Alzheimer's disease risks for men and women are the same. Confidence intervals (95%) were used to draw error bars perpendicular to the dashed line for some data points."}, {"section_title": "eMethods.", "text": "Sub-Analyses Referenced in eTables 1 -3 1. Fixed-effects meta-analysis using Mantel-Haenszel method a. R (version 3.3.1) using the \"metafor\" meta-analysis package (version 1.9-9) 2. Fixed-effects meta-analysis using Mantel-Haenszel method excluding community-based (ACE, ARWIBO, FHS) and disease-biased (NIA-LOAD, TGEN2, ROS/MAP) data sets a. R (version 3.3.1) using the \"metafor\" meta-analysis package (version 1.9-9) function rma.mh(measure=\"OR\") 3. Logistic regression of pooled data using a continuous age variable and five indicator (values of one or zero) variables representing the five APOE genotypes ( 2/ 2, 2/ 3, 2/ 4, 3/ 4, and 4/ 4) with the APOE 3/ 3 genotype as the referent a. R (version 3.3.1) using the generalized linear model function glm(dx ~ age + n22 + n23 + n24 + n34 + n44, family=binomial) 4. Sub-analysis #3 with NACC data only a. R (version 3.3.1) using the generalized linear model function glm(dx ~ age + n22 + n23 + n24 + n34 + n44, family=binomial) 5. Sub-analysis #3 with NACC data excluded a. R (version 3.3.1) using the generalized linear model function glm(dx ~ age + n22 + n23 + n24 + n34 + n44, family=binomial) "}]