[{"section_title": "Abstract", "text": "Die Dokumente auf EconStor dürfen zu eigenen wissenschaftlichen Zwecken und zum Privatgebrauch gespeichert und kopiert werden.\nSie dürfen die Dokumente nicht für öffentliche oder kommerzielle Zwecke vervielfältigen, öffentlich ausstellen, öffentlich zugänglich machen, vertreiben oder anderweitig nutzen.\nSofern die Verfasser die Dokumente unter Open-Content-Lizenzen (insbesondere CC-Lizenzen) zur Verfügung gestellt haben sollten, gelten abweichend von diesen Nutzungsbedingungen die in der dort genannten Lizenz gewährten Nutzungsrechte. We investigate the impact of external differentiation and vocational orientation of (lower and upper) secondary education on country variation in the mean numeracy skills of, and skills gaps between, adults with low and intermediate formal qualifications. We use data on 30-to 44-year-olds in 18 countries from the 2011-12 round of the Program for the International Assessment of Adult Competencies. We find that higher levels of external differentiation (tracking) amplify skills gaps between less-and intermediateeducated adults. This is mainly due to lower mean skills achievement of less-educated adults. By contrast, greater emphasis on vocational skills in upper-secondary education is positively related to numeracy skills for both less-and intermediate-educated adults. Gains are larger for the less educated, so the gap in numeracy skills tends to fall with the degree of vocational orientation. We discuss implications of our findings for research on educational and labor market inequalities.\nTerms of use:\nDocuments in EconStor may"}, {"section_title": "", "text": "Across the industrialized world, computerization and growing service employment are putting greater demands on the information-processing and communication skills of the workforce (Goldin and Katz 2008 ; Organization for Economic Cooperation and Development [OECD] 2013). Scholars argue that workforce skills are a key determinant of countries' economic performance, growth, and innovation (Toner 2011) . At the individual level, literacy and numeracy skills are positively associated with labor market outcomes, even after accounting for formal educational attainment .\nDespite their obvious importance, we know relatively little about how workforce skills are related to individual characteristics and institutional context. In this article, we use recent data from the first round of the Program for the International Assessment of Adult Competencies (PIAAC), conducted by the OECD, to better understand how a country's system of lower-and upper-secondary education shapes the skills achievement of adults who did not complete tertiary education. We concentrate on the lower part of the distribution of educational attainment, that is, adults who are most likely to have insufficient skills for success in the labor market.\nWe focus on two central stratification features of secondary-education systems: external differentiation and vocational orientation (Kerckhoff 1995 (Kerckhoff , 2001 . External differentiation refers to the extent to which learning takes place in separate programs or tracks. Vocational orientation denotes the extent to which programs at the upper-secondary level emphasize vocational as opposed to general skills. We study how these two stratification features are related to the average skills achievement of, and skills differentials (or gaps) between, adults with low and intermediate levels of formal educational attainmentthat is, between adults with less than an uppersecondary degree (the less educated) and adults with upper-secondary or nontertiary postsecondary degrees (the intermediate educated). Our analyses show that the two features are indeed associated with country differences in the average skills levels of, and skills gaps between, less-and intermediate-educated individuals.\nOur study contributes to research on education inequalities. Many scholars argue that external differentiation based on prior academic achievement or ability hampers the skills development of lowability students (e.g., Gamoran 1986 Gamoran , 2000 Horn 2009; Kerckhoff 2001; van de Werfhorst and Mijs 2010) . So far, however, comparative studies on this link between external differentiation and skills inequalities have relied on large-scale assessments of students, and therefore respondents are no older than age 15. Using assessments of adults, our study is the first to explore how external differentiation in secondary education relates to the general skills of less-and intermediateeducated adults after completion of formal educational biographies.\nBetter understanding the link between formal qualifications and actual skills is important because qualifications are more readily observable than skills and therefore often serve as an important proxy for the latter. Our analysis can thus enhance our understanding of labor market inequalities by formal educational attainment. Many studies show that external differentiation exacerbates the labor market disadvantage of less-educated workers (Andersen and van de Werfhorst 2010; Gesthuizen, Solga, and Künster 2011; Levels, van der Velden, and Di Stasio 2014; Solga 2002 Solga , 2008 . Scholars attribute this to a positive effect of external differentiation on skills differentials between less-and intermediate-educated individuals (e.g., Andersen and van de Werfhorst 2010) , but this explanation has not been tested empirically. Abrassart (2013) found that at the country level, less-educated adults' nonemployment risk relative to intermediate-educated adults rises with the skills gap between the two groups. He did not, however, attempt to explain country differences in skills differentials. We show, for the first time, that skills gaps between less-and intermediate-educated workers do indeed rise with the degree of external differentiation of secondary education.\nAs for vocational orientation of uppersecondary education, researchers mostly consider this dimension in its ''capacity to structure'' school-to-work transitions and occupational attainment (Kerckhoff 2001:4 ; see also Andersen and van de Werfhorst 2010; Shavit and Müller 2000) . Vocationally oriented systems are depicted as emphasizing the development of students' vocational skills-possibly at the cost of students' general skills in literacy and mathematics (Hanushek, Woessmann, and Zhang 2011; Kerckhoff 2001) . The implication that a stronger vocational orientation lowers the general (as opposed to vocational) skills achievement of intermediate-educated workers (who attended vocational programs ) has not yet been investigated empirically. Our results suggest this is not a major issue: under ceteris paribus conditions, the mean skills of intermediate-educated adults are higher in countries with a stronger vocational orientation.\nOur empirical analysis uses data from the first round of PIAAC, which was conducted in 2011 to 2012. PIAAC provides high-quality measurements of general skills-or ''key information-processing skills'' (OECD 2013:3)-and the highest educational degree for a diverse set of economically advanced countries. In all countries, respondents were assessed with respect to literacy (reading and text comprehension) and numeracy (applied numeric and mathematical skills). PIAAC did not test vocational (occupation-specific) or more advanced cognitive (e.g., mastery of calculus) skills. To test our hypotheses, we estimate multilevel mixed-effects models on a final analysis sample that contains approximately 20,000 lessand intermediate-educated adults (ages 30 to 44 years) in 18 countries."}, {"section_title": "THEORETICAL CONSIDERATIONS AND HYPOTHESES", "text": "Our basic assumption is that external differentiation and vocational orientation of secondary education sort individuals into different learning environments and thereby define opportunities to acquire educational degrees and general skills (see Allmendinger 1989; Hallinan 1992; Horn 2009; Kerckhoff 2001; Marks 2005; van de Werfhorst and Mijs 2010) . We now discuss how these two features might influence the skills gap between, and mean skills of, less-and intermediate-educated adults."}, {"section_title": "External Differentiation", "text": "External differentiation in lower-secondary education allocates students to different programs or school tracks on the basis of achievement or demonstrated ability in primary education (Allmendinger 1989; van de Werfhorst 2011, 2013; Gamoran 1986 Gamoran , 2000 .\nA first potential mechanism through which external differentiation might affect the skills gap between, and mean skills of, less-and intermediate-educated individuals is selection. In tracked systems, low-performing students are less likely to gain access to programs leading to upper-secondary or even tertiary educational degrees (Bol and van de Werfhorst 2013) . One likely reason for this is that early tracking creates visible divides between higher-and lower-achieving students, which disadvantage the latter when it comes to securing access to programs at the upper-secondary level.\nStronger external differentiation in lowersecondary education should thus raise the probability that students with low initial levels of skills (or ability) do not transition to or do not complete upper-secondary education, thus ending up in the group with less than upper-secondary education degrees. Conversely, less or nontracked systems presumably weaken the link between skills achievement and access to programs at the upper-secondary level.\nIn addition, external differentiation might reinforce (preexisting) differences in general skills due to ability grouping. Low-performing students might benefit from learning together with higherachieving peers due to fewer interruptions and disciplinary problems, more demanding curricula and teaching practices, higher teacher expectations and aspirations, and support by and role-model effects of higher-achieving peers (Gamoran 2000; Horn 2009; Kerckhoff 2001) . In externally differentiated systems, ability grouping tends to deprive lower-achieving students of such positive stimulation. As a result, differences in skills should increase over the course of secondary education (Gamoran 2000) ."}, {"section_title": "1", "text": "These potential selection and ability grouping effects suggest the following hypotheses concerning external differentiation in lower-secondary education:\nHypothesis 1: The size of the skills gap between less-and intermediate-educated adults rises with the degree of external differentiation. Hypothesis 2: The mean skills of lesseducated adults decrease with the degree of external differentiation.\nWe have no clear expectation concerning the mean skills of intermediate-educated adults. One reason is that their skills achievement should also depend on the selectivity of access to tertiary education. In addition, the implications of ability grouping are more ambiguous for this group. On the one hand, more differentiated learning environments might deprive them of the benefits of learning together with even higher-achieving students. On the other hand, they might gain from the exclusion of low-performing students."}, {"section_title": "Vocational Orientation", "text": "Vocational orientation refers to the emphasis on vocational (as opposed to general) skills in upper-secondary education. Together with employer-school links and the standardization of vocational programs, it is one of the three crucial dimensions of occupational specificity of uppersecondary education (Allmendinger 1989; Bol and van de Werfhorst 2013; Shavit and Müller 2000) . We discuss two channels through which vocational orientation might affect the skills gap between, and mean skills of, less-and intermediate-educated adults: learning time devoted to the acquisition of general skills and students' learning efforts. As for learning time, a vocational instead of general education directly affects which skills are accentuated in upper-secondary education. More vocationally oriented systems put greater emphasis on vocational skills, which arguably limits the time available for developing general skills (OECD 2010 (OECD , 2013 . Countries with apprenticeship systems, such as Germany, exemplify this potential trade-off: ''In many apprenticeships, there is a rather small element of numeracy and literacy skills as part of the (typically) one or one and a half days a week part-time school element in the dual system'' (OECD 2010:60) .\nIn more vocationally oriented systems, the average adult with an upper-secondary education degree has therefore devoted a larger proportion of her or his total learning time to acquiring vocational skills-rather than the kinds of general skills assessed in PIAAC. This suggests that higher vocational orientation will lower the (general) skills achievement of intermediate-educated adults and thereby reduce the skills differential between less-and intermediate-educated adults.\nTurning to learning effort, it is important to acknowledge that vocational orientation in uppersecondary education is a constitutive part of occupational labor markets (Hall and Soskice 2001; Marsden 1990 ). In these labor markets, adults with vocational certificates have rather good opportunities to obtain skilled positions. By contrast, in countries with general upper-secondary education systems, a tertiary degree is often needed to avoid unskilled jobs (Shavit and Müller 2000; Soskice 1994) . Moreover, in countries with a strong vocational orientation, employers and society as a whole tend to expect that all cohort members complete a vocational or tertiary program before entering the labor market (Solga 2008) . Soskice (1994:33) argues that the vocational orientation of upper-secondary education and occupational labor markets therefore produce an ''incentive structure . . . to work hard at school, independent of their ability level'' (emphasis added). The idea is that occupational labor markets give low-ability students an incentive to work hard in lower-secondary school, because doing so increases their chances to enter vocational programs, which will greatly enhance their labor market prospects. More able students likewise have strong incentives to learn. They typically want to secure one of the more attractive apprenticeships in more prestigious occupations or with better firms (Soskice 1994) . By contrast, in more general education systems (e.g., in the United States) ''where improved school performance only marginally improves employment prospects for non-higher-education schoolleaver . . . the incentives to work hard academically are therefore limited for young people with little chance of getting into higher education'' (Soskice 1994:55) . According to this argument, stronger vocational orientation of upper-secondary education should encourage students with lower and average ability to develop their general skills in lower-secondary school.\nOur considerations of the effects of vocational orientation in upper-secondary education suggest the following hypotheses:\nHypothesis 3: The skills gap between less-and intermediate-educated adults is smaller in more vocationally oriented systems (learning-time or learning effort argument). Hypothesis 4: The mean skills of less-educated adults are higher in more vocationally oriented systems (learning-effort argument).\nAs for the mean skills of intermediate-educated adults, the learning time and effort mechanisms work in opposite directions and therefore suggest two competing hypotheses:\nHypothesis 5a: The learning effort argument suggests that the mean skills of intermediate-educated adults are higher in more vocationally oriented systems. Hypothesis 5b: The learning time argument, by contrast, suggests that the mean general skills of intermediate-educated adults are lower in more vocationally oriented systems.\nAccording to Hypotheses 1 through 4, external differentiation and vocational orientation have opposite effects on the mean skills of the less educated and on the skills gap between less-and intermediate-educated adults. Hence, it is worth noting that empirically, there is a relatively strong positive correlation between external differentiation and vocational orientation. For the 18 countries studied here, the correlation between external differentiation and vocational orientation, as we measure them (see the Methods section), is almost .7. This suggests their effects partly cancel each other out-and each should be considerably stronger when the other factor is held constant. In testing Hypotheses 3 and 5b, we do not directly examine if investing in vocational skills depresses the general skills achievement of intermediate-educated adults. PIAAC does not allow us to explore how much time students spent on developing general versus vocational skills (nor does any other data set we know of). One might suggest addressing this question by comparing adults with vocational versus general upper-secondary education in countries where both groups exist. Such a comparison would be highly problematic, however. PIAAC provides only the highest educational degree completed. Yet, individuals whose highest degree is at the general uppersecondary level do not comprise all individuals who ever completed such programs. Instead, they are the rather selective group who did not continue to tertiary education. To compare adults with vocational qualifications to all adults who completed general upper-secondary education, we would have to include individuals with tertiary degrees in the latter group. Yet, such a comparison would be problematic as well: tertiary education presumably has an independent (positive) effect on general skills, which we cannot account for with the cross-sectional PIAAC data. We therefore stick with our indirect Hypotheses 3 and 5b and take their rejection or nonrejection as signaling the plausibility of our theoretical explanation (Hedström and Swedberg 1996) ."}, {"section_title": "Alternative Explanations", "text": "The absolute and relative skills achievement of less-and intermediate-educated adults could of course also depend on other macrolevel factors. Extent literature suggests three aspects: heterogeneity of school quality, adult education participation, and skills inequalities before the onset of secondary education.\nLike us, Park and Kyei (2011) studied crossnational variation in skills gaps by educational attainment, but they focused on between-school inequality with respect to various resources in lower-secondary education (e.g., instructional resources, class size, and teacher experience). They found that greater between-school inequality amplifies literacy gaps between less-and intermediate-educated young adults. Park and Kyei (2011) also show that further training participation after leaving full-time education is related to literacy gaps. In their study, smaller inequalities in training participation between educational groups were associated with smaller literacy gaps. However, it is difficult to establish the direction of causality based on crosssectional data. While it is plausible that smaller inequalities in adult training participation reduce skills gaps, the opposite also seems likely-namely, that smaller skills gaps lead to smaller training gaps. Individuals with greater skills are likely to pursue further education (e.g., because returns to further education depend on information-processing skills or because employers target training measures toward more skilled employees). This suggests that training participation gaps are endogenous to skills gaps. Their cross-sectional effects should therefore be viewed with caution.\nAll country-level factors discussed so far broadly refer to effects of the education system on adults' skills. Merry (2013) recently criticized an exaggerated focus on school-related factors and stressed the importance of social conditions that are external to the education system (see also Gamoran 2000) . Such conditions include differences in poverty rates, ethnic heterogeneity, and health systems. These factors likely affect children's cognitive development and learning processes as well as the challenges schools face (Merry 2013) . Adults' skills achievement might also reflect long-run effects of differences in the effectiveness of primary education (i.e., before the features of secondary education that we are interested in have had an impact). These two considerations suggest we should account for skills inequalities before the onset of lower-secondary education.\nIn the empirical analysis, we examine whether our findings are robust to the inclusion of control variables capturing these alternative explanations."}, {"section_title": "Summary of Main Research Question and Hypotheses", "text": "Our study is the first to examine how external differentiation and vocational orientation of (lower and upper) secondary education relate to the skills achievement of less-and intermediate-educated adults. We expect external differentiation to amplify skills differentials between the two groups (Hypothesis 1), primarily by depressing the skills achievement of the less educated (Hypothesis 2). We further expect that vocational orientation decreases the skills gap (Hypothesis 3) primarily by raising the average skills of the less educated (Hypothesis 4). For the skills level of the intermediate educated, we could formulate clear, but opposite, expectations concerning only vocational orientation: the learning-effort argument suggests a positive effect (Hypothesis 5a), whereas the learning-time argument posits a negative effect (Hypothesis 5b)."}, {"section_title": "DATA AND METHODS", "text": ""}, {"section_title": "Data and Sample", "text": "We use data from the first round of PIAAC (OECD 2013), which was conducted in 2011 to 2012 in 24 countries. All country samples are probability samples of the population ages 16 to 65 years, with a minimum sample size of 5,000 and a total sample size of approximately 160,000 cases. We analyze the public-use files that are available on the OECD's PIAAC webpage."}, {"section_title": "2", "text": "Our analysis includes 18 of the 24 countries. 3 We exclude Cyprus because of a very high share of literacy-related nonrespondents (LRNRs; OECD 2013), Russia because of concerns about data quality, and Australia because it provides no public-use file. In three cases-Estonia, France, and Poland-we lack information on country-level variables.\nThe analysis includes only respondents with low or intermediate educational attainment (for details on the attainment measure, see below). We exclude respondents who obtained their highest degree in a foreign country, because their degrees and skills cannot be considered the result of the education system of their current country of residence.\nWe further restrict the sample to respondents who were 30 to 44 years old in 2011 (i.e., birth cohorts 1967 to 1981). These respondents went to secondary school between the late 1970s and the late 1990s and, with very few exceptions, had left full-time education by 2011. The lower age threshold ensures that we capture skills inequalities after the end of individuals' main educational biographies. The upper threshold guarantees a reasonable match with our education system variables, while maintaining sufficiently large sample sizes.\nSome respondents sampled by PIAAC did not complete the survey because of insufficient proficiency in the interview language (the most common reason), reading or writing difficulties, or learning or mental disabilities. For these LRNRs, only information on gender and age is available.\nIn our sample of 30-to 44-year-olds with at most an upper-secondary degree, the proportion of LRNRs ranges from 0 percent (Canada, Finland, and Sweden) to 8.7 percent in the United States and 11.0 percent in Belgium (see Table  1 ). Excluding them from the analysis would bias our results, because literacy-related nonresponse is likely related to lower skills even after accounting for age and gender (van de Kerckhove, Mohadjer, and Krenzke 2013).\nWe therefore include LRNRs in the analysis. To do so, we had to assign them values on all variables other than gender and age. For each LRNR, we first imputed 10 numeracy scores by randomly drawing from a normal distribution with a mean of 85 and a standard deviation of 35. 4 We used 10 imputations because skills scores for regular respondents are also provided using 10 plausible values that reflect the uncertainty of the estimated competence scores. By assuming a mean competence score of 85, we followed the OECD (2013:69), who used this value to gauge the impact of including LRNRs on country averages. We used a standard deviation of 35 because this is the approximate standard deviation of numeracy scores among a second smaller group of partial LRNRs, who completed the background questionnaire but not the assessment part of PIAAC."}, {"section_title": "5", "text": "Using the numeracy scores imputed in the first step as well as age and gender, we then obtained 10 imputations, one for each plausible value, of all other individual-level variables included in our analysis. We used the mi impute chained routine in Stata 13.\nWe conducted several analyses to gauge the sensitivity of our results to this approach toward literacy-related nonresponse. As we discuss in the Robustness Checks section, results of these analyses were generally consistent with those reported in the main article.\nOur final sample covers 18 countries and includes 19,942 respondents with complete information on all individual-level variables and 515 LRNRs, yielding a total sample size of 20,457 respondents. The sample actually used in the analysis is somewhat smaller, because we excluded LRNRs from the analysis of a given imputation if they were imputed to have obtained their highest degree in a foreign country or to have a tertiary education degree. The average actual sample size across the 10 imputations is 20,361. . Sample does not include respondents who obtained their highest degree in a foreign country (i.e., in a different country from where they took part in the PIAAC). Sample includes LRNRs who, mostly because of language difficulties, did not take part in the PIAAC assessment. For LRNRs, only information on gender and age is available. Numeracy scores were randomly assigned to them by drawing from a normal distribution with a mean of 85 and a standard deviation of 35. For all other characteristics, including level of education and having a foreign degree, values were then multiply imputed (10 imputations) using gender, age, and the assumed numeracy scores as predictors. Figures in columns 1 through 3 and columns 6 through 9 are partly based on these imputed values."}, {"section_title": "Individual-level Variables", "text": "Our analysis combines individual-and countrylevel data. Like most large-scale assessments, PIAAC administered only a relatively small number of test items to each individual. Individual competence scores are therefore quite uncertain. To account for this, PIAAC provides 10 plausible values rather than a unique score for each respondent. All estimates presented in the article and online appendix were obtained by running the respective analysis 10 times (once for each plausible value) and then applying standard rules for obtaining final point estimates and standard errors (see, e.g., Little and Rubin 2002).\nOur main individual-level independent variable is highest educational degree. Here, PIAAC provides internationally comparable information based on the 2011 revision of the International Standard Classification of Education (ISCED). According to our research question and the corresponding sample restriction, we distinguish between low (ISCED 0-2) and intermediate qualifications-equivalent to having completed less-than-upper-secondary and uppersecondary or (nontertiary) postsecondary education, respectively.\nTo account for compositional differences among countries, our regressions include the following individual-level control variables: age (three categories: 30 to 34, 35 to 39, and 40 to 44 years), gender, and migration/language status. The latter variable takes four values indicating whether respondents were born in the country where they took the test and whether their primary language was that of the test language or another language. Table 2 displays the values of our country-level independent variables, and Table 3 shows the correlation matrix. For the regression analysis, we standardized all predictors to have a mean of 0 and a standard deviation of 1."}, {"section_title": "Country-level Variables", "text": "To measure external differentiation, we use an index developed by Bol and van de Werfhorst (2013; Educational Systems Dataset, version 4). 6 This index is based on a principal factor analysis of three variables: age of first selection into different tracks (reverse coded), number of tracks available at age 15, and length of tracked education as a proportion of the total duration of primary and secondary education. Values for these variables refer to 2003 (age of first selection and number of tracks at age 15) and 2002 (length of tracked curriculum) or the closest year available (for details, see Bol and van de Werfhorst 2013) . Bol and van de Werfhorst (2013:294) report that the index has a high eigenvalue of 1.76-that means it explains approximately 59 percent (1.76 / 3 ' 0.59) of the total variance of the three underlying variables. Using the raw data provided in their data set, we calculated a standardized Cronbach's alpha of .87 for the three variables, which indicates they are strongly interrelated.\nIn countries with strong external differentiation, tracking usually starts before age 15, and thus in lower-secondary education (e.g., in Austria and Germany at age 10, in the Czech Republic at age 11, and in Belgium and the Netherlands at age 12; Bol and van de Werfhorst 2013) . The index therefore effectively captures external differentiation in lower-secondary education. This is important because less-educated adults may never have attended (and by definition have not completed) upper-secondary education.\nWe measure vocational orientation using Bol and van de Werfhorst's (2013) vocational orientation index. 7 This index is based on the proportion of students in upper-secondary education who are Our focal country-level variables capture differences in secondary-education systems in the early to mid-2000s, when the cohorts we study had mostly left secondary education. Our empirical strategy thus hinges on the assumption that changes in education systems between the late 1970s and the 2000s were rather limited for our country sample. To the best of our knowledge, none of the 18 countries radically changed their extent of external differentiation or vocational orientation during this period. For vocational orientation, we can draw on older data to partly confirm this assumption empirically. For 14 of the 18 countries in our sample, OECD (1998 :Table C2 ) provides the proportion of vocational enrollment at the upper-secondary level in 1996-that is, approximately 8 to 10 years before the reference year of Bol and van de Werfhorst's (2013) index of vocational orientation. The bivariate correlation between the enrollment share in 1996 and the vocational orientation index is .92. We are therefore confident that our variables are good proxies for country differences in secondary-education systems, as they affected the cohorts in our sample. Further indirect evidence for the validity of the indices comes from their ability to account for plausible country differences in labor market outcomes in samples that include even older cohorts than our analysis (Bol and van de Werfhorst 2011; . Finally, we reestimated our main regression models for 25-to 34-year-olds (for whom potential mismatch problems should be smaller), and the results were consistent with our main analysis (see the Robustness Checks section).\nTo control for the three alternative explanations, we use the following variables. Following Park and Kyei (2011) , we measure between-school inequality of instructional resources based on information from the eighth-grade school principal questionnaires of the Trends in International Mathematics and Science Study (TIMSS). School principals indicated to what extent (4-point scale) their school's capacity to provide instruction was affected by shortages or inadequacies in 17 different domains. Like Park and Kyei, we averaged all 17 items to obtain a measure of resources for each school and then computed the Theil index to capture between-school inequality. We used TIMSS 1995 (earliest available year) for all countries except Finland, where we used 1999. To account for preexisting inequalities in educational achievement owing to differences in social conditions (e.g., greater economic inequality; Merry 2013) or preschool and primary education, we control for skills inequality at the end of primary school. We use the difference in mathematics achievement between the 50th and 5th percentile in the fourth grade of TIMSS (again, we used the earliest available year: 1995, 2003, or 2011; see notes to Table 2 for details)."}, {"section_title": "Data Analysis", "text": "We test our hypotheses using mixed-effects multilevel models (Raudenbush and Bryk 2002) . These models account for the fact that individual observations in our data are clustered within countries and therefore not independent. We provide a more detailed and formal description of our analysis model in Section A of the online appendix. Here we only summarize its main features.\nThe dependent variable is the numeracy score, and the focal individual-level predictor is a dummy variable for having intermediate qualifications. To assess the impact of country-level factors on the skills gap between less-and intermediate-educated adults, we include cross-level interaction terms between having intermediate qualifications and the country-level variables. Effects of the contextual factors on the mean skills of less-educated adults are captured by the main effects of the country variables (i.e., by their effects on the intercept). The main effect of a country-level variable plus the cross-level interaction term yields the predicted effect on the mean skills of intermediateeducated adults. As individual-level control variables, we include gender, age, and migration/language status.\nCurrent applications of mixed-effects models in country-comparative settings tend to specify the effects of most individual-level variables as fixed-that is, as invariant across countries. This is usually implausible, and recent simulation evidence suggests it can lead to substantial efficiency losses (Heisig, Schaeffer, and Giesecke 2014) . We therefore specify random slopes for all individuallevel variables.\nWe estimate all models by restricted maximum likelihood in R (R Core Team 2014), using the lmer function from the package lme4 (Bates et al. 2014 ). All random effects are assumed to have means of zero and follow a multivariate normal distribution with covariance matrix S. We estimate degrees of freedom for confidence intervals and hypothesis tests using Satterthwaite's approximation (as implemented in the package lmerTest; Kuznetsova, Brockhoff, and Bojesen 2015) and Barnard and Rubin's (1999) adjustments for multiply imputed data.\nSimulation studies (Heisig et al. 2014; Stegmueller 2013) suggest that the standard errors and associated p values of mixed-effects models can be downward biased when the number of higherlevel units is below 20 to 25, especially when there are multiple random effects. We have only 18 cases in our application. To assess this issue, we replicated the main regression models using a two-step procedure that yields correct standard errors but is feasible only for the cross-level interaction terms (details of the method and results are presented in Section B of the online appendix). The two-step estimates of the cross-level interaction effects of external differentiation and vocational orientation do not indicate major problems with the standard errors and p values reported in the main article, suggesting that the significance levels reported in Table 4 are correct (see the Results section)."}, {"section_title": "RESULTS", "text": "We start with descriptive findings on country variation in the mean numeracy achievement of the two educational groups and the size of the skills gap. We then turn to the multilevel regression models for testing the hypothesized country-level relationships. We will sometimes use terms such as effect or impact that have causal connotations. We do this to improve readability and do not mean to imply that our estimation approach yields unbiased estimates of causal effects (even though we do mean our hypotheses to describe causal relationships). For less-educated adults, the average score is lowest in the United States (155.5) and highest in Finland (265.8). This difference of 110.3 points corresponds to more than two competence levels. The PIAAC framework distinguishes six competence levels (below level 1 to level 5)-with the intermediate levels 1 through 4 each spanning a range of 50 points (OECD 2013:76) . Another benchmark for putting this value in perspective is the standard deviation of numeracy scores for the full PIAAC sample (i.e., adults age 16 to 65 years from all participating countries), which is 51.3 points (OECD 2013:266) ."}, {"section_title": "Mean Numeracy Levels", "text": "For intermediate-educated adults (ISCED 3-4), country differences in mean numeracy skills are smaller but still sizable, ranging from 237.9 points in the United States to 285.3 points in the Netherlands. This difference amounts to almost 50 points, or one PIAAC competence level. Figure 2 shows unadjusted and adjusted numeracy gaps between less-and intermediate-educated adults. Adjusted gaps are controlled for age, gender, and migration/language status. The unadjusted numeracy gap varies from only 18.4 points in Finland to 92.1 points in Belgium, a range of 73.7 points. The adjusted gap is lowest in Finland (15.1 points) and highest in the Slovak Republic (64.8 points), a range of 49.7 points. This is still substantial, yet noticeably smaller than for unadjusted gaps, implying that compositional differences in the above-mentioned individual characteristics account for a good portion of country variation in the skills gap. Table 4 summarizes the multilevel mixed-effects models that explore the impact of external differentiation and vocational orientation on the average numeracy skills of, and numeracy gap between, less-and intermediate-educated adults. All country-level predictors are standardized to have a mean of 0 and standard deviation of 1, so the point estimates can be interpreted as the expected effect of a standard deviation increase in the respective predictor."}, {"section_title": "Numeracy Gaps", "text": ""}, {"section_title": "Multilevel Models", "text": "Models 1, 2, and 3 do not include country-level variables. Model 1 is an empty model with a random intercept. The estimated standard deviations of the random intercept and individual-level residual error (reported under ''variance components'' in the bottom part of Table 4) imply that approximately 8 percent of the variance in numeracy skills among 30-to 44-year-olds with at most upper-secondary education is between countries. This is calculated as (16.2 2 ) / (16.2 2 1 55.2 2 ) ' 0.08.\nModel 2 adds our focal individual-level predictor: having intermediate qualifications . On average, intermediate-educated adults score 51.5 points higher on the numeracy scale than does the reference group of less-educated adults (ISCED 0-2). This corresponds to roughly one competence level or standard deviation on the numeracy scale for the full PIAAC sample. The standard deviation of the random slope term on having intermediate qualifications is considerable at 20.5 points. The standard deviation of the random intercept, which now captures variability in the numeracy skills of less-educated adults (the reference group), is even larger at 25.0 points. the country where they were surveyed. Literacy-related nonrespondents (LRNRs) are included in the analysis. For these respondents, only age and sex are known. Numeracy scores were randomly assigned by drawing from a normal distribution with a mean of 85 and a standard deviation of 35. Other individual-level variables were then imputed (10 imputations) based on age, sex, and the assigned numeracy score. LRNRs are excluded from the analysis of a given imputation if they were imputed to have obtained their highest degree in a foreign country. The number of individual observations therefore differs slightly across the 10 imputations and the reported number is the average. Cross-level interactions can be interpreted as the predicted change in the gap between adults with ISCED 3-4 and ISCED 0-2 associated with a standard deviation increase in the respective country-level predictor.\nMain effects (or effects on the intercept) of country-level predictors are the predicted change in the average skills of adults with ISCED 0-2. Predicted changes for adults with ISCED 3-4 can be obtained by summing a country-level variable's main effect and the cross-level interaction. P values provided only for fixed effects. Degrees of freedom for significance tests are adjusted for multiple imputation according to Barnard and Rubin (1999) . Complete data degrees of freedom for calculating Barnard-Rubin degrees of freedom were approximated as follows: we first estimated degrees of freedom for each imputed data set using Satterthwaite's approximation in the R package lmerTest (Kuznetsova, Brockhoff, and Bojesen 2015) and then averaged across the 10 imputations. Model 3 includes the individual-level controls. Note that the random slopes of the controls exhibit substantial variability (see variance components). This indicates that their effects differ considerably across countries and underlines the importance of allowing them to vary.\nConsistent with Figure 2 , we find that compositional differences with respect to age, gender, and migration/language status partly explain the numeracy gap. The average effect of having an intermediate degree falls to 42.6 points in Model 3. Controlling for compositional differences also helps account for country variation in the skills gap, which is again consistent with Figure 2 . The estimated standard deviation of the effect of having an intermediate degree declines to 13.2 points in Model 3 (see variance components). This remaining variability is still considerable, however. For example, the OECD (2013:247) states that in the full PIAAC sample, an additional year of schooling is associated with a 7-point increase in the literacy score, on average (the scaling of literacy and numeracy scores is broadly similar).\nModels 4 through 7 investigate to what extent the remaining variation reflects country differences in secondary-education systems. Models 4 and 5 include the external differentiation and vocational orientation indices one at a time and can be thought of as bivariate regressions at the country level. Model 6 enters both predictors simultaneously, and Model 7 adds the alternative factors.\nModel 4 shows that external differentiation has only a positive and nearly statistically significant effect on the numeracy gap between less-and intermediate-educated adults. This gap is estimated to increase by 5.7 points (p \\ .1) for every standard deviation increase in the external differentiation index. This is a meaningful effect size, given that the cross-country standard deviation of the numeracy gap was 13.2 points after including individual-level controls (see Model 3 in Table  4 ).\nTurning to Model 5, the main effect of vocational orientation is large and statistically significant (p \\ .05). The average numeracy skills of less-educated adults are estimated to increase by 9.9 points with every standard deviation increase in the vocational orientation index. The coefficient estimate for the cross-level interaction term between vocational orientation and intermediate qualifications is essentially zero (-0.5; not significant). Thus, there is no clear (bivariate) relationship between vocational orientation and the size of the numeracy gap. In combination with the positive and significant main effect, this means the numeracy skills of less-and intermediate-educated adults rise largely in parallel as vocational orientation increases.\nExternal differentiation and vocational orientation are positively correlated (see Table 3 ) and, according to our hypotheses, should have opposite effects on the skills gap and the skills achievement of less-educated adults. One might therefore expect to find clearer and stronger effects when we model both dimensions simultaneously. Model 6 confirms this expectation. The external differentiation index has a larger negative (b = 212.7) and statistically significant effect (p \\ .05) on the average numeracy skills of less-educated adults when vocational orientation is held constant. The coefficient estimate on the cross-level interaction also becomes much larger (b = 13.3) and highly significant (p \\ .01). These estimates indicate that higher levels of external differentiation are associated with larger numeracy gaps between less-and intermediate-educated adults primarily because of lower numeracy skills for the less educated. For intermediate-educated adults, by contrast, the implied effect of a standard deviation increase in the external differentiation index on the numeracy achievement is in fact very close to zero (0.6 = 212.7 1 13.3).\nTurning to vocational orientation in Model 6, we now find the expected negative effect on the skills gap. The numeracy gap is predicted to decline by 9.0 points for every standard deviation increase in the vocational orientation index (p \\ .05). The positive effect of vocational orientation on the mean numeracy skills of less-educated adults is even larger than in Model 5, now estimated at 17.9 points (p \\ .01). The numeracy skills of intermediate-educated adults also increase with the level of vocational orientation, by 8.9 (= 17.9 2 9.0) points per standard deviation. In other words, holding external differentiation constant, both less-and intermediate-educated adults achieve higher numeracy scores when upper-secondary education puts greater emphasis on vocational skills, but the effect is larger for less-educated adults, so the gap narrows.\nThe calculation of explained variance measures for mixed-effects models is a somewhat contentious issue. Raudenbush and Bryk (2002) propose comparing the variance of random effects under a baseline model with the variance under a model that includes level 2 predictors (i.e., the country-level variables in our application). The most obvious baseline model for assessing the explanatory power of external differentiation and vocational orientation in Model 6 is Model 3-which accounts for compositional differences with respect to individual-level controls. The proportion of variance in the numeracy gap that is explained by external differentiation and vocational orientation can then be calculated as follows: in Model 3, the slope of having an intermediate degree has a variance of 174.24 (= 13.2\n2 ), and in Model 6, the remaining variance is 77.44 (= 8. 8 2 ). According to Raudenbush and Bryk, external differentiation and vocational orientation together thus explain 55.6 percent (= 1 -[77.44 / 174 .24]) of the country-level variance in the numeracy gap.\nIn Model 7, we control for three alternative explanatory country-level factors discussed earlier (between-school inequality, training participation gap, and fourth-grade skills inequality). Because our data contain only 18 countries, this regression, which includes five country-level predictors, is probably best considered as an illustrative robustness check rather than definitive evidence. That said, the effects of external differentiation on the skills gap (i.e., the cross-level interaction) and of vocational orientation on the mean skills of lesseducated adults (i.e., the main effect) are quite robust. Although their size declines compared to Model 6, they continue to show substantial effects and remain statistically significant. The remaining two effects-the main effect of external differentiation and the cross-level interaction between vocational orientation and intermediate qualifications-retain the expected signs but are no longer statistically significant in Model 7.\nWe briefly consider the additional factors in Model 7. A first noteworthy result is that we cannot replicate Park and Kyei's (2011) finding that between-school resource inequality widens the numeracy gap between less-and intermediateeducated adults. The cross-level interaction term capturing the effect of between-school inequality on this gap is zero. The main effect of betweenschool inequality is also small and statistically insignificant.\nCountry differences in the training participation gap show substantial effects in Model 7. A standard deviation increase in the trainings differential raises the numeracy gap by 7.8 points (p \\ .1). This is primarily because less-educated adults have much lower numeracy skills in countries with greater disparities in training participation (see the main effect of the training gap: -11.5, p \\ .05). These results are consistent with those of Park and Kyei (2011) but should be viewed with caution. As discussed earlier, the training participation gap is likely endogenous to the skills gap, because greater skills presumably increase the propensity to pursue (and to be offered) further training opportunities.\nThere is some evidence that skills inequalities existing before lower-secondary educationmeasured by fourth-grade skills inequality-are negatively related to the mean numeracy skills of less-educated adults (-5.2, p \\ .1). However, the estimated effect on the skills gap and the implied effect on mean skills of intermediate-educated adults are small and not significant (b = 1.5 and 25.2 1 1.5 = 23.7, respectively)."}, {"section_title": "Predicted Values", "text": "As discussed earlier, the effects of external differentiation and vocational orientation work in opposite directions and partly cancel each other. To get a better sense of the variability implied by the multilevel regressions, Figure 3 displays the predicted numeracy means and gaps for the 18 countries. Predictions are based on the fixed part of Model 6 in Table 4 (i.e., they do not incorporate the estimated random effects) and all individuallevel controls are set at the reference categories. We chose Model 6 because it is not subject to the overspecification and endogeneity problems that may afflict Model 7. The purpose of Figure  3 is not to assess model fit but to visualize the regression results to see if the effects of external differentiation and vocational orientation offset each other to an extent that all or most predicted values fall inside a narrow range.\nFigures 3A, 3B, and 3C plot the predicted values for the mean numeracy skills of less-educated adults, the mean skills of intermediate-educated adults, and the numeracy gap, respectively. Predicted values are plotted against the vocational orientation index. Different levels of external differentiation are represented by the sizes of the circles, with larger circles indicating higher levels of differentiation. The large circles cluster at the higher values of the vocational orientation index, showing a positive relationship between vocational orientation and external differentiation. Table 4 (see  notes to Table 4 for further details on sample restrictions and data analysis). Predictions are based on the fixed part of model 6 (i.e., they do not incorporate the estimated random effects). Individual-level control variables (age, gender, migration/language status) are set at the respective reference categories (30-44; female; native-born, test language is respondent's first language). Figure 3B shows a nearly perfect positive linear relationship between vocational orientation and the predicted numeracy skills of intermediate-educated adults. This is a visual representation of the finding that vocational orientation is associated with higher numeracy skills for intermediate-educated adults, whereas external differentiation has practically no effect.\nFinally, Figure 3C shows the predicted numeracy gaps. For quite a few countries, the predicted gaps fall into a relatively narrow range, from approximately 45 to 55 points. This group includes countries with low levels of external differentiation and vocational orientation (Canada and the United States) as well as countries that score high on both dimensions (e.g., Austria and the Netherlands). Yet, 8 of the 18 countries fall outside this range. In the Scandinavian countries, the United Kingdom, and to a lesser extent, Spain and Italy, the predicted numeracy gap is much lower. Again, this reflects the fact that these countries combine relatively high levels of vocational orientation with low external differentiation, which improves the skills achievement of lesseducated adults (see Figure 3A) . On the other end of the spectrum, Germany has a very large predicted numeracy gap. The ordering of the observed skill means and gaps in Figures "}, {"section_title": "ROBUSTNESS CHECKS", "text": "We conducted several analyses to assess the robustness of the results in Table 4 . We focus on the effects of the external differentiation and vocational orientation indices in our preferred specification, Model 6. Section C in the online appendix provides the exact results, including those for the other specifications in Table 4.   9 Several robustness checks explore the effect of our choices concerning literacy-related nonresponse. First, we obtained another set of imputations assuming a mean numeracy score of 135 instead of 85 for LRNRs (see Section C.1 in the online appendix). This value likely constitutes an upper bound on the numeracy skills of this group. 10 The effects of external differentiation and vocational orientation are qualitatively similar to those presented in Table 4 . Point estimates are somewhat smaller in absolute terms but still statistically significant.\nAs another check, we excluded the four countries with the highest shares of LRNRs (Belgium, Norway, the Netherlands, and the United States; see Section C.2 in the online appendix). In this analysis, based on only 14 countries, the main and cross-level interaction effects of the external differentiation index are somewhat smaller in absolute terms but remain statistically significant at the 10 and 5 percent levels, respectively. The main and cross-level interaction effects of the vocational orientation index retain substantial effect sizes (11.4 and 27.3, respectively) but are no longer statistically significant. However, the smaller country sample results in larger standard errors and fewer degrees of freedom, which raise critical values for hypothesis tests.\nThird, we omitted all (native-and foreignborn) respondents who were not tested in their first language, because country differences in the size of this group appear to be an important source of differences in the prevalence of LRNRs (see Table  2 ). In this analysis, the main effects and crosslevel interactions are all statistically significant at the 1 percent level or better (see Section C.3 in the online appendix). Moreover, absolute effect sizes are larger than in Table 4 . Taken together, these three checks suggest our results are not strongly contingent on the way we treated LRNRs.\nAnother potential concern is that most of our country-level variables are measured when most of the cohorts had already left secondary education. To address this issue, we reestimated the multilevel models on 25-to 34-year-olds (i.e., birth cohorts 1977 to 1986; see Section C.4 in the online appendix). For these cohorts, our education system variables, which mostly refer to the late 1990s and early 2000s, much better match the time of secondary-education attendance (between the late 1980s and early 2000s). In this analysis, we control for being younger than age 30 and in full-time education, because a substantial proportion of 25-to 29-year-olds have not yet left the education system. The main and cross-level interaction effects are all statistically significant at the 5 percent level or better, and absolute effect sizes are larger than in Table 4 .\nTo examine potential outlier issues, we reestimated Model 6 in Table 4 with one country omitted at a time (for a graphical summary, see Section C.5 in the online appendix). The results are generally reassuring. The only truly noteworthy change occurs when the United States is removed from the sample. In this case, the main effect of vocational orientation (i.e., on less-educated adults' mean skills) declines from 17.9 to 11.6 points per standard deviation increase in the vocational orientation index.\nFinally, we reestimated the multilevel regressions with literacy instead of numeracy skills as the dependent variable (see Section C.6 in the online appendix). In these regressions, the main and cross-level interaction effects of external differentiation and vocational orientation are somewhat smaller in absolute size, but they remain substantial and statistically significant at the 5 percent level or better."}, {"section_title": "DISCUSSION", "text": "Overall, the multilevel models (and robustness checks) confirm Hypothesis 1: higher degrees of external differentiation are associated with larger skills gaps between less-and intermediateeducated adults. Results also support Hypothesis 3: higher degrees of vocational orientation of upper-secondary education are associated with smaller skills gaps.\nAs for the mean skills achievement of the less educated, results show that greater external differentiation goes hand in hand with lower mean skills for less-educated adults (Hypothesis 2). We discussed two plausible explanations for this pattern (i.e., selection and ability grouping effects), which we cannot disentangle with the PIAAC data. With respect to vocational orientation, we took up Soskice's (1994) argument that vocational tracks in upper-secondary education, in combination with occupational labor markets, create incentives for low-and medium-ability students to work hard in school. This mechanism should affect all students, even students who do not complete uppersecondary education. Consistent with this account, we find that vocational orientation is positively related to the mean skills of less-educated adults (Hypothesis 4).\nWe formulated two competing expectations concerning the relationship between vocational orientation and the mean skills of intermediateeducated adults: higher means due to greater learning effort (Hypothesis 5a) versus lower means due to less learning time available for acquiring general skills (Hypothesis 5b). Our results indicate that overall, mean skills of the intermediate group increase with vocational orientation (i.e., more support for Hypothesis 5a)-suggesting that the incentive explanation trumps the learning time explanation. They can, of course, both be at work, which would explain why the positive effect of vocational orientation on mean skills is weaker for intermediate than for less-educated adults (the intermediate group attended the vocational programs where the learning-time mechanism should play out).\nThese relationships showed or became much stronger only when the external differentiation and vocational orientation indices were both included in the regression, that is, when the respective other factor was held constant. This is because external differentiation and vocational orientation are positively related but work in opposite directions and therefore partly cancel each other out. Our regression estimates show meaningful cross-country variation in the numeracy achievement of the two groups and in the gap between them.\nA major advantage of PIAAC data is that they provide skills measures comparable across countries; an obvious limitation is their cross-sectional nature, which makes it impossible to detect causal effects and to disentangle the possible mechanisms discussed earlier (e.g., the learning-time argument). We would encourage researchers to investigate these mechanisms more directly. Longitudinal data starting at the beginning of lowersecondary education and following individuals until the end of their main educational biographies would be a valuable resource for this endeavor. Such data are scarce, however, and rarely comparable across countries. Single-country studies or quasi-cohort designs that combine data from student assessments with PIAAC might be more feasible options for the near future.\nConcerning potential complementary explanations, we found that smaller inequalities in training participation between less-and intermediateeducated adults are associated with smaller skills gaps between the two groups, primarily because they go together with higher mean skills for the less educated. However, as noted repeatedly, it is not clear to what extent this relationship reflects a causal impact of inequalities in training participation, because problems of reverse causality loom large. Again, only longitudinal analyses could shed light on this issue. In contrast to Park and Kyei (2011), we did not find an effect of between-school resource inequality on the lower skills gap. Finally, we saw some evidence that adults' skills may partly reflect the persistent effects of skills inequalities during early childhood (generated in primary education or outside the education system). In our regression model, skills inequalities in fourth grade (i.e., at the end of primary school) were negatively related to lesseducated adults' skills achievements."}, {"section_title": "CONCLUSIONS", "text": "This is the first empirical study to investigate the impact of external differentiation and vocational orientation in secondary education on country differences in the mean skills achievement of, and skills gaps between, adults with low and intermediate levels of formal educational qualifications. We analyzed mean skills of, and skills gaps between, adults with different educational degrees, which is not possible with assessments that sample students at ages 15 and younger. Given strong differences in the stratification of upper-secondary education systems, student assessments typically occur too early to discover the full impact of different education systems (Pfeffer 2015) .\nOur main finding is that country differences in external differentiation and vocational orientation account for more than half of the country variation in the skills of less-and intermediate-educated adults (ages 30 to 44) and that they have distinct and partly opposite effects. Less-educated workers achieve lower general skills means in externally differentiated systems, which amplify skills gaps between less-and intermediate-educated adults. Vocational orientation in upper-secondary education somewhat mitigates the negative impact of external differentiation with respect to general skills. However, vocational orientation, almost by definition, should produce stronger differentials in terms of vocational skills-something we could not examine because PIAAC did not assess vocational skills.\nOur findings are important for research on educational inequality. We find some support for the often-stated assumption that external differentiation (i.e., tracking) in secondary education increases skills inequalities by educational attainment. This result corroborates the view that in countries with a high degree of external differentiation, educational certificates send a stronger signal about an individual's actual level of general skills. This is one reason why formal qualifications play a larger role for success on the labor market in these countries (see Andersen and van de Werfhorst 2010; Gesthuizen et al. 2011; Levels et al. 2014; Solga 2008) .\nMoreover, our findings can be read as indirect evidence that vocational orientation of uppersecondary education increases the learning efforts of both less-and intermediate-educated individuals-resulting, ceteris paribus, in higher general skills achievement of both groups and in lower skills differentials between them (Soskice 1994) . In many countries, this effect of vocational orientation is neutralized by the adverse effects of external differentiation on the skills achievement of the less educated. Countries with the strongest vocational orientation also tend to track very early (i.e., Austria, the Czech Republic, Germany, the Netherlands, and the Slovak Republic). However, some countries, the Scandinavian ones in particular, combine a strong vocational orientation in upper-secondary education with little external differentiation in lower-secondary education. Our analysis suggests we should find the highest skills achievement among the less educated, and also the smallest skills gaps, in these countries. Descriptive evidence is consistent with this prediction (see Figures 1 and 2) .\nIn summary, secondary-education systems play an important role for individual development of key information-processing skills in the lower part of the educational distribution and thus for economic success and social participation in society."}, {"section_title": "RESEARCH ETHICS", "text": "Our research project was approved by the institute management and the data protection unit of the WZB Berlin Social Science Center. Our analyses only use publicly available secondary data that neither include personal identifiers nor allow for deductive disclosure of respondents' identities. All PIAAC participants gave their informed consent."}]