[{"section_title": "Introduction", "text": "The need for researchers to study the enrollment of students into Science, Technology, Engineering, and Mathematics (STEM) majors is predicated on two fundamental aspects: the individual benefits of such a degree and the collective need for the degree. This study aims to add to the growing body of research regarding the gender gap in STEM, specifically in computer science (technology), engineering, and mathematics (TEM). The ability of the country to remain competitive in specialized job markets, such as TEM, requires that policy makers understand the factors that lead students into a STEM field, to better meet the demands of a changing job market (Chen, 2013;Stater, 2011). In order to meet the growing demand of TEM related careers tapping into the under-represented groups of women and racial minorities becomes paramount. It is clear that secondary schools foster the development of student academic interest and subsequent career choices, therefore it is prudent to analyze the influence the secondary school environment plays. The primary goal of the paper is to identify high school level factors that are viable indicators of student major choice into Technology, Engineering, and Mathematics (TEM) utilizing the Social Cognitive Career theoretical framework. An additional goal is to identify if any gender difference exists in the factors that lead to a TEM major. A multitude of studies have been dedicated to illuminating gender differences, with special focus on educational differences as they relate to the gender gap in STEM occupations, college majors, and high school interests (Blickenstaff, 2005;Ceci & Williams, 2010;Ceci & Williams, 2011;Riegle-Crumb, King, Grodsky, & Muller, 2012;Sax et al., 2015). Due to the growing need of STEM occupations anticipated for the coming years, policy makers must be clear on how these differences manifest themselves in STEM disciplines, what the reasons are for such a gender disparity in TEM, and why does it become critical to decrease the gender gap in TEM. One significant reason for reducing the gender gap is the potential economic benefit. The sustainable financial future of TEM careers could provide a viable path to economic mobility in under-represented groups. The statistics surrounding female involvement in STEM are somewhat disappointing. Though females are conferred degrees at a near equal proportion to males, there is a large discrepancy the matriculation of STEM degrees (Mann & DiPrete, 2013). Only 33% of females intend to major in STEM, 12% less than males and 3 times less likely to enter the majors (Moakler & Kim, 2014;National Science Board [NSB], 2014). The explanation of the disproportionate enrollment in TEM fields by women was produced by Blickenstaff (2005). It was suggested that 9 possible reasons were influencing women interest in TEM, of the 9 one was attributed to biological differences and the other 8 were categorized as cultural exclusion of women in science. With the growing need of STEM professionals in the coming years it becomes critical to understand the reasons behind the gender disparity in TEM and make efforts to decrease it. The gender differences become apparent in academic indicators; females score lower on both math and science, 4% and 6% respectively (NEAP, 2009;NSB, 2014). More troubling is that the difference goes beyond achievement and enters self-concept. When females have similar math achievement their self-concept scores lower than male students, thus females are less likely to enroll in upper level math (Correll, 2001;Mann & DiPrete, 2013;Nagy et al., 2006;Sax et al., 2015;Wang, Degol, & Ye, 2015). Understanding these differences is even more vital because subsequent major choice is thought to be predicated on achievement, self-efficacy, and course selection (Lent, Brown, & Hackett, 2004;Wang, 2012). There are multiple needs for research specifically into TEM. First, the greatest need for individuals is in TEM fields rather than STEM. TEM offers substantial income and professional opportunities compared to other STEM majors (NSB, 2014). This is made apparent by the lower unemployment rate and higher salaries of individuals when juxtaposed to lab-based sciences. Furthermore, the lab-based sciences have the lowest percentage of graduates employed in occupations related to their majors indicating that a surplus may exist in lab-sciences (Xue & Larson, 2015; U.S. Census Bureau, 2014). Second, there is a more significant gender gap in TEM. Though women have continuously increased enrollment in STEM majors and occupations the growth is seemingly relegated to the biological science. Though women make up 24% of STEM professionals they are grossly under-represented in engineering (14%) and computer science/mathematics (27%) (Beede et al., 2011). Female students tend to place greater focus on social aspects rather than the material, this difference in value helps to explain why women preferentially select biology majors over the more object-oriented engineering and computer science majors (Ceci & Williams, 2010;Ceci & Williams, 2011;Wang, Degol, & Ye, 2015). In fact, males and females show no statistical difference between attitudes toward biology, however the same cannot be said about technology, math, and engineering. Men report a more positive attitude towards TEM fields and as a result, continue to dominate engineering and computer sciences. This has continued to the point that, though the participation of women in STEM has grown, there has been a decrease over the last several years in choosing to enter TEM majors (Christensen et al., 2014;Maltese & Tai, 2010;Riegle-Crumb, King, Grodsky, & Muller, 2012). This trend continues into the workforce where women make up 33% of the STEM professionals (NSF, 2012). Women workers are considerably under-represented in engineering (15%) and computer science/mathematics (25%). Where as in laboratory sciences women make up 48% and physical sciences 31%. The 2 categories that have seen the greatest change in participation since 1993 are a 5% reduction of females in math and computer science and a 14% increase in biological sciences (NSF, 2012). It is this that resonates with researchers and policymakers because the majority of job growth is expected to be in the technology, engineering, and computer science areas. Finally, the focus of this study on TEM is also determined by the nature of the data set used. As discussed later, the 2002 ELS surveyed math teachers, making the data more conducive to study TEM. Based on a conceptual understanding of the research questions and a review of the literature, Social Cognitive Career Theory (SCCT) provides a logical theoretical framework in which to create the model (Carrico & Tendhar, 2012;Lee, 2013;Lent et al., 2008;Maltese & Tai, 2010;Moakler & Kim, 2014;Sax et al., 2015;Sheu et al., 2010;Wang, 2012). Developed by Lent, Brown, and Hackett (1994) as an extension of Bandura's Social Cognitive Career theory, SCCT was designed to explain the career and academic choices made by individuals. By incorporating self-efficacy, outcome expectation, interests, and choice goals SCCT is a comprehensive theory that provides a conceptually salient model that allows for the incorporation of the most critical constructs in the development of vocation and academic interests (Lent, Brown, & Hackett, 1994). In a review of the literature related to college major choice, SCCT is the dominant theoretical framework utilized by researchers (Carrico & Tendhar, 2012;Lee, 2013;Lent et al., 2008;Maltese & Tai, 2010;Moakler & Kim, 2014;Sax et al., 2015;Sheu et al., 2010;Wang, 2013 of this work SCCT has been shown to be effective in describing gender differences as well as in longitudinal data sets (Lent et al., 2008). Another advantage of SCCT is that it allows the researcher to investigate specific actions of individuals, i.e., the selection of a specific major (Carrico & Tendhar, 2012;Lent et al., 2008). The ability of SCCT to elucidate the characteristics that influence college major selection and the flexibility of the inclusion of variables makes it a prudent choice for a theoretical framework. The foundation of SCCT is how self-efficacy, outcome expectation, interests, and choice goals influence both vocational and academic choice. It is customary for researchers to include supporting variables of supports and barriers, learning experiences, and intention of goal fulfillment in the model as well (Carrico & Tendhar, 2012;Garriott, Flores, & Martens, 2013;Lent et al., 2008;Sax et al., 2015;Sheu et al., 2010;Wang, 2013). Self-efficacy can be regarded as an individual's personal belief about their ability to complete tasks related to achieving a particular level of success. This is related to maintaining actions to attain the goal through adversity. An outcome expectation is understood to be the perceptions that one has about the consequences of engaging in and completing an action. Social or cultural pressures placed on a woman in science could influence outcome expectation. Interests can be thought of as a measure of an individual's enjoyment of a particular activity. Goals are positive future outcomes that individuals have undertaken legitimate steps to attaining and committed resources to the successful fulfillment of them (Carrico & Tendhar, 2012;Lent, Brown, & Hackett, 1994)."}, {"section_title": "Research Questions", "text": "SCCT must be confirmed as a viable framework to study the factors associated with student entrance into TEM. Additionally, there is a need to improve the participation of under-represented groups in STEM fields; women attack problems in ways that are substantially different than men. Low female participation in TEM reduces the human capital the result of which can be detrimental to the technological and scientific growth of the nation (Sax et al., 2015). Therefore, this study will address: 1) How are students impacted by academic experiences, their own self-efficacious beliefs of math and science, and the value of such a degree relate to their entrance into a TEM major? 2) Do these relationships vary across gender?"}, {"section_title": "Method", "text": "Data was acquired from the Education Longitudinal Study of 2002 (ELS, 2002). Base year data from 2002 was collected from high school sophomores with subsequent follow-up surveys conducted in 2004, 2005, 2006, 2012, and 2013. These surveys were administered to students, parents, teachers, and major choice. In addition, the focus on math teachers and attributes was congruent with the point of this study. The original ELS data set consisted of 16197 individuals (47.2% male, 47.6% female), of which approximately 6500 reported attending post-secondary education in the 2006 follow-up. Of these respondents, only 10% reported enrollment in a TEM major. Further cleaning of the data was accomplished using case wise deletion on the utilized variables bringing the total N to 3254, with 10% TEM (44% male, 66% female). Before conducting the SEM analysis additional data management was required to bring the two groups into a more balanced data set. Matching the TEM majors (N = 327) to the non-TEM majors (N = 2927) using propensity scores can provide an effective way to balance the data and continue with the analysis. This method is further validated by Parsons (2004) who explains that, in order to detect differences between experimental and control groups there must be a reduction in the treatment selection bias. To maximize the number of TEM majors, propensity scores were generated via SAS (Parson, 2004;Relyea, 2016). All TEM cases were retained and 473 non-TEM majors with the highest propensity scores were retained as matches. The final total was N = 709, 79% male and 236 (33%) TEM majors. Outliers were removed using from the 709 individuals using Mahalonibis distance (χ 2 p<.001) for a final N=690."}, {"section_title": "Variables", "text": "2.1.1 Math Self-Efficacy Self-efficacy, according to Lent, Brown, and Hackett (1994) is one of the pillars of SCCT and primary indicator of interest in academic and professional goals. Subject specific self-efficacy is an essential predictor of STEM interest and major choice; many more studies that could be named that implement SCCT include it as a predictor (Engburg & Wolniak, 2013;Moakler & Kim, 2013;Sax et al., 2015;Wang, 2012). Following the guidelines of SCCT self-efficacy has a path to outcome expectations, interest, intent, and major selection (Lent, Brown, & Hackett, 1994). For this latent variable 6 factors were included. One continuous measure of self-efficacy score from 10th grade. In addition, five measures of 12th grade attitudes toward math were also included. These measures were rated on a 4-point Likert scale and were comprised of statements such as, can do excellent job on math assignments or can understand difficult math class."}, {"section_title": "Outcome Expectations", "text": "An outcome expectation as a latent variable has a direct path to interest, intention, and major choice (Lent, Brown, & Hackett, 1994). The value of intrinsic and extrinsic rewards along with expectation of graduate degree are factors that are consistent with other studies to load onto outcome expectations (Mann & Diprete, 2013). Three measures taken in the 2006 senior follow-up were used for the latent variable outcome expectations. The questions were based on a 3-point scale from not important (1) to very important (3). These survey items inquired about the relative importance of success in jobs, the importance of making a lot of money, and the importance placed on family and children."}, {"section_title": "Learning Experience", "text": "Math and science achievement in high school is a strong predictor of interest in STEM and the later choice of major in college (Engburg & Wolniak, 2013;Maltese & Tai, 2010;Riegle-Crumb, King, Grodsky, & Muller, 2012;Wang, 2012). Achievement is measured at 10th grade and 12th grade using the ELS: 2002 data. The third measure, teacher recommendation for advanced courses in mathematics (1-3 not recommend to highly)."}, {"section_title": "Interest", "text": "Previous studies suggest that course selection should be a predictor of interest in STEM. Students who enroll in upper level math and science courses as upper classmen in high school are more likely to have a greater interest in STEM and thus choose a STEM major (Correll, 2001;Engburg & Wolniak, 2013;Lee, 2013;Maltese & Tai, 2010;Mann & Diprete, 2013;Riegle-Crumb, King, Grodsky, & Muller, 2012;Wang, 2012). Two variables were created to quantify the number of math and science electives were taken in high school. Upper level math course electives were number 0-4 to include courses trigonometry, pre-calculus, calculus, and business math. The science courses included were only physics and technology courses numbered 0-2. Only TEM science courses were included due to the scope of this study."}, {"section_title": "Supports and Barriers", "text": "The use of SES and the highest level of parent degree have both been used as supports and barriers in previous SEM studies (Garriot, Flores, & Martens, 2013;Sax et al., 2015;Wang, 2012). Loading the supports and barriers onto major choice is congruent with literature on STEM major choice within the SCCT framework. Three variables were loaded onto supports and barriers. A measure of SES, (BYSES2QU) which divided students into quartiles 1-4. The parents highest level of education (BYPARED) recorded as 1-8, did not graduate high school to doctorate respectively. Also included was the number of academic risk factors, this variable was recoded 1-6 in order to reflect 1 having 5 or more risk factors and 6 having 0 risk factors."}, {"section_title": "Intent", "text": "Intent is simply a measure of an individual's perspective major. This was coded 1 = TEM major and 0=non-TEM major."}, {"section_title": "Dependent Variable", "text": "A dichotomous variable was recorded as 0 = Non-TEM and 1 = TEM major. Lab-based sciences such as chemistry or biology were excluded from the study variable (Table 1).  "}, {"section_title": "Result", "text": "Four models were ran and model fit was assessed using Kline's (2011) guidelines. The measurement model suggests a strong fit with a RMSEA = 0.027, with a 90% confidence interval upper bound below 0.08 and CFI = 0.99 (see Table 2). All factor loadings were above 0.24 (Table 1). Three SEM analyses were ran, one assessing whole group and one each for males and females. Fit indices are provided in   (Kline, 2011). All path coefficients were significant (p<0.05) except learning experience to self-efficacy and to outcome expectation as well as self-efficacy to interest. The model explained 26% of the variance in Major. The model was then applied to only the males in the sample (TEM = 33% of 548). The model fit the sample well with RMSEA = 0.033 (90% CI = 0.024; 0.041) and a CFI = 0.99. The path coefficients had the same significance as the whole group. The variance explained in major saw a 11% increase to 37%. The same model was then ran using only females from the sample (TEM = 33% of 143). Again, the model fit was very strong, RMSEA = 0.018 (90% CI = 0.0; 0.046) and the CFI = 0.99. Learning experience showed a significant path to outcome expectation, which was not seen in the other models. The variance explained in major was reduced to 30%.  "}, {"section_title": "Discussion", "text": "This paper continues to add to the growing body of literature dedicated to illuminating the influence of the high school experience on the decision to enter into a TEM major as well as identifying variables associated with the gender gap in TEM majors. Through the strong model fit of the SEM analysis in both the whole group and male group SCCT is clearly an adequate choice to identify such variables in predicting a college major choice. The female group had strong model fit but was not significant, which was likely due to the small sample size of the group. This paper further supports the use of SCCT to understand the factors that lead students to choosing a specific major. Oddly, the paths from learning experience were largely nonsignificant as was the paths from self-efficacy to interest, this could be due to sample composition and the relative homogeneity of students. It is not unprecedented to have small values from Outcome Expectations as small but significant paths from outcome expectation to interest have been reported in other studies (Garriott, Flores, & Martens, 2013). It does not come as a surprise to see academic achievement, outcome expectations, or self-efficacy as poor differentiators among college students. Many college students regardless of the major they choose will perform well in high school. The 2 largest and significant paths for the group were interest to intent (.103) and intent to major (.51) ( Table 5). This suggests that course selection and intent to major are 2 of the more important and strong predictors of a student choosing to major in TEM.  Though the data set used, ELS 2002, is a large national data set there were several issues that presented themselves to the research questions. One such problem was that of the sample size. A small number of students choose to enroll in a TEM major and created an unbalanced data set. In addition, males were over-represented in the data set making comparison between genders difficult. This presented a secondary problem in that the number of females in the study is low for SEM. Adding more individuals to the study and increasing female representation could alleviate many issues. Additionally, a more up to date sample would benefit the study, the implemented data set is dated and technology has seen monumental changes in 15 years. SCCT is the dominant framework in determining student major choice, however, it is not alone. "}]