[{"section_title": "Introduction", "text": "River engineering designs in the Mississippi River Delta have disrupted riverine sediment deposition, which normally compensates for relative sea level rise (sum of subsidence and global mean sea level (GMSL) rise) (Bentley et al., 2016;Boesch et al., 1994;Edmonds, 2012a;Louisiana Coastal Wetlands Conservation and Restoration Task Force, 1993;Paola et al., 2011;Twilley et al., 2016;Twilley et al., 2008). This disruption is negatively impacting stability of the delta landscape and threatening nationally important industries (Day et al., 2007;Syvitski et al., 2009;Vörösmarty et al., 2009). Industries at risk include a fishery that produces the largest seafood harvest in the contiguous United States, a petroleum industry that produces the most crude oil and the second most natural gas in the United States, and a shipping industry that has made Louisiana the top export state in the nation (Barnes et al., 2017;Coastal Protection and Restoration Authority, 2017;Greater New Orleans Inc., 2015;Louisiana Seafood Industry, 2017). More than 4,877 km 2 of coastal Louisiana wetlands along with most of the barrier islands have become submerged and converted to water from 1932 to 2010 due to, among other factors, Figure 1. 2015 and 2016 satellite images: a) major waterways and cities of southeast Louisiana, b) major waterways and cities of southw est Louisiana, c) Hydrologic unit code 6 (HUC6) coastal basins (purple), location of 40% L:W isopleths for 1932 (green), 1973 (yellow) and 2010 (orange), and data collection locations along the Mississippi and Atchafalaya Rivers. Gray line indicates location of the Intracoastal waterway (ICWW) which is the northern boundary of the study area. changes in riverine sediment deposition rates and the highest measured rate of relative sea-level rise in the contiguous United States with 9.2 mm/year measured by a NOAA tide gauge in Grand Isle, LA 19472006 (Fig. 1a) (Batker et al., 2010;Bird, 2010;Couvillion et al., 2011;National Oceanic and Atmospheric Administration, 2018;Nienhuis et al., 2017). In addition, coastal Louisiana is susceptible to a high frequency of hurricane landfalls (Chen et al., 2008;Keim, 2012, 2014). If the current rate of wetland loss continues or accelerates with the predicted increase in the rate of GMSL rise (Jevrejeva et al., 2016;Parris et al., 2012;Stocker et al., 2013;Sweet et al., 2017), the fishing, petroleum and shipping industries will be adversely impacted, and flood risks in coastal communities will further increase. The aim of this analysis is to quantify the change in storm surge characteristics, such as surge height and inundation time, across coastal Louisiana from 1930 to 2010 and to estimate if flood risks change in coastal basins with different rates of riverine sediment inputs. Because the impact of historical river management decisions has occurred on the coastal basin scale (Fig. 1c), hydrologic unit code 6 (HUC6) coastal basins are utilized to quantify the historical change in storm surge heights and inundation time from 1930 to 2010. Hydrologic unit codes define the entire or a partial area of a surface drainage basin with lower HUC numbers describing larger basins and higher HUC numbers describing smaller sub-watersheds. Higher HUC numbered sub-watersheds fit within the lower HUC numbered larger basins (U.S. Geological Survey, 2017a). HUC6 coastal basins (e.g. AtchafalayaVermilion versus Terrebonne and Barataria) are specifically treated as experimental units to quantify the rate of Gulf of Mexico (GOM) migration inland where riverine sediment input remains (sedimentabundant) and where riverine sediment input is substantially reduced (sedimentstarved). HUC12 sub-watersheds, smaller watersheds that fit within the HUC6 coastal basins, are also utilized to provide a range of surge height and inundation time values within each HUC6 coastal basin. Hereafter, HUC6 coastal basins are referred to only as \"coastal basins\" while HUC12 subwatersheds are referred to only as \"sub-watersheds\". Mississippi River flood control projects implemented over the past century allow the ability to contrast the evolution of storm surge in sediment-starved coastal basins versus an adjacent sediment-abundant coastal basin (Boesch et al., 1994;Twilley et al., 2008Twilley et al., , 2016. For example, the Lafourche Delta formed approximately 1 000 to 300 years ago via Mississippi River sediment discharged into Bayou Lafourche until Bayou Lafourche was dammed at Donaldsonville in 1906 (Morgan, 1979) (Fig. 1a,c). During a 1851 flood, Mississippi River discharge into Bayou Lafourche reached 340 m 3 /s allowing both water and sediment to overflow the banks of Bayou Lafourche and nourish adjacent wetlands in the Terrebonne and Barataria coastal basins (Ellet, 1853). Modern Bayou Lafourche discharge is approximately 28 m 3 /s, which substantially limits nourishment of adjacent wetlands (Coastal Environments Inc., 1997). In contrast, annual Mississippi River discharge (excluding Red River) diverted to the Atchafalaya increased from approximately 2.5% in 1880 to 13% in 1930 to nearly 30% in 1952 (Fisk, 1952). Suspended sediment load in the lower Mississippi River upstream of Old River pre1963 was greater than 400 megatons (million metric tons) (Blum and Roberts, 2009;Keown et al., 1986). Red River suspended sediment load pre-1963 is estimated 35.1 MT/year and is assumed to flow directly to the Atchafalaya River. Therefore, estimated 1930 suspended sediment load at Simmesport (8 km downstream of Old River on the Atchafalaya) is 87.1 MT/year (Fig. 1c). The U.S. Army Corps of Engineers completed the Old River Control Structure in 1963 which controlled Mississippi and Red River discharge to the Atchafalaya at 30% resulting in the formation of Wax Lake and Atchafalaya Deltas (Edmonds, 2012b;Reuss, 2004;Wellner et al., 2005;Wells et al., 1984). Dams and other river improvements were also implemented along Mississippi River tributaries post-1963 which caused a gradual decline in Mississippi suspended sediment loads (Bentley et al., 2016). Keown et al. (1986) established the suspended sediment load 1970-1978 at Simmesport 93.9 MT/year. Blum and Roberts (2009) measured suspended sediment loads at Simmesport of 86 MT/year (1977) and 49 MT/year (2006) while Mize et al. (2018) measured suspended sediment loads at Melville (48 km south of Old River) of 39 MT/year (2005) and 33 MT/year (2015). The 2015 recording at Melville continues to be substantially greater than the negligible Mississippi River suspended sediment load entering Bayou Lafourche. In the present analysis, a series of hydrodynamic storm surge model meshes are developed and feature comparable representations of historical Louisiana coastal landscapes to examine the effects of negligible riverine sediment deposition in the Terrebonne and Barataria coastal basins and substantial sediment deposition in the AtchafalayaVermilion coastal basin (Fig. 1a,c). Constructing storm surge model meshes featuring historical coastal landscapes circa 1930-2010 with comparable topo-bathymetric detail is not possible as contemporary data collection methods, such as lidar, has been used extensively for topographic mapping since only the early 2000s. Therefore, the method developed by Siverd et al. (2018) is employed to simplify the modern (2010) Louisiana coastal landscape, as well as to construct comparable, historical landscapes. This method entails application of land to water (L:W) isopleths which are defined as lines on a map connecting points of constant value of the land to water ratio (Gagliano et al., 1970;Siverd et al., 2018;Twilley et al., 2016). A simplified coastal landscape featuring a L:W isopleth permutation of 99%-90%-40%-1% with coastal zones labeled high (99%-90%), intermediate (90%-40%) and submersed (40%-1%) was found to most closely reproduce the detailed coastal Louisiana landscape (Siverd et al., 2018). The goal of the present analysis is to develop storm surge model meshes featuring historical landscapes (i.e. 1930, 1970 and 2010) via the same method established by Siverd et al. (2018) and to quantify changes in storm surge characteristics over this 80-year period of change in riverine sediment deposition. A secondary goal is to conduct sensitivity analyses to find the largest contributor to increased inland surge heights (L:W isopleth migration, addition of deep navigation waterways or GMSL rise). Results include the quantification of changes in storm surge characteristics (e.g. maximum of maximums water surface elevations and inundation time) within coastal basins and smaller sub-watersheds. These two surge characteristics are then associated with change in historical riverine sediment input rates and subsequent wetland loss/gain across coastal basins."}, {"section_title": "Study area", "text": "The study area is bound by Sabine Lake (west), Pearl River (east), Intracoastal Waterway (ICWW) (north) and the Gulf of Mexico (GOM) (south) ( Fig. 1a and b). This region consists of low-lying fragmented wetlands, interior lakes and bays, and man-made navigation waterways with various depths ( Fig.  1; Table 1). Two central features of the study area include the Mississippi River Delta Plain (southeast) and Chenier Plain (southwest) separated by the Wax Lake-Atchafalaya Deltas. Within these two province scale landscape features are the sedimentabundant Atchafalaya-Vermilion coastal basin (Chenier Plain) and the sediment-starved Terrebonne and Barataria coastal basins (Mississippi River Delta Plain) ( Fig. 1c). Relatively solid, unfragmented, wetlands comprise the Atchafalaya-Vermilion coastal basin while highly fragmented wetlands exist in the Terrebonne and Barataria coastal basins."}, {"section_title": "Louisiana coastal landscape alterations 1930-2010", "text": "To accommodate both onshore and offshore oil and natural gas exploitation, since 1901 approximately 16,000 km of canals were excavated throughout the Louisiana coastal landscape with a majority constructed since 1930 (Hayes and Kennedy, 1903;Turner and  In addition to the numerous oilfield canals and navigation waterways, the Mississippi River Delta has been altered by the construction of levees and deterioration of barrier islands since the 1930s. During this 80-year period, levees southwest of the Mississippi River have been constructed to protect cities such as Houma. Mississippi River levees have been further raised to protect Baton Rouge and New Orleans (Bentley et al., 2016;Coastal Protection and Restoration Authority, 2017;Galloway et al., 2009). From 1930 to 2010, substantial barrier island movement and disappearance also occurred. This is evident with, for example, the reduction in area and migration of Isles Dernieres north ( Fig. 2a) as well as the reduction in and migration of Timbalier Island northwest (Fig. 2b). Isles Dernieres decreased in area from approximately 5.63 km 2 (1930) to 3.77 km 2 (1970) to 3.45 km 2 (2015). Timbalier Island decreased in area from approximately 10.90 km 2 (1930) to 10.11 km 2 (1970) to 4.88 km 2 (2015) (U.S. Geological Survey, 2017b)."}, {"section_title": "Methods", "text": ""}, {"section_title": "Historical hydrodynamic model development", "text": "An approach to historical hydrodynamic model mesh development was established to quantify changes in coastal storm surge due to changes in riverine inputs and the Louisiana coastal landscape. An experimental mesh serves as a basis for modification to construct storm surge model meshes for 1930, 1970 and 2010 ( Fig. 3, Fig. 4), yields meshes with the same topology (mesh configuration) ( Fig. 5) and thus facilitates comparison of simulation results. The storm surge model mesh chosen for this analysis is the validated Louisiana Coastal Protection and Restoration Authority (CPRA) 2017 Coastal Master Plan storm surge model mesh (Bunya et al., 2010;Cobell et al., 2013;Dietrich et al., 2011aDietrich et al., , 2011bFischbach et al., 2012Fischbach et al., , 2017Roberts and Cobell, 2017;Westerink et al., 2008). It features approximately 1.4 million nodes and 2.7 million elements. It describes the western north Atlantic Ocean west of the 60°W meridian, Caribbean Sea, and Gulf of Mexico (GOM). The CPRA2017 mesh focuses on the northern GOM with 93% of nodes between Mobile Bay, Alabama and the Bolivar Peninsula, Texas and includes the most recent elevation data of south Louisiana (Cobell et al., 2013;Fischbach et al., 2012Fischbach et al., , 2017. Wind, pressure and wave forcings are included in this surge analysis. Because a micro-tidal regime exists along the Louisiana coast and Mississippi River discharge during hurricanes is deemed to not substantially impact surge results, tides and riverine discharges are not included (National Oceanic and Atmospheric Administration, 2018). The CPRA2017 mesh also includes man-made features such as levees, storm surge barriers and highways. To effectively compare the change in storm surge characteristics due to land loss across the years 1930, 1970 and 2010 these man-made features are removed from the CPRA2017 mesh south and west of the Mississippi River (Siverd et al., 2018). In addition, to accurately describe barrier islands in southeast Louisiana for 1930, 1970 and 2010, mesh resolution is enhanced seaward of the current (2017) barrier islands to account for the inland migration of these islands. Therefore, this modified CPRA2017 model is henceforth called the \"detailed\" storm surge model. Historical analysis of storm surge along the Louisiana coast is facilitated through application of a tightly-coupled ADvanced CIRCulation twodimensional depth integrated (ADCIRC-2DDI) code (Luettich Jr. et al., 1992) and the third-generation wave model, Simulating WAves Nearshore (SWAN) (Booij et al., 1999;Dietrich et al., 2011c;Zijlema, 2010). Water surface elevations, depth-averaged current velocities and wave statistics are output for each of the storm surge model mesh years 1930, 1970, 2010. The following sub-sections describe how these three comparable historical meshes of the Louisiana coast are developed. Coastal zones are determined by the position of the 90%, 40%, 1% isopleths along the Louisiana coast in the generally north to south configuration: high (Intracoastal Waterway (ICWW) 90%), intermediate (90%-40%) and submersed (40%-1%) (Siverd et al., 2018) (Figs. 3, 4 and 5). One value for elevation, with respect to North American Vertical Datum of 1988 (NAVD88), is assigned to all mesh nodes within each coastal zone: high (0.47 m), intermediate (0.27 m), and submersed (−0.98 m). One value for Manning's n bottom roughness is also assigned to all mesh nodes within each coastal zone labeled high (0.070), intermediate (0.045), and submersed (0.025). The Intergovernmental Panel on Climate Change (IPCC) estimates annual sea level rise 1901-2010 was 1.7 mm/year. Since 1930, the first mesh year of this analysis, global mean sea levels (GMSLs) have risen approximately 0.16 m for an annual rate of 2.0 mm/year 1930-2010 (Church et al., 2013). Therefore, the constant GMSL rise rate of 2.0 mm/year is applied when setting Gulf of Mexico (GOM) initial water levels for each storm surge model. To include the seasonal variation, the GOM initial water level is initially set to 0.23 m above NAVD88 for 2010 (U.S. Army Corps of Engineers, 2008). Therefore, the GOM initial sea surface is 0.15 m and 0.07 m above NAVD88 for 1970 and 1930, respectively (Table 2). 3.1.1. 1930 storm surge model mesh L:W isopleths derived for mesh year 1930 ( Fig. 1c) are applied to the detailed storm surge model mesh (Figs. 3a and 4a). Coastal zones high, intermediate and submersed are determined by the position of the 1932 90%, 40%, 1% isopleths as discussed in the previous section. National Oceanic and Atmospheric Administration (NOAA) T-Sheets and U.S. Geological Survey (USGS) quad sheets are used to define shoreline positions in the storm surge model mesh for historical river mouths, barrier islands and interior ridges (Table 3). Neither USGS quad sheet data nor NOAA T-Sheet data for this era are available for the Chandeleur Islands; therefore, 1922 survey data from a 1924 U.S. Coast and Geodetic Survey (USCGS) map is utilized to depict the Chandeleur Islands in the 1930 storm surge model mesh. An average elevation of 0.27 m with respect to North American Vertical Datum of 1988 (NAVD88) and Manning's n of 0.045 (same as the intermediate coastal zone) are assigned for all barrier islands except for the ridge of Grand Isle, which is assigned an average elevation of 1.0 m NAVD88 and Manning's n of 0.100. Ridges near Houma are assigned elevations of 1.0 m NAVD88 and a Manning's n of 0.100 as this was the average elevation and Manning's n values of those areas. Ridges with elevations greater than 1.0 m are inserted as they exist in the detailed storm surge model mesh. Navigation waterways, as they existed in 1930, are also inserted in the model mesh while waterways that did not exist in 1930 are not included. The Intracoastal Waterway (ICWW) is unaltered for all three mesh years due to its construction starting in 1925 and being largely completed by the end of the 1930s. However, the ICWW from New Orleans to Mississippi was not excavated by the end of the 1930s and is therefore not included in the 1930 storm surge model mesh. The Mermentau River mouth is inserted according to 1935 USGS quad sheets and NOAA T-Sheet data. The Wax Lake and Atchafalaya Deltas are removed from the mesh by changing the elevation values in this area to 2.00 m below NAVD88 and the Manning's n values to 0.022. The Mississippi River Gulf Outlet is also removed and elevations and Manning's n values are assigned based on the 1932 L:W isopleths."}, {"section_title": "1970 storm surge model mesh", "text": "Coastal zones high, intermediate and submersed are established in the construction of the 1970 storm surge model mesh via L:W isopleths derived for 1970 (Figs. 1c,3b and 4b). Data sources to insert 1970 ridges, historical river mouths, and barrier islands are summarized in Table 3. Barrier island and ridge elevation and Manning's n values are assigned similarly as for the 1930 storm surge model mesh. Because the major navigation waterways in existence by 2010 were excavated before 1970, these waterways are represented by the same width and depth for both 1970 and 2010. The Mermentau River mouth is input according to USGS quad sheets constructed from aerial photographs taken in 1975 and 1977. The Wax Lake and Atchafalaya Deltas are also removed during the development of the 1970 model by changing the elevation values in this area to −2.00 m (NAVD88) and the Manning's n values to 0.022."}, {"section_title": "2010 storm surge model mesh", "text": "L:W isopleths derived for the year 2010 ( Fig. 1c) are applied to the detailed storm surge model mesh and coastal zones high, intermediate and submersed are created similarly as for 1930 and1970 (Figs. 3c and4c). Because this model already has detailed present day barrier island data for the 2017 CPRA Coastal Master Plan, barrier islands are unchanged for 2010. Ridges near Houma are assigned elevations of 1.0 m (NAVD88) and a Manning's n value of 0.100 for 2010 similarly as for 1930 and 1970. Ridges with elevations greater than 1.0 m are maintained as they exist in the detailed model."}, {"section_title": "Sensitivity analysis storm surge model meshes", "text": "Three sensitivity analysis experiments are conducted to examine the impact on inland storm surge heights from 1. global mean sea level (GMSL) rise, 2. excavation of navigation waterways and 3. change in riverine sediment inputs via inland migration of the L:W isopleths and reduction in barrier island area 1930 to 2010. The three additional storm surge models developed for these experiments are described in Table 2. The first experiment isolates the change in maximum of maximums (MOM) water surface elevations due to landscape change and not due to GMSL rise from 1930 to 2010 by simulating the 1930 storm surge model with the 2010 Gulf of Mexico (GOM) initial water level of 0.23 m (model 4, Table 2). Model 4 MOM water surface elevations results are subtracted from those of storm surge model mesh year 2010 (model 3, Table 2). MOM water surface elevations difference values are then averaged per sub-watershed. The goal of the second experiment is to quantify the contribution of the excavation of navigation waterways on inland storm surge heights. Major waterways, specifically the ICWW from New Orleans to Mississippi, Calcasieu Lake Shipping Channel, Mermentau River Outlet, Freshwater Bayou Canal, Vermilion River Cutoff, Wax Lake Outlet, Houma Navigation Canal, Barataria Waterway, and Mississippi River Gulf Outlet ( Fig. 1a and b), are inserted in the 1930 storm surge model mesh as they exist in 1970/2010. This model is henceforth called model 6 ( Table 2). Model 6 is also initialized with 2010 GOM water levels. Model 4 MOM water surface elevations results are subtracted from those of model 6 to isolate the impact of the presence of navigation waterways on inland storm surge heights. The MOM water surface elevations difference is averaged across all inundated sub-watersheds. The third sensitivity analysis experiment isolates the impact of change in riverine sediment input via the inland migration of L:W isopleths and barrier island land loss 1930 to 2010. To accomplish this task, the 1930 storm surge model year with 1970/2010 navigation waterways and initialized with 2010 GOM water levels (model 6, Table 2) is compared with the 2010 storm surge model year (model 3, Table 2). Model 6 MOM water surface elevations results are subtracted from those of model 3 and averaged across both coastal basins and subwatersheds."}, {"section_title": "Subsidence", "text": "Subsidence from 1930 to 2010 across coastal Louisiana is also addressed via circa 1930, 1970, 2010 storm surge model mesh development. Applying the same elevation values to each respective coastal zone allows for the accounting of historical coastal subsidence via the location of the 1932 and 1973 L:W isopleths, which are closer to the Gulf of Mexico (GOM) than the 2010 L:W isopleths (Fig. 1c). Average elevations for each of the three coastal zones were previously determined for 2010 (Siverd et al., 2018) and are supported via marsh elevation measurements measured by Day et al. (2011)."}, {"section_title": "Storm surge model simulations", "text": "The objective of this analysis is to demonstrate how temporal changes in the Louisiana coastal landscape impact storm surge. All storm surge models are therefore forced with the same meteorological wind and pressure fields developed for 14 historical hurricanes (Cox et al., 1995; National Oceanic and Atmospheric Administration, 2017; Powell et al., 1998). Hurricane selection criteria includes storm tracks in the Gulf of Mexico (GOM), attainment of a Category 1 status while in the GOM and landfall between Galveston and Apalachicola Bay (Fig. 6). While forcings from 14 historical hurricanes are selected for this analysis, a suite of synthetic hurricane forcings could also be utilized to achieve the objective of this analysis. Model output includes (per mesh node): maximum water surface elevations, inundation time, current velocity, and wave statistics (Dietrich et al., 2011c). To find the maximum water surface elevation of each node for all hurricanes, the maximum of maximums (MOM) water surface elevations is compiled from the simulation output of all hurricanes. Inundation time output per node is the total time each node is wetted during the simulation regardless if each node is wetted continually or if each wetted node becomes dry and is later wetted again."}, {"section_title": "Application of coastal basins and sub-watersheds", "text": "The 2014 U.S. Geological Survey (USGS) hydrologic unit code 6 (HUC6) coastal basins and hydrologic unit code 12 (HUC12) sub-watersheds provide geographical boundaries to quantify storm surge model simulation output (U.S. Geological Survey, 2017a) similarly as for Siverd et al. (2018) (Fig. 1c). For each mesh year the highest water surface elevations simulation output from all 14 storm surges is compiled into one file named \"maximum of maximums (MOM) water surface elevations\" which is then converted to a 10 m × 10 m raster via ArcGIS version 10.3.1. The 1930 MOM water surface elevations raster is subtracted from the 1970 and 2010 MOM water surface elevations rasters. Each difference raster is averaged across each inundated coastal basin (Table 4) and each smaller sub-watershed (Table 5). Similarly, the highest maximum significant wave heights of all 14 storm surges is compiled into one file named \"MOM significant wave heights\" and converted to a 10 m × 10 m raster. The 1930 MOM significant wave heights raster is then subtracted from the 1970 and 2010 MOM significant wave heights rasters. For inundation time, simulation output from only one storm is examined due to the time dependency of this surge characteristic. Storm surges occur in different time intervals due to varying hurricane characteristics such as strength, forward speed, and landfall location rendering inundation times from multiple hurricanes incomparable. Hurricane Rita output is selected because this storm made landfall on the Texas-Louisiana border. Therefore, its surge inundates the entire Louisiana coast and provides a basis for historical comparison. Similarly with MOM water surface elevations, Rita inundation time differences are averaged across each coastal basin (Table 4) and across each subwatershed (Table 5), which provide a range of values within each coastal basin. The computed coastal basin MOM water surface elevations and Rita inundation time difference values provide a means to connect inland L:W isopleth migration and changes in riverine sediment input on a coastal basin scale. Coastal basins provide a way to contrast 40% L:W isopleth migration toward the GOM in sediment-abundant Atchafalaya-Vermilion versus inland migration in sediment-starved Terrebonne and Barataria basins from 1930 to 2010 (Fig. 1c). The mean distance of migration of the 40% L:W isopleth is calculated for each basin 1932 to 1973 to 2010 also via ArcGIS version 10.3.1.  Fig. 3 (a,b,c) and Fig. 4 (d,e,f) depict the same mesh topology for each mesh year: 1930 (a,d), 1970 (b,e), 2010 (c,f). Coastal zones are also depicted: ICWW > High > 90% > Intermediate > 40% > Submersed > 1%. : 1930-1970-2010 (Fig. 7). Similar simulation results have been obtained (Bilskie et al., 2014;Chen et al., 2008;Siverd et al., 2018), and Hurricane Katrina surge heights greater than 8 m were also recorded by the National Hurricane Center along the Mississippi coast (Knabb et al., 2005). Mean MOM water surface elevations differences reveal little change from mesh year 1930 to 1970 within the three experimental coastal basins Atchafalaya-Vermilion, Terrebonne and Barataria (Fig. 8a, Table 4). However, the average MOM difference is greater 1970 to 2010 for both Terrebonne and Barataria: 0.247 m and 0.282 m, respectively, versus 1930 to 1970 for Terrebonne and Barataria: 0.101 m and 0.133 m, respectively. Sub-watershed statistics provide a range of MOM difference values within the larger coastal basin and therefore greater refinement of simulation results. Within the Terrebonne and Barataria coastal basins, sub-watersheds also demonstrate relatively smaller changes occur 1930 to 1970 versus 1970 to 2010 ( Table 5). For instance, from mesh year 1930 to 1970 for all 55 inundated sub-watersheds within the Terrebonne coastal basin the mean MOM water surface elevation increase is 0.120 m and the range is 0.492 m. However, from 1970 to 2010 the mean MOM water surface elevation increase for the same 55 sub-watersheds within Terrebonne is 0.272 m and the range is 0.907 m. Both values are approximately double the change that occurred over the previous 40 years. For sediment-abundant Atchafalaya-Vermillion, the mean change in MOM water surface elevations from 1970 to 2010 is 0.080 m, which is smaller than the previous 40-year difference value of 0.154 m. The range of sub-watershed values within this coastal basin remains nearly the same for both time intervals. Negative minimum values indicate there is at least one sub-watershed with an average MOM water surface elevation value that decreases over time. For example, within the Terrebonne coastal basin there is at least one subwatershed average difference value of −0.064 m from 1930 to 2010 meaning the 2010 average MOM water surface elevation value is less than that of 1930."}, {"section_title": "Results", "text": ""}, {"section_title": "Storm surge characteristics", "text": ""}, {"section_title": "Inundation time", "text": "Inundation time is the total time a dry area is wetted as a result of storm surge inundation during a hurricane simulation. This storm surge characteristic is quantified in addition to MOM water surface elevations to further examine change in flood risks 1930 to 2010. Simulation output from only one storm is examined due to the time dependency of this surge characteristic and incomparability of multiple hurricane storm surge inundation times. Hurricane Rita inundation time output is examined due to this storm's historically high wind and pressure forcing, track across the GOM south of Louisiana, large size and landfall location on the Louisiana-Texas border (Fig. 6). Due to the size, track, landfall location and counter-clockwise rotation, nearly all south Louisiana and most of the study area is inundated for all three storm surge model mesh years: 1930, 1970 and 2010. Inundation time range for the Hurricane Rita seven-day simulation, excluding areas always wetted or never wetted during the seven day simulation, remains the same for all three mesh years: 0.01-3.10 days (Fig. 9). The interval begins at 0.01 days to exclude areas never wetted (0.00 days) and areas always wetted (> 3.10 days), which isolates Rita storm surge impact on the Louisiana coast. Differences in mesh year results include the inland extent per coastal basin. For example, the areas that are initially dry and temporarily wetted during Rita for storm surge model year 1930 ( Fig. 9a) are nearly the same areas temporarily wetted in 2010 in the Atchafalaya-Vermilion coastal basin (Fig. 9c). However, inundation time output extends north of the ICWW (Fig. 1c) in Terrebonne and Barataria for storm surge model mesh year 2010 ( Fig. 9c) but not for 1930 (Fig. 9a). The area temporarily inundated the greatest length of time for all three mesh years is the Biloxi Marsh (Fig. 1) within the Lake Pontchartrain coastal basin. Difference plots demonstrate how inundation time has evolved across coastal Louisiana from 1930 to 2010 (Fig. 10a-c). These plots include both temporarily and permanently wetted areas during the seven-day Rita simulation. Areas become permanently wetted in mesh year 2010 that are not permanently wetted in mesh years 1930 or 1970 due to the conversion of wetland to water. For example, mean inundation time differences across the respective Atchafalaya-Vermilion, Terrebonne and Barataria coastal basins are 0.040 days, 0.982 days and 1.077 days, indicating more areas convert to open water in Terrebonne and Barataria than in Atchafalaya-Vermilion from 1970 to 2010 (Table 4). Subwatershed Rita inundation time differences per coastal basin are also computed for each mesh year: 1970 minus 1930, 2010 minus 1970, and 2010 minus 1930 (Fig. 10a-c; Table 5). Sub-watershed Table 4 differences demonstrate nearly the same values in all three coastal basins (Atchafalaya-Vermilion, Terrebonne, Barataria) 1930 to 1970 (Fig. 10a). However, from 1970 to 2010, sub-watershed differences range 1.96 days within the Atchafalaya-Vermilion coastal basin and Table 5 Sub-watershed statistics per experimental coastal basin. Mean sub-watershed values calculated for both MOM water surface elevation difference (Fig. 8) and Rita inundation time difference (Fig. 10) 10 m × 10 m rasters. GMSL rise of 2 mm/year 1930-2010 included."}, {"section_title": "Sub-MOM Water Surface Elevation Rita Inundation Time Difference watershed", "text": "Difference (with GMSL rise, m) (with GMSL rise, days) Statistics per Coastal 1970-1970-Basin 193019701930193019701930 ( Fig. 8b) ( Fig. 8c) ( Fig. 10a) ( Fig. 10b) (Fig. 10c (1930,1970,2010). The change in maximum significant wave heights is minimal across coastal Louisiana from 1930 to 1970 except southwest of Lake Charles (Fig. 1)  4.91 days and 4.60 days within the Terrebonne and Barataria coastal basins, respectively ( Fig. 10b; Table 5). Negative minimum Rita inundation time difference values indicate at least one sub-watershed within a coastal basin with less inundation time for the later mesh year (i.e. 2010 versus 1930). of maximums (MOM) water surface elevations due to landscape change (addition of navigation waterways and change in riverine sediment inputs) from 1930 to 2010 and not due to GMSL rise. To accomplish this objective, model 1 results are subtracted from those of model 3 ( Table 2) 1930 1970 2010 1970-1930 2010-1970 2010-1930 Lower  (Fig. 12a). Terrebonne and Barataria subwatershed values range −0.25 m to 0.95 m and −0.25 m to 0.85 m, respectively. Negative values in the Terrebonne and Barataria coastal basins indicate areas of coastal wetland loss adjacent to the Gulf of Mexico (GOM) 1930 to 2010 and the corresponding lowering of surge heights in 2010. Positive inland values indicate higher inland surge heights and greater inland surge propagation in 2010 also due to coastal wetland loss from 1930 to 2010. Negative values in the Atchafalaya-Vermilion coastal basin demonstrate the response of storm surge to the progradation of the WaxLake-Atchafalaya Deltas between 1970 and 2010."}, {"section_title": "Contribution of navigation waterways", "text": "Model 6 (1930 landscape with 1970/2010 navigation waterways) is initialized with 2010 GOM water levels (Table 2). Model 12 (1930 landscape with 1930 navigation waterways and 2010 initial GOM water levels) MOM water surface elevations results are subtracted from those of model 6 to isolate the impact of the presence of navigation waterways on inland storm surge heights. The MOM difference is averaged across all inundated subwatersheds (Fig. 12b). The calculated difference in mean MOM water surface elevations southwest of Lake Charles (Fig. 1b) in the Calcasieu-Mermentau coastal basin (Fig. 12b) is on the order of 0.3-0.5 m while the mean MOM difference within all other subwatersheds ranges 0.0-0.2 m. The higher wave heights southwest of Lake Charles demonstrate the impact of the excavation of the deep Calcasieu Lake Shipping Channel between 1930 and 1970 as well as conversion of wetland to open water in that area."}, {"section_title": "Contribution of changes in riverine inputs", "text": "Model 6 MOM water surface elevations results are subtracted from those of model 3 (Table 2). Mean MOM water surface elevation difference values and inundation time results (Fig. 12c) are calculated across both coastal basins Table 6 and the smaller sub-watersheds ( Table 7). The mean MOM difference within sediment-abundant Atchafalaya-Vermilion is 0.095 m while across sediment-starved Terrebonne and Barataria the mean MOM difference is 0.207 m and 0.269 m, respectively. Rita seven-day inundation time difference demonstrates a greater contrast between Atchafalaya-Vermilion with a value of 0.057 days versus Terrebonne and Barataria with values of 1.128 days and 1.268 days, respectively (Table 6). The range in sub-watershed mean MOM water surface elevation difference values for each of the three coastal basins reveals results similar to those when GMSL rise is included. The range in Terrebonne (1.141 m) and Barataria (1.002 m) difference values is approximately double that of Atchafalaya-Vermilion (0.559 m) ( Table 7)."}, {"section_title": "Storm surge characteristics versus L:W isopleth migration 1930-2010", "text": "When including GMSL rise the mean MOM water surface elevations differences from 1930 to 1970 for Atchafalaya-Vermilion, Terrebonne and Barataria are 0.163 m, 0.101 m, and 0.133 m, respectively (Table 4). From 1970 to 2010 the differences across the same coastal basins are: 0.096 m, 0.247 m, and 0.282 m, respectively. Rita inundation time differences for Atchafalaya-Vermilion, Terrebonne and Barataria from 1930 to 1970 are: 0.100 days, 0.283 days, 0.385 days and from 1970 to 2010: 0.040 days, 0.982 days, 1.077 days, exceed 1 m due to the excavation of the Calcasieu Lake Shipping Channel as well as the conversion of wetland to water in this area (Fig. 11a, arrow). When the mean raster value is computed across all inundated sub-watersheds 1930 to 1970, approximately 56% sub-watersheds fall within the interval −0.050.05 m, 37% within 0.05-0.15 m, 4% within 0.15-0.25 m and 3% within 0.25-0.50 m. From 1970 to 2010, maximum significant wave height differences range −1.00 m to 0.25 m within the AtchafalayaVermilion coastal basin and −0.50 m to 1.00 m within the Terrebonne and Barataria basins (Fig. 11b). The greatest wave height differences occur along the Chandeleur Islands (Fig. 1) due to loss of these barrier islands 1970 to 2010 (Fig. 11b). Maximum significant wave respectively. The difference in both mean MOM water surface elevations and inundation time is smaller within sediment-abundant Atchafalayaheights are also higher in 2010 versus 1930 in the Biloxi Marsh and in the Lake Pontchartrain coastal basins by 0.15 m-0.50 m (Fig. 11c). In areas where wetlands prograded from 1970 to 2010 (i.e. Wax Lake-Atchafalaya Deltas) wave heights decreased, which is indicated by the negative values in Fig. 11b."}, {"section_title": ".2. Sensitivity analysis", "text": ""}, {"section_title": ".2.1. Contribution of global mean sea level (GMSL) rise", "text": "The purpose of this experiment is to isolate the change in maximum  (Figs. 13 and 1). Mean inland migration of the 40% L:W isopleth is 185 m for a rate of 5 m/year across sediment-abundant AtchafalayaVermilion from 1930 to 1970. For the following 40 years, the mean inland migration is measured −358 m for a rate of −9 m/year and is negative due to the progradation of the Wax Lake-Atchafalaya Deltas toward the Gulf of Mexico (GOM) (Fig. 13a). This negative inland rate of migration corresponds with the smaller MOM water surface elevations and inundation time differences from 1970 to 2010. In contrast, in sediment-starved Terrebonne and Barataria coastal basins the rate of 40% isopleth inland migration increases 1970 to 2010 versus 1930 to 1970. For Terrebonne, 40% isopleth migration is 957 m (24 m/year) 1930 to 1970 and 8,181 m (205 m/year) 1970 to 2010. Similarly, for Barataria: 879 m (22 m/year) 1930 to 1970 and 7,421 m (186 m/year) 1970 to 2010."}, {"section_title": "Discussion", "text": "To evaluate the impact of climate change on storm surge along the Louisiana coast, a storm surge model featuring a mesh representation of the modern Louisiana coastal landscape was previously initialized with lowered Gulf of Mexico (GOM) water levels and forced with hurricanes of decreased intensity (Irish et al., 2013). The contemporaneous historical coastal landscape could not be represented in a storm surge model mesh due to lack of detailed topo-bathymetric data pre-2000. The present analysis builds on past studies via the construction of comparable, simplified representations of the historical Louisiana coastal landscape. Simulation results reinforce the idea coastal stability and restoration efforts should be conducted on a coastal basin scale (Twilley et al., 2008). Riverine discharge re-introduced to the Terrebonne and Barataria coastal basins would increase sediment delivered to these two coastal basins, which would fill the areas converted between 1930 and 2010 from wetland to open water (Day et al., 2007). An increase in land area would result in a reversal of L:W isopleth inland migration to toward the GOM and reduction of flood risks for coastal communities. The impact of substantial riverine sediment deposition in the Atchafalaya-Vermilion coastal basin and negligible riverine sediment deposition in the Terrebonne and Barataria coastal basins from 1930 to 2010 is demonstrated through both the rate of migration of the 40% L:W isopleth and the change in storm surge characteristics during this 80 year period. Specifically, from storm surge model mesh year 1970 to 2010, the average rate of inland migration within AtchafalayaVermilion is −9 m/year while in Terrebonne and Barataria the rate is  Sensitivity analysis results indicate between 1970 and 2010 wetland loss due to change in riverine sediment inputs is the greatest contributor to increased inland storm surge heights and inundation time in the Terrebonne and Barataria coastal basins when compared with the impact of GMSL rise and excavation of major navigation waterways. In addition to large-scale drivers of wetland loss (i.e. changes in riverine sediment inputs), small-scale drivers include, among others, increased flooding from impoundments created by oil canal spoil banks, salt water intrusion via canal excavation and herbivory due to invasive species such as nutria (Chambers et al., 2005;Turner and McClenachan,   Table 2). c) 2010 minus 1930 with 1970/2010 waterways mean MOM difference results (model 3-model 6; Table 2). Summary: a) -b) = c). Coastal basins are bold. Sub-watersheds are gray."}, {"section_title": "Table 6", "text": "Sensitivity Analysis. All storm surge model meshes include 1970/2010 navigation waterways. All simulations are performed with 2010 GOM initial water levels. Mean MOM water surface elevations (m) for all 14 hurricanes and mean inundation time for Rita (days). Mean MOM water surface elevations difference a nd inundation time difference calculated by computing difference in 10 m × 10 m rasters and averaging across individual coastal basins. Coastal basins depicted in Fig. 12c  2018). However, small-scale causes of wetland loss are outside the scope of this analysis. The largest changes in maximum significant wave heights also occur (Fig.  11b) due to changes in riverine sediment input 1970 to 2010. Maximum significant wave height differences range −1.00 m to 0.25 m within the sediment-abundant Atchafalaya-Vermilion coastal basin and −0.25 m to 1.00 m within the sediment-starved Terrebonne and Barataria coastal basins. Wave heights increase by more than 1 m along barrier islands due to barrier island loss and relative sea level rise, which allows more wave energy past the barrier islands and into coastal wetlands. This phenomenon is demonstrated through the loss of the Chandeleur Islands from 1930 to 2010 resulting in higher maximum significant wave heights entering the Biloxi Marsh and Lake Pontchartrain (Fig. 11c)."}, {"section_title": "Conclusions", "text": "The co-evolution of wetland loss and flood risk in the Mississippi River Delta is tested by contrasting the response of storm surge in historically sediment-abundant versus sediment-starved Louisiana coastal basins. Storm surge model meshes are constructed featuring simplified historical coastal Louisiana landscapes circa 1930, 1970 and 2010. Water surface elevations, time of inundation and wave statistics are computed by simulating the same suite of 14 hurricane wind and pressure fields for each mesh year. The major finding of this analysis is the smaller difference in mean maximum of maximums (MOM) water surface elevation of 0.096 m across the Atchafalaya-Vermilion coastal basin from 1970 to 2010 versus 0.163 m for 1930 to 1970. In contrast, differences in mean MOM water surface elevations increase across Terrebonne and Barataria coastal basins from 1970 to 2010: 0.247 m and 0.282 m, respectively, versus 1930 to 1970: 0.101 m and 0.133 m, respectively. A smaller difference in Hurricane Rita inundation time also occurs across Atchafalaya-Vermilion 1970 to 2010: 0.040 days versus 1930 to 1970: 0.100 days. A larger difference occurs across Terrebonne and Barataria from 1970 to 2010: 0.982 days and 1.077 days, respectively, versus 1930 to 1970: 0.283 days and 0.385 days, respectively. Historical differences in mean MOM water surface elevations and inundation time correspond with historical changes in riverine sediment input for these three coastal basins. The impact of riverine sediment input is also supported by sensitivity analysis results. Changes in riverine sediment inputs are identified as the greatest contributor to increased inland storm surge heights and inundation time when compared with the impact of GMSL rise and excavation of major navigation waterways. The combined Mississippi and Red River suspended sediment load diverted to the Atchafalaya River within the AtchafalayaVermilion coastal basin increased from approximately 87.1 megatons/ year in 1930 to 93.9 MT/year by 1970 and gradually declined by half to modern-day (2015). In contrast Bayou Lafourche, which historically supplied Mississippi River sediment to the Terrebonne and Barataria coastal basins, was dammed from the Mississippi in Donaldsonville by 1906 and has maintained a negligible suspended load since. Therefore, the wetland nourishing ability of Mississippi River sediment was nonexistent during the study period of 1930 to 2010 in Terrebonne and Barataria and resulted in substantial wetland collapse within these two coastal basins. By analyzing the historical evolution of storm surge across coastal Louisiana, we were able to establish trends in wetland loss and changes in surge height, wave height and inundation time. This gives us the ability to extend these trends into the future. The recent increase in wetland loss across coastal Louisiana (i.e. Terrebonne and Barataria coastal basins) demonstrates how difficult it will be for this region to cope with future wetland loss and GMSL rise, especially considering the high annual GMSL rise rates projected by the Intergovernmental Panel on Climate Change (IPCC) and the National Oceanic and Atmospheric Administration (NOAA). While the small increase in both land area and storm surge characteristics across the Atchafalaya-Vermilion coastal basin from 1930 to 2010 demonstrates the ability of sediment deposition to compensate for relative sea level rise, the 50% reduction of suspended sediment in the Mississippi River since mid-twentieth century dam construction and the 7,500-year history of the Mississippi building one delta lobe at a time implies additional measures must be taken to prepare nationally important industries and communities across coastal Louisiana for the inevitable increase in future flood risk. Conflicts of interest None. Fig. 13. Per coastal basins Atchafalaya-Vermilion, Terrebonne, and Barataria 1930-2010: a-b) 40% L:W isopleth inland migration (km) vs. mean MOM water surface elevations (WSE) (m) and Rita inundation time (all nodes, 7 day simulation, days) with 2 mm/year GMSL rise, c-d) 40% L:W isopleth inland migration (km) vs. mean MOM water surface elevations (WSE) (m) and Rita inundation time (all nodes, 7 day simulation, days) without GMSL rise."}]