[{"section_title": "Abstract", "text": "The purpose of this study was to characterize the effects of medications and systemic diseases on major salivary gland flow rates. Unstimulated and 2% citrate-stimulated parotid and submandibular salivas were collected from 293 subjects of the oral physiology component of thle Baltimore Longitudinal Study of Aging. The influence of the number of medications and diseases on salivary flow rates was determined by separate one-way ANOVA tests. There was an overall decrease in both parotid and submandibular flow rates with increasing numbers of medications and systemic diseases. However, this was significant (p < 0.05) only for unstimulated submandibular flow rates (with increasing numbers of systemic diseases) and stimulated submandibular flow rates (with increasing numbers of systemic diseases and medications). Unstimulated flow rates rapidly approached zero with increasing numbers of medications and diseases. These results suggest that the submandibular gland may be more sensitive to physiologic permutations than the parotid gland. In addition, individuals being treated for multiple systemic diseases and taking numerous medications may be more susceptible to salivary hypofunction.\n(ORAL SURC ORAL MED ORAL PATHOL 1993;76:301-6) Decreased salivation is a common side effect of drug use.l An estimated 120 million people each year obtain prescription medications.2 Seventy-five percent of office visits to general medical practitioners and internists are associated with the continuation or initiation of a prescribed medication.3 The prevalence of xerostomia or the subjective complaint of dry mouth has been reported to be 29% in an adult population.4 However, many subjects in this study4 were taking medications, and this may have been the cause of their xerostomia.5 Indeed, several studies have associated medications with decreased salivary flo~.~-\" .Johnson et al.' l examined a population of chronically ill, longterm hospitalized elderly patients and found 44% of them complained of xerostomia and 43% actually had low stimulated parotid flow. These studies suggest that lboth medication use and systemic disease may influence salivary function.\nPrevious studies of medicated persons have examined only whole salivary or parotid flow rates. However, recent studies12-14 that examined parotid and submandibular/sublingual function separately suggest the submandibular/sublingual glands are more susceptible to the influence of systemic disease than the parotid gland. The purpose of this study was to characterize unstimulated and 2% citrate-stimulated parotid and submandibular/sublingual salivary flow rates in the presence of medications and systemic diseases in a well-characterized, ambulatory population.\nThe study population included 293 volunteer participants in the (oral physiology component15 of the Baltimore Longitudinal Study of Aging.16 These persons were community-dwelling, ambulatory, white, and of middle socioeconomic class. Participants were examined by a physician, and diagnoses were based on clinical and laboratory results.17 Only subjects with well-controlled medical conditions were included in this study. Prescription medication usage was well documented in this population. Patients brought current medications to the clinic and completed a selfreported history that was reviewed by the examiner. Vitamins, aspirin, and topically applied dermatologic preparations were not included in the total medication count.\nSubjects refrained from eating, drinking, and oral hygiene procedures for a minimum of 90 minutes before salivary collection. Samples were collected between 8:30 AM and 11 AM by a single investigator (J.A.S.). Unstimulated (resting) samples were collected initially for 5 minutes. This was followed by stimulation with 2% citrate applied to the dorsolateral surfaces of the tongue for 5 seconds at 30-second intervals.18 After a. 2-minute equilibration period, stim-301"}, {"section_title": "", "text": "Decreased salivation is a common side effect of drug use.l An estimated 120 million people each year obtain prescription medications.2 Seventy-five percent of office visits to general medical practitioners and internists are associated with the continuation or initiation of a prescribed medication.3 The prevalence of xerostomia or the subjective complaint of dry mouth has been reported to be 29% in an adult population.4 However, many subjects in this study4 were taking medications, and this may have been the cause of their xerostomia.5 Indeed, several studies have associated medications with decreased salivary flo~.~-\" . Johnson et al.' l examined a population of chronically ill, longterm hospitalized elderly patients and found 44% of them complained of xerostomia and 43% actually had low stimulated parotid flow. These studies suggest that lboth medication use and systemic disease may influence salivary function.\nPrevious studies of medicated persons have examined only whole salivary or parotid flow rates. However, recent studies12-14 that examined parotid and submandibular/sublingual function separately suggest the submandibular/sublingual glands are more susceptible to the influence of systemic disease than the parotid gland. The purpose of this study was to Tlinical Dental Staff Fellow, Clinical characterize unstimulated and 2% citrate-stimulated parotid and submandibular/sublingual salivary flow rates in the presence of medications and systemic diseases in a well-characterized, ambulatory population."}, {"section_title": "MATERIAL AND METHODS Study population", "text": "The study population included 293 volunteer participants in the (oral physiology component15 of the Baltimore Longitudinal Study of Aging.16 These persons were community-dwelling, ambulatory, white, and of middle socioeconomic class. Participants were examined by a physician, and diagnoses were based on clinical and laboratory results.17 Only subjects with well-controlled medical conditions were included in this study. Prescription medication usage was well documented in this population. Patients brought current medications to the clinic and completed a selfreported history that was reviewed by the examiner. Vitamins, aspirin, and topically applied dermatologic preparations were not included in the total medication count."}, {"section_title": "Saliva collection", "text": "Subjects refrained from eating, drinking, and oral hygiene procedures for a minimum of 90 minutes before salivary collection. Samples were collected between 8:30 AM and 11 AM by a single investigator (J.A.S.). Unstimulated (resting) samples were collected initially for 5 minutes. This was followed by stimulation with 2% citrate applied to the dorsolateral surfaces of the tongue for 5 seconds at 30-second intervals.18 After a. 2-minute equilibration period, stim- ulated parotid secretions were collected for 2 minutes. Unstimulated and stimulated parotid saliva was collected from a single salivary gland with the use of a modified Carlson-Crittenden cup as described previo~sly.'~, 2o Submandibular/sublingual saliva was collected from the orifice of Wharton's duct with a micropipette attached to gentle suction as described previously. 21 After collection, the volume of saliva was determined gravimetrically, assuming a specific gravity of 1 .O. Submandibular saliva, as defined in this article, represents a combined submandibular and sublingual secretion because of the frequent common exit of the gland ducts.22"}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Statistical analysis", "text": "Men (N = 169) and women (N = 124) between the ages of 19 to 93 years (mean age = 60.4 years, median age = 64 years) comprised the study population One hundred seventy-one persons were taking no prescription medications, and 122 persons were taking one or more medications (Table I) . One hundred eighty-two persons were not being treated for any medical disease, and 111 persons were being treated for one or more diseases (Table 11 ). Unstimulated and stimulated major gland flow rates of unmedicated persons who were not being treated for any systemic diseases were not statistically different between men and women. Therefore the gender values were cornbined for all analyses. Subjects were categorized according to the number Unstimulated and stimulated major salivary gland of prescription medications that they were taking and flow rates progressively diminish with increasing the number of diseases for which they were currently numbers of prescription medications ( Fig. 1 ). Howbeing treated. The influence of the number of mediever, this pattern was statistically significant only for cations and the number of systemic diseases on each stimulated submandibular flow rates for 0 to 7 medof the four major salivary flow rates was determined ications (p = 0.002, Fig. 1 ) and from 0 to 4 medicaby one-way ANOVA tests. In addition, individual tions (p = 0.001, Fig. 1 ). The distribution of subjects salivary gland flow rates were identified as being eiwith salivary flow rates categorized as being either ther low or high from previously established control low or high according to the number of prescription population standards using the lowest or highest 10th medications is provided in Table I . With increasing percentiles. 23 The frequency of subjects with low or numbers of drugs, the prevalence of subjects with low high salivary gland flow rates for each of the four flow flow rates, according to control populations stanrates was analyzed by a x2 test. Data were analyzed dards,23 increased. Conversely, the prevalence of subwith the use of RSl software (BBN software prodjects with high flow rates diminished with increasing ucts, Cambridge, Mass.). Significance was selected at numbers of drugs. Chi-square tests were performed the p < 0.05 level.\nbetween subjects who take no medications and per- sons who take one or more medications. Subjects who take one or more medications were significantly more likely to have low unstimulated parotid (p = 0.047), unstimulated submandibular (p = O.OOl), and stimulated submandibular (JJ = 0.002) flow rates. For example, approximately one quarter or more of these persons had low unstimulated parotid and unstimulated and stimulated submandibular salivary flow rates compared with approximately 10% of subjects not taking any prescription medications (Table I) . According to Fig. 2 , major salivary gland flow rates decline with increasing numbers of diseases. This was statistically significant for unstimulated submandibular (p = 0.04) and stimulated submandibular (p = 0.001) flow rates for 0 to 4 diseases and from 0 to 3 diseases (JJ = 0.03 and p = 0.001, respectively) but not for the parotid secretions. The distribution of subjects with salivary flow rates categorized as being either low or high according to the number of diseases for which subjlects were being treated is provided in Table II . With increasing numbers of diseases, the prevalence of subjects with high flow rates decreased and the prevalence of subjects with low flow rates increased. Chi-square tests between persons being treated for one or more systemic diseases versus no diseases revealed that subjects with one or more systemic diseases were statistically more likely to have low unstimulated parotid (JJ = 0.015), unstimulated submandibular (p = O.OOl), and stimulated submandibular (p = 0.001) flow rates. More than one quarter of the persons with one or m.ore systemic diseases had low unstimulated parotid and unstimulated and stimulated submandibular flow rates, compared with approximately 10% of subjects not being treated for any systemic diseases (Table II) ."}, {"section_title": "DISCUSSION", "text": "This study examined individual parotid and submandibular salivary gland flow rates in a population of community-dwelling, volunteer participants taking prescription medications and having well-controlled systemic disease. The results of this study suggest that although there is a generalized decrease in parotid and submandibular flow rates in the presence of medications and systemic diseases, the submandibular gland is affected to a greater extent then the parotid gland. These conclusions extend previous findings that demonstrated a trend of decreasing whole salivary and parotid flow rates in the presence of diseases and medications in elderly institutionalized populations 1, g-11,24 Subjects taking one or more medications or being treated for one or more systemic diseases were not at greater risk of having low stimulated parotid flow rates compared with their healthy counterparts (Tables I and 11). In contrast, subjects taking one or more medications or being treated for one or more diseases were more likely to have a low unstimulated and stimulated submandibular salivary flow rate (Tables  I and II) . Only the submandibular flow rates demonstrated a statistically significant decline in the presence of increasing medications and systemic diseases. One caveat to this observation is that the number of persons who take several medications or have numerous systemic diseases in this study is small. However, three studies that examined major salivary flow rates of persons with one specific disease also found that the submandibular gland is more susceptible to the effects of systemic disease. 12-14 Two percent citrate-stimulated submandibular flow rates were observed to be below normal in 87.5% of patients with SjjBgren's syndrome while stimulated parotid flow was decreased in only 54.7%. I2 In unmedicated patients with Alzheimer's disease, unstimulated and stimulated submandibular gland flow rates were markedly diminished with no alteration in parotid secretions.13 A longitudinal evaluation of major salivary gland function in HIV-1 infected patients found that the submandibular gland manifested alterations in function earlier than the parotid gland.14 Therefore the findings in this study corroborate studies that examined the effect of a specific disease on salivary flow suggesting that thesubmandibular gland may be preferentially vulnerable to exogenous influences. The significance of this finding is that the submandibular gland is a major contributor to total salivary production. The proportional contribution of the submandibular, parotid, and sublingual glands under resting or unstimulated conditions has been estimated to be 69%, 26%, and 5%, respectively.25 The contribution of the minor glands has been determined to be from 0 to 8%. 25, 26 This article considers submandibular and sublingual secretions as a single measurement. Therefore in the most severe case of total loss of unstimulated submandibular/sublingual flow, a person may lose up to 74% of their total unstimulated salivary production.\nMany histologic, anatomic, neurologic, and physiologic differences exist between the submandibular and parotid gland in health, in aging, and in the presence of systemic diseases. 27 To date there is no suitable explanation for this apparent increased suscepti- Wu and Ship 305 Volume 76, Number 3 bility (of the submandibular gland secretory function to medication and disease. Collection of whole or parotid saliva is limited in that it does not provide comprehensive functional information about all major glands. This study demonstrates the need for more information regarding the submandibular gland. Unstimulated salivary flow rates rapidly approached zero with increasing numbers of medications and diseases (Figs. 1 and 2 ) In addition, those persons taking one or more medications or having one or more diseases were more likely to have unstimulated parotid and unstimulated submandibular flow rates lhat were in the lowest 10th percentile than in the highest 10th percentile of salivary flow rates (Tables I and II) This is an important observation because unstimulated salivary flow is a m.easure of the amount of saliva that is constantly secreted to protect and to lubricate the oral cavity, whereas stimulated salivary flow is a measure of the functional capacity of the gland. Unstimulated secretions may be of greater signifi.cance to person's perception of dryness as well as their ability to maintain homeostasis.5 Therefore the results from these analyses exhibit a pattern suggesting that persons being treated for numerous systemic diseases and/or taking multiple medications are likely to have little or no unstimulated salivary output. As a result, these persons are not receiving the full protection provided by saliva and are placed at increased risk for developing the numerous complications of salivary gland hypofunction.28\nA limitation of this study is that it was not possible to truly separate the effects of medications and diseases on salivary flow. Many subjects had a systemic disease and were taking one or more prescription medications. Therefore it is unknown if the salivary effects seen in this study are due to the effects of medication, the effects of diseases, or a combination of both. Unfortunately, it was not possible to distinguish effects of individual medications or systemic diseases on major salivary gland flow rates because of the srnall sample size of persons in these groups.\nIn this study, age and gender were not considered factors that would significantly influence major salivary gland flow rates. Major salivary gland flow rates appear to be gender independent,18> 20, 27, 2g and parotid salivary flow rates remain stable with age in healthy persons. 20, 2g, 3o However, the effect of healthy aging on submandibular function is not as clear-cut. Pederson et aL31 found an age-associated decrease in submandibular flow rates. Alternatively, Tylenda et al.,'* with the use of salivary collection techniques similar to those used in this study, found no changes in submandibular gland flow rates across the human life span.\nThe results of t.his study demonstrate that with increasing numbers of diseases and medications, there is a greater likelihood that major salivary gland output will decrease. Unstimulated salivary flow rates rapidly approach zero in the presence of increasing medications and diseases. In addition, the submandibular gland may be more susceptible to external or physiologic permutations than the parotid gland. This study utilized only subjects taking prescription medications who hadl well-controlled disease. One may speculate that subjects who take multiple medications with uncontrolled disease may exhibit even greater salivary dysfunction. It will be necessary in future investigations to define which and how specific drugs and diseases have a deleterious effect on salivary gland function as well as the effect of the interaction of numerous medications and medical conditions on secretory function. Ultimately, it will be necessary to completely understand and diagnose salivary dysfunction so as to direct studies aimed at the treatment of xerostomia."}]