[{"section_title": "Abstract", "text": "Abstract Preclinical Alzheimer's disease (AD) is characterized by amyloid deposition in the absence of overt clinical impairment. There is substantial heterogeneity in the longterm clinical outcomes among amyloid positive individuals, yet limited work has focused on identifying molecular factors driving resilience from amyloid-related cognitive impairment. We apply a recently developed predicted gene expression analysis (PrediXcan) to identify genes that modify the association between baseline amyloid deposition and longitudinal cognitive changes. Participants free of clinical AD (n = 631) were selected from the AD Neuroimaging Initiative (ADNI) who had a baseline positron emission tomography measure of amyloid deposition (quantified as a standard uptake value ratio), longitudinal neuropsychological data, and genetic data. PrediXcan was used to impute gene expression levels across 15 heart and brain tissues. Mixed effect regression models assessed the interaction between predicted gene expression levels and amyloid deposition on longitudinal cognitive outcomes. The predicted gene expression levels for two genes in the coronary artery (CNTLN, PROK1) and two genes in the atrial appendage (PRSS50, PROK1) interacted with amyloid deposition on episodic memory performance. The predicted gene expression levels for two additional genes (TMC4 in the basal ganglia and HMBS in the aorta) interacted with amyloid deposition on executive function performance. Post-hoc analyses provide additional validation of the HMBS and PROK1 effects across two independent subsets of ADNI using two additional metrics of amyloid deposition. These results highlight a subset of unique candidate genes of resilience and provide evidence that cell-cycle regulation, angiogenesis, and heme biosynthesis likely play a role in AD progression."}, {"section_title": "Introduction", "text": "The neuropathological cascade in Alzheimer's disease (AD) includes a long preclinical period in which neuropathologies emerge in the absence of cognitive impairment. The predominant models of AD biomarker progression suggest that amyloid plaque deposition occurs earliest and ultimately drives downstream neurofibrillary tangle formation, neurodegeneration, and cognitive decline (Jack et al. 2013; Jack et al. 2010) . Amyloid plaques, whether measured at autopsy or in vivo using cerebrospinal fluid (CSF) or positron emission tomography (PET) biomarkers, are present in approximately 30 % of cognitively normal older adults, highlighting the substantial heterogeneity in clinical progression of AD that exists among Data used in preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (adni.loni.usc.edu). As such, the investigators within the ADNI contributed to the design and implementation of ADNI and/or provided data but did not participate in analysis or writing of this report. A complete listing of ADNI investigators can be found at: http://adni.loni.usc.edu/wpcontent/uploads/how_to_apply/ADNI_Acknowledgement_List.pdf Electronic supplementary material The online version of this article (doi:10.1007/s11682-016-9615-5) contains supplementary material, which is available to authorized users. * Timothy J. Hohman Timothy.J.Hohman@Vanderbilt.edu amyloid-positive individuals (Mormino et al. 2014a; Rahimi and Kovacs 2014) . The identification of factors that promote resilience among amyloid-positive individuals may provide alternative targets for clinical intervention. High cognitive reserve, for example, has been shown to be particularly protective against cognitive decline among amyloid-positive individuals (Rentz et al. 2010) . Certain genetic factors, such as the presence of the APOE ε4 allele (Lim et al. 2013; Mormino et al. 2014b) , and proteomic factors, such as CSF levels of vascular endothelial growth factor (Hohman et al. 2015) , have been shown to strengthen the association between amyloid and cognition. Yet, to our knowledge, a comprehensive analysis of genomic modifiers of amyloid-related cognitive decline has not been performed. One methodological approach would be to perform a simple genome-wide association analysis (GWAS) to test the interaction of millions of single nucleotide polymorphisms (SNPs) with amyloid on downstream cognitive change. However, statistical power is a major concern for any such analysis given the relatively limited number of studies with both baseline AD biomarker data and longitudinal cognitive data. Additionally, the interpretation of significant SNP hits becomes extremely challenging without additional relevant functional data.\nThis manuscript leverages PrediXcan, a recently developed predicted gene expression technique (Gamazon et al. 2015) that can be applied in a gene interaction analysis. This technique ameliorates concerns about statistical power and functional interpretation and is well positioned to provide novel insights into potential candidate pathways of resilience. In this study, we first impute levels of gene expression across 15 tissues relevant to AD from the heart and brain and then identify genes that modify the association between amyloid and cognitive decline. We chose to focus gene expression in heart tissues as well as brain tissues because there is growing evidence that vascular risk factors and subclinical deficits in cardiac function are associated with poor brain aging and AD (Jefferson et al. 2015a; Jefferson et al. 2010; Jefferson et al. 2015b) . This application of the PrediXcan approach provides a focused analysis of 13,000 genetic models, all of which have a straight-forward functional interpretation. Our hypothesis is that tissue-specific, genetically-determined expression in the heart and brain will modify the association between amyloid and change in cognition."}, {"section_title": "Materials and methods", "text": "Participants were drawn from the Alzheimer's Disease Neuroimaging Initiative database (ADNI; adni.loni.usc.edu) launched in 2003 as a public-private partnership. The original ADNI study enrolled approximately 800 participants, aged 55-90 years, excluding serious neurological disease, other than AD, and history of brain lesion, head trauma, or psychoactive medication use (for full inclusion/exclusion criteria see http://www.adni-info.org). Written informed consent was obtained from all participants at each site, and analysis of ADNI's publically available database was approved by our local Institutional Review Board prior to data analysis."}, {"section_title": "Participants", "text": "We accessed publicly available participant data from ADNI on 5/1/2016, and ADNI enrollment criteria are outlined in the ADNI protocol (http://www.adni-info.org/Scientists/ AboutADNI.aspx). For the present analyses, we included all participants with a diagnosis of normal cognition or mild cognitive impairment at baseline who also had a PET measurement of amyloid deposition, genomic data, and longitudinal cognitive data, yielding 631 participants for analyses. We chose to focus on individuals free of clinical AD because we are interested in identifying factors that promote resilience to the onset of clinical AD."}, {"section_title": "PET image processing", "text": "Amyloid deposition was quantified using an 18 F-AV-45 tracer as previously described (Landau et al. 2012 ). The mean standardized uptake value ratio (SUVR) was calculated across the cingulate (anterior and posterior regions), frontal, temporal (middle and lateral regions), and lateral parietal (precuneus and supramarginal gyrus) cortices, and divided by the reference region (whole cerebellum)."}, {"section_title": "Neuropsychological composites", "text": "The ADNI neuropsychological protocol, including calculation of episodic memory and executive function composite measures, has been reported previously (Crane et al. 2012; Gibbons et al. 2012 Tissue-specific predicted gene expression Genotyping was performed using the Illumina HumanOmni 2.5 BeadChip (Illumina, Inc., San Diego, CA). Quality control was performed using PLINK (http://pngu.mgh.harvard. edu/purcell/plink; Purcell et al. 2007 ) and included applying a 98 % threshold for genotyping efficiency and a minimum minor allele frequency of 0.01. Participants were excluded if they had a call rate < 98 %, if there was a reported versus genetic sex inconsistency, or if relatedness to another sample was established. Population structure was analyzed using the fastStructure software package (Raj et al. 2014) .\nTissue-specific gene expression profiles were quantified using the PrediXcan procedure (Gamazon et al. 2015) . PrediXcan uses reference transcriptomic data to impute tissue-specific gene expression profiles. Scripts are freely available online (https://github.com/hakyimlab/PrediX can/tree/master/Software). For the present analysis, we focused on all heart and brain tissues available through the Genotype-Tissue Expression (GTEx) Project given the importance of both heart (Jefferson et al. 2015a; Jefferson et al. 2010 ; Jefferson et al. 2015b ) and brain in AD. Specifically, we considered predicted gene expression level estimates for anterior cingulate gyrus, aorta, tibial artery, atrial appendage, basal ganglia, cerebellum, coronary artery, cortex, frontal cortex, hippocampus, hypothalamus, left ventricle (heart), nucleus acumbens, putamen, and whole blood. Gene expression profiles were imputed based on the previously published multi-SNP equations identified using elastic net (all databases are available through the PrediXcan webpage). We restricted imputation to genes with R 2 ≥ 0.15 in elastic net prediction models based on previously completed power simulations in the seminal PrediXcan manuscript (Gamazon et al. 2015) . A list of all genes evaluated and the imputation quality of each is presented in Supplementary Table 1."}, {"section_title": "Statistical analyses", "text": "All statistical analyses were performed in R (RStudio version 0.99.485; https://www.rstudio.com/; R version 3.0.1). Participant demographic and clinical characteristics were summarized and compared across baseline diagnostic categories (normal cognition, mild cognitive impairment) using independent sample t-tests for continuous variables and Pearson's χ 2 for categorical variables. Genetic modifiers of the association between amyloid and change in cognition were evaluated using mixed-effects regression models with either composite memory performance or composite executive function performance set as the quantitative outcome. Fixed effects included baseline age, sex, years of education, mean SUVR, predicted gene expression, and a 3-way interaction for age x mean SUVR x predicted gene expression (including all lower order 2-way interactions). Random effects included the intercept and age. Correction for multiple comparisons was performed using the Bonferroni procedure based on the total number of unique gene-tissue combinations evaluated (13,300 total tests, corrected α = 3.76 × 10"}, {"section_title": "−6", "text": "). Post-hoc analyses were performed for all significant hits to assess additional confounding factors. First, analyses were rerun covarying for the number of APOE ε4 alleles to assess whether APOE variation explained the observed effects. Second, sex-stratified analyses were performed to evaluate sex-specific effects. Third, analyses including the first 5 principal components from population structure analysis were included to adjust for potential population stratification effects. We also reran all analyses restricting to the White participants based on self-reported race and ethnicity to further ensure such stratification effects were not driving our result. Finally, additional validation analyses (see Supplemental Materials) were also performed in independent subsamples of the ADNI dataset in which we replaced the original amyloid metric with amyloid measured using Pittsburgh compound B (PiB) or measured in CSF.\n). When restricting analyses to White participants, the magnitude of effects dropped slightly, likely due to the reduction in power, but all interactions remained significant (p-values < 5 × 10"}, {"section_title": "Results", "text": "Demographic characteristics are presented in Table 1 . Participants were followed for an average of 2.34 years (range: 0-4 years) after the baseline visit. Expected diagnostic differences were observed in amyloid load, memory performance, and executive function performance.\nAs expected, we observed a significant association between baseline amyloid deposition and longitudinal agerelated change in both memory (t(2384) = −2.29, p = 0.022) and executive function performance (t(2369) = −2.36, p = 0.018).\nIn the longitudinal memory analyses, we observed four gene interaction effects. Two effects were with predicted gene expression levels in the atrial appendage: Protease, Serine 50 (PRSS50; t(1865) = 5.02, p = 5.6 × 10 ). Lower PROK1 expression was associated with an attenuated effect, while lower PRSS50 predicted expression was associated with an enhanced effect of baseline amyloid deposition on longitudinal decline in memory. The remaining two effects were with predicted expression levels in coronary artery tissue: centlein (CNTLN; t(1865) = −4.81, p = 1.6 × 10 −6 ) and prokineticin 1 (PROK1; t(1865) = −4.80, p = 1.7 × 10 −6\n). In both cases, lower predicted expression was associated with an attenuated effect of baseline amyloid deposition on longitudinal change in memory.\nIn longitudinal executive function analyses, two significant interactions were observed, including transmembrane channellike4(TMC4)inthebasalganglia(t(1853)=−4.79,p=1.8×10 ; Fig. 2 ). Lower expression of TMC4 and higher expression of HMBS were associated with an attenuated effect of baseline amyloid deposition on longitudinal change in executive function. All associations evaluated are presented in Supplementary Table 2 .\nIn post-hoc analyses, all six observed effects remained statistically significant when covarying for the number of APOE ) and when including a 3-way APOE ε4 x age x amyloid interaction in the model (pvalues < 5 × 10"}, {"section_title": "−5", "text": "). In sex-stratified analyses, a sex difference was observed in the longitudinal memory analysis whereby a significant interaction between PROK1 (in both the atrial appendage and the coronary artery) and amyloid was observed among females (p-values < 1.5 × 10 −5 ) but not among males (p-values > 0.10). We did not observe a sex difference in raw predicted expression levels of PROK1 in either tissue. No other sex differences were observed among the identified genetic effects. In analyses covarying for population stratification (i.e., the first five principal components), our main findings remained unchanged (p-values < 3.8 × 10\n). In post-hoc validation analyses, although somewhat under powered when restricting the analyses to non-overlapping subsets of the cohort, we did observe additional evidence of an interaction between predicted PROK1 expression in the Table 3 , p-values < 0.05) and between predicted HMBS expression in the aorta and amyloid on longitudinal executive function (Supplemental Table 3 , pvalues < 0.05) in both PiB and CSF Aβ-42 analyses."}, {"section_title": "Discussion", "text": "The present manuscript evaluated genetic resilience to amyloid-related cognitive impairment using a predicted gene expression methodology (Gamazon et al. 2015) . Our results suggest that genetically-determined expression of five novel candidate genes in heart and brain tissue attenuate the downstream effects of amyloid deposition. Importantly, these results also provide a proof of concept for the application of predicted expression methodology in the context of genetic resilience analyses in AD. It is quite interesting that all four significant gene interactions on memory were from imputed expression levels in heart tissue (the coronary artery and atrial appendage). While the association between peripheral vascular disease and AD is well established (Beeri et al. 2006; Jefferson et al. 2015a; Jefferson et al. 2010; Jefferson et al. 2015b) , the mechanisms underlying such associations remain elusive. Our findings suggest that the genetic architecture of the heart may indeed be relevant to individual susceptibility to amyloid-related cognitive decline. The three genes identified, PRSS50, CN TLN , and P RO K1 are promising can didates. Unfortunately, we were only able to provide partial validation of these associations in small independent subsamples of the ADNI cohort, highlighting the need for future replication in larger datasets. The serine protease PRSS50 has not been implicated in AD previously. Methylation differences in PRSS50 have been noted in age-related macular degeneration (Oliver et al. 2015) , and PRSS50 has been shown to induce apoptosis when knocked down in cancer cells (Zhou et al. 2010) , suggesting a potential role in neurodegeneration. The highest expression of PRSS50 is observed in the testis, thyroid, and pituitary. Very low levels of expression are observed in the atrial appendage (Lonsdale et al. 2013) , and it remains unclear how expression of PRSS50 in the heart may relate to amyloidrelated cognitive decline.\nCNTLN codes a centrosomal protein that shows cell-cycledependent localization within centrosomes (Makino et al. 2008) . Centrosomes are critical for microtubule organization and genetic stability (Makino et al. 2008 ) and play a crucial role in neuronal development (Kuijpers and Hoogenraad 2011) . Microtubule disorganization is a mark of the abnormal phosphorylation of tau, providing a possible connection between centrosome and tau pathology (e.g., Alonso et al. 1994) . There is also evidence that both the amyloid precursor protein and presenlin 1 are part of a signaling cascade at the centrosome that regulates the cell cycle (Nizzari et al. 2007 ). Although cell cycle alterations appear to be an important aspect of the AD cascade (Moh et al. 2011 ), additional work is needed to clarify whether such amyloid-related alterations in cell cycle activity in the heart may mediate downstream neurofibrillary changes in the brain. The present results suggest that genetic expression of CNTLN in the heart is relevant to amyloid-related cognitive deterioration. It is also interesting to note that intronic variants in CNTLN have been associated with left ventricular hypertrophy, a cardiac condition that has also been associated with age-related cognitive decline (Jefferson et al. 2015a) .\nPROK1 is another interesting candidate gene. PROK1 is most commonly expressed in steroidogenic glands (LeCouter et al. 2002) , although it is also expressed in astrocytes and neurons (Zhang et al. 2014) , and has a tissuespecific role in angiogenesis (LeCouter et al. 2002) . PROK1 levels are significantly reduced in embryonic neuronal cell cultures when treated with Aβ-42 (Romito-DiGiacomo et al. 2007) , suggesting a direct association between amyloid and PROK1. Unfortunately, we were not able to impute PROK1 in any brain tissues in the present analysis, making it difficult to speculate on the role of PROK1 in relation to plaques and tangles.\nPROK1 is also called endocrine-gland-derived vascular endothelial growth factor (EG-VEGF) as it is indistinguishable from VEGF. While the present study indicates a detrimental effect of predicted expression of arterial PROK1 on longitudinal memory, previous work has demonstrated a neuroprotective effect of CSF VEGF levels in modifying the association between AD biomarkers and longitudinal change in cognition, particularly in interacting with CSF Aβ-42 on longitudinal memory (Hohman et al. 2015) . This discrepancy may be due, in part, to the fact that there is mixed epidemiological evidence of risk and resilience when measuring VEGF. High levels of serum VEGF have been associated with an increased risk of stroke (Pikula et al. 2013 ) and more frequent cerebral microbleeds among individuals with Alzheimer's disease (Zhang et al. 2016) , while CSF VEGF levels have been reported to be higher (Tarkowski et al. 2002) , lower (Guo et al. 2013) , and equivalent (Blasko et al. 2006 ) among individuals with AD compared to controls. Perhaps VEGF-related genes like PROK1 will provide clues to help unravel the complex associations among VEGF, cerebrovascular disease, and AD. Future work validating the interaction observed here and investigating gene-gene interactions previously reported between PROK1 and VEGF (Su et al. 2014 ) may help move the field forward.\nThere also appears to be a sex difference in the effect of PROK1 on amyloid-related cognitive decline. In post hoc analyses the interaction between PROK1 and amyloid was restricted to females. This sex-specific effect is particularly interesting given the known sex differences in the association between AD biomarkers and longitudinal change in cognition (Koran et al. 2016 ) and the fact that PROK1 is hormonally mediated under certain circumstances (Brouillet et al. 2012) . Importantly, the present finding of a sex difference reemphasizes the need to evaluate AD risk and resilience in a sex-specific manner (Koran et al. 2016) .\nIn executive function analyses, we identified an interaction between amyloid and HMBS expressed in the aorta. Importantly, we also observed additional evidence of such an interaction in our validation analyses across two independent subsamples of the ADNI cohort using two additional methods for measuring amyloid levels, providing additional confidence in the validity of the observed effect. HMBS codes a protein required for the biosynthesis of heme, and it has been shown to be down-regulated in AD, particularly among homozygous carriers of the APOE ε4 allele (Dwyer et al. 2009 ). However, the HMBS effect remained statistically significant even after adjusting for APOE. While past work has highlighted the possible role of cerebral heme biosynthesis in AD, our results within the aorta suggest that peripheral heme may also be relevant to clinical progression in AD that may reflect central heme processes.\nThe second identified interacting gene was TMC4 expressed in the basal ganglia. Validation results provided mixed evidence of such an interaction in independent subsamples of the dataset using additional metrics of amyloid levels, suggesting a need for future replication analyses in larger datasets. The basal ganglia is a plausible candidate region given its known role in executive function (e.g., Cummings 1993; Graybiel 2000; Monchi et al. 2006 ) and the known association between basal ganglia damage and executive function deficits (Elliott 2003) . TMC4 is another interesting candidate gene, although its proximity to the APOE locus leaves open the possibility of a confounding effect of APOE. However, in post-hoc sensitivity analyses, the TMC4 interaction remained statistically significant when adjusting for both APOE ε4 status and the interaction between APOE ε4 and amyloid, suggesting a unique contribution of TMC4 on AD progression. TMC4 is a paralog of the TMC gene family associated with hearing loss (Kurima et al. 2003) , but it has not been implicated in AD previously.\nThe present results highlight the potential of predicted gene expression analyses to help further delineate the genetic architecture of AD. In neurodegenerative diseases, it is often difficult to take a full organism approach and consider peripheral changes that drive disease risk and progression. Our results add to a growing literature on the relevance of heart health on AD progression and further emphasize the need to consider pathways in which non-brain genomic alterations may have upstream effects that impact AD. That said, additional work is needed to validate the present results and improve predicted gene expression analyses for AD and other diseases of aging.\nThe present expression imputation models were based on data from a well-characterized sample from the GTEx database. However, the brain sample in particular included a large proportion of individuals over age 60, leaving open the possibility that some individuals may have been in the preclinical phases of AD. The ADNI sample also has strengths and limitations. The availability of AD biomarker data, genetic data, and comprehensive neuropsychological data, including documented AD status made this an ideal cohort for analyzing genetic modifiers of AD biomarker effects. However, the ADNI cohort is predominately comprised of highly-educated, non-Hispanic White individuals, limiting generalizability to other cohorts. Additionally, the present analysis had a relatively short follow-up period (2.3 years) and a relatively small sample size, suggesting that we may have lacked the statistical power needed to identify additional loci. Additional effort is needed to harmonize amyloid, cognitive, and genetic data from a variety of sources to increase statistical power and identify new pathways of resilience. Future work is also needed to extend these models to more diverse cohorts and to understand how and to what degree the inclusion of individuals with early preclinical AD changes may alter the PrediXcan prediction models.\nIn conclusion, predicted levels of gene expression in the coronary artery, aorta, atrial appendage, and basal ganglia are relevant to amyloid-related cognitive decline. Our findings highlight a few novel candidate genes of resilience while providing additional evidence that the cell cycle, angiogenesis, and heme biosynthesis play a role in AD progression."}]