[{"section_title": "Abstract", "text": "For the first 13 years after entry, the hazard rate for firm exits is persistently higher for urban than rural firms. While differences in observed industry market, local market and firm attributes explain some of the ruralurban gap in firm survival, rural firms retain a survival advantage 25% greater than observationally equivalent urban firms. In competitive markets, the remaining survival advantage for rural firms must be attributable to unobserved factors that are known at the time of entry. One plausible candidate for such a factor is thinner markets for the capital of failed rural firms. The implied lower salvage value of rural firms suggests that firms sorting into rural markets must have a higher probability of success in order to leave their expected profits equal to what they could earn in an urban market. \nFor the first 13 years after entry, the hazard rate for firm exits is persistently higher for urban than rural firms. While differences in observed industry market, local market and firm attributes explain some of the rural-urban gap in firm survival, rural firms retain a survival advantage 25% greater than observationally equivalent urban firms. In competitive markets, the remaining survival advantage for rural firms must be attributable to unobserved factors that are known at the time of entry. One plausible candidate for such a factor is thinner markets for the capital of failed rural firms. The implied lower salvage value of rural firms suggests that firms sorting into rural markets must have a higher probability of success in order to leave their expected profits equal to what they could earn in an urban market."}, {"section_title": "I. Introduction", "text": "Entrepreneurship is increasingly being identified as a key determinant of future economic growth. 1 In turn, the growth only occurs if the pace of entrepreneurial entry exceeds the rate of firm exits. Even areas with relatively slow firm birth rates may experience economic expansion if local firms survive and grow. That simple observation turns out to have key implications for rural economic development.\nIn Figure 1 , we illustrate the stylized facts that motivate this study. Firm entry and exit rates are plotted for the five most rural and the five most urban states in the United States. As is widely known, the rural states consistently have lower firm entry rates than do urban states. Perhaps surprisingly, it seems that the rural states also have lower firm exit rates than the urban states. Furthermore, in almost all years, the rural firm exit rate is lower than the rural firm entry rate, and so we have net additions of rural firms. 2 This study shows that more rigorous tests corroborate that rural firms have greater chance of survival than urban firms and then examines the reasons behind the lower rural firm exit rate. Understanding why rural firms are more likely to survive is critical to develop policies that could increase net rural entrepreneurial activity and economic growth.\nEconomists have long established that business survival is influenced by firm and industry characteristics. recent examples of this literature. 2 We get similar patterns when we replicate the graph with the ten most and least rural states, but the urban-rural entry and exit rates are more similar. 3 Examples include Mahmood (1991, 1994) , Mata and Portugal (1994) , Taylor (1999) and Esteve-Pérez and Maňez-Castillejo (2008).\nwhether business location matters for business survival, and a few of these have examined survival differences in urban and rural markets.\nOne might expect that urban establishments would have numerous advantages over their rural counterparts. Urban markets are characterized by knowledge spillovers across firms and workers, a large customer base, easy access to information on new technologies, easy availability of differentiated skills in the labor markets, close proximity to suppliers, and superior transportation, telecommunication, and energy infrastructure. These factors contribute to the consistently higher firm entry rate in urban markets.\nHowever, it is not obvious that all factors favor urban firm survival. Moretti (2004) showed that agglomeration economies in urban areas are offset by higher input costs such as wages and rents. Acs and Malecki (2003) suggested that modern information technologies allow successful firms to use nonlocal networks of customers and suppliers, reducing the importance of agglomeration for firm success. Reiss (1990, 1991) and Arenius and Clercq (2005) argued that in the smallest populated markets, firms can charge monopoly prices. As community population rises, firm entry and heightened competition quickly dissipates firm power to set prices above marginal costs. Indeed, the few studies using longitudinal data on newly born firms seems to support either equal or higher survival rates for rural firms.\nIn the U.S., Buss and Lin (1990) found higher rural than urban firm survival rates in\nArkansas and virtually identical firm survival rates in rural and urban Maine."}, {"section_title": "Stearns et al(1995) report higher rural firm survival rates in Minnesota and", "text": "Pennsylvania. Plummer and Headd (2008) found statistically significant lower rural firm death rates, although the differences were very small. Corroborating evidence comes from Acs and Malecki's (2003) finding that start-up firms are more likely to grow rapidly in the most rural Labor Market Areas. Similar results are reported in West Germany. Fritsch et al (2006) found that firm survival rates decline with increased population density; and Falck (2007) found that firms in the most remote regions are less likely to exit. Therefore, the few longitudinal studies that examined rural and urban firm survival are consistent with the surprising pattern in Figure 1 :\nrural firms live longer than urban firms.\nThis study uses longitudinal data on all firms born in Iowa to examine the source of the rural firm survival advantage. 4 The Iowa data are particularly suited to address why rural firms live longer. Iowa's 99 counties span all the USDA Rural-Urban Continuum Codes from the most remote rural to metropolitan county designations, providing a suitable range of market sizes. Most importantly, the Iowa data mimic the national pattern of higher rural firm survival rates. Figure 2 shows the proportion of Iowa urban and rural firms that are still in business six years after entry. Seven firm birth-year cohorts are presented, and in all but one, rural firms have a higher survival rate after six years. The higher rural survival rate occurs despite the fact that the Iowa urban firm survival rate is already higher than the national average.\nOur study focuses on one firm cohort, the universe of nonagricultural establishments that opened for business in Iowa in 1992. The use of a single cohort holds constant the macroeconomic conditions that prevailed at the time of entry. The data is longitudinal which allows us to follow the firms for 13 years. Because two-thirds of U.S. firms fail within 6 years, the period is sufficiently long to establish whether any differences in survival are permanent or transitory. 5 By holding industry and firm age fixed, we can measure the rural survival advantage holding constant differences in industry life cycle (Agarwal and Gort, 1996) and opportunities for learning-by-doing (Jovanovic and Lach, 1989) . We can also hold fixed regional characteristics, observed and unobserved firm attributes, and factors influencing the strength of the local and industry markets.\nOur analysis of the Iowa firm data shows that both rural and urban firms face concave exit rates with peak exits at about 5 years. Over the first 13 years after entry, the hazard rate for firm exits is persistently higher for urban firms. Even after controlling for differences in firm, local market and industry factors between urban and rural firms, the rural firms retain a survival advantage over urban firms.\nThe remaining advantage to rural firms is attributable to differences in unobserved, time invariant attributes that exist at the time the firm is born. We argue that the source of this survival advantage is plausibly found in thinner markets for capital in rural areas that lead to a lower salvage value for failed rural firms.\nBecause firms have to take the possibility of failure into account at the time of entry, rural firms must have a higher probability of success in order to leave expected profits 5 equal across rural and urban markets."}, {"section_title": "II. The Iowa Longitudinal Firm Database", "text": "We require longitudinal data on firms from date of entry to exit. An advantage of the NETS database is that it provides detailed information on each establishment's characteristics at the time of firm birth. This information allows us to control for factors that have been shown to be important in explaining business survival such as firm ownership and firm size Mahmood, 1995, Mahmood, 2000) , but at the time of entry rather than later in the firm life cycle.\nThis side-steps difficulty caused by time varying firm attributes that change 6 The observation unit in the NETS database is the establishment, which might be a stand-alone firm;\none of several branches of a multi-plant firm, or the headquarters of a multi-plant firm. The link between subsidiary establishment and parent firm can be identified, and so we can distinguish the performance of branches and subsidiaries from the performance of independent establishments. We use the terms 'firm' and 'establishment' interchangeably which holds for the majority of observations.\nHowever, we do have establishments that are branches of firms. Our results are virtually identical when we only include the stand-alone firms in the analysis.\nendogenously as each firm's path toward survival or death progresses. We also have an unusually long time series on each firm, allowing us to follow firms for more than twice the median life of firms in the United States.\nAddress information on each firm is used to identify the firm's county of residence which we take to be its primary consumer market. We also use the county designation to merge additional county-level data that measures local market as rural) over our sample period. We prefer to use the start-of-period rural classification because counties that foster firm profitability will grow faster, making end-of-period county RUCC endogenous.\nOur results are similar if we exclude the establishments in the ten counties that changed rural classification. We also show that our results are not sensitive to changes in how we classify counties.\nas 'rural'. Figure 2 tell the same story as the Iowa data: survival rates for rural firms are significantly higher than for urban firms.\nSince the necessary longitudinal firm-level data is not available nationally, we use the Iowa data to examine why rural firms live longer than urban firms. Because the difference in rural-urban firm survival may reflect systematic differences in the types of firms found in those markets, we require a more structured analysis to see whether rural firms really have a higher rate of survival, controlling for firm specific characteristics, business types and local market attributes."}, {"section_title": "III. Survival Model", "text": "Define T to be a random variable measuring the length of time a firm remains in business. We assume T has a log-logistic distribution. The probability that firm i survives at least i t periods is :\nwhere ) \n, an increase in one 11 We thank Art Hall of the University of Kansas' Center for Applied Economics for making these data available to us. 12 The parametric log-logistic survival function is specified according to its bell shaped hazard rate curve. . While some studies found that hazard rates fell monotonically with establishment age (Fritsch, Brixy and Falck, 2006; Evans, 1987) , more recent empirical studies have found a concave hazard rate pattern (Mahmood, 2000; Falck, 2007) . The log-logistic model fits the data well. Our conclusion is based on a common diagnostic tool that plots the Cox-Snell residuals against the cumulative hazard of the covariates ij x , holding other covariates constant, will result in an increased likelihood of survival. In contrast, j β <0, indicates an accelerated probability of failure. The parameter 0 > γ controls the shape of the hazard function. When γ >1, the hazard rate is monotonic in duration. If 0< γ <1, the estimated hazard rate will first increase and then decrease with time, as data presents.\nThe hazard rate, according to definition (1) is given by\nThe log likelihood is\nwhere ) , , (\nis the probability density function of survival duration T ; and d is a binary variable, equal to one if the establishment exits from the market.\nThe model above assumes that each individual establishment is exposed to the same risk once characteristics i x are controlled. However, there may be unobserved factors that influence the mortality of establishments. For example, Jovanovic (1982) assumes firms are heterogeneous in their abilities to learn-by-doing, creating a mixture of firms that differ in productive efficiency. Over time, the inefficient firms decline and fail and the efficient firms grow and survive. If the population is a mixture of individual establishments with different failure risks that are ignored in the estimation, the hazard rate tends to be underestimated (Hougaard, 1986, Omori and function (Klein and Moeschberger, 1997) . Other parametric functional forms, such as the Weibull, Log-normal, and Gamma were also investigated and rejected. . In addition, the Cox (1972) proportional semi-parametric hazard model does not fit the data well because the proportional assumptions are violated in general and for nearly half of the covariates included in the estimation."}, {"section_title": "Johnson, 1993).", "text": "This unobserved heterogeneity is measured by a new random variableα which is called establishment frailty. It is incorporated into the individual hazard function as\nWe assume α is drawn from an Inverse-Gaussian distribution with mean one and variance θ. 13 The cumulative effect ofα describes an individual establishment's idiosyncratic exit risk.\nEstablishments with 1 > α are more frail for reasons that are uncorrelated with the covariates x i that are included in the estimation. Bad draws on α create a permanent increased risk of failure for the life of the firm, and could reflect bad luck, bad management, poor technology choices, or any other unmeasured adverse factor.\nFirms with good α draws will have 1 < α which permanently raises their probability of survival, all else being equal (Gutierrez, 2002) . As time passes, the establishments tend to become more homogeneous because frail establishments die earlier than robust ones (Vaupel, et al, 1979) .\nIf θ =0, there is no heterogeneity across establishments and so the estimation reduces to the survival function (1) and log likelihood function (3). In contrast, non-zero θ implies that firms differ in unobservable relative risk of failure. Inclusion of frailty is necessary to capture the excess dispersion in firm hazard rates.\nThe survival function with heterogeneity incorporated is given by\nThe log-likelihood with Inverse-Gaussian distributed heterogeneity is the following,\nwhere\nis the corresponding probability density function of\nUnder either model specification (3) or (5), we can also consider the effect of observable local market characteristics on firm longevity. Factors that have been identified as contributing to economic growth more generally, such as the education level of the local workforce, strong local markets for credit or product demand, and natural amenities, enter the vector i x . That allows us to test our first hypothesis:"}, {"section_title": "Hypothesis 1: Business survival depends on favorable local economic, labor market and environmental conditions.", "text": "Our primary interest is in assessing whether the impact of these local factors on firm survival differs between urban and rural areas. We can investigate that possibility by altering how the vector of local factors enters the analysis. "}, {"section_title": "IV. Covariates that may influence firm survival", "text": "The variables included in the vector i x represent firm, community and industry characteristics that are believed to affect firm survival. Summary statistics by firm rural status are presented in Table 1 ."}, {"section_title": "Location specific characteristics", "text": "The abundance of local labor, capital, information, or material is critical to the operation of new firms (Stearns, et al 1995) . Stable and healthy development of a local economy should also increase the likelihood that an establishment can survive.\nWe introduce several factors that represent a firm's local economic environment. We treat a county as the local market in which a firm resides. The 99 counties of Iowa are of roughly comparable size, and so these measures will reflect similar geographic boundaries surrounding the firm.\nHigher Education is the percentage of the 1990 county population aged 25 and over with a college degree. Establishments can benefit from knowledge spillovers which create innovations, generate external learning-by-doing, reduce search costs, and potentially reduce the hazard of failure (Moretti, 2004) . At the same time, more educated residents have more disposable income which translates to higher and more diversified demand for local products and services.\nLocal Capital is measured by per capita bank deposits in the county in 1998.\nThe measure indicates the availability of loanable funds in the local credit market.\nWhile it may seem that credit markets are very efficient at locating and funding promising ventures, banks could play an important role in disseminating information on such opportunities in small or isolated market.\nDebt is the log of per capita local public debt in a county. This could be viewed as a measure of expected future tax obligations that must be paid by firms and residents. Heavier tax obligations lower local customer discretionary income and add cost to local firms, both of which may lower the probability of survival. Both\nDebt and Local Capital emphasize the effect of liquidity constraints faced by entrepreneurs. Holtz-Eakin, et al (1994) found that liquidity constraints reduced the viability of entrepreneurial enterprises.\nAmenity is an index from one to seven which represents the quality of natural amenities in the county. As defined by the Economic Research Service of the USDA, a higher number means better weather and better access to naturally occurring topographic or geological features. Water measures the water coverage in a county.\nHigher levels of amenity and more water in a county may attract employment and tourists. Henderson (2007) finds that local growth is enhanced by better amenities and water coverage in a local region.\nHighway is a dummy variable indicating that the county has an interstate highway.\nThe presence of transportation infrastructure reduces the average cost of production for firms by reducing distribution costs and input acquiring costs from the distant markets and supports the local employment growth (Henderson, 2007) ."}, {"section_title": "Individual establishment specific characteristics", "text": "We include several firm attributes that may affect the firm's prospects for survival.\nAll are measured at the time of birth to minimize the possibility of reverse causality because factors such as firm size or ownership structure may change over time as the firm prospers or struggles. The NETS database identifies establishment specific characteristics, such as initial establishment size and ownership that may influence the likelihood of survival. Firm size at the time of birth has been hypothesized to raise survival prospects because larger firms have advantages in raising capital, face better tax conditions, and are in a better position to recruit qualified labor (Mahmood, 2000) .\nInnovation rates and technology adoption intensity are found to be positively related with the survival probabilities of establishments (Audretsch and Mahmood, 1994 , and Mahmood, 2000 . Additionally, because large firms tend to adopt more advanced technologies in the early stage of technology diffusion, they are more likely to survive than small firms. Finally, the larger sunk costs associated with opening a larger firm implies a higher prior expectation of profitability. Consequently, greater survivorship may simply reflect sorting on expected profits at time of firm birth (Frank, 1988 A second factor that may affect firm survival is ownership structure (Audretsch and Mahmood, 1995) . Establishments in our dataset can be independent single entities; a branch or subsidiary of a multi-establishment firm; or the headquarters of a multi-establishment firm. Branches or subsidiaries are more likely to survive than independent firms because branches benefit from the experience and reputation of their parent firm. Of our new business cohort in 1992, 67.6% are independent establishments and 31.0% are branches. "}, {"section_title": "Sector-specific market growth and industrial structure", "text": "A firm should find it easier to survive in a sector with increasing demand.\nIndustry Growth is measured by the annual percentage change in the wage bill for the national two digit industry between 1992 and 2005.\n14 Data are compiled from 14 We get similar results when we use employment growth as the measure of industry growth.\nBureau of Economic Analysis, U.S. Department of Commerce. We expect that establishments are more likely to be viable in industries that are experiencing higher growth. "}, {"section_title": "Concentration", "text": ""}, {"section_title": "V. Empirical Results", "text": "Regression results from the survival model specified in equation (5) are shown in Table 2 . The estimated shape parameter γ is 0.4 and statistically significant, supporting our use of the log-logistic specification. The implied hazard function for firm failures is concave, as shown in Figures 3a-3c discussed below.\nThe variance of the Inverse-Gaussian frailty θ is about 2 and a likelihood ratio test easily rejects the hypothesis that individual establishments have a homogeneous exit rate distribution after controlling for the observables. That implies significant time-invariant unobserved traits that affect the likelihood of firm survival. Because firms differ in frailty, firms born with a bad α draw cannot compete and are forced to exit the market. The process continues until vulnerable establishments are shaken out, and only the strong establishments with good α draws remain. These results suggest that the process driving firm exit or survival is best approximated by equation (5) . groups, those adjacent to a metro and the rest being more remotely sited, we find that nonmetro firms, whether adjacent to or not adjacent to a metro county, have similar survival advantages over firms in metro areas. Our conclusion that rural firms have higher survival rates is not altered by choice of rural designation. A sample hazard function for urban and rural firm exits is shown in Figure 3 (a): rural firms consistently have lower likelihood of failure through at least the first nine years after firm birth."}, {"section_title": "Effects of firm attributes, location, and industry characteristics on survival", "text": "Inspection of Table 2 shows that the covariate effects are robust to changes in measure of rurality. Survival probability is significantly affected by firm attributes and industry fixed effects. Consistent with previous findings, bigger establishments at birth are the least likely to fail. Figure 3(b) shows that the medium and large establishments have much lower exit hazard rates than do small establishments. The mortality rate peaks at four to five years for small establishments. However, the critical duration extends to six to seven years for medium establishments and to seven to eight years for large establishments. Once establishments survive eleven years, they are exposed to very similar low mortality rates, regardless of initial size.\nAlso consistent with previous findings, establishments born as branches or subsidiaries are more likely to survive. Headquarters with multiple branches, once in the market, are more likely to survive than independent establishments. Their estimated hazard functions are shown in Figure 3 (c). The maximum mortality for independent firms peaks at age four. However, the maximum hazard for branches and headquarters peaks in their seventh year. Firm survival and exit rates differ significantly across industries. Firms survive more readily in industries with faster growth nationally. 15 .\nPanel A in Table 3 extends the baseline models in Table 2 by adding attributes of the local market. Firm and industry characteristics are also controlled, but their effects are similar to those reported in Table 2 and are omitted to conserve space.\nThe only local market factor that consistently affects firm survival, consistent with Hypothesis 1, is that firm survival prospects improve with higher proportions of college graduates. In addition, factors such as local access to loanable funds or highways do not affect firm survival, nor do water amenities or other natural amenities. 16 Even after adding these additional controls, we still find a significant rural-urban 15 Because the variable of industry growth rate is measured at the 2-digit NAICS level, it is linearly related with industry dummies. In the following analysis, we adopt industry dummy variables instead of growth rate to include industry fixed effect, though using either of them will not alter our conclusions, as shown in Panel A and Panel B in Table 2 . 16 There is not much variation in amenities across these counties, and so the lack of importance in this application may not hold for samples with greater variation in local amenities.\nsurvival differential. We now find a larger survival advantage for nonmetro firms with an even larger advantage for firms in more remote counties. The rural survival puzzle remains."}, {"section_title": "Why might rural firms live longer?", "text": "The conclusion from Tables 2 and 3 is that Hypothesis 2 cannot be rejected. As shown in Table 3 , nonmetro firms have a 25.4% higher survival odds that is significant at the 5% level. 17 Why might a rural firm tend to live longer than an otherwise observationally equivalent urban firm? In competitive markets, a known persistent higher probability of rural firm survival must be accompanied by a higher cost of rural firm entry in order to leave expected profits equal at the margin across urban and rural markets. Our task is to suggest a plausible candidate for the higher rural entry cost.\nWe suggest that the most likely candidate is a weaker market for the capital of failed rural firms that lowers the expected salvage value of a rural firm at the time of entry compared to the salvage value of that same firm in an urban market. It is commonly known that low population density and poor access to educated labor, capital and infrastructure deter rural firm entry . But those same factors limit the potential market for the plant and equipment of the rural firms that do enter 17 Average survival odds are defined as and subsequently fail. The lower expected salvage value of rural firms at the time of entry implies that rural firms must have a higher probability of success to justify opening business in the rural rather than in the urban market. 18 To make a simple example that clarifies the argument, suppose that a firm considering investing $K in an urban (U) or rural (R) market is exactly indifferent between the two sites. If the project succeeds, they expect to earn the same expected profit rate in both markets. Expected profit rate conditional on survival is\nwhere E is earnings net of operating costs 19 .\nAt the time of entry, the firm also has to evaluate its expected loss if the project fails. The amount of the loss will depend on the resale value of the original investment, K. Once plant and equipment is put in place, it is expensive to move and so local markets could value placed capital differently, even if the costs of acquiring the plant and equipment are equal across markets. We expect that the salvage value of the plant and equipment would be a greater fraction of the original capital in urban than in rural markets, and so the profit rate conditional on failure would be\nis the proportion of salvage value over initial investment.\nis equivalent to the depreciation rate on the initial investment. 18 This notion is similar to the finding that barriers to exit such as firing restrictions or contracted length of service requirements serve as a barrier to firm entry (Agarwal and Gort, 1996 , Eaton and Lipsey, 1980 , Macdonald, 1986 ). 19 Note that higher land prices in urban than rural markets would mean that in urban markets, a larger share of K would be spent on land and in rural markets, a larger share would be spent on plant and equipment. Using j p as the probability of firm success in region j, and assuming that at the margin, expected economic profit rates must be the same at time of entry in both markets, we\n. This can only be true if\nHence, firms that sort themselves into rural markets will only do so if they expect a higher survival probability than they would in an urban market. In stronger markets, more marginal firms are willing to enter, and faltering firms are more apt to exit because they have ready access to new buyers willing to take over their salvage capital and make their own try at entrepreneurship.\nWe cannot test this hypothesis of lower capital salvage values in rural markets directly as we would require sales data on identical capital stocks of failed urban and rural firms. However, this simple example illustrates more generally that the pattern of lower firm entry and exit rates in rural markets suggests the existence of higher costs of entry in rural markets. . But this means that rural firms will now have a higher probability of entry because they are willing to accept an expected economic loss."}, {"section_title": "Indirect Tests of Higher Rural Costs of Entry", "text": ""}, {"section_title": "A. Correlation between Entry and Survival Rates", "text": "The hypothesis suggests a negative correlation between firm entry rates and firm survival rates, other things held fixed. To test this proposition, we define Entry1991 as the entry rate of new businesses in the county in 1991. The variable is measured by the number of establishments born in the county in 1991 divided by the total number of active establishments in the county in the beginning of 1991. Entry1991 should reflect the local costs of entry including the local depreciation rate on salvage capital in case of failure. We add Entry1991 into our extended survival model with results reported in Panel B of Table 3 . The coefficient is significantly negatively related with firm survival, consistent with our argument that lower expected salvage value in a thinner market would require a higher survival chance to leave expected profits at entry equal between urban and rural markets.\nNevertheless, we are only partially successful in eliminating the rural survival puzzle. After we control for Entry1991, our measures of rurality fall in magnitude by at least one-third, but ruality still retains significance at the 10% level in two of the three specifications. The nonmetro survival advantage implied by the estimates in the first column of panel B is smaller but not insignificant at 18.1%."}, {"section_title": "B. Correlation between unobserved propensity to locate in rural areas and firm", "text": "Consequently, tastes for rural location or low rural opportunity costs can explain a lower exit rate for rural firms, but they would also raise the rural entry rate, contrary to the pattern. Of course, rural markets can be characterized by these features along with a lower rural salvage value, and so our finding of a negative relationship between firm entry rates and probability of firm survival does not mean that the hedonic returns or low opportunity costs do not exist."}, {"section_title": "survival", "text": "From Table 1 we know that rural and urban firms are observably different. That raises a potential selection issue: the same factors that lead firms to locate in rural areas might also affect probability of survival. We use a bivariate probit model to model how firms jointly choose whether to enter a rural or urban market in 1992 and whether to stay in business through 2005. The decisions are based on the observed characteristics included in Table 2 . We exclude the location characteristics because they are selected jointly with the urban-rural location. The error terms include unobserved factors that sort firms into and out of business and into and out of rural markets. The results are shown in Table 4 .\nFirms that self select into rural areas are small, independent and owned by non-minority entrepreneurs. These rural firms are more likely to be in competitive industries. Larger establishments and branch plants or headquarters are more likely to choose urban markets. Manufacturing and mining firms atypically locate in rural areas while construction, wholesale, finance, real estate and professional firms select urban markets.\nHolding constant firm sorting into rural or urban markets, probability of firm survival is enhanced by firm size, being a branch or headquarters, and selecting markets where no incumbent firms have large market shares. Manufacturing firms are more likely to survive, consistent with the evidence found by Fritsch, et al (2006) . Nevertheless, the positive and significant correlation in the errors between the rural entry and firm survival equations mean that we still have a significant positive relationship between entering a rural market and firm survival, even after controlling for these observable firm and industry attributes. Unobserved factors that cause a firm to enter a rural market raise the likelihood of survival compared to an observationally equivalent urban firm."}, {"section_title": "21", "text": ""}, {"section_title": "VI. Conclusions and discussions", "text": "This study uses a unique longitudinal data set to analyze the factors that explain a previously unexplored phenomenon: the higher survival probability of rural establishments. We show that across states and across years within states, rural firms are less likely to exit. As one might expect, many factors actually favor urban firm survival: urban firms are bigger, have better access to local educated, are more likely part of a multiplant firm, and are more likely in growing sectors of the economy.\nNevertheless, after controlling for firm, industry, and regional market factors, there remains a significant survival advantage for rural firms that persists even 13 years after entry. The rural firm survival advantage in Iowa is also found in Kansas and in the U.S. as a whole.\nWe argue that a persistent survival advantage for rural firms has to be related to higher costs of entering rural markets. One plausible source of this higher entry cost would be a lower expected salvage value of capital should a rural firm go out of business compared to a comparable failing urban firm. At the time of entry, firms must take into account the possibility that they will fail and the resources they can still claim in the event they do not survive. Thin markets for capital in rural areas mean 21 We still find the positive correlation in the error terms when we add the location characteristics to the survival equation while excluding them from the rural-urban choice equation. that the same firm will expect lower salvage value in rural areas which requires that rural firms have a higher probability of success. Consistent with this hypothesis, markets with atypically high entry rates have lower rates of firm survival.\nAn important implication of our study is that higher rural firm survival rates do not imply an advantage for rural development. Firms sort into rural markets expecting the higher survival rate to compensate for the greater loss conditional on failure. Were there a mechanism to make it easier for rural firms to liquidate capital if they fail, more firms would enter rural markets. Because rural firm capital is fixed in place and expensive to move, it is not obvious how a rural jurisdiction could develop policies that would raise the salvage value of failed rural enterprises.\nInstead, rural policies should aim at lowering other costs of entry into rural markets to compensate firms for the lower salvage value conditional on failure.\nOur study indicates that presumed urban firm advantages of higher customer demands, lower search costs for information and lower production costs attributable to agglomeration (Glaeser, et. al, 1992) do not mean that urban firms are more likely to succeed, only that they are more likely to enter. Our study leaves open the question of the ultimate source of the rural survival advantage. Factors other than a lower salvage value for rural capital could also lead to a higher cost of entry into rural markets. Our analysis suggests that studies that seek information on relative firm entry costs should be particularly fruitful.\nRelated to that, there are few studies that examine the factors that lead to the persistently higher urban firm entry rates that are also apparent in Figure 1 . In particular, is this related to policies that favor firm entry (access to local tax abatement or technical assistance) or is it driven by economic factors that favor urban entry such as agglomeration economies or proximity to financial intermediaries? These longitudinal firm data sets should provide answers to those critical policy-relevant questions.\n22 22 We are indebted to a referee for pointing out this possible use of the NETS data. Analysis excludes the public administration, agriculture, utilities, and management sectors. Note: See footnotes in Table 2 ."}]