[{"section_title": "Abstract", "text": "Computer-Aided Diagnosis (CAD) of Alzheimer's disease (AD) has drawn the attention of computer vision research community over the last few years. Several attempts have been made to adapt pattern recognition approaches to specific neuroimaging data such as Structural MRI (sMRI) for early AD diagnosis. One strategy is to boost the discrimination power of such approaches by integrating complementary imaging modalities in a single learning framework. Diffusion Tensor Imaging (DTI) is a new and promising modality giving complementary information to the anatomical MRI. However, including relevant DTI information from such modality is a challenging problem. In this paper, we propose to extract local image-derived biomarkers from DTI and sMRI to construct multimodal AD signatures. To assess the relevance of such modalities as well as to optimize the classifier, we integrate complementary information using a Multiple Kernel Learning (MKL) framework for AD subjects recognition. To evaluate our method, we perform experiments on a subset from the Alzheimer's Disease Neuroimaging Initiative (ADNI) dataset. Both T1-weighted MRI and Mean Diffusivity (MD) maps from the DTI modality of 45 AD patients, 52 Normal Control (NC) and 58 Mild Cognitive Impairment (MCI) subjects have been used. The obtained results indicate that our multimodal approach yields significant improvement in accuracy over using each single modality independently. The classification accuracies obtained by the proposed method are 90.2%, 79.42% and 76.63% for respectively AD vs. NC, MCI vs. NC and AD vs. MCI binary classification problems. For the MCI classification problem, the proposed fusion framework leads to an average increase about at least 9% for the accuracy, 5% for the specificity and 15% for the sensitivity."}, {"section_title": "Introduction", "text": "Alzheimer's disease (AD) is the most common chronic neurodegenerative disorder and the first cause of dementia nowadays. Early detection of AD is of primary importance in biomedical research for providing a new therapeutics slowing its progression. Computer-Aided Diagnosis (CAD) tools for an automated and early AD detection are urgently needed to help clinician's decision. Medical information from structural Magnetic Resonance Imaging (sMRI) has long time been the most used neuroimaging modality to detect brain atrophy in AD studies [1] [2] [3] [4] . Recent studies have shown that combining several information sources from multiple neuroimaging modalities may carry complementary atrophy information and thus Contents lists available at ScienceDirect journal homepage: www.elsevier.com/locate/neucom may enhance the AD diagnosis accuracy [5] . In AD diagnosis research, usually two classic fusion strategies were applied to fuse features, namely early fusion and late fusion. The first strategy simply concatenates features extracted from different modalities and/or regions of interest (ROI) into a huge vector and then builds a classifier [6] [7] [8] [9] . However, the performance of early fusion could be affected by features that have low contribution and by the curse of dimensionality. Meanwhile, in the late fusion scheme visual features are extracted first from each modality. Then a classifier is trained separately on each modality as well. The outputs of classifiers are then combined for a final decision [10] [11] [12] [13] [14] . However, such methods are unable to exploit the correlations between the different modalities, since each modality is treated independently. Recent works provide an alternative by using a kernel-based machine learning technique known as Multiple Kernel Learning (MKL) [15] . The MKL aims to combine kernels derived from several sources of information [16] [17] [18] [19] [20] [21] [22] . A kernel implicitly represents a notion of similarity for the features. For instance, [19] proposed an MKL method that represents PET and Cerebrospinal Fluid (CSF) modalities as one or more kernels. Indeed, SVM model parameters and kernel combination weights are simultaneously optimized using the SimpleMKL algorithm [15] .\nIn [17] , MKL with Fourier transform on the Gaussian kernels has been applied to AD classification using both structural MRI and functional MRI (fMRI). In [18] , the authors proposed an SVMbased model to combine kernels from MRI, PET and CSF features. Their approach does not learn kernel coefficients. Instead, they use a grid-search method to select the optimal kernel weights which can be very time consuming. Ref. [23] integrates multimodal data (volumetric MRI, FDG-PET, CSF, and APOE genotype) with the classification process using of a mixed kernel to predict conversion of MCI patients to AD. In fact, the CSF features are biological measures obtained intrusively. In addition to PET, fMRI and CSF modalities, Diffusion Tensor Imaging modality has been used as a new MRI modality to detect micro-structural changes that remain not visible in anatomical scans. In DTI modality, the water diffusion in the brain is interpreted as MR signal loss. Effectively, the neurodegenerative process is accompanied by a loss of obstacles that restrict motion of water molecules [24] . Usually, DTI features are illustrated by scalar measurements calculated on two DTI-derived maps: the Fractional Anisotropy (FA) and the Mean Diffusivity (MD). The FA represents the degree of anisotropy of water diffusion while MD represents its magnitude. DTI is less expensive, safe and noninvasive unlike fMRI or PET modalities. Recent studies in AD diagnosis proved that combining information extracted from the DTI modality with other modalities such as sMRI [25] [26] [27] [28] or fMRI [13] improved the diagnosis performance. It is worth noting that most of the cited-above multimodal methods resorted to direct volumetric features or voxel-wise features to analyze the brain atrophy. However, volumetric and voxel-wise methods rely on large-scale structural changes and thus present significant limitations such as difficulties to reflect localized details of the scan. Indeed, the analysis of the MRI signal may therefore bring additional information to the early diagnosis of AD. In fact, MRI signal varies across tissue characteristics and/or types meaning that, for example, locally shrunk brain structures will display a different amount of GM and CSF compared with when they are healthy. Therefore, quantification of the amount of brain cell loss in terms of signal variation across individual brains may provide information about the disease. Recently, a family of local features-based methods has demonstrated impressive level of performance for Alzheimer's disease related atrophy description [3, 8, [29] [30] [31] [32] [33] [34] [35] [36] [37] [38] [39] . Those methods focus mainly on characterizing visual properties that can be computed from pixels and image patterns.\nReferring to the domain knowledge, the sMRI and the DTI modalities are used to assess respectively the micro-and macrostructural alteration of the hippocampus region [40, 41] . However, local features extraction from DTI-derived maps remains a challenging problem since this modality does not contain any anatomical information about the brain structure. The second challenge is how to efficiently integrate DTI features with complementary sMRI information. To the best of our knowledge, there is the first work that investigated jointly local DTI and MRI derived features to deeply capture hippocampal atrophy for AD/MCI subjects discrimination. In this paper, we propose a multimodal CAD system that simultaneously considers and integrates local image-derived biomarkers from MD and sMRI using a Multiple Kernel Learning framework. Our premise is that T1-weighted MRI and DTI data provide complementary information about hippocampus atrophy. The rest of this paper is organized as follows. Section 2 presents the overall proposed fusion framework for multimodal AD subjects classification. Section 3 describes the MKL fusion method. Section 4 presents the data used to evaluate our method. Experiments and results are reported in Section 5. Finally, we conclude and provide perspectives of this research in Section 6."}, {"section_title": "Methodology", "text": "We design a Multiple Kernel Learning (MKL) framework to combine visual features derived from sMRI and DTI images of brain. The proposed method consists initially in brain image processing which helps to overlay the DTI features onto an individual's own anatomy and select the hippocampus ROI. The hippocampus ROI is then selected using and normalized brain template. After that, the AD imaging biomarkers are extracted from the hippocampus area from both sMRI and MD images. Two kinds of features are extracted from the T1 weighted MRI; structural signature from the hippocampus and the amount of CSF in the hippocampal area. From the DTI modality, we extract Means Diffusivity (MD) signal variation in the hippocampus ROI. Our method is a slice-based method and features are extracted in a 2D fashion. Fig. 1 presents the different steps of our method namely image preprocessing, hippocampus ROI selection, generation of visual signatures, and finally the MKL classification."}, {"section_title": "Image preprocessing", "text": "Preprocessing of DTI modality of brain imaging includes correction for eddy currents and head motion, skull stripping with the Brain Extraction Tool (BET) and fitting of diffusion tensors to the data with DTIfit module of the Software Library FSL. 2 Fitting step allows the generation of the MD and FA maps. In our work, we focus only on the MD maps. Indeed MD maps express the loss of internal structure and can be processed in the same way as sMR images, while FA maps express the anisotropy and specific analysis and feature extraction techniques still need to be designed. The MD images have to be processed to allow for ROI selection using a normalized anatomical atlas. To do this, MD images are affinely coregistered to the corresponding anatomical scans. Co-registration consists in superimposing MD maps on the subject's corresponding anatomical MRI. Indeed, co-registration consists in superimposing DTI-derived maps (MD images) on the subject's corresponding anatomical scan. This helps to overlay MD values onto an individual's own anatomy. We follow here [42, 26] where co-registration was used to extract regional values of DTI parameters in some specific areas. Structural MRI was corrected to lower the intensity inhomogeneity and spatially normalized onto the Montreal Neurological Institute (MNI) brain template [43] . The resulting transformation parameters were applied to the corresponding co-registered MD maps. It is to note that all performed transformations are affine in order to not deform the pattern of the features. Finally, the spatially normalized MD maps are smoothed with a Gaussian filter to improve signal to noise ratio. Transformed images were visually checked for co-registration errors. Preprocessing steps are presented in the top of Fig. 1 . All image preprocessing steps were performed using Statistical Parametric\nMapping software running on matlab (SPM8, Welcome Department of Imaging Neuroscience, London, UK). "}, {"section_title": "Hippocampus ROI selection", "text": "Since each modality is affinely normalized, we are able to identify a region of interest (ROI). To select the hippocampus ROI, we do not use a segmentation step, but instead we follow an atlas-based selection method we previously proposed in [8] . The method allows for a rough extraction of the ROI. We use an MNI normalized brain atlas called Anatomic Automated Labeling Atlas (AAL) [44] . Furthermore, in order to limit the processing only to brain tissues, we also generated a mask to remove skull voxels. Both sMRI and MD images are mapped to the AAL to select the hippocampus ROI. The use of the atlas parcels helps to characterize brain abnormalities in terms of intra-ROI local pattern. In fact, the pattern overlapping with the extracted ROI mask in all modalities varies between healthy subjects and those exhibiting clinical signs of disease."}, {"section_title": "Pattern of hippocampus shrinkage from sMRI", "text": "Referring to domain knowledge, at the AD stage the hippocampus ROI undergoes a significant volume reduction and then shrinks. The liberated volume of the hippocampus is filled with CSF. An illustration of this phenomenon is given in Fig. 2 . The dark areas in the image correspond to the CSF.\nHence, to quantify the hippocampus shrinkage in sMRI, we extract two complementary features: hippocampus structural alteration and the amount of CSF in the hippocampal area. First, we follow the method we previously proposed in [30] which is based on the use of local features such as SIFT, SURF and GaussLaguerre Circular Harmonic Functions descriptors (GL-CHFs) to quantify the structural hippocampus alteration. Then, an adaptive thresholding method based on the Otsu-method technique is used to compute the percentage of pixel corresponding to CSF in the hippocampus area."}, {"section_title": "Pattern of water diffusion in hippocampus from MD maps", "text": "The brain cells loss is accompanied by a loss of barriers that restrict motion of water molecules in brain tissues. Fig. 3 , illustrates an example of the MD maps of both healthy and AD subjects. In AD case, the diffusion in ventricles for example is faster and the MD map is brighter due to the free motion of water molecules. While in white and gray matter regions, the diffusion is slower and the MD pixels are darker. In addition, the faster diffusion of water in the affected hippocampal area results in brighter pixels in the MD maps for this region as well.\nTherefore, we assume that the fast diffusion of water in the hippocampal area is expressed by hyper-signal (brighter pixels) on the MD maps (Fig. 4) . Hence, we propose to quantify the hippocampal atrophy by considering the pattern of water diffusion as an MD image signal variation inside the hippocampus ROI."}, {"section_title": "Multimodal AD disease-related signature generation", "text": "Once the hippocampus ROI is localized in both sMRI and MD images, we present now the process of generating a visual signature or the so-called \"AD disease-related signature\". Indeed, an MD and sMRI signature per subject is generated to reflect the bimodal brain atrophy at the individual level. We represent signal variations inside the ROI anatomy by a set of local features. Here, we use a multi-resolution approach based on the Gauss-Laguerre Circular Harmonic Functions (GL-CHFs) descriptors [45] , which is suitable for extracting the most relevant image features and even small and localized patterns. The local descriptor of the image is a vector of coefficients of development of image signal on the CHF basis [30] . CHFs proved their performance in capturing atrophy from sMRI and MD maps [30, 46] since they give interesting approximations of blurred signal in MRI and DTI."}, {"section_title": "Gauss-Laguerre Circular Harmonic Functions (GL-CHFs)", "text": "CHFs were first introduced in the pattern recognition domain [45] . They have several advantages over other descriptors particularly for MRI. CHFs present a decomposition of image signal on the orthonormal functional basis. They allow for capturing local direction of image signal and also capture intermediate frequencies in the signal similar to Fourier decomposition. This propriety is more convenient for sMRI/MD images with smooth contrasts.\nMathematically speaking, Gauss-Laguerre Harmonic Functions are complex-valued radial profile functions multiplied by complex exponent:\n1\nTheir radial profiles are Laguerre functions: \nLG-CHF is a complete orthogonal set of functions in the real plane. Thus, each brain slice\nper modality m can be expanded in the analysis point ( ) a b , 0 0 for fixed scale s in Cartesian system. The coefficients of the partial expansion of local neighborhood of ( ) a b , 0 0 (patch) can be used as a feature descriptor. The advantages of these features are such that they capture both the direction and smooth variations of slice signal which is not the case of conventional SIFT and SURF features computed on the basis of high-pass filtering by gradient computation at different scales as we have shown in [47] . The number of coefficients retained defines the dimensionality of the descriptor. The reasonable dimensionality of 150 coefficients (see [30] ) was used in the present work. More mathematical details about the CHF descriptors can be found in [45] .\nTo extract features from slices, we used a dense sampling scheme with a regular grid of circular patterns of the same radius. Each grid disk is then considered as a patch of fixed size and forms the descriptor support, that is the area where the signal will be approximated by CHFs. Such sampling may provide a rough model of clinician vision. It results in a good coverage of the entire hippocampus ROI and in a constant amount of features per image area. In addition, regions with less contrast contribute equally to "}, {"section_title": "Features quantization and signatures generation", "text": "To build a compact visual signature per modality, we use the Bagof-visual-Words (BoVW) approach which is popular in computer vision [48] . To capture the maximum of atrophy information, we build a bag of words per projection and then per modality. are 150-dimensional descriptors. Once the cluster centers have been determined, the image signature per projection is generated. Each feature is \"encoded\", i.e., it is assigned to the closest center using the Euclidean distance ( ) "}, {"section_title": "Multiple Kernel Learning for multimodal visual signatures fusion", "text": "A global fusion framework is presented in this section to combine visual signatures computed on sMRI and MD images to distinguish between, NC, MCI and AD subjects. The features to be combined are: MD visual signature h md , sMRI visual signature h smri and the amount of CFS in hippocampus area v csf computed with the method proposed in [30] . Therefore, three kernels are computed (i.e., one kernel per feature) and a set of weights are estimated for the kernel combination. The assumption behind Multiple Kernel Learning is to create a weighted linear combination of the kernels from each feature space, and to adapt these weights in order to achieve the best performance [49] .\nIn our framework, we use the MD signatures, sMRI signatures and CSF values to spawn a set of kernels k md , k smri and k csf . The overall kernel is constructed by summing those kernels and weighting them as specified. The optimization problem then reduces to finding their weights while simultaneously maximizing the margin for the training data. A kernel is effectively a kind of similarity measure that explicits feature maps and properties, so the choice of a suitable kernel for each kind of features is crucial here. Actually, the Chi-square kernel has proven to be a powerful measure of similarity between histograms in the area of image classification [50] and specially with BoVW-based MKL applications [51] . In our case, the h md and h smri visual signatures are histogram-based features. Hence, we resort to the use of a χ 2 chisquare kernel given by:"}, {"section_title": "K h h d h h with d h h h h h h", "text": ", e x p , ,\nwhere h 1 i and h 2 i are the corresponding bins from the histograms h 1 and h 2 and k denotes the codebook size. Here, β is the kernel width, this parameter was fixed to be the mean of all chi-square distances between all training features. Meanwhile, for the v csf features, which are not histograms but simple quantities of pixels classified as CSF (see [30] for the Bayesian classification approach), we choose a Gaussian kernel σ\n. All kernels are then normalized to the unit trace through the formula\n. We set w md , w smri and w csf the weights accordingly to respectively the MD, sMRI and CSF features. The combined kernel is presented as follows: Then, we use the simpleMKL [15] solver to search a combination of kernels that maximizes the classifier performance (Accuracy). To this end, in the training step, both SVM parameters and MKL weights are simultaneously estimated within the same optimization problem. The best classification accuracy is obtained using an alternating method performed between the optimization of the SVM classifier and the optimization of the kernel weights. In each step, given the current solution of kernel weights, MKL solves a standard SVM optimization problem with the combined kernels.\nSuppose that we have a set of training samples { } is its corresponding label. Classification performances depend strongly on the data representation. In kernel methods, the data representation is implicitly chosen through the so-called kernel\nwhich intuitively computes similarity between u i and u j . The decision function is defined as flow: In the current work, we use the SimpleMKL algorithm proposed by [15] to solve the classification problem. SimpleMKL iteratively determines the combination of kernels by gradient descent wrapping a standard SVM solver. "}, {"section_title": "Imaging data", "text": "Data used in the experiments comes from the Alzheimer's Disease Neuroimaging Initiative (ADNI) dataset. It is to note that the ADNI recently added at the second phase ADNI2/ADNIGO Diffusion Tensor Imaging (DTI), among several other new imaging modalities, in an effort to identify sensitive biomarkers of Alzheimer's disease (AD). In our work, we selected both T1-weighted MR imaging and DTI imaging data of 155 subjects including 52 NC, 45 AD and 58 MCI. Table 1 presents a summary of the demographic characteristics of the selected groups (including the number, age, gender and Mini Mental State Examination (MMSE) score of cognitive function of the subjects). The number of scans available for this work was limited by the availability of DTI data. In fact, the DTI is a relatively new MR modality, and not all subjects have both DTI and sMRI scans. Anatomical images will serve also as a spatial reference for the DTI data. Details about the acquisition protocol and the initial processing steps can be found in the ADNI2 protocol (http://adni-info.org/Scientists/Pdfs/ADNI2_Protocol_FI NAL_20100917.pdf)."}, {"section_title": "Experiments and results", "text": ""}, {"section_title": "Experiments", "text": "In order to fix the optimal codebook size, we plot the variation of classification accuracies (AD vs. NC, NC vs. MCI and MCI vs. AD) function to the codebook size changes. Fig. 6 illustrates that the performance of the three binary classification problems gradually increases with the increase of the codebook size but it can also decrease in certain cases. In general, the accuracy does not change significantly with codebook size. Hence, we fix the optimal codebook sizes to 250 and 150 respectively for sMRI and MD images.\nAll experiments were conducted for three different classification tasks: (AD vs. NC), (NC vs. MCI) and (AD vs. MCI). A 10-fold cross validation strategy was used to assess the classification performance. We repeated the 10 fold cross-validation 10 times to avoid any bias introduced by the random partitioning of the dataset during cross validation. The whole set of subject samples was equally partitioned into 10 subsets, and each time the subject samples within one subset were selected as the testing samples and all remaining subject samples in the 9 other subsets were used for training the multiple kernel classifier. We report the mean average 95% confidence interval of ( ) = In a first part of experiments, we perform a direct feature concatenation as baseline early fusion method (Concat) that combines visual signatures h smri and h md into a global feature vector. The obtained 400-dimensional signature is normalized and reduced using Principle Component Analysis technique (PCA) [52] . When preserving 95% of the total energy, we obtained a 68-dimensional feature vector. We use an SVM classifier with an RBF kernel to do classification as this scheme has shown good results in our previous work [8] . To select the spread parameter s for RBF kernel and the regularization parameter C, we performed a grid search on the training dataset and selected the values σ ( ) C , which gave the best classification accuracy to build the classifier. We used the LiBSVM software. 4 To evaluate performance of the baseline concatenation method we classify subjects using modality alone (sMRI-Hippo and MD-Hippo). Classification of single modality is performed in the same way as the Concat methods (an SVM classifier is trained for each modality).\nIn a second part of experiments, we compute features kernels and then we conduct the MKL classification. First, we start by combing h smri and h md (MKL(sMRI,MD) . At the next step we add the v csf features (MKL(sMRI,MD,CSF)). The SimpleMKL solver is then used to perform classification. Tables 2, 3 Furthermore, we performed a paired Student t-test to assess the statistical differences in classification accuracy, sensitivity and specificity between the single modality use and the MKL fusion. We formulated the null hypothesis ( ) H0 as \"there is no significant improvement in performance when we combine MD and sMRI imaging-biomarkers via the MKL fusion\". All statistical tests were considered significant at the < p 0.001 level. This means that we can confidently reject the null hypothesis and declare that the multimodal MKL-based fusion method has shown a statistically significant improvement in the experiment compared to the use of a single modality (MD or sMRI). This suggests that integrating multi-modal imaging biomarkers offers optimal results for AD subjects classification."}, {"section_title": "Classification results", "text": "The experimental results show that the MKL method achieves better classification scores compared to single modality of features or a simple concatenation of multiple features. For the AD vs. NC classification problem, using the MKL fusion method we obtained 90.2% of accuracy, 97.2% of specificity and 82.92% of sensitivity in average with cross validation. However, using for example the structural MRI alone we have respectively only 81.5%, 82.63% and 80.16% of accuracy, specificity and sensitivity. A very close figure for the MD modality alone are observed (see Table 3 Hippo-MD). Adding the CSF modality in the whole MKL fusion scheme also increases the performance metrics up to 2%. From Tables 2-4, we can see that the MKL fusion of sMRI and MD improves classification performance by an average about 7%, 6% and 10% respectively for AD vs. NC, MCI vs. NC and AD vs. MCI classification problems compared to the use of a single modality. However, adding CSF features to the MKL (MD, SMR) slightly increases the performance. This can be explained by the fact that both sMRI and CSF features are derived from the same modalities(sMRI) and may have redundant information. Indeed, the correlation between features from different modalities is more informative than features computed from the same modality.\nIn conclusion, compared with the single modality use, the MKL fusion leads to an increase about 9% for the accuracy and 15% for the specificity and 2.8% for sensitivity (see Table 2 ). In addition, the baseline concatenation method gives better results than the single modality approach but the proposed MKL fusion method still performs better.\nFor the NC vs. MCI classification task, we obtained respectively 79.42%, 86.05% and 71.58% of accuracy, specificity and sensitivity. The MKL fusion of all imaging biomarkers yields to an increase in the classification performance by in average about 8.5% for the accuracy, 6% for the specificity and 15% for sensitivity. Additionally, combining the two visual signatures into a single vector (early fusion) improves the classification results but it is still less efficient than the MKL method.\nEven for the most challenging discrimination problem (AD vs. MCI), because of the heterogeneous nature of the MCI group, MKL is still giving good classification rates (76.63% accuracy, 81.33% specificity and 65.62% sensitivity) and outperforms the single modality method by about 9% for the accuracy, 6.56% for the specificity and about 10% for the sensitivity. Fig. 7 illustrates classification performance on the most challenging subjects (MCI) group. We can see that all metrics improve when combining the MD and sMRI features using the MKL method (Fig. 7) ."}, {"section_title": "MKL fusion vs. baseline concatenation scheme", "text": "MKL fusion is a heavier computational approach than concatenation of signatures followed by PCA. Nevertheless, as we can see from the results (Tables 2 and 4 ) it gives an average improvement about 6% in BAC metric. The effectiveness of the MKL fusion with regard to the baseline concatenation approach can be explained by the way that concatenation method represents an equal confidence in each feature type, MKL successfully handles discrepancies in the discriminative power of different features by assigning lower weights to less discriminative feature kernels."}, {"section_title": "Effect of kernel weights for MKL-based multimodal imagingbiomarkers fusion", "text": "To investigate how the combining kernel weights w md , w smri and w csf affect the classification performance of our fusion method, we set kernel weights from 0 to 1 at a step size of 0. . From Figs. 8 and 9, most of ACC and BAC values within squares of the upper triangle are larger than those on the three vertices and edges. These results further validate that combining imaging-biomarkers derived from different modalities can achieve better classification results than combining only two imaging biomarkers or using only one."}, {"section_title": "Comparison with the state of the arts", "text": "In this work, we showed that using complementary visual information derived from MD maps and structural MRI in the hippocampus ROI increases the AD/MCI subjects classification performance. The proposed fusion method exhibited a superior classification performance compared with the single modality approaches and yielded comparable accuracy with previous multimodal classification studies. However, direct comparison with existing work could not be fair due to the different subjects and modalities used, as well as the different methods for feature extraction and classification protocol.\nIn Table 5 , we reported some work from the literature that used the MKL concept to combine different neuroimaging data for AD goal of AD detection. For instance, [13] proposed to integrate connectivity information from Diffusion Tensor Imaging (DTI) and resting-state functional Magnetic Resonance Imaging (rs-fMRI) for improving AD subjects classification performance with multiplekernel SVM. The authors used the AAL atlas to extract regional features and they achieved an accuracy increase of 7.4% from the single modality-based methods and the direct data fusion. However, this work used a relatively small sample size (10 MCI and 17 NC subjects) and did not distinguish between MCI subjects and AD. In [25] , the authors combined spatial atrophy, derived from T1-weighted images, and white matter alterations assessed with DTI to MCI discrimination. They obtained 71.09% accuracy, 78.40% specificity and 51.96% sensitivity when distinguishing between MCI and NC which are lower than our results (respectively 79.42%, 86.05% and 71.58%). [26] proposed a new multimodal measure that combines anatomical and diffusivity measures at the voxel level. They extract multimodal characteristics from 73 anatomical brain regions using the AAL atlas. They obtained 72.4% accuracy, 82% specificity and 62.4% sensitivity to classify only 15 AD from 16 NC subjects. To the best of our knowledge the present work is the first work to use a combined T1-weighted MRI and MD maps in an MKL framework for the automated detection of MCI/AD subjects.\nWe compare our classification results with tow recently published works mainly based on both PET and MRI data to classify AD subjects [19, 53] . Although the images modalities are not exactly the same, we used the same data partition (subject number) with a closed subjects demographic characteristic (MMSE,gender). First, in [19] , the authors combined MRI and PET data to achieve an accuracy of 87.6% for AD vs. NC classification with 86.35% of BAC which is lower than the results obtained using our method on the same subjects (91% accuracy and 88.6% BAC). It is worth noting that, in [19] , both baseline and longitudinal data are used for MRI and PET modalities, while our proposed method uses only the baseline data of DTI and sMRI data. In addition, the MCI/AD classification problem is not addressed in their work. Second, we also applied our method on the same subjects as [53] . We obtained respectively for MCI vs. NC classification an accuracy of 87.60%, compared to 78.8% reported in [53] .\nMost of the proposed MKL fusion frameworks in the literature, use the PET modality in addition to the anatomical MRI or CSF modality. However, PET modality involves the injection of radioactive contrast agents making PET very expensive and difficult to be performed in non-specialized centers. Conversely, DTI scans are less expensive, safer, take only several minutes and are widely available. Moreover, extraction of CSF directly from the brain is intrusive. Hence, computing the CSF amount from imaging modality, i.e., structural MRI seems to be a good idea to avoid intrusive diagnostics. The proposed method is extensible to other MRIbased brain diseases that can be diagnosed by brain MRI such as Schizophrenia and brain tumors. Indeed, the proposed featuresbased approach extract and quantify the local brain tissue abnormality (neurodegeneration, spot, etc.) whatever the type of brain atrophy. We need just to localize the ROI involved in the diagnosis of such disease (referring to the domain knowledge) and then apply the method to quantify atrophy and classify subjects."}, {"section_title": "Conclusion", "text": "In this paper, we proposed an AD/MCI recognition approach based on image-derived biomarkers and Multiple Kernel Learning method. We extract visual features from structural MRI and DTI MD maps. Extracted features are combined in a Multiple Kernel Learning framework to discriminate between AD/MCI subjects. The obtained results showed that combining imaging biomarkers from those modalities improves the diagnosis accuracies compared to the single modality use. Our proposed approach is general and extensible and can potentially be used for integration of other neuroimaging biomarkers. We intend to further evaluate our approach performance using other datasets (MCI converters and MCI non-converters) in the aim of predicting subject conversion to AD rather than recognizing subject's category. "}]