[{"section_title": "Abstract", "text": "OBJECTIVE -We sought to estimate the rate of progression from newly acquired (incident) impaired fasting glucose (IFG) to diabetes under the old and new IFG criteria and to identify predictors of progression to diabetes.\nRESEARCH DESIGN AND METHODS -We identified 5,452 members of an HMO with no prior history of diabetes, with at least two elevated fasting glucose tests (100 -125 mg/dl) measured between 1 January 1994 and 31 December 2003, and with a normal fasting glucose test before the two elevated tests. All data were obtained from electronic records of routine clinical care. Subjects were followed until they developed diabetes, died, left the health plan, or until 31 December 2005.\nRESULTS -Overall, 8.1% of subjects whose initial abnormal fasting glucose was 100 -109 mg/dl (added IFG subjects) and 24.3% of subjects whose initial abnormal fasting glucose was 110 -125 mg/dl (original IFG subjects) developed diabetes (P Ͻ 0.0001). Added IFG subjects who progressed to diabetes did so within a mean of 41.4 months, a rate of 1.34% per year. Original IFG subjects converted at a rate of 5.56% per year after an average of 29.0 months. A steeper rate of increasing fasting glucose; higher BMI, blood pressure, and triglycerides; and lower HDL cholesterol predicted diabetes development.\nCONCLUSIONS -To our knowledge, these are the first estimates of diabetes incidence from a clinical care setting when the date of IFG onset is approximately known under the new criterion for IFG. The older criterion was more predictive of diabetes development. Many newly identified IFG patients progress to diabetes in Ͻ3 years, which is the currently recommended screening interval.\nT he American Diabetes Association (ADA) defines impaired fasting glucose (IFG) as an intermediate state of hyperglycemia in which glucose levels do not meet criteria for diabetes but are too high to be considered normal (1). Although the ADA calls IFG \"pre-diabetes\" (1), reported estimates of diabetes development in IFG patients vary widely (2). The Hoorn Study (3) found that 33% of patients with IFG but not impaired glucose tolerance (IGT) and 64.5% of patients with IFG and IGT developed diabetes over a follow-up of 5.8 -6.5 years. The Paris Prospective Study (4) reported much lower proportions: 2.7% among patients with normal glucose tolerance or isolated IFG and 14.9% among patients with IFG and IGT over 30 months of follow-up. An Italian study (5) spanning 11.5 years found that 9.1% of patients with isolated IFG and 44.4% of subjects with IFG and IGT developed diabetes. Studies of nonwhite populations have reported diabetes development proportions ranging from 21.6% over 5 years among Mauritians with isolated IFG (6) to 41.2% over 5 years among Pima Indians with IFG and IGT (7). The highest proportion of diabetes development, 72.7% over 7 years among subjects with IGT and IFG, was found in a Brazilian-Japanese population (8).\nMost of this wide variation in reported rates of diabetes development among IFG patients probably arises from unknown time spent with IFG. To our knowledge, only one study to date has estimated the rate of progression from IFG to diabetes starting from incident pre-diabetes. The Baltimore Longitudinal Study of Aging (9) found that diabetes occurred in 25% of 216 subjects over 10 years, following their progression from normal glucose tolerance to IFG or IGT.\nAfter these studies had been published, the ADA lowered its criterion for IFG from 110 to 100 mg/dl to optimize the sensitivity and specificity of IFG for predicting future diabetes (10). This decision generated some controversy because of the large proportion of the population that now meets the definition of IFG (11). To our knowledge, estimates of rates of diabetes progression among patients meeting this new criterion for IFG are not known. Therefore, we sought to estimate diabetes progression rates in a large cohort of subjects who newly developed pre-diabetes under both the older and newer criteria for IFG. In addition, we sought to identify predictors of diabetes progression among subjects who met each criterion for IFG.\nMETHODS -Subjects were members of Kaiser Permanente Northwest (KPNW), a non-profit, group-model HMO serving ϳ475,000 members centered in the Portland, Oregon, metropolitan area. KPNW maintains electronic databases containing information on all inpatient admissions, pharmacy dispenses, outpatient visits, and laboratory tests. The medical group recommends lipid screening for men aged Ն35 years and women aged Ն45 years. Fasting \nE p i d e m i o l o g y / H e a l t h S e r v i c e s / P s y c h o s o c i a l R e s e a r c h\nFor this study, we divided IFG into two \"stages\" that correspond to the old and new ADA criteria, 100 -109 mg/dl (added IFG subjects) and 110 -125 mg/dl (original IFG subjects). In both stages, patients were followed from the date of their first abnormal glucose until they progressed to diabetes (n ϭ 614, 11.3%), died (n ϭ 349, 6.4%), left the health plan (n ϭ 1,044, 19.1%), or until 31 December 2005 (n ϭ 3,445, 63.2%). Added IFG subjects who later progressed to original IFG were included in analyses of both stages. The mean Ϯ SD number of follow-up fasting glucose tests was 5.2 Ϯ 3.8 after entering the added IFG stage and 5.7 Ϯ 4.3 after entering the original IFG stage.\nAll analyses were conducted with SAS software, version 8.2 (SAS Institute, Cary, NC). We calculated incidence of diabetes per 100 person-years. For ease of interpretability, we report the incidence rates in terms of percent per year. To identify predictors of progression to diabetes, we constructed three generalized linear regression models using person-years of follow-up as an adjustment for unequal follow-up (12): one was for all 5,452 subjects, a second was for all 4,526 added IFG subjects, and the third was for all 1,699 original IFG subjects. We also estimated a fourth model to identify predictors of progression to original IFG among the 4,526 added IFG subjects. KPNW uses an electronic medical record that contains up to 20 physicianrecorded ICD-9-CM diagnoses at each contact. From these diagnoses, we identified comorbidities present at the time of the first fasting glucose test. The specific comorbidities (ICD-9-CM codes) used were: myocardial infarction (410.xx), stroke (430.xx-432.xx, 434.xx-436.xx, and 437.1), other atherosclerotic cardiovascular disease (411.1, 411.8, 413.xx, 414.0, 414.8, 414.9, and 429.2), congestive heart failure (428.xx), and depression (296.2-296.35, 298.0, 300.4, 309.1, and 311). In constructing the multivariate models, we combined the myocardial infarction, stroke, atherosclerotic cardiovascular disease, and congestive heart failure variables into a single marker for cardiovascular disease. Depression was not significant in any model and was therefore dropped. Age was calculated as of the date of the first elevated glucose test. Smoking history, height, weight, and blood pressure were also obtained from the electronic medical record. Lipid values were extracted from the laboratory database. For this study, we used the mean of all lipid, blood pressure, and BMI values recorded during a stage of IFG as predictors. Before modeling, we tested the correlation of all variables to rule out multicollinearity. With the exception of age/cardiovascular disease (0.31) and female sex/HDL (0.37), all correlation coefficients were below 0.30; thus, any variable that was significant in any model was retained.\nRESULTS -Of the 5,452 subjects, 4,526 (83.0%) had their first abnormal FPG within the added IFG range in an average of 17.8 months after their last normal test (Fig. 1) . The remaining 926 (17.0%) subjects' first abnormal fasting glucose result fell between 110 and 125 mg/dl (original IFG) after an average of 22.5 months. Most added IFG subjects (n ϭ 3,552, 78.5%) did not progress to either original IFG or diabetes over a mean follow-up of 73.2 months. However, 201 added IFG subjects (4.4%) progressed straight to diabetes in an average of 31.1 months. The remaining 17.1% progressed to original IFG in a mean of 29.2 months. Of these, 164 (21.2%) developed diabetes in a mean of 29.5 months. Although nearly 30% of those who did not progress to either diabetes or original IFG either died or left the health plan, mean follow-up time (62.9 months for those who died and 45.0 months for those who left the plan) was substantially longer than progression time. Similarly, 249 (26.9%) of initially original IFG subjects developed diabetes in a mean of 28.7 months. Again, mean follow-up time among those who died or left the plan before progressing was much greater than progression time (61.0 and 41.1 months, respectively).\nThe 83% of subjects whose initial abnormal FPG ranged from 100 to 109 mg/dl (added IFG) were ϳ2 years older (59.7 vs. 57.9 years, P Ͻ 0.0001) and less likely to be women (48.1 vs. 53.9%, P Ͻ 0.001) than initially original IFG subjects ( Table  1 ). The mean value of the FPG test before the initial abnormal FPG did not significantly differ between added and original IFG subjects (93.8 vs. 93.5 mg/dl, P ϭ 0.119).\nOverall, 8.1% of added IFG subjects and 24.3% of original IFG subjects ultimately developed diabetes (P Ͻ 0.0001) ( Table  2 ). Added IFG subjects who progressed to diabetes did so within a mean of 41.4 months, a rate of 1.34% per year. Of the 17.1% who progressed to original IFG, 21.2% developed diabetes (3.24% per year). Among added IFG subjects who were not known to progress to original IFG, 5.4% developed diabetes (0.91% per year).\nSubjects whose first elevated fasting glucose result was 110 -125 mg/dl (original IFG) converted to diabetes at a rate of 5.56% per year after an average of 29.0 months. Once subjects reached original IFG, diabetes arose at approximately the same rate among subjects who did and did not pass through the added IFG stage (5.16 vs. 5.87%, P ϭ NS), but a significantly greater proportion of those who did not have a previous added IFG measurement progressed to diabetes (26.8 vs. 21.2%, P ϭ 0.007). Among all subjects (n ϭ 5,452), 11.3% developed diabetes in an average of 36.3 months, an incidence rate of 1.95% per year. This represents the rate at which subjects under the new ADA definition of IFG (100 -125 mg/dl) progressed to diabetes. By comparison, the total original IFG incidence rate (5.56% per year) represents the old IFG definition.\nAs shown in rate of progression is lower than rates reported by all but one previous study of subjects enrolled at unknown times after IFG had already begun (3,5-8). The progression rate from the old IFG cut point that we observed is very similar to the rate reported by Meigs et al. (9), which is the only previous study that has estimated progression from the time IFG first appeared. This confirms the importance of accounting for time since IFG onset when predicting the risk of diabetes and likely explains much of the wide variation among earlier studies. Three times the proportion of subjects with original IFG progressed to diabetes than added IFG subjects, and they did so more rapidly, at over four times the rate. Among added IFG subjects, progression to original IFG increased the risk of ultimately developing diabetes by threefold. Once original IFG was reached, initially added IFG subjects developed diabetes at approximately the same rate as patients who started from original IFG. Only about one-third of subjects who developed diabetes did so without first passing through original IFG. Moreover, the rate of diabetes incidence among all subjects (i.e., the rate for the ADA's new IFG definition) was 1.95% per year, which is less than half the 5.56% rate observed for the old IFG definition. All of these finding suggest that original IFG (the old ADA definition) is much more predictive of future diabetes.\nHow quickly fasting glucose rises from normal to impaired may also predict type 2 diabetes. Although diabetes developed approximately equally among original IFG subjects once that level was reached, subjects who first passed through added IFG spent an average of 29.2 months in that stage. Thus, a steeper trajectory of rising fasting glucose may be an important risk factor for diabetes development. If so, whether a patient exceeds any given cut point for defining IFG may be less important than the rate at which glucose is increasing. This is a new finding, which could not have been observed in previous studies that had unknown dates of IFG onset; however, it is consistent with the Mexico City Diabetes Study, which concluded that conversion to diabetes is marked by a step increase rather than gradual progressive rise in glycemia (13).\nIn our data, higher BMI and lower HDL cholesterol were the most highly significant nonglucose predictors of hyperglycemic progression. Higher triglycerides and systolic blood pressure were also consistently significant risks. Previous studies have shown that this constellation of risk factors plus hyperglycemia-known as the metabolic syndrome-is predictive of diabetes, probably because of the glucose component (14 -17). In the context of elevated glucose, components of the metabolic syndrome appear to independently predict further hyperglycemia, but whether the syndrome predicts diabetes over and above its individual components is beyond the scope of this study.\nThe prevalence of diabetes markedly increases with age (1). In our population of patients with newly acquired IFG, we found that younger, not older, age predicted diabetes development. It may be that hyperglycemia developed at a younger age reflects a greater degree of insulin resistance, in which relatively small declines in ␤-cell function lead to a rapid rise in glucose levels (13). However, it is also possible that the presence of other risk factors caused clinicians to test glucose more frequently among younger members, increasing the chance to identify diabetes.\nOur study has several noteworthy limitations. As an observational study conducted in a clinical care setting, subjects received their fasting glucose tests at irregular intervals, which likely affected the precision of our incidence estimates. Although all subjects had previously normal fasting glucose measurements, we could not determine the precise date on which they crossed an IFG threshold. In addition, by requiring our subjects to have at least two elevated glucose values, our study may have been subject to ascertainment bias: some of our subjects were likely being followed because of glucoserelated risk factors. Furthermore, those at greatest diabetes risk may have been tested more frequently, thereby increasing the likelihood of detection. Therefore, our incidence estimates may be higher than would be observed in a randomly selected population but are likely representative of real-world clinical practice. An additional limitation is that 19% of our initial population left the health plan. Over an average of 6 years of follow-up, this computes to a relatively low annual drop-out rate of Ͻ4%. It cannot be determined whether these subjects would experience diabetes incidence at similar rates as those who completed follow-up. Had we excluded these subjects from analysis, our progression rates would have been considerably higher because the denominator would have been reduced while the number of subjects progressing remained the same. It is also important to note that at all stages of progression, subjects who died or left the health plan before progression were, on average, observed for substantially longer periods than the mean progression times for those who did progress to other stages. Moreover, other than being younger, the participants who left the health plan were not statistically significantly different from those who completed follow-up on any of the predictor variables, including fasting glucose levels. We were also unable to assess several known predictors of diabetes: family history, previous gestational diabetes, race/ethnicity, and waist circumference, for example. Exclusion of these predictors from multivariate models may have affected the performance of included variables in ways we could not observe. Finally, our study was conducted in an insured primarily Caucasian (ϳ92%) population. Whether our results generalize to other populations is an important area for future research. The Atherosclerosis Risk in Communities Study (18) concluded that twothirds of those classified at the lower (100 -109 mg/dl) IFG cut point had either diabetes or IGT. Thus, because many patients with IFG also have IGT, interventions proven effective in IGT populations (19 -22) would likely also apply to the majority of patients with IFG. However, the implementation of lifestyle interventions takes time, and the beneficial effects are not immediate. In our data, newly identified added IFG subjects who progressed to diabetes took, on average, Ͼ3 years to do so. Even among those with newly acquired original IFG, diabetes progression time averaged Ͼ2 years. However, those at greatest risk of diabetes had steeper trajectories of glucose increase, allowing less time for timeintensive interventions. Current ADA recommendations suggest screening high-risk individuals, particularly those with a BMI Ն25 kg/m 2 , at 3-year intervals to detect pre-diabetes and diabetes (1). Overall, those who developed diabetes in our study did so in an average of 36.3 months, and original IFG subjects who developed diabetes did so in a mean of ϳ29 months. Thus, a 3-year screening interval could miss individuals who progress rapidly from normal to impaired glycemia to diabetes. Shortening the screening interval, especially among the obese and those with steeper glucose trajectories, would allow more time for atrisk individuals to attempt lifestyle interventions."}, {"section_title": "T", "text": "he American Diabetes Association (ADA) defines impaired fasting glucose (IFG) as an intermediate state of hyperglycemia in which glucose levels do not meet criteria for diabetes but are too high to be considered normal (1) . Although the ADA calls IFG \"pre-diabetes\" (1) , reported estimates of diabetes development in IFG patients vary widely (2) . The Hoorn Study (3) found that 33% of patients with IFG but not impaired glucose tolerance (IGT) and 64.5% of patients with IFG and IGT developed diabetes over a follow-up of 5.8 -6.5 years. The Paris Prospective Study (4) reported much lower proportions: 2.7% among patients with normal glucose tolerance or isolated IFG and 14.9% among patients with IFG and IGT over 30 months of follow-up. An Italian study (5) spanning 11.5 years found that 9.1% of patients with isolated IFG and 44.4% of subjects with IFG and IGT developed diabetes. Studies of nonwhite populations have reported diabetes development proportions ranging from 21.6% over 5 years among Mauritians with isolated IFG (6) to 41.2% over 5 years among Pima Indians with IFG and IGT (7) . The highest proportion of diabetes development, 72.7% over 7 years among subjects with IGT and IFG, was found in a Brazilian-Japanese population (8) .\nMost of this wide variation in reported rates of diabetes development among IFG patients probably arises from unknown time spent with IFG. To our knowledge, only one study to date has estimated the rate of progression from IFG to diabetes starting from incident pre-diabetes. The Baltimore Longitudinal Study of Aging (9) found that diabetes occurred in 25% of 216 subjects over 10 years, following their progression from normal glucose tolerance to IFG or IGT.\nAfter these studies had been published, the ADA lowered its criterion for IFG from 110 to 100 mg/dl to optimize the sensitivity and specificity of IFG for predicting future diabetes (10) . This decision generated some controversy because of the large proportion of the population that now meets the definition of IFG (11) . To our knowledge, estimates of rates of diabetes progression among patients meeting this new criterion for IFG are not known. Therefore, we sought to estimate diabetes progression rates in a large cohort of subjects who newly developed pre-diabetes under both the older and newer criteria for IFG. In addition, we sought to identify predictors of diabetes progression among subjects who met each criterion for IFG. "}, {"section_title": "Stages of impaired fasting glucose", "text": "For this study, we divided IFG into two \"stages\" that correspond to the old and new ADA criteria, 100 -109 mg/dl (added IFG subjects) and 110 -125 mg/dl (original IFG subjects). In both stages, patients were followed from the date of their first abnormal glucose until they progressed to diabetes (n ϭ 614, 11.3%), died (n ϭ 349, 6.4%), left the health plan (n ϭ 1,044, 19.1%), or until 31 December 2005 (n ϭ 3,445, 63.2%). Added IFG subjects who later progressed to original IFG were included in analyses of both stages. The mean Ϯ SD number of follow-up fasting glucose tests was 5.2 Ϯ 3.8 after entering the added IFG stage and 5.7 Ϯ 4.3 after entering the original IFG stage."}, {"section_title": "Analytic variables", "text": "All analyses were conducted with SAS software, version 8.2 (SAS Institute, Cary, NC). We calculated incidence of diabetes per 100 person-years. For ease of interpretability, we report the incidence rates in terms of percent per year. To identify predictors of progression to diabetes, we constructed three generalized linear regression models using person-years of follow-up as an adjustment for unequal follow-up (12) : one was for all 5,452 subjects, a second was for all 4,526 added IFG subjects, and the third was for all 1,699 original IFG subjects. We also estimated a fourth model to identify predictors of progression to original IFG among the 4,526 added IFG subjects.\nKPNW uses an electronic medical record that contains up to 20 physicianrecorded ICD-9-CM diagnoses at each contact. From these diagnoses, we identified comorbidities present at the time of the first fasting glucose test. RESULTS -Of the 5,452 subjects, 4,526 (83.0%) had their first abnormal FPG within the added IFG range in an average of 17.8 months after their last normal test (Fig. 1) . The remaining 926 (17.0%) subjects' first abnormal fasting glucose result fell between 110 and 125 mg/dl (original IFG) after an average of 22.5 months. Most added IFG subjects (n ϭ 3,552, 78.5%) did not progress to either original IFG or diabetes over a mean follow-up of 73.2 months. However, 201 added IFG subjects (4.4%) progressed straight to diabetes in an average of 31.1 months. The remaining 17.1% progressed to original IFG in a mean of 29.2 months. Of these, 164 (21.2%) developed diabetes in a mean of 29.5 months. Although nearly 30% of those who did not progress to either diabetes or original IFG either died or left the health plan, mean follow-up time (62.9 months for those who died and 45.0 months for those who left the plan) was substantially longer than progression time. Similarly, 249 (26.9%) of initially original IFG subjects developed diabetes in a mean of 28.7 months. Again, mean follow-up time among those who died or left the plan before progressing was much greater than progression time (61.0 and 41.1 months, respectively)."}, {"section_title": "Characteristics of subjects by initial IFG stage", "text": "The 83% of subjects whose initial abnormal FPG ranged from 100 to 109 mg/dl (added IFG) were ϳ2 years older (59.7 vs. 57.9 years, P Ͻ 0.0001) and less likely to be women (48.1 vs. 53.9%, P Ͻ 0.001) than initially original IFG subjects ( Table  1 ). The mean value of the FPG test before the initial abnormal FPG did not significantly differ between added and original IFG subjects (93.8 vs. 93.5 mg/dl, P ϭ 0.119)."}, {"section_title": "Progression to diabetes", "text": "Overall, 8.1% of added IFG subjects and 24.3% of original IFG subjects ultimately developed diabetes (P Ͻ 0.0001) ( Table  2 ). Added IFG subjects who progressed to diabetes did so within a mean of 41.4 months, a rate of 1.34% per year. Of the 17.1% who progressed to original IFG, 21.2% developed diabetes (3.24% per year). Among added IFG subjects who were not known to progress to original IFG, 5.4% developed diabetes (0.91% per year).\nSubjects whose first elevated fasting glucose result was 110 -125 mg/dl (original IFG) converted to diabetes at a rate of 5.56% per year after an average of 29.0 months. Once subjects reached original IFG, diabetes arose at approximately the same rate among subjects who did and did not pass through the added IFG stage (5.16 vs. 5.87%, P ϭ NS), but a significantly greater proportion of those who did not have a previous added IFG measurement progressed to diabetes (26.8 vs. 21.2%, P ϭ 0.007). Among all subjects (n ϭ 5,452), 11.3% developed diabetes in an average of 36.3 months, an incidence rate of 1.95% per year. This represents the rate at which subjects under the new ADA definition of IFG (100 -125 mg/dl) progressed to diabetes. By comparison, the total original IFG incidence rate (5.56% per year) represents the old IFG definition."}, {"section_title": "Predictors of hyperglycemic progression", "text": "As shown in [2.43-3 .98]). Younger age and female sex predicted progression to diabetes from both stages. In all models, each kilogram per squared meter of BMI increased risk of progression by 3-4%, and HDL cholesterol was also a strong predictor. Higher systolic blood pressure and higher triglycerides were significant predictors of hyperglycemic progression in all models.\nCONCLUSIONS -In this retrospective cohort study of real-world patients with incident IFG, we found that 8.1% who met the added portion of the ADA's 2003 criterion for IFG (100 -109 mg/dl) progressed to diabetes over a mean follow-up of 6.3 years, an annual rate of 1.34%. Among subjects with incident IFG under the old ADA definition (110 -125 mg/dl), we observed an annual rate of progression to diabetes of 5.56%. This "}, {"section_title": "Figure 1-Progression from normal fasting plasma glucose to stages of IFG to type 2 diabetes. Mean Ϯ SD months from stage to stage for those who progressed are displayed along each arrow. For those who did not progress, mean Ϯ SD months of follow-up are displayed along the arrows.", "text": "rate of progression is lower than rates reported by all but one previous study of subjects enrolled at unknown times after IFG had already begun (3, (5) (6) (7) (8) . The progression rate from the old IFG cut point that we observed is very similar to the rate reported by Meigs et al. (9), which is the only previous study that has estimated progression from the time IFG first appeared. This confirms the importance of accounting for time since IFG onset when predicting the risk of diabetes and likely explains much of the wide variation among earlier studies. Three times the proportion of subjects with original IFG progressed to diabetes than added IFG subjects, and they did so more rapidly, at over four times the rate. Among added IFG subjects, progression to original IFG increased the risk of ultimately developing diabetes by threefold. Once original IFG was reached, initially added IFG subjects developed diabetes at approximately the same rate as patients who started from original IFG. Only about one-third of subjects who developed diabetes did so without first passing through original IFG. Moreover, the rate of diabetes incidence among all subjects (i.e., the rate for the ADA's new IFG definition) was 1.95% per year, which is less than half the 5.56% rate observed for the old IFG definition. All of these finding suggest that original IFG (the old ADA definition) is much more predictive of future diabetes.\nHow quickly fasting glucose rises from normal to impaired may also predict type 2 diabetes. Although diabetes developed approximately equally among original IFG subjects once that level was reached, subjects who first passed through added IFG spent an average of 29.2 months in that stage. Thus, a steeper trajectory of rising fasting glucose may be an important risk factor for diabetes development. If so, whether a patient exceeds any given cut point for defining IFG may be less important than the rate at which glucose is increasing. This is a new finding, which could not have been observed in previous studies that had unknown dates of IFG onset; however, it is consistent with the Mexico City Diabetes Study, which concluded that conversion to diabetes is marked by a step increase rather than gradual progressive rise in glycemia (13) .\nIn our data, higher BMI and lower HDL cholesterol were the most highly significant nonglucose predictors of hyperglycemic progression. Higher triglycerides and systolic blood pressure were also consistently significant risks. Previous studies have shown that this constellation of risk factors plus hyperglycemia-known as the metabolic syndrome-is predictive of diabetes, probably because of the glucose component (14 -17) . In the context of elevated glucose, components of the metabolic syndrome appear to independently predict further hyperglycemia, but whether the syndrome predicts diabetes over and above its individual components is beyond the scope of this study.\nThe prevalence of diabetes markedly increases with age (1). In our population of patients with newly acquired IFG, we found that younger, not older, age predicted diabetes development. It may be that hyperglycemia developed at a younger age reflects a greater degree of insulin resistance, in which relatively small declines in ␤-cell function lead to a rapid rise in glucose levels (13) . However, it is also possible that the presence of other risk factors caused clinicians to test glucose more frequently among younger members, increasing the chance to identify diabetes.\nOur study has several noteworthy limitations. As an observational study conducted in a clinical care setting, subjects received their fasting glucose tests at irregular intervals, which likely affected the precision of our incidence estimates. Although all subjects had previously normal fasting glucose measurements, we could not determine the precise date on which they crossed an IFG threshold. In addition, by requiring our subjects to have at least two elevated glucose values, our study may have been subject to ascertainment bias: some of our subjects were likely being followed because of glucoserelated risk factors. Furthermore, those at greatest diabetes risk may have been tested more frequently, thereby increasing the likelihood of detection. Therefore, our incidence estimates may be higher than would be observed in a randomly selected population but are likely representative of real-world clinical practice. An additional limitation is that 19% of our initial population left the health plan. Over an average of 6 years of follow-up, this computes to a relatively low annual drop-out rate of Ͻ4%. It cannot be determined whether these subjects would experience diabetes incidence at similar rates as those who completed follow-up. Had we excluded these subjects from analysis, our progression rates would have been considerably higher because the denominator would have been reduced while the number of subjects progressing remained the same. It is also important to note that at all stages of progression, subjects who died or left the health plan before progression were, on average, observed for substantially longer periods than the mean progression times for those who did progress to other stages. Moreover, other than being younger, the participants who left the health plan were not statistically significantly different from those who completed follow-up on any of the predictor variables, including fasting glucose levels. We were also unable to assess several known predictors of diabetes: family history, previous gestational diabetes, race/ethnicity, and waist circumference, for example. Exclusion of these predictors from multivariate models may have affected the performance of included variables in ways we could not observe. Finally, our study was conducted in an insured primarily Caucasian (ϳ92%) population. Whether our results generalize to other populations is an important area for future research. The Atherosclerosis Risk in Communities Study (18) concluded that twothirds of those classified at the lower (100 -109 mg/dl) IFG cut point had either diabetes or IGT. Thus, because many patients with IFG also have IGT, interventions proven effective in IGT populations (19 -22) would likely also apply to the majority of patients with IFG. However, the implementation of lifestyle interventions takes time, and the beneficial effects are not immediate. In our data, newly identified added IFG subjects who progressed to diabetes took, on average, Ͼ3 years to do so. Even among those with newly acquired original IFG, diabetes progression time averaged Ͼ2 years. However, those at greatest risk of diabetes had steeper trajectories of glucose increase, allowing less time for timeintensive interventions. Current ADA recommendations suggest screening high-risk individuals, particularly those with a BMI Ն25 kg/m 2 , at 3-year intervals to detect pre-diabetes and diabetes (1) . Overall, those who developed diabetes in our study did so in an average of 36.3 months, and original IFG subjects who developed diabetes did so in a mean of ϳ29 months. Thus, a 3-year screening interval could miss individuals who progress rapidly from normal to impaired glycemia to diabetes. Shortening the screening interval, especially among the obese and those with steeper glucose trajectories, would allow more time for atrisk individuals to attempt lifestyle interventions.\nAcknowledgments -This study was funded by National Institute of Diabetes and Digestive and Kidney Diseases Grant 1 R21 DK063961.\nParts of this study were presented in ab- Table 3 "}]