[{"section_title": "Introduction", "text": "Sarcopenia was originally defined as age-related loss of muscle mass. 1, 2 Recently, a number of definitions of sarcopenia have been suggested that include a functional measure (e.g. limited mobility) together with appendicular lean mass corrected for height. [3] [4] [5] Others have argued that muscle strength or power is a more appropriate addition to loss of muscle mass or that a new term dynapenia (poverty of muscle strength/power) should be used separately from sarcopenia, which then would be reserved solely for poverty of muscle mass. [6] [7] [8] Regardless of definitional refinements, sarcopenia measured in several different ways has been associated with multiple adverse outcomes. [3] [4] [5] No easily applied sarcopenia measure currently exists for use in usual clinical settings.\nIn the osteoporosis field, it has been demonstrated that a simple questionnaire (FRAX) can predict persons with elevated risk of osteoporotic fracture without the requirement of measuring bone mineral density (BMD). 9, 10 As loss of muscle mass, unlike loss of bone, has a clear clinical symptom, that is, weakness, it should be possible to create a simple symptom score that will predict both sarcopenia and poor outcomes in persons with sarcopenia.\nOur group has been conducting a panel study of community-dwelling, late middle-aged African Americans who were 49-65 years of age at cohort initiation in 2000-01, have high levels of disability, 11, 12 and are known collectively as the African American Health (AAH) cohort. Previously, we have shown in this cohort that the increase in disability over 9 years can be predicted in those with limited mobility and low lean mass, 13 but this measure requires in-person and laboratory assessments. The Baltimore Longitudinal Study of Aging (BLSA) and National Health and Nutrition Examination Survey (NHANES) cohorts also include data that can be utilized to examine sarcopenia. In this study, we examine the validity of a simple clinical symptom index (SARC-F) 14 to screen for sarcopenia/dynapenia and to identify those at risk for sarcopenia-related adverse outcomes in AAH, BLSA, and NHANES."}, {"section_title": "Materials and methods", "text": ""}, {"section_title": "Study sample", "text": "The AAH project sampling and recruitment procedures have been described elsewhere. 12 In brief, AAH is a populationbased longitudinal study of 998 African Americans from St. Louis, MO. Recruitment was performed using multistage probability sampling methodology designed to select approximately equal numbers of participants from two geographic strata, an inner-city area and near suburban neighbourhoods northwest of the city. AAH eligibility criteria included living independently (i.e. not institutionalized), self-reported black or African American race, birth year between 1936 and 1950, and a Mini-mental State Examination score of 16 or greater (98% ≥ 20). Recruitment proportion (participants/enumerated eligible persons) in 2000-01 was 76%. AAH Wave 1 (baseline) in-home interviews included n = 998 participants evaluated in 2000-01. Follow-up in-home interviews were done at in 2003-04 (Wave 4; n = 853) and 2010-11 (Wave 10; n = 582). The analytic sample for this report includes n = 853 Wave 4 respondents and outcomes at their 6 year follow-up (Wave 10). The institutional review board at Saint Louis University approved this project.\nThe BLSA was started in 1958 and is an ongoing longitudinal study of normal human aging. 15 BLSA participation is limited to adults who at the time of enrollment screening do not have major diseases, cognitive dysfunction, or functional impairment but once enrolled are followed for life. BLSA participants complete comprehensive health testing on a repeated cycle (1-4 years). The analytic sample for this study includes n = 1053 BLSA participants evaluated between April 2003 and December 2012 who were ages 60 and above and had valid data on the five items needed to construct the SARC-F and outcomes at follow-up (27.07 ± 11.7 months).\nThe NHANES 1999-2006 is an annual cross-sectional, nationally representative survey of approximately 5000 noninstitutionalized individuals in the United States. 16 NHANES data are publically released in 2 year cycles. The primary objective of NHANES is to collect a comprehensive data set that can be utilized to assess the health and nutritional status of the national population of children and adults. NHANES data for 1999-2002 include n = 21 004 participants with a median age of 19 (interquartile range 10-48) and 51.4% women. The analytic sample for this study includes n = 3288 NHANES 1999-2002 participants who were ages 60-85 with valid data on the five items needed to construct the SARC-F."}, {"section_title": "SARC-F questionnaire (0-10 points)", "text": "SARC-F includes five components: strength, assistance walking, rise from a chair, climb stairs, and falls. SARC-F items were selected to reflect health status changes associated with the consequences of sarcopenia.\n3,4 SARC-F scale scores range from 0 to 10 (i.e. 0-2 points for each component; 0 = best to 10 = worst) and were dichotomized to represent symptomatic (4+) vs. healthy (0-3) status. The SARC-F scale was constructed using the same questions in AAH and BLSA. Strength was measured by asking respondents how much difficulty they had lifting or carrying 10 lbs. (0 = no difficulty, 1 = some, and 2 = a lot or unable to do). Assistance walking was assessed by asking participants how much difficulty they had walking across a room and whether they use aids or need help to do this (0 = no difficulty, 1= some difficulty, and 2 = a lot of difficulty, use aids, or unable to do without personal help). Rise from a chair was measured by asking respondents how much difficulty they had transferring from a chair or bed and whether they used aids or needed help to do this (0 = no difficulty, 1 = some difficulty, and 2 = a lot of difficulty, use aids, or unable to do without help). Climb stairs was measured by asking respondents how much difficulty they had climbing a flight of 10 steps (0 = no difficulty, 1 = some, and 2 = a lot or unable to do). Falls was scored a 2 for respondents who reported falling four or more times in the past year, 1 for respondents who reported falling 1-3 times in the past year, and 0 for those reporting no falls in the past year. SARC-F construction in NHANES used the same strength and climb stairs items as in AAH and BLSA. There were minor wording differences in the NHANES items for assistance walking (assessed by asking difficulty walking between rooms on the same floor) and rise from a chair (assessed by asking difficulty standing up from armless chair). NHANES did not ask participants to report the specific number of falls in the past year but did ask about difficulty with balance or falling in past year. The NHANES SARC-F falls was scored a 2 for respondents who reported falling problems in the past year, 1 for respondents who reported only balance problems in the past year, and 0 for those reporting no falling or balance problems in the past year."}, {"section_title": "Criterion validation measures", "text": "We examined the associations of SARC-F with muscle (lean mass per cent and total lean mass) and the short portable sarcopenia measure (SPSM) in the AAH cohort. The portable Tanita "}, {"section_title": "Construct validity measures (cross-sectional and longitudinal)", "text": "Instrumental Activity of Daily Living (IADL) difficulty in AAH covered eight items (preparing meals, shopping for groceries, managing money, making phone calls, doing light housework, doing heavy housework, getting to places outside walking distance, and managing medications) from the Second Longitudinal Study on Aging 18 and Lawton and Brody 19 and was scored as the number of tasks for which the respondent reported difficulty performing or unable to perform it without help. IADL difficulty in BLSA included seven of the eight AAH items except getting to places outside walking distance and was scored as the number of tasks for which the respondent reported difficulty performing or unable to perform without help.\nHospitalization was based on respondent reports of one or more overnight hospitalizations in the year prior to Wave 4 (2004) and Wave 10 (2010) in AAH and of one or more overnight hospitalizations in the year prior to each respondent's NHANES interview (1999) (2000) (2001) (2002) .\nFor gait speed in AAH, a 3 m or 4 m course in participants' homes was used, with participants instructed to walk at their usual pace, as if walking to the store. The average walking speed (m/s) for two trials was used to create a dichotomous variable for gait speed average of <0.8 vs. ≥0.8 m/s. A walk course was set up in the testing centre to measure time to complete a 20 ft walk (seconds) in NHANES.\nThe short physical performance battery (SPPB) measure of lower body performance is based on three component tasks: standing balance, repeated chairs stands, and usual walking speed. 20 Each component task was scored as 0-4 (0 = worst to 4 = best), and a composite score was computed as the sum of scores on component tasks as 0-12 (0 = worst to 12 = best). Complete details on the composite SPPB score in AAH are provided by Miller and colleagues. 21 Chair stands in AAH were measured as the time (maximum of 60 s) it took participants to complete five rises and returns when instructed to complete the task as fast as possible.\nGrip strength testing in AAH was performed in the self-reported stronger hand using either a Jamar (Preston Corp, Jackson, MI) or a baseline (Fabrication Enterprises, Inc., Irvington, NY) isometric dynamometer (pre-testing showed equivalent results using either instrument) and defined as the average (kg) of three maximal trials. Grip strength testing in BLSA was done for both hands and scored as the average (kg) of three trials for each hand separately.\nKnee extensor strength testing in NHANES was done using a Kin Com MP dynamometer (Chattanooga Group, Inc., Chattanooga, TN). Peak torque (Newton/metres) of the quadriceps was measured at 60°/s.\nFrailty in AAH was measured using the FRAIL scale. 11 FRAIL includes five components: fatigue, resistance, ambulation, illness, and loss of weight. FRAIL scores range from 0 to 5 (i.e. 1 point for each component; 0 = best to 5 = worst).\nVital status up to 6 years later in AAH was determined by proxy report as part of the annual AAH follow-up interview plus tracing via local databases (e.g. obituaries). Results were coded 1 for decedents and 0 for survivors. Vital status up to 9.75 years later in BLSA was coded 1 for decedents and 0 for survivors."}, {"section_title": "Statistics", "text": "Data were analysed using IBM SPSS Statistics, version 21 (Somers, NY). Descriptive statistics are reported as means ± standard deviations, median and interquartile range, or percentages. T-test for continuous variables and chi-square for categorical variables were used to compare socio-demographic characteristics of study groups. Internal consistency reliability was evaluated using Cronbach's alpha. Principal components analysis was performed to investigate the homogeneity of SARC-F items. SARC-F associations with muscle mass, SPSM, and frailty were examined using Spearman's rho correlation. Analysis of covariance (continuous outcomes) and logistic regression (dichotomous outcomes) were used to compare participants with SARC-F scores ≥ 4 vs. < 4 in cross-sectional outcomes. Linear regression (continuous outcomes) and logistic regression (dichotomous outcomes) were used to examine the association of SARC-F score ≥ 4 vs. < 4 for longitudinal outcomes and for SARC-F items with cross-sectional and longitudinal outcomes. Means ± standard deviations are reported for analyses of covariance, adjusted odds ratios (ORs) and 95% confidence (SARC-F positive). The characteristics of the SARC-F positive and SARC-F negative groups are shown in Table 1 "}, {"section_title": "Cross-sectional results", "text": "Health outcomes (disability, physical performance, strength, and utilization) for those with SARC-F ≥ 4 vs. < 4 in the AAH, BLSA, and NHANES cohorts are shown in Table 2 . AAH participants with SARC-F scores ≥ 4 had more IADL deficits than those with SARC-F scores of 3 or less, slower chair stands times, lower grip strength, and lower SPPB scores (P s ≤ 0.001). SARC-F scores ≥ 4 in AAH also were associated with a higher likelihood of being hospitalized overnight in the past year and having a gait speed of <0.8 m/s (P s ≤ 0.001). The correlation between total SARC-F scores (0-10) and FRAIL scale scores (0-5) was 0.70 (P < 0.001) in AAH. SARC-F scores ≥ 4 in BLSA were associated with higher IADL difficulties and worse grip strength in both the right and left hands (P s ≤ 0.001). NHANES participants with SARC-F scores ≥ 4 exhibited slower times to walk 20 ft, lower strength (knee extension), and increased likelihood of being hospitalized overnight in the past year (P s ≤ 0.001). Similar associations were seen in cross-sectional comparisons for SARC-F items and outcomes in AAH, BLSA, and NHANES (Table 3) ."}, {"section_title": "Longitudinal results", "text": "SARC-F scores ≥ 4 predicted hospitalization and gait speed of <0.8 m/s at 6 year follow-up in the AAH (P s ≤ 0.05; Table 4 ). SARC-F scores ≥ 4 were also associated with more IADL deficits, slower chair stands times, and lower SPPB scores (P s ≤ 0.01) at 6 year follow-up in AAH. Grip strength was lower for those with SARC-F scores ≥ 4 (27 ± 12) vs. < 4 (32 ± 11) at 6 year follow-up in AAH, but this difference was not statistically significant (P = 0.288). AAH SARC-F scores ≥ 4 predicted 6 year mortality (OR = 1.87, 95% CI 1.17-2.98; P = 0.009) and included 19.7% of persons who died compared with 11.9% of non-SARC-F positive persons who died. SARC-F scores ≥ 4 were associated with more IADL deficits, lower grip strength right hand, and lower grip strength left hand (P s ≤ 0.05) at follow-up in BLSA. SARC-F scores ≥ 4 vs.< 4 also predicted mortality (OR = 3.0, 95% CI 1.57-5.73; P < 0.001) in BLSA. Mortality for BLSA participants was 39.4% for SARC-F ≥ 4 vs. 8.0% for SARC-F < 4. A mortality analysis including only BLSA participants with at least 2 years of follow-up yielded similar results for SARC-F scores ≥ 4 vs. < 4 (OR = 2.69, 95% CI 1.39-5.21; P < 0.001). Similar associations were seen in longitudinal comparisons for SARC-F items and outcomes in AAH and BLSA (Table 5) ."}, {"section_title": "Discussion", "text": "This study demonstrated that a simple clinical score, SARC-F, predicts clinically significant outcomes over the subsequent 6 years in AAH and BLSA. The components of SARC-F are those that would be expected to be associated with poor muscle function. Thus, it is not surprising that cross-sectional SARC-F correlates with knee strength (NHANES) and grip strength (AAH and BLSA). SARC-F also correlates and with frailty on the self-reported FRAIL scale (AAH). The objective of case finding is to identify persons at high risk for adverse outcomes. Based on these findings, SARC-F would be an adequate tool to identify persons with muscle weakness that may be amenable to treatment. At present, the major treatment would be resistance exercise and possibly other forms of exercise coupled with increased protein intake. [22] [23] [24] [25] This study suggests that SARC-F is a rapid, question-based clinical tool that may be a useful sarcopenia screen for primary care physicians. This would then allow referral of persons with positive SARC-F scores for further evaluation and to involve them in resistance exercise programmes. 26, 27 Testosterone may be useful, but its safety has been questioned. 28 A number of drugs such as selective androgen receptor molecules, myostatin inhibitors, and ghrelin agonists are being developed to treat sarcopenia 29 ; if and when proven effective, they may benefit SARC-F positive patients.\nThis approach is similar to the one emerging for fracture risk. Two studies have shown that using the questions included in the FRAX risk assessment tool (www.shef.ac.uk/FRAX), the population can be divided into low risk, intermediate risk, and high risk. 30 If BMD is only measured in those at intermediate risk, the need to measure BMD is avoided in 70% of the population. Selective use of BMD testing had a sensitivity of 87% for identifying fragility fractures. As commonly used definitions of sarcopenia require low gait speed and an appendicular muscle mass corrected for height squared, it would seem that those who are SARC-F positive might need to undergo this more extensive testing.\nThis study has limitations. There were some differences in the items used to construct the SARC-F in AAH and BLSA vs. NHANES. In particular, the SARC-F falls item computed using the NHANES cohort data did not include the number of falls in the past year but rather whether respondents had balance problems or falling problems in the past year. NHANES respondents with falling problems may have had fewer than four falls in the past year, and those who report balance problems but not falling problems may not have had any falls in the past year. Thus, we were not able to determine the number of falls for NHANES respondents, so we were only able to approximate the SARC-F falls item and scoring in NHANES via self-reported balance or falling problems.\nSome outcomes were not available in all cohorts, or the valid sample size was too small for some outcomes to be included in this study. Another limitation is that the AAH cohort included late middle-aged adults at baseline, so the prevalence of sarcopenia among African Americans likely would be higher in an older cohort. On the other hand, late middle age is probably a good time to identify sarcopenia so that it can be stabilized or reversed in time to prevent adverse outcomes, and African Americans are more likely to have frailty. 31 The BLSA cohort does include older adults, but this group is high functioning when enrolled in the study. SARC-F correlations with the performance-based SPSM (AAH) and with muscle mass by bioelectrical impedance (AAH) were modest overall. Thus, additional studies are needed to examine SARC-F's validity in other populations and against standard definitions of sarcopenia (e.g. European Working Group on Sarcopenia in Older People) in prospective studies and to investigate the ability of treatment programs to lower SARC-F scores or prevent adverse outcomes in patients with SARC-F positive. There are currently no data available on the optimal interval or age to screen for sarcopenia. Empirical evidence is also needed to demonstrate that sarcopenia interventions have efficacy for clinical outcomes prior to screening for this syndrome in primary care.\nIn summary, we developed a simple self-report questionnaire (SARC-F) to screen for persons with sarcopenia. The SARC-F includes five items based on cardinal features or consequences of sarcopenia. This study provides evidence that the SARC-F scale in AAH, BLSA, and NHANES cohorts is internally consistent and valid for detecting persons at risk for adverse outcomes from sarcopenia."}, {"section_title": "None declared.", "text": "Odds ratio (95% CI) "}]