[{"section_title": "Abstract", "text": "Tropical cyclone (TC) activity during the period from 1979 -2010 represented by the Emanuel-Nolan \"genesis potential index\" (EN-GPI) is compared and evaluated against observation of TC records over the North Atlantic and the western North Pacific. This study shows that, while the EN-GPI might be a nice proxy in reproducing major climatic features of TC activity (e.g., spatial genesis pattern and seasonal cycle), its performance in representing the interannual TC variability appears to be highly basin-dependent, with a skillful performance over the North Atlantic, but not over the western North Pacific. A term budget analysis of the EN-GPI, along with a number of designed sensitivity experiments, clearly points out that such a huge performance contrast between the two ocean basins must come from a spurious estimation of the \"maximum potential intensity\" (Vpot) term over the western North Pacific for its magnitude being too sensitive to change of SST compared with that over the North Atlantic. A refinement of the EN-GPI according to regional climate conditions is advised to projecting the long-term TC activity, in particular, over the western North Pacific."}, {"section_title": "INtroduCtIoN", "text": "Major components of the earth's climate system like the atmosphere, hydrosphere and cryosphere have experienced unprecedented warming trends on a global scale over the past one-and-a-half centuries (Bell et al. 2000; Huang et al. 2000; Solomon et al. 2007 ). According to the most recent IPCC's (Intergovernmental Panel on Climate Change) fifth assessment report (AR5), such a warming trend appeared to be even more exceptional in recent decades as each of the last three decades has been successively warmer than any preceding one (Stocker et al. 2013) . While global warming has been recognized to exert various effects on the earth's climate system, the most prominent impacts on the atmosphere typically include an increase in summer heat waves (Meehl et al. 2009; Trenberth and Fasullo 2012) , a change in the amount and pattern of regional precipitation (Chou and Neelin 2004; Pall et al. 2011; Trenberth 2011; Chen et al. 2016) , and a probable change in the frequency and intensity of some extreme weather events (Webster et al. 2005; Emanuel 2008; Hoerling et al. 2013; Kharin et al. 2013; Vose et al. 2014) .\nAmong various extreme weather events, tropical cyclones (TCs) are perhaps the most devastating ones because of their potential of causing massive destruction of properties and loss of lives (Graumann et al. 2005; Chien and Kuo 2011) . Over the past two decades, increasing attention has been paid to exploring the connection between TC activity and climate change, especially for those basins with frequent TC geneses while surrounded by dense population countries such as the North Atlantic (Goldenberg et al. 2001; Holland and Webster 2007) and the western North Pacific (Chan and Liu 2004; Tian et al. 2013) . Accordingly, one mission of particular importance in the TC-climate interaction study is to develop a method (or metric) that can to some extent reproduce the long-term variability of TC activity under the changing climate.\nCurrently, two approaches are widely used in exploring the connection between TC activity and climate change.\nIn the first approach, the occurrence frequency of TC-like vortices is explicitly simulated using high-resolution coupled climate models, typically with a horizontal resolution less than 20 km (Murakami and Wang 2010; Murakami et al. 2012; Manganello et al. 2014; Vecchi et al. 2014) . Since this approach utilizes coupled climate models with full dynamics and physics, it is often referred to as the \"dynamical method\" in the TC-climate interaction study. Although the dynamical method has demonstrated some progresses over the past few years, it still represents only a small fraction of the TC-climate interaction study, especially in projecting the future TC activity changes under global warming, because most of the climate models presently used to project long-term climate change do not provide enough spatial and temporal resolutions to resolve the genesis and development of TC-like vortices.\nInstead of explicitly simulating the TC-like vortices, the second approach, on the other hand, predicts changes of large-scale environmental factors which are closely associated with TC activity based on simulation outputs from relatively coarse-resolution climate models (Camargo et al. 2007b (Camargo et al. , 2014 Bruyère et al. 2012 ). Because such approach requires an empirical formula to describe the connection between environmental factors and TC genesis potential based on a statistical fitting procedure of historical TC genesis records, it is generally referred to as the \"statistical method\" or \"empirical method\" in the TC-climate interaction study. Gray (1979) first proposed a \"seasonal genesis parameter\" to empirically diagnose the TC genesis potential using large-scale environmental factors associated with TC activity, which include the low-level relative vorticity, mid-troposphere humidity, vertical wind shear, atmospheric stability, as well as the heat content of upper ocean. In a similar fashion, Emanuel and Nolan (2004) proposed a \"genesis potential index\" (hereafter EN-GPI) by incorporating the \"potential intensity\" (a theoretical limit of the maximum strength of a tropical cyclone) term instead of the atmospheric stability and ocean heat content terms into the empirical index for mapping the frequency of TC genesis. The EN-GPI has been widely applied to predicting changes of TC activity associated with climate variability of various timescales, including the Madden-Julian Oscillation (Camargo et al. 2009 ), El Niño/Southern Oscillation (Camargo et al. 2007a; Tsuboi and Takemi 2014) , and anthropogenic global warming (Camargo et al. 2007b; Zhang et al. 2010) .\nAlthough the composite EN-GPI anomalies have demonstrated some skills in generating the observed frequency and location of TC genesis associated with ENSO and MJO in major ocean basins, causes for its poor performance in reproducing the observed year-to-year TC variability over the western North Pacific have never been investigated. In this study, historical TC activities during the period from 1979 -2010 over the North Atlantic and western North Pacific represented by the EN-GPI are evaluated and compared against observations. In section 2, we briefly introduce the data and methods used in this paper. The performance of EN-GPI in reproducing the observed spatial genesis pattern, annual cycle and interannual variability of TC activity is presented in section 3. A term budget analysis of the EN-GPI, along with several sensitivity tests, is conducted in section 4 to explore the causes attributing to the nice (poor) performance of EN-GPI over the North Atlantic (western North Pacific). Major findings and implications from this study are summarized in section 5."}, {"section_title": "dAtA ANd mEthodology", "text": ""}, {"section_title": "data sources", "text": "The best-track data of TCs produced by the \"international best track archive for climate stewardship\" (IBTrACS) project is used to examine the performance of EN-GPI in representing historical TC genesis patterns over the North Atlantic and western North Pacific. The IBTrACS data combines tropical storm information from multiple regional hurricane centers or meteorological institutes into a global best-track product. This dataset contains 6-hourly records of location and intensity of all TCs from 1965 to the present (Knapp et al. 2010 ). As in most previous studies, only TC systems reaching at least the tropical storm intensity (i.e., the maximum sustained wind speed v max ≥ 35 knots) during the period from 1979 -2010 are counted here. While a number of metrics have been designed to stratify various aspects of the basin-scale seasonal TC activity, including the \"accumulated cyclone energy index\" (Bell et al. 2000; Waple et al. 2002) , \"power dissipation index\" (Emanuel 2005) , and their revised versions (Yu et al. 2009; Yu and Chiu 2012) , we prefer to use the \"number of tropical cyclones\" (NTC) to characterize the magnitude of basin-scale seasonal TC activity as in most previous studies (Chan and Liu 2004; Holland and Webster 2007; Murakami and Wang 2010; Murakami et al. 2012; Manganello et al. 2014) .\nTwo modern atmospheric reanalysis products are chosen to compute the magnitude of EN-GPI, including the ERAinterim (European Re-Analysis-interim) and CFSR (climate forecast system reanalysis) reanalysis data. The ERA-interim data, generated by the interim reanalysis project at EC-MWF (European Center for Medium-Range Weather Forecast) with an improved atmospheric model and assimilation system, is regarded as a successor of the early ERA-40 data. The ERA-interim data provides a global coverage of meteorological parameters at surface and 37 pressure levels from 1979 to the present, with a horizontal resolution of 0.75° × 0.75° (Dee et al. 2011) . The CFSR data is the newest generation product developed by National Center for Environmental Prediction (NCEP), which is considered to be superior to previous NCEP reanalysis products due to its improved model design, higher resolution, and a better assimilation of satellite radiance. The CFSR data provides a global coverage of meteorological variables at surface and 67 pressure level from 1979 -2010, with a slightly finer horizontal resolution of 0.5° × 0.5° (Saha et al. 2010) .\nIn addition to the atmospheric data, the Hadley Center sea surface temperature data (HadSST3) is also adopted in calculating the \"potential intensity\" of hurricane (Emanuel 1986; Emanuel and Nolan 2004) , which is a key component in determining the magnitude of EN-GPI. The HadSST3 product is a monthly global sea surface temperature (SST) data based on ICOADS (International Comprehensive Ocean-Atmosphere Data Set) from 1850 -2006 and on NCEP GTS (Global Telecommunications System) observations from 2007 onwards, with a horizontal resolution of 5° × 5°. Bias adjustments were taken in HadSST3 to remove spurious trends caused by changes in SST measuring practices (Kennedy et al. 2011a, b) .\nIn this study, only monthly-mean fields of atmospheric temperature, mixing ratio, sea-level pressure, and SST during the period from 1979 -2010 are utilized to calculate the magnitude of EN-GPI. For consistency, all atmospheric data are re-gridded into a 5° × 5° horizontal resolution prior to the calculation."}, {"section_title": "Emanuel-Nolan genesis Potential Index", "text": "The \"genesis potential index\" (GPI) proposed by Emanuel and Nolan (2004) \nwhere h is the absolute vorticity at 850 hPa (in units of s -1 ), RH is the relative humidity at 700 hPa (in units of %), Vshear denotes magnitude of vertical wind shear between 850 and 200 hPa, and Vpot represents the maximum potential intensity of tropical cyclone (both in units of m s -1 ). The maximum potential intensity defined by Bister and Emanuel (2002) has the following formula:\nwhere C k and C D represent the exchange coefficients associated with enthalpy and momentum, respectively, T s is the sea surface temperature and T 0 is the mean outflow temperature. The quantity CAPE * represents the saturation convective available potential energy (CAPE) at the radius of maximum wind; while CAPE b denotes the value of CAPE at ambient boundary layer. It is noted that, for the same amount of SST perturbation, the size of Vpot is determined mainly by (CAPE * -CAPE b ) whose magnitude tends to be larger in a warmer and/or moister atmosphere (Bister and Emanuel 2002) .\nThe horizontal patterns of EN-GPI climatology derived from the ERA-interim and CFSR data are displayed in Fig. 1 . As shown, major TC genesis basins around the globe, including western North Pacific, eastern North Pacific, northern Indian, northern Atlantic, southern Indian, and southern Pacific, are all successfully reproduced by the EN-GPI. Except for magnitude differences, the spatial pattern of EN-GPI derived from CFSR data resembles the one calculated from ERA-interim data. On average, the sizes of EN-GPI derived from CFSR data are about 40 -50% larger than those derived from ERA-interim data due to more humid atmosphere in the former compared to the latter. Similar patterns are also found in describing the seasonal cycle and interannual variability of EN-GPI between the two atmospheric data (figures not shown). Because major conclusions of this study are independent of the choice of atmospheric reanalysis data, therefore only the EN-GPI products calculated from the ERA-interim data will be used in the following discussions."}, {"section_title": "term budget Analysis", "text": "To stratify the dominant terms attributing to the interannual variability of EN-GPI, a simple term budget analysis is required. For ease of evaluation, a binary logarithm conversion similar to Li et al. (2013) is taken on Eq. (1) to yield cGPI cETA cRH cVpot cVshear = + + +\nwhere cGPI = log 2 (GPI), cETA = log 10 / 2 5 3 2 ĥ h , and so on. We note that, under such a simple conversion, the magnitude of EN-GPI becomes a linear combination of four independent terms, i.e., absolute vorticity, low-level moisture, maximum potential intensity and vertical wind shear effects. This approach allows us to provide a quantitative measure of the individual term's contribution to the EN-GPI variability in a rather straightforward fashion."}, {"section_title": "rEPrEsENtAtIoN of hIstorICAl tC ACtIvItIEs", "text": "In this section, TC activities over North Atlantic and western North Pacific represented by the EN-GPI are compared against the IBTrACS data, focusing on the genesis climatology of TC and the associated interannual variability."}, {"section_title": "spatial and temporal Climatology", "text": "Figure 2 compares the spatial climatology of TC genesis and EN-GPI over North Atlantic (left panel) and western North Pacific (right panel) during the period from 1979 -2010. In general, the spatial patterns of EN-GPI agree well with historical TC genesis records over both basins, with greater magnitudes of EN-GPI occurring over regions of larger TC population. For instance, the frequent TC genesis zone around 10°N of the Caribbean Sea, the two dense TC population areas around Gulf of Mexico and Bahamas Islands (see the left panel), and the large TC population areas around Philippine Sea and South China Sea (see the right panel) are all nicely reproduced by the EN-GPI. The mean magnitude of EN-GPI over the western North Pacific is about twice the size of that over the North Atlantic (e.g., 2.1 vs. 1.0), consistent with the annual mean NTC contrast between the two basins (e.g., 24.7 TCs/year vs. 12.2 TCs/year). Figure 3 compares the seasonal cycle patterns of NTC and EN-GPI over the North Atlantic (left panel) and the western North Pacific (right panel), averaged over the period of 1979 -2010. As shown, marked seasonal variations of NTC exist in both basins. Over the North Atlantic, major TC season is confined in a relatively short period of the year, with July, August, September, and October accounting for about 85% of the total NTC. Over the western North Pacific, however, major TC season appears to span a much longer period of time compared with North Atlantic as it takes six months (i.e., June, July, August, September, October, and November) to account for approximately the same 85% of the total NTC. Overall, the seasonal cycle patterns of EN-GPI coincide well with NTC in both basins, with correlation coefficients (γ) of about 0.92 and 0.98 for North Atlantic and western North Pacific, respectively.\nThe nice agreements of spatial genesis climatology and seasonal cycle pattern between EN-GPI and NTC shown in Figs. 2 and 3 are perhaps not so surprising, because the EN-GPI was designed by a statistical fitting procedure based on seasonal cycle and spatial variation of the global TC genesis climatology (Emanuel and Nolan 2004) . Therefore, the real challenge for EN-GPI's applications relies on its performance in reproducing the observed long-term TC variability, which is discussed right below. Figure 4 compares the yearly time series between NTC and EN-GPI over the North Atlantic (left panel) and the western North Pacific (right panel) during the period from 1979 -2010. Over the North Atlantic, the year-to-year variability of NTC is quite striking, with magnitudes of NTC in active years often several times larger than those in inactive years. For instance, 29 TC events appeared in 2005; while only 4 TC events occurred in 1983. Over the western North Pacific, although the year-to-year variability of NTC is still sizable, the contrast between active and inactive years is much weaker compared to the North Atlantic, possibly due to the much longer TC season for the western North Pacific basin."}, {"section_title": "Interannual variability", "text": "As shown in Fig. 4 , the performance of EN-GPI in representing the observed interannual TC variability tends to be basin-dependent. A robust correlation between EN-GPI and NTC appears over the North Atlantic (γ = 0.76), but not over the western North Pacific (γ = -0.04). However, if one takes a closer look of the latter (see right panel), the poor performance of EN-GPI over the western North Pacific appears to come from a spurious projection of the NTC trend around 1998/99. When the data period are split into two at 1997/98, the correlation between EN-GPI and NTC readily improves (e.g., γ = 0.27 and 0.49 respectively over the periods 1979 -1997 and 1998 -2010) . However, given such an improvement, the performance of EN-GPI over the western North Pacific is still far below that over the North Atlantic."}, {"section_title": "mEChANIsm ExPlorAtIoN", "text": "To explore the causes responsible for the aforementioned poor performance of EN-GPI over the western North Pacific, a term budget analysis is carried out (see section 2.3 for methodology). In additional to the common correlation analysis, which measures the similarity between two time series, the fractional variances of each term on the right hand side of Eq. Tables 1 and 2 , respectively, to help justify the term budget results. Figure 5 and Table 1 demonstrate the term budget results conducted over the North Atlantic. In terms of time series similarity, the four different terms on the right hand side of Eq. (3) exhibit a high degree of similarity with cGPI, with correlation coefficients all greater than 0.62. When their fractional variances are considered, it further suggests that cRH and cVshear are the dominant terms responsible for the interannual variability of cGPI over the North Atlantic, accounting for about 56 and 52% of the total variance, respectively. On the other hand, cVpot term seems to play only a minor role (32%); while the contribution from cETA term is minimal (9%). The term budget results clearly indicate that the interannual variability of EN-GPI over the North Atlantic must come from a joint contribution of the vertical wind shear and low-level moisture effects, with a minor contribution from the maximum potential intensity effect."}, {"section_title": "term budget Analysis of EN-gPI", "text": "Likewise, Fig. 6 and Table 2 demonstrate the term budget results conducted over the western North Pacific. Much to our surprise, discrepancies of dominant terms occur between the North Atlantic and the western North Pacific. Over the western North Pacific, cRH term exhibits the greatest similarity with cGPI (γ = 0.71), followed by cVpot (γ = 0.51), and cVshear (γ = 0.37) terms; while little similarity exists between cETA and cGPI terms (γ = 0.10). When their fractional variances are considered, it further indicates that the interannual variability of EN-GPI over the western North Pacific is controlled mainly by cRH and cVpot terms, accounting for about 66 and 59% of the total variance, respectively. It is noted that, although the contribution from cVshear term seems non-negligible in terms of fraction variance (43%), its role in shaping the cGPI variability should be modest due to its relatively small correlation with cGPI. Again, the contribution from cETA term is small (13%). From the above results, we may reasonably conclude that the low-level moisture and maximum potential intensity effects dictate the interannual variability of EN-GPI over the western North Pacific, followed by a modest contribution from the vertical wind shear effect.\nThe apparent discrepancies of dominant terms in describing the interannual variability of EN-GPI between the two basins provide a clue to diagnose the causes responsible for the huge performance contrast of EN-GPI between the two basins. To elaborate, Table 3 measures the similarity between the time series of NTC and the four different terms on the right hand side of Eq. (3). Over the North Atlantic, all terms exhibit a large degree of similarity with NTC, with correlations all greater than 0.56 (see the first row of Table 3 ), consistent with the results shown in Fig. 4a and Table 1 . In contrast, the time series similarity measurement becomes very different over the western North Pacific (see the second row of Table 3 ). Except for cETA term, the other three (cRH, cVpot, and cVshear) terms all show poor similarity with NTC, especially for cVpot term whose correlation with NTC is even negative (γ = -0.31). It is thus speculated that a spurious estimation of the Vpot magnitude might be responsible for the poor performance of EN-GPI in representing the observed interannual TC variability over the western North Pacific."}, {"section_title": "sensitivity Experiments", "text": "To test the above speculation, five sensitivity experiments are conducted over the western North Pacific, with variability of each contributing effect on the right hand side of Eq. (1) being successively off one at a time (Li et al. 2013) . For example, in the \"CliETA\" experiment, the climatological field of absolute vorticity is adopted instead of the original monthly field in calculating the yearly magnitudes of EN-GPI to exclude the effect due to absolute vorticity variability. Accordingly, in the \"CliRH\", \"CliVpot\", and \"CliVshear\" experiments, the climatological fields of RH, Vpot and Vshear are adopted, respectively. An extra \"CliSST\" experiment is also conducted, in which the climatological field of SST is adopted in calculating the yearly magnitude of Vpot, to test the effect due to SST variability. Results from the above sensitivity experiments are then compared with Fig. 4b (γ = -0.04 between GPI and NTC) in which all terms on the right hand side of Eq. (1) are considered (which is referred to as the STND case in Table 4 ).\nAs shown in Table 4 , a significant improvement of EN-GPI's performance occurs in the CliVpot experiment (γ = 0.33) when the effect of maximum potential intensity variability is excluded. On the other hand, a slight improvement exists in the CliRH experiment (γ = 0.14), but slightly worse performances occur in the CliETA (γ = -0.05) and CliVshear (γ = -0.14) experiments. Surprisingly, the best performance exists in the CliSST experiment (γ = 0.55) when the effect of SST variability is excluded. The aforementioned results clearly suggest that the poor performance of EN-GPI in representing the observed interannual TC variability over the western North Pacific must come from a spurious estimation of the maximum potential intensity (Vpot) term associated with the SST variability."}, {"section_title": "relation between vpot and sst", "text": "The much improved performance shown in the CliSST experiment implies that the architecture determining the magnitude of Vpot (and hence the magnitude of EN-GPI) might be too sensitive to changes of SST, especially over the western North Pacific. To elaborate, Fig. 7 shows the relation between Vpot and SST over the North Atlantic and the western North Pacific. As shown, magnitudes of Vpot are strongly tied to SST in both basins, with greater values occurring over regions of warmer SST. Over the North Atlantic (see the left panel), the dependence of Vpot on SST is quite linear, with the magnitude of Vpot increasing by approximately 7 m s -1 for 1°C increase in SST. Over the western North Pacific, however, the dependence of Vpot on SST may vary, depending on the range of SST. For instance, for SST ≤ 26°C, the magnitude of Vpot increases by only 5 m s -1 for 1°C increase in SST; while for SST ≥ 26°C, the magnitude of Vpot increase by about 10 m s -1 for the same 1°C increase in SST, and the latter is much larger than that over the North Atlantic.\nTo understand why magnitudes of Vpot are much sensitive to changes of SST over the western North Pacific compared with those over the North Atlantic, Fig. 8 shows the spatial climatology of (CAPE * -CAPE b ) over the North Atlantic (see the left panel) and the western North Pacific (see the right panel). Except for the extra-tropical region (> 30°N), magnitudes of (CAPE * -CAPE b ) over the western North Pacific are generally larger than those over the North Atlantic. For SST ≥ 26°C, the mean magnitude of (CAPE * -CAPE b ) over the western North Pacific (~9500 J kg -1 ) is approximately 34% larger than that over the North Atlantic (~7100 J kg -1 ). Since most TCs occur over oceans with SST warmer than 26°C, the above results support that magnitudes of the maximum potential intensity (Vpot) term in response to SST variability have been notably over-weighted over the western North Pacific, resulting in a spurious projection of the EN-GPI variability in response SST warming as shown in Fig. 4b ."}, {"section_title": "CoNClusIoN ANd dIsCussIoN", "text": "In this paper, historical TC activity over the North Atlantic and the western North Pacific represented by the EN-GPI is compared and evaluated against IBTrACS TC observations, focusing on climatology of TC activity and the associated interannual variability during the period from 1979 -2010. We find that, while the EN-GPI might be a nice proxy in generating major climatic features of TC activity (e.g., spatial genesis pattern and seasonal cycle), its performance in reproducing the observed interannual TC variability appears to be highly basin-dependent, with a skillful performance over the North Atlantic (γ = 0.76), but not over the western North Pacific (γ = -0.04).\nA term budget analysis of the EN-GPI clearly shows that dominant terms attributing to the interannual EN-GPI variability differ between the two basins. Over the North Atlantic, the interannual EN-GPI variability is controlled mainly by the vertical wind shear and low-level moisture terms, followed by a modest contribution from the maximum potential intensity term. Over the western North Pacific, nonetheless, the low-level moisture and maximum potential intensity terms dictate the interannual EN-GPI variability, with a minor role from the vertical wind shear term. By conducting sensitivity experiments, we further show that the poor performance of EN-GPI in describing the observed interannual TC variability over the western North Pacific must come from a spurious estimation of the maximum potential intensity (Vpot) for its magnitude being too sensitive to change of SST. Because SST over the western North Pacific is well above 26°C, change of SST within a few tenths of a degree ought not to be a major factor determining the TC activity.\nAnother important factor for the failure of EN-GPI over the western North Pacific comes from a missing representation of the decadal shift of TC activity in late 1990s, which is known to be the transition period from more eastern Pacific El Niño years to more central Pacific El Niño years. Recent studies (Hsu et al. 2013; Zhang et al. 2015) showed that TC activity over the western North Pacific, including genesis location, frequency and intensity, may notably change in response to different types of El Niño events. This suggests that a qualified GPI should take into account the effect of long-term natural variability on TC activity. Besides, we also tested a number of weighting combinations for the environmental factors to see whether improvements may occur. Surprisingly, the results are still far from satisfaction with correlations between NTC and EN-GPI all smaller than 0.1. It appears that the current architecture of EN-GPI is incapable of capturing the natural climate variability embedded as long as the \"potential intensity\" (Vpot) is too sensitive to SST changes.\nThis study immediately implies that a refinement of the EN-GPI architecture according to regional (local) climate conditions is required, especially over the western North Pacific, before it can be applied to projecting future changes of TC activities associated with global warming. A new design of GPI for the western North Pacific is currently underway and it will be introduced in our next paper.\nthe MuGPI yields improved results over the eastern Pacific and Atlantic ITCZ regions compared with observations of TC genesis although some inconsistencies remain in the other regions.\nMeanwhile, Emanuel (2010 Emanuel ( , 2013 recognized that the dependence on water vapor should not be on relative humidity but on saturation deficit and he introduced a new formulation of the genesis potential index based on moist entropy deficit: \nwhere b is an empirical constant chosen to conform to a particular atmospheric dataset (in this study, b = 10 is chosen). Here, we refer to Eq. (A3) as the KoGPI. It is noted that these three modified GPIs all keep the original definition of potential intensity (Vpot) in the formulations, which allows us to evaluate the performance of various Vpot-based GPIs in a consistent manner. Since all three modified GPIs generate reasonable results in reproducing the observed historical interannual TC variability over the North Atlantic (figures not shown), here we just focus on their performance over the western North Pacific. Similar to Fig. 4, Fig. A1 shows the yearly time series of NTC against those of MuGPI, ChiGPI, and KoGPI. Despite justifiable refinements, all three modified GPIs fail to reproduce the observed historical TC variability, with poor correlations between NTC and GPIs (e.g., -0.02, -0.14, and -0.08 for MuGPI, ChiGPI, and KoGPI, respectively). The failure in representing NTC variability again comes mainly from a missing representation of the decadal decline of TC genesis in 1998, similar to the situation occurring in EN-GPI (see Fig. 4b for comparison) .\nTo explore the causes for the above poor correlations, we conduct term budget analyses of Eqs. (A1), (A2), and (A3) using the same binary logarithm conversion. Table A1 summarizes the correlations between the time series of NTC and sub-terms of MuGPI, ChiGPI, and KoGPI. Similar to the results shown in EN-GPI, the potential intensity (cVpot) term is again mainly responsible for the poor performance of these modified GPIs, followed by the moisture term (cRH or cChi). It appears that the addition of vertical velocity term (e.g., MuGPI) or the use of moist entropy deficit instead of relative humidity (e.g., ChiGPI and KoGPI) is insufficient to improve the performance of GPI as long as the \"potential intensity\" (Vpot) term is too sensitive to SST changes over the western North Pacific. A new design of the \"potential intensity\" term is highly recommended in order to improve its performance over the western North Pacific. This newly designed GPI will be presented in our next study. "}]