[{"section_title": "Introduction", "text": "Since being detected in Wuhan, China, in December 2019, the novel severe acute respiratory syndrome coronavirus 2 (SARS-COV-2) has spread to 216 countries, areas or territories worldwide including 54 African countries where more than 95,000 cases have been confirmed with over 2,950 deaths and 34,000 recoveries [1] . SARS-COV-2 is the etiologic agent for the coronavirus disease (COVID-19), which is now a pandemic. Real time reverse transcription polymerase chain reaction (RT-PCR) is currently the test for the detection of SARS-COV-2 in human samples derived from the lower or upper respiratory tract [2] .\nPositive tests using blood and anal swabs have also been reported [3, 4] . Swabs or fluid is used for the isolation of genetic material, RNA, which is reversed transcribed to cDNA and amplified in the presence of specific reagents (such as primers, probes), if the virus was present in the clinical samples. In the absence of the virus, no viral RNA will be present and consequently no amplification. Since the beginning of the SARS-COV-2 outbreak, the World Health Organisation (WHO) has provided training to atleast 44 African countries who now have the capacity to perform RT-PCR testing to detect the virus [1] . Africa Centre for Disease Control and Prevention (Africa CDC) is also instrumental in supporting member states with reagents and equipment to facilitate testing for SARS-COV-2 [9] . In this review, we aimed to evaluate studies comparing laboratory testing by RT-PCR to other detection tests, mainly serology tests for antibodies against SARS-COV-2 (including the rapid diagnostic tests, RDTs) and their relevance in the fight against COVID-19 in Africa. We also summarise evidence for the SARS-COV-2 genome sequencing in Africa and the importance in the context of global data."}, {"section_title": "Methods", "text": "We performed a search of peer-reviewed published articles indexed mainly on PubMed (28 th April 2020) for the diagnosis of SARS-COV-2 (Table 1) . We also searched MedRxiv and BioRxiv for publicly available articles that may not yet have been peer-reviewed. Reference lists of published articles (including reviews) and documents on databases such as WHO, CDC and GISAID were also scanned for potential articles."}, {"section_title": "Current status of knowledge", "text": "We went through the search result articles and selected either the primary research articles or meta-analyses of articles that compared two or more tests for the detection of SARS-COV-2. Normal review articles or personal communication or articles reporting only treatment strategies (without a virus detection component) were not included in the summary, but some critical ones were referenced where necessary. Only articles reporting data (complete or partial) in English were selected. We categorized articles that compared RT-PCR and any antibody test (26 articles) (Table 2) [4,10-34], or articles that compared RT-PCR with any test that was described as \"rapid\" or \"point-of-care\" (8 articles) [35] [36] [37] [38] [39] [40] [41] [42] , for the detection of SARS-COV-2 ( (1) . A further 4 articles were found that describe the detection of neutralizing antibodies against SARS-COV-2 with no direct comparison with RT-PCR, mainly for therapeutic purposes and not discussed in this review. These were from Mainland China (2), USA (1) and Singapore (1) [43] [44] [45] [46] ."}, {"section_title": "RT-PCR and serology antibody tests to detect SARS-COV-2:", "text": "RT-PCR was used as the gold standard for detecting SARS-COV-2 and the antibody tests were compared to the RT-PCR test. All studies evaluated either immunoglobulin M (IgM) or IgG or both that are specific for SARS-COV-2. There was a wide variation between studies in the number of participants included or those who underwent molecular (and serology) testing for SARS-COV-2, ranging from 1 participant (five case reports) to 951 participants (though not all had both tests performed) ( Table 2 ). The agreement between the RT-PCR and the antibody detection tests ranged from 100% to below 20%.\nThe antibodies against SARS-COV-2 were detected from as early as 2 days post onset of symptoms to as late as 7 weeks or more post onset of symptoms. With a few exceptions that used plasma alone, most studies evaluated the antibodies using serum (sometime with plasma and whole blood as well) that was collected from participants at only, which can produce results in less than an hour from sample collection [49] . Eventhough hands-on sample processing of swabs after collection is minimal, expensive equipment are still needed to perform the test, making it less suitable for mass screening in resource-limited settings ( Table 2, Table 2 (suite)). [50] [51] [52] . This is commendable but more countries and governments, with the support of international organisations such as the WHO, will need to support and encourage more collection and sequencing of the various circulating strains on the continent."}, {"section_title": "Genome sequencing of the SARS-COV-2 strains in", "text": "Institutions such as the pathogens genomics intelligence institute (PGII) of the Africa CDC will be instrumental in facilitating the sequencing of genomes for SARS-COV-2 and other pathogens and strengthening health systems and institutions for improved prevention, detection and response to public health threats on the continent and beyond [53] . COVID-19 pandemic has also presented the opportunity for African researchers in science and technology to collaborate more and pull resources together to increase research on COVID-19 and other infectious diseases in Africa [54] . For example, researchers may be able to share information or collaborate so that those with more resources could assist in sequencing the strains from countries with less resources. DRC has contributed more than 66% of the SARS-COV-2 genome sequences from Africa likely due to the established infrastructure from the Ebola virus response. Other African countries may leverage this available infrastructure to sequence more genomes.\nEven though we performed a comprehensive search for articles to include in this review, the search was not exhaustive as we did not search all available databases. We are confident that even if we missed any studies, the evidence will not be drastically different from that presented in this review. Because RT-PCR was used as the goldstandard, we limited our selected articles to only studies that performed RT-PCR in addition to the serology test for comparison purposes and studies that performed RT-PCR alone or serology test alone were not considered."}, {"section_title": "Conclusion", "text": "As SARS-COV-2 infections continue to rise on the continent, Africa will "}, {"section_title": "Competing interests", "text": "The authors declare no competing interests. Table 1 : search terms and number of studies identified Table 2 : studies comparing the use of molecular and serology assays for the detection of SARS-COV-2 with key findings from each study The hits in #2, #3, #4 were all mostly subsets of #1 Singapore (28) 27 patients were RT-PCR+. All patients had detectable antibodies. *From medRixv and not certified by peer review; #Meta-analyses; N, total number of participants in study (but not all underwent molecular and or serological testing)"}]