[{"section_title": "Abstract", "text": "Abstract An Anthropogenic Climate Change Index (ACCI) is developed and used to investigate the potential global warming contribution to current tropical cyclone activity. The ACCI is defined as the difference between the means of ensembles of climate simulations with and without anthropogenic gases and aerosols. This index indicates that the bulk of the current anthropogenic warming has occurred in the past four decades, which enables improved confidence in assessing hurricane changes as it removes many of the data issues from previous eras. We find no anthropogenic signal in annual global tropical cyclone or hurricane frequencies. But a strong signal is found in proportions of both weaker and stronger hurricanes: the proportion of Category 4 and 5 hurricanes has increased at a rate of *25-30 % per°C of global warming after accounting for analysis and observing system changes. This has been balanced by a similar decrease in Category 1 and 2 hurricane proportions, leading to development of a distinctly bimodal intensity distribution, with the secondary maximum at Category 4 hurricanes. This global signal is reproduced in all ocean basins. The observed increase in Category 4-5 hurricanes may not continue at the same rate with future global warming. The analysis suggests that following an initial climate increase in intense hurricane proportions a saturation level will be reached beyond which any further global warming will have little effect."}, {"section_title": "Introduction", "text": "Recent community consensus ; Intergovernmental Panel on Climate Change-IPCC 2012) has concluded that it is likely that the frequency of intense hurricanes will increase with future anthropogenic climate change. The increases are substantial, approaching a doubling in frequency of Cat 4 and 5 hurricanes [based on the Saffir-Simpson classification, Simpson and Rielh (1981) ] for each°C in global warming (Bender et al. 2010; IPCC 2012; Done et al. 2012) . IPCC (2007) also concluded that the current 'warming of the climate system is unequivocal'. If we accept these two statements, then it logically follows that there should already be an observable increase in intense hurricanes. Yet IPCC (2012) concluded that 'There is low confidence in any observed long-term (i.e., 40 years or more) increases in tropical cyclone activity', based largely on potential errors in the observed data. Here we investigate this apparent anomaly and find that there has been an increase in the proportion of intense hurricanes relative to all hurricanes, and that is strongly related to an Anthropogenic Climate Change Index (ACCI). The index is developed in Sect. 2; Sect. 3 examines the recent hurricane signal, and discusses some of the consequences; and our conclusions are in Sect. 4."}, {"section_title": "An index of anthropogenic climate change", "text": "It is often assumed that anthropogenic climate change has occurred as a quasi-linear warming trend from around the turn of the twentieth century. This causes considerable problems with assessing the impact of climate change on severe weather events such as hurricanes (e.g. Knutson et al. 2010) . However, comparison of global climate model simulations with and without anthropogenic forcing ( Fig. 1) indicates that the net anthropogenic climate forcing-including cooling as well as warming agents-was indistinguishable from natural variability until the midtwentieth century (Meehl et al. 2004 (Meehl et al. , 2007 (Meehl et al. , 2012 IPCC 2007) . The ensembles of model simulations with and without anthropogenic emissions closely track each other and the observed global surface temperature until around 1970. After then, the anthropogenic simulations continue to track the observed global warming, but those with only natural forcing indicate a cooling trend back to nineteenth century temperature levels. This change has been attributed to reductions in emissions of sulfate aerosols, which counteracted the warming component due to greenhouse gases before 1960 (Meehl et al. 2004 (Meehl et al. , 2012 Mann and Emanuel 2006; Thompson et al. 2010) .\nWe therefore define an ACCI by the difference between the model simulations with and without anthropogenic gases. When applied to the ensemble means from Fig. 1a , the ACCI is essentially zero until around 1960 (Fig. 2a) , after which an exponential change to a quasi-linear increase of around 0.35°C per decade commenced. The results in this paper are robust to the details of the derivation of the ACCI, for example by replacing the anthropogenic simulations with the observed temperatures. Some earlier warming is seen in the more recent CCSM4 simulation (Community Climate System Model, Figs. 1b, 2a) , which is considered to be due to the lack of an indirect effect for sulfates in the model (Meehl et al. 2012) . We also examined defining ACCI from ensemble information, including taking the ensemble extremes and other combinations. Our conclusions are robust to all of these approaches.\nThe ACCI data in Fig. 2a indicate that consideration of the impact of anthropogenic climate change should be limited to the last four decades. This is quite different to a number of other studies that have assumed an essentially linear warming over the past 100 years or so [see, e.g. Knutson et al. (2010) for hurricane implications]. If greenhouse gases alone are considered then an extended period of nearly linear warming is justified, but anthropogenic impacts on the climate also arise from a range of other contributors that have counteracted the pure greenhouse gas warming until recently [see Meehl et al. (2012) for a detailed discussion]. For the global hurricane analysis we choose to focus on the slightly shorter period from 1975 to 2010, as this is a reasonably homogeneous period of global satellite data; going back to 1960 does not affect our conclusions. CMIP5 (Coupled Model Intercomparison Project 5) data were not available at the analysis time, so to enable use of the full tropical cyclone record, we use the CMIP3 ACCI up to 2000 and extend this to 2010 using the annual changes in CCSM4. A test using linear extrapolation of the CMIP3 data to 2010 produced essentially the same results. Figure 2b compares the ACCI with the observed annual tropical (30°north and south) sea surface temperature (SST) anomalies relative to the mean for 1975-2010 from the merged Hadley Centre and NOAA's optimum interpolation (OI) SST data set (Hurrell et al. 2008) . They track each other closely with the ACCI explaining [50 % of the observed tropical SST variance (p \\ 0.01). Note that the slope in Fig. 2b is \\1, since the ACCI values have an additional component arising from the net cooling in the natural forcing simulations ( Fig. 1 ) compared to the observations. Focusing on the relationship with ACCI from 1975 removes much of the hurricane analysis difficulty that has been experienced with issues such as changing observing systems and analysis approaches prior to 1975 (e.g. Landsea et al. 2006; Knutson et al. 2010; Holland and Webster 2007) . The approach of using a global index also is consistent with the findings of Grinsted et al. (2012) , who showed that North Atlantic landfalling hurricane variations are more closely related to global mean SST than they are to local SST or climate indices. We shall show that using a shorter period of record is not a concern as the signal is large and significant."}, {"section_title": "Global tropical cyclone changes", "text": ""}, {"section_title": "Data", "text": "The tropical cyclone analysis is based on the global IBTrACS data set (Knapp et al. 2010) . A homogeneous satellite reanalysis by Kossin et al. (2007) found close agreement of the archived intensities in the North Atlantic and western North Pacific, but there were inconsistencies for more intense storms in the other regions. We utilize the recent update to this analysis (Kossin 2012) as an independent check on the IBTrACS results.\nArchived intensities are somewhat of a hodge-podge of different approaches and definitions. Even at the most basic level, the definition of wind speed varies considerably around the globe, with 1, 10, 3 and even 2-min averaging periods in use (Harper et al. 2008 ). Some homogenization is provided by the universal use of the Dvorak satellite interpretation technique (Velden et al. 2006; Knaff et al. 2010 ) but there remain issues with the approaches used to convert from the satellite pattern code to a surface wind speed.\nThese issues are particularly evident in the western North Pacific, where there are four different archival centers: the Joint Typhoon Warning Center (JTWC), the Hong Kong Observatory (HKO), the Shanghai Typhoon Institute (STI) and the WMO Regional Specialized Meteorological Center, Tokyo (RSMC). Maximum winds for each of these archives are based on: 1-min mean at JTWC, 10-min mean at HKO and RSMC, and 2-min mean at STI. Furthermore, aircraft reconnaissance provided a substantial basis for intensity estimates until 1988 after which the Dvorak technique became the major approach. Varying approaches to converting the Dvorak analysis to intensity has resulted in a divergence of intensity trends amongst the centers, with the JTWC data containing an increasing intensity trend and the HKO and RSMC a decreasing one (Wu et al. 2006; Song et al. 2010) . Wu and Zhao (2012) examined these discrepancies using the Emanuel (2008) statistical-dynamical downscaling technique. They found an increasing intensity trend that also is supported by observed relationships with SST and vertical shear, and is in broad agreement with the observed increasing tendency for equatorial developments and longer time spent in favorable conditions. This lends support to the JTWC archive, though the Wu and Zhao trends were less than those for JTWC.\nBased on this analysis, we adopt the following procedure for assessing hurricane trends:\n• Except for the western North Pacific, we use the IBTrACS data without change. IBTrACS has been converted to a uniform 10-min mean wind definition (Knapp et al. 2010) . For the western North Pacific, we use the JTWC data set without correction aside from conversion to 10-min mean.\n• To help minimize uncertainties, including the intensity definition variations, we bin all hurricanes into the Saffir-Simpson category ranges (Simpson and Rielh 1981) . This is for consistency with other studies. The Saffir-Simpson ranges are not constant, varying slightly from one category to another, but a check using fixed-width bins found no notable differences. Even though the Cat 4-5 interval has no explicit upper bound, it is effectively bounded by available energy as defined by the potential intensity (Emanuel 1987) and is approximately the same width as Cat 1-2.\n• All variance numbers use the 5-years smoothed annual time series to remove ENSO type variability. These include contributions from both trend and multi-year variance. The p values are calculated from the raw annual data to ensure no serial correlation.\nWe also conduct several additional data quality checks:\nWe recalculate our main conclusions from the IBTrACS data using:\n• The recently upgraded satellite data set and automated analysis from Kossin (2012) , and • A land-proximity dataset derived from the global IBTrACS data. These are interpolated to add nine points between each 6-h position in the archive; land proximity is then defined by whenever the tropical cyclone moves to within 0.5°lat/long of land, with the land mask having 1 min resolution (*2 km); • An independent global landfall data set used in a recent study (Weinkle et al. 2012 ).\nWe further compare the observed changes to recent climate simulations with the dynamical downscaling results of Bender et al. (2010) , Done et al. (2012) , and Wu and Zhao (2012) ."}, {"section_title": "Tropical cyclone frequency", "text": "The global annual frequency of all tropical cyclones ( Fig. 3a) has remained essentially constant with ACCI, aside from a general variability with amplitude around 10 % from the mean for the whole period. This remarkable degree of global consistency has been noted in several previous studies [see Frank and Young (2007) for a summary]. Note that the lack of trend does not carry over to individual ocean basins, some of which have experienced trends since 1975 with the standouts being a substantial decrease in the western North Pacific and an increase in the North Atlantic (Webster et al. 2005) . We imply no causes for these in this study; they could be due to either or both of natural variability and climate change."}, {"section_title": "Hurricane proportion", "text": "Hurricanes as a family also have experienced no global trend with anthropogenic warming (Fig. 3a) , but have a marked low-frequency variation with a maximum around the middle of the analysis period. By contrast, previous studies have reported a marked upward trend in intense hurricanes (Webster et al. 2005; Emanuel 2005 Emanuel , 2007 Elsner et al. 2008) , one that is closely related to increasing SST (Hoyos et al. 2010 ). This trend in intense hurricanes is the focus of the remainder of our analysis. We bin all hurricanes into the five Saffir-Simpson categories and take annual proportions of each relative to the total number of hurricanes. These are smoothed with a 5-year running mean to remove short-term variability. The resulting relationship with ACCI (Fig. 3b) has a sustained decrease of Cat 1 hurricanes for increasing ACCI; Cat 2 hurricanes have little relationship for lower ACCI values, but decrease towards higher ACCI; little real change is observed in Cat 3 aside from an initial slight increase and then similar decline; and Cat 4 and 5 hurricanes both increase markedly with ACCI. Based on these results we further bin the hurricane proportions into Cat 1-2 and Cat 4-5 for analysis.\nA sustained upward trend is found between the global proportion of Cat 4-5 hurricanes and ACCI (Fig. 4) , balanced by a similar decrease in Cat 1-2 hurricanes. The results are independent of the choice of models to calculate the ACCI as can be seen by comparing Fig. 4a and b. In both cases the ACCI explains 80-85 % of the variance in the smoothed annual hurricane proportions with p \\ 0.01 (using unsmoothed data). This finding is consistent with the SST-related increases in Cat 4-5 and decreases in Cat 1-2 found by Kishtawal et al. (2012) , the relationship of intense hurricanes with SST found by Hoyos et al. (2010) , and the Atlantic landfall hurricane changes noted by Grinsted et al. (2012) .\nThe global relationship also is consistently reproduced in each ocean basin, although the eastern North Pacific and North Atlantic increases have p [ 0.05 (Fig. 5) . Note that the global ACCI has been used for these regional comparisons to ensure comparison with the global climate change without contamination from regional variations. This relationship between ACCI and regional Cat 4-5 proportions is consistent with the SST-related findings for the globe by Hoyos et al. (2010) , for the North Pacific by Emanuel (2005) , and for the North Atlantic by Elsner (2006) and Grinsted et al. (2012) . It is notable that the regional Cat 4-5 relationship is independent of the trend in all tropical cyclones; for example both the western North Pacific and North Atlantic have increasing trends in Cat 4-5 proportions even though the total number of hurricanes has gone down in the Pacific and up in the Atlantic.\nBy using proportions, we are thus assessing overall changes in the probability distribution function (PDF) without contamination by changes in total numbers that can easily mask the true intense hurricane signal. This explains the apparent difference with the findings of a negative Cat 4-5 trend in the western North Pacific and some other ocean basins by Klotzbach (2006) .\nThe North Atlantic is an interesting situation. The proportions have changed consistently with the globe as a whole but the slope is smaller. Since 1995 there has been a marked increase in the annual frequency of North Atlantic tropical cyclones, including intense hurricanes and these are closely aligned with increasing North Atlantic SST [see Bruyère et al. (2012) for a detailed discussion], the global balance (Fig. 3a) has been maintained by a corresponding decrease for annual tropical cyclones in the western North Pacific. This leads to the intriguing possibility that for individual regions the degree of proportional change is inversely related to concomitant change in the total numbers. Further investigation of this potential relationship is ongoing."}, {"section_title": "Discussion", "text": "The strong and consistent relationship between increasing proportions of intense hurricanes and the ACCI is striking and points to a substantial observed anthropogenic increase in intense hurricanes. But could there be an alternative explanation? "}, {"section_title": "Analysis issues", "text": "One possible trend error arises from the universal use of the Dvorak technique. There may have been a consistent change in analysis practice and/or satellite data that led to increasing analysis of intense systems over the time period (Knaff et al. 2010 ). We check this potential impact by using the objective satellite-based reanalysis undertaken by Kossin et al. (2007) . As shown in Fig. 6 and Table 1 , the homogenized data of Kossin (2012) clearly contain a similar signal, though at a reduced trend compared to IBTrACS. The weaker trend may be attributed to two factors: the automated Dvorak analysis used by Kossin may underestimate the most intense storms, or there may be an artificial analysis trend in the archived data. On a regional basis, Wu and Zhao (2012) applied the Emanuel (2008) dynamical downscaling approach to reanalysis data for the western North Pacific and found a significant increase in the frequency of Cat 4-5 hurricanes ( Table 1 ) that is similar to that in Fig. 4b after taking proportions, but at around half the rate. Grinsted et al. (2012) used a homogeneous index of storm surge on the US coast to examine potential changes in landfalling hurricanes for both current and future climate. They found a significant increase at a factor of 2-7 in 'Katrina-like' hurricanes for each 1°C increase in global SST associated with global warming.\nHurricanes in proximity to land have better observations than those well out to sea and provide another check to the quality of the overall results. The global landfall results (as defined in Sect. 3.1) contain the same overall trends (Fig. 7) as were found for the entire data set in Fig. 4a . Cat 4-5 proportions are lower than those for the global hurricane data, an expected result since high intensities are only maintained for a relatively short period of the overall cyclone lifetime and could easily be missed by the similarly short period spent within landfall range. The slope of the Cat 4-5 trend for this land-proximity subset is *27 % per°C, essentially the same as the *29 % per°C from the Kossin (2012) homogenized satellite data in Fig. 6a .\nGeneral agreement with Fig. 7 is found for landfall in each ocean basin except the North Indian Ocean and the western North Pacific. The landfall rarity of intense North Indian Ocean hurricanes means the data are too noisy for analysis. For the western North Pacific the trend is very weak and slightly negative, which we attribute to a general eastward and equatorward movement of the main genesis location in recent decades (Wu and Zhao 2012) . This promotes the development of a higher proportion of intense hurricanes, but also means that fewer of them will make landfall. Weinkle et al. (2012) examined the global number of hurricanes that actually make landfall in each of the SaffirSimpson categories. The proportion of Cat 4-5 at landfall to all landfall hurricanes in their data set has increased with ACCI at a rate of *21 % per°C (p \\ 0.01) since 1975.\nThis study leads us to the following observational conclusions. Over the past few decades there has been an observed *40 % per°C trend relative to the ACCI in the proportion of IBTrACS Cat 4-5 hurricanes (p \\ 0.01) and a compensating decrease in Cat 1-2 proportions. Comparison with the Kossin (2012) homogenized satellite data and with global sets of tropical cyclones in proximity to land indicates that changing analysis and observing practices may have contributed 10-15 % of the IBTrACS trend. This leaves a real trend in the proportion of Cat 4-5 hurricanes of 25-30 % per°C that is directly attributed to anthropogenic warming as defined by the ACCI. This is in agreement with that derived from other studies (Table 1) .\nIf annual mean tropical SST is used instead of the ACCI, the trend in proportion of Cat 4-5 hurricanes after adjusting for analysis errors is *40 % per°C SST warming (see Fig. 2b and associated discussion). These represent an increase of more than double in the proportion of intense hurricanes, which is in agreement with, but less than, the 2-7 times increase found in Katrina-like storms by Grinsted et al. (2012) for the North Atlantic."}, {"section_title": "Comparison with model simulations", "text": "The observed trend in Cat 4-5 hurricanes is consistent with independent modeling studies. Oouchi et al. (2006) found a general increase in the most intense hurricanes and a decrease in weaker ones for a time-slice simulation forced by current and future surface temperatures and greenhouse gases; similar findings were made by Bengtsson et al. (2007) . Bender et al. (2010) examined the potential climate changes in North Atlantic hurricanes using two versions of the GFDL hurricane model as a downscaling tool applied to tropical cyclones generated in the GFDL climate model. The technique for the climate simulation was to use current climate boundary conditions (horizontal and surface) plus a constant change in thermodynamic parameters (Knutson et al. 2007 ). Bender et al. (2010) found that for each°C of global warming the proportion of Cat 4-5 hurricanes increased by *11 % and the proportion of Cat 1-2 hurricanes decreased by *7 %. Done et al. (2012) applied Weibull and Generalized Pareto distributions to assess the expected changes in future North Atlantic hurricane extremes based on changes to the mean and variance of the truncated distribution predicted by the NCAR Nested Regional Climate Model (Done et al. 2012) . Both approaches showed that relatively modest increases in the mean (3 %) and standard deviation of (7 %) produced an increase in the proportion of Cat 4-5 hurricanes of *15 % per°C of global warming."}, {"section_title": "Impact of internal variability", "text": "There is a possibility that some of the observed trend arises from internal tropical cyclone variability that has aliased into the 35-year period used here. However, we consider that a substantial contamination from internal variability is highly unlikely. By using global mean temperatures in the development of the ACCI, we have explicitly excluded all but external forcing factors from this aspect of the analysis. There could be an influence of 11-year sun cycles or impulsive events such as volcanoes, but we suggest that the period chosen is too long for these to have a cumulative effect on the trend.\nFor global hurricane proportions, we are aware of no association with internal variability such as the Pacific Decadal Oscillation or similar. Figure 4 contains potentially interesting short-period variability but as shown by the quadratic fit to the Cat 4-5 proportions the trend appears to be very close to linear as would be expected from a response to the global warming trend. By using global data we also have removed any potential issues from recent discussion over whether relative or in situ SSTs are the driving influence in specific ocean basins (Vecchi and Soden 2007) . The consistent regional Cat 4-5 relationship with global ACCI argues for the regional changes observed here being unaffected by relative processes and thus due largely to global changes.\nFurther evidence for the lack of a contribution from internal variability is provided by the modeling results for All global changes have p \\ 0.01 and for the lower three rows parentheses indicate observed regional changes using IBTrACS the North Atlantic in Table 2 . Because of the experimental configuration for these modeling studies, the simulated changes contained no contribution from internal variability."}, {"section_title": "Comparison with extreme value analysis", "text": "The generally agreed expected increase in overall tropical cyclone intensity with global warming is around 5 % per°C , or an increase of around 2-3 m s -1 (Emanuel 1987; Henderson-Sellers et al. 1998; Knutson et al. 2010) . It is often assumed that this means negligible change in hurricane extremes, but this can easily be shown to be incorrect by fitting an extreme distribution to the tropical cyclone PDF and examining the changes in extremes resulting from small bulk changes. For example, by fitting a Weibull distribution to the current tropical cyclone PDF [see Done et al. (2012) for discussion on the method] it can readily be shown that a change of 2-3 m s -1 in both the mean and standard deviation-similar to the resolution of the IBTrACS-produces a *20 % increase in the proportion (equivalent to doubling) of Cat 4-5 hurricanes. Such a sensitivity of the extremes to relatively small changes in the mean and standard deviation is well known and has been emphasized by the IPCC (2012, their Fig. SPM3 ).\nHowever, there seems to be much more happening than the straightforward 'wagging of the tail' implied by extreme value analysis. Rather, the characteristics of the global intensity distribution have changed consistently over the past 30 years (Fig. 8) ; an initially purely exponential tail has developed bimodal characteristics with a secondary peak at Cat 4 growing consistently from 1965 to the present.\nWe hypothesize that this bimodal development arises from the bounded nature of the hurricane intensity distribution. Since the maximum wind intensity is only expected to increase by around 5 % or \\5 m s -1 per°C of global warming (e.g. Emanuel 1987; Henderson-Sellers et al. 1998 ). This leads to a suggested causal chain: global warming provides conditions generally more conducive to intensification through longer periods spent in favorable conditions, with more rapid intensification rates (in agreement with Kishtawal et al. 2012) ; the increased intensification rate enables some weaker hurricanes to reach higher intensities; the constraint to the maximum intensity cap then results in a developing bimodal distribution with a secondary peak the Cat 4 level."}, {"section_title": "Where is the limit?", "text": "One curious feature of the observed changes has been their quasi-linear nature (e.g. Fig. 4 ). Global Cat 4-5 hurricanes have increased in proportion from *20 % (a third of the proportion of Cat 1-2) in the late 1970's to be equal to Cat 1-2 at *40 %. Obviously this linear increase cannot go on indefinitely as the proportion of Cat 4-5 hurricanes cannot exceed one. Table 2 compares the different values and base periods for the North Atlantic observations with the downscaling by Bender et al. (2010) and Done et al. (2012) . No adjustment downward was made to the observed Atlantic trend due to analysis issues since North Atlantic intensity archives are reasonably accurate over the period (Kossin et al. 2007) . When the base period is taken into account, the differing increases in column four converge to a remarkably consistent net increase in Cat 4-5 proportion of *30-35 %. This suggests that the North Atlantic may saturate at 30-35 % proportion of Cat 4-5 hurricanes after which no further increases with global warming will occur. If true, a further maximum increase in North Atlantic Cat 4-5 proportion of *10 % from the current level of *25 % (Fig. 5b ) may be expected.\nFor the globe the saturation limit may be around 40-50 % proportion of Cat 4-5 hurricanes. Figure 9a shows the variation with annual mean tropical SST of the SST was used because the ACCI is derived from long-term model simulations that cannot reproduce the observed interannual variations. The maxima in Cat 4-5 proportions climbs steeply with increasing SST, then appears to reach a saturation level of 40-50 % while both the means and the minima continue to increase. A similar rapid increase to saturation is apparent for the western North Pacific in Fig. 9b , except that here the saturation level is higher at 60-65 %. The other ocean basins are too noisy for explicit analysis, but they appear to fall between the North Atlantic and western North Pacific. These observations suggest that there may be an areal component to the saturation level; small basins (e.g. North Atlantic) saturate at a lower proportions than large basins with their associated larger warm pools (e.g. western North Pacific). This and the ultimate level of potential saturation under continued global warming is subject of a separate study. Questions that arise include: what, if anything, is the relationship with the development of the bimodal intensity distribution (Fig. 8) ; why is there a variation in the apparent saturation level across different basins; and is there some external climatic factor that determines both this saturation and the remarkably constant annual frequency of tropical cyclones across the globe?"}, {"section_title": "Conclusions", "text": "An ACCI is developed as the difference between the global surface temperatures from ensemble means of model simulations with and without anthropogenic gases included. From this perspective the global warming signal appeared around 1960 and has increased to a current level of *0.8°C [as has previously been implied by Meehl et al. (2004 Meehl et al. ( , 2007 Meehl et al. ( , 2012 and IPCC (2007)].\nWe find an observed change in the proportion of global Cat 4-5 hurricanes (relative to all hurricanes) at a rate of *40 % increase in proportion per°C increase in ACCI (Figs. 4, 5, 6 ; Table 1) using the IBTrACS global data set. This global trend is consistent with the observed changes in each tropical cyclone basin (Fig. 5 ) and the trends are significant at p \\ 0.01 for the globe and p \\ 0.05 for the majority of the cyclone basins. By comparison, a homogenized satellite data set and automated Dvorak analysis, together with two landfall hurricane data sets indicate trends of 20-30 % and these observed changes are consistent with a number of independent modeling studies ( Table 1) . We conclude that since 1975 there has been a substantial and observable regional and global increase in the proportion of Cat 4-5 hurricanes of 25-30 % per°C of anthropogenic global warming.\nThe increasing proportion of intense hurricanes has been accompanied by a similar decrease in weaker hurricanes and the development of a distinctly bimodal distribution in the proportions of hurricanes in each Saffir-Simpson category (Fig. 8) . We suggest that this arises from the capped nature of tropical cyclones to a maximum value defined by the potential intensity, which increases only slightly with global warming.\nAn important finding is that the proportion of intense hurricanes appears to initially increase in response to warming oceans, but then approach a saturation level after which no further increases occur. There is tentative evidence that the saturation level will differ across the tropical cyclone basins and that the global proportion of Cat 4-5 hurricanes may already be near it's saturation level of *40-50 %. This has considerable societal implications that are being examined in a companion study. "}]