[{"section_title": "", "text": "Parents are scrutinized for their disciplinary decisions by professionals across the spectrum. How these parents' decisions are viewed is largely controlled by the influences carried by those who are making the reporting decisions. Mandatory reporting laws for child abuse or maltreatment have been a reality for those in helping professions for decades (Flaherty, Sege, Price, Christoffel, Norton, & O'Connor, 2006) . There is substantial research about the cultural, socio-economic, and gender factors indicative of child physical abuse, and the types of injuries that mandatory reporters see as indicative of child physical abuse.\nThe purpose of this research is to explore the perceptions of mandatory reporters in their decision-making process when it comes to paternal type. There is research into the prevalence of child abuse and/or fatalities based upon paternal relationships (Schnitzer & Ewigman, 2005; Yampolskaya, Greenbaum, & Berson, 2009) . However, there is a lack of knowledge base into whether there is a reporting bias creating this overrepresentation. In order to understand this, mandatory reporters' underlying notions toward paternal type must be investigated. Any investigation of this nature must begin with defining the notion of child abuse."}, {"section_title": "Abuse rates between Family Structures", "text": "Are children raised in nontraditional homes abused more frequently? The popular press conveys a mixed picture. Recently a Florida couple, Linda and John Dollar were arrested after it came to light that they had starved five adopted children nearly to death. A seven-year-old adopted New Jersey boy was found too late after he starved to death in a basement where he was housed. A forty-six pound nineteen year old adopted child was found eating out of a neighbor's garbage, after he had been exposed to years of abuse at the hands of his adopters. These horrifying images provide anecdotal evidence on adopted children as common victims of parental abuse. However, there are also notorious cases of biological parents killing their children.\nA Huntsville, Alabama single mother pleads guilty to starving her three biological children and Susan Smith drowned her two children in a South Carolina lake to win over the man who she was dating. Perhaps the most dramatic illustration of biological mistreatment is that of Andrea Yates, the married housewife, and presumably traditional mother of biological children who one by one drowned her five children in the bathtub while their father worked. The cases mainly spotlighted by the media are by no means generalizable to a representative sample but seem to suggest that children who reside with biological parents are not necessarily under hard-wired genetic protection from harsh treatment. The academic sphere has contemplated the issue as well.\nOver the past thirty years, researchers continue to explore the possibility that non-genetic children suffer more at the hands of their parents compared to their genetic counterparts. Daly and Wilson (1988) find that children who live with stepparents are 100 times more likely to be killed by their guardians than those who reside with genetic parents and that step-parenthood by itself is the single strongest risk factor for children (1988) . Margolin and Craft (1989) find that biological caretakers pose substantially less of a sexual abuse risk for children than unrelated caretakers. The National Research Council (1993) concurs noting that living with a stepfather poses an elevated risk of sexual abuse. In 1979, Glick estimated that one in ten children lives within a stepparent family. Thus, if harm is randomly distributed across families then only 10% of abuse cases occur within stepparent families. Conversely, Gelles and Harrop (1991) maintain under this logic that children with stepparents are less likely to be abused compared to biological children according to parental self-reports.\nMany studies have been challenged on methodological grounds. One critique involves the evaluation of how high the abuse rate should be expected within stepfamilies. One has to wonder about the number of children living within the stepfamily arrangement full-time. And what does and does not count as a stepfamily is also subject to controversy. For example, is a child living with its mother who cohabitates will another male in a step family or not? The answer to that question depends on whom you ask (Stewart, 2007) . Glick (1979) estimated that one in ten children live within stepparent families (most often with a stepfather). This estimate indicates that only 10% of harsh treatment should take place within stepparent families if it were due to chance alone. The National Incidence Study used Glick's estimate regarding the number of children living within stepparent families. The problem is many children have stepparents whom they do not live with but who may still abuse them. Consequently abuse is calculated without taking the living arrangement into account thus leaving the potential for underrepresentation of this specific parent/child abuse (Giles-Sims &Finkelhor, 1984) . Even when children are not in the custody of stepparents, they may visit the parent with whom they do not live thus raising the specter of harsh treatment during such encounters.\nMoreover, due to the variation of families and subjectivity of what is a stepfamily and what is not, the statistic of 10% of household being stepfamilies may be flawed. If the expected statistic is calculated on the lesser stepfamilies in existence, the higher or lower risk evaluation could be biased and unreliable. While many studies suggest that abuse is higher for children living within stepfamilies, such research only ascertains whether the child is part of a stepfamily and whether or not that child was abused, not whether the abuser is the biological or stepparent. It is conceivable that a child may experience harsh treatment at the hands of a natural parent while residing in a stepfamily. Our research looks at the discipline preferences of various specific types of parents, not just whether or not they reside with their children in certain types of households."}, {"section_title": "Defining Child Physical Abuse", "text": "The defining of child physical abuse is the crux of decision-making in mandatory reporting situations. Professionals vary in their interpretations of specific actions as either abuse or discipline (Whitney, Tajima, Herrenkohl, & Huang, 2006) . Practitioners were asked to rate a list of actions on a severity scale. The sampling of the Whitney, et al. study was less than ideal, and it left the actions listed without a context.\nThe addition of variables into the equation may have shifted the decisions of those sampled by listing other child abuse indicators within their vignette variables (Fluke, Shusterman, Hollingshead, & Yuan, 2008; Schnitzer & Ewigman, 2005) . These studies did not look at the methods used to inflict child abuse, but only the characteristics of the perpetrators. Fluke et al. looked at the factors that caused re-reporting and substantiation of child physical abuse. By employing a longitudinal analysis of a sample group over a twenty-four month period, Fluke et al. found that law enforcement personnel and social service subsequent reports were much less likely to be determined as victimization than re-reporting made by medical personnel. This indicates that there are underlying expectations for law enforcement and social service personnel based upon the label of the family with previous substantiation.\nOthers have looked at predictors of abuse potential based upon intergenerational transmission of violence, otherwise defined as abuse risk defined by past experiences as a child (Merrill, Thomsen, Crouch, May, Gold, & Milner, 2005) . This study involving Naval recruits sought to show the potentiality of child physical abuse due to childhood exposure to violence, while not wholly successful, created another measure for finding risk for child physical abuse.\nThe factors for risk of child physical abuse are numerous and attach at many different times in the family life cycle; however, there are families who survive these risks and do not physically abuse their children (Haskett, Scott, Willoughby, Ahern, & Nears, 2006) . Haskett et al. looked at this comparison in both a quantitative and qualitatively measureable manner (2006) . Through use of a questionnaire to an equal number of parent groups, who abused and those who had not, Haskett et al. were able to discern little difference in demographic data between the two groups. However, when the researchers used direct observation of the parent groups, they were able to see observable differences in how the two groups attributed behavior of their children and the discipline necessary to correct it. This behavior is not wholly unfathomable as another factor in child physical abuse perpetration is previous perpetration. The limitation of the Haskett et al. research for the purpose of this study was the lack of data as to the paternal relationship between the fathers and the children in either subgroup. The further question salient for this research is the role of fathers of different paternal types within the family.\nThe stereotypes surrounding paternal types run deep and research targeted at these misconceptions may not penetrate society deeply enough. Unpacking the stereotype of abuse by foster families and by association foster fathers, was undertaken in a comparison study of discipline practices by foster and biological parents (Linares, Montalto, Rosbruch, & Li, 2006) . The study using an equalized random sample parents of children who had previously been maltreated. The study found no appreciable difference in the use of harsh discipline between the two types of parents. The benefits of adoptive and stepfather relationships in families has been addressed positively in large sample quantitative research (Hamilton, Cheng, & Powell, 2007; Schwartz & Finley, 2006) . Hamilton et al. used the early childhood longitudinal study to test evolutionary social-psychology theories on parental investment by nonbiologically related children. The findings showed that adoptive families invested more heavily in their children, financially and socially. Schwartz and Finley, found through use of a nurturing scale that adoptive fathers, adoptive stepfathers, and non-adoptive stepfathers nurture their children in a measure equal to biological fathers; and that this behavior has a positive future impact on their children.\nThere is research that provides validation to the continuation of the stereotypes that non-biologically related fathers create greater risk to children for child physical abuse (Yampolskaya, Greenbaum, & Berson, 2009; Cavanaugh, Dobash, & Dobash, 2006) . Both used criminal statistics to create a demographic risk factor list that including certain paternal types creating higher risk (biological and un-related male living in the home). Waller & Swisher (2006) and Coohey (2000) looked at the underlying question of why. What were the risk factors for fathers in fragile families? Both, through qualitative measures, found the expected litany of risk factors, substance use, age, and unhealthy relationships within the perpetrators life."}, {"section_title": "86", "text": "Journal of Sociology and Social Work, Vol. 4(1), June 2016\nThe limitation to both of these studies is the lack of attention to the relationship between the males and the children. The differentiation between the paternal types is what drives the socially created roles held rightly or wrongly."}, {"section_title": "Labeling theory", "text": "Stereotypes and stigma associated with the \"wicked\" stepparent may foster an adverse self-fulfilling prophecy. What is meant by labeling bias?\nClinicians and other professionals are aware of the stereotypes involving stepparents and thus are more likely to diagnose and report treatment, making them more prevalent in the records (Gelles & Harrop, 1991) . Under this reasoning, individuals are more aware of the stereotype of the \"wickedness\" of stepparents are thus more likely to report stepparents to authorities. This likelihood increases the prevalence of these parental types in reported cases that come from some studies.\nLabeling theory may also influence self-report bias. Stepparents themselves are curiously less likely to report themselves as perpetrators of abusive treatment (Giles-Sims & Finkelhor, 1983) . This finding may emanate from stereotype threat, because stepparents are aware of what society thinks of them, they are more careful in what they will admit to avoid confirming a negative stereotype (stereotype threat)."}, {"section_title": "Role Theory", "text": "Once it can be concluded that there are varied experiences that drive decisions as to mandatory reporting of abuse, then the next logical question has to be what causes these underlying preconceptions. The hypothesis is that the social role that society labels different paternal types with drives these decisions. Different paternal types are given different social labels and values that are impossible to ignore by mandatory reporters. Social roles in and of themselves can cause individuals to change their perception of people (Harrison & Lynch, 2005) . Harrison & Lynch used athletics to show that people will let social roles trump primary gender roles. Using a vignette study with men in traditionally female sports (cheerleading) and women in traditionally male sports (football), the participants assigned traditionally male attributes to female participants in male sports and vice versa. The social role of the sports trumped the apparent gender of the individuals.\nJocelyn Crowley took a different look at how role theory is affecting the gender relationships in family situations (2009). Crowley's study looked at the motivations of fathers' rights groups in relation to perceptions of domestic violence and family discord by conducting in depth interviews of men and using data on family violence. Crowley's introduction of the term, \"Enemy Boundary Creep\" into discussion of family relationships is significant to the current study. Enemy boundary creep is the creation of an encompassing class of people because a much smaller group of people who fit that class is guilty of the negative behavior. Certain paternal types (foster fathers, stepfathers, and mother's boyfriends) fit into the risk for enemy boundary creep. The gap in this research with regard to decisionmaking is that the role theory is tested after the consequences have occurred rather than seeking to determine whether the perception of the role would affect the decision-makers' ultimate response."}, {"section_title": "Characteristics that Influence Reporting Decisions", "text": "The literature above details what and who commits child physical abuse, but does not address the issue of who is finding and reporting this abuse. There are factors that need to be addressed into this group who are in large part mandatory reporters, but in some cases simply citizens who either chooses to report abuse or not. There are cultural factors involved in whether or not someone chooses to report suspected child physical abuse (Ibanez, Borrego, Pemberton, & Terao, 2006) . Ibanez et al. used a sample of college students in a vignette study to test whether or not there was a correlation between ethnicity and reporting of child physical abuse.\nThe limitations of this study were the limitations cited for all vignette studies, the sampling of only college students who may not have experience with real-life abuse situations and the hypothetical nature of the vignettes not allowing for further inquiry by the subjects. Limitation notwithstanding, the study was instrumental in exploring the correlation between the ethnicity of the reporter and the lens through which they see child abuse versus corporal punishment. Garcia and Herrero (2006) found that the neighborhood's perception of itself also affects the decision whether or not to report abuse. The community members who believed their neighborhood was in disorder were less likely to report abuse than those who believed that the social order of the neighborhood was as it should be. The study was done through a large sample survey conducted in Spain, but it underscores the issues of neighborhoods at risk are less likely to trust officials to protect children and more likely to stay quiet about suspected abuse. This knowledge may provide an insight into the decisions of mandatory reporters.\nThe results of the Fluke et al. (2005) study detailing the high prevalence of child fatalities committed by boyfriends of the deceased child's mother (24.2% of all child homicides in Missouri between 1992-1999) is another nugget lodged in the brain of reporters.\nHowever, the small number of homicides connected to foster fathers or stepfathers, should have an equal influence. The everyday stress of investigating child abuse or being responsible for child physical abuse situations is also an indicator of the decision-making processes of reporters. Wright, Powell, and Ridge looked at the stresses of twenty-five police investigators through a series of in-depth interviews to determine if the lack of coping mechanisms may be effecting the ability of investigators to be effective (2006) . This study was done with a small homogenous sample in Australia that may limit its transferability; however, the exposure to child physical abuse is universal and the findings of high rates of negative stress are an important factor to look at to determine the lens through which reporters are viewing behavior towards children.\nResearchers have employed vignette studies to test the reporting characteristics of specific types of reporters. Physicians have been sampled to determine which types of injuries would result in the doctor reporting it as suspected child abuse (Lane & Dubowitz, 2007; Flaherty, Sege, Price, Christoffel, Norton, & O'Connor, 2006; Jones, Flaherty, Binns, Price, Slora, Abney, Harris, Christoffel, & Sege, 2008) . Lane & Dubowitz used parental occupational changes to test whether class differences would affect the decision by the physicians to report (2007) . Results showed a variation in the reporting based upon parental occupation; however, socio-economic class influence may not be indicative due to the limitation of using a nurse as one of the occupations.\nThe nurse was less likely to be reported than the factory worker, but the lawyer and factory worker were similar. In both Jones et al. (2008) and Flaherty et al. (2006) the researchers found that physicians saw previous history with the family and their own experiences in working with child protective services as key factors influencing their decision-making processes in the intentionally ambiguous vignettes posited by the researchers. The introduction of history with the family into the situation makes the replicability of the data difficult because the history of particular subjects will trump other factors. Other research into reporting decisions was done involving school counselors (Bryant, 2009; Bryant &Milsom, 2005) . These studies, through a limited sample followed by a national sample, found that school counselors were comfortable in making the decision to report and felt they had the knowledge to do so. Both asked which factors influenced their decisions. Neither study probed the participants as to what effect these factors had.\nThe hypothesis posited is that mandatory reporters' preconceptions regarding paternal types substantially drive the decision to report actions of suspected child physical abuse. The literature gap provides an opportunity for testing this hypothesis without preconceived notions of correlation. The role of paternal type within the mind of the mandatory reporter may prove to be an essential factor to be looked in future education of reporters in order to recognize the potential for underlying biases against certain paternal types."}, {"section_title": "Methodology", "text": ""}, {"section_title": "Research Questions/Hypotheses", "text": "Research Question one: How does parental type influence individual's perception of actions as abuse?\nH1:\nIndividuals will be less likely to perceive an action as abuse when the action is committed by the child's father than when it is committed by a mother's boyfriend or a stepfather.\nH2: Individuals will be more likely to perceive an action as abuse when the action is committed by a mother's boyfriend than a stepfather.\nResearch Question Two: How does paternal type influence individuals proclivity to report an action as abuse under mandatory reporter laws?\nH3: Individuals will be less likely to report an action as child abuse when the action is committed by the child's father than when it is committed by a mother's boyfriend or a stepfather.\nH4: Individuals will be more likely to report an action as abuse when the action is committed by a mother's boyfriend than a stepfather."}, {"section_title": "Subjects", "text": "Subjects were recruited from sociology and social work courses at a midsized Midwestern college. Subject's participation was voluntary though no one refused. Of the Sample, 26.3% were male and 73.3% were female; 70.4% were white; 4.8% were black; 4.4% were Latino or Hispanic and 1.9% was Asian; almost 19% did not divulge their racial composition. Ages of the respondents varied from 18 to 44 with a mean age of 19.55. They were fairly equally divided for college grade level with the modal being sophomore status. Only 13.5% of the subjects were currently mandatory reporters; however, 62% were planning a career trajectory that will make them mandatory reporters in the future. The descriptive of the sample can be seen below. "}, {"section_title": "Manipulations", "text": "The vignettes read as follows:\n\"Assume that you are a mandatory reporter in the state of Michigan. While you are at work, you are tasked with stopping at the store for supplies. Clients of your agency accompany you; they include a 4 year old child and the child's (insert Independent variable 1 here). While you are there (and under the mandatory reporting statute), you witness the following scene:\nThe 4 year old asks for a toy that is in the center aisle. The child's (insert independent variable 1 here) tells the child, \"No you cannot have that toy today.\" The child then jumps up and cries saying..\"Pl-e-ease\". His (insert independent variable 1 here) then (insert independent variable 2 here). The child looks fearful and stops speaking, walking slowly behind their (insert independent variable 1 here).\nYou must now process what you have seen and decide whether this behavior is child abuse requiring a call to the hotline provided to you as a mandatory reporter. You are only required to report it, not to address the situation in person with them, nor to investigate afterwards. Your identity will also remain anonymous. Anyone may ( and everyday do) call the hotline to report situations such as this.\""}, {"section_title": "Independent Variables.", "text": "Paternal type (1) paternal type is independent variable number 1. This is varied by inserting three different words. First is just father, the second is stepfather, and the third is mother's boyfriend Severity of actions (2) Severity of the action is independent variable number 2. This is varied by inserting three levels of severity (which were pretested). This measure also allows a quality control aspect, if people are not more likely to report severe abuse than those that would fall in the \"gray area\" it would signal problems with the study. The most minor or lowest severity is that of grabbing the child by the arm, specifically subjects read \" then grabs the child tightly by the arm and shakes him saying \"I told you NO.\". The moderate severity is yelling, specifically the subject reads \"then yells at the child through clenched teeth: \"look idiot, what part of NO do you not understand?\" The most serious severity is hitting, specifically subjects read \"then hits the child with a closed fist in the head saying \"I told you no\"."}, {"section_title": "Dependent Variables-", "text": "Three dependent variables are utilized. They include whether or not the subject believes the action was abuse; whether or not they would report this action if they were a mandatory reporter, and lastly whether or not they would report this action if they were not a mandatory reporter."}, {"section_title": "Conditions/vignette protocol", "text": "The manipulations comprise a nine condition matrix. Each subject is equally likely to receive each of the nine conditions as they are randomly distributed to the study subjects. Each condition is assigned 30 subjects. This can be seen visually below: Hit  Father  n=30  n=30  n=30  Stepfather  n=30  n=30  n=30  Mother's Boyfriend  n=30  n=30  n=30 Respondents are asked if they view the action described in their vignette as abuse; if they would report the action as abuse if they were a mandatory reporter; and if they would report the action as abuse if they were not a mandatory reporter. We also asked basic demographic information from our subjects. Each subject is given only one condition and was not advised that the vignettes varied on neither parental type nor severity of the action. Only that we were interested in perceptions of physical abuse by mandatory reporters. Respondents were first given a handout which delineated the legal definition of child abuse which reads:\n\"Child abuse in Michigan is outlined by statute § § 722.622; 722.628(3) (c). This statute outlines Child abuse means harm or threatened harm to a child's health or welfare that occurs through non accidental physical or mental injury, sexual abuse, sexual exploitation, or maltreatment by a parent, a legal guardian, or any other person responsible for the child's health or welfare or by a teacher, a teacher's aide, or a member of the clergy.\"\nRespondents were also given a statute on mandatory reporting, who is a mandatory reporter, and what that means. Following this discussion, we then handed out the vignettes of each of the 9 conditions. Analysis of variance procedures require that proportionality and homogeneity of the variance requirements be met. Our data meet these requirements. Both the Max Min and Levene's test for homogeneity are calculated and both show that the data meet these qualifications. Furthermore, each column ( paternal type) and each row (severity of action) represent 90 cases fulfilling the proportionality requirements for the analysis of variance tests which are undertaken in this 3X3 treatment by levels factorial designs. The two factors being considered are paternal type, and severity of action. Additionally, one way Anovas are conducted for each of the actions individually with Tukey posthoc tests. These results show differences in reporting behavior depending on the severity of the action committed against the child."}, {"section_title": "Results", "text": ""}, {"section_title": "Crosstabs", "text": "First, to address our hypothesis we perform crosstabs to view potential relationships. The results of these cross tabulations can be seen in Table 2 . Overall the vignettes it was found that 63.3% of respondents viewed actions by fathers as abuse, and an identical percentage found actions by stepfathers as abuse, however 73.3% found that actions of mother's boyfriends were abusive. When asked if they were a mandatory reporter if they would report only 62.2% would mandate a report on a father compared to 74.4% for stepfather and 77.8% of mother's boyfriends. When asked if they would report without a mandate only 23.6% of respondents would report a father's actions, compared to 25.6% for stepparents and 27.8% for mother's boyfriend. Severity of the action is understandably differential in whether it is viewed as abuse or reported to authorities.\nWhen it comes to shaking a child 44.4% view this as abusive, 56.7% would mandate a report for this as abuse and only 11.1% would report if not a mandatory reporter. When considering yelling at a child 60% of respondents viewed this as abuse, 64.4% would mandate a report and only 19.1% would report it if they were not a mandatory reporter. Lastly, in the most serious physical action, hitting a child 95.6% view the action as abuse 93.3% would report it as a mandatory reporter and only 46.7% would report if they were not a mandatory reporter. In combination we find that 44.4% of respondents overall feel that shaking a child is abuse. However, 43.3% of shakings by fathers are viewed as abusive, only 40% of stepfathers and 50% of stepfathers shaking a child is viewed as abuse. This is related to mandating a report as well. When respondents were asked to put themselves in the shoes of a mandatory reporter 56.7% would report a child being shaken as abuse. Of the paternal types 50% would report a father shaking the child, 56.7% would report a stepfather shaking a child and 63.3% would report a mother's boyfriend shaking a child. The last dependent variable investigated is whether or not someone would report an incidence if they were not a mandatory reporter. We find that only 11.1% of our respondents would report shaking a child if they were not mandated to do so. Only 10% would report a father shaking a child; 13.3% would report a stepfather shaking a child and 10% would report a mother's boyfriend shaking a child. The second issue we investigated was perceptions of yelling at a child. We find that 60% of respondents view yelling at a child abusive. An identical percentage of 60% of respondents found a father yelling at his child abusive and only 50% view a stepfather yelling at his child abusive, with 70% of mother's boyfriends yelling at child viewing it as abusive.\nFor mandatory reporting 64.4% of the respondents would file a report, only 56.7% would mandate a report of a father yelling at a child, 66.7% would report a yelling stepfather and 70% would report a yelling mother's boyfriend. In the last variable considered was whether or not they would report as a non mandatory reporter. Only 19.1% of our respondents would report someone for yelling at a child without a mandate. A greater percentage of respondents would report without a mandate a father yelling at his child with 24.1% indicating they would. Only 13.3% of respondents would report a stepfather for yelling at a child, and 20% of respondents would turn in a mother's boyfriend for yelling at a child.\nFor the most serious physical actions, hitting a child we find that 95.6% view it as abusive. However only 86.7% of respondents viewed hitting a child abusive when conducted by the child's father but 100% of respondents felt it was abusive when a stepfather or a mother's boyfriend hit a child with a closed fist. The same pattern is seen for mandating a report with 93.3% of the total respondents saying they would mandate a report for hitting a child, but only 80% of respondents would mandate a report against a child's father for hitting him, but 100% would mandate a report for either stepfathers or the boyfriend of the child's mother. Table 3 displays the results of 9 one way anovas. Each dependent variable was estimated for each of the actions taken against a child. When considering shaking the child (the most minor action taken in our study) readers will see there is no significant result for paternal type found for perception of the action as abuse, for whether or not respondents would report the action either for a mandatory reporter or for a non-mandatory reporter. Table 3 also shows the results for the intermediate action, yelling at the child. Similar to shaking the child, no difference is found based on paternal type for perception of the action as abuse, or for reporting the action as either a mandatory reporter or a non-mandatory reporter Finally Table 3 also shows results for the most serious action taken, hitting a child with a closed fist. Readers will see that we do find differences for this dependent variable based on paternal type. We find differences for both whether or not the respondent viewed the action as abuse, and whether or not they would mandate a report in that instances, but not for whether or not they would report the action as abuse. Tukey Post Hoc tests were conducted on the hit child data selection to see where the differences were. We find that our respondents were more likely to view hitting the child as abuse when conducted by a father compared to a stepfather or a mother's boyfriend. However, there is no difference between respondents perception of hitting the child as abuse when conducted by a stepfather or a mother's boyfriend. Similarly, respondents were less likely to mandate a report on father compared to a stepfather or a mother's boyfriend for hitting a child in the head. However, we do not find a difference between stepfathers and mother's boyfriends."}, {"section_title": "One-Way Anova Results", "text": ""}, {"section_title": "Analysis of Variance Results", "text": "Next, we conduct analysis of variance for our three dependent variables which can be seen in Table 5 below. We find that severity of the action not surprisingly is associated with all three dependent variables. However, paternal type is associated only with whether or not the respondents would file a mandatory report. Table 6 shows the Tukey post hoc results for the analysis of variance results. For severity we see that respondents are less likely to view shaking as abuse than either yelling or hitting, and they are more likely to consider hitting abuse than yelling as well. Respondents are more likely to mandate a report or report without a mandate for hitting compared to shaking or yelling. However, respondents were no more likely to mandate a report or report without a mandate for shaking compared to yelling. Paternal type is shown to have a difference between the father and mother's boyfriend but not between stepfather and father nor between stepfather and mother's boyfriend "}, {"section_title": "Hit", "text": ""}, {"section_title": "Discussion/Conclusions", "text": "These results comprise both theoretical and policy implications. On the theoretical level, they add to the literature on child abuse including the work of Gelles and Harrop and Daly and Wilson. One of the limitations of studies on WHY non-genetic father figures are more likely to abuse children is the discussion that perhaps they are just investigated more because of the stereotype that they are more likely to abuse. On the policy level, mandatory reporting has been being expanded across the United States. States are adding mandatory reporting and civil penalties for more crimes, and for more professions. As these policies are enacted it is important to understand the ramifications this may have, especially when one couples this with the changing American family. While this research does not find strong support that the stereotype exists, there is some and even one is too many."}, {"section_title": "Hypothesis one", "text": "Our first hypothesis was that individuals will be less likely to perceive an action as physical abuse when the action is committed by the child's father than when it is committed by a mother's boyfriend or a stepfather. This hypothesis receives very limited support. Table 3 shows that there is a difference between paternal types on whether or not respondents viewed hitting a child as abuse. Moreover, table 5 verifies that fathers hitting their child are less likely compared to stepfathers or mothers boyfriends to be viewed as abusive. However, when overviewing table 5 readers will see that in a analysis of variance paternal type is not significant for viewing something as abuse and neither is the interaction between severity and paternal type."}, {"section_title": "Hypothesis Two", "text": "Hypothesis two was that individuals will be more likely to perceive an action as physical abuse when the action is committed by a mother's boyfriend than a stepfather. This hypothesis is not supported. Table 4 finds no difference between stepfathers and mother's boyfriend in terms of whether it is viewed as abusive to hit a child with a closed fist. Further, the analysis of variance is not significant for paternal type in table 5."}, {"section_title": "Hypothesis Three", "text": "Hypothesis three stated that individuals will be less likely to report an action as child abuse when the action is committed by the child's father than when it is committed by a mother's boyfriend or a stepfather. This hypothesis must be looked at in two separate ways, there likelihood to report as a mandatory reporter, and the likelihood to report if not a mandatory reporter. Mixed support is found for hypothesis three. Table 3 illustrates the one way anova results. Readers will see that there is a difference between paternal types on whether or not a respondent would mandate a report for abuse (F=7.250). Table  4 further illustrates that indeed fathers are less likely to be reported as abusive for hitting a child with a closed fist compared to stepfathers or mother's boyfriend. However, no differences are found between paternal types for yelling at the child or shaking the child and likelihood of having a report filed by a a mandatory reporter. Table 5 shows the analysis of a variance that does show paternal type as being influential in having a mandatory report filed (F=3.35). However, in Table 6 the Tukey post hoc tests show only a difference between fathers and mother's boyfriends but not between fathers and stepfathers."}, {"section_title": "IS IT ABUSE", "text": ""}, {"section_title": "Mandatory reporter-", "text": ""}, {"section_title": "Non-mandated reporting-", "text": "There is no support for non-mandated reporting. In Table 3 readers will see that none of the three models (hitting the child; yelling at the child; or shaking the child),is significant for paternal type. In table 5 the analysis of variance is also not significant for paternal type.\nThere is no support for non-mandated reporting. In Table 3 readers will see that none of the three models (hitting the child; yelling at the child; or shaking the child),is significant for paternal type. In table 5 the analysis of variance is also not significant for paternal type."}, {"section_title": "Hypothesis Four", "text": "Hypothesis four stated that individuals will be more likely to report an action as abuse when the action is committed by a mother's boyfriend than a stepfather. This hypothesis is not supported."}, {"section_title": "Mandatory Reporter-", "text": "The one way Anovas show that there is a difference between fathers and stepfathers and fathers and mother's boyfriends. However, we do not find a difference between fathers and mother's boyfriends. Further, we only find a difference in the analysis of variance between fathers and mother's boyfriend and not between fathers and stepfathers."}, {"section_title": "Future work", "text": "This project represents a pilot project to investigate potential stereotypes with mandatory reporting that may account for some of the increased representation of stepfathers and boyfriends of mothers compared to biological fathers. We have plans to conduct a few extensions of this project. First, adding gender to the parent will address whether individuals are more likely to consider the same action by mothers differently (either more or less likely to report it) than fathers are. This project will be conducted next term by using mother; stepmother and father's girlfriend instead of father; stepfather and mother's boyfriend to the vignettes. Because the differences are most notable in the hit to the head and that shake and yell are not statistically different from one another, only hit and yell conditions will be used in this extension work. Second, adding a gender to the child will ultimately be undertaken. It may mean that different actions are considered abusive or report worthy when conducted upon girl children compared to boys or vice versa.\nLastly, it may be fruitful to use a population of subjects that have already been working as mandatory reporters, or whom are in a major that is comprised of ALL mandatory reporters (education, social work, and/or nursing majors). While this is a limitation, it is not a fatal flaw as merits of experimental design are often not fully appreciated. Experimental vignette methodology is particularly efficacious when the goal is to assess theoretical underpinnings. Experiments may corroborate or challenge related findings detected using other methods such as surveys (Lovaglia, 2003; Zelditch, 1969) . Our sample consists of college students; a group from which mandatory reporters originate. If the tendency to view one paternal type in a more suspicious light is observed in college sample, it is not unreasonable to expect similar views from mandatory reporters in the field."}]