[{"section_title": "Introduction", "text": "The 2017-18 National Teacher and Principal Survey (NTPS) 1 is a nationally representative sample survey of public 2 and private 3 K-12 schools, principals, and teachers in the 50 states and the District of Columbia. State representative data are also available for public schools, principals, and teachers. NTPS collects data on core topics including teacher and principal preparation, classes taught, school characteristics, and demographics of the teacher and principal labor forces. It is developed by National Center for Education Statistics (NCES) of the Institute of Education Sciences (IES) within the U.S. Department of Education and conducted by the U.S. Census Bureau. This report presents selected findings from the Public School Teacher and Private School Teacher Data Files of the 2017-18 NTPS, representing results of the second collection of NTPS. The purpose of NTPS is to collect information that can provide a detailed picture of U.S. elementary and secondary schools and their staff. This information is collected through school, principal, and teacher surveys. Information can be linked through all three surveys. The 2017-18 NTPS uses a school-based sample of public and private schools. All principals associated with sampled public and private schools were also included in the sample. Teachers associated with a selected school were sampled from a list of teachers that was provided by the school, collected from school websites, or purchased from a vendor. The selected samples include about 10,600 traditional and charter public schools and their principals, 60,000 public school teachers, 4,000 private schools and their principals, and 9,600 private school teachers. The samples for public schools and staff were drawn to support estimates by geography, grade span, and charter status for public schools; the samples for private schools were drawn to support estimates by geography, grade span, and affiliation group for a wide range of topics. The data were collected via mailed questionnaires and internet instruments with telephone and in-person field follow-up. Data collection began in September 2017, when the first questionnaires were mailed, and data collection ended in August 2018. The weighted unit response rate computed before adjustments for nonresponse was 76.9 percent for public school teachers, and 75.9 percent for private school teachers. For detailed technical information about the 2017-18 NTPS, please see the technical notes in appendix B of this report or the Survey Documentation for the 2017-18 National Teacher and Principal Survey (Cox et al. forthcoming). The purpose of this First Look report is to introduce new data through the presentation of tables containing descriptive information. Selected findings chosen for this report demonstrate the range of information available on the 2017-18 NTPS Public School Teacher and Private School Teacher Restricted-Use Data Files. The selected findings do not represent a complete review of all observed differences in the data and are not meant to emphasize any issue. This First Look report highlights findings from the NTPS public school teacher and private school teacher surveys. Findings from the school and principal surveys are presented in two companion First Look reports: • Characteristics of Public andPrivate Elementary andSecondary Schools in the United States: Results From the 2017-18 National Teacher andPrincipal Survey First Look (NCES 2019-140); and • Characteristics of Public andPrivate Elementary andSecondary School Principals in the United States: Results From the 2017-18 National Teacher andPrincipal Survey First Look (NCES 2019-141). The tables in this report contain frequencies and percentages demonstrating bivariate relationships. All results have been weighted to reflect the sample design and to account for nonresponse and other adjustments. Comparisons drawn in the selected findings have been tested for statistical significance at the .05 level using Student's t statistics to ensure that the differences are larger than those that might be expected due to sampling variation. No adjustments were made for multiple comparisons. Although the selected findings include only statistically significant findings they do not include every statistically significant comparison. Many of the variables examined are related to one another, and complex interactions and relationships have not been explored. Statistical Analysis Software (SAS 9.4) and SUDAAN (11.1) were used to compute the statistics for this report. Tables of standard errors are provided in appendix A. Detailed information about the survey methodology is provided in appendix B. Appendix C contains a description of the variables used in this report. More information about NTPS can be found at https://nces.ed.gov/surveys/ntps."}, {"section_title": "Selected Findings", "text": "• About 79 percent of all public school teachers were non-Hispanic White, 7 percent were non-Hispanic Black, and 9 percent were Hispanic (table 1). Among private school teachers, about 85 percent were non-Hispanic White, 3 percent were non-Hispanic Black, and 7 percent were Hispanic. • The average age of teachers in traditional public schools was 43 years, and 39 years in public charter schools. The average age of teachers in private schools was 44 years old (table 2). • On average, public and private school teachers had about 14 years of teaching experience. Teachers in traditional public schools had 14 years of teaching experience, and public charter school teachers had 10 years of teaching experience, on average (table 3). • In the 2017-18 school year, 49 percent of public school teachers had a master's degree, 39 percent had a bachelor's degree, 9 percent had higher than a master's degree, and 3 percent had less than a bachelor's as their highest degree earned. Among private school teachers, 40 percent had a master's degree, 42 percent had a bachelor's degree, 8 percent had higher than a master's degree, and 10 percent had less than a bachelor's as their highest degree earned (table 4). • In the 2017-18 school year regular full-time teachers in public schools had a higher average base salary 4 ($57,900) than regular full-time teachers in private schools ($45,300) (table 5). About 18 percent of public school teachers and 21 percent of private school teachers had jobs outside their school system during the school year. • Among public school teachers in self-contained classrooms, the average class size was 21 students in primary schools, 17 students in middle schools, 16 students for high schools, and 16 students for combined-grade schools. Among departmentalized teachers in public schools, the average class size was 26 for primary schools, 25 for middle schools, 23 for high schools, and 19 for combined-grade schools (table 6a). • Among private school teachers in self-contained classrooms, the average class size was 17 students in elementary schools and 18 students in secondary schools. Among departmentalized teachers in private schools, the average class size was 18 for elementary and secondary schools (table 6b). • Compared to public school teachers, a lower percentage of private school teachers had taken graduate or undergraduate courses in any of the following subjects prior to their first year of teaching: Lesson planning (79 percent vs. 65 percent), learning assessment (77 percent vs. 65 percent), classroom management techniques (74 percent vs. 62 percent), serving students with special needs (70 percent vs. 49 percent), serving students from diverse economic backgrounds (65 percent vs. 48 percent), using student performance data to inform instruction (56 percent vs. 49 percent), and teaching students who are limited-English proficient or English-language learners (41 percent vs. 28 percent) (table 7). • In the 2017-18 school year, 78 percent of public school teachers and 69 percent of private school teachers were evaluated during the last school year. Among teachers who were evaluated, higher percentages of private school teachers than public school teachers agreed with statements about the positive impact of evaluations on their teaching. Eighty-three percent of private school teachers agreed that the evaluation process helped them determine their success with students, 84 percent agreed that the evaluation process positively affected their teaching, and 81 percent indicated that the evaluation process led to improved student learning. Comparable estimates for public school teachers were 72 percent, 73 percent, and 69 percent respectively (table 8). • About 99 percent of all public school teachers reported that they participated in any professional development, and about 94 percent of all private school teachers reported that they participated in any professional development during last school year (table 9). 7   Table 1. Percentage distribution of school teachers, by race/ethnicity, school type, and selected school characteristics: 2017-18"}, {"section_title": "Estimate Tables", "text": "School type and selected school characteristic ! Interpret data with caution. The coefficient of variation (CV) for this estimate is between 30 percent and 50 percent (i.e., the standard error is at least 30 percent and less than 50 percent of the estimate). ‡ Reporting standards not met. The coefficient of variation (CV) for this estimate is 50 percent or greater (i.e., the standard error is 50 percent or more of the estimate) or the response rate is below 50 percent. 1 Hispanic includes Latino. NOTE: Teachers include both full-time and part-time teachers. Detail may not sum to totals because of rounding and because some data are not shown. SOURCE: U.S. Department of Education, National Center for Education Statistics, National Teacher and Principal Survey (NTPS), \"Public School Teacher and Private School Teacher Data Files,\" 2017-18. 11.9 26.6 32.1 67.9 750 or more ‡ ‡ ‡ ‡ ‡ ‡ ‡ ‡ ‡ Reporting standards not met. The response rate is below 50 percent. NOTE: Teachers include both full-time and part-time teachers. Detail may not sum to totals because of rounding. SOURCE: U.S. Department of Education, National Center for Education Statistics, National Teacher and Principal Survey (NTPS), \"Public School Teacher and Private School Teacher Data Files,\" 2017-18. Table 3. Percentage distribution of school teachers based on years of teaching experience, average total years of teaching experience, percentage distribution  of teachers based on years teaching at current school, and average years teaching at current school, by school type and selected school characteristics:  2017-18 School type and selected school characteristic   Higher than a master's degree is defined as a teacher who completed any of the following: an educational specialist or professional diploma, a certificate of advanced graduate studies, or a doctorate or first professional degree. NOTE: Teachers include both full-time and part-time teachers. Detail may not sum to totals because of rounding. SOURCE: U.S. Department of Education, National Center for Education Statistics, National Teacher and Principal Survey (NTPS), \"Public School Teacher and Private School Teacher Data Files,\" 2017-18. Table 5. Among regular full-time school teachers, average base salary and earnings from all sources, percentage of teachers with earnings from various salary supplements, and among those teachers, the average amount earned from the supplement during the current school year, by school type and selected school characteristics: 2017-18  (CV) for this estimate is between 30 percent and 50 percent (i.e., the standard error is at least 30 percent and less than 50 percent of the estimate). ‡ Reporting standards not met. The coefficient of variation (CV) for this estimate is 50 percent or greater (i.e., the standard error is 50 percent or more of the estimate) or the response rate is below 50 percent. 1 Average earnings from all sources is defined as the weighted mean of the amount that regular full-time teachers earned from all sources during the school year. It does not include summer income or income from a retirement pension. NOTE: For average base salary, teachers who reported zero are excluded from the table. Summer earnings are not included. A regular full-time teacher is any teacher whose primary position in a school is not an itinerant teacher, a long-term substitute, a short-term substitute, a student teacher, a teacher aide, an administrator, a library media or librarian, another type of professional staff (e.g., counselor, curriculum coordinator, social worker) or support staff (e.g., secretary), or a part-time teacher. SOURCE: U.S. Department of Education, National Center for Education Statistics, National Teacher and Principal Survey (NTPS), \"Public School Teacher and Private School Teacher Data Files,\" 2017-18. 19.2 ‡ Reporting standards not met. The coefficient of variation (CV) for this estimate is 50 percent or greater (i.e., the standard error is 50 percent or more of the estimate) or the response rate is below 50 percent. NOTE: Self-contained classes are defined as instruction to the same group of students all or most of the day in multiple subjects, and departmentalized instruction is defined as instruction to several classes of different students most or all of the day in one or more subjects. Among all public school teachers, 25 percent teach self-contained classes in primary schools, 1 percent in middle schools, 1 percent in high schools, and 1 percent in combined schools; 8 percent teach departmentalized classes in primary schools, 14 percent in middle schools, 24 percent in high schools, and 4 percent in combined schools; 15 percent teach other types of classes, such as elementary subject specialist classes, team-taught classes, and \"pull-out\" or \"push-in\" classes in primary schools, 3 percent in middle schools, 3 percent in high schools, and 1 percent in combined schools. SOURCE: U.S. Department of Education, National Center for Education Statistics, National Teacher and Principal Survey (NTPS), \"Public School Teacher Data File,\" 2017-18. The response rate is below 50 percent. NOTE: Self-contained classes are defined as instruction to the same group of students all or most of the day in multiple subjects, and departmentalized instruction is defined as instruction to several classes of different students most or all of the day in one or more subjects. Among all private school teachers, 16 percent teach selfcontained classes in elementary schools, and 3 percent in secondary schools; 12 percent teach departmentalized classes in elementary schools, and 19 percent in secondary schools; 10 percent teach other types of classes, such as elementary subject specialist classes, team-taught classes, and \"pull-out\" or \"push-in\" classes in elementary schools, and 3 percent in middle schools. SOURCE: U.S. Department of Education, National Center for Education Statistics, National Teacher and Principal Survey (NTPS), \"Private School Teacher Data File,\" 2017-18.   is below 50 percent. NOTE: Response options included \"strongly disagree,\" \"somewhat disagree,\" \"somewhat agree,\" and \"strongly agree.\" Teachers who reported \"somewhat agree,\" or \"strongly agree\" were considered to have reported that they \"agreed\" with different statements. SOURCE: U.S. Department of Education, National Center for Education Statistics, National Teacher and Principal Survey (NTPS), \"Public School Teacher and Private School Teacher Data Files,\" 2017-18.  is below 50 percent. NOTE: Response options included \"strongly disagree,\" \"somewhat disagree,\" \"somewhat agree,\" and \"strongly agree.\" Teachers who reported \"somewhat agree\" or \"strongly agree\" were considered to have reported that they \"agreed\" with different statements. SOURCE: U.S. Department of Education, National Center for Education Statistics, National Teacher and Principal Survey (NTPS), \"Public School Teacher and Private School Teacher Data Files,\" 2017-18."}, {"section_title": "Appendix A: Standard Error Tables", "text": "A-2    "}, {"section_title": "A-3", "text": ""}, {"section_title": "A-4", "text": ""}, {"section_title": "A-5", "text": ""}, {"section_title": "A-6", "text": "Table A-3. Standard errors for "}, {"section_title": "A-7", "text": "Table A-3. Standard errors for A-9 "}, {"section_title": "A-10", "text": "Table A-5. Standard errors for Table 5: Among regular full-time school teachers, average base salary and earnings from all sources, percentage of teachers with earnings from various salary supplements, and among those teachers, the average amount earned from the supplement during the current school year, by school type and selected school characteristics: 2017-18 "}, {"section_title": "A-11", "text": "Table A-5. Standard errors for Table 5: Among regular full-time school teachers, average base salary and earnings from all sources, percentage of teachers with earnings from various salary supplements, and among those teachers, the average amount earned from the supplement during the current school year, by school type and selected school characteristics: 2017-18-Continued      "}, {"section_title": "A-13", "text": ""}, {"section_title": "A-16", "text": ""}, {"section_title": "A-17", "text": ""}, {"section_title": "A-18", "text": ""}, {"section_title": "A-19", "text": "Table A-9. Standard errors for "}, {"section_title": "Overview of the NTPS Teacher Survey", "text": "The National Teacher and Principal Survey (NTPS) is sponsored by the National Center for Education Statistics (NCES) of the Institute of Education Sciences within the U.S. Department of Education and is conducted by the U.S. Census Bureau. NTPS is a state and nationally representative sample survey of public and private K-12 schools, principals, and teachers in the 50 states and the District of Columbia. The NTPS was first conducted during the 2015-16 school year, and 2017-18 is the second NTPS collection. The 2017-18 NTPS consisted of questionnaires for six types of respondents: public schools, private schools, public school principals, private school principals, public school teachers, and private school teachers. The information can be linked across teachers, principals, and schools by each sector (public and private). There are separate questionnaires and data files for each type of respondent by sector (public school, private school, public school principal, private school principal, public school teacher, and private school teacher). For the content of the questionnaires, see https://nces.ed.gov/surveys/ntps/ question1718.asp. NTPS was designed to produce national, regional, and state estimates for public elementary and secondary schools, principals, and teachers, including public charter schools and the principals and teachers within them. For private schools, the sample supports national, regional, and affiliation strata estimates for schools, principals, and teachers. Comparisons between public and private schools and their principals and teachers are possible only at the regional and national levels, because private schools were selected for sampling by affiliation strata and region rather than state. Additionally, the teacher survey was designed to produce national estimates of teachers by subject matter taught and by full-time or parttime status. For additional information on the specific NTPS-related topics discussed in this appendix, consult the Survey Documentation for the 2017-18 National Teacher and Principal Survey (Cox et al. forthcoming) or the User's Manual for the 2017-18 National Teacher and Principal Survey, Volumes 1-4 (Goldring et al. NCES 2019-211 through 2019-213 and 2020. To access additional general information on NTPS or for electronic copies of the questionnaires, go to the NTPS home page (https://nces.ed.gov/surveys/ntps)."}, {"section_title": "Sampling Frames and Sample Selection", "text": "Teachers were defined as staff members who teach regularly scheduled classes to students in any of grades K-12. Teacher Listing Forms (TLF) (i.e., teacher rosters) were collected from sampled schools, by mail and online. Teacher lists were also purchased from an external vendor. Some schools received a prepopulated TLF, based on vendor data, and were asked to update or correct the lists. The goal was to increase the accuracy of the vendor lists while reducing respondent burden. When a school did not return either a blank or prepopulated TLF, teacher names were obtained by researching school websites or using vendor data. Along with the names and e-mail addresses of teachers, sampled schools were asked to provide information about each teacher's teaching status (full or part time) and subject matter taught (special education, general elementary, math, science, English/language arts, social studies, vocational/technical, or other). Sampling was done on an ongoing basis throughout the roster collection period. Prior to allocating teachers to sampling strata, the Census Bureau first allocated an overall number of teachers to be selected. The maximum number of sampled teachers per school was set at 20, in order to avoid overburdening a school by sampling too large a proportion of its teachers. An average of seven to nine teachers were B-3 selected per public school, depending on the school's grade range, school size, urbanicity, and poverty status. For private schools, an average of two to four teachers per school were selected, depending on affiliation, school size, and region. Within each sampled school (both public and private), teachers were stratified by subject, as follows: math, science, English/language arts, social studies, and everything else. No oversampling by subject was performed. Teachers within a school domain and teacher stratum were sorted by the subject matter taught and the teacher line number code. The teacher line number is a unique number assigned to identify the individual within the teacher list. Within each teacher stratum in each school, teachers were selected systematically with equal probability. For 86 percent of eligible public schools and 74 percent of eligible private schools, teacher lists were obtained from either the school, a clerical operation, or a list purchased from a vendor. The remaining 14 percent of eligible public and 26 percent of eligible private schools did not provide teacher lists to use for sampling teachers. Teacher Listing Forms were collected from schools in the 2017-18 NTPS public and private schools sampling frame. The starting point of the public school sampling frame was the preliminary 2014-15 Common Core of Data (CCD) Nonfiscal School Universe data file. 1 The sampling frame was adjusted from the CCD to fit the definition of a school eligible for NTPS. To be eligible for NTPS, a school was defined as an institution or part of an institution that provides classroom instruction to students, has one or more teachers to provide instruction, serves students in one or more of grades 1-12 or the ungraded equivalent, and is located in one or more buildings apart from a private home. It was possible for two or more schools to share the same building; in that case, they were treated as different schools if they had different administrators (i.e., principal or school head). This definition is unchanged from the Schools and Staffing Survey (SASS). The 2017-18 NTPS universe of schools is confined to the 50 states plus the District of Columbia and excludes the other jurisdictions, Department of Defense overseas schools, and CCD schools that do not offer teacher-provided classroom instruction in grades 1-12 or the ungraded equivalent. This last group includes schools that are essentially administrative units that may oversee entities that provide classroom instruction or may only provide funding and oversight. Although Bureau of Indian Education-funded (BIE) schools are eligible for NTPS, these schools were not oversampled and the data do not support separate BIE estimates. The NTPS definition of a school is generally similar to the CCD definition, with some exceptions. NTPS allows schools to define themselves. During SASS collection, Census Bureau staff observed that in situations where two or more schools have the same administration, these schools were reported separately on CCD but generally reported as one entity for SASS. Thus, CCD schools with the same location, address, and phone number were collapsed during the frame building on the assumption that the respondent would consider them to be one school. Due to similarities with SASS, NTPS also followed the same type of collapsing procedure. A set of rules was applied to determine in which instances school records should be collapsed together. When school records were collapsed together, the student and teacher counts, grade ranges, and names as reported to CCD were all modified to reflect the change. Finally, since CCD and NTPS differ in scope and their definition of a school, some records were deleted, added, or modified to provide better coverage and a more efficient sample design for NTPS. For a detailed list of frame modifications, see the Survey Documentation for the 2017-18 National Teacher and Principal Survey (Cox et al. forthcoming). After deleting, collapsing, and adding school records, the NTPS public school sampling frame consisted of about 86,800 traditional public schools and 6,800 public charter schools."}, {"section_title": "B-4", "text": "Most of the NTPS private school sample comes from a list frame, which is constructed by matching various sources of private school lists at a national level. The 2017-18 NTPS list frame was formed by combining the 2015-16 Private School Survey (PSS) list frame and the 2015-16 PSS certainty area frame, which consists of schools found via area sampling in the eight certainty PSUs included in the 2015-16 PSS (for an explanation of PPS sampling, see Cochran 1977). In order to provide coverage of private schools founded since 2016 and to improve coverage of private schools existing in 2016, the Census Bureau collected membership lists during the summer of 2016 from private school associations and religious denominations. The associations were asked to list all schools meeting the PSS school definition. The 50 states and the District of Columbia were also asked to provide lists of private schools meeting the PSS definition of a school. These lists were matched and combined with the foundational list frame from the 2015-16 PSS and the noncertainty area frame from the 2015-16 PSS, consisting of all schools found in PSUs that were not selected with certainty to create the private school sampling frame for the 2017-18 NTPS. The area frame in the 2015-16 PSS, for both certainty and noncertainty PSUs, was constructed by clerical searches of sources such as yellow pages (yp.com), local Catholic dioceses, local education agencies, and local government offices. 2 The private school sampling frame consisted of about 24,860 private schools."}, {"section_title": "Data Collection Procedures", "text": "The 2017-18 NTPS employed a combined mail-based and internet survey approach, with subsequent telephone and in-person follow-up. Data collection included the Teacher Listing Form (TLF), the Principal Questionnaire, the School Questionnaire, and the Teacher Questionnaire. This report focuses on the Teacher Questionnaire. In preparation for school-level data collection, advance letters were mailed to the sampled schools in July 2017 to verify their addresses. Initial school packages were mailed in September 2017. 3 Next, schools were telephoned to verify school information, establish a survey coordinator, and follow up on the Teacher Listing Form if the school had not already provided an electronic teacher list. Teacher questionnaires were mailed to schools on a flow basis as teachers were sampled on an ongoing basis. The in-person follow-up period was preceded by phone calls from the telephone centers to remind the survey coordinators to have staff complete and return all forms. Nonresponding teachers were also called from the telephone centers and asked to complete the questionnaire by phone. Data collection ended in August 2018. One of the main goals of the data collection plan for the 2017-18 NTPS was to target the schools that presented a challenge to data collection during previous administrations of SASS and NTPS. During the sampling stage, certain types of schools with historically low response rates were identified as well as schools with a potentially large impact on weighting. These schools were then placed on a priority track for data collection with additional strategies to improve response (priority schools). Contact strategies that were more proactive were employed during the early phases of data collection of the 2017-18 NTPS to mitigate potential low response rates for these cases, such as in-person visits by Census field representatives. The data collection procedures also used survey coordinators to improve response. The role of the survey coordinator was to be the primary contact person at the school. A survey B-5 coordinator's duties included facilitating data collection by passing out questionnaires to the appropriate staff, reminding the staff to complete their questionnaires, and collecting the questionnaires to return. The data follow-up strategies for schools varied based on response propensity, with early field operations aimed at those schools least likely to respond to the TLF. In addition to the targeted collection strategies mentioned above, the 2017-18 NTPS teacher data collection included a randomized incentive experiment. Treatments were randomly assigned at the school level, so that all sampled teachers in a sampled school received an incentive or no sampled teachers in a sampled school received an incentive. Teacher sampling took place in waves. As part of an experiment, teachers from schools in an experimental group received advance incentives for participation. Teachers from the first 12 waves of sampling in both priority and nonpriority schools received a $5 incentive for completing the survey. For teachers sampled in waves 13 through 20, a combination of teachers, school coordinators, and principals received incentives ($5 for nonpriority schools, $10 for priority schools)\". The web was the primary mode of data collection for all questionnaire types for the 2017-18 NTPS. Paper questionnaires were introduced in later mailings, with some exceptions for the TLF."}, {"section_title": "Data Processing and Imputation", "text": "For questionnaires completed on paper, Census Bureau checked the questionnaires, keyed the data, and implemented quality control procedures. These data were combined with responses from questionnaires completed online, and those that had a preliminary classification of a complete interview were submitted to a series of computer edits consisting of a range check, a consistency edit, 4 a blanking edit, 5 and a logic edit. 6 After these edits were implemented and reviewed by analysts, the records were put through another edit to make a final determination as to whether the case was eligible for the survey and whether sufficient data had been collected for the case to be classified as a complete interview. After the final edits were run, cases with \"not-answered\" values for items remained. Values were imputed for these cases using two main approaches. First, donor respondent methods, such as hot-deck imputation, were used. Second, if no suitable donor case could be matched, the few remaining items were imputed using mean or mode from groups of similar cases to impute a value to the item with missing data. After each stage of imputation, computer edits were run again to verify that the imputed data were consistent with the existing questionnaire data. If that was not the case, an imputed value was blanked out by one of these computer edits due to inconsistency with other data within the same questionnaire or because it was out of the range of acceptable values. In these situations, Census Bureau analysts looked at the items and tried to determine an appropriate value. Edit and imputation flags, indicating which edit or imputation method was used, were assigned to each relevant survey variable. For further information, see the sections on data processing and imputation in the Survey Documentation for the 2017-18 National Teacher and Principal Survey (Cox et al. forthcoming)."}, {"section_title": "Response Rates", "text": "Unit response rates. The unit response rate indicates the percentage of sampled cases that met the definition of a complete interview. The weighted NTPS unit response rate was produced by dividing the B-6 weighted number of respondents who completed questionnaires by the weighted number of eligible sampled cases, using the initial base weight (the inverse of the probability of selection). 7 Table B-1 summarizes the weighted unit response rates for each survey type. Overall response rate. The overall response rate represents the response rate to the survey taking into consideration each stage of the survey. For teachers, the overall response rate is calculated as the product of the response rate to two stages: the TLF and the teacher questionnaire. 8 The weighted overall response rate using the initial base weight for public school teachers was 67.0 percent, and for private school teachers was 53.9 percent. Unit nonresponse bias analysis. Because the NCES Statistical Standards (4-4) require analysis of nonresponse bias for any survey stage with a base-weighted response rate less than 85 percent, the NTPS teacher file was evaluated for potential bias. National-level estimates were first examined for potential bias. The base-weighted 9 unit response rate was calculated. The following frame characteristics were used for the Public School Teachers Data File: • Charter status: noncharter, charter; • Enrollment: less than 100, 100 to less than 200, 200 to less than 500, 500 to less than 750, 750 to less than 1,000, 1,000 or more; • Percent of enrollment with race other than White: less than 5 percent, 5 to less than 10 percent, 10 to less than 20 percent, 20 to less than 30 percent, 30 to less than 50 percent, 50 percent or more; • Percent free or reduced-price lunch eligible: less than 35 percent, 35 to less than 50 percent, 50 to less than 75 percent, 75 percent or more; • Community type (locale): city, suburb, town, rural; • Pupil-teacher ratio: less than 10, 10 to less than 15, 15 to less than 20, 20 or more; • Grade level: primary, middle, high, combined; • Region: Northeast, Midwest, South, West; • Number of teachers: less than 10, 10 to less than 25, 25 to less than 50, 50 to less than 75, 75 or more; 7 For the formula used to calculate the unit response rate, see 2012 Revision of NCES Statistical Standards: Final (NCES 2014-097). 8 For the formula used to calculate the overall response rate, see 2012 Revision of NCES Statistical Standards: Final (NCES 2014-097). 9 Unit nonresponse bias analysis for the TLF stage was conducted using the base weight, defined as the product of the initial base weight (the inverse of the probability of selection) and the sampling adjustment factor. The sampling adjustment factor is an adjustment that accounts for circumstances that affect the school's probability of selection that are identified after the data collection has begun, such as a merger, duplication, or incorrect building-level collapsing (e.g., a junior high school and a senior high school merge to become a junior/senior high school). Unit nonresponse bias analysis at the teacher level used the base weights of the teacher's school, multiplied by a factor to account for TLF nonresponse at the school level and divided by the teacher's selection probability within the school."}, {"section_title": "B-7", "text": "• Title I status : Title I program, Title I noneligible, Title I eligible but no Title I program; • Teacher status: full-time, part-time, not reported; • Subject taught: special education, general elementary, math, science, English/language arts, social studies, vocational/technical, other, not reported; and • State: 50 U.S. states and District of Columbia. The following frame characteristics were used for the Private School Teachers Data File: • Affiliation: Catholic-Parochial, Catholic-Diocesan, Catholic-Private, Baptist, Jewish, Lutheran, Seventh-Day Adventist, Other religious, Nonsectarian-Regular, Nonsectarian-Special Emphasis, Nonsectarian-Special Education; • Enrollment: less than 100, 100 to less than 200, 200 to less than 500, 500 to less than 750, 750 to less than 1,000, 1,000 or more; • Community type (locale): city, suburb, town, rural; • Grade level: elementary, secondary, combined; • Region: Northeast, Midwest, South, West; and • Number of teachers: less than 5, 5 to less than 15, 15 to less than 30, 30 to less than 50, 50 to less than 75, 75 or more. As shown in table B-1, the weighted response rate using the initial base weight for the Teacher Listing Form (TLF) was 87.1 percent for public schools and 71.0 percent for private schools. The weighted questionnaire response rate using the initial base weight for the teacher survey was 76.9 percent for public school teachers and 75.9 percent for private school teachers. The overall response rate was 67.0 percent for public school teachers and 53.9 percent for private school teachers. For the teacher survey, nonresponse can occur both at the school level and at the teacher level. For some schools, no TLF was obtained and teachers could not be sampled from these schools. Some sampled teachers from schools that provided a TLF did not participate in the survey. To reflect this, national estimates were examined for potential bias at the school level and at the teacher level. For the TLF, the school base-weighted distribution of TLF respondents was compared to the baseweighted distribution of eligible schools through t tests to find any school groups with potential bias prior to TLF nonresponse adjustments. All t tests were repeated using the nonresponse-adjusted final weights for TLF respondents to assess the effect of these weighting adjustments. Similar analyses were conducted for the teacher questionnaire. The weighted distribution of teacher respondents was compared to the weighted distribution of eligible teachers through t tests to find any school or teacher groups with potential bias prior to teacher weighting adjustments. This analysis used the teacher base weight multiplied by a TLF nonresponse adjustment factor, in order to examine the impact of teacher-level nonresponse after accounting for TLF nonresponse. As for the TLF, all t tests were repeated using the nonresponse-adjusted final teacher weights for teacher respondents. Tables B-2 and B-3 identify national-level school and teacher groups with a statistically significant difference in base-weighted percentages between the eligible cases and respondents for public and private schools, respectively. Each table also identifies any groups with a statistically significant difference between base-weighted eligible cases and final-weighted respondents. B-8 Table B-2. Indication of potential sources of bias for public school teacher data at the national level based on comparisons between eligible teacher distribution and base-weighted or nonresponse-adjusted respondent distributions: 2017-18  Weighting adjustments at both the TLF (i.e., school) and teacher levels were designed to reduce or eliminate nonresponse bias and to reduce the variance introduced due to sampling by adjusting the sample estimates to known totals from the frame. The final-weighted comparisons to eligible cases shown in tables B-2 and B-3 reflect the effect of weighting adjustment. Table B-2 shows that nonresponse adjustments eliminated most but not all evidence of potential bias for public school TLFs and introduced potential bias for some items. Evidence of potential bias remains for public schools after TLF nonresponse adjustments for the following national-level items included in the analysis: • Charter school status, for charter and noncharter schools; • Community type, for city and rural schools; • Enrollment, for schools with less than 100 students; • Grade level, for combined schools; • Number of teachers, for schools with less than 10 teachers and with 50 to 75; • Percent non-White, for schools where 30 to less than 50 percent of students were non-White; • Pupil-teacher ratio, for schools with a pupil-teacher ratio of less than 10; and • State, for schools in Colorado, Georgia, Hawaii, Kansas, Maryland, Nebraska, New Mexico, New York, Rhode Island, South Carolina, Tennessee, Texas, Utah, and Virginia; and Title I status, for schools that are not eligible for Title I. Evidence of potential bias formed for public schools after TLF nonresponse adjustments for the following national-level items included in the analysis: • Enrollment, for schools with 1,000 or more students; • Number of teachers, for schools with 75 or more teachers; • Percent free or reduced-price lunch eligible, for schools where less than 35 percent of students were eligible for free or reduced-price lunches; • State, for schools in Florida, Massachusetts, and Nevada; and • Title I status, for Title I schools. Table B-3 shows that nonresponse adjustments eliminated most but not all evidence of potential bias for private school TLFs and introduced potential bias for some items. Evidence of potential bias remains for private schools after TLF nonresponse adjustments for the following national-level items included in the analysis: • School classification, for Nonsectarian; • Affiliation, for Jewish and Nonsectarian-Regular schools; and • Enrollment, for schools with less than 100 and with 500 to less than 750 students. Evidence of potential bias formed for private schools after TLF nonresponse adjustments for the following national-level item included in the analysis: • Number of teachers, for schools with 30 to less than 50 teachers. For the teacher questionnaire, the final-weighted comparisons to eligible cases shown in tables B-2 and B-3 reflect the effect of teacher weighting adjustments after adjusting for TLF nonresponse. Table B-2 shows that weighting adjustments eliminated some but not all evidence of potential bias for public school teachers and introduced potential bias for some items. Evidence of potential bias remains for public school teachers after weighting adjustments for the following national-level items included in the analysis: • Community type, for teachers in city schools and suburban schools; • Grade level, for teachers in combined schools; • Percent free or reduced-price lunch eligible, for teachers in schools where 50 to less than 75 percent of students were eligible for free or reduced-price lunches; • Pupil-teacher ratio, for teachers in schools with a pupil-teacher ratio of 20 or more; • Subject taught, for teachers with a main subject of special education and other; and • State, for teachers in schools in the District of Columbia. Evidence of potential bias formed for public school teachers after nonresponse adjustments for the following national-level for teacher items included in the analysis: • Charter status, for teachers in charter schools and noncharter schools; • Percent free or reduced-price lunch eligible, for teachers in schools where less than 35 percent of students were eligible for free or reduced-price lunches; • Title I status, for teachers in schools with a Title I program and in schools that are eligible for Title I but are not Title I schools; and • Subject taught, for teachers with a main subject of general elementary or that did not report a main subject. For public school TLFs, a limited set of characteristics (community type and grade level) were also examined for potential nonresponse bias at the state level. Before weighting adjustments, 91 out of the 408 state by characteristic cells showed a significant difference between the distribution of respondents and the distribution of all eligible cases; after weighting adjustments, this was reduced to only 65 cells. The following 21 states had multiple significant differences in community type and/or grade level domains after weighting adjustments, which is evidence of potential bias at the state level: Alaska, California, Colorado, Delaware, Florida, Georgia, Idaho, Illinois, Iowa, Kansas, Maine, Maryland, Mississippi, Montana, Nebraska, New Mexico, South Carolina, Tennessee, Texas, Wisconsin, and Wyoming. For public school teachers, the same two characteristics (community type and grade level) were also examined for potential nonresponse bias at the state level, as well as teacher subject. Before weighting adjustments, 105 out of the 867 state by characteristic cells showed a significant difference between the distribution of respondents and the distribution of all eligible cases; after weighting adjustments, this was reduced to 41 cells. The following 8 states had multiple significant differences in community type, grade B-13 level, and/or teacher subject domains, which is evidence of potential bias at the state level: California, Colorado, Delaware, Maryland, Massachusetts, New York, South Carolina, and Utah. For private school TLFs, a limited set of characteristics (region and grade level) were also examined for potential nonresponse bias within school classification (Catholic, other religious, nonsectarian) and affiliation strata (Catholic-Parochial, Catholic-Diocesan, Catholic-Private, Baptist, Jewish, Lutheran, Seventh-Day Adventist, Other religious, Nonsectarian-Regular, Nonsectarian-Special Emphasis, Nonsectarian-Special Education). Before weighting adjustments, 8 out of the 21 affiliation by characteristic cells showed a significant difference in response rate; after weighting adjustments, this was reduced to two cells. The Catholic affiliation had multiple significant differences in region and/or grade level domains after weighting adjustments. For private school teachers, the same two characteristics (region and grade level) were also examined for potential nonresponse bias within school classification (Catholic, other religious, nonsectarian) and affiliation strata (Catholic-Parochial, Catholic-Diocesan, Catholic-Private, Baptist, Jewish, Lutheran, Seventh-Day Adventist, Other religious, Nonsectarian-Regular, Nonsectarian-Special Emphasis, Nonsectarian-Special Education), as well as teacher subject. Before weighting adjustments, 7 out of the 48 affiliation by characteristic cells showed a significant difference between the distribution of respondents and the distribution of all eligible cases; after weighting adjustments, this was reduced to one cell. No affiliations had multiple significant differences in region, grade level, and/or teacher subject domains after weighting adjustments. For further information on unit response rates and nonresponse bias analysis, see the Survey Documentation for the 2017-18 National Teacher and Principal Survey (Cox et al. forthcoming). Item response rates. The item response rate indicates the percentage of respondents who answered a given survey question or item. The weighted NTPS item response rate is calculated by dividing the weighted number of respondents who provided an answer to an item by the weighted number of respondents who were eligible to answer that item. 10 Table B-4 provides a summary of the weighted item response rates. For the public school teacher data, four of the survey items included in this report have item response rates less than 85 percent. Those items were (1) number of students in 8 th class period (question 2-13d(8)), with an item response rate of 78.4 percent; (2) number of students in 9 th class period (question 2-13d(9)), with an item response rate of 76.6 percent; (3) number of students in 10 th class period (question 2-13d(10)), with an item response rate of 74.4 percent; and (4) additional compensation earned from working in any job outside this school system (question 8-7a-amount), with an item response rate of 84.3 percent. For the private school teacher data, four of the survey items included in this report have item response rates less than 85 percent. Those items were (1) number of students in 8 th class period (question 2-13d(8)), with an item response rate of 84.9 percent; (2) number of students in 9 th class period (question 2-13d(9)), with an item response rate of 82.1 percent; (3) number of students in 10 th class period (question 2-13d(10)), with an item response rate of 78.5 percent; and (4) additional compensation earned from working in any job outside this school system (question 8-7a-amount), with an item response rate of 83.6 percent. For further information on item response rates and bias analysis, see the Survey Documentation for the 2017-18 National Teacher and Principal Survey (Cox et al. forthcoming). "}, {"section_title": "B-14", "text": ""}, {"section_title": "Weighting", "text": "The general purpose of weighting is to scale up the sample estimates to represent the target survey population. For NTPS, the base weight for teacher sampling is generated by taking the base weight for school sampling (representing the reciprocal of the probability of selection of the school), adjusted for sample schools for which a TLF is not obtained, and multiplying this by the reciprocal of the probability of selection of the teacher within the school (from the TLF). Teacher samples are only drawn from schools for which a TLF is obtained, so adjustment needs to be made for schools for which TLFs are not obtained. Next, a nonresponse adjustment factor for teacher nonresponse is calculated and applied based on a weighting cell adjustment. Weighting cells for teacher nonresponse are developed using tree search algorithms. These cells are selected to be homogeneous in response propensity within cells and heterogeneous in response propensity across cells (response propensity is the underlying \"chance\" that a particular sample unit will respond by completing the questionnaire: its individual response rate). The adjustment is the inverse of the weighted teacher response rate within each cell, and each respondent in the cell receives this adjustment. Nonrespondents are given weights of zero: the respondents are reweighted to represent the nonrespondents. The variables examined for potential bias were the same as those used by the tree search algorithms. All subgroups that showed potential bias as given in table B-2 above were used as cell generators by the tree search algorithms, as well as other subgroups which are related, and may show differential response conditional on other subgroups (i.e., they may be chosen as cell generators by the tree search algorithm within particular branches). For the Public School Teacher Data File, a raking factor is calculated and applied to the sample to adjust the sample totals to CCD frame totals for FTE teachers, so that the sum of the weights within each of the specified cells is equal to the corresponding CCD frame total for the cell. Raking is an iterative process that is repeated until the weights simultaneously aggregate to be equal to each set of frame totals. In some cases, extreme weights may be trimmed back to a cutoff value. This all improves the precision of survey estimates. The raking cells are defined based on school level, urbanicity, and percentage of students eligible for free or reduced-price lunch. The first dimension combines school level and the percentage of students eligible for free or reduced-price lunch. The second dimension combines school level and urbanicity. A final adjustment factor is then applied to resolve any inconsistencies between the estimated number of teachers on the NTPS Public School and Public School Teacher data files, so that the sum of the weights within each cell is equal to the corresponding weighted estimate of the number of teachers from the school questionnaire. A tree search algorithm is used to define the adjustment cells, using the same list of cell generators as for the nonresponse adjustment factor. For the Private School Teacher Data File, a raking factor is calculated and applied to the sample to adjust the sample totals to PSS frame totals for FTE teachers, so that the sum of the weights within each of the specified cells is equal to the corresponding PSS frame total for the cell. These cells are defined based on B-15 school level, urbanicity, and affiliation. The first dimension combines school level and affiliation. The second dimension combines school level and urbanicity. As with the Public School Teacher Data File, extreme weights may be trimmed back to a cutoff value to improve the precision of survey estimates. A final adjustment factor is then applied to resolve any inconsistencies between the estimated number of teachers on the NTPS Private School and Private School Teacher data files, so that the sum of the weights within each cell is equal to the corresponding weighted estimate of the number of teachers from the school questionnaire. A tree search algorithm is used to define the adjustment cells, using the same list of cell generators as for the nonresponse adjustment factor. The product of these factors is the final weight for each NTPS respondent, which appears as TFNLWGT on the NTPS Public School Teacher and Private School Teacher Data Files."}, {"section_title": "Variance Estimation", "text": "In surveys with complex sample designs, such as NTPS, direct estimates of sampling errors that assume a simple random sample typically underestimate the variability in the estimates. The NTPS sample design and estimation include procedures that deviate from the assumption of simple random sampling, such as sampling with differential probabilities. NTPS uses jackknife replication to calculate appropriate sampling errors that account for the complex sample design. Jackknife replication methods involve dropping a small portion of the sample from the full sample and computing the statistic of interest for the retained and reweighted sample (the jackknife replicate). The sum of squares of the replicate estimates around the full sample estimate provides an estimate of the variance of the statistic. The NTPS teacher data files include a set of 200 replicate weights designed to produce variance estimates. The set of replicate weights for each file should be applied to the respondents in that file. The replicate weights for NTPS respondents are TREPWT1-TREPWT200 for teachers."}, {"section_title": "Reliability of Data", "text": "A survey estimate is subject to two types of errors: nonsampling and sampling. Nonsampling errors are attributed to many sources, including definitional difficulties, the inability or unwillingness of respondents to provide correct information, differences in the interpretation of questions, an inability to recall information, errors made in collection (e.g., in recording or coding the data), errors made in processing the data, and errors made in estimating values for missing data. Quality control and edit procedures were used to reduce errors made by respondents, coders, and interviewers. In contrast, sampling errors result from the collection of data from a sample of the population rather than the full target population, and estimates of the magnitude of sampling error for NTPS data can be derived or calculated. Because of both types of errors, the survey estimates may differ from the values that would be obtained from the target population using the same questionnaire, instructions, and field representatives."}]