[{"section_title": "Abstract", "text": "Abstract: Many investigators recognize the importance of data sharing; however, they lack the capability to share data. Research efforts could be vastly expanded if Alzheimer disease data from around the world was linked by a global infrastructure that would enable scientists to access and utilize a secure network of data with thousands of study participants at risk for or already suffering from the disease. We discuss the benefits of data sharing, impediments today, and solutions to achieving this on a global scale. We introduce the Global Alzheimer's Association Interactive Network (GAAIN), a novel approach to create a global network of Alzheimer disease data, researchers, analytical tools, and computational resources to better our understanding of this debilitating condition. GAAIN has addressed the key impediments to Alzheimer disease data sharing with its model and approach. It presents practical, promising, yet, data owner-sensitive data-sharing solutions."}, {"section_title": "", "text": "G ood, reliable, curated, and complete data are at the core of meaningful scientific research today. In recent years, the advancement of technology has empowered us to generate, collect, and manage massive amounts of data in the field of Alzheimer disease research. As imaging, clinical, biological, and genetic data acquisition becomes more widespread and in aggregate becomes \"big data,\" scientific research becomes increasingly data driven and computationally intensive in terms of analysis, maintenance, and storage. In today's world, data are not only the end result of research studies but also the beginning of new hypotheses and opportunities for innovation that may never have been otherwise explored. The possibilities can further multiply considerably if we can successfully share and integrate these \"big data\" across organizations, groups, and countries. There have been major strides in data sharing in the field of Alzheimer disease research, including the Alzheimer's Disease Neuroimaging Initiative 1 (ADNI) in the United States, the Australian Imaging, Biomarker & Lifestyle Flagship Study of Ageing 2 (AIBL) in Australia, neuGRID for You or \"N4U\" 3 in Europe, the French National Alzheimer's Information System and Databank, 4 the National Institute of Aging Genetics of Alzheimer's Disease Data Storage Site or NIAGADS, 5 and SveDemthe Swedish Dementia Registry, 6 to name a few. ADNI was launched in 2004 to collect longitudinal data from 58 sites around the United States for clinical, imaging, and genetic data types from elderly participants with normal cognition and participants diagnosed with mild cognitive impairment or Alzheimer disease. The data are freely accessible to any researcher, resulting in an unprecedented number of research articles using these data. 7 These efforts and systems have succeeded in providing models and frameworks that groups can adopt to share their data. However, there remains open the challenge of being able to share Alzheimer disease data across any set of organizations across the globe, regardless of how they maintain their own individual archives. Table 1 provides a more comprehensive list of Alzheimer disease research and data organizations around the globe.\nTechnology, or rather the lack of it, is not the factor that can explain why data sharing is not universal in Alzheimer disease research. The more significant impediments today are often sociological. A major concern for investigators is data \"ownership.\" The collection and integration of clinical, genetic, and/or imaging data requires significant resources, including time, money, and expertise. Providing access to one's data too soon may feel similar to giving away work \"for free\" or also raise concerns that a competing researcher may \"find the answer first.\" A related issue is unauthorized use and/or redistribution of data. Many groups require users to agree to a \"Data Use Agreement.\" However, it is practically impossible to ensure that rules are followed, and most policing methods are inappropriate. Subject data privacy and unauthorized access to data are also key concerns for potential data providers.\nThe remainder of this paper is organized as follows. The next section describes our approach. We first describe various data-sharing models and explain the rationale for the Global Alzheimer's Association Interactive Network (GAAIN) design. We describe the GAAIN approach with early experimental indications, and provide a conclusion summarizing our experience as well as directions for the future."}, {"section_title": "METHODS", "text": "Data can be shared and integrated in multiple ways using different models. The term model encompasses the nature of technology and software as well as the processes employed for data sharing. 8 There are a few fundamental dimensions for classifying data-sharing models that we must consider in designing the approach best suited for GAAIN. One dimension is that of flexibility and extensibility, which is how well (or not) does a data-sharing model lend itself to a dynamic and evolving data-sharing environment. A second dimension is around the sensitivity of the data and relates to how well (or not) data ownership and privacy concerns are addressed by the data-sharing model. Data sharing itself, and data ownership and privacy are mutually competing and must be balanced. The presidential bioethics advisory committee report 9 also emphasizes the benefits of sharing and the development of solutions that achieve data sharing but without compromising subject data privacy.\nIn the Figure 1 , we have enumerated and placed different data-sharing models along the (2) dimensions of flexibility, and data ownership sensitivity. It is important to understand various existing models in designing any new approach (GAAIN) to network them all together. The shared data repository approach stores data from multiple places in a single location. Such a model applies when providers can more readily share and distribute their data. It is also better suited for environments where evolution of the data-sharing network, that is, new data providers or 4 These data are transmitted by individual memory centers at hospitals and is maintained in a centralized data bank.\nA (tightly coupled) federation is a model that is more flexible and also more sensitive to data ownership. In a federated model, a set of organizations come together to form a federation (group) and commit that their databases would all use a single, agreed upon data model and schema. Data resides with the individual data organizations but can be brought together when users require it. The Human Imaging Database (HID) 14 is an example. HID is an extensible database management system developed to handle the increasingly large and diverse datasets collected as part of the MBIRN and FBIRN collaboratories and throughout clinical imaging communities at large. Certain research groups have adopted the HID data schema for storing their subject data, 14 thus becoming part of the HID federation. We must mention that the notion of a \"federated database\" in the original sense was that of what we are referring to as a tightly coupled federation, that is, where multiple databases agree to use the same schema. Over the years, however, the biomedical community has taken a looser interpretation of the term federation, using it to refer to any non-warehousing-based data integration approach, including mediation. In the rest of this paper, we will also assume the latter convention of a more expansive interpretation of the term \"federation.\"\nThe mediation approach is significantly more flexible compared with the (tightly coupled) federated approach. The approach is based on the idea of an information broker 8 that harmonizes data from independent, heterogenous, and distributed data repositories. The term \"mediate\" refers to the process of taking user requests, translating them to individual requests to individual data sources, harmonizing the results from the individual data sources and returning the integrated results to the user. As opposed to a tightly coupled federation, no agreement and enforcement of a common data model (CDM) is required across data partners and data model harmonization is left to the mediator information broker. The Biomedical Informatics Research Network or BIRN, 15 the Extensible Neuroimaging Archive Toolkit or XNAT, 16 and the Neuroinformatics Information Framework or \"NIF\" mediator 17 have employed mediation approaches in the neuroinformatics context. The mediation approach is less appropriate in environments where data ownership concerns are high, as it typically requires direct access to any data provider's databases, other storage systems, or \"APIs\" (application programming interfaces). Gridbased approaches 18 are similar to mediation but are more partner data sensitive, with data access control and security capabilities supported by the grid infrastructure. There are also hybrid approaches that draw from multiple modalities. For instance, the European Medical Information Framework 19 (Table1:R7) and NeuGRID (Table1:R12) initiatives have elements of both the shared data repository and mediation models.\nAn approach that has gained success in recent years, especially in the clinical, health, and medical data-sharing domains, is the CDM approach. Data providers agree to adopt a CDM to which they would transform their data (or portions thereof) for sharing. This model is more data ownership and privacy sensitive as data providers control exactly what parts of their data they offer for transformation and sharing. The Clinical Data Interchange Standards Consortium 20 (CDISC) has developed a set of common concepts or elements for the Alzheimer disease domain. TAUG-Alzheimer's 21 is the CDISC Alzheimer's Therapeutic Area User Guide which describes the most common research concepts relevant to studies of Alzheimer disease and mild cognitive impairment, and the necessary metadata to represent such data consistent with CDISC standards.\nAn orthogonal issue is the choice of the semantic data model or framework 15 for data sharing, that is, the formal representation of the data as it is shared. The relational model is appropriate for integrating structured \"row and column\" oriented data 8 that is typically stored in database systems or spreadsheets. The eXtensible Markup Language (XML)-based approaches are better suited for data that has a more hierarchical representation, such as in neuroimaging. 16, 22 The Semantic-Web approach, 8 which is the vision of interconnected nodes of open Internet resources such as Web pages, has also been applied to biomedical data sharing. In recent years this vision has evolved into the \"Linked Data\" effort, 23 where content or data providers tag their data in terms of common or universally understood elements and these common element tags are used to link data in multiple sources together. The approach is directed toward freely available data that can be readily and openly shared on the Internet. OpenPHACT, 24 an open linked data system for pharmaceutical data, is an example.\nIn designing the GAAIN approach, we prioritized the following: (1) Concerns regarding data ownership and data privacy are paramount. Any practical solution must address these issues. (2) The scope of GAAIN is global and data may come from any relevant institution and group, and not a predetermined fixed set of groups or institutions. (3) The nature of the GAAIN network is dynamic where new data partners could be added frequently, also the data from existing partners can be updated. (4) The GAAIN data are highly structured and relational.\nThe data shared are primarily subject data that are organized by structured categories such as subject demographics, family history, various kinds of assessments, etc., and is typically stored in granular, welldefined data elements or fields. (5) The expectation of GAAIN users is that of getting harmonized data from multiple providers, and the harmonization is complex given multiple factors such as syntactic and semantic heterogeneity, 25 where there are various representations of identical elements, data organizational differences, and also data format differences across different datasets. As examples of semantic heterogeneity across datasets consider: (1) The Italians' Logical Memory tests range from 0 to 15, instead of 0 to 25 as in the United States; (2) The LAADC (Table1:R7) measures the size of the hippocampi differently than how ADNI does; and (3) INDD (Table1:R4) measures CSF levels of total tau protein using a different antibody than ADNI. Table 2 is a summary matrix of various data-sharing models with the key data-sharing concerns or features that are relevant to GAAIN. A \" + \" denotes that that model is well suited to addressing a particular concern or feature and a \"À\" denotes that the model exacerbates the concern.\nWe have adopted the CDM approach for GAAIN. As Table 2 summarizes, models such as a shared repository or mediation are disadvantageous for addressing data ownership concerns. The tightly coupled federated model will not scale to the dynamic nature and global scope of GAAIN.\nThe GAAIN common model approach has the additional key aspects:\nGAAIN utilizes an extensible CDM to accommodate data from any data partner. GAAIN uses a \"transform-and-cache-onsite\" approach, where data are prepared for sharing at the partner site. GAAIN does not store or persist any of that data. GAAIN access to data partner databases and other systems is nonintrusive and is controlled by the data partner. The common model, at present, comprises of 24 data elements about a subject taken over 4 years. We are initially focusing on the data elements that are most frequently used by investigators for cohort discovery and that are also (mostly) present in the datasets that we have integrated into GAAIN so far. These elements are listed in Table 3 and we are currently expanding the common model to hundreds of data elements."}, {"section_title": "GAAIN", "text": "GAAIN is a data federation infrastructure coupled to computational resources. The GAAIN architecture is built so the data resides at the site of the Data Partners. Partner data are transformed to a GAAIN common model data \"cache.\" All software processing to transform the data partner's data is done within the partner's data and computing environment. Data are never saved on the GAAIN servers or other locations, thus reducing the risk of unauthorized access. Links between partners of GAAIN are monitored by the partner and the partner can disable the links dynamically. Data Partner identity is unambiguous in GAAIN with clear data use requirements. Data transformation overhead on part of the Data Partner is minimal. Data Partners are provided with a completely packaged and preconfigured software to perform any data transformation tasks. This approach has been successful with most Data Partners. In the occasional case where the Data Partner may not have resources to support data transformation client, we can compute the transformation locally, that is, at the GAAIN server.\nFor simplifying data integration, GAAIN provides automated and semiautomated tools to transform new datasets to the GAAIN common model. The GAAIN Entity Mapper (GEM) 26 aligns data elements in a Data Partner's datasets with corresponding elements in the GAAIN model. Another system, the GAAIN Automated Data Transformer 27 provides a general-purpose data transformation capability to quickly configure a new dataset for GAAIN.\nThe harmonization aspect in GAAIN is achieved through its CDM. The GAAIN common model draws from elements of the CDISC, 20 an organization that aims to establish standards to support the acquisition, exchange, submission, and archive of clinical research data and metadata. CDISC has identified a set of terms to describe a number of clinical data measures commonly used in Alzheimer disease research."}, {"section_title": "The Role of Data Standards and Ontologies in Data Sharing", "text": "The very interpretation of data \"standardization\" and its role in data sharing and integration needs careful consideration. Expectations that data standards would lead to universal data sharing were not realized as autonomous organizations that create or maintain data could not be forced to conform their data to standards specified by a central body. 28, 29 Today, however, communities have evolved to a more pragmatic and successful model, with the notion of CDMs. 17 As opposed to standards, CDMs are designed \"bottom up\" from individual databases and datasets to be integrated. CDMs are comprised of multiple common data elements. A significant aspect of common data elements is that they are typically anchored to more widely used (and accepted) knowledge resources or ontologies-for instance, \"SNOMED\" 30 and the \"UMLS.\" 31 The CDM approach has seen significant success in domains such as clinical data integration in recent years, an example being OMOP-the Observable Medical Outcomes Partnership CDM. 29 The GAAIN approach has successfully addressed the data-sharing impediments discussed earlier. Table 4 summarizes the impediments along with the specific GAAIN technology and process elements that address them. From a user's point of view within GAAIN, data integration between multiple sources appears seamless. The GAAIN system invites exploration by presenting an interactive graphical interface tool for GAAIN data-the GAAIN Interrogator, through which data may be quickly and easily understood. The GAAIN Interrogator shows investigators how all of it fits together by graphing the data in interconnected views. Instead of typing numbers into text boxes, investigators search the data by interacting with graphs as illustrated in Figure 2 . The data are \"interrogated\" by manipulating the graphs, which in turn change the search parameters and automatically update the entire display. Searching takes place by dynamically defining cohorts and visually exploring the differences between them. Every search result shows the number of subjects from each Data Partner and directs investigators how to obtain the data. Investigators can see which Data Partners have data \"online\" and \"offline\" on the GAAIN network and search for a study population, or cohort, across the online Data Partners.\nFor an initial stage of cohort discovery, we have developed the GAAIN Scoreboard which provides an aggregated \"snapshot\" of the space of data available at that point through GAAIN. The GAAIN Scoreboard is a graphical interface tool that provides information such as counts of subjects in various GAAIN data sources that are online and active. This summary information is useful and informative to investigators for cohort discovery and also does not provide any actual instance level data from any data partner. Following cohort discovery, data access is determined by the Data Partner's data use provisions. By sharing metadata, investigators retain ownership and access control while avoiding privacy policy violations."}, {"section_title": "RESULTS", "text": "Although GAAIN technology development is still in its early stages, experimental evaluations evidence the promise of our approach, particularly toward simplifying data sharing. We have conducted experimental evaluations of the time and effort to transform Alzheimer disease datasets from various data partners using the GAAIN data transformation tools, and demonstrated that the use of these tools leads to a significant reduction in developer time and effort to transform a dataset as compared with existing approaches.\nThe GAAIN Automated Data Transformer introduced more powerful mechanisms for specifying how a particular dataset should be transformed into the GAAIN common model. It also introduced a paradigm where the data from any data provider has a uniform canonical representation within the Automated Data Transformer system. The implication of this is that the specifications for data transformation, which are essentially a set of logical data transformation rules, \"look alike\" across different datasets. The structure and set of transformation rules is almost identical across different datasets, though they must account for the fact that different datasets could have different names and terminology for the same data elements. This feature makes it easy to adapt and reuse a set of data transformation rules 27 We have also optimized the actual execution time required to conduct a complete data transformation. While prior approaches result in an execution time of several hours to transform a single dataset, our approach reduces this to just a few minutes in a computing environment with identical configuration. 27 We have been able to achieve this by incorporating recent features in the underlying database technology, which is part of the Automated Data Transformer.\nAnother key challenge for developers is data mapping, that is, the task of mapping data elements in a new (partner) dataset to corresponding data elements in the GAAIN CDM. Historically, this is done manually, involving several weeks of effort per dataset. The GEM system is a tool that provides automated assistance for this task. GEM is built to leverage the documentation of data, particularly that in data dictionaries associated with the data, to propose mappings of elements across 2 partner datasets or from a dataset to the GAAIN common model. GEM has been demonstrated to provide highly accurate mappings, with precision and recall around 85% each, for actual GAAIN datasets. 30 We have also validated that the mapping accuracy of GEM is significantly higher (by about 15% for each of precision and recall) than that achieved by 2 (generic) schema-matching software tools with the same datasets. These other tools are Harmony 32 and Coma + + . 33 The GEM system was designed with a focus on the Alzheimer disease and other medical domain, and is able to maximally leverage information in the data documentation that other generic matching tools cannot."}, {"section_title": "DISCUSSION", "text": "The vision for GAAIN is to create and maintain a network of AD resources (data, tools, and infrastructure) to establish and sustain the first global database for Alzheimer disease research. GAAIN's innovative approach not only enables more accessible Alzheimer disease research but also sets a benchmark for how big data, distributed initiatives for other complex diseases could function in the future.\nIt is useful to represent GAAIN data with multiple levels of abstraction. This helps support a wider spectrum of information query. For instance, an investigator may be GAAIN enforces partner data access control and privacy requirements The GAAIN \"no-data-stored-at-GAAIN\" model further strengthens data privacy as at no point does partner data persist externally to the partner environment, in any form initially interested in just identifying available data sources and datasets, or they may be interested in obtaining an aggregate summary of data rather than the actual data. Data partners can easily provide metadata immediately but often take longer to provide the source subject data several weeks or months later. With the metadata available, however, the process of integrating a dataset with transformations to the GAAIN common model can be initiated. GAAIN's success is dependent on Data Partners joining and sharing their data through the network. We are currently in various phases of recruitment with over 55 data sources in North America, Europe, Asia, and Australia, with an average of 3 to 4 new data sources every week. During the recruitment process, we receive consistent feedback about data sharing from all of our prospective data partners. All Data Partners agree that data sharing, in an approach such as GAAIN, is the next logical step in big data and Alzheimer disease research. Although potential partners see the benefit of GAAIN, the process of onboarding can be a lengthy process, averaging at least 3 months. Partners often require approvals from an executive committee, sometimes necessitating a process ranging from written proposals to web conference meetings or legal review. We ask each of our Data Partners to sign a nonlegally binding Memorandum of Understanding (MOU) as a formal agreement to join the project. The MOU explains the GAAIN model and assures our Data Partners that GAAIN will not violate any Data Partner policies. This is a simple document with a 1-time sign on requirement and does not require a more extensive proposal from a data partner. To date, there have been no objections to the MOU. It is our hope that as GAAIN continues to grow and the field of big data research, specifically in Alzheimer disease, moves forward, research groups will continue to regard GAAIN as an attractive solution and appreciate the effect it can have on global science.\nThe key design elements in the GAAIN approach are, namely: (1) partner-sensitive data sharing, (2) simplifying data integration processes by automation, and (3) the CDM all contribute to achieving a global data federation. Our current efforts are focused on: (1) the recruitment of and integration of additional key Alzheimer disease data providers into GAAIN, (2) the further development of technology and infrastructure elements described above, and (3) integration of additional analytic tools so that data and analyses are more tightly coupled and provided over the GAAIN network."}]