[{"section_title": "Abstract", "text": "Through several decades of research, a great deal has been written about trends in black-white test scores and the factors that may explain the gaps in different subject areas. Only a few studies have examined the changing relationships between gaps in students' test scores and family and school measures in nationally representative data over several periods. This article builds on this previous work and addresses some of its limitations by analyzing nationally representative data in 1972, 1982, 1992, and 2004 that provide consistent measures of high school seniors' mathematics achievement and several school and family measures. Together, these databases for four cohorts of high school seniors provide the opportunity to analyze associations between the gaps in black-white test scores and changes in family background and school characteristics (in terms of both changes in means and coefficients). The analyses reveal positive changes for black students relative to white students between 1972 and 2004, such as improvement in some socioeconomic family background characteristics. Yet, some school conditions (racial/ethnic and socioeconomic composition) did not improve for black students, and despite some beneficial changes, inequalities persist."}, {"section_title": "", "text": "G aps between the achievement of black and white students continue to pose perplexing problems in the United States. In the sociology of education, many researchers have focused on different factors, related to individual, family, school, and community conditions, that may explain this gap. Yet, because of the lack of data, it has been difficult to tease out the net contributions of these various factors when they are analyzed together at the same time or over multiple periods. Although we cannot examine all the factors that research has pointed to in explaining the gap, our aim in this article is to identify the relative contributions of changing family and school characteristics to the narrowing of the gap in black-white test scores over three decades.\nCurrent educational reformers stress raising the achievement of the entire population while reducing disparities among groups, which is certainly an important goal, although a significant challenge (Berends, Bodilly, and Kirby 2002; Jencks and Phillips 1998) . The concern over some of these gaps in achievement-for example, those among racial/ethnic groups-has been heightened, in part, by the growing diversity in the United States and educational policy. For instance, the federal No Child Left Behind (NCLB) legislation requires states to report gaps in achievement between certain subgroups to help schools, districts, and states decrease them over time. 1 In this article, we empirically examine several family and school-based explanations for differences in black-white test scores in mathematics, using data for several national cohorts of high school seniors between 1972 and 2004. We address the following research questions: (1) How did the test scores of blacks and whites change between the early 1970s and 2004? (2) How did selected family and school measures change over this period? (3) To what extent were changes in these measures associated with the convergence of the gap in black-white test scores that occurred during this period? and (4) What are the policy implications that arise from our empirical analyses of how changes in families and schools are related to gaps in students' achievement in mathematics?\nBecause of the ongoing debates about families and schools, it is important to consider a more complete set of family and school changes that have taken place and to apply multivariate methods to estimate the net associations among changes in these measures and students' achievement. Furthermore, researchers have infrequently assessed such associations among family and school measures and students' achievement with several different longitudinal national cohorts. Additional empirical analyses need to be done to place students' current achievement scores in the context of long-term trends in test scores, to examine the relationships between these trends and changes in families and schools, and to address changes in educational policies (e.g., school desegregation, tracking and ability grouping, and standards-based reform)."}, {"section_title": "FAMILIES, SCHOOLS, AND GAPS IN TEST SCORES", "text": "Data from the National Assessment of Educational Progress (NAEP) revealed that high school students in the United States were scoring about the same in 2004 as they were in the early 1970s with regard to their proficiency in mathematics and reading (see Figures 1 and 2 ). These overall trends mask significant progress made by certain groups at certain points in time. For instance, between the early 1970s and early 1990s, when compared with their white counterparts, black students made substantial progress toward closing the gap in their scores in both mathematics and reading tests (see Campbell, Hombo, and Mazzeo 2000) .\nSince that time, however, the black-white gap in mathematics has increased somewhat, and the black-white gap in reading increased somewhat in the early 1990s but decreased again in the 2004 NAEP assessment. Although many researchers have addressed why the gaps in test scores narrowed between the early 1970s and early 1990s (e.g., Ferguson 1998; Koretz 1986; Neal 2006; Porter 2005) , only a few researchers have empirically studied how changes in family background and school factors were related to the convergence in test scores that occurred (Cook and Evans 2000; Grissmer, Flanagan, and Williamson 1998; Grissmer et al. 1994; Hedges and Nowell 1998) . The main reason for this dearth of empirical analysis is the lack of data for multiple student cohorts that would allow researchers to examine the relationships between family and school measures and gaps in students' achievement.\nA few studies have explored how changes in family background factors are related to gaps in students' achievement in national data. For example, Grissmer et al. (1994) estimated the net effects on mathematics and reading scores of several important family changes that occurred between the early 1970s and early 1990s and provided information about what \"nonfamily\" factors may have contributed to the trends in achievement. 2 Specifically, the study examined how achievement scores would change for 14-to 18 year olds who were raised in families of the 1950s and 1960s compared to families of the 1970s and 1980s. In addition to estimating the effects of family changes on overall test scores, Grissmer et al. estimated the effects for different racial/ethnic groups. They also compared actual changes in NAEP achievement to those predicted by changes in family characteristics. Grissmer et al.'s (1994) findings revealed that black and white students' academic achievement should have risen between the early 1970s and early 1990s. Overall, they predicted a gain of about 0.20 of a standard deviation for 14-to 18 year old youths in 1990 compared to similarly aged youths in 1970. They found that the major factors that led to higher predicted test scores were the markedly higher educational levels of parents and a smaller family size in 1990. Children in 1990 were living with better-educated parents, in smaller families, with more income per child. Grissmer et al. concluded that the effect of these factors far outweighed the negative impact of more single-parent families and the small shift in births to younger mothers. When estimating the effects of family changes for different racial/ethnic groups, Grissmer et al. (1994) also predicted positive gains in test scores. Black students made sizable gains in test scores over and above the gains that family changes would predict, while white students did not. Their results suggested that changes in the characteristics of minority families-when considered together-were more supportive of students' achievement in 1990 than in the early 1970s. Although their analyses fully accounted for the gains of white students, Grissmer et al. concluded that changing family characteristics accounted for no more than about a third of the gain for black students.\nIn subsequent research, Grissmer et al. (1998) extended their analysis by assessing issues that may have contributed to the convergence in the gap in black-white test scores; specifically, they reviewed factors that may have changed between the early 1970s and early 1990s, such as desegregation, secondary school tracking, changes in the curriculum, per pupil expenditures, pupilteacher ratios, teachers' educational background and experience, and school violence. On the basis of this review of the extant research, Grissmer et al. (1998) concluded that both social investment in the 1960s and 1970s (i.e., the civil rights movement and the War on Poverty programs) and the schoolbased changes (desegregation, secondary school tracking, and class size) were the likely factors that explain the closing of the gap in test scores between black and white students. Yet again, they were not able to conduct original empirical analyses of these factors, so the arguments remain speculative.\nBuilding on the research by Grissmer et al. (1994) , Hedges and Nowell (1999) were also interested in the achievement gaps among students over the past 30 years and how family background characteristics were related to any changes in these gaps. In their study of several national data sets from the early 1960s to the early 1990s, Hedges and Nowell (1998, 1999) pointed out several limitations of Grissmer et al.'s (1994) research. Their criticisms were aimed at Grissmer et al.'s assumptions that the effects of family characteristics on students' achievement remained the same between the early 1970s and early 1990s and that all unexplained changes in the gaps in test scores were attributable to social and educational policies. Hedges and Nowell addressed some of these problems by analyzing all national data that were available between 1965 and the early 1990s that included students' test scores and family characteristics, such as parents' educational attainment, family income, and mother's work status. 3 Like Grissmer et al. (1994) , Hedges and Nowell (1998, 1999) found that the gap in black-white test scores narrowed significantly over time when they examined changes in mean achievement levels. In addition, their analyses of family background characteristics accounted for roughly onethird of the achievement gap, which was also similar to Grissmer et al.'s findings. However, in contrast to Grissmer et al., Hedges and Nowell found that the relationships between family characteristics and students' achievement were not constant over time. 4 Moreover, they argued that more direct measures of educational policies that may have contributed further to the closing of the gap are needed.\nAlthough it made a significant contribution to the understanding of trends in blackwhite test scores as they are related to family characteristics, Hedges and Nowell's study (1998, 1999) is not without limitations. First, the measures of family characteristics (e.g., family income and parents' education) were not operationalized in the same way. For example, in the data from the 1965 Equality of Educational Opportunity (EEO) study, Hedges and Nowell used possessions in the home as a proxy for family income because data on income were not available in the EEO as they were in the other databases they analyzed. Second, Hedges and Nowell were not able to examine changes in schools that occurred during the early 1960s and 1990s, and they raised the importance of such analyses. Third, although they allowed for the effects of family background to vary across cohorts, they did not systematically examine how changes in mean levels of family background measures or the effects (i.e., coefficients) of these measures were related to the closing of the gap in black-white test scores.\nExtending research to examine school quality, Cook and Evans (2000) were specifically interested in whether changes in family characteristics or changes in school quality (or both) were associated with the narrowing of the gap in black-white test scores over time. Analyzing the NAEP trend assessment, their research focused not only on how changes in mean levels of family and school characteristics were related to the trends in black-white test scores, but on how the effects of family and school measures on achievement were related to these trends. They found that only about 25 percent of the overall convergence in black-white test scores can be attributed to changing family and school characteristics. They argued that the remainder is due to changes within schools. Cook and Evans's (2000) study had several strengths. First, Cook and Evans were able make fewer assumptions than the studies reviewed so far. For example, they examined tests that were stable over time, in contrast to the studies by Grissmer et al. (1994 Grissmer et al. ( , 1998 and Hedges and Nowell (1998, 1999) . In addition, their methods allowed them to examine how changes in the relationships between their measures and students' achievement differ over time, again in contrast to Grissmer et al.'s (1994 Grissmer et al.'s ( , 1998 study, which assumed that these relationships are stable. Finally, Cook and Evans extended the critical work on changes in families to include changes in school quality in relation to the gap in black-white test scores.\nHowever, their study also had limitations. For instance, Cook and Evans examined changes in family background as measured by parents' educational attainment. Unfortunately, the NAEP is limited in terms of family background measures because it lacks other family measures, such as parents' income, occupational status, and other family characteristics (Berends and Koretz 1996; Grissmer et al. 1998) . In addition, their measure of school quality was lacking in that they assumed that \"school quality is the effect that attending a given school has on student performance after controlling for the student's observable characteristics\" (Cook and Evans 2000:732) . Their analyses lacked direct measures of schools, how these school measures changed, and how these changes (both in means and in coefficients) were associated with gaps in students' test scores.\nThus, despite this important past research, questions remain about differences in the achievement of black and white students and about which family and school factors are associated with the gaps in achievement over time. With data for four cohorts of high school seniors in 1972, 1982, 1992, and 2004 , our analyses extend knowledge about how changes in families and schools are related to trends in black-white test scores and build on the work of Grissmer et al. (1994 Grissmer et al. ( , 1998 , Hedges and Nowell (1998, 1999) , and Cook and Evans (2000) .\nAlthough decomposing the gaps in blackwhite achievement into changes in families and schools is a complex exercise (Berends et al. 2005; Grissmer et al. 1998) , we believe that our analyses make important contributions. For instance, similarly to Cook and Evans, we used methods that allowed us to examination changes in mean levels of family and school characteristics and changes in the relationships, or coefficients, of these characteristics to students' achievement. However, we did so by using data that have several direct measures of students' family and school characteristics, analyzed consistently over time. In addition, we extended these previous analyses to understand what happened between 1972 and 2004, since research has shown that the gap in blackwhite test scores stopped converging during the 1990s (Neal 2006; Porter 2005) . The analyses that follow present the results on specific family and school factors that are related to trends in students' achievement, particularly the gaps in black-white mathematics scores for students in high schools. No studies have comprehensively analyzed several family and school measures across nationally representative data for different cohorts "}, {"section_title": "DATA AND METHODS", "text": "In our study, we focused on students' mathematics achievement and family and school characteristics that we could consistently measure over time across nationally representative cohorts of high school seniors. We believe it is an important contribution to analyze measures that were operationalized in the same way between 1972 and 2004 (see Appendix A). Moreover, our analysis of these national data covered the same periods as the studies by Grissmer et al. (1994) , Hedges and Nowell (1998, 1999) , and Cook and Evans (2000) and extended beyond them to 2004. Thus, our findings can be directly compared with their research and extend knowledge about the factors that are associated with trends in black-white test scores.\nIn what follows, we analyze four cohorts of high school seniors in nationally representative data sets that cover the experiences of secondary school students in the United States between 1972 States between , 1982 States between , 1992 States between , and 2004 "}, {"section_title": "DEPENDENT VARIABLE", "text": "The dependent variable in our models is individual students' scores on mathematics tests, assumed to be a function of a set of individual, family, and school predictor variables that are directly comparable in the senior cohort data sets. The group differences that are the focus of this article are those between black students and white students during their senior year of high school.\nTo measure the extent of group differences within each cohort of seniors more accurately, we linked the mathematics tests over time and calibrated them to be on the same scale, so it is as though students across cohorts had taken the same test (for details on linking procedures, see Berends et al. 2005) . Because the reading, science, and social studies tests did not have items in common across the cohorts, we were limited to mathematics, and the relationships to other subject areas may differ. 5 However, because of the sensitivity of mathematics tests to school effects and variation in mathematics scores across schools (Sørensen and Morgan 2000) , it is important to understand trends in mathematics achievement and how other family and school changes relate to them, particularly for students from different racial/ethnic groups.\nAlthough the equating, or linking, methods provide accurate measures of students' scores throughout the proficiency distribution, it is important to remain aware that the tests are not identical across the different cohorts. However, the tests are similar in structure and the domains tested and contain some common items to use for equating purposes. Moreover, research to date has suggested that the tests across these cohorts are reliable and valid measures of students' mathematics achievement in secondary school (see Berends et al. 2005; Koretz and Berends 2001; Rock et al. 1985; Rock and Pollack 1995) . In addition, although we did not link the 2004 mathematics test to the mathematics tests in the other cohorts, NCES has a linked score, which we relied on in our analyses (see Ingels et al. 2005 Berends et al. 2005.) We also examined a social-psychological measure of track placement (Gamoran 1989; Lucas 1999, Lucas and Gamoran 2001 ) that deserves further comment. The survey question that was administered across the different cohorts asked students to describe their high school program as being academic or college bound, general, or vocational. We created a new variable that compared students in the college or academic track to those in the nonacademic track. The structure of tracking certainly changed between the early 1970s and the 1990s. Rather than take a program of courses, students in the 1990s were often differentiated into some hierarchy within subject-based ability-group arrangements, such as honors, regular, or remedial (Lucas 1999; Lucas and Gamoran 2001; Oakes, Gamoran, and Page 1992) . Whether such differentiation results in a program of courses is open to question.\nThere are discrepancies between socialpsychological (self-reports) and structural dimensions (course-based indicators from transcripts) of tracking. Lucas and Gamoran (2001) found that there was nearly 70 percent exact agreement between these measures in the early 1980s and 63 percent exact agreement in the early 1990s. The discrepancies that existed suggest that students were more likely to report being in the noncollege track when their transcripts suggested that they are in a college-preparatory program. This \"underreporting\" increased between the early 1980s and early 1990s, a pattern that was consistent across racial/ethnic groups. Thus, the associations between tracking and achievement that we examined may underestimate the relationship of students' structural track placement on students' test scores.\nAlthough there have been changes in tracking over the past several decades, several researchers have argued that students' reports of their track placement provide essential data. For example, Gamoran (1987) suggested that because students have a great deal of choice in course selections in high school, their perceived track placement may be a better predictor of achievement than may school reports. Moreover, a long body of research has shown that self-reported track placement is one of the strongest and longlasting school measures that affects long-term educational attainment (Gamoran and Berends, 1987; Lucas and Gamoran, 2001 ). Thus, we suggest that student-reported track placement taps an important social-psychological dimension of tracking-revealing students' attitudes toward school, perceived opportunities within school, and educational futures. Understanding changes in these perceptions of school opportunity structures over time is important for understanding whether students who have typically been underserved by the educational system, such as black and Latino students, changed their social-psychological perceptions over time and whether these changes are related to trends in the gaps in test scores.\nBecause our models did not allow us to estimate the conditions that are related to selection into certain track categories (e.g., prior achievement, subject-area grades, teachers' recommendations, motivation, and educational aspirations), we need to be careful in our interpretation of this measure. Although we view this track measure as a proxy for a social-psychological measure of tracking, it may also capture other unobserved characteristics (e.g., motivation, attitudes, parents' expectations, prior academic achievement, or other unmeasured school or family qualities to be higher by black students relative to white students over time, this may be an important factor to analyze further if it is associated with the gap in black-white test scores. An additional problem in examining this track variable is that it is difficult to determining the causal direction. For instance, the following analyses assume that track placement is related to students' achievement; that is, following prior studies, academic track placement is hypothesized to result in greater mathematics achievement. However, in our analysis of cohorts over time, it may be that improvements in mathematics scores over time resulted in more students being placed in the academic track. It is impossible to determine the causal direction in our analyses. Yet, we believe that the examination of our track-placement measure is informative and hope that the results will promote further analyses of track placement over time. Thus, because of potential problems in this self-perceived track measure, we present the results with and without its inclusion and, in the Discussion section, point to future areas of research on this issue."}, {"section_title": "METHODOLOGY", "text": "Methods to assess the effects of individual, family, and schools over time need to factor in both the changes in the characteristics of interest (means) and changes in the effects of these characteristics (coefficients) on achievement scores at different points in time. To decompose such effects, we relied on a technique that is widely used in labor economics, called the Oaxaca decomposition (Cain 1986; Corcoran and Duncan 1979; Oaxaca 1970) . Although attributed to Oaxaca, this technique was previously used by sociologists (Cancio, Evans, and Maume 1996; Duncan 1967 Duncan , 1968 Sayer, Bianchi, and Robinson 2004) and has been used primarily to explain differences in wages across groups in crosssectional data (Cain 1986; Corcoran and Duncan 1979 ) and the time-series pattern of wages in repeated cross sections (Sahling and Smith 1983) . There have been recent applications in education as well (Cook and Evans 2000; Gill and Michaels 1992; Goldhaber 1996) . For example, as we previously noted, Cook and Evans (2000) used such methods to investigate how changes in the mean differences and changes in the coefficients of family and school measures were related to the convergence in the gap in black-white test scores; our analyses aim to build on their findings using a similar approach.\nThe first step in decomposing the effects of family background measures on the gap in black-white test scores was to estimate a series of regressions for each cohort of seniors. For these regressions, we first entered the race dummy variable to estimate the unadjusted predicted difference in mathematics test scores between black and white students. We also estimated a series of multilevel regressions of students nested in schools (Raudenbush and Bryk 2002) . 6 These regressions estimated the relationship of mathematics achievement to mother's and father's educational attainment, the higher of mother's or father's occupational status (Duncan's Socioeconomic Index, SEI), the family income quintile dummy variables, academic track, minority and socioeconomic composition of the school, sector, and urban locale. Gender was also included in these regressions as a covariate.\nTo analyze how trends in individual, family, and school measures were related to trends in the gap in black-white mathematics test scores, we used multilevel regression. We first fit a hierarchical linear model to each cohort and estimated regression coefficients (Kreft and De Leeuw 1998; Raudenbush and Bryk 2002; Snijders and Bosker 1999) . Then, we used the pooled coefficients in the decomposition of the difference between the predicted means of white and black test scores (Equation 1) (see Cook and Evans 2000; Cotton 1988 ). The LS data allowed for this analysis over four time intervals. By looking at the results of these decompositions, we can begin to understand how black students' mathematics scores changed relative to those of whites over this 30-year span.\nTo begin, the following equation \nwhere\n) is the change from 1972 to 2004 in the difference between the predicted means of white and black test scores; \n• ( βˆ72 -βˆ72b ) is the unexplained portion of the differentials attributable to variability in the effects (or coefficients) of family and school characteristics between representative students and black or white students, as well as differences in these effects from 1972 to 2004. The decomposition can also be calculated using estimated coefficients from 1972 and 2004 as weights, so we show the results from both estimations. Second, we rely on the coefficient estimates for the student cohort, as opposed to those for white or black students within a cohort. Since black and white students in a given cohort were not schooled in total isolation from one another or indeed from students of other races, they are not distinct populations but, rather, part of the same population. Thus, using the pooled coefficient estimates for each student cohort seems more appropriate, since that pooled coefficient would be the estimate if race/ethnicity were not an issue (Cook and Evans, 2000; Cotton, 1988) . This choice also avoids capriciously choosing either to weight the change in mean differences by the coefficient estimates for black or white students or to estimate a set of coefficients for both and then attempting to mediate between the two sets of results that are generated. (The results from the regression models appear in Appendices C and D.)"}, {"section_title": "RESULTS", "text": "Before the results of this decomposition are examined, it is important to understand the trends in the differences in the black-white test scores in the senior cohorts and compare them to other national achievement trends in the NAEP. Second, we examine the trends in family and school measures. Finally, we decompose the effects of family and school characteristics on the gap in black-white achievement into changes in the levels of the family background measures and their effects on achievement across cohorts. "}, {"section_title": "Trends in Black-White Test Scores", "text": "Black students have made considerable gains in achievement in the past 20 years in narrowing the gap in black-white test scores. The convergence has occurred across tests, but the gap has narrowed more in reading than in mathematics, so the analysis here of mathematics may not be completely consistent for other subject areas. Consistent with other national data, black students have made considerable gains in achievement in narrowing the gap in blackwhite test scores when one examines the senior cohorts of NLS:72, HS&B:82, NELS:92, and ELS:04. The estimates for the black-white convergence in mathematics appear in Figure  3 . The estimates for the three LS senior cohorts are plotted against those in the NAEP trend assessment because the NAEP provides the strongest trend assessment available in the United States and offers an important benchmark for the LS cohorts. In 1972, the black-white difference was over a standard deviation (SD = 1.01) in the NLS:72 data, but by the early 1990s, the gap narrowed by about 20 percent-to 0.81 of an SD unit difference in NELS, and this gap remained stable until 2004 in the ELS:04.\nIn 1973, the black-white difference in NAEP was 1.14 of an SD, narrowing to 0.89 of an SD in 1996 (a 22 percent reduction) and 0.80 of an SD in 2004. The decreased gap occurred in both the NAEP and the LS, but the extent of the decrease was greater in the NAEP than in the LS, although the overall patterns remain consistent. In short, the LS senior cohorts reveal a narrowing of the gap in test scores between blacks and whites, a convergence that is worthy of further examination. In addition to the significant changes in the trends in the test scores of black and white students, important changes have occurred in family background characteristics, such as parents' educational attainment, occupational status, and income (see Table 1 ). 7 Overall, compared to students of the 1970s, high school seniors in the early 1990s were living with parents who were better educated and had higher occupational status. In 1972, parents' educational attainment levels in the LS data were 12.31 years for mothers and 12.54 for fathers. By 2004, both mothers and fathers had over 1 extra year of education: 13.65 years, on average, for mothers and 13.76 for fathers. Similarly, the occupational status of parents increased. In 1972, the Duncan's SEI was 42.00, whereas in 2004, it increased to 56.16, a 14.16 point increase (or an increase of 0.53 of an SD). "}, {"section_title": "Trends in Black-White Family Background", "text": "An examination of black-white differences in family background over time reveals that there have been important improvements in these conditions for black students. For example, black students made considerable progress relative to whites with regard to their parents' educational attainment and occupational status. As the bold-faced figures in Table 1 reveal, the black-white difference in 1972 for the educational attainment levels of students' mothers was almost one year (0.88) of education. Specifically, the average black student's mother had 0.88 of a year less than the average white student's mother, but by 2004 this gap in education narrowed to about a half a year (0.54). "}, {"section_title": "Changes in School Characteristics", "text": "In examining changes in school characteristics in the data sets spanning 1972 to 2004, we found that there were increases in the proportion of students attending schools with a greater proportion of black and Latino students than white students. Table 2 shows the differences in school conditions between 1972 and 2004 for the four cohorts overall and for black and white students. Although overall students in 1972 attended schools in which the proportion of the nonwhite student body was 0.19, in 2004, students attended schools in which the nonwhite proportion was 0.27, on average. Paralleling changes in students' families, schools tended to be somewhat higher in parents' occupational status in 2004 than in 1972. That is, in 1972, students attended schools in which the average socioeconomic status was (-0.05) compared with their 2004 counterparts, who typically attended schools where the average SEI was (0.06).\nIn addition, there were increases between 1972 and 1992 in the proportion of students across the nation who attended urban schools (from 0.28 to 0.36), but in 2004, the proportion of students attending urban schools returned to the 1972 level (0.28). Between 1972 and 2004 , there was an increase in the proportion of students who attended schools with a greater number of black and Latino students than white students. Students in 2004 were also about as likely to attend private schools as students in 1972, at least as is evident in these data sets. "}, {"section_title": "Black-White Differences in School Characteristics", "text": "With regard to the types of schools that black and white students attended between 1972 and 2004, some differences remained over time. In 1972, black students were likely to attend schools for which the average proportion of schools classified as urban was 0.44, compared with white students, who attended schools for which the average proportion was 0.27. There were slight changes in the proportion of black students attending urban schools between 1972 and 2004, and the gap between blacks and whites increased from 0.17 in 1972 to 0.27 in 2004. In relation to the socioeconomic composition of schools, as measured by Duncan's SEI, the black-white difference in the typical schools attended by blacks and whites narrowed between 1972 (-0.18 difference) and 1982 (-0.08); however, the black-white difference in the average socioeconomic composition of schools increased by 1992 (gap of -0.21) and increased further by 2004 (gap of -0.26). Apparently, the closing of the gap in the socioeconomic circumstances of black and white individuals was not reflected in the socioeconomic composition of schools that blacks and whites attended.\nIf a high minority composition is viewed as a proxy for schools that have historically been underserved by the educational system in terms of providing high-quality resources, services, and instruction, then the increasing proportion of high-minority schools suggests the lack of progress for black students. The average proportion of minority composition for schools attended by white students was 0.17, compared with the average of 0.36 for schools attended by black students. Although there were small changes in minority composition for schools attended by whites between 1972 and 2004 (from 0.17 to 0.14), the average minority composition for schools attended by black students increased from 0.36 to 0.60, a .0.24-point change in proportion. When comparing the proportion of black and white students attending private schools, we found that while there was an increase in private school attendance by white students, there was a decrease for black students. For example, in 1972, the proportion of white students attending private schools was 0.07, compared with 0.05 of black students. By 2004, the proportion of white students attending private schools was 0.10, compared with 0.03 of black students. The blackwhite gap in private school attendance was -0.02 in 1972, compared with -0.07 in 2004, suggesting that private school attendance is more prevalent among white students than among black students, and this gap increased over time."}, {"section_title": "Changes in Self-Reported Academic Track Placement", "text": "The school organization characteristics just described are important because they have been related to students' achievement and because any changes over time for one racial/ethnic group vis-à-vis another may suggest growing or declining inequities. Although school characteristics help describe elements of the organization, it is also important to consider schooling characteristics, such as track placement, since they provide indicators of students' perceptions of educational opportunities within the organization (Bidwell and Kasarda 1980; Gamoran 2004 ).\nWhen considering student-reported track placement for the different national cohorts of high school seniors, we found an increase in the proportion of students who reported placement in the academic track. For example, in 1972, the proportion of students who reported academic-track placement was 0.47. This proportion decreased slightly in the early 1980s, when the proportion of students reporting academic-track placement was 0.39. But the proportion again increased to 0.47 in 1992 and to 0.55 in 2004 (see Table 3 )."}, {"section_title": "Black-White Differences in SelfReported Academic-Track Placement", "text": "With regard to black-white differences in student-reported track placement, there was a significant increase in the proportion of black students reporting academic-track placement, suggesting a closing of the black-white gap in tracking. In 1972, the proportion of black students who reported academic-track placement was 0.28, whereas in 2004, the proportion was 0.53, a 0.25-point increase.\nHalf of all white students in 1972 reported academic track placement, and the proportion increased to 0.56 in 2004. Although the black-white difference in reported track placement was -0.22 in 1972, this difference declined to -0.03 in 2004, a significant reduction, which suggests a possible benefit for black students in perceived educational opportunities.\nAlthough there were some changes in family and school characteristics that may contribute to the closing of the achievement gap, what are the relationships among these trends? How do the changes in the family background and school measures relate to the trends in black-white test scores? By "}, {"section_title": "Decomposing Changes in the Gap in Black-White Test Scores", "text": "Family and School Characteristics The methods we used allowed us to disentangle the changes that have occurred for black and white students. We examined the changes between 1972 and 2004 in levels (means) of the individual, family background, and school measures. When these changes were scaled by the 1972 and 2004 regression coefficients, we were able to examine how family and school changes corresponded to the changes that occurred in the gap in test scores between black and white students. In other words, we examined the results, allowing for changes not only in the means of family and school measures, but in their relationships to mathematics achievement (as measured by the 1972 and 2004 coefficients).\nWhen presenting the results, we first focus on changes in family and school measures; we then add the measure for self-reported track. The results of these decompositions for mathematics achievement scores appear in Table 4 . The column of ∆'s in Table 4 is the change in the gap in black-white test scores for the period being considered that is associated with the changes in the means for the variable (rows) being considered. The percentage column is the percentage of the total gap in black-white test scores for the period being considered to which changes in that particular variable correspond; positive percentages indicate that the predicted gaps in test scores would have decreased or converged, while negative percentages indicate that they would have increased or diverged. There are also some rows in Table 4 that are in bold to highlight the aggregate results. For example, the numbers in the row for \"Individual and Family Measures Total\" are based on adding up the cells below for female, family income, parental education, and occupational status measures; that is, these numbers provide the overall changes in the estimated black-white gap that correspond to the individual and family measures taken together. We follow a similar logic in Table 4 for presenting the school measures (school mean SES, percentage minority, private, urban, and rural). Because the decomposition can be calculated using estimated coefficients from 1972 and 2004 as weights, we show the results from both estimations in Table 4 . The last row in Table 4 represents the total change in the gap that is being explained-the estimated black-white gap in mathematics achievement was -0.191, which implies that the gap closed by about one-fifth of an SD.\nBetween 1972 and 2004, relative to white students, black students' individual and family characteristics-parents' educational level, family income, and parents' occupational status-improved. These changes were large, particularly when scaled by the 1972 regression coefficients; these relative changes between the black and white student populations corresponded to 62. "}, {"section_title": "Self-Reported Track Placement", "text": "When we included students' self-reported track placement and compared them to the previous results, a few patterns stood out. First, with regard to the school measures, the corresponding changes in the black-white gap are similar whether or not the track placement measure is included (see Figure 4) . Without the track variable, changes in school-level means corresponded to a 76 percent to 82 percent increase in the black-white gap, depending on whether 1972 or 2004 coefficients were used; with the track measure, there was a 75 percent to 83 percent increase in the black-white gap. Second, for the family measures, inclusion of the track measure did not change the results much when the 2004 coefficients were used, but did change the family background results when the 1972 coefficients were used. When the 2004 coefficients for the family measures were used, the black-white gap was associated with a 36.24 percent reduction in the gap without the track measure and a 35.19 percent reduction with the measure. When the 1972 coefficients were used, the family measures were associated with a 62.37 percent reduction in the gap without the track measure and a 39.41 percent reduction with the measure.\nConsidering the student self-reported track measure in these models, we found that the significant decrease in the gap in the mathematics test scores of white and black students was connected to the change in black students' perceived schooling experiences. As we discussed previously, the gaps in the proportions of blacks and whites who were enrolled in the college track were -0.22 in 1972 and -0.03 in 2004. These differences indicate that although white students tended to report academic-track placement more than did black students, these differences decreased significantly between 1972 and 2004. In Table 4 , when this change was scaled to the 1972 regression coefficients, these changes in reported track placement between black and white students corresponded to an 88.51 percent change in the blackwhite gap in test scores. When the 2004 coefficients were used, these changes were associated with a 36.03 percent change in the blackwhite gap in test scores. The main reason for this difference is the large coefficient for track placement in 1972 compared with 2004 (see Appendix D)."}, {"section_title": "DISCUSSION", "text": "Our analyses examined several family and school factors that are related to black-white differences in test scores in mathematics. We set out to address some limitations of past research by analyzing nationally representative data between 1972 and 2004 to examine how selected family and school measures changed during this period and how these changes corresponded to the black-white gap in mathematics. We end with a discussion of the policy implications that arise from our work."}, {"section_title": "CHANGES IN FAMILIES AND THE MATHEMATICS GAP", "text": "When examining the relationships between family background measures and gaps in test scores among blacks and whites, researchers frequently analyze cross-sectional or panel data for a particular cohort of students to explain the percentage of the gaps with family or other social indicators (see Berends et al. 2005; Brooks-Gunn, Klebanov, and Duncan 1996; Grissmer et al. 1994; Hedges and Nowell 1998, 1999; Jencks and Phillips 1998; Phillips et al. 1998 ). In such analyses, family background explains about 25-30 percent of the cross-sectional black-white gap in scores for a particular cohort (see Hedges and Nowell 1998, 1999) . To disentangle the relationships between family background and gaps in students' achievement further, we looked at the changes across cohorts in the levels of family background and school measures and scaled these relationships to the 1972 and 2004 regression coefficients. For different cohorts of seniors between 1972 and 2004, our analyses revealed that the improved socioeconomic conditions of black students-such as parents' occupational status, educational attainments, and income-corresponded to the significant amount of convergence in black-white test scores. Changes in the family background measures corresponded to roughly a 40 percent decrease in the gap in black-white scores on mathematics tests between 1972 and 2004, taking the average across our models."}, {"section_title": "CHANGES IN SCHOOLS AND THE MATHEMATICS GAP", "text": "Despite some of the positive changes in family circumstances for black students, the changes that occurred between schools corresponded to an increase in the gap in blackwhite mathematics test scores between 1972 and 2004. In our analyses, black students were more likely than white students to attend higher-minority schools in 2004 than in 1972, and these changes corresponded with the widening gap in black-white mathematics achievement over that 30-year period. Several other authors have commented on the increasing segregation of minority students in recent years (see, e.g., Orfield 2001; Orfield and Yun 1999) . The effects of desegregation were most dramatic in changing the racial/ethnic composition of schools during the 1960s and 1970s (Armor 1995; Grissmer et al. 1998 ), so our analyses may have missed the most dramatic positive aspects of these changes. Yet, changes in composition do not immediately result in changes in school activities and culture that are beneficial to black students. As Grissmer et al. (1998) showed, black seniors who were tested in the early 1970s entered school in the early 1960s, a time when 60 percent of the black population was educated in schools in which more than 90 percent of the students were from minority backgrounds. Because of the dramatic desegregation in schools that occurred between 1968 and 1972 (especially in the South), students who entered school in the early 1970s were the first to experience a schooling career from K-12 in less-segregated schooling circumstances. These are the students who would be taking tests as seniors in the mid-1980s. However, as our analyses suggest, changes in the minority composition of high schools did not correspond to a decrease of the gap in black-white achievement in the data that we analyzed. Rather, our analyses revealed that the increases in the minority composition of high schools that black students attended between 1972 and 2004 corresponded to a substantial increase in the gap in test scores.\nCompared with these between-school changes, there were positive changes in the perceived within-school experiences of black students compared with white students over the 30-year period. Increases in the number of black students who reported academic (Dalton et al. 2007; Lucas 1999) . Certainly, further understanding of the changes and trends in the racial diversity of schools, academic tracking, and achievement is warranted (see Bankston and Caldas 2001; Lucas and Berends 2002) . For instance, although research has shown that students, particularly minority students, have been taking more college preparatory classes since the early 1970s (Dalton et al. 2007) , other research has suggested that students are still not prepared for college (ACT, 2006) . Although obtaining nationally representative data over time is challenging, future data collections may benefit from examining not only course-taking patterns, but the content and cognitive complexity of the content that is covered in different classes (e.g., Porter 2002) . Such research would allow researchers to see important trends for changes in both schools (organizations that set the context for learning) and schooling (the processes through which instruction occurs) (see Bidwell and Kasarda 1980) and how these changes are related to trends in test scores between different groups."}, {"section_title": "DROPOUT RATES AND THE TRENDS IN BLACK-WHITE TEST SCORES", "text": "One issue that emerged when we analyzed trends in test scores over time is that factors that our models are not able to consider may have an influence. This type of omitted variables bias is important in any type of multivariate analysis and is worthy of critical reflection. Thus, when one assesses the impact of changes in family background and school characteristics on trends in students' achievement over the past several decades, it is important to consider two important issues: (1) the direction and magnitude of the relationship (coefficient) of each characteristic, (2) the average change (mean) that occurred for that characteristic across different cohorts, and (3) whether the mean changes were greater for black students than for white students. For example, a family variable may have a strong, independent effect on achievement, but if the variable, on average, did not change more between two or more cohorts for black students vis-à-vis white students, then it will not affect the average estimated gap in black-white test scores over time.\nOne such characteristic is changes in dropout rates. An examination of national dropout rates for the United States between the early 1970s and 2004 revealed that there was a decrease for black students relative to white students. The U.S. Department of Education defined \"status dropout\" rates as \"the percentage of individuals who are not enrolled in high school and who do not have a high school credential, irrespective of when they dropped out\" (Laird, DeBell, and Chapman 2006:6) . As Figure 5 shows, dropout rates decreased for the nation as a whole during that period, and the blackwhite dropout rate converged. As a result, it can be argued that because students who are dropouts tend to have lower achievement scores (Berends 1995) , those students who previously would have dropped out are now reflected in mean test scores, particularly differences in the mean test scores between black and white students.\nHowever, in considering the cohorts analyzed in this article, it is important to note differences in the dropout rates for 1972 for , 1982 for . In 1972 , the average gap in the dropout rate between black and white students was 9 percent; in 1982, the gap narrowed to 7 percent; in 1992, 6 percent; and in 2004, 5 percent (see Figure 4) . The largest convergence occurred between 1972 and 1982 (from a 9 percentage point gap to a 7 percentage point gap). With regard to the trends in test scores observed across these LS cohorts, the largest convergence in the gap in test scores occurred between 1972 and 1982 (nearly one-fifth of a standard deviation). On the basis of the argument about dropouts presented earlier, the gap should not have converged as much as it did during that 10-year period. Thus, we argue that while changes in dropout rates may be important, they would likely not have affected the results for the particular cohorts examined in our analyses."}, {"section_title": "Persistent Inequality in the Mathematics Gap", "text": "Our analysis revealed a mixed picture of the progress of black students relative to white students. On the one hand, individual, family, and some school circumstances changed across cohorts, and these changes correspond to the decrease in the black-white gap in mathematics test scores that occurred between 1972 and 2004. Significant disparities in the test scores of blacks and whites remained, particularly in terms of socioeconomic circumstances and achievement scores. Although there was about a 20 percent reduction in the black-white gap in mathematics test scores in the LS databases we examined, the unadjusted differences remained about 0.80 of a standard deviation in mathematics, a large difference. Moreover, despite the large gains in the family background measures considered here, black students continued to attend high-minority and low-SES schools. Thus, while a great deal of progress was made in improving some conditions of black students relative to white students in the period studied here, substantial inequalities remained (see Neal 2006) . Because of the positive changes that we found in black families' socioeconomic circumstances, their correspondence with closing the achievement gaps, and the large gaps that remain, focusing on these issues is a policy exercise worthy of effort and debate. As Wilson (1999:98) stated, \"it could take several generations before adjustments in socioeconomic inequality produce their full benefits\" (see also Jencks and Phillips 1998; Neal 2006) .\nOur analyses suggest that educational policy and research need to be attentive to educational opportunities both within and between schools and to address issues related to secondary school learning opportunities and the increasing isolation of minority students in predominately minority schools. Our analyses further show that there have been significant advances for black students who reported academic-track placement in 2004 compared with the early 1970s. A large portion of the convergence in black-white mathematic test scores corresponded to the increase over time in black students' socialpsychological perceptions of their collegetrack opportunities compared with those of white students. Although we cannot attribute cause to our tracking measure-especially since our measure is a proxy not only for track placement, but for other perceptions of schooling (e.g., motivation and educational expectations)-the correspondence that we found is consistent with those of researchers who have speculated that tracking and the resulting increased opportunities for students of color have played an important part in closing the achievement gap (see Cook and Evans 2000; Grissmer et al. 1998; Porter 2005) . Certainly, this measure needs to be interpreted cautiously. Yet, its independent association with reductions in the black-white gap in test scores suggests that future research should examine more carefully course taking, curricular content, and intellectual rigor to gain a better understanding of within-school learning opportunities."}, {"section_title": "NOTES", "text": "1. Specifically, the NCLB states that the purpose of Title I \"is to ensure that all children have a fair, equal, and significant opportunity to obtain a high-quality education and reach, at a minimum, proficiency on challenging State academic achievement standards and state academic assessments. This purpose can be accomplished by . . . closing the achievement gap between high-and low-performing children, especially the achievement gaps between minority and nonminority students, and between disadvantaged children and their more advantaged peers\" (1001 NCLB 3).\n2. Analyzing the NELS:88 and NLSY:80, Grissmer et al. examined how mathematics and reading scores were associated with family factors, including parents' educational attainment, family income, age of the mother at the child's birth, number of siblings, and mother's labor force participation. In the analyses, any other factors were referred to as \"nonfamily\" factors. 3. These data include the EEO, NLS:72, HS&B, NLSY:80, NELS:88, and NAEP.\n4. In the several databases they analyzed, Hedges and Nowell standardized the test scores, rather than linking them over time.\nThe tests typically covered similar domains of academic content.\n5. Because all the LS data sets attempted to have similar designs over time, the assessments and surveys were administered in the spring semesters across these databases.\n6. We conducted multilevel regressions because students were nested in schools. The intraclass correlations indicated a nonignorable amount of clustering of mathematics scores within schools, which were statistically significant (ranging from .07 to .20, depending on the model). We also estimated the models in this article with ordinary least squares; by and large, we found that we overestimated the associations between mathematics scores and race/ethnicity, family background, and school measures. Thus, not only are multilevel models appropriate, given the design of the data, but the results provide more conservative estimates.\n7. The descriptive statistics and statistical models use the appropriate weights available in the data. "}, {"section_title": "NCES LONGITUDINAL DATABASES AND OPERATIONALIZATION OF FAMILY AND SCHOOL MEASURES LONGITUDINAL STUDIES OF THE NATIONAL CENTER FOR EDUCATION STATISTICS", "text": ""}, {"section_title": "National Longitudinal Study of the High School Class of 1972", "text": "NLS:72 was designed to produce representative data at the national level on a cohort of high school seniors who graduated in 1972. The base-year sample was a stratified, two-stage probability sample of students from all public and private schools in the United States, with schools as the first-stage units and students within schools as the second-stage units. The result is a nationally representative sample of 19,000 seniors in 1,061 high schools (Riccobono et al. 1981) . Student, school administrator, and test score data are available for measuring students' academic achievement and individual, family, and school characteristics. We analyzed data from students' tests, the student questionnaires, and information about the school. The student questionnaires were completed by 16,683 high school seniors. Because we wanted complete data from the student questionnaires, the students' mathematics test, and information from the school information form, the sample for our analyses was 14,469 students in 875 schools."}, {"section_title": "High School and Beyond", "text": "Similar to NLS:72, HS&B is a two-stage stratified probability sample with schools as the firststage units and students within schools as the second-stage units. In the first stage, 1,100 schools were selected, and in the second stage, about 36 students were randomly selected in each school. Some types of schools were oversampled to ensure that adequate numbers of students were available in subpopulations of interest. We analyzed the sample of about 26,000 students who were sophomores in the 1980 base-year sample and were followed up in 1982 when they were seniors. The follow-up sample retained the essential features of the base-year design: multistage, stratified, and clustered (see Jones et al. 1983) .\nHS&B was unique in that it gathered data on two high school grade levels in 1980 (the 10th and 12th grades). Both the sophomore and senior cohorts in HS&B have information on students, schools, and test scores. The sophomore cohort was followed up two years later when the students were seniors (HS&B:82). Although we previously analyzed the 1980 senior cohort (HS&B:80), our descriptive and multivariate analyses of the effects of family and school measures on students' achievement revealed no significant differences between the 1980 and 1982 senior cohorts (see Berends et al. 2005) . For the sake of parsimony and presentation, we thus present the 1972, 1982, 1992 , and 2004 comparisons when we examine how the trends in the mathematics gap related to changes in family and school measures. Because we wanted seniors who completed the mathematics assessment and background questions in schools where administrators completed a questionnaire, the resulting sample was 20,888 students nested within 905 schools."}, {"section_title": "National Education Longitudinal Study", "text": "NELS is a nationally representative data set that includes detailed information from students, Delivered by Ingenta to : University of California, Berkeley Wed, 26 Nov 2008 07:30:47 schools, and parents (Ingels et al. 1993) . The 1988 base-year NELS included about 25,000 8th-grade students in 1,035 schools. Students in NELS were followed up in the 10th grade (1990), 12th grade (1992), two years after high school (1994) , and in 2000. These data contain extensive information about the achievement and school experiences of students prior to high school entry, data on school organization in middle and high school, students' family and demographic characteristics, and students' experiences beyond high school. In each of the first three waves of NELS, students were tested in various subject areas. To measure a broader range of abilities and the extent of cognitive gains between 8th and 12th grades, NELS included various forms of the 10th-and 12th-grade tests to avoid floor and ceiling effects. For example, 10th graders in the first follow-up test administration were given different forms of the test, depending on how they scored in the 8th-grade base year. There were seven forms in mathematics and five forms in reading, all differing in difficulty to provide better estimates of achievement throughout the proficiency distribution (for further details on the psychometric properties of the NELS tests, see Rock and Pollack 1995) . Specific information on test scores allowed us to link scores across all these NELS mathematics forms and the NLS and HSB cohorts. There were no common items to equate the reading scores in the senior NELS sample to the previous cohorts. Test score, background, and school administrator data for students who were followed up as seniors resulted in a sample of 11,661 students in 1,245 high schools."}, {"section_title": "Educational Longitudinal Study", "text": "The ELS data tested achievement and educational perceptions and experiences of 10th-grade students in a national, clustered probability sample of 15,362 in 752 public, Catholic, and other private schools with 10th grades in spring 2002. The base-year data collection of ELS is the first wave of a new longitudinal study of high school students, and students were followed up in 2004 when they were seniors. The base-year study included surveys of parents, teachers, school administrators, library media specialists, and 10th-grade students who were studied in the spring term of the 2001-02 school year. In 2004, during the first follow-up of the study, base-year students who remained in the sample schools were surveyed and assessed again. The sample was freshened in the follow-up with 171 seniors to keep the sample representative of 2004 high school seniors. Base-year nonparticipants (n = 756) were also given a new opportunity to participate in the follow-up.\nThe ELS 2002 sampling design was a two-stage cluster sampling with stratification. The sampling frame of schools, which was obtained from the Common Core of Data (CCD) and the Private School Survey (PSS), was first divided into over 350 strata, and then two or three schools were selected from each stratum with probability proportional to size. Finally, a random sample of students was selected from each of the selected schools' rosters. Some types of schools (e.g., private schools) and students from particular racial/ethnic groups (e.g., Asians) were oversampled. For our analysis, we restricted the sample to the 2004 follow-up assessments, to only those students who were seniors in spring 2004 and were enrolled in any of the base-year schools, and to those who had information on the measures we examined. Some students were known to be seniors but had transferred to other schools, which prevented us from knowing the characteristics of those schools; these students were excluded. After these restrictions, our sample contained a total of 12,267 students in 740 schools."}, {"section_title": "National Assessment of Educational Progress", "text": "When examining trends in test scores, we compared our estimates in the LS data sets to the NAEP trend assessment, which contains information over time on the same set of test-score items for nationally representative samples of students. Although NAEP asks the same questions over time, NAEP data lack critical information about individual, family, and school charDelivered by Ingenta to : University of California, Berkeley Wed, 26 Nov 2008 07:30:47 acteristics to examine family and school-based explanations over time (see Berends and Koretz 1996) . However, NAEP provides a useful benchmark to compare the trends in test scores in NLS:72, HS&B:82, NELS:92, and ELS:04 (Green et al. 1995) ."}, {"section_title": "OPERATIONALIZATION OF MEASURES IN THE ANALYSES", "text": ""}, {"section_title": "Race/Ethnicity", "text": "All the surveys included items for students to report their racial/ethnic group. We included dummy variables to classify students into nonoverlapping categories for African American or black, Latino or Latina, non-Latino-white, and other (mostly Asian and American Indian). In our analyses, we focused on the nonoverlapping student groups as blacks, Latinos, and whites; our overall sample estimates for the senior cohorts included the \"other\" category."}, {"section_title": "Gender", "text": "In the analysis, gender was included as a dummy variable equal to 1 if the student was female."}, {"section_title": "Parents' Education", "text": "Both mother's and father's educational attainment were included as separate variables in the analysis. Each senior cohort survey provided information to create a measure for parents' years of education, coded as 10 years if the parent did not finish high school, 12 years if the parent was a high school graduate, 14 years if the parent attended some college, 16 years if the parent received a four-year college degree, and 18 years if the parent received a graduate or professional degree."}, {"section_title": "Parents' Occupational Status", "text": "We included a measure of parent's SEI or occupational status, based on the maximum status reported for the father or mother (range in the data sets 7.33-70.21). In the surveys, the respondents could select from a list of comparable occupations, which were then translated into Duncan's SEI (Duncan 1961) scores. NLS:72 through ELS:04 include a measure of Duncan's SEI, and this particular SEI measure is based on the 1960 census. Thus, the estimates of change use this earlier time frame for the SEI as a reference point."}, {"section_title": "Family Income", "text": "The income variable represents a particularly challenging problem because each survey used different intervals for students to select. Initially, we aimed to rescale all the income variables to 1972 using the annual average Consumer Price Index value for each year. However, many categories in the upper tail of the income distribution for NELS:92 were not found in the other cohorts. As an alternative, we parsed each cohort's income values into five categories (five quintiles) by assigning the income category midpoints to the responses and then found the corresponding quintiles from the population as reported by the Census Bureau. We created dummy variables for each quintile; the median income category in each cohort was the reference group. Because of missing data for the family background measures, we first replaced missing values for mothers' and fathers' education, parents' occupational status, and family income using the cohort-level mean computed from students with nonmissing values. Our initial estimation of multilevel models, which included dummy variables indicating that imputation had been performed, showed large t-values for the slope estimates of these variables. These t-values indicated to us that the imputation process was inadequate. We next tried replacing the missing values with the means based on other students within the same school and cohort and found that the t-values were still large. We then tried a multiple imputation routine and found similar results (see Little and Rubin, 2002) . As the final step, we replaced missing values with the mean from students within the same school and cohort and adjusted the imputation values based on the resulting slope coefficients on the imputation flags (if the flag had a negative slope, we reduced the imputed value to try to offset it). We then repeated the process and further adjusted the imputation values until successive iterations had no impact. We found that we needed to put bounds on the imputed values on the basis of the maxim and minimum values of possible responses in the original survey (e.g., an imputed value for mother's education could not be less than 10). Without the bounds, we could drive the slope coefficients closer to zero but only at the expense of nonsensical imputation values (e.g., a negative value for socioeconomic status [SEI] ). However, with the bounds, we found that the imputation values that minimized the t-values on the imputation flags were those at the minimum response level.\nFor example, nearly all imputed values for mother's education ended up being 10, the minimum. This finding suggests that students whose parents are in the lower-income quintile have lower values of educational attainment, and those who have low-Duncan SEI are less likely to respond to the background questionnaire."}, {"section_title": "School Socioeconomic Composition", "text": "The student-level measures for parents' income and mother's educational level were aggregated to the school level. Thus, we were able to calculate the percentage of students within each school in the income quintiles as well as the average parental education level in the school."}, {"section_title": "School Minority Composition", "text": "School administrators in NLS:72, HS&B:82, and NELS:92 were asked about the percentage of various population groups who attended the school. On the basis of this information, we were able to create two school-level variables that measured the percentages of black and Latino students who attended each school. In ELS:04, the percentage minority was based on the combined student-level aggregate of black and Latino group reporting."}, {"section_title": "School Sector", "text": "Schools were classified into public or private schools. The categories were not directly comparable across NLS:72, HS&B:82, NELS:92, and ELS:04 because NELS and ELS differentiated the private sector into additional categories. However, all the databases included a composite measure from which we were able to create a simple dummy variable for private schools (with public schools as the reference group)."}, {"section_title": "School Urban Locale", "text": "Schools were located in urban, rural, or suburban locales. Locale is a 7-digit code on the CCD, defined as (1) large city: a central city of a CMSA or MSA, with the city having a population greater than or equal to 250,000; (2) midsize city: a central city of a CMSA or MSA, with the city having a population less than 250,000; (3) urban fringe of a large city: any incorporated place, census-designated place, or nonplace territory within a CMSA or MSA of a large city and defined as urban by the Census Bureau; (4) urban fringe of a midsize city: any incorporated place, census-designated place, or nonplace territory within a CMSA or MSA of a midsize city and defined as urban by the Census Bureau; (5) designated place with a population greater than or equal to 25,000 and located outside a CMSA or MSA; (6) small town: an incorporated place or census-designated place with a population less than 25,000 and greater than or equal to 2,500 and located outside a CMSA or MSA; and (7) rural: any incorporated place, census-designated place, or nonplace territory designated as rural by the Census Bureau. The usual practice is to combine these codes into three categories: urban = 1, 2; suburban/large town = 3, 4, 5; and rural/small town = 6, 7. We created dummy variables for each, with rural as the reference category."}, {"section_title": "High School Track Placement", "text": "The data set included a question for measuring the students' perceptions of their secondary school track positions: academic, general, or vocational. Although these measures can be viewed only as general markers of students' positions within the educational stratification system (Gamoran 1989; Gamoran and Berends, 1987; Lucas 1999) , the academic group includes students who typically take courses for college-bound students (either an officially mandated program of courses or a more unofficial sequence within the curriculum). General-track students refer to those who neither take courses that are oriented specifically toward college admission and acceptance nor courses that are focused on a specific vocation (such as vocational-track students). Dummy variables were created for track, with academic track coded as 1 and nonacademic track coded as 0 for the reference group (see Gamoran 1987) . "}, {"section_title": "APPENDIX B", "text": ""}]