[{"section_title": "Introduction", "text": "This document describes the geographic information system (GIS) procedures and analyses used to calculate contributing watershed areas and landscape scale metrics for 1,132 benthic macroinvertebrate sampling locations in the Puget Sound basin. The resulting data are a critical part of the Environmental Protection Agency (EPA)-funded project entitled \"Enhancement and Standardization of Benthic Macroinvertebrate Monitoring and Analysis Tools for the Puget Sound Region.\" The land use/land cover data are being used to measure human disturbance, test and refine taxa attributes used to calculate individual metrics for the Benthic Index of Biotic Integrity (B-IBI) (Fore et al. 2012), and recalibrate the B-IBI. A GIS shape file of the contributing watershed basins and an Excel flat file of the land use/land cover calculations are available for download from the Puget Sound Stream Benthos data management system (PSSB 1 ) as separate electronic attachments for use by interested Puget Sound region partner agencies."}, {"section_title": "Methods", "text": "The watershed boundary calculations and landscape sampling methods required multiple steps, including data acquisition and GIS calculations. A summary of these methods are presented here. For additional details regarding the specific methods please refer to the two technical memos prepared by Leinenbach (2011a, b). All GIS analyses and calculations were completed using ArcGIS desktop software obtained from ESRI."}, {"section_title": "Watershed boundary calculations", "text": "Watershed boundaries were calculated by (1) downloading and preparing data, (2) snapping sampling locations to the stream layer, (3) calculating watershed area, (4) checking results, and (5) recalculating the analysis where problems are identified in step 4. Steps 2 and 3 were automated which saved time compared to alternative manual approaches. Each step is described in more detail below.\n1,011 watershed boundaries were initially calculated using the methodology described above for benthic macroinvertebrate sites within the Puget Sound region. The following errors were identified from these watersheds:  10 points did not snap to a stream  75 points snapped to the wrong stream  2 duplicates Duplicate sites were removed, the watershed boundaries were re-calculated, and a second analysis run was conducted and some additional sites were included resulting in 1,132 watershed boundaries (Figure 4). "}, {"section_title": "Data download and preparation.", "text": "a. Latitude and longitude coordinates for each sampling location were downloaded in decimal degrees from the PSSB 2 and converted to a GIS shapefile with a geographic projection. b. The following datasets were downloaded from the National Hydrography Dataset (NHD) 3 using NHDPlus Version 1 4 : i. 1:100,000 NHD (2006) ii. 30 meter National Elevation Dataset (NED) 2004iii. Flow direction and flow accumulation grids iv. Catchment boundaries c. Preparation of NHD data files included building attribute and spatial information for shape files, building pyramids for grids to increase processing efficiency 5 , and preprocessing the NHDPlus data 6 . 2. Snap sampling locations to the stream layer. The points in the sampling location shapefile were moved or \"snapped\" to the nearest location on the NHD digital elevation model (DEM) derived stream layer. A search radius of 0.001 degrees (~ 0.07 miles) worked for most sites; however a search radius of 0.005 degrees (~ 0.35 miles) was necessary for some sampling locations. This step was necessary in order to calculate an accurate watershed area from the NHDPlus datasets. 3. Calculate watershed area. Watershed areas were calculated using the \"Batch Watershed Delineation\" tool in the ArcHydro extension. 2 www.pugetsoundstreambenthos.org 3 www.horizon-systems.com/NHDPlus/NHDPlusV1_17.php 4 NHDPlusV1 was replaced by NHDPlusV2 in June 2012. Most of our analysis was completed by June 2011, therefore NHDPlusV1 was used. 5 Tutorial One on the NHDPlusV1 web page describes in detail how to set up spatial information for shape files and grids: ftp://ftp.horizon-systems.com/NHDPlus/NHDPlusV1/exercises/NHDPlus-Exercise1-SettingUpTheData.pdf 6 Tutorial Seven on the NHDPlusV1 web page describes in detail how to preprocess the NHD data: ftp://ftp.horizon-systems.com/NHDPlus/NHDPlusV1/exercises/NHDPlus-Exercise7-WatershedDelineation.pdf. There is one glitch in the directions: do not save the mxd before adding data into the project (in the section called \"Using the preprocessed data for watershed delineation\"). It will work if data is first added and then the file is saved. 4. Check results. There are three possible errors associated with using the automated methodology to estimate the pour point location: a. Snapping to the incorrect stream. This happens when several streams are close to the sampling point. The automated method snaps the point to the closest stream; however, this might not be the desired target stream. Determining this error requires visual inspection of each point and knowledge of the precise sampling location. Despite significant data review, errors of this type may persist in the dataset. b. Not snapping to any stream line. This can happen when (1) a sampling location is farther away from any stream than the established sampling radius, (2) there are few or no GIS stream layers in very flat areas, or (3) the GIS location of the point is incorrect. With this type of error the watershed boundary is very small and strangely shaped, making it easy to identify. c. Snapping to a stream line, but the line doesn't overlay the grid data. This type of error is also easy to identify because it results in a very small watershed area. 5. Recalculate problem watersheds, if necessary. a. Inspect watershed area to identify watersheds which have been incorrectly derived (see errors 4b and 4c, Figure 1). b. Visually inspect all points to identify watersheds where the pour point may have snapped to the incorrect stream. Topographic maps, aerial photos, and NHD streams layer may be useful in this situation. c. Create a new shapefile of the \"problem\" watersheds and correct the pour point location using automated methods for the small watershed errors or manually for the watersheds that snapped to the incorrect stream. d. Repeat step 3 (recalculate watershed area). Figure 1. Attribute table for the watershed shapefile sorted by area in square meters. A \"Shape_Area\" of 900 represents just one 30 meter pixel. The large break in size between 13,500 and 1,756,799 helps identify the cutoff between \"problem\" watersheds."}, {"section_title": "Landscape Sampling", "text": "Landscape sampling was conducted on the calculated watersheds at four spatial scales for all Puget Sound benthic macroinvertebrate sampling locations: (1) within the upstream contributing watershed, (2) within a 1km radius of the contributing watershed, (3) within a 90-m buffer in the contributing watershed, and (4) within a 90-m buffer in the 1-km contributing watershed ( Figure 2)."}, {"section_title": "Figure 2.", "text": "Land use/land cover were evaluated at four spatial scales for each benthic macroinvertebrate sampling location (yellow dot): (1) entire upstream contributing watershed (black line), (2) 90-m buffer within the contributing watershed (red outline), (3) 1-km contributing watershed (purple circle), and (4) 90-m buffer within the 1-km contributing watershed. Landscape sampling was conducted for these spatial scales using the USEPA GIS Analytical Tools interface for Landscape Assessments (ATtiLA) tool 7 . The following datasets were downloaded and used in the landscape sampling: 1. The 2006 National Land Cover Dataset (NLCD 8 ). a. The NLCD is a 16-class land cover classification scheme that has been applied consistently across the conterminous United States at a spatial resolution of 30 meters (Fry et al. 2011, Figure 3). b. The NLCD dataset was modified using the Change Detection dataset to ensure that current and historic forest harvest areas were classified correctly instead of as grassland or shrub. Figure 3. The NLCD is a 16-class land cover classification scheme that has been applied consistently across the conterminous United States at a spatial resolution of 30 meters. 2. Datasets obtained from the USEPA region 10 server: a. A roads data set from NAVTEQ roads data set. b. 2000 United States census data. Population values were apportioned by area-weighting. For example, if 50% of a census unit was within the reporting unit, 50% of the population was assigned to that reporting unit. 3. Precipitation from the Parameter-elevation Regressions on Independent Slopes Model (PRISM) project 9 4. Data previously downloaded from NHDPlus that were also used in the watershed calculations: a. The streams layer b. NHDPlus FAC grid 10 c. NHDPlus digital elevation model (DEM) 9 PRISM project: www.prism.oregonstate.edu 10 NHDPlus FAC grid is preprocessed with flow routes, which ensures more accurate representation of stream locations in flat areas than a 10-m Digital Elevation Models (DEM). 5. Surficial geology a. Geology data 11 originated with the Washington Division of Geology and Earth Resources which portrays Washington State Geology at a scale of 1:100,000. b. Major geologic units for Puget Sound were characterized into high or low permeability for Puget Sound following the approach employed by the Washington Department of Ecology (Stanley et al. 2005). In the Pacific Northwest, alluvium in lowland areas and glacial outwash are typically composed of coarse-grained sediment and support high levels of permeability. 6. Coastal Change Analysis Program (C-CAP 12 ) regional land cover a. C-CAP is a nationally standardized database of 25 land cover classifications and land change information for U.S. coastal regions at a 30-m spatial resolution. b. Data were downloaded for 1992, 1996, 2001, and 2006. Table 1 summarizes the landscape metrics calculated divided into human disturbance, physical characteristics, and land cover results.  -CAP (1992-CAP ( , 1996-CAP ( , 2001-CAP ( , 2006 % Bare, % Snow/Ice, % Tundra, %Water % Ag (Cultivated, Pasture/Hay ) % Forest (Deciduous, Evergreen, Mixed) % Urban (Developed open space, high-, medium-, and lowintensity) % Wetland (Estuarine or Palustrine: Aquatic Bed, Emergent, Forested, Scrub/Shrub) % Scrub/Shrub % Grassland"}, {"section_title": "Results", "text": ""}, {"section_title": "Landscape characterization", "text": "2006 NLCD land cover varied considerably between delineated watersheds. Percent forest for the contributing watershed and the 90-m watershed buffer ranged from 0 to 100, while percent watershed urbanization ranged from 0 to 98 (Table 2). Sampling site elevation ranged from 0 to over 1,000 m. Appendix 1 presents the summary statistics for the calculated landscape metrics. Density stream (km/km 2 ) (ws) 2.0 2.0 0.0 7 0.4 The histogram for watershed urbanization presented below demonstrates the distribution of sites across an urbanization gradient ( Figure 5); sites with between 0 and 10 percent urbanization are the most common. When land cover is averaged across all watersheds, percent forest is the dominant land cover ( Figure 6). Compared to the 1-km contributing watershed (50.7%), the entire watershed scale generally has higher percentages of forest (56.3%). The 90-m buffer land cover is very consistent with the land cover for the comparative watershed or 1-km watershed scale. Most Puget Sound monitoring locations are at elevations less than 500 m in elevation (Figure 7). The land use/land cover for both the entire Puget Sound basin and the Puget Sound basin from sea level to 500 m were calculated. Puget Sound less than 500 m has slightly less forest (58 vs. 67%) and wetland (3 vs. 6%) and slightly more urbanization (14 vs. 8%) and agriculture (16 vs. 9%) as compared to the entire Puget Sound basin ( Figure  8).    Figure 6), the Puget Sound basin from sea level to 500 m in elevation (center) and the entire Puget Sound basin (right). Appendices 2 through 5 present the summary statistics for physical characteristics, human disturbance, surficial geology, and C-CAP 2001 to 2006 landcover change."}, {"section_title": "Conclusions", "text": "The automated GIS methods saved a significant amount of time compared to previously tested manual methods. For example, completion of the watershed delineation calculations took approximately two days to complete. Manual analysis of these data would have likely taken weeks to complete. The automated methods correctly delineated over 95% of the watersheds in the first round and additional adjustments were made to increase the final watershed delineation accuracy. The XY points used for the watershed creation were the most accurate points possible to estimate watersheds based on the GIS datasets. However, it was beyond the scope of this project to verify every sampling location with project managers at every agency that contributes data to the PSSB. The landscape metrics presented in this memo and calculated for over 1,000 Puget Sound watersheds will be used to (1) develop a human disturbance gradient, (2) test invertebrate sensitivity to disturbance (i.e., developing tolerant and intolerant taxa lists), (3) update and rescore each of the ten B-IBI metrics, and (4) test whether any scoring alterations are warranted for some of the physical characteristics (e.g., elevation or slope). The landscape metric calculations and watershed delineations are available as an Excel file and a GIS shape file, respectively, to be shared with regional partners (download from the PSSB 13 ). 13 Data are available for download: http://www.pugetsoundstreambenthos.org/Projects/Improving-Biological-Monitoring-Tools-Documentation.aspx. "}]