[{"section_title": "INTRODUCTION", "text": "Sea level rise (SLR) is a major threat to coastal communities and ecosystems. Increasing sea level can accelerate shoreline erosion, permanently inundate land, accelerate saltwater intrusion, strengthen episodic storm surges, and produce a host of other climate change-related environmental hazards. The potential impacts of SLR are especially important to consider because coastal regions are among the most densely populated, economically productive, and fastest growing regions in the world (Cohen et al., 1997;Costanza et al., 1997). In response to these growing concerns, coastal communities and managers want to know more about their existing vulnerabilities, how these threats will change, and what actions are needed to adapt and reduce the potential for harm. Here adaptation refers to individual or collective changes by socioeconomic systems (Smit et al., 1999). However, there are many barriers that impede adaptation to climate change, including lack of data, information, and resources; inflexible institutions; perceptions of risk; lack of funding and leadership; scale mismatches; and uncertainty (Cash et al., 2006;GAO, 2009;McNie, 2007;Moser, 2009;NRC, 2005;O'Connor et al., 2005;Tribbia and Moser, 2008). Effective mitigation and adaptation strategies are enhanced when stakeholders are involved in vulnerability assessments directly and when stakeholders have access to information on local baseline conditions and accurate projections of change (Klein, Nicholls, and Mimura, 1999). Local and regional case studies play a vital role in providing this information to decision makers, communicating potential risk, and guiding policy formation, because the impacts of SLR vary significantly from place to place. However, these studies may contain several sources of error and uncertainty that are difficult for nonexperts to assess. Here uncertainty refers to vagueness or a lack of sureness, while error refers to a specified measure of accuracy. It is critical to identify and minimize these sources of error and uncertainty, because the assessment and communication of SLR is linked to societal response (Moser, 2005). It is difficult to predict the vulnerability of coastal communities to SLR given the uncertainties in evaluating the historical changes, modeling future climatic change, and estimating site-specific impacts. This makes decision making particularly challenging. This paper seeks to support greater transparency in the evaluation of SLR assessments by discussing the major sources of error and uncertainty in SLR assessments, including measuring and monitoring the rate and magnitude of relative SLR, predicting the rate and magnitude of future change, and acquiring appropriate data and methodologies for quantifying impacts. Such information has been identified as an urgent research priority, because uncertainty may compromise evaluations and complicate interpretations DOI: 10.2112./JCOASTRES-D-10-00011.1 received 20 January 2010; accepted in revision 18 August 2010. ' Coastal Education & Research Foundation 2012 (Moser, 2005;NRC, 2005;Tribbia and Moser, 2008). A model is developed to illustrate the various sources of compounding uncertainty within SLR assessments. Compounding is defined in this study as several components that combine to form a whole. Case studies along the Carolina coastline are then reviewed to illustrate how uncertainty is compounded within SLR assessments and to identify what we know and what we still need to know about SLR in the Carolinas. The North and South Carolina coastline suits this analysis, since the mid-Atlantic and south-Atlantic regions are among the most vulnerable areas to SLR in the United States as a result of their extensive low-lying surface topography, high economic value, and high storm frequency (Daniels et al., 1992;Gornitz et al., 1994;Neumann et al., 2000;NRC, 1987)."}, {"section_title": "UNCERTAINTY IN SEA LEVEL RISE ASSESSMENTS", "text": "Changes in sea level are widely considered one of the most certain consequences of climatic change (Bindoff et al., 2007). In response to this growing concern, numerous stakeholders have advocated developing a more comprehensive monitoring network to observe changes in sea level (CSO, 2007;UHI, 2004). Other studies have modeled how increasing concentrations of carbon dioxide lead to higher temperatures and an increase in sea level (e.g., Meehl et al., 2005;Teng, Buja, and Meehl, 2006;Wigley, 2005). These SLR projections are used frequently to estimate potential inundation and other environmental impacts (e.g., Architecture 2030, 2010; Nicholls and Tol, 2006). However, the range of components within SLR assessments-from monitoring sea level changes, to predicting the rate and magnitude of sea level change, to estimating potential impacts and incorporating human and biological adaptation-contain various sources and types of compounding error and uncertainty. These sources of error and uncertainty arise from the basic reliability of instrumentation and techniques to more complex methodological and epistemological levels (Funtowicz and Ravetz, 1993). These uncertainties also include both stochastic (e.g., vertical correction factors for sea level measurements to account for the movement of land) and probabilistic contingencies (e.g., accuracy of elevation models). Some sources of uncertainty, such as predicting shoreline change, may contain elements of both stochastic and probabilistic uncertainties. These categories of uncertainty are summarized in Table 1, along with general examples, specific examples from a case study of the Carolinas, and research recommendations. Table 1 also provides an overview of this paper, which is organized to address the columns from left to right. Figure 1 illustrates the compounding uncertainties in SLR assessments. This figure shares characteristics with other climate change uncertainty models, such as the inverted carbon dioxide pyramid of Schneider (1983) and the collapse of confidence model of Henderson-Sellers (1993). Figure 1 and Schneider's inverted pyramid both portray how uncertainty is magnified in each step of the assessment process. In addition, both models incorporate uncertainties involved in predicting concentrations of carbon dioxide, estimating impacts, and incorporating policy responses and adaptation. Each of these models suggests that uncertainties within climate change assessments compromise any attempt to predict changes reliably. Further, none of these models have a scale, accurately reflecting the inability of current models to quantify these compounding uncertainties. However, these models differ in that this study focuses explicitly on uncertainties in SLR assessments, while Schneider (1983) focuses on carbon dioxide and Henderson-Sellers (1993) focuses on climate change models more generally. Therefore, although some uncertainties addressed in each of the models do overlap, each model addresses specific uncertainties that are unique to their issue. The following section reviews the major sources and types of uncertainty that arise in different stages within SLR assessments and discusses the compounding nature of these uncertainties."}, {"section_title": "Measuring and Monitoring Sea Level", "text": "Analyzing measurements from tidal gauge stations is one of the most commonly used techniques to quantify long-term changes in relative sea level at an individual portion of a coastline (e.g., Emery, 1980;Emery and Aubrey, 1991). Many gauges have operated continuously since the mid-1800s, thereby providing a means to quantify localized changes in relative SLR. There are four sources of uncertainty when using tide measurements to monitor changes in sea level: geographical biases in the distribution of tide stations, determining correction factors for vertical movements in the land, nonuniform data quality, and short-term sea level variability (Woodworth, 2006). Lack of historical tidal gauge measurements is one of the most fundamental sources of uncertainty in reconstructing relative sea level changes. Most long-term tide gauge measurements are located along coastal regions of the Northern Hemisphere, and therefore it is difficult to monitor historic sea level changes in the southern hemisphere and to compare these measurements to other regions of the world (Church and White, 2006;Groger and Plag, 1993). Second, there is no universally accepted method to correct for land subsidence or vertical uplift. Tidal gauge measurements are generally tied to a benchmark or datum, which is located on land close to the individual station, and any vertical land movements will lead to inaccurate sea level measurements (UNESCO, 2002). Third, data quality reported to the Permanent Service for Mean Sea Level varies among tide stations around the world (Woodworth and Player, 2003). Finally, water level measurements may be affected by oceanographic and meteorological phenomena, which produce synoptic and seasonal water level variability that are larger than present rates of SLR (Parker, 1992). Average conditions over a month or year are often used to average out short period variability. Recent advances have overcome some of the shortcomings of using tidal gauge measurements to monitor recent changes in sea level. For example, the TOPEX/Poseidon and Jason satellites have provided more complete coverage of sea level changes beginning in 1992 and 2001, respectively. These measurements are generally not affected by vertical land movements, have a 10-day remeasurement cycle, and have indicated significant regional trends in SLR (Bindoff et al., 2007;Wunswch, Ponte, and Meimbach, 2007). However, altimetry data are still constrained by lack of measurements beyond 60 degrees latitude. Further, measurements have a 2-3-cm range of accuracy, and there is an orbital drift of 0.0 6 0.4 mm/y (Leuliette, Nerem, and Mitchum, 2004). Note that the uncertainty associated with the measurement and monitoring of sea level is located at the center of Figure 1. This is the first stage where uncertainty is introduced into the SLR assessment process."}, {"section_title": "Determining Trends in Sea Level Change", "text": "Beyond the challenges of measuring and monitoring sea level, developing sea level curves introduces additional uncertainties and further compounds existing uncertainties. Changes in sea level are characterized by notable interannual, interdecadal, and centennial variabilities that are both nonlinear and spatially nonuniform (Gregory, Lowe, and Tett, 2006;Jevrejeva et al., 2006;Lambeck and Chappell, 2001). Least squares linear regressions are commonly used to compute trends in annual mean sea level change; however, there is no universal method to evaluate trends in tidal gauge data, and estimates of relative SLR may vary on the order of 50% depending on different methodologies applied (Barnett, 1984;Zervas, 2001). It is therefore important to evaluate tidal gauge records over the same time frame and over the longest time possible when comparing multiple stations. Many tide gauge records exhibit nonlinear trends in SLR, reflecting their sensitivity to the beginning and end dates of analysis (Jevrejeva et al., 2006). Records exceeding 50 years are affected less by interdecadal variability and appear to be more appropriate for determining longer term trends in sea level (Douglas, 1992). Note how the magnitude of uncertainty grows within the second ring of Figure 1 as new sources of uncertainty are introduced and as existing uncertainties are compounded."}, {"section_title": "Predicting Sea Level Change", "text": "Sea level has fluctuated drastically over the last 500 million years, reaching as high as 600 m above its present level (Hallam, 1984). However, nonlinear changes in sea level make  (Lambeck and Chappell, 2001;Waelbroeck et al., 2002). During the 20th century, the global rate of SLR averaged approximately 1.7 mm/y (Church and White, 2006). Some regions are experiencing rates of relative SLR that are much faster than the global average given high rates of local land subsidence and erosion, while sea level is declining in other regions as a result of postglacial rebound, wetland accretion, and sedimentation. Sea level changes can also be influenced by ocean siphoning, continental levering, volcanic movements, and geodial changes (Bird, 2008;Mitrovica and Milne, 2002). Although the Intergovernmental Panel on Climate Change (IPCC) Fourth Assessment Report (AR4) estimates with high confidence (80% chance) that the rate of SLR increased in the last two centuries, it remains uncertain whether this rate results from short-term climate variability or acceleration in the long-term rate of SLR (Bindoff et al., 2007). The step from assessing recent sea level change to predicting relative sea level change further compounds uncertainty, since this requires extrapolating trends from existing data. This step leads to the third ring of the model. Rahmstorf (2007) projected that sea level would rise between 55 and 125 cm by 2100 based on a semiempirical relationship between changes in global temperature and sea level since the Pliocene and temperature changes projected by the IPCC Third Assessment Report. These results are higher than the magnitude of predicted SLR by the IPCC AR4, which range from 18 to 59 cm by 2090-2099; Bindoff et al. (2007) acknowledged that the IPCC estimates did not include future changes in ice flow that are likely to increase the rate of SLR. Although thermal expansion of the ocean and ice mass change are considered to be the largest contributing factors to changes in sea level, the SLR budget is not completely understood. The observed rate of SLR during the second half of the 20th century (1.8 6 0.5 mm/y) is greater than the sum the individual components (1.1 6 0.5 mm/y) (Bindoff et al., 2007). This phenomena, described by Monk (2002) as the ''enigma of twentieth century sea level rise,'' suggests that there are other factors and interactions not being accounted for, that individual components are represented inaccurately, or both. For a detailed discussion of other factors affecting SLR, see Antonov, Levitus, and Boyer, (2005), Chao, Wu, and Li, (2008), Church, White, and Arblaster, (2005), and Woolf, Shaw, and Tsimplis, (2003). Understanding the response of ice sheets, ice caps, and glaciers is critical to predicting SLR because the total mass of all water locked up in frozen ice is equivalent to approximately 70 m of SLR (Abdalati, 2006). Sudden collapse of the West Antarctic Ice Sheet alone may lead to a 5-m abrupt rise in sea level (Lythe, Vaughan, and The BEDMAP Consortium, 2001). Estimating the mass balance of Antarctica and Greenland is extremely difficult given the limited knowledge of the physical processes operating in polar climates, long lags between perturbation and effect, and limited data (Alley et al., 2005;Cazenave, 2006;Kaser et al., 2006;Remy and Frezzotti, 2006;Vaughan and Arthern, 2007). Large discrepancies in the contributions of ice sheets, ice caps, and glaciers to SLR result from differences in study years, differences in data and methods used, and differences in assumptions regarding accumulation, ablation, firn compaction, and ice dynamics (Abdalati, 2006). Acquiring necessary data and developing methods to reconcile different data sources, reducing measurement and analysis error, identifying the stress boundary conditions between the ice sheet base and the seaward margin, and incorporating these understandings into predictive models are major challenges in predicting the how ice sheets will contribute to sea level (Alley et al., 2005;Cazenave, 2006;Kaser et al., 2006;Shepherd and Wingham, 2007;Vaughan and Arthern, 2007)."}, {"section_title": "Predicting Shoreline Change", "text": "Shoreline change is influenced by many factors, including the local physiography, wave climates, sediment budgets, tectonics, isostasy, and human development (e.g., sea walls, bulkheads, or revetments) along the coastline. It is therefore important to consider both human and natural systems, operating at multiple scales, in the analysis of shoreline changes (Liu et al., 2007). However, there are considerable uncertainties in understanding how shorelines will respond to future climate scenarios, physical processes, and human adaptation (Cooper and Pilkey, 2005). Although the local geologic conditions are well understood in many regions, changes in wave climates and human adaptation are less certain. These uncertainties lead to the fourth ring in Figure 1. Wave height, wave angle, and water volume may all change with climatic change and SLR, and these interactions are not entirely understood. Numerical models indicate that shifts in wave direction and energy, associated with various climate change scenarios, will lead to distinct shoreline changes (Ashton and Murray, 2006a;Ashton and Murray, 2006b; Figure 1. Compounding uncertainties in SLR assessments. Ashton, Murray, and Arnoult, 2001). These findings suggest that uniform shoreline response models (see Bruun, 1962) may not be appropriate for estimating future shorelines. Modeling how shorelines will respond to sea level change is further complicated by an inadequate understanding of a range of social science factors. From a social and economic standpoint, it is difficult to predict and model how individuals and communities will adapt to future conditions, gauge the role that infrastructure and land use may play in affecting shoreline response, and incorporate the influence of other nonclimate factors (Daniels et al., 1992;Neumann et al., 2000;Yohe and Neumann, 1997). These difficulties arise from the uncertainties in identifying and predicting changes in societal preferences, coastal populations, perceptions of risk, political will, institutional constraints (budgets, staff, resources), coastal policies and legal issues, priority setting, and individual and community resilience (Moser, 2005). Individual and societal preferences are critical to understanding social responses. Although progress has been made in understanding perceptions and potential societal responses to SLR Tribbia, 2006/2007;Tol et al., 2006;Tribbia and Moser, 2008), there is notable uncertainty in understanding the level of risk a society is willing to accept. The uncertainty around the acceptability of risks may be one of the more difficult to reduce, since it can change quite rapidly in response to events near and far. The vulnerability of communities is also difficult to assess given the challenges in predicting how planning and zoning regulations will change. Coastal management policies, which often specify what structural and mitigation options are available, may include sea walls, levees or dikes, beach renourishment projects, and planned retreat. Other options include the possibility of using soft engineering approaches to promote sedimentation and reduce wave energy by planting a diversity of flood tolerant species that respond to changes in elevation (Morris, 2007). Further, the development of upstream dams or river diversions can influence downstream sediment budgets. The implementation of any of these approaches will contribute to unique shoreline changes."}, {"section_title": "Modeling Coastal Elevations", "text": "Digital elevation models (DEMs) are frequently used as the basis for estimating the location of future shorelines and areas of inundation. All DEMs contain sources of error, which arise from the deterioration of the data in the collection process, inaccurate interpretations of the terrain surface due to the effects of trees and buildings, and other random errors associated with inaccurate measuring precision (Fisher and Tate, 2006;Hodgson et al., 2003;USGS, 1986). The uncertainty associated with DEMs represents the fifth ring of the model. County level impact assessments typically have used 7.5minute DEMs (USGS Level 1 DEMs) because the datasets were computationally small, relatively inexpensive to obtain, represented the best available data, or all the above (e.g., Daniels, 1992;Jensen et al., 1993;Kana et al., 1984). United States Geological Survey (USGS) Level 1 (L1) DEMs are characterized by 30 3 30 m resolution and are required to have a vertical elevation root mean square error (RMSE) less than 15 m, though less than 7 m is preferred (USGS, 2007). Elevation units are provided in either feet or meters, and thus lack the sensitivity necessary to model small changes in sea level. For example, a 1-cm and 30-cm or a 1-cm and 99-cm SLR scenario superimposed on a USGS DEM will yield the same inundation statistics if the elevation units of the DEM are provided in either whole feet or meters, respectively. The availability of high-resolution light detection and ranging (LIDAR) data is improving the accuracy of DEMs in modeling SLR rapidly (Bin et al., 2007;Poulter and Halpin, 2007). Each LIDAR mission has unique data accuracy standards, but data are far superior to USGS L1 DEMs. For example, LIDAR data are available at no cost along a narrow band of the North and South Carolina coast from the Airborne LIDAR Assessment of Coastal Erosion mission. These data have horizontal and vertical accuracies of 80 and 15 cm, respectively. However, it is important to note that LIDAR data only represent an improved model of current shorelines, not the locations of future shorelines. Further, LIDAR data are not available for all areas, data require intensive processing times, and data remain expensive to obtain, though costs are becoming more affordable. Sea level rise models must explicitly document the horizontal and vertical resolution of the DEMs because different data characteristics, which affect the accuracy, resolution, and sensitivity of the DEM, will yield different inundation results (Gesch, 2009;Wang and Zheng, 2005). Specifying the tide level of SLR maps and models is critical when reporting results. Modeled outputs that use mean high high tide as compared with mean sea level will likely lead to vastly different results, especially in regions of low-lying surface topography with large tidal ranges (Marbaix and Nicholls, 2007). Providing information on the frequency and extent of high tides is also important for planning."}, {"section_title": "Quantifying Impacts", "text": "Inadequate data and methodologies to quantify risk, vulnerability, and impacts further compound uncertainty within SLR impact assessments (Dawin and Tol, 2001;Moser, 2005). These uncertainties constitute the sixth ring of the model. For example, methodological difficulties remain in determining how many people, which groups, and at what times these populations are at risk (Small, Gornitz, and Cohen, 2000;Small and Nicholls, 2003). Centroid-based approaches, homogenous distribution approaches, and dasymetric approaches are all likely to yield different estimates of populations at risk within a census division (Langford and Higgs, 2006). There are also uncertainties regarding human values, resilience, political climate, and existing mitigation measures, which influence the impacts of SLR (Moser, 2005). In addition, there are no accepted methods to quantify the extent to which SLR exacerbates recent coastal hazards. For example, it is not possible to quantify the extent to which SLR over the past 100 years exacerbated damages from Hurricanes Hugo, Rita, or Katrina. Further, although impact assessments generally are able to predict damages to the existing built environment, it is difficult to quantify the economic, social, and environmental losses and costs (Dawin and Tol, 2001;Neumann et al., 2000). These losses and costs, often referred to as the ''hidden costs of coastal hazards,'' include the interruption of business, family disruptions and health issues, and the loss of ecosystem services (Heinz Center, 2000). It is therefore likely that most impact assessments are underpredicting losses and costs that occur via SLR. Models may still be effective for preliminary planning purposes despite data limitations, inadequate understanding of processes influencing SLR, and incomplete knowledge about future environmental and economic conditions. Models can help communities understand how changing environmental and social conditions may amplify future conditions and impacts. For example, the sea, lake and overland surges from hurricanes (SLOSH) model (NHC, 2008) helps emergency planners understand how various combinations of wind speeds, storm heights, and sea level affect storm surges. A second model, the sea level affecting marshes model (SLAMM, 2008) allows users to understand how different SLR scenarios may affect wetland conversion and shoreline change. A third model, the National Oceanic and Atmospheric Administration's (NOAA's) risk and vulnerability assessment tool, allows users to identify what is at risk to specific hazards in order to prioritize specific measures to develop more disaster-resistant communities (NOAA CSC, 2009). Uncertainty is managed in these models by allowing users to change various environmental and social parameters. For example, the dynamic interactive vulnerability assessment tool allows users to explore various impacts that may occur from selected emission scenarios and adaptation strategies, even though the probability of each outcome is not certain (DINAS COAST, 2008;Hinkel, 2005)."}, {"section_title": "SEA LEVEL RISE IN THE CAROLINAS", "text": "Understanding vulnerability to climatic change is an urgent concern for coastal communities. Coastal zone management programs will play a key role for state and local governments to understand vulnerabilities and implement appropriate adaptation strategies in the context of climatic change (CSO, 2007). However, there are no easy answers given the multiple sources of compounding uncertainty within SLR assessments. This section reviews the state of SLR research in the Carolinas and illustrates many of the compounding sources of uncertainty identified in Figure 1. Based on this review, SLR research priorities are identified for the Carolina coast in order to reduce these uncertainties (Table 1). It is likely that these site-specific recommendations may be transferable to other regions given that uncertainties are ubiquitous to all SLR assessments."}, {"section_title": "Sea Level Rise Assessments in the Carolinas", "text": "The North and South Carolina coastline is located within the Atlantic coastal plain physiographic region-an area characterized by low-lying and partially submerged land, extensive marshes and wetlands, and widespread land subsidence due to groundwater withdrawal and neotectonic movements (Figure 2) (Davis, 1987;Walker and Coleman, 1987). The impacts of SLR will likely vary throughout the Carolinas given the range of physiographic and economic characteristics of the coastline (Gornitz et al., 1994;Neal et al., 1984;Thieler and Hammar-Klose, 1999). Sea level oscillations along the Carolina coast were documented as early as the late 19th and early 20th centuries (Clark et al., 1912;Kerr, 1871). Analysis of data from tidal gauges whose measurement records exceed 50 years indicates a decreasing trend of relative SLR rates from southernmost Virginia (4.44 mm/y) to the South Carolina-Georgia border (2.98 mm/y) ( Table 2). This trend is likely caused by greater rates of land subsidence in North Carolina, particularly along the northern parts of the coast (Zervas, 2004). Long-term glacial uplift along the Cape Fear Arch is likely responsible for the lower rate of SLR recorded at the Wilmington tide gauge (Cinquemani et al., 1982;Gornitz and Seeber, 1990). Sea level changes and other coastal and anthropogenic processes have contributed to drastic shoreline changes along the Carolina coast (see, Fenster and Dolan, 1990;Foyle, Alexander, and Henry, 2003;Hays, Moslow, and Hubbard, 1977;Riggs and Ames, 2003). Inundation of urban infrastructure and wetlands, collapse of barrier islands segments, loss of tourism revenue, and other economic losses are among the largest threats from SLR along the Carolina coast (Bin et al., 2007;Feldman, 2007;ICF International, 2008;London and Volonte, 1991;Morris, Kjerfve, and Dean, 1990;Poulter et al., 2009;Riggs and Ames, 2003). Many sections of the Outer Banks are already collapsing, and SLR may lead to breaches in some sections of barrier islands as wave action from storm events reaches further inland (Poulter, 2005;Riggs and Ames, 2003). Additional breaches in the Outer Banks may increase the salinity of water in the Albemarle-Pamlico Sound (CSCOR, 2004). Coastal erosion is also threatening historic structures, such as the Cape Hatteras Lighthouse (NRC, 1988), and future SLR is likely to continue to increase the vulnerability of buildings and other infrastructure along the coast. Coastal wetlands in the Carolinas are also vulnerable to SLR, especially in areas where wetland transgression is prevented by human development, where vertical accretion cannot keep up with SLR, or where rates of sedimentation are reduced from the diversion of rivers (Bradley, Kjerfve, and Morris, 1990;Morris et al., 2002;Mudd, Howell, and Morris,  2009; Pulich and White, 1991;Riggs and Ames, 2003). Several studies offer insight into the sensitivity of Carolina wetlands to changing sea level. Although some of this information is available at a few site-specific locations, the response of wetlands to SLR is not likely to be uniform across the Carolinas. Moorhead and Brinson (1995) suggest that wetlands along the Albemarle-Pamlico Peninsula, North Carolina, are not threatened by current rates of relative SLR due to local high accretion rates of the wetlands; however, any positive acceleration in relative SLR is likely to result in wetland loss in the region. Charleston and North Inlet (part of the North Inlet-Winyah Bay National Estuarine Research Reserve System) are two of the most studied areas for wetland loss to SLR in South Carolina. Jensen et al. (1993) predicted that 80% of coastal wetlands could be lost around Fort Moultrie if 1.24 m of SLR occurred by 2100. These results are supported by other findings that indicate up to 50% of coastal wetlands in the Charleston area would be inundated by a 1-m rise in sea level (ASCE, 1992;Kana et al., 1984;Park et al., 1989). Wetlands located near North Inlet might be among the first to drown in South Carolina given the slow rates of sedimentation (Morris et al., 2002). The landward movement of saltwater into surface and underground freshwater environments is likely to accelerate as a result of SLR, climate variability, drought, and overpumping of coastal aquifers (Conrads and Roehl, 2007;Meisler, Leahy, and Knobel, 1985). Kana et al. (1984) predicted that saltwater intrusion would not threaten the public water supply wells in Charleston until 2075, given a 2.3-m rise in sea level, at which time the saltwater/freshwater interface could move 150-450 m inland. Results from this study were made based on the assumption that the freshwater-saltwater interface was located close to existing shorelines and that the slope of the interface was vertical. Other research suggests that ditches and dikes may provide a conduit for saltwater to enter freshwater systems, thus accelerating the salinization of freshwater and brackish ecosystems (Riggs and Ames, 2003). Changes in the water table may also lead to the disruption of hazardous waste sites or landfills, which may increase the mobility of pollutants throughout the groundwater system sites (Titus, 1984). Here again, research has focused on Charleston, one of the larger urban centers near the coast. Flynn et al. (1984) found that the Charleston Peninsula has four active and one inactive hazardous waste sites in the 100-year floodplain, and one of the active sites was located in the 10year floodplain. Five additional hazardous waste facilities would be located in both the 10-year and the 100-year floodplain, given a 2.3-m rise in sea level. Flynn et al. (1984) recognized many limitations of the study, including hazardous waste facilities were geocoded using small scale street maps, elevations were obtained from coarse resolution DEMs, and shoreline changes were not taken into consideration. Numerous studies have also quantified economic impacts of SLR in the Carolinas (Bin et al., 2007;Gibbs, 1984;Whitehead et al., 2009;Yohe, Neumann, and Ameden, 1995). Bin et al. (2007) estimated the economic impacts to real estate, recreation, and business and industry of an 81-cm rise in sea level by 2080 in North Carolina. Results indicated that 3.2 and 3.7 billion dollars in real estate losses would occur to residential and nonresidential properties, respectively. Gibbs (1984) estimated the cumulative economic impacts of SLR in Charleston based on the principals of welfare economics, where net economic services were compared under three scenarios: no changes in sea level (baseline conditions), sea level change, and sea level changes with adaptation. Net economic services were calculated by the following factors: gross property value, costs of property maintenance, lost future benefits from SLR, and remaining value of property. Results indicated that losses could reach 35% of the total economic activity by 2075 given an 87.6mm/y rise in sea level, and that the potential economic losses could be reduced by 43-65% by anticipating SLR. These findings are similar to those of Yohe, Neumann, and Ameden (1995), who predicted notable cost savings for protection strategies that anticipated SLR."}, {"section_title": "Illustrating Key Uncertainties", "text": "There are many steps where uncertainty is introduced in the assessment of SLR along the Carolina coast (Table 1). First, there is a geographical bias of stations with long-term measurements-most stations are located near larger coastal cities. Several tidal gauge records exist across the region (82 in North Carolina; 249 in South Carolina), but many of these records are either no longer active, discontinuous, cover a short period of time, or combinations of the above. As a result, many tidal gauge records in the Carolinas only provide snapshots of changing sea level conditions, rather than a continuous and lengthy means of evaluating relative SLR. Second, not all Table 2. Trends in sea level as indicated from tidal gauges in the Carolinas and adjacent states (NOAA CO-OPS, 2009). Mean 6 standard error represents 90% confidence that the actual rate of SLR is within the specified range."}, {"section_title": "Tidal gauge", "text": "Measurement (period [y]) Sea level trend, mm/y (ft/century) stations in the Carolinas have consistent quality data readings. The trend at Springmaid Pier may be too high given a period of questionable data during the early 1970s (NOAA CO-OPS, 2009). Determining trends in sea level variability and change from tidal gauge station records compounds uncertainty in SLR assessments. Sea level measurements from Springmaid Pier are used to illustrate the sensitivity of trend analyses to the beginning and end year of analysis. The rate of SLR at Springmaid Pier decreases from 5.17 6 0.49 mm/y to 4.09 6 0.76 mm/y when the analysis is extended from 1957-99 to 1957-2006, respectively. Note how the rate of SLR also changes notably for the Wilmington and Fort Pulaski tidal stations as the measurement period changes ( Table 2). Extrapolating changes in sea level from existing data in the Carolinas further compounds the magnitude of uncertainty given the nonlinear and non-spatially uniform nature of SLR and uncertainties surrounding climate sensitivity, future temperature changes, and the response of glaciers, ice sheets, and ice caps. Uncertainties are further compounded given the limited data and methodologies to model shoreline change. Slott et al. (2006) developed a numerical model to evaluate how changing wave climates affected cuspate shorelines similar to the Carolina Capes. Although Slott et al. (2006) stated that these models should not be used as reliable predictions, results do indicate distinct shoreline changes are expected in association with changing wave climates, including shorelines along the U.S. Southeast coast. There also remains a limited understanding of many human dimensions of global environmental change throughout the Carolinas. These factors include insufficient information on the level of risk society is willing to accept and future population, economic, and land use changes. Despite these challenges, progress is being made in identifying perceptions of SLR (Barber et al., 2008;Miller, 2010) and coastal manager data and information needs (MRAG, 2009). Although USGS L1 DEMs are available for the entire coast, these DEMS are subject to notable error and uncertainty. In the case of Charleston County, South Carolina, the RMSE of USGS L1 DEM quadrants range from 1 to 4 m, even the low value is higher than many projections of SLR by 2100. Further, elevation values for USGS L1 DEMs in Charleston County are reported in full meter units and thus lack the vertical precision and sensitivity necessary to model subtle changes in sea level. Although LIDAR data in the Charleston area do provide topographic data with 6-cm vertical and 1-m horizontal RMSE elevation accuracy, these data cannot account for changes in shorelines. Further, bathymetric data are not available along the entire Carolina coast, and it is difficult to obtain these data in shallower water or near shore areas because of high water turbidity. Quantifying the economic impacts of SLR further introduces uncertainty into the assessment process, since models require information on the future costs of protection and economic costs of abandonment (Yohe et al., 1996). However, it is difficult, if not impossible, to predict these factors, and many economic costs are not included in analyses. For example, the costs of saltwater intrusion and lost recreational opportunity were not included in Gibbs's (1984) economic impact assessment of Charleston, and estimates did not account for equity or the distributional losses within the community. Yohe and Nuemann (1997) found that cost-benefit procedures work best when sea level changes are monitored vigilantly, changes to shoreline policies are perceived as credible, and when markets are given sufficient time to minimize the economic costs of abandonment. Uncertainty may be further introduced into economic impact assessments given that several important factors may be excluded from the analysis. For example, Whitehead et al. (2009) acknowledged that their estimate of the economic impacts of SLR for marine fisheries in North Carolina only focused on SLR, and that changes in temperature and precipitation could also affect angler behavior and fish stocks."}, {"section_title": "Research Needs along the Carolina Coast", "text": "The following recommendations are suggested to improve the utility of, and reduce the uncertainty within, SLR assessments along the Carolina coast. First, sea level measuring and monitoring networks could be improved to reduce the geographical bias of long-term measurements. Depending on available funds, this could be accomplished by using satellite altimetry or by constructing new tide stations where data are limited. Second, there is an urgent need to develop a more comprehensive understanding of how shorelines will respond to climate change (ASFPM, 2007;CSO, 2007;MRAG, 2009;Tribbia and Moser, 2008). Until these data and models become available, it is necessary to acquire higher resolution DEMs, since coarse spatial resolution DEMs (1 : 24000) are inadequate for SLR assessments. Although high-resolution DEMs, such as those supported by LIDAR, do offer significant improvements to model SLR, it may be possible to further improve the accuracy of high-resolution DEMs by using land cover data, given the systematic error associated with different land cover types (see, Hodgson et al., 2003). Regardless of the improvements in the vertical resolution of coastal elevation data, these data cannot account for shoreline changes. Third, there is an urgent need to further understand biological processes. The ecological effects of sea level rise (EESLR) research program, sponsored by the Center for Sponsored Coastal Ocean Research, was designed to assist state and coastal managers develop plans for addressing the impacts of SLR. The EESLR North Carolina pilot project identified multiple knowledge gaps in our understanding of marshland response to SLR (see CSCOR, 2004). Recommendations called for a more comprehensive understanding of the physical processes and drivers, as well as their spatial distributions, which guide the formation and response of coastal wetlands to SLR. This includes information on the interactions among sedimentation rates, astronomic and wind tides, hydrology of uplands and marshes, salinity, surface and subsurface geology, and tolerances and thresholds. Access to bathymetric data will play a key role in improving our understanding of these physical processes, including storm surge. Fourth, the human dimensions of global environmental change must be further explored. Critical to this approach is the identification of risk or level of climate change that a society is willing to accept; the goals of adaptation process; decisions regarding how the responsibility of risk should be shared between individuals and the public; and the identification of the tradeoffs among social justice, environmental, and economic issues that are likely to arise with the allocation of scarce resources (Luers and Moser, 2006). Incorporating stakeholder perceptions of SLR, as well as their diverse data and information needs, is a critical component in identifying adaptation priorities (Dow and Carbone, 2007;Tribbia, 2006/2007;Tribbia and Moser, 2008). Although research has identified that coastal managers want to know more about the reasons behind why uncertainty exists (see, Tribbia and Moser 2008), research must also identify what decisions coastal managers associate with the highest levels of uncertainty. For example, it is likely that coastal managers may place more emphasis on reducing uncertainties associated with changes in policies or regulations, given that these uncertainties align more closely with management timeframes. Emphasis on reducing certain sources and types of uncertainties may also vary among and across different scales and levels of governance given the diversity of management challenges and priorities. Further, there remains a need to bridge our understanding of perceived uncertainty and scientific uncertainty. Such findings are likely to enhance the ability of research, extension, and outreach efforts to support local and regional adaptation initiatives. Fifth, there is a clear need for a more systematic evaluation of SLR along the Carolina coast. Our current understanding is based on a set of case studies that tend to focus on the same research areas such as Charleston, South Carolina. While these are important cases, they do not capture the diversity of natural or social processes dominating stretches of the Carolina coast. Systematic evaluations of how diverse social and ecological systems have responded, and will continue to respond, to increasing sea level will allow for a more comprehensive understanding of how local systems respond to change."}, {"section_title": "CONCLUSION", "text": "Increasing the availability of SLR assessments, as well as communicating the uncertainty within them, is a critical step to increasing the adaptive capacity of coastal communities to climate change (Klein, Nicholls, and Mimura, 1999). Uncertainties may undermine the utility of SLR assessments, especially if the sources and types of uncertainty are not transparent to stakeholders. This study provides a first step at synthesizing the compounding nature of uncertainty in SLR assessments (Figure 1). It emphasized the challenges in interpreting tidal gauge records and determining trends, the difficulty in estimating the rate and magnitude of future sea level change, the limitations of using DEMs, and the uncertainty in modeling impacts. It is not apparent that we can quantify all of the sources and types of compounding uncertainties in SLR assessments. These challenges arise mainly from two factors. First, we do not know how to quantify all of the individual sources of uncertainty. The accuracy of DEMs, tidal gauge records, and census data can all be quantified, yet it is not apparent that we know how to quantify all of the uncertainties associated with shoreline change. Second, even if each source of uncertainty could be quantified, current methods do not allow us to quantify the magnitude of compounding uncertainties. Although it is possible to quantify compounding uncertainties involved in determining the population at risk to SLR, since population data and DEM accuracy are both based on probability distributions, it is not possible to integrate other sources of uncertainty such as shoreline erosion or changes in policy into this calculation. A review of the state of SLR research along the Carolina coastline indicated that critical gaps and uncertainties remain in our understanding of SLR (Table 1). Most tide stations with records exceeding 50 years are located near large cities, and data remain sparse in more rural locations. There is also a need to know more about the physical processes that guide the formation and response of coastal wetlands to SLR, including tolerances and thresholds. This requires accurate and precise elevation and bathymetric data and an understanding of how future shorelines will respond to SLR. In addition, little is known regarding perceptions of uncertainty, the level of risk that stakeholders deem acceptable, and which decisions coastal managers associate with the highest level of uncertainty. It is likely that other coastal regions will face similar challenges and knowledge gaps given that many of these uncertainties are ubiquitous throughout all coastal regions. Although improving data quality and increasing our understanding of physical processes and human responses will reduce some uncertainties in SLR assessments, deeper understandings of complex problems often lead to the identification of other uncertainties (Yohe, 2006). It is therefore important to communicate existing and emerging uncertainties in SLR assessments, since they are not always obvious to nonexperts. Research by Tribbia and Moser (2008) indicates that coastal managers in California want basic explanations on why uncertainty exists and desire information on uncertainty ranges surrounding climate change projections. Providing these explanations and quantifying the range of uncertainty within SLR research remain future challenges."}, {"section_title": "ACKNOWLEDGMENTS", "text": "Support of this work by the NOAA Climate Programs Office's Regional Integrated Sciences and Assessments Program (award number NA06OAR4310007) and South Carolina Sea Grant Consortium (Grant Number RC01) is thankfully acknowledged. The author would also like to thank Greg Carbone, Kirstin Dow, Michael Hodgson, Dan Tufford, Jessica Whitehead, Greg Zielinski, and the anonymous reviewers for their help in improving earlier drafts of the manuscript."}, {"section_title": "LITERATURE CITED", "text": "Abdalati, W., 2006. Recent changes in high-latitude glaciers, ice caps and ice sheets. Weather, 61 4, 95-101. Alley, R.B.; Clark, P.U.; Huybrechts, P., and Joughin, I., 2005. Icesheet and sea-level changes. Science, 310, 456-460. Antonov, J.I.; Levitus, S., and Boyer, T.P., 2005. Thermosteric sea level rise, 1955, doi:10.1029/2005GL023112."}]