[{"section_title": "Abstract", "text": "Improving rural broadband access has been touted as a rural development strategy, but there is limited evidence that broadband service affects rural economic growth. We measure the effect of broadband deployment on location decisions of new rural firms. Location-specific fixed effects are controlled by a counterfactual baseline that measures how local broadband service in the early 2000s affected local new firm entry in the early 1990s before broadband was available anywhere. The change in location choice probability of new firms from the counterfactual baseline to the actual response ten years later is the difference-in-differences estimate of the effect of broadband deployment on locations of new firms. We find that broadband availability has a positive and significant effect on location decisions of new firms in rural areas, which is confirmed by a robustness test using ZIP Code dummy variables. The broadband effect is largest in more populated rural areas and those adjacent to a metropolitan area, suggesting that this effect increases with agglomeration economies.\nKey words: Broadband Internet, firm location, rural, agglomeration economies.\nAccess to broadband Internet is widely presumed to increase economic growth because it lowers firm production costs and broadens the market for firm output. Broadband can facilitate better matching between firms and workers (Autor 2001) and faster learning market information.\n3 These productivity-enhancing factors would raise the location-specific profitability of firms in rural areas with broadband access. Therefore, in competitive markets, firms should have a higher probability of entering markets with higher anticipated profitability.\nHowever, broadband may have negative effects on the rural economy as well (Fox and Porca 2001; Malecki 2003) . Just as broadband may allow rural firms to access distant customers, broadband may also allow urban firms to sell more products to rural customers. Broadband may shut down rural branch offices because basic services in branch offices can be replaced by online customer services. Broadband benefits may be largest in more densely-populated areas because of complementarities between broadband and agglomeration economies, and because cities have more skilled workers whose skills are enhanced by information Younjun Kim is a post-doctoral research associate in the Bureau of Business Research, University of Nebraska-Lincoln. Peter F. Orazem is a university professor of economics at Iowa State University. The authors thank the members of the Iowa State human resources workshop, two anonymous reviewers, the editor, and Nicholas Magnan for helpful comments and Liesl Eathington for research assistance. Computer codes and output files are available from the AJAE webpage. Correspondence to be sent to: younjun7kim@gmail.com.\n1 For an extensive review on the economic impacts of broadband, see Holt and Jamison (2009) . For a comprehensive review on economic impacts of information technologies, see Cardona, Kretschmer, and Strobel (2013) . Vu (2011) found that broadband and Internet access have larger impacts on economic growth than do other information technologies such as personal computers and mobile phones. "}, {"section_title": "", "text": "Access to broadband Internet is widely presumed to increase economic growth because it lowers firm production costs and broadens the market for firm output.\n1 For example, broadband and e-commerce decrease transaction costs, ease coordination, and streamline face-to-face communication with nearby upstream suppliers and downstream consumers (Gasper and Glaeser 1998; Kinsey 2000; Borenstein and Saloner 2001; Henderson 2001; Henderson, Dooley, and Akridge 2004; Lamie, Barkley, and Markley 2011) . Broadband also helps firms reach more distant consumers and suppliers. 2 Broadband can facilitate better matching between firms and workers (Autor 2001 ) and faster learning market information.\n3 These productivity-enhancing factors would raise the location-specific profitability of firms in rural areas with broadband access. Therefore, in competitive markets, firms should have a higher probability of entering markets with higher anticipated profitability.\nHowever, broadband may have negative effects on the rural economy as well (Fox and Porca 2001; Malecki 2003) . Just as broadband may allow rural firms to access distant customers, broadband may also allow urban firms to sell more products to rural customers. Broadband may shut down rural branch offices because basic services in branch offices can be replaced by online customer services. Broadband benefits may be largest in more densely-populated areas because of complementarities between broadband and agglomeration economies, and because cities have more skilled workers whose skills are enhanced by information Younjun Kim is a post-doctoral research associate in the Bureau of Business Research, University of Nebraska-Lincoln. Peter F. Orazem is a university professor of economics at Iowa State University. The authors thank the members of the Iowa State human resources workshop, two anonymous reviewers, the editor, and Nicholas Magnan for helpful comments and Liesl Eathington for research assistance. Computer codes and output files are available from the AJAE webpage. Correspondence to be sent to: younjun7kim@gmail.com.\n1 For an extensive review on the economic impacts of broadband, see Holt and Jamison (2009) . For a comprehensive review on economic impacts of information technologies, see Cardona, Kretschmer, and Strobel (2013) . Vu (2011) found that broadband and Internet access have larger impacts on economic growth than do other information technologies such as personal computers and mobile phones.\n2 Consumers living further from retail stores are likely to spend more over the Internet (Sinai and Waldfogel 2004; Mishra, Williams, and Detre 2009). Amer. J. Agr. Econ. 0(0): 1-18; doi: 10.1093/ajae/aaw082 V C The Authors 2016. Published by Oxford University Press on behalf of the Agricultural and Applied Economics Association. All rights reserved. For Permissions, please email: journals.permissions@oup.com technologies (Bresnahan, Brynjolfsson, and Hitt 2002; Beaudry, Doms, and Lewis 2010) . 4 Broadband benefits interacted with agglomeration may attenuate with distance from the urban center (Rosenthal and Strange 2003, 2008) . Thus, broadband benefits in rural areas might be limited to those close to urban or metro markets. 5 The few empirical studies that have explored the effect of broadband on the rural economy have mixed results. Stenberg (2009) , Kolko (2012) , and Atasoy (2013) report that broadband availability increased rural economic growth. Whitacre, Gallardo, and Strover (2014) reported negligible impacts of broadband availability but found that rural areas with higher adoption rates grew faster. Kandilov and Renkow (2010) , Mahasureerachai, Whitacre, and Shideler (2010) , and Whitacre (2011) did not find significant effects from local broadband service.\nOne reason that the previous studies may have had conflicting results is their use of aggregate employment or number of establishments as measures of economic outcomes. These measures are dominated by the decisions of firms whose location decisions were unrelated to broadband availability and for whom the cost of relocation would be much larger than any potential return from broadband availability. We focus on newly-entering firm location decisions that would be the most sensitive to the presence or absence of local high-speed Internet service. 6 New firm location decisions are predicated on current local infrastructure, including whether or not broadband service is available, whereas most existing firms in the location entered before broadband was available in any market.\nAnother advantage to this study is its ability to control for unobservable firm-specific and location-specific fixed factors that cloud previous measured effects of local broadband availability on local economic growth. Broadband will most likely be installed in areas that are already more profitable for new firm entry, requiring a control for preexisting, location-specific fixed factors that influence profitability even without the broadband availability. As evidence, the correlation between broadband availability in a rural ZIP Code in 1999 and new firm entry in the same ZIP Code in 1990-1992 before broadband was available anywhere is 0.49."}, {"section_title": "7", "text": "Cleary, broadband availability in a ZIP Code is predicated on past conditions for growth in the ZIP Code, which can lead to a spurious correlation between current local broadband availability and contemporaneous local economic growth. However, this correlation between current broadband and past growth allows us to estimate a \"counterfactual\" broadband effect on location choice probability of new firms before broadband was available anywhere. The change in location choice probability from the counterfactual location choice probability in the early 1990s to the location choice probability after broadband started to become available in the early 2000s is interpretable as the difference-indifferences measure of the broadband effect on location choices of new firms.\nWe apply our method to data taken from new firm start-ups in rural areas of Iowa and North Carolina. We choose rural areas because very rapid deployment of broadband eliminated meaningful variation in broadband availability in urban areas. Broadband deployment started in 1998 and spread quickly in urban areas that had the largest customer base. 8 In urban Iowa and North Carolina, 67% of ZIP Codes had at least one provider within a year. In contrast, broadband deployment was considerably slower in rural areas, with only 35% of rural ZIP Codes having service within one year in Iowa and North Carolina. We find that rural firms are 60% to 101% more likely to locate in ZIP Codes with broadband availability. The broadband effect on firm entry is larger in rural areas adjacent to a metropolitan area or with larger populations. In a robustness test using ZIP Code dummy variables, the effect of broadband on rural firm entry falls to 3%. As we will explain later in the article, this 3% 4 Sinai and Waldfogel (2004) and Bekkerman and Gilpin (2013) empirically support the complementarity between Internet and cities. These authors found that residents in larger cities are likely to use more locally accessible information. 5 In a similar vein, Fox and Porca (2001) argued that the rural areas with better endowments of agglomeration factors complementary to broadband are those adjacent to urban areas rather than more remote rural areas.\n6 Rosenthal and Strange (2003) and Jofre-Monseny, Mar ın-L opez, and Viladecans-Marsal (2011) advanced similar arguments to justify their focus on new firm location decisions.\n7 This correlation is calculated by the authors using nonagricultural and non-mining rural firms in Iowa and North Carolina.\n8 Faulhaber (2002) dates the timing of the earliest available broadband service during 1998, although the legal basis for broadband deployment was set by the 1996 Telecommunications Act.\nestimate can be viewed as a lower-bound estimate of the true broadband effect.\nFederal and state governments have invested considerable resources to encourage rural broadband deployment and to reduce the digital divide between urban and rural areas (Gilroy and Kruger 2013 ; National Conference of State Legislatures 2012). Our findings support the view that rural firms are more likely to enter a market with broadband availability. However, our findings do not suggest that universal rural broadband deployment will cause the gap in economic growth between urban and rural areas to close. While broadband availability will increase the likelihood that a firm will locate in a rural area relative to other rural towns lacking broadband, the total number of firms locating in rural towns might not be affected by broadband availability. Moreover, the complementarity between broadband and agglomeration suggests that broadband is most valuable to the rural places close to urban markets or with higher populations. The uneven deployment of broadband across rural locations has caused recent rural firm entry to concentrate in a small number of towns with service. The resulting agglomeration of firms in these towns may continue to favor firm location in these relatively few locations, even if broadband access were made universal. Future research will need to investigate whether broadband deployment into rural markets increases the total number of rural firm start-ups."}, {"section_title": "Literature Review", "text": "There is convincing evidence that Information Technology (IT) raises productivity (Cardona, Kretschmer, and Strobel 2013) .\n9 Productivity gains from IT are also found in developing countries such as Brazil and India (Commander, Harrison, and Menezes-Filho 2011) . Firms that adopted IT earlier experienced more rapid productivity gains than similar firms that did not (Dunne et al. 2004) . Workers in firms that used IT more intensely experienced faster wage growth than comparable workers in firms lacking IT investments (Autor, Katz, and Krueger 1998; Acemoglu 2002) . These findings are consistent with predictions of endogenous growth theory (Romer 1986 ) that indicate the generation and distribution of information and ideas are important factors in economic growth. Further, IT raises firm productivity because it decreases the cost of communication and information processing, changes business processes and work practices (Brynjolfsson and Hitt 2000) , and creates new products and values through e-commerce (Borenstein and Saloner 2001) . Rö ller and Waverman (2001) , using an analysis of the spread of voice telephony infrastructure, show that the growth effects from IT generally occur across countries.\nNumerous studies have shown productivity gains from broadband deployment. Grimes, Ren, and Stevens (2012) found that in New Zealand, higher Internet connection speed through broadband raised firm productivity compared to firms with no connection or firms that only had access through dial-up service. Gillett et al. (2006) , Shideler, Badasyan, and Taylor (2007) , Crandall, Lehr, and Litan (2007) , Koutroumpis (2009 ), Czernich et al. (2011 , Kolko (2012) , and Atasoy (2013) all found that broadband deployment is positively associated with economic growth. Ford and Koutsky (2005) found that broadband increases per-capita gross sales. Mack, Anselin, and Grubesic (2011) found that the presence of broadband is important to firm location in a subset of service industries such as information, finance, and insurance. The review by Holt and Jamison (2009) confirms these positive broadband impacts from other empirical studies.\nA challenge that has plagued all such studies is the endogeneity of broadband deployment. Economic growth in the United States has been concentrated in populous areas (Rosenthal and Strange 2004) , areas that also attracted early broadband deployment. This complicates identification of the unique broadband effect independent of correlated local factors that also affect growth. The review by Holt and Jamison (2009) notes that several studies have found localized economic growth following broadband deployment, but all are subject to skepticism regarding their identifying restrictions. To confront this concern, Kolko (2012) used an instrumental variable approach that used the average slope of local terrain as an instrument for local broadband penetration. 9 Jorgenson, Ho, and Stiroh (2008) found that IT investments were responsible for 33% of total factor productivity growth and 32% of labor productivity growth between 1959 and 2006. The importance of IT has increased so that by 1995-2000, IT represented 58% of total factor productivity growth and 59% of labor productivity growth.\nHowever, the instrument is only valid if local topography does not affect local employment growth, an assumption that may not be valid (as he acknowledges) and his instrumental variable estimates of the broadband effect on employment growth are implausibly large.\nA second challenge faced by researchers is that the very rapid deployment of broadband eliminated most meaningful variation in access across urban areas. In 2000, the Federal Communications Commission (FCC) estimated that 59% of ZIP Codes representing 91% of the population in the United States had at least one broadband provider by 1999 (FCC 2000) , even though broadband deployment began in earnest just one year earlier.\nAs a result, studies that focus on the effects of broadband on growth in metropolitan areas have had to rely on variation in the number of providers rather than on the presence or absence of service, even though it is the presence versus absence of broadband that should have the largest impact on growth. Furthermore, changes in the number of broadband providers in metropolitan areas would be due in part to the exit of providers from unprofitable areas as well as added providers to the most rapidly-growing areas, adding an additional source of endogeneity in measured local broadband service.\nDeployment was much slower in rural than in urban areas. Only 35% of the rural ZIP Codes in Iowa and North Carolina had access by 1999, and only 52% by 2002. In contrast, 67% of urban ZIP Codes had access by 1999 and 80% by 2002. 10 If it is the presence or absence of broadband that is most important for local economic growth as opposed to variation in the number of local broadband providers, there will be more fruitful variation to exploit in rural areas.\nAn additional advantage of studying the impact of broadband on economic development in rural areas is the near one-to-one correspondence between a community and a ZIP Code. This is important because broadband deployment is reported at the ZIP Code-level. Consequently, one can tie growth of a distinct ZIP Code area to broadband service provision for the same area. In urban areas where broadband deployment is spread over multiple ZIP Codes, it is more difficult to tie a community to a given ZIP Code area.\nThere are also reasons why broadband service could be particularly important in rural markets. Agglomeration economies led to the creation of cities (Quigley 1998; Glaeser 2008) and explain the persistent wage gap favoring urban workers over rural workers (Renkow 1996; Mills and Hazarika 2001) . The Internet has the potential to change the geography of production. Services may be produced at a distance from the customers of the service. Stages of production may be geographically dispersed and still coordinated. Consequently, proximity between employer and employee or customer and producer may become less important. The possibility of telecommuting also makes it potentially feasible for workers in rural areas to earn back some of the agglomeration surplus that previously only went to metropolitan workers. These possibilities have led some to conjecture that high-speed Internet will create communities of electronically-linked rather than spatiallylinked individuals. Liebowitz (2002) predicted that the Internet will reduce the advantage of \"locational monopolies\" by which an urban company's proximity to its customers gave it a competitive advantage. If these conjectures are true, there should be substantial benefits for new firms to locate in rural areas that offer broadband service compared to rural areas that do not."}, {"section_title": "Model", "text": "Our model illustrates the role of locational fixed factors in new firm start-ups and offers an avenue by which those fixed factors may be held fixed in empirical applications. To that end, suppose that we have J areas (j¼1, 2, . . ., J) that are defined geographically by ZIP Codes. These J areas are distributed across C counties (c¼1,. . .,C). We define t¼0 for a period before broadband was available in any of the J areas. Period t¼1 designates a time when broadband was available in at least some but not all of the J areas.\nPrice-taking firms maximize their profit in two stages. In the first stage, firm i calculates its expected profit in each area j at time t. Then the firm chooses the location with maximum profit (p Ã it ) in the second stage ð1Þ p Ã it Max j pðI jt ; z jt ; m c ; l j ; p t ; w jt ; r jt Þ where location j is included in county c. Firm profit (p) is affected by broadband availability (I jt ).\n11 Local demand shifters, z jt ; are measured by the income and education level of residents in the locality and may increase or decrease firm profits. County and state characteristics (m c ) include dummy variables indicating adjacency to a metropolitan area and size of urban population, which may be related to agglomeration economies improving firm productivity. Further, m c also includes a dummy variable indicating whether the ZIP Code is located in North Carolina or Iowa. Firm profit (p) increases in the common market price p t and location-specific fixed effects (l j ), and decreases in local wages (w jt ) and the rental rate on capital (r jt ).\nWe assume a spatial equilibrium where wages and capital costs are adjusted to local attributes affecting firm productivity (Rosen 1979; Roback 1982) . If areas are competitive, firms will expect to make zero economic profits in all areas. If areas that acquire broadband access (I jt ¼1) increase firms' productivity and profitability, the areas will attract additional entry relative to areas that do not have broadband access (I j 0 t ¼0). Entering firms will bid up the input prices for labor and capital until expected profits from additional entry are reduced back to zero. Hence, wages and rents will also be functions of local attributes such as l j and I jt . Absent any other sources of productivity differences between the two areas, wages and rents would have been identical. Of course, that is too strong an assumption, and so we allow additional variation in local demand and location-specific labor productivity differences in the form of z jt and m c .\nAt time period 1, the linear approximation to our reduced form profit for firms in area j is\nwhere superscripts on the parameters indicate the time period. The error term i is unobservable firm-specific characteristics. 1 is a common factor that affects profitability in all areas such as a country-wide expansion or recession. Moreover, j1 reflects transitory factors that the firm observes in assessing its profits in area j but that are not observed by the econometrician.\nIn principle, if we observe the fixed effect l j , we can estimate equation (2) directly. However, we do not observe l j . If the fixed effect is correlated with broadband availability, which is almost certainly the case, the estimated broadband effect would be biased. To address this issue, we introduce a counterfactual broadband availability into time period 0 when broadband is not available anywhere. To derive the counterfactual, we begin with the linear approximation to the firm's profit function in area j at time period 0\nIf we introduce broadband availability counterfactually into equation (3), its estimated coefficient would reflect its correlation with the fixed effect (l j ). Recall from the introduction that broadband availability in 1999 is highly correlated with new firm entry a decade earlier. That correlation will allow us to estimate the impact of the fixed effects on firm entry in period 0, which will in turn allow us to take out the fixed effect bias on our estimate of broadband access in period 1.\nConsider the projection of the area j fixed effect, l j , on past and current observed market factors plus the broadband availability indicator in period 1 (I j1 , z j0 , z j1 , and m c ):\nwhere x j is an error composed of elements of the fixed effect that are uncorrelated with the presence of broadband or of other local factors. Each coefficient in equation (4) reflects its correlation with the fixed effect. Replacing l j in equation (2) by equation (4), we obtain\nNote that h I represents the bias in the estimated broadband effect due to the correlation between the ZIP Code j fixed effect and broadband deployment in ZIP Code j. Replacing l j in equation (3) with equation (4), we get\nNote that the coefficient on the counterfactual broadband availability I j1 in equation (6) is h I , the bias in the estimated broadband effect in equation (5). We can tease out the true broadband effect c 1 I by merging equations (5) and (6) using the difference-in-differences:\nwhere D t¼s is a dummy variable indicating time period s.\nTo estimate equation (7), we use the conditional logit model; each new firm chooses one of the potential J areas to enter, based on anticipated profitability. Define the dichotomous variable E ijt ¼ 1 if the firm opts to enter area j in period t and E ijt ¼ 0 otherwise. Specifically,\nIf the error terms x j 0 þ j 0 t and x j þ jt follow the type 1 extreme distribution, we can estimate equation (8) using the conditional logit estimation.\nOur identification of the true broadband effect on new firm entry relies on the assumed independence between broadband availability (I jt Þ and the composite error term\nIf this assumption is violated, then estimates of c 1 I will be biased. But two of those error terms, the firm-specific effects i and the common economic shock t , are differenced away in the conditional logit estimation as they do not affect relative profitability across areas. The fixed error sources, x j 0 and x j , are not correlated with I jt by construction in equation (4).\nThe only error source that remains as a potential source of bias is the unobserved time-varying effects j 0 t and jt , which could be correlated with I jt . This would happen, for example, if larger rural towns grow faster than smaller rural towns over time, and broadband deployment is sorted into larger rural towns. This would create a positive correlation between the error term and the observed broadband dummy variable I jt , and that would cause an upward bias in the estimated broadband effect. As we will show later, we do not find significant changes in the broadband effect by altering the time period used in estimation.\nTo mitigate the potential violation of Independence of Irrelevant Alternatives (IIA) assumption underlying the conditional logit model, our specification includes two dummy variables indicating adjacency to a metropolitan area and size of urban population in the county based on Rural-Urban Continuum Codes (RUCC). Our concern is that ZIP Codes may be closer substitutes for other ZIP Codes located the same distance from a metropolitan area or that have similar population densities. To address that concern, Bartik (1985) introduced a strategy of grouping alternatives by close substitutability. Levinson (1996) applied the strategy to examine how environmental regulations affect the siting of manufacturing establishments.\nOur estimation uses six years of new-firm location data: 1990-1992 and 2000-2002. For new firms in 2000-2002, we use one-year lagged broadband availability. We pick one year from 1999-2001 for the counterfactual broadband availability for all new firms in 1990-1992 and 2000-2002 to allow for possible reporting error on which ZIP Codes had service. As we will show later, the estimated broadband effects are consistent regardless of the years for counterfactual broadband availability."}, {"section_title": "Data", "text": "We define ZIP Codes in counties with urban populations less than 20,000 as \"rural\" based on 1993 RUCCs. In our empirical model, each new firm chooses one out of 1,015 rural ZIP Codes across the two states, which sets J¼1,015. These ZIP Codes are distributed across 137 rural counties across the two states, which sets C¼137.\nWe apply our empirical model on a sample of 63,341 \"commercial\" establishments that entered a rural ZIP Code in either Iowa or North Carolina from 1990-1992 and 2000-2002. 12 We restrict the sample to firms with a clear profit motive, and so we exclude non-profit organizations, government agencies, and establishments with a public service emphasis such as museums or historical sites. We also remove firms in agriculture and mining because they cannot move freely across locations as their entry decision is affected by site-specific land or resource availability. 14 These proprietary data are available at a per-state fee, and so our choice of states is based on a budget constraint and a decision to pick two states from different economic regions that had many small counties across a broad continuum of rural and urban settings.\nWe obtain broadband availability information from FCC Form 477. Broadband is a general term for communication technologies that enable \"high-speed\" data transmission. The FCC defines data transmission faster than 200 Kbps in at least one direction as \"high-speed.\" Broadband is contrasted with dial-up connection to the Internet of less than 56 Kbps. In the early 2000s, cable and DSL broadband platforms were popular, but fixed wireless and satellite broadband platforms were rare.\n15 Form 477 reports the number of broadband service providers with subscribers in each ZIP Code. We create a broadband availability dummy variable (I j1 ), which is equal to one if the ZIP Code has at least one broadband provider and zero otherwise. We use broadband availability in the month of December from 1999-2001, which are oneyear lagged compared to our sample of new firms.\nThe broadband availability variable (I j1 Þ is subject to measurement errors that may bias our results. Our measured broadband availability only indicates that service is available somewhere in the ZIP Code, not that it is available everywhere within the ZIP Code. For example, ZIP Codes with at least one satellite broadband subscriber would be reported to have broadband, although satellite broadband made up a very small portion of high-speed lines in the early 2000s. 16 This problem is more severe in rural areas because on average, rural ZIP Codes span a greater area than urban ZIP Codes (Gillett et al. 2006 ). This overstatement might lead to underestimation of the broadband effect if many areas are characterized by low broadband penetration rates. Luckily, broadband effects appear at penetration rates as low as 10-20% (Czernich et al. 2011 ), so we are unlikely to miss any effects by overstating rural broadband penetration.\nBroadband availability can be understated because providers with less than 250 lines in the state are not required to report to the FCC. It is possible that rural ZIP Codes are covered by very small broadband providers who do not report to the FCC. If so, then our control group of ZIP Codes lacking broadband service will be contaminated by areas that do in fact have service. Lacking data in these very small providers, we cannot test formally for the importance of the problem 12 In our article, we use \"firm\" and \"establishment\" interchangeably. 13 The following industries are excluded: Agriculture (2-digit 2002 NAICS 11), Mining (21), Postal Service (3-digit NAICS 491), Monetary Authorities-Central Bank (521), Nursing and Residential Care Facilities (623), Social Assistance (624), Museums, Historical Sites, and Similar Institutions (712), Religious, Grantmaking, Civic, Professional and Similar Organizations (813), Private Households (814), and Public Administration (2-digit NACIS 92).\n14 Kunkle (2011) discusses the advantages of NETS data compared to public data such as the Quarterly Census of Employment and Wages (QCEW). As opposed to publicly available data based on establishments that file unemployment insurance reports, the NETS data also includes very small establishments such as sole-proprietorships. Excluding establishments with less than 3 employees does not change our results. Estimates are available in the supplemental appendix online. 15 Broadband service in December 1999 (FCC 2005) included traditional cable (51.3%), Asymmetric Digital Subscriber Line (ASDL; 13.4%), fiber optic cable (11.3%), wireless and satellite (1.8%), and other wirelines (22.1%) with market share in parentheses. 16 To avoid the overstatement of broadband availability from satellite broadband, Mahasuweerachai, Whitacre, and Shideler (2010) used placement of DSL and cable modem platforms. This kind of information may not be appropriate for our study because \"technical\" broadband availability does not necessarily mean the existence of broadband subscribers. We compared FCC form 477 with the Iowa Utility Board broadband survey, and found that there were many rural ZIP Codes where broadband was technically available but did not have any broadband subscribers in 2000 and 2001. beyond noting that this would tend to bias our estimates against finding an impact.\nThe other included time-varying local attributes (z jt ) are education and income levels of residents in the ZIP Code. The education variable is measured by people over 25 years old, with at least a two-year college degree in that ZIP Code, and the income variable is median household income in the ZIP Code. Those measures are available from the 1990 and 2000 Census. Given the significant travel costs, these variables are expected to reflect local demand for goods and services that are presumed to have an impact on local firm profitability.\nCounty and state characteristics (m c ) consist of three dummy variables indicating whether the county is adjacent to a metropolitan area, whether the county has at least 2,500 urban inhabitants, and whether the ZIP Code is located in North Carolina rather than in Iowa. The first two variables are based on 1993 RUCC.\n17 While other justifications for including these measures can be advanced, our interest relates to the plausible importance of agglomeration economies as possible complements with or substitutes for broadband availability. Agglomeration economies can improve firm productivity by promoting technology diffusion and innovation (Rosenthal and Strange 2004) . Proximity to upstream suppliers and downstream customers can decrease transaction costs. As opposed to more remote ZIP Code areas, these benefits are presumably larger in rural areas adjacent to a metropolitan area or areas with more dense populations (Partridge et al. 2008 ). However, broadband may alter the importance of proximity, which would make its availability even more important in remote counties. Table 1 presents the 1990 and 2000 average education and income levels for ZIP Codes with and without broadband availability in 2000. Recall that broadband was not available in 1990, but even then, education and income are higher in ZIP Codes that had the earliest access to broadband service. Education and income rise between 1990 and 2000 in both ZIP Code groups but remain significantly larger in ZIP Codes with broadband availability. It is apparent why these time-varying, location-specific attributes must be incorporated into the analysis, as persistent differences in income and education levels are correlated with local broadband availability. Moreover, if firm entry responds positively to local income and human capital levels, we will have greater firm entry in the broadband ZIP Codes due to their advantages in income and education, even if broadband availability has no effect. Our estimates of the impact of broadband availability on new firm entry will be purged of these potentially confounding effects of local education and income on firm entry and early access to high-speed Internet service.\nWe include 1,015 ZIP Code Tabulation Areas (ZCTA) in our data set. We required a consistent geographical area over the two periods separated by ten years. We assume that the geographical boundaries of ZIP Codes are consistent between 1990 and 2000 if the ZIP Code numbers are the same over time. We also assume that U.S. Postal Service ZIP Codes indicate the same areas that ZCTA codes indicate. Of 1,031 rural ZCTA codes in 2000, 952 were matched to corresponding 1990 Census ZIP Codes exactly. The remaining ZCTA codes were matched with 1990 Census ZIP Codes closest to them in terms of distance between geographic coordinates provided by Census Gazetteer Files. Sixteen ZCTA of 1,031 were excluded because they 17 Counties in RUCC 6 and 7 have urban population of 2,500 to 19,999, while those in RUCC 8 and 9 have less than 2,500 urban populations. Counties in RUCC 6 and 8 are adjacent to a metropolitan statistical area.\ndid not have any firm entrants in any of the six years (1990-1992 and 2000-2002 "}, {"section_title": "Results", "text": "Before turning to the results from our estimation strategy, we illustrate the type of results obtained when endogenous broadband provision is not controlled. These estimates assume that firms are selecting the highest expected profit p Ã ij1 from all J markets in equation (2). These estimates will control for the firmspecific and time-specific errors, i and 1 , but they will still be biased if the location-specific fixed effect l j is correlated with I j1 ."}, {"section_title": "18", "text": "The first specification assumes that broadband provision is exogenous, and so only observable variables from period 1 (I j1 , z j1 , and m c in equation [2] ) are included in the estimation. In this case, the fixed effect (l j Þ is an omitted variable in the specification and will be included in the error term. If the fixed effect is positively correlated with broadband availability (I j1 ), the estimated broadband coefficient will be overestimated. We report the coefficients and then present, in brackets, the implied proportional changes in the probability of firm entry relative to not having local broadband service. 19 To put the proportional changes into context, note that the average probability that a firm picks any random ZIP Code is 0.001. The estimated broadband effect in column 1 of table 2 implies that the firm entry probability increases by 261%, which is an implausibly large impact. The second specification adds a past number of new firm entrants as a proxy for the location-specific fixed effect l j in equation (2). 20 However, an examination of equation (3) shows that the past numbers of firm entrants are also dependent on past values of z j0 ; m c ; i ; and 0 . The past number of new firms is almost certainly correlated with those past values in equation (2), which would bias the coefficients. As a result, we build in other sources of bias using this strategy. As shown in column 2 of table 2, the proportional change in the probability of firm entry attributed to local broadband availability is 154%, which is still implausibly large."}, {"section_title": "21", "text": "In table 3, we report our difference-indifferences impact of broadband availability on the location choice probability of new firms. The top half of panel (a) reports the counterfactual coefficients h I from equation (8) I coefficients are converted into their implied marginal effects on probability of entry, which are reported in brackets. In column 1 with counterfactual broadband availability in 1999, the estimate of c 1 I is 0.66, with an implied proportional change in probability of firm entry attributed to local broadband equal to 73%. Using our average probability that a randomly-chosen 18 The number of ZIP Codes in this estimation is 1,006 since we include ZIP Codes having at least one new firm entry in 2000-2002 into a choice set. 19 The proportional change in the probability of firm entry with respect to broadband availability is calculated for each firm and each ZIP Code and averaged across all firms and ZIP Codes. For firm i, ZIP Code j, and observed local broadband service level f0; 1g 2 I O j1 ,\nwhere P E ij ¼ 1jI j1 ¼ 1 À Á is the probability that firm i chooses ZIP Code j when broadband is available in that ZIP Code, and P E ij ¼ 1jI\nis the probability that firm i chooses ZIP Code j when broadband service is set at the observed service level. 20 Similarly, Jofre-Monseny, Mar ın-L opez, and ViladecansMarsal (2011) argued that including the past number of existing firms would control for unobserved location-specific fixed effects.\n21 Kolko (2012) also found an implausibly large broadband impact on employment growth from his instrumental variable estimation; a unit of increase in broadband increases employment growth by 64 percentage points over 7 years (1999) (2000) (2001) (2002) (2003) (2004) (2005) (2006) . firm picks a given location as the baseline, broadband availability increases the probability that a firm chooses that location from 0.0010 to 0.0017. Similar results are found in columns 2 and 3. Our finding that broadband raises new firm entry probability is consistent with Stenberg (2009), Kolko (2012) , Atasoy (2013) and Whitacre, Gallardo, and Strover (2014) , but our estimates of the proportional change in the probability of firm entry due to broadband ranging from 60-101% are smaller than the much larger effects found in table 2. While these estimates are more plausible, they still seem too large.\nIn columns 4 to 6 of panel (a) in table 3, we add interactions between broadband availability (I j1 Þ and two county characteristics: adjacency to a metropolitan area and size of urban population. The top half of panel (a) shows that the correlation between later broadband availability and the location-specific fixed effect is largest in more populated counties that are distant from a metropolitan area. The bottom half of panel (a) shows that the effect of broadband on firm entry is largest in rural counties that are both adjacent to a metropolitan area and that have relatively large urban population. We summarize the implied effect of broadband on probability of firm entry in panel (b) of table 3. These are the average effects across the three sets of estimates in columns 4 to 6 of panel (a). Rural counties adjacent to a metro with an urban population of at least 2,500 (RUCC 6) have the largest proportional gain in probability of firm entry associated with local broadband service at 83%. The smallest gain from local broadband service is in the least populated counties remote from a metro (RUCC 9) with a proportional gain in probability of firm entry of 51%.\nOur results suggest that local broadband availability increases new firm entry most in rural counties that are close to areas with urban agglomeration economies and that have higher populations. This result is consistent with prior findings that both broadband and agglomeration are complementary with greater concentrations of skills, and so it is not surprising that agglomeration and broadband appear to be complements in production. Our findings are also consistent with the Watson et al. (2005) finding that firms in larger rural towns have greater willingnessto-pay for e-commerce information. These findings contrast, however, with Kolko (2012) and Atasoy (2013) , who found that local broadband service has the largest impact on economic growth in less densely-populated areas. It may be that broadband service has a different effect on new firm location decisions (our measure) compared to employment growth of incumbent firms (their measure), but it may also be that the bias related to unobserved location-specific effects and endogenous placement of broadband service is largest in the most remote markets, a finding consistent with the larger correlation between broadband service in 1999-2001 and new firm location choices in nonadjacent rural counties in 1990-1992 reported in table 3.\nWe also examine whether the broadband effects differ by industry in table 4 by estimating coefficients associated with interactions between broadband availability (I j1 Þ and firm industry dummy variables. The joint test that the broadband effect is common across industries is reported toward the bottom of table 4 rejects the null hypothesis of a common broadband effect across industries. In terms of proportional changes of firm entry probability, estimated broadband effects Note: Conditional logit estimation of variations of equation (2). Standard errors appear in parentheses. Proportional changes in the probability of firm entry are in brackets. Asterisks *** indicate significance at the 1% level. All models include county-group dummy variables for adjacency to metro areas and 2,500þ urban population, and a state dummy variable for North Carolina. 1990-1992 and 2000-2002 (1) t ¼ 1999\nCounter-factual broadband effect (1990) (1991) (1992) are the largest in education and health services but the smallest in manufacturing. Note that broadband effects are positive in all industries. Our finding of heterogeneous broadband effects across industries is consistent with Mack, Anselin, and Grubesic (2011) , Kolko (2012) , and Atasoy (2013) . The literal interpretation of our finding that broadband availability raises new firm entry probability suggests that broadband presence raises firm profitability. This has to be a transitory effect, as other areas for labor and capital should adjust to cause wages and rents to rise in areas where broadband raises productivity, causing profits to equalize across areas with or without broadband access. There is some evidence supportive of those wage and rent effects. Gillett et al. (2006) find that broadband Internet is positively associated with rents. Wages are less sensitive to broadband availability. Forman, Goldfarb, and Greenstein (2012) find that high-speed Internet does not affect wage rates except in places with highly educated and more dense urban populations with concentrations of IT-intensive industries. Kolko (2012) finds no effect of broadband on average wages. Because capital is less mobile than labor, these findings suggest that the equalizing factor may come from a bidding up of land prices in areas that have broadband access."}, {"section_title": "Robustness Checks", "text": "We check the robustness of our results in two ways. One is to change the years of our base period before broadband was deployed from 1990-92 to 1995-97. As noted in our derivation of our control for location-specific fixed effects, our estimation relies on the independence between the transitory location-specific profitability jt and the installation of broadband service I jt . A direct test of this assumption is not possible, but we can vary our empirical realization of jt by changing the years of our base period before broadband was deployed. If jt is positively correlated with the installation of broadband service (I jt ), changing the years of our base period to 1995-1997 would decrease estimated broadband effects than ones reported in the previous section. However, as we will show in the supplemental appendix online, this is not the case. Thus, our main results in the previous section are robust to the potential correlation between jt and I jt .\nThe other robustness check is to use ZIPCode dummy variables rather than counterfactual broadband availability. Our estimation has relied on counterfactual broadband availability to control ZIP Code fixed effect (l j ) in equation (8). We did not include ZIP Code dummy variables in order to use both across-and within-ZIP Code variations in broadband availability in identifying the broadband effect on entry. That leaves open the possibility that unobserved ZIP Codespecific factors could bias the results. To test this concern, we include ZIP Code dummy variables rather than counterfactual broadband availability.\nThis estimation relies on only within-ZIP Code variation in broadband availability over time. A possible concern is whether the data on broadband availability is reliable. At least some reported changes in availability appear suspect. To illustrate, some ZIP Codes had reported broadband availability in 1999 but not in 2000 or 2001, while others reported broadband availability in 1999 and 2001 but not in 2000. This problem was more severe in early years of broadband deployment.\nA related concern with reliance on within-ZIP Code variation is that we need many observations of switching service within ZIP Codes to derive precise estimates of the broadband effect. Thus, we estimate broadband effects using our previous 6-year sample (1990-1992 and 2000-2002) as well as a longer 8-year sample (1990-1992 and 2000-2004) that provides us more switches in service within ZIP Codes.\nAs we will show in the supplemental appendix online, we find no broadband effect with the 6-year sample. The estimated broadband effect may be biased, possibly toward zero, because of spurious variation in reported broadband availability in the earliest years of deployment. However, we find significantly positive broadband effect with the 8-year sample. To our interest, that broadband effect is much smaller (3%) than the previous estimates using counterfactual broadband availability (60-101%). There are three possible explanations: sorting of new firms within a county from ZIP Codes without to ZIP Codes with broadband; ZIP Code dummy variables' overcorrection of the true estimated broadband effects; and measurement errors in the reported broadband availability as described above. Given the last two explanations, we suggest that the 3% estimate should be treated as a lower bound for the broadband effect on firm entry, although the magnitude seems much more plausible than our upper-bound estimate or those reported in prior studies."}, {"section_title": "Policy Implication", "text": "Federal and state governments have made investments to deploy broadband Internet and close the \"digital divide\" between urban and rural households. The National Broadband Plan aims to establish universal broadband service by 2020 (FCC 2010) . Rural areas have been underserved by broadband Internet."}, {"section_title": "22", "text": "The federal government has subsidized rural broadband deployment through broadband programs in two federal agencies: the USDA Rural Utilities Service (RUS) and the FCC Universal Service Fund (USF; Gilroy and Kruger, 2013) . The RUS mainly supports upfront capital of broadband infrastructure, while USF mainly supports operation costs of broadband networks. The RUS has several broadband programs such as the Rural Broadband Access Loan and Loan Guarantee Program, and Community Connect Grant Program. The USF has programs such as Connect America Fund (formerly the High Cost Program), and Schools and Libraries Program (E-Rate). Money was also allocated to rural broadband under the American Recovery and Reinvestment Act in 2009 (Kruger 2009 ). The 2014 Farm Bill contains a Rural Gigabit Network Pilot Program aimed at bringing ultra-high-speed Internet service into rural areas. State governments also have made efforts to promote the roll-out of rural broadband; all 50 states have at least one broadband task force, commission, or a broadband project (National Conference of State Legislatures 2012).\nOur results are consistent with the view that government broadband deployment projects in rural areas will increase the likelihood of firm entry in these areas. However, our findings do not necessarily mean that broadband would increase the total number of new firms in rural areas. To establish whether broadband results in a net increase in the number of new firms in rural areas, we would have to have a country-level study. Koutroumpis (2009) and Czernich et al. (2011) found that broadband penetration increased economic growth in the Organization for Economic Cooperation and Development (OECD) countries, which suggests that broadband has a net positive effect on country-level economic activity.\nOur findings do not support the contention that universal rural broadband deployment will lower the gap in urban versus rural firm start-up rates because the effect of broadband on new firm entry is boosted by the agglomeration of firms. Recall that the broadband availability effect is largest in counties with greater agglomeration or that are in close proximity to metro areas with agglomeration economies. That suggests that the smallest and most remote rural towns having few local agglomeration economies will get the smallest economic benefits from government broadband deployment projects compared to larger rural counties closer to metropolitan areas. Olfert and Partridge (2010) also emphasized that connective infrastructure between urban and rural areas is one of the best practices for rural development.\nOur discussion above is limited only to the economic benefits of broadband. Of course, broadband can provide other types of benefits through telemedicine (Whitacre and Brooks 2013) , distance education, broader range of goods and services choices (Mishra, Williams, and Detre 2009) , and improvement of community interactions (Stern, Adams, and Boasef 2011) . However, economic benefits and other types of benefits are related to size of the population served. Given that \"the last mile\" that delivers high-speed Internet service from a node of the broadband network to an individual customer represents the highest cost for broadband providers and is presumably more costly in remote rural towns, it is not obvious that the benefit from government broadband deployment exceeds the costs in remote rural towns. As Fox and Porca (2001) and Renkow (2007) suggest, selected broadband provision to rural towns where the net benefit of broadband is positive may be socially desirable. And those net benefits will be largest in the relatively few rural labor markets that have sufficient population or proximity to an urban market to offer agglomeration economies that complement local broadband."}]