[{"section_title": "Abstract", "text": "This paper examines the impact on agricultural development from the introduction of barbed wire fencing to the American Plains in the late 19 th century. Without a fence, farmers risked uncompensated damage by others' livestock. From 1880 to 1900, the introduction and near universal adoption of barbed wire greatly reduced the cost of fences, relative to predominant wooden fences, most in counties with the least woodland. Over that period, counties with the least woodland experienced substantial relative increases in settlement, land improvement, land values, and the productivity and production share of crops most in need of protection. This increase in agricultural development appears partly to reflect farmers' increased ability to protect their land from encroachment. States' inability to protect this full bundle of property rights on the frontier, beyond providing formal land titles, might have otherwise restricted agricultural development."}, {"section_title": "I. Introduction", "text": "In The Problem of Social Cost, Coase (1960) begins with the example of a farmer and a cattleraiser: without a fence, cattle will damage the farmer's crops. Land-use will be efficient if liability for damage is defined and enforced, and this property right can be traded costlessly.\nOtherwise, cattle damage imposes an externality that distorts the farmer's product choices, investment levels, and production methods (Cheung 1970 ). The externality is internalized or eliminated when those costs fall below the resulting gains (Demsetz 1967) ; for example, when fencing costs fall sufficiently, the farmer builds a fence and produces within at efficient levels."}, {"section_title": "1", "text": "The efficiency gains from establishing and enforcing property rights may be large, and much attention has focused on the role of land rights in development (Alston et al. 1996; De Soto 2000; Brasselle et al. 2002; Lanjouw and Levy 2002; Galiani and Schargrodsky 2006; Libecap 2007; Besley and Ghatak 2009) . Insecurity distorts farmers' investments (Goldstein and Udry 2008) , and increased tenure security can increase farmers' investment in land (Banerjee et al. 2002; Jacoby et al. 2002) .\n2 More broadly, insecure property rights can distort labor supply (Field 2007) , reduce investment (Johnson et al. 2002) , and slow economic growth (North 1981; Engerman and Sokoloff 2003; Acemoglu and Johnson 2005) .\nIndeed, private enclosure of common lands in England may have contributed to the onset of the Industrial Revolution, by increasing both agricultural output and labor supplied to other sectors (Ashton 1962) .\nReturning to Coase's setting, this paper examines the impact on agricultural development from a decrease in the cost of protecting farmland: the introduction of barbed wire fencing to the American Plains in the late 19 th century. Fences protected farmers' land and crops from damage by others' cattle. Farmers often had no formal right to compensation for such damage if their land was not enclosed with fences. Farmers with formal legal protection still faced uncertainty in their ability to collect damages to unfenced land. Fencing had relatively little effect on farmers' security of land ownership; 3 rather, fencing improved farmers' property rights in the sense that it secured their ability to use land for certain purposes.\nBefore barbed wire, fence construction on the Plains was restricted by high costs in areas that lacked local fencing materials. Small sections of local woodland were a vital source of timber for fencing on the Plains. The introduction and universal adoption of barbed wire from 1880 to 1900 most affected areas with the least woodland that had been most costly to fence."}, {"section_title": "4", "text": "Based on decennial data from the Census of Agriculture, this paper finds that counties with the least woodland experienced large increases in agricultural development from 1880 to 1900, relative to counties with sufficient woodland for farmers to have accommodated previous fencing material shortages. Controlling for time-invariant differences among counties and state-wide shocks to all counties, the fraction of county farmland that was improved increased by 19 percentage points in counties with the least woodland.\nFrom 1880 to 1890, average crop productivity increased relatively by 23% in counties with the least woodland, controlling for crop-specific differences among counties and crop-specific state-wide shocks. The increased productivity was entirely among crops more susceptible to damage from roaming livestock, as opposed to hay. Farmers shifted the allocation of farmland toward crops and, in particular, more at-risk crops.\nAgricultural development increased along intensive margins, even as counties with the least woodland expanded along the extensive margin of total farmland settled. Estimated increases in the fraction of farmland improved are robust to controlling for changes correlated with counties' distance West and distance from St. Louis; counties' region, subregion, or soil group; counties' initial fraction of farmland improved; or the expansion of railroad networks.\nEstimated increases in total farmland are more sensitive to these robustness checks.\nThere were substantial and robust increases in total improved land, combining both intensive and extensive margins. Increases in agricultural development were capitalized in higher land values, totaling among sample counties roughly 0.9% of national GDP. In all, the estimates lend support to historical accounts that \"without barbed wire the Plains homestead could never have been protected from the grazing herds and therefore could not have been possible as an agricultural unit\" (Webb 1931, p.317) . Indeed, some states' efforts to reform legal fencing requirements appear to have had little effect, suggesting a difficulty in enforcing land protection on the frontier without physical barriers.\nIn interpreting the results, this paper emphasizes the role of barbed wire in protecting farmland from encroachment by others' cattle. However, the estimates may also reflect barbed wire's contribution to agricultural technology. Aside from any external protection effects, cheaper fencing benefits an isolated farm by providing greater control over a farmers' own cattle. This allows the production of cattle and crops in close proximity, and increases cattle productivity through improvements in feeding and breeding. Barbed wire's effects are a combination of direct technological improvements and increased protection from others'\ncattle.\nThere are some indications, however, that direct technological effects of barbed wire do not drive the main results. Counties most affected by barbed wire became increasingly specialized in either crops or cattle, rather than increasing the joint production of cattle and crops. Furthermore, there is little evidence of an increase in cattle production. This suggests that barbed wire did not only affect agricultural production through the purely technological benefits of cheaper fencing; rather, barbed wire's effects partly reflect an increase in security from external encroachment. Overall, barbed wire appears to have had a substantial impact on agricultural development in the US and, in particular, this may reflect an important role for protecting land and securing farmers' full bundle of property rights.\nThe paper is organized as follows. Section II reviews historical accounts of the need for alternative fencing materials in timber-scarce areas and the introduction of barbed wire fencing. Section III provides a theoretical framework to the historical accounts. Section IV describes the data and presents summary statistics. Section V develops the empirical methodology. Section VI presents the main results and explores their robustness. Section VII discusses the interpretation of barbed wire's effects, and Section VIII concludes."}, {"section_title": "II. History of Barbed Wire and the Great Plains", "text": ""}, {"section_title": "II.A. Timber Shortages Constrained Land Protection", "text": "English common law made livestock owners responsible for damages by roaming livestock, assigning the responsibility to fence-in livestock. In contrast, the American colonies adopted legal codes that required farmers to fence-out others' livestock (Washburn and Moen 1880; Davis 1973; Kawashima 1994; Kantor 1998 In practice, fences were necessary to protect crops and required substantial investment.\nIn 1872, fencing capital stocks in the United States were roughly equal to the value of all livestock, the national debt, or the railroads; annual fencing repair costs were greater than combined annual tax receipts at all levels of government (U.S. House 1872; Galveston News July 18, 1873; Webb 1931, pp.288-289) .\nFencing became increasingly costly as settlement moved into areas with little woodland.\nHigh transportation costs made it impractical to supply low-woodland areas with enough timber for fencing (Kraenzel 1955, p.129; Hayter 1939; Bogue 1963b, pp.6-7) . While wood scarcity encouraged experimentation, hedge fences were costly to control and smooth iron fences were broken by animals and prone to rust (Primack 1969) . Writers in agricultural journals argued that the major barrier to settlement was the lack of timber for fencing: the Union Agriculturist and Western Prairie Farmer in 1841, the Prairie Farmer in 1848, and the Iowa Homestead in 1863 (Bogue 1963a, p.74 ). An 1871 guide for immigrants focused on three main characteristics of farmland in Plains counties: its price, the amount of timber, and the amount fenced (U.S. House 1871)."}, {"section_title": "6", "text": "Historians emphasize the importance of fencing for protecting farmers from encroachment by others' cattle. \"When he sought to fence his crops against marauding livestock, the prairie farmer faced the timber problem at its most acute\" (Bogue 1963b, p.7) . \"Without fences\n[farmers] could have no crops; yet the expense of fencing was prohibitive, especially in the Plains proper. It is not strange that the farmers began to insist that stock be fenced and that fields be permitted to lie out\" (Webb 1931, p.287) ."}, {"section_title": "7", "text": "Political debates took place in Plains states about changing farmers' fencing requirements (Davis 1973) . 8 For example, in 1872, Kansas gave counties the option of adopting a herd law that would make livestock owners liable for damages to farmers' unfenced crops. Counties' decisions were attributed explicitly to divided local public sentiment: opposed by stockmen, good for farmers and grain production (Kansas State Board of Agriculture 1876 Agriculture , 1877 Agriculture -78, 1879 . 9 Formal fencing requirements began to vary by state, county, and township, and were collected by wire manufacturer Washburn and Moen (1880) . 10 However, these legal 6 Similarly, timber availability is among the first county characteristics described in 1870s Kansas State Board of Agriculture Reports.\n7 Recent scholarship has associated barbed wire with society's need to define control over space, beginning with the Western frontier and continuing in wars and prisons (Razac 2002 , Netz 2004 .\n8 The desire for legal reform underscores the inability of individual cattle-raisers and farmers to negotiate private guarantees: the large number of potential neighbors may have contributed to high transaction costs, along with an inability to enforce such contracts. Violent conflict on the plains between farmers and cattleraisers was largely prevented by farmers' concession to settle elsewhere (Alston et al. 1998) .\n9 Kantor (1998) analyzes similar debates in Georgia, counties' decisions to adopt herd laws, and relative changes in counties that adopted herd laws.\n10 Among the sample states, Iowa left farmers liable for livestock damage. Texas left farmers liable for cattle damage, but allowed counties to determine liability for other animals. Kansas and Colorado allowed damage liability to be determined by counties, while Minnesota left this decision to townships. Information that Nebraska left farmers liable appears to be from 1867 and outdated; in 1871, Nebraska resolved a period reforms faced challenges in monitoring damages and enforcing payments on the frontier, while also overcoming established fence-out social norms."}, {"section_title": "11", "text": "Farmers mainly adjusted to fencing material shortages by settling in areas with nearby timber plots. Bogue (1963b, p.6 ) writes about central Iowa:\nWhere timber and prairie alternated, locations in or near wooded areas were relatively much more attractive.. . . [T] here developed a landholding pattern of which the timber lot was an intricate part. Settlers on the prairie purchased five or ten acres along the stream bottoms or in the prairie groves and drove five, ten or fifteen miles to cut building timber or to split rails during the winter months.\nSmaller counties were roughly 30 miles on each side, so farmers traveling 5-15 miles for timber would have been mostly within their home county. For a standard homestead farm size of 160 acres, a county would need to be roughly 4% woodland for each farm to acquire 5-10 acres of woodland.\nBased on this calculation, counties can be grouped in three woodland categories: low (0-4%), medium (4-8%), and high (8-12%). The \"low\" counties are roughly those most constrained by timber scarcities, while \"medium\" counties could have partially adjusted with this landholding pattern and have been less affected along with \"high\" counties. The exact cutoffs for these categories are not relevant for the results; rather, the continuous estimates will be evaluated at three corresponding benchmark levels (0%, 6%, 12%) to assist in interpreting the estimated magnitudes."}, {"section_title": "II.B. The Arrival of Cheap Barbed Wire Fences, 1880 to 1900", "text": "The most practical and ultimately successful design for barbed wire was patented in 1874 by Joseph Glidden, a farmer in DeKalb, Illinois. Glidden's design had three important characteristics: barbs prevented cattle from breaking the fence, twisted wires tolerated temperature of conflicting decisions and passed a state-wide herd law making livestock owners liable for damage (Davis 1973 , Kawashima 1994 .\n11 Ellickson (1991) analyzes a modern California county, in which farmers and ranchers appeal more to social norms than strict legal responsibilities. In Ellickson's setting, social norms encourage ranchers to control cattle. changes, and the design was easy to manufacture. Glidden sold a half-stake in the patent for a few hundred dollars to Isaac Ellwood, a hardware merchant in DeKalb, and the two started the first commercial production of barbed wire, producing a few thousand pounds per year by hand (Hayter 1939; McCallum and McCallum 1965) .\nBarbed wire was cheaper than wooden fencing, particularly in timber-scarce areas, and it had lower labor requirements.\n12 Ellwood wrote to sales agents in 1875 that he did \"not expect the wire to be much in demand where farmers can build brush and pole fences out of the growth on their own land\" (Hayter 1939) and that \"where lumber is reportedly dearer, the wire would probably sell for more\" (Webb 1931, p.310) .\nIn 1876, the country's largest plain wire manufacturer (Washburn & Moen) bought half of the Glidden-Ellwood business for $60,000 cash plus royalties, and began the first largescale production of barbed wire. 13 In contrast to Glidden's sale to Ellwood, Washburn & Moen's purchase showed an awareness of barbed wire's potential and they made \"enormous profits\" (Webb 1931, p.309 )."}, {"section_title": "14", "text": "Newspaper advertisements began to appear in Kansas and Nebraska in 1878 and 1879 (Davis 1973, pp.133-134) . There were a series of public demonstrations and, once the effectiveness of barbed wire was proved, \"Glidden himself could hardly realize the magnitude of his business. One day he received an order for a hundred tons; 'he was dumbfounded and telegraphed to the purchaser asking if his order should not read one hundred pounds' \" (Webb 1931, p.312) .\n12 In Iowa, wooden fences varied in total construction costs per rod from $0.91-$1.31 in 1871, while barbed wire fences cost $0.60 in 1874 and below $0.30 in 1885 (Bogue 1963b, p.8) . Other reports quote barbed wire fences as costing $0.75 per rod in Indiana in 1880, while hedge fences cost $0.90 per rod and were wasteful of the land (Primack 1977, p.73) . Primack (1977, p.82) estimates that a rod of barbed wire took 0.08, 0.06, and 0.04 days to construct in 1880, 1900, and 1910 . The labor requirements for constructing wooden fences were constant throughout this period: 0.20, 0.34, and 0.40 days for board, post and rail, and Virginia rail.\n13 This process began in 1875 when Washburn & Moen, headquartered in Massachusetts, sent an agent to investigate unusually large orders from DeKalb, Illinois. They acquired barbed wire samples and designed automatic machines for its production.\n14 McFadden (1978) provides details on the further development of these businesses, with the 1899 incorporation of the American Steel and Wire Company of New Jersey leading to the monopolization of the barbed wire industry.\nLocal newspapers that had successfully lobbied for herd law reform recognized the importance of barbed wire, writing: \"every farm needs some fencing\" and as \"soon as a farmer is able, he fences his farm. There must be an apparent benefit\" (Nebraska Farmer and Wichita Beacon, quoted in Davis, p.134) .\n15 Legal and illegal fencing led to controversy and conflict on the range, as stockmen competed with each other and with farmers for control over land.\nThis culminated in fence-cutting wars that were resolved by the late 1880s (McCallum and McCallum 1965, pp.159-166; Webb, pp.312-316) .\nLocal recognition of barbed wire's importance is most reflected in the rapid increase and magnitude of its use. 15 Despite the previous attention focused on herd laws, Kansas State Board of Agriculture Reports stopped including details on these decisions after 1880 and entirely stopped reporting the law status after 1884.\n16 Prices are per hundred pounds (Webb 1931, p.310 The empirical approach presented here requires that the introduction of barbed wire fencing was exogenous, i.e., that its rapid rise around 1880 was not caused by the anticipated development of low-woodland areas. This assumption appears plausible for two main reasons.\nFirst, from a microeconomic perspective, the demand for fencing alternatives had been high for decades and Glidden-Ellwood appear not to have anticipated the tremendous market demand for barbed wire. Second, from a more macroeconomic perspective, the necessary cheap steel was only becoming available around 1880. Barbed wire's widespread commercial success was made possible by unrelated developments in the industrial steel sector. Strong rust-free wire became dramatically cheaper as the Bessemer-steel process became widely used, originally patented in England in 1855. Figure I shows prices for barbed wire, steel, and iron. Barbed wire's introduction and massproduction follows the sharp decline in steel prices in the 1870s.\n18 By contrast, iron prices are more stable and follow a weighted index of general prices over this period. Primack (1969) summarizes:\nOutcries about the burdens of fencing by agriculturists in the 1850 to 1880 period seem amply justified. A need was revealed and the problem was resolved, not by changing laws and institutions but rather by technological change. This solution had to wait for the development of cheap steel in the industrial sector. Then a solution was found in wire fencing, cheap in both money and labor costs. (p.289)"}, {"section_title": "III. Theoretical Framework", "text": "To motivate the empirical analysis, consider a farmer in each county c and time period t choosing a level of investment I ct and protection P ct to maximize profits. The farmer produces output F (I ct , q ct ), where q ct denotes land quality. F (·, ·) is increasing in both arguments and F 12 (·, ·) > 0. Following Besley (1995) , a fraction of output is lost in each period, τ (P ct ) ∈ [0, 1], and it is decreasing in the level of protection, τ (P ct ) < 0. Investment and protection are each produced at some cost, C ct (I ct ) and C ct (P ct ). Thus, farmers choose I ct and P ct to maximize:\nAn optimal interior solution satisfies two first-order constraints:\nIn equation (2), the marginal cost of investment is set equal to the marginal return that the farmer expects to retain. In equation (3), the marginal cost of protection is set equal to the marginal increase in retained total output. These equations generate three relationships of interest. First, the optimal choice of investment is increasing in the level of protection because a greater proportion of the marginal return would be kept. Second, the optimal choice of protection is increasing in the level of investment because total output is greater.\nThird, higher land quality directly increases both investment and protection by raising the marginal return to investment and total output. The empirical identification problem is that an observed correlation between I ct and P ct could reflect more than one of these three effects.\nThe effect of a change in the marginal cost of protection, however, can be informative about the direct effect of protection on investment. Equation (2) defines the optimal choice of investment, I * ct (P * ct , q ct ), and inserting that function into equation (3) defines the optimal choice of protection, P * ct (q ct , C ct (P * ct )). Denoting C p as the marginal cost of protection, it follows that\n; that is, the effect on investment from a change in protection cost equals the direct effect of protection on investment, multiplied by the effect on protection from a change in protection cost. Because protection can be assumed to decrease in its cost (\nis informative about the sign of ∂I * ∂P * . If investment increases when the marginal cost of protection falls, this implies that greater protection directly increases investment."}, {"section_title": "19", "text": "To model the effect of barbed wire, assume that protection is provided by building fences with timber and barbed wire, P ct = P (T ct , B ct ). The price of barbed wire (p \nIf timber is used initially and it is not a perfect complement to barbed wire, a decrease in the price of barbed wire that results in its use would decrease the marginal cost of protection more in counties with less woodland and higher timber prices, i.e.,\nOnce the price of barbed wire declines sufficiently that timber is no longer used, further price declines have no differential effect across counties with different woodland levels.\n20 Thus, barbed wire especially reduces the cost of protection in timber-scarce areas during the period from its widespread introduction until its universal adoption . If protection directly encourages investment, then investment should increase during this time period and especially in timber-scarce areas.\n19 The marginal cost of protection can be thought of as an instrumental variable, where estimating dI * dCp is the \"reduced form.\" Without data on protection levels, it is not possible to estimate the \"first-stage\" term ∂P * ∂Cp and ultimately recover ∂I * ∂P * . Still, the magnitude of the reduced form reflects the importance of that particular decrease in protection costs for increasing investment.\n20 This represents a corner solution to equation (4)."}, {"section_title": "IV. Data and Summary Statistics IV.A. Data Construction", "text": "County-level data are drawn from the US Census of Agriculture (Gutmann 2005; Haines 2005 ). The sample is restricted to counties in Plains states (Iowa, Kansas, Nebraska, Minnesota, Texas, and Colorado) for which data are available in each decennial census from 1870\nto 1920: data are first available in 1870 and land improvement data are available through 1920. Some county boundaries changed over this period, so the data are adjusted to hold the 1870 geographical units constant."}, {"section_title": "21", "text": "A natural measure of local woodland would be the number of acres of woodland in a county, divided by the total area of the county. 22 This measure is unavailable, but data are available on the number of acres of woodland in farms. The amount of woodland in farms may reasonably reflect the total woodland in the county, given that woodland was particularly valuable on the frontier and acquired first (Bogue 1963b , p.6, Webb 1931 Davis 1973, p.125 ).\nLocal woodland is defined to be the number of acres of woodland in farms in 1880, divided by the total area of the county (in acres). 23 One indication that this is a reasonable measure is its correlation with the fraction of the county area mapped as forest vegetation in the 1924 Atlas of Agriculture (USDA 1924). After digitally overlaying the Atlas with county 21 Using historical US county boundary files (Carville et al. 1999) , county borders in later decades are intersected with county borders in 1870 using ArcView GIS software. When later counties fall within more than one 1870 county, data for each piece are calculated by multiplying the later county data by the share of its area in the 1870 county. For those later periods, each 1870 county is then assigned the sum of all pieces falling within its area. This procedure assumes that data are evenly distributed across county area, though for 85% of counties in later periods less than 1% of their area overlaps with a second 1870 county. The sum is left missing when data for any piece is missing. After adjustment, counties are dropped when their standard deviation in number of acres is greater than 50,000 (3% of the sample).\n22 Woodland in nearby counties could be included at some discount to reflect transportation costs, but historical accounts indicate that farmers traveled relatively short distances to cut rails for fences. Focusing on counties' own woodland provides a simple and transparent measure.\n23 Woodland data are used from 1880 when the most woodland might be included in farms, but before woodland stocks might be influenced by barbed wire. The empirical results are not sensitive to the date used to assign woodland levels. Plains agriculture did not typically involve clearing woodland for cultivation, as there was much open land and woodlands were a valuable asset. 24 Fitting a fourth-degree polynomial to the data: counties with 0%\nwoodland pay 56 cents (standard error of 21 cents) more than counties with 6% woodland, while counties with 6% woodland pay a statistically insignificant 23 cents (19 cents) less than counties with 12% woodland. By contrast, Figure IIb shows that barbed wire fencing costs are not systematically related to local woodland. 24 Primack (1977, p.70 ) describes an increasing difficulty in adjusting wooden fence types to conserve timber. This convex relationship may also reflect distance to the nearest wood plot falling at a decreasing rate as wooded areas are scattered throughout a county.\n25 Substantial quantities of rail and wire fencing are reported in later years, but differences in per unit costs cannot be inferred. Data on fence posts, pine, and native lumber are only available in 1879-1880, and show a similar convex relationship to local woodland. Plain wire sells at roughly a 10-15 cent discount to barbed wire and its price is not related to local woodland, though it is often reported to be in little use.\n26 The estimates therefore reflect changes in the eastern Plains, and may not extrapolate to western Plains regions in which agricultural production faces somewhat different environmental and technological factors. As shorthand, the text simply refers to this eastern Plains sample region as the Plains.\nThe empirical analysis focuses initially on three land-use outcomes: the fraction of county land in farms, the fraction of county land that is improved, and the fraction of land in farms that is improved. The fraction of county land in farms represents the extensive margin of settlement, which reflects farmers' expected returns to converting land from the public domain.\n27 The fraction of farmland improved represents the intensive margin, which reflects farmers' willingness to fix investments in land. Note that improved land could be plowed for crops or otherwise prepared for livestock, but the definition appears to exclude land that is simply fenced. "}, {"section_title": "IV.B. Summary Statistics", "text": "Average local woodland among sample counties is 10%, but most counties have lower woodland levels: 39% have 0-4% woodland, 15% have 4-8% woodland, 11% have 8-12% woodland, and 35% have more than 12% woodland. Three corresponding benchmarks (0%, 6%, 12%)\n27 Land in farms \"describes the number of acres of land devoted to considerable nurseries, orchards and market-gardens, which are owned by separate parties, which are cultivated for pecuniary profit, and employ as much as the labor of one able-bodied workman during the year. To be included are wood-lots, sheeppastures, and cleared land used for grazing, grass or tillage, or lying fallow. Those lands not included in this variable are cabbage and potato patches, family vegetable-gardens, ornamental lawns, irreclaimable marshes, and considerable bodies of water\" (Gutmann 2005) .\n28 Improved land is \"all land regularly tilled or mowed, land in pasture which has been cleared or tilled, land lying fallow, land in nurseries, gardens, vineyards, and orchards, and land occupied by farm buildings\" (Gutmann 2005) .\n29 Land-use measures were reported for the Census year and productivity is imputed from production and acreage in the previous year.\nare informative: 20% of the sample has less than 1% woodland; the median woodland level is 6%; and 12% is among the higher typical levels of woodland. Table II reports average county characteristics in 1880 for all sample counties and within the three woodland categories. Prior to barbed wire's introduction, low-woodland counties were less settled, less improved, and a lower share of farmland was improved. A lower share of farmland was used for crops, and cropland was allocated less to corn and more to hay.\nWhile low-woodland counties were larger, the total value of land was lower.\nTotal fencing expenditures were lower in low-woodland counties, somewhat lower per farm acre, and roughly similar per dollar of output.\n30 Given higher per unit costs in lowwoodland areas, this suggests a lower intensity of fencing in those areas. Medium-woodland county averages generally fell between those for low-woodland and high-woodland counties, and were more similar to high-woodland counties."}, {"section_title": "V. Measurement Framework V.A. Estimation Setup: A Discrete Example", "text": "The estimation strategy is illustrated in a discrete example with two county types (c ∈ L, M ) and two time periods (t ∈ 1, 2). Farmers in county type L (low-woodland) have a high timber price p \n30 Data on fencing expenditures was only collected in 1880.\nFor this estimate to be unbiased, farmers' production decisions must depend additively on unobserved factors. Following the notation from Section III, production outcome Y in county c and time t is a function of land protection P and other characteristics q. This general function Y * ct (P * ct , q ct ) is assumed to be a function of land protection only and then separate unobserved factors:\nwhere γ t is a time effect, µ c is a county effect, and ct is a random error term. For example, consider Y ct to be the fraction of farmland improved in county c and time t. The identifying assumption is that the fraction of farmland improved in each county would change the same, apart from any change due to increased land protection in the low-woodland county after barbed wire's introduction.\nIt is impossible to test this identification assumption directly, but additional time periods and greater variation in county types can be used to form indirect tests. First, the same estimator for two periods before the introduction of barbed wire tests whether these county types had been trending similarly. Second, the same estimator for two periods after the universal adoption of barbed wire tests for other sources of differences, given that further price declines would not have differential effects across county types. Any differential trends before barbed wire's introduction or after its universal adoption may or may not have occurred between those periods, but the results can be tested for robustness to each scenario.\nA third specification test exploits the potentially non-linear relationship between local wooden fencing costs and local woodland. If a third county type H (high-woodland) has a low timber price p T L that is much closer to p T M than was p T H , then an estimate from equation (5) should be greater than the same estimate comparing medium-and high-woodland counties.\nThis test is given by the difference-in-difference-in-difference estimator:\nThe intuition for this empirical approach can be seen in a plot of the average share of farmland improved, by county woodland group and decade. Figure IV shows that mediumand high-woodland counties changed similarly over the entire 1870 to 1920 period. Lowwoodland counties also changed similarly, except for large relative increases from barbed wire's introduction until its universal adoption . This analysis of woodland categories is intended only to illustrate the intuition for the methodology, whereas the later empirical analysis examines continuous variation in woodland levels and includes controls for other potential changes."}, {"section_title": "V.B. Main Estimating Equation", "text": "For the main empirical analysis, county-level outcomes are first-differenced to control for any county characteristics that are constant over time. State-by-decade fixed effects α st are included to control for state-specific shocks that have an equal effect on all counties in the state. To allow flexibly for changes over time to be correlated with county woodland levels, included for each decade is a fourth-degree polynomial function of a county's 1880 local woodland level. The baseline estimated equation is:\nThe estimated β's are allowed to vary in each decade, and summarize how changes over each decade in county outcome Y vary by county woodland level W . The regression is estimated on a pooled sample of all decadal changes from 1870 to 1920."}, {"section_title": "31", "text": "31 The estimated coefficients are identical when the sample is restricted to changes over any one decade, because the coefficients on each variable are allowed to vary over each decade. As in the case of two time periods, estimating equation (8) in first-differences or with county fixed effects yields the same estimated changes."}, {"section_title": "VI. Estimation Results", "text": ""}, {"section_title": "VI.A. Land Improvement and Land Settlement", "text": "Equation (8) is estimated for the fraction of farmland improved in each county. The full set of estimated β's is difficult to interpret numerically, but the results can be seen in Figure   V .\n32 The solid line reports the estimated change over the indicated time period for a county with that woodland level, relative to the estimated change for a county with 0% woodland."}, {"section_title": "33", "text": "The two dashed lines report 95% confidence intervals around the estimates.\nFrom 1880 to 1890 and 1890 to 1900, counties with the least woodland made large relative gains in the improvement intensity of farmland. By contrast, there were no substantial relative changes at low woodland levels before 1880, after 1900, or at higher woodland levels from 1880 to 1900.\nTo display and interpret these results numerically, the estimated changes are evaluated at representative woodland levels: the most affected low-woodland county, with 0% woodland; the average medium-woodland county, with 6% woodland; and the least affected highwoodland county, with 12% woodland. The predicted change for a county with 0% woodland relative to the predicted change for a county with 6% woodland is analagous to a differencein-difference estimate for counties with those exact woodland levels, but the parameterized regression uses available data from counties with similar woodland levels."}, {"section_title": "34", "text": "Columns (1) and (2) of Table III 32 For conciseness, the displayed results are limited to woodland levels less than 0.12 or 12%, though equation (8) is estimated for the entire distribution of woodland levels.\n33 Due to the inclusion of state-decade fixed effects, the estimated results are only interpretable relative to some defined benchmark woodland level.\n34 These evaluated estimates are not sensitive to the fourth-degree polynomial functional form, as long as the functional form is sufficiently flexible to capture the basic non-linearity in Figure V. percentage points more in a county with 0% woodland than in a county with 6% woodland."}, {"section_title": "35", "text": "From the same regression, column (2) reports the predicted change for a county with 6% woodland relative to a county with 12% woodland. In parentheses is the standard error for each coefficient, corrected for heteroskedasticity and clustered at the county level. In brackets is the t-statistic of the absolute difference between the coefficients comparing 0% vs. 6% and 6% vs. 12%. For example, the coefficients in the first row of columns (1) and (2) are not statistically different with a t-statistic of 0.22.\nThe first main result is that, from 1880 to 1900, the improvement intensity of farmland increased by a statistically significant and substantial 19 percentage points in counties with 0% woodland relative to counties with 6% woodland (Table III, column (1)). By contrast, there are not substantial changes before 1880, after 1900, or between higher woodland levels from 1880 to 1900. This result is clear in Figure VI , which plots the estimated cumulative changes after 1870.\nThe increase in the improvement intensity of farmland came despite substantial expansion along the extensive margin of total settlement, which removed land from the public domain. Table III report the results from estimating equation (8) for the fraction of county land in farms. In these baseline estimates, settlement increased by 26 percentage points from 1880 to 1900 in counties with 0% woodland relative to counties with 6% woodland. There were also some relative increases from 1870 to 1880, and from 1880 to 1900 counties with 6% woodland made relative gains on counties with 12% woodland."}, {"section_title": "Columns (3) and (4) of", "text": "Combining changes in both intensive and extensive margins, columns (5) and (6) of Table   III report estimated changes in the fraction of all county land that is improved. Total land improvement increased by 29 percentage points from 1880 to 1900, reversing a negative trend from 1870 to 1880 in counties with 0% woodland relative to counties with 6% woodland.\nTable IV presents the robustness of the baseline results to including control variables for other potential changes in agricultural development. Also, to account for potential spatial correlation among counties, Conley standard errors are estimated (Conley 1999) .\n36 Overall, the estimated changes in land improvement are robust to these alternative specifications, while the changes in land settlement are less robust.\nColumn (1) of Table IV Because counties with less woodland tend to be further West, a concern is that baseline estimates could be confounded with an independent push toward increased westward development, changes in land policies, 37 reduced armed conflict with Native Americans, 38 or other factors. Column (2) includes controls for the distance West of each county centroid, interacted with each decade. Column (3) also controls for distance from St. Louis (\"Gateway to the West\") interacted with each decade, to allow for expansion out from the middle of the country. The results are similar when including higher-order polynomial distance measures, with and without including Colorado and Texas.\nCounties with different woodland levels may be suited to different agricultural products, so changes in prices and technologies may contribute to differential development over this time period. 39 To explore the robustness of the results to these types of factors, county data was merged with traced land resource regions and subregions, and great soil groups."}, {"section_title": "40", "text": "36 Spatial correlation among counties is assumed to be declining linearly up to a distance of 100 miles and zero after 100 miles (the shortest distance between the most-wooded and least-wooded counties in Kansas).\n37 Libecap (2007) reviews changing US land policy, highlighted by the 1862 Homestead Act and small subsequent revisions in 1904, 1912, and 1916 . 38 Hess and Weidenmier record individual armed conflicts with Native Americans: 14 events from 1866 to 1869, 69 events in the 1870s, 13 events from 1880 to 1883, and 1 event in 1890. The last recorded conflict in the sample states, outside of Texas, was in 1876. I thank the authors for providing their data.\n39 Regarding technological change in agriculture, there are not obvious relative advances for low-woodland areas during the particular 1880 to 1900 period (Rasmussen 1962 , Primack 1977 , Olmstead and Rhode 2002 . Changes in local wood prices would have differential effects, though the timber market in all sample counties was a small sector: in 1870, forest products averaged 0.6% of the total value of all farm products.\n40 Land resource regions and subregions were mapped in the 1966 U.S. Department of Agriculture Handbook 296. Soil groups were mapped by the U.S. Soil Conservation Service in 1951 and were retained in the National Archives Record Group 114, item 148. These maps were scanned, traced in GIS software, and Within the sample of counties, there are 11 regions, 43 subregions, and 19 soil groups. To allow for differential growth patterns, equation (8) is estimated with a quadratic time trend for each of the 11 regions (column (4)), 43 subregions (column (5)), or 19 soil groups (column (6))."}, {"section_title": "41", "text": "The baseline estimates may also be confounded with convergence in agricultural development, whereby counties with lower initial levels of land improvement or settlement may have otherwise experienced higher subsequent growth. Counties with less woodland were initially less developed along each measure, though there were only small relative increases from 1870 to 1880 when initial differences were greatest. Column (7) controls for an additional fourth-degree polynomial function of the county's fixed 1870 outcome level, interacted with each decade. This effectively focuses the analysis on counties with different woodland levels but similar outcome levels in 1870."}, {"section_title": "42", "text": "One particular source of convergence may have been an expansion of the railroad network into previously less-developed and lower-woodland areas. Counties' railroad track mileage was calculated by merging county borders with railroad network maps, by decade from 1870 to 1920.\n43 Total track increased in sample counties from 6k miles (1870) to 19k (1880), 30k\n(1890), 32k (1900), 38k (1910 and 1920) .\nRailroad expansion after 1880 was mainly on the intensive margin: in 1870, 50% of sample counties had some railroad track and this increased to 89% (1880), 95% (1890), 97% (1900), digitally merged to 1870 county boundaries. Separate variables are defined for the fraction of each county area falling into each region, subregion, or soil group. 41 Because equation (8) is in changes, the first-differenced analog of a quadratic time trend is included: the fraction of the county in that region, and the fraction multiplied by 3 in 1880, 5 in 1890, 7 in 1900, 9 in 1910, 11 in 1920. 42 Pre-barbed wire land-use is endogenously determined, so counties with similar land-use outcomes and different amounts of woodland might be expected to differ along other important dimensions for farmers to be compensated for the lack of woodland. Also, if low initial outcome counties converge due to barbed wire's introduction, this specification will suffer from over-controlling bias. 99% (1910 and 1920) . The construction of railroad spur lines may be endogenous and a channel through which barbed wire affected development. Aside from potentially following agricultural development, railroads were often required to fence-out cattle from tracks and, as lines pushed into less-wooded areas, lumber became more expensive and was sometimes stolen by settlers (McCallum and McCallum 1965, pp.196-201) .\n44 While potentially inducing over-controlling bias, column (7) presents the baseline results when controlling for changes in county railroad track mileage. The results are similar when controlling for a fourth-degree polynomial in railroad mileage, or whether a county has any railroad track."}, {"section_title": "45", "text": "Overall, Table IV shows that the estimated increases in land improvement are robust, while increases in land settlement are less robust to some specifications. Adjusting for spatial correlation increases the standard errors, but the estimates generally remain statistically significant. The remainder of the analysis presents standard errors that are simply clustered at the county level.\nIn contrast to the above estimates, herd laws appear to have been of little benefit. Nebraska adopted a state-wide herd law in 1871 that was intended to make livestock owners liable for damage to farmers' unfenced crops, which had the potential to benefit farmers more in counties with the least woodland (Davis 1973 , Kawashima 1994 (8) for county track mileage, there were few systematic changes aside from that a county with 0% woodland experienced a 12.5 (5.0) mile increase from 1880 to 1890 relative to a county with 6% woodland.\n45 Railroad network expansion may also have a differential effect on areas that had different access to major riverways; note that one of the soil groups (column (6)) effectively captures the presence of a major river.\n46 These coefficients (and standard errors in parentheses) are from estimating equation (8) for Nebraska only.\ndeclined by 24 (9) percentage points from 1870 to 1880, and increased by 18 (7) and 8 (5) percentage points from 1880 to 1890 and 1890 to 1900.\nKansas gave counties the option of adopting a herd law, beginning in 1872. Counties' adoption decisions are analyzed by Sanchez and Nugent (2000) , and this endogenous decision complicates an analysis of the law's effects. Nearly all herd law counties have less woodland than non-herd law counties, so it is not practical to estimate whether the herd law had a greater effect in counties with less woodland.\nHowever, based on which counties had adopted the herd law by 1880, it is possible to compute difference-in-difference estimates of the change in each land-use outcome for herd law counties relative to non-herd law counties.\n47 Herd law counties had an insignificant 6 (7) percentage point decline in the improved fraction of farmland from 1870 to 1880; it was not until after barbed wire's introduction that they experienced a 20 (3) Kansas then adopted a state-wide herd law in 1889, which did not lead to relative increases for non-herd law counties. The state-wide law also did not benefit counties with the least woodland: the improved fraction of farmland declined by 9 (5) percentage points from 1890 to 1900, while settlement and total land improvement were little changed. Farmers made substantial investments in fencing before the legal reforms, after the legal reforms, and after the introduction of barbed wire. These laws may have had some small influence or they might not have been so hotly debated. In the absence of physical barriers, however, formal laws appear to have provided farmers little refuge from roaming livestock.\n47 Kansas State Board of Agriculture Reports indicate adoption and provide quick comments on the political situation and hypothesized effects in 1876, 1877-1878, and 1879-1880; yes/no information on adoption in 1881-1882 and 1883-1884; and no information in 1885-1886 . This is consistent with the earlier hypothesis that barbed wire defused these political debates."}, {"section_title": "VI.B. Crop Productivity and Crop Choice", "text": "Barbed wire's introduction may also lead farmers to adjust crop production. When liability for damage can be traded, Coase (1960) discusses how the optimal allocation of land could favor crops or livestock. However, without the ability to protect land physically or contractually, the returns to certain crops may be particularly sensitive to the threat of uncompensated damage by others' livestock. Farmers could reduce crop acreage or, if they continue to grow crops without fencing, reduce investment in cropland, harvest crops earlier, or otherwise adjust production in ways that lower productivity.\nCounty-level data are available on the total production and acreage for each of the six main crops on the Plains (corn, wheat, hay, oats, barley, rye), by decade and beginning in"}, {"section_title": "1880.", "text": "48 Productivity for each crop p in each county c is defined as its total production per acre harvested. To assist in interpreting the results, productivity in each decade is normalized by its value in 1880."}, {"section_title": "49", "text": "For the empirical estimation, equation (8) is slightly modified. To control for regional changes in crop productivity, state-decade fixed effects are replaced with crop-state-decade fixed effects. The equation is first-differenced by crop-county, to control for constant differences in crop productivity across counties. Data on all crops are pooled in the baseline analysis, which constrains the change in productivity across woodland levels to be the same for all crops:\nColumns (1) and (2) of Table V present baseline results. From 1880 to 1890, average productivity across all six crops increased 23.4% more in a county with 0% woodland than 48 Cotton is excluded from the analysis, as data are only available for Texas and the boll weevil blight severely impacted cotton productivity. Using the same technique as before, data are adjusted to maintain 1880 geographical boundaries.\n49 The upper and lower centiles of the normalized productivity distribution are dropped: those less than 0.36 or greater than 6.4. The results are not sensitive to these cutoffs, as long as the clearly extreme observations are dropped.\nin a county with 6% woodland.\n50 By comparison, US crop yields and total crop production increased annually by 0.23% and 1.7% from 1880 to 1920. 51 Crop productivity decreased by 4.6% from 1890 to 1900, leaving it 18.8% higher than in 1880.\nConsistent with cropland becoming more productive, an increasing share of farmland became allocated to crops. From estimating equation (8), the fraction of farmland allocated to cropland increased by 12 percentage points from 1880 to 1890 in a county with 0%\nwoodland relative to a county with 6% woodland (Table V, column (3)). As in the case of crop productivity, there was little change from 1890 to 1900.\nAn extension of the results uses crop-level differences in vulnerability to livestock damage.\nWhile cattle eat hay (various grasses), hay is more resistant to livestock damage before being harvested. Hay fields can even be intended for grazing at certain times of the year.\nThe other crops (corn, wheat, oats, barley, rye) would yield substantially less grain if they were trampled, so it would be more important to protect them from others' livestock."}, {"section_title": "52", "text": "Restricting the analysis to these five crops more at-risk of damage, productivity increased by 29% in counties with the least woodland (columns (5) and (6), Table V) . By contrast, hay productivity was unchanged from 1880 to 1890. From estimating equation (8) for the fraction of cropland allocated to more at-risk crops, columns (7) and (8) report that more cropland became allocated to more at-risk crops from 1880 to 1890.\nIn interpreting the results, changes in productivity for a given plot of land may be confounded by productivity differences for new lands coming under cultivation. Newly cultivated lands on the Plains may be especially productive due to stored soil nutrients. Parton et al. (2005) estimate that this productivity advantage mostly dissipates over 20-30 years; note 50 The results are similar when weighting by crop acreages in 1880. 51 These numbers are estimated using indexes of total US crop production and yield per acre harvested for twelve major crops (NBER Macrohistory Database, files a01005aa and a01297). The production index is computed by weighting the production of each commodity by average farm prices from [1910] [1911] [1912] [1913] [1914] . To obtain the average annual increase, the natural log of each index is regressed on a time trend from 1880 to 1920.\n52 Grazing these crops would require close management of timing and intensity, and even then would substantially lower grain yields (Smith et al. 2004 ). The Census defines data for these crops as that which is grown for grain, rather than grazed or grown for hay.\nthat productivity gains from 1880 to 1890 are mostly persistent over the next 30 years.\nPermanent composition effects could appear if less-wooded areas of counties were inherently more productive. However, very little land in farms was wooded: in 1880, less than 6% of the land in farms was wooded in 76% of the counties with less than 6% woodland. Furthermore, it may be that cheaper fencing encouraged the expansion of production into otherwise unprofitable and lower quality lands within a county, which would cause the estimates to understate the increase in productivity for a given plot of land.\nA limitation of decadal census data is that crop production is sensitive to weather and other short-term shocks, so productivity in Census years may not be representative. Evidence on the representativeness of Census years is mixed, based on annual county-level data from Kansas for the productivity of corn, wheat, and oats (Parker et al. 2000) . For wheat, 0% woodland counties were unusually unproductive in 1879 relative to 6% woodland counties. By contrast, corn productivity differences in Census production years were similar to average non-Census years.\n53 These data caution that Census years may happen to give an inaccurate picture of typical changes in productivity. This highlights the advantage of comparing productivity changes for at-risk crops and hay, which implicitly includes countyyear fixed effects. Additionally, the estimates in Table V are robust to the distance, region, subregion, and soil group specifications reported in Table IV . These additional controls may absorb changes in technology, weather, or other factors."}, {"section_title": "54", "text": "Overall, it appears that farmers secured, improved, and expanded crop production from 1880 to 1890. If after 1890 farmers no longer cultivated substantial lands without fences, then crop productivity would not be expected to increase further.\n53 Census data in 1880 reports production data from 1879. Oats were less commonly grown, but estimates are more similar to wheat than corn: 1879 was fairly unproductive, 1880 was fairly productive, and later Census years were similar to non-Census years.\n54 When analyzing productivity, the additional controls are interacted with each crop. and 17% of the total in low-, medium-, and high-woodland counties; in 1879, the cost of building and repairing fences was 1% of the total value."}, {"section_title": "VI.C. Land Value", "text": "Equation (8) Land values increased substantially from 1880 to 1890 in counties with 0% woodland, relative to counties with 6% woodland. Land values continued to increase from 1890 to 1900, but not statistically more than the relative increase at higher woodland levels. Before 1880 or after 1900, by contrast, there were either relative declines or small changes.\nFocusing on the increase from 1880 to 1890, this represents an economically substantial increase of 50% above 1880 levels. This is 1.7 times the 1880 value of all agricultural products in low-woodland counties. Assuming that barbed wire had no effect on counties with more than 6% woodland, the estimated total benefit to farmers is $103 million (1880 US dollars)\n55 Farmers may have partly anticipated the arrival of barbed wire by the 1880 Census, though unsettled land would still be valued at zero. 56 The specification controls for a fourth-degree polynomial function of the 1870 log land value, interacted with each decade. Without these additional controls, the estimates fit a clear pattern of economic convergence for both low-and medium-woodland counties: there are large relative increases from 1870 to 1880 that then decline over time. The estimated increase in land value understates the total value of barbed wire if counties with more than 6% woodland also benefited (or non-sample counties). This number overstates the total value to the extent that farmers' investment costs became capitalized into land values. As a check on the results, an upper bound on the value of barbed wire is the total saved fence construction costs, which is estimated to be $767 million. 58 If fencing demand declines linearly, then an implied tighter upper bound on farmer surplus is half this amount."}, {"section_title": "VII. Interpretation", "text": "Barbed wire appears to have had a substantial impact on US agricultural development, as seen in the relative development of low-woodland areas from 1880 to 1900. Given the simple nature of the innovation, the estimated magnitudes are remarkable and reflect the substantial cost of fencing before 1880.\nBarbed wire was particularly important in this historical context, due to timber scarcities and the importance of fencing. Farmers had secure legal title to land, but had to pay high fencing costs to receive protection from damage by others' livestock. Farmers had lobbied for legal reforms to states' fencing requirements, but effective protection came about only with the introduction of barbed wire. Legal title was not affected; rather, the ability to exclude others' livestock became part of farmers' bundle of property rights over land."}, {"section_title": "59", "text": "57 This total is calculated as follows. Sixty-four counties had between 0% and 1% woodland, with an average of 0.42% woodland and $1.7 million of land value in 1880. For an average county with 0.42% woodland, land values increased by an estimated 43% relative to a county with 6% woodland. This gives an overall effect of approximately $47 million (64 × $1.7m × 43%). Summing across the woodland bins (1-2%, 2-3%, 3-4%, 4-5%, 5-6%) yields an estimate of $103 million with a standard error of $32 million.\n58 This is found by multiplying the difference in cost between wooden and barbed wire fences (roughly $1 per rod) by the total amount of barbed wire built by 1900 in the Prairie and Southwest (roughly 767 rods). If land values increased by more, then farmers should have been willing to construct these fences prior to barbed wire's introduction.\n59 Property rights often vary beyond whether ownership is secure: rights may not include the ability to sell, rent, mortgage, pledge, bequeath, or gift land (Besley 1995) ; land ownership may be contingent on not Barbed wire may also have been influential as a general improvement in agricultural technology. Cheaper fencing benefits even an isolated farm by providing greater control over a farmer's own cattle. This allows the production of cattle and crops in close proximity, and increases cattle productivity through improvements in feeding and breeding. This would be particularly beneficial if nearby lands varied substantially in their suitability for cattle and crops.\n60 However, empirical estimates suggest that barbed wire did not increase cattle production and decreased the joint production of cattle and crops. These findings suggest that barbed wire had relatively small technological benefits for an isolated farm.\nTo examine changes in cattle production, equation (8) is estimated for the number of cattle per five county acres. 61 A cow required roughly five acres to graze in this region, so the estimated magnitudes can be compared to estimated changes in settlement and land improvement. Columns (1) and (2) of Table VII present the results. From 1880 to 1890, there was no substantial increase in cattle production for a county with 0% woodland relative to a county with 6% woodland. By contrast, cattle production increased moderately in all subsequent periods and at higher woodland levels from 1880 to 1890.\nTo examine changes in the joint production of cattle and crops, an index is defined that captures the degree to which counties are specialized in crop production. 62 The index is the squared difference between the fraction of county farmland devoted to crops and the average over all counties in that decade and state:\nThe index increases when a county with above-average crop intensity increases crop production, and vice versa. Changes in this index are estimated using equation (8), which controls for average county deviations leaving it fallow (Goldstein and Udry 2008) ; others may have the right to kill and eat animals on your land, but not keep the fur (Demsetz 1967) . In addition, these rights only exist to the extent that they are enforced and not simply allocated. 60 To avoid encroachment and operate more in isolation, there was an incentive to expand farms prior to barbed wire's introduction. These farms would still have neighbors, however, and farm scale may have been restricted by inferior fencing or monitoring options. Estimating equation (8) for log average farm size, there are not systematic changes by woodland levels, apart from an increase in average farm sizes at low-woodland levels from 1890 to 1900.\n61 Data on cattle are first available in 1880, so county regions are held constant at their 1880 boundaries. 62 Pasture land is not directly observed, and per cow acreage requirements vary with the environment, production methods, and desired sustainability.\nfrom the mean and state-by-decade shocks. Columns (3) and (4) of Table VII present the results. From 1880 to 1890, counties with 0% woodland became increasingly specialized by half a standard deviation, relative to counties with 6% woodland."}, {"section_title": "63", "text": "Barbed wire may affect cattle production and county specialization through multiple channels, but these results suggest that barbed wire's effects are not simply the direct technological benefits that would be expected for an isolated farm. On the contrary, it appears that barbed wire affected agricultural development largely by reducing the threat of encroachment by others' cattle."}, {"section_title": "VIII. Conclusion", "text": "There is growing evidence from current developing countries that insecure property rights may limit economic development. Complementing that literature, the historical development of American agriculture appears to have been limited when farmers were unable to protect frontier lands from encroachment by others' cattle. In the United States, this institutional failure was resolved not by legal reform but by technological change: the introduction of barbed wire fencing.\nFollowing the introduction of barbed wire, low-woodland areas that had been especially costly to fence experienced substantial relative increases in agricultural development. Increases along intensive margins were particularly rapid and substantial: land improvement, crop production, and crop productivity. Land values increased substantially, indicating a large increase in total economic production. These results suggest that land protection has an important role in facilitating agricultural development. Indeed, rather than being a unique feature of some modern developing countries, that this also occurred on the American frontier suggests that it may be a more universal characteristic of economic development."}, {"section_title": "HARVARD UNIVERSITY AND NATIONAL BUREAU OF ECONOMIC RESEARCH", "text": "63 Estimates are robust to the distance, region, subregion, and soil group specifications from Table IV. Notes: For the top panel, the sample is the same as in Figure III and Tables III and IV. For the bottom panel, the sample is the same as in Tables V and VII . Missing data for crop acreage is treated as a zero. Column (1) reports average county characteristics for the entire sample. Columns (2), (3), and (4) report average county characteristics for counties with the indicated amounts of local woodland (as defined in the notes to Figure III) . Standard deviations are reported in brackets. Column (4) (or Column (5)) reports the probability that the coefficients in columns (2) and (3) (or columns (3) and (4)) are the same, based on standard errors that are adjusted for heteroskedasticity. Notes: County-level data on per unit fencing costs are from the 1879-1880 Kansas State Board of Agriculture Report. \"Woodland Fraction\" is defined based on Census data: the number of acres of woodland in farms in 1880, divided by the total area of the county (in acres). This measure of local woodland is shown in Figure III , and used throughout the analysis. Notes: Based on the estimates reported in Table III (columns (1) and (2)), the solid circles represent the estimated cumulative change after 1870 in acres of improved land per farm acre for a county with 0% woodland relative to a county with 6% woodland. The hollow circles represent the estimated cumulative change after 1870 for a county with 6% woodland relative to a county with 12% woodland. Two vertical dotted lines represent the approximate date of barbed wire's introduction (1880) and its universal adoption (1900)."}]