[{"section_title": "Abstract", "text": "Background: This study aimed to identify motivation and home influence factors that predict reading literacy achievement of grade 4 students in Abu Dhabi It drew on the Progress in International Reading Literacy Study (PIRLS) 2011 data, which placed Abu Dhabi students' results substantially below the international benchmark of 500.\nMethods: Selected items from the PIRLS 2011 student and home questionnaires were analyzed in a regression model fitted using the IEA International Database (IDB) Analyzer software (version 4.0.20) to determine the effects of student intrinsic and extrinsic reading motivation, reading self-efficacy, and home literacy environment on reading achievement.\nResults from multiple regression analyses showed that student's reading self-efficacy was the strongest predictor of student reading achievement, while a number of home context variables made significant and independent contributions. However, two variables that are widely claimed as key to the success of reading development and achievement, intrinsic reading motivation and parent involvement in learning, were shown to have either no or negative association with student reading achievement.\nThe findings affirm the important contributions of student self-efficacy, extrinsic motivation, and home literacy environment to the reading achievement of Abu Dhabi's 4th graders, which supports the design of a comprehensive and enabling literacy promotion strategy and program that integrates individualreaders, the school, and home literacy environments. Possible explanations of the observed relationships between intrinsic reading motivation, parent involvement in learning, and reading comprehension in the context of Abu Dhabi was also discussed. "}, {"section_title": "Background", "text": "Recognizing the critical importance of reading literacy in children's early schooling, the United Arab Emirates (UAE) and the Emirate of Abu Dhabi extended their commitment to evidence driven educational reforms through participating in the Progress in International Reading Literacy Study (PIRLS) 2011, which is one of the most important largescale studies of literacy among young students around the world. The PIRLS 2011 results indicated that Abu Dhabi grade 4 students achieved a mean literacy score of 424, with two-thirds of them below the intermediate benchmark of 475. The low literacy achievement of young students in Abu Dhabi has become a great concern for educators and educational policy makers.\nThe PIRLS results of recent years also consistently show that children in Arab countries in general score below the global average (Mullis et al. 2012) . While this may provide support to a popular argument among some Arab researchers that the low reading achievement of Arab students could be attributed to the Arabic orthography and diglossia (Abu-Rabia 2000; Saiegh-Haddad 2005 , there has been increasing research unravelling the relationships between student motivation, family literacy environment, and reading comprehension (Becker et al. 2010; Guthrie and Wigfield 2000; Taboada et al. 2009; Wiescholek et al. 2018) . However, the latter stream of research has not been adequately conducted in the context of Arab countries where the learning of Arabic appears to be quite different from the learning of other languages. Furthermore, extant literature on the role of student reading motivation in literacy achievement is largely based on experiments that involve small samples of participants. Although a few studies have drawn on PIRLS data to explore the effects of motivation on reading achievement, it is not always clear how the sampling and assessment errors inherent in large-scale student assessments such as PIRLS are accounted for, the failure of which is likely to lead to inaccurate results.\nThis study aims to bridge the gaps in the literature through examining the effects of student motivation and family literacy environment on student reading achievement in an Arab country using large-scale student assessment data. Based on the PIRLS 2011 data, it is set to explore the contributions of student reading motivation, reading selfefficacy, and family literacy environment to reading achievement in the context of the Emirate of Abu Dhabi, controlling for student initial literacy levels and gender."}, {"section_title": "Literature review", "text": "Most studies on Arabic reading have focused on the Arabic orthography and diglossia and the cognitive reading processes of Arab students (Abu-Rabia 2000; Ibrahim 2009; Saiegh-Haddad 2005) . Orthographically, Arabic is highly homographic and dialectical marks are added to denote short vowels which influence the phonological structure and meaning of the word (Saiegh-Haddad and Henkin-Roitfarb 2014) . The diglossic nature of Arabic refers to the gaps between its spoken and written form, which differ substantially in vocabulary, grammar, and linguistic forms (AbuRabia 2000; Khamis-Dakwar et al. 2012; Saiegh-Haddad 2005) . A number of studies have shown that these orthographic and diglossic features of Arabic create certain difficulties in learning reading comprehension skills (Abdelhadi et al. 2011; Abu-Rabia 2000; . For example, through examining the reading of native Arabic-speaking children from grade 1 to grade 6, argue that reading development in Arabic is different from other languages. Arab students' poor Arabic reading achievement in terms of speed and accuracy has also been revealed by several researchers (AbuRabia 2002; Abu-Rabia and Taha 2006) .\nWhile the complexity of the orthography and diglossia of Arabic language may account for certain difficulties in reading acquisition in Arabic, limited research exists in Arab countries that explores the impact of some more generic predictors such as student's reading motivation and home contextual factors on reading performance. Reading is an interactive process that occurs between a reader, text, and the reading activity within a socio-cultural context (RAND Reading Study Group 2002) . Apart from cognitive factors, motivational and psychosocial factors, as well as the socio-cultural context, also tend to influence the process and the outcome of reading (Cartwright et al. 2016; Guthrie and Wigfield 2000; Wang and Guthrie 2004) .\nAccording to the self-determination theory, intrinsically motivated behaviors are derived from people's essential psychological needs to feel interesting, competent, autonomic, and connected (Deci and Ryan 2000; Ryan and Deci 2000a) . Intrinsic reading motivation is resulted from the interest and enjoyment associated with reading and is often considered the most important type of self-determined motivation (Guthrie and Wigfield 2000; Ryan and Deci 2000b; Schiefele et al. 2012) . Students who are intrinsically motivated to read are likely to have a high level engagement in reading, which leads to improved reading skill and better reading achievement (Becker et al. 2010; Cartwright et al. 2016; Froiland et al. 2012; Law 2008; Lepper et al. 2005; Taboada et al. 2009 ). De Naeghel et al. (2012 applied the self-determination theory to 1260 grade 5 students in Belgium and found that students' autonomous reading motivation was associated with higher reading frequency and better reading comprehension than controlled reading motivation. Across the relevant literature, a moderate, positive impact of intrinsic motivation on reading competence can be generally found (Schiefele et al. 2012) .\nExtrinsic motivation, on the other hand, comes from external source such as obtaining recognition or rewards from teachers, parents, and peers (Guthrie and Wigfield 2000; Schiefele et al. 2012) . It has different forms including external regulation, identification, and integrated regulation, varying according to the level of autonomy (Ryan and Deci 2000b) . As extrinsically motivated students have a tendency to concentrate on the reward and recognition associated with reading, their intrinsic interest in reading can be considerably diminished (Deci et al. 1999; Lepper et al. 2005) . Research has shown that high extrinsic motivation may lead to poorer reading skills and achievement (Wang and Guthrie 2004) . In their longitudinal study of German students, Becker et al. (2010) reported that students' intrinsic reading motivation in grade 4 was positively correlated to their reading literacy in grade 6, while children who scored high on extrinsic motivation read less and had poorer reading skills. Similar effects of intrinsic and extrinsic motivation were also reported by Schaffner and Schiefele (2016) in their study of grade 3 German students. Some researchers, however, have argued that extrinsic motivation could be beneficial when used to initially motivate students to read (Guthrie et al. 2007; Pierce et al. 2003) .\nSocial cognitive theory argues that intrinsic motivation also comes from a sense of selfefficacy that is acquired from rewards earned for accomplishing difficult tasks (Bandura 1986 ). Self-efficacy is a concept that explains how individuals feel about themselves, as well as the manner in which they motivate themselves (Bandura 1977) . Reading self-efficacy refers specifically to the degree of students' expectation about their own achievement of a reading task (Schiefele et al. 2012) . Research has indicated that students with high reading self-efficacy are typically active readers who tend to take on more challenging reading exercises and set and achieve higher goals than students with low selfefficacy (Schiefele et al. 2012) . To summarize, with no intention to underestimate the complexity of such relationships, there appear to be some positive and reinforcing relationships between intrinsic motivation, self-efficacy, and literacy achievement-intrinsic reading motivation leads to more engaged reading activities that help the student to become a better reader, and he/she is more likely to have a higher reading self-efficacy and better literacy achievement which in turn help the growth of reading motivation.\nThere has been a growing number of literature exploring how gender explains the association between reading motivation and reading achievement. However, research evidence so far is far from conclusive. While some researchers found that girls reported higher levels of interest in reading compared to boys (Logan and Johnston 2009; Sainsbury and Schagen 2004) , others reported no gender difference in children's reading interest (Baker and Scher 2002; Ozturk et al. 2016 ). Ozturk et al. 's (2016) study of 5 year old children and their parents in Australia not only rejected the gender difference in children's attitudes to literacy, but also found that gender did not moderate the relationships between parental factors and children's reading attitudes. Both Coddington and Guthrie (2009) and Logan and Johnston (2009) reported no association between attitude to reading and reading achievement for girls, while Fives (2016) revealed a positive association between attitudes to reading and reading achievement for girls but not for boys.\nThe relationship between student reading motivation and achievement is also likely to be influenced by ethnicity. To date, only limited studies on this were conducted mainly in the American educational contexts. Baker and Wigfield (1999) found that African American students tended to report higher reading self-efficacy and intrinsic reading motivation than European American students, for whom intrinsic reading motivation was a stronger predictor of reading achievement. Similarly, Unrau and Schlackman (2006) found that intrinsic motivation mattered more for Asian American students than for Latino American students in terms of reading achievement. Wang and Guthrie (2004) revealed, however, that for both American and Chinese students in their study intrinsic motivation had a positive relationship with reading comprehension and extrinsic motivation had a negative effect. Elsewhere, extrinsic motivation is believed to have a positive impact on the achievement of Chinese students due to the influence of the Confucian tradition (Lau and Lee 2008) .\nIn addition to student motivation and self-efficacy, analysts also suggest that a variety of teacher factors, family and home environment elements are the predictors of student's reading achievement (Hemmerechts et al. 2017; Meissel et al. 2016; Muñoz et al. 2013) . The family and home environment factors, in particular, tend to have the largest influence on children's literacy development (Hampden-Thompson et al. 2013) . A growing body of research illustrates that the quality of the family literacy context influences children's attitudes towards reading (Bracken and Fischel 2008; Frijters et al. 2000) .\nThe results of Wiescholek et al. 's (2018) study suggest that both passive home literacy environment including parent attitudes towards reading, provision of reading resources and active home literacy environment including literacy interaction between parents and child have an independent, significant impact on children's literacy enjoyment. Parents' attitudes towards reading and parental expectations are shown to contribute to the development of children's positive attitudes toward literacy (Baker and Scher 2002; Ozturk et al. 2016; Yeo et al. 2014) . Parents' reading proficiency is also correlated with the reading skills of their children (Silinkas et al. 2012) . The provision of reading materials at home is considered a core element of home literacy environment and has often been positively linked to the reading enjoyment and skills of children (Bracken and Fischel 2008; Frijters et al. 2000; Retelsdorf et al. 2011) . Sénéchal and LeFevre's (2002) 5-year longitudinal study of early home literacy experience also indicated that children's exposure to books was associated with the development of literacy skills.\nThe active home literacy environment reflected by parental involvement in reading and learning and other parent-child home literacy interactions is demonstrated to be associated with children's increased early literacy skills and reading achievement (Lin et al. 2011; Lonigan et al. 2000; Sénéchal and LeFevre 2002) . Parental involvement tends to make a big difference in reading especially during the early years (Froiland et al. 2014; Hemmerechts et al. 2017 ). Sénéchal's (2006) longitudinal study showed that grade 4 students whose parents taught them literacy in kindergarten exhibited a higher level of reading fluency and reported a higher level of engagement in reading. Using the PIRLS 2011 data, Araújo and Costa (2015) found that more frequent parents shared reading with their children at home prior to school entry improved student reading achievement across many European countries. In general, the social and cultural capital embedded in the family environment is likely to give children a head start in reading development (Burchinal et al. 2002) .\nVery limited work has been carried out in Arabic learning contexts to examine the influence of motivation and home literacy environment on student's literacy development. Jdaitawi et al. (2011) found that among the 6th graders in Jordan the main cause of motivation towards reading was the desire to increase the academic performance and grades at school, which was pushed for by their parents. Applying the Motivation for Reading Questionnaire (Baker and Wigfield 1999) to 574 students of 5th and 7th grade, Khudair and Abu Gazal (2016) showed that Jordanian parents' positive attitudes toward learning had a positive impact on children's motivation and use of higher thinking skills. Focusing on mother-child joint reading and writing activities in kindergartens in Israel, Aram et al. (2013) revealed that home literacy activities predicted Arabic-speaking children's literacy achievement later in 1st grade. While family socioeconomic status also positively correlated with children's literacy achievement, the authors suggested a common challenge in Arab families where the development of early literacy is hindered by the diglossic nature of Arabic. Zuzovsky's (2010) multilevel regression analyses showed that early home literacy activities that foster phonemic awareness and letter sound recognition were significantly associated with the achievement of Arabic-speaking pupils in Israel. However, in Zuzovsky's research (2010) the use of the mean of the five plausible values as the overall reading proficiency score is questionable and it is not clear how the sampling errors in PIRLS are accounted for.\nWhile the importance of having a reading parent to serve as a role model and building a reading culture at home was stressed (Al Kendari 2004) , in practice the active involvement of parents in their children's learning is not always evident in Arab countries. AlMahrooqi et al. (2016) noted that Omani parents' involvement in their children's English language studies remained limited despite their general awareness of the importance of their involvement. In the UAE, parents tend to heavily rely on school staff and teachers for their involvement, as they contend with the different responsibilities of parents, teachers and schools (Moussa-Inaty and De La Vega 2013). Using the Trends in International Mathematics and Science Study (TIMSS) data to compare student's academic self-concept across Western, Asian and Middle Eastern countries, Marsh et al. (2015) revealed some cross-cultural differences where predictions of relationships between math and science achievement and student self-concept were not fully supported by the data from Middle Eastern countries. Analysts also argued that in the UAE many female Emirati college students are not motivated to raise their academic achievements, as they are not under family pressure to work after graduation (Crabtree 2007) . While this argument is unlikely to be applied to the 4th graders, it points to the role of social and cultural norms in influencing student motivation and learning.\nBased on the above literature review, the following hypotheses were proposed:\nHypothesis 1 Intrinsic reading motivation of Abu Dhabi's fourth graders is positively associated with their reading literacy achievement.\nHypothesis 2 Extrinsic reading motivation of Abu Dhabi's fourth graders is negatively associated with their reading literacy achievement."}, {"section_title": "Hypothesis 3", "text": "Reading self-efficacy is positively associated with the reading literacy achievement of Abu Dhabi's fourth graders.\nHypothesis 4 Parent involvement in learning positively contributes to the reading literacy achievement of Abu Dhabi's fourth graders."}, {"section_title": "Hypothesis 5", "text": "The more time parents spent on reading at home, the higher the reading literacy achievement their children achieve."}, {"section_title": "Hypothesis 6", "text": "The more the number of books that a family has, the higher the reading literacy achievement their children achieve."}, {"section_title": "Hypothesis 7", "text": "The higher the expectation of parents of children's education, the higher the reading literacy achievement their children achieve."}, {"section_title": "Hypothesis 8", "text": "The gender difference in the reading literacy achievement is more evident among Arab children than among non-Arab children, with girls outperforming boys.\nIn addition, the effects of intrinsic motivation, extrinsic motivation, self-efficacy, and home literacy environment on student reading literacy achievement would be examined for Arabic-speaking and English-speaking students to explore potential influence of culture and ethnicity."}, {"section_title": "Data and methodology", "text": "Conducted by the International Association for the Evaluation of Educational Achievement (IEA), PIRLS 2011 adopted a two-stage stratified cluster sampling methodology to ensure a representative sample of grade 4 students take the test. Schools in Abu Dhabi were first randomly chosen, with probability proportional to their enrolment size, from the population provided by the Abu Dhabi Education Council (ADEC). Within each sampled school, all grade 4 classes were listed and one class was randomly selected. In the end, a total of 4146 grade 4 students with a mean age of 9.7 from 164 schools in Abu Dhabi were tested. Table 1 shows the distribution of these students by gender, region, nationality, and curriculum. Students in Abu Dhabi sat for PIRLS in either Arabic or English according to their main language of instruction.\nIn addition to student achievement data, PIRLS 2011 collected rich background information from students, parents, teachers, and schools. The student questionnaire asks students' attitudes and perceptions towards reading, as well as their school, classroom, and home experiences. The home questionnaire includes questions related to the home influence on reading development, interactions between parents and children, the home literacy resources, and other socioeconomic background of the family. The teacher survey focuses on the classroom reading strategies and activities, reading materials, assessment practices, and teachers' professional development. The school survey asks general information about school enrolment and student characteristics, the emphasis on reading instruction by the school, as well as the availability of school resources (Martin and Mullis 2012) . This present study drew on data merged from the student and parent surveys. Table 2 shows the factors and items used in this study. Weekly time parent spent on reading at home (ASBH11) Less than 1 h = 1, 1-5 h = 2, 6-10 h = 3, more than 10 h = 4 3774 2.14 .956\nNumber of books at home ( The PIRLS 2011 international data include some scales that were constructed by the IEA International Study Center (Martin and Mullis 2012). For the Abu Dhabi data, however, scales such as 'student confidence in reading' , 'student like reading' , and 'home resources for learning' recorded a relatively low reliability. Relevant scales with a Cronbach's Alpha Coefficient lower than .65 were reconstructed in order to achieve a more acceptable level of scale reliability.\nIn this study, the scale of intrinsic reading motivation was constructed based on four items that elicited student's interest and enjoyment in reading, which is consistent with the conceptualizations and measurement of intrinsic reading motivation in the literature (Becker et al. 2010; Wigfield and Guthrie 1997) . Mullis et al. (2012) named such a factor as reading attitude, but as commented by Schiefele et al. (2012) , the literature often takes reading attitude and intrinsic reading motivation as the same construct. The extrinsic reading motivation measure consisted of six items that measured the extent to which students read for external recognition and rewards (Guthrie and Wigfield 2000; Schiefele et al. 2012) . Student self-efficacy in reading was the mean of students' responses to three questions such as \"Reading is harder for me than any other subject\". The responses to the PIRLS questionnaire items were mostly measured by a four point rating scale (1 = agree a lot, 4 = disagree a lot). As shown in Table 2 , both intrinsic reading motivation and selfefficacy in reading have a Cronbach's Alpha above .66. This is deemed acceptable given that these two measures have less than five items with four point scales and when taking into account of the construct validity and compared with the reliability of similar scales reported in the literature (Davis et al. 2018) .\nThe level of reading literacy achievement was assessed through the PIRLS Reading Literacy Test, which consisted of 10 passages: five literary and five informational texts. The 10 passages were divided between 13 booklets through a rotated booklet design. One booklet was randomly assigned to a student. Multiple choice and constructed-response items were used.\nThe PIRLS 2011 Abu Dhabi data was analyzed using the IEA International Database (IDB) Analyzer software (version 4.0.20) . Used in conjunction with SPSS, the IEA IDB Analyzer applies the sampling weights, implements the jackknife repeated replication method to compute appropriate sampling errors, performs the computations five times for each plausible value, and aggregates the results to produce accurate estimates of average achievement and standard errors that account for both sampling and imputation errors.\nMultiple regression was used in this study to investigate the relationship between the reading literacy achievement of grade 4 students and their reading motivation, self-efficacy, and several home literacy environment variables, while controlling for gender and student's literacy level when starting school. Regression was run separately for student who took the assessment in Arabic and English. The same multiple regression model was also run among those students with different reading ability levels. In PIRLS 2011, students with a score of 625 or above, 550 or above, 475 or above, and 400 or above were classified as the advanced, high, intermediate, and low reading ability groups (Mullis et al. 2009 ). Total student weight was applied. Table 3 shows the zero-order correlations between parent involvement, intrinsic reading motivation, self-efficacy in reading, extrinsic reading motivation, and reading achievement. As expected, there was a strong positive correlation between student self-efficacy in reading and reading literacy achievement (r = .42, p < .01). Intrinsic reading motivation was positively correlated with extrinsic reading motivation (r = .57, p < .01). Extrinsic reading motivation was also positively correlated with reading literacy achievement (r = .18, p < .05). Unexpectedly, there was only a weak correlation between intrinsic reading motivation and self-efficacy in reading, and between parent involvement in learning and all other variables."}, {"section_title": "Results", "text": "The PIRLS 2011 results show that Abu Dhabi students who sat in the Arabic literacy test achieved an average score of 409 and those who took the test in English achieved an average score of 472. The regression model explained 31% of the variance in Abu Dhabi 4th grader's PIRLS reading literacy achievement. Overall, the model was able to explain more variance in reading achievement for Arabic-speaking students than for Englishspeaking students (Table 4) . As presented in Tables 2 and 4 , while Abu Dhabi grade 4 students reported a high level of intrinsic reading motivation, overall students' intrinsic reading motivation did not have a significant unique contribution to the explanation of variation of student's reading scores. This holds for both the Arabic-testing and English-testing sub-samples. Thus, hypothesis 1 was not supported. Regression coefficients presented in Table 5 further indicate different effects of intrinsic reading motivation on the reading achievement of students of high reading proficiency. Intrinsic reading motivation contributed positively to the reading score for students who took the assessment in English and scored between 550 and 625, but negatively for students who took the assessment in Arabic and scored between 550 and 625.\nHypothesis 2 proposes a negative relationship between extrinsic reading motivation and reading literacy achievement. Extrinsic reading motivation, however, recorded a significant and positive relationship with student reading achievement, especially for students who took the assessment in Arabic (Table 4) . Therefore, hypothesis 2 was not supported.\nHypothesis 3 was supported, as student self-efficacy in reading stood out as the strongest predictor of Abu Dhabi 4th grader's reading literacy achievement. The results of the regression model indicate that one level of the reading self-efficacy scale is positively associated with 33.31 point on the reading score, when the variance explained by all other variables in the model is controlled for.\nExcept for the role of parent involvement in learning, the predicted positive effects of all other home literacy environment variables-time parent spent on reading at home, number of books at home, and parent expectation of child's education-on reading achievement were found (Table 4 ). The pattern of the effects is rather consistent across the Arabic-testing and English-testing sub-samples. Thus, hypothesis 4 was not supported and hypotheses 5-7 supported.\nThe gender effect on the reading literacy achievement was significant among children who took the assessment in Arabic and insignificant among children who took the assessment in English. Therefore, hypothesis 8 was supported."}, {"section_title": "Discussion", "text": "Bearing in mind the potential issues associated with the scale reliability of the intrinsic reading motivation and reading self-efficacy constructs, this present study indicates a strong and positive role of reading self-efficacy in reading achievement, which is consistent with the literature (Fives 2016; Schiefele et al. 2012) . However, the positive role of intrinsic motivation was not supported by the Abu Dhabi PIRLS 2011 data.\nTheories and empirical studies suggest that intrinsic motivation contributes positively to the development of learning and reading (Deci and Ryan 2000; Froiland et al. 2012; Wigfield and Guthrie 1997) . Mullis et al. (2012) conclude from the PIRLS 2011 international data that, on average, students with high positive attitudes to reading have higher average reading achievement than those with lower attitudes to reading. While the high level of intrinsic reading motivation reported by Abu Dhabi's 4th graders may be explained from a developmental perspective as young children tend to overrate their reading beliefs and competence (Coddington and Guthrie 2009; Guay et al. 2003; Humphrey 2004) , a positive link between intrinsic motivation and reading achievement is missing in Abu Dhabi. Elsewhere, Law (2009) and Logan et al. (2011) also did not find a unique role of intrinsic reading motivation. Logan et al. (2011) revealed that intrinsic reading motivation may not explain significant additional variance in reading skill with all readers when cognitive ability is accounted for.\nSeveral explanations could be tentatively offered. First, researchers have argued that extrinsic motivation may weaken intrinsic motivation (Ryan and Deci 2000b; Wang and Guthrie 2004) . Perhaps Abu Dhabi parents and educators tend to focus on extrinsic rewards to motivate students, which can considerably diminish their intrinsic interest in reading (Deci et al. 1999; Lepper et al. 2005) . In this present study, however, there was a large positive correlation between student's intrinsic motivation and extrinsic motivation. Second, the occurrence of significant relationships between intrinsic reading motivation and reading achievement may be restrained by the dominance of reading self-efficacy in the relationship with reading achievement. Third, it is also likely that children's interest in reading has not been adequately taped and fostered by supportive reading experience and proper reading skills taught in classroom or at home, which then does not necessarily lead to high achievement outcomes.\nThe fact that Abu Dhabi Children who reported reading more for extrinsic benefits had a better performance in reading comprehension suggests that extrinsic reading motivation works effectively and positively in the Abu Dhabi context, especially for Arab students. As Ryan and Deci (2000b) argued, extrinsic rewards can exert a pull effect on students and attracts them to learn. This present research also indicates differing effects of intrinsic reading motivation on the reading achievement between students taking the assessment in different languages and at different proficiency levels. While the significantly negative effect of intrinsic reading motivation on the reading achievement of high proficient Arab students may suggest that the phenomenon of inflated selfreported reading motivation and beliefs is more evident among Arab students of high reading ability, further research is clearly needed to examine such complex relationships between and among intrinsic reading motivation, extrinsic reading motivation, reading self-efficacy, and reading comprehension in Arabic learning contexts.\nThe differing effect of extrinsic motivation on student reading literacy achievement between Arabic-speaking students (significant) and English-speaking students (insignificant) also tends to suggest the possible role of social and cultural elements. From a socio-cultural perspective, motivation as a psychosocial construct is also shaped by the cultural, social and educational context in which the learning takes place (Ushioda 2006) . Empirical research has validated the significant impact of the social, cultural, and organizational environment on some psychosocial constructs such as teacher school commitment and student engagement in learning in Abu Dhabi (Yang et al. 2017 (Yang et al. , 2018 . The application of the self-determination theory thus needs to factor in the role of particular contexts, within which intrinsic and extrinsic motivation interact with other factors including culture. In addition, the contexts for learning English may well be different from the contexts for learning Arabic, where Arabic dialects differ significantly from the standard Arabic which is taught at schools but not often used in daily life.\nThe evidence presented in this research suggests that the relationships between reading motivation and achievement are likely to interact with gender and ethnicity. In Abu Dhabi, gender is a significant predictor of reading achievement, but with a weaker effect than the reading self-efficacy and home environment factors. The fact that Arab girls significantly outperformed Arab boys may imply that Arab girls are more likely to be extrinsically motivated to read than their non-Arab counterparts. While the gender difference may have a wider social and cultural connotation (McKenna et al. 1995) , the difference of specific study culture between boys and girls may also be worth investigating (van Houtte 2004) .\nIt is necessary to note that the development of intrinsic motivation is important especially in the early academic careers of students and effort therefore should be made to realize or restore the positive association between intrinsic motivation and reading achievement in Abu Dhabi. Providing interesting and stimulating reading tasks and aligning motivational support with differentiated instructional practice could help enhance both intrinsic reading motivation and performance (Guthrie et al. 2006 ). An educational environment that gives students the autonomy to take control over their learning and reading should also be fostered (Baker et al. 2000; Wigfield et al. 2004 ).\nThis study also examines the effect of parent involvement and other home literacy environment variables on student reading achievement. Consistent with the literature (Bracken and Fischel 2008; Mullis et al. 2012; Ozturk et al. 2016) , this study reports a significant, positive association between student reading achievement and home educational resources, parents' reading time at home, and parental expectation of child's education.\nSurprisingly, parent involvement in learning is negatively associated with Abu Dhabi 4th graders' PIRLS reading comprehension scores. The findings of this study show that the more involvement parents offer in their children's home learning activities the worse their children's reading performance was. Similar results were reported by Law (2008) in his study of 2nd graders in Hong Kong, where parents' support for their children's homework were negatively associated with reading proficiency. In general, however, the results contradict the findings of research elsewhere that suggest parental involvement makes the greatest difference in reading especially during the early years (Froiland et al. 2014; Hemmerechts et al. 2017) .\nA further inspection showed that the level of parent involvement in Abu Dhabi was higher for children who were underperformed (the mean sores of parent involvement are 3.602, 3.629, 3.599, and 3.555 for the five achievement benchmark groups from 'below 400' to '550-625'). While this could partially explain the negative association between parent involvement in learning and student reading achievement, there are other accounts to be put into consideration.\nA considerable proportion of Abu Dhabi students are struggling students and readers. When parents assist their struggling children with early literacy development and learning, they may not know the best practices for fostering learning engagement of struggling children (Baker 2003) . Often, parents may opt for controlling or coercive practices that have detrimental effect on their children's attitudes towards challenging academics tasks (Grolnick 2009; Pomerantz et al. 2007) . As shown by Orkin et al. (2017) , parents' frequent correction of errors and interruption into children's work, although with a good intention to help them develop needed skills, tend to undermine struggling children's reading self-efficacy. Controlling practices may also limit children's autonomy or self-regulated learning (Grolnick 2003) . Perhaps it is the approach of parental involvement in learning rather than the frequency or the amount of assistance that makes the difference in children's achievement (Moroni et al. 2015; Pomerantz et al. 2007) . Also importantly in the context of Abu Dhabi, the impact of parent involvement in Arabic literacy on student Arabic reading achievement is likely to be affected by the Arabic diglossic nature, i.e. the differences between the spoken Arabic at home and the standard Arabic taught at school."}, {"section_title": "Conclusions", "text": "The extant research on literacy acquisition in Arab countries has concentrated on the unique characteristics of the Arabic language and the implications of its orthographic and diglossic features on reading acquisition while neglecting the effects of student motivational factors and literacy related home environmental factors. Consistent with the literature, the preliminary results of this current study affirm the important contributions of student self-efficacy, extrinsic motivation, and home literacy environment to students' reading achievement of Abu Dhabi's 4th graders, which supports the design of a comprehensive and enabling literacy promotion strategy and program that connect and integrate individual readers and the school and home literacy environments.\nIn order to raise the reading performance of Abu Dhabi students, the ADEC has adopted a literacy strategy and approach that highlight the development of positive attitude towards the teaching and learning of Arabic, the adoption of independent reading and writing instruction, guided reading and writing instruction, and phonics and spelling instruction, as well as the promotion of project-based learning and interactive readaloud as a mean to engage students' learning of Arabic. While the literacy strategy has been articulated to all stakeholders, additional emphasis should be placed on a supportive home literacy learning context, as suggested by the results of this study.\nThis study pinpoints the importance of passive home literacy environment including parents' reading activities at home, home educational resources, and parental expectation. Further investigations into the way and the quality of parental home learning and reading support to students are required. Instead of paying attention to the frequency of assistance, Abu Dhabi parent's reading support at home may have to offer more autonomy to student's learning. Collaboration between schools and parents may help parents learn more regarding how to develop children's reading proficiency in a richer and more efficient literacy environment.\nThe absence of relationship between students' intrinsic reading motivation and reading achievement in Abu Dhabi deserves the attention of educators and researchers. The problem is perhaps not always that students fail to read and learn because they lack internal motivation. Rather, students in Abu Dhabi may have the intrinsic motivation to read, but they do not get necessary support from teachers and parents to translate such intrinsic motivation into sustained progress and competence. Students' self-efficacy, one of the strongest predictors of reading achievement of Abu Dhabi students, can be increased by their experiences of success in reading. Teachers in Abu Dhabi have a number of tools at their disposal to nurture the confidence of students, encouraging them to become responsible for their learning and academic performance. While teachers play an integral part in the growth of student self-efficacy and achievement, teacher effectiveness and other classroom level factors such as reading comprehension instruction strategies were not accounted for by this study, which calls for a multiple level analysis involving the examination of some classroom and school level variables.\nAnother limitation of this study was that it did not directly examine how Arabic orthography and diglossia may have affected students' Arabic reading achievement, although Arabic-speaking grade 4 students in Abu Dhabi were significantly underperformed compared to English-speaking students. The factors that contributed to this substantial performance gap deserve further research, especially in light of the complexities embodying the learning and teaching of the Arabic language. Similar analysis using the PIRLS data could also be conducted for several other Arab countries to check whether the findings of this study are generally applicable to the Arabic learning contexts.\nFuture research should also focus on improving the reliability of some scales in the PIRLS study. As noted in this study and in Martin and Mullis (2012) , scales such as 'student confidence in reading' , 'student like reading' , and 'home resources for learning' recorded a low reliability across a number of countries including Arab states. The two important scales used in this study-intrinsic reading motivation and self-efficacy in reading, have a Cronbach's Alpha lower than .7. This may affect the quality of the data analysis pertaining to the relationships between intrinsic motivation, home environment, and student reading achievement. Finally, caution should be exerted about possible sample attrition associated with Abu Dhabi PIRLS 2011 data, which may affect the external validity of the study."}]