[{"section_title": "Abstract", "text": "If you ask a room full of fifty people to explain what is meant by the \"100-year flood\" you will probably get as many different answers. In fact, I know you will get at least three because that is the number of responses I got when I asked the question of my undergraduate fluid mechanics course on the first day of class last semester. The first student wondered if it described the largest flood level that had occurred in the past 100 years. The second student supposed it was the largest flood event that could be expected in the next 100 years. The third student guessed that it was"}, {"section_title": "", "text": "If you ask a room full of fifty people to explain what is meant by the \"100-year flood\" you will probably get as many different answers. In fact, I know you will get at least three because that is the number of responses I got when I asked the question of my undergraduate fluid mechanics course on the first day of class last semester. The first student wondered if it described the largest flood level that had occurred in the past 100 years. The second student supposed it was the largest flood event that could be expected in the next 100 years. The third student guessed that it was Talea L. Mayo is an assistant professor in the Department of Civil, Environmental, and Construction Engineering at the University of Central Florida. Her email address is talea.mayo@ucf.edu."}, {"section_title": "Communicated by Notices Associate Editor Reza Malek-Madani", "text": "For permission to reprint this article, please contact: reprint-permission@ams.org. DOI: https://doi.org/10.1090/noti1787 the chance that flooding would occur at all over the next century.\nI was mostly just excited that these students were brave enough to engage with me so early in the semester, so early in the morning, but I also appreciated having confirmation of something I already knew: there is much work to be done in the way scholars communicate math and science, especially to public audiences. The students I teach in the Civil, Environmental, and Construction Engineering Department at the University of Central Florida are incredibly bright. The answers they gave were informed by both their experiences as residents of coastal Florida and their access to higher education, and were completely reasonable suppositions.\nHowever, our discussion made it clear that they did not understand the meaning of the 100-year flood level. One can only imagine the misconceptions by members of the public who do not have coastal exposure or college educations. In fact, this ignorance has been well documented [1, 7] . This is problematic because the risk of storm surge is increasing, posing an inevitable threat to coastal communities. Innovative solutions will be required as these communities work to improve their resilience to storm surge over the coming decades. Diversity often fuels innovation, as the unique backgrounds and experiences of individuals from multiple groups can aid in the development of creative solutions to challenging problems. Thus, it is important that science be inclusive, and an important step toward inclusivity is making it accessible by explaining fieldspecific jargon so that larger audiences can engage in scientific conversations. A major component of the work in predicting the 100-year flood is communicating to broad audiences what this even actually means.\nSo what is the 100-year flood? And why does it matter so much? My third student was on the right track when he explained that it is used to describe the chance, or rather the risk, of flooding. The term \"risk\" is used rather loosely both within and outside of the scientific community. \"You risked your life when you dived into the ocean after me.\" \"The risk of heart disease decreases with regular exercise.\" \"Forest fires pose a great risk to this neighborhood.\" In the context of natural hazards, however, risk is defined as the product of hazard, exposure, and vulnerability ( Figure 1 ): The hazard is the threatening climate or weather phenomenon of interest and its probability of occurrence. Exposure describes assessment of the values that are present in the area where the hazard may occur. Vulnerability describes the potential of the hazard to negatively impact the exposed community [3, 8] . If any of these components is reduced, the overall risk of the natural hazard is reduced as well. Clearly, if there is no storm surge, there is no (imminent) risk of flooding due to storm surge. The Atlantic hurricane season begins on July 1 and ends on November 30 of each year. The risk of storm surge is essentially zero the rest of the year, since there are generally no hurricanes and thus no storm surge hazard from December through June. More subtly, if there is no exposure to the hazard, there is no (imminent) risk of storm surge. In 2017, I was home alone and six months pregnant during Hurricane Irma. I was able to remain quite calm as the storm approached central Florida because I understood that my risk of storm surge was quite low, since exposure to storm surge is low in Orlando where I live. (For the record, I probably will not stay home during a major hurricane now that my daughter is outside of my body; we were out of power, i.e., air conditioning, for four days after the storm!) Finally, storm surge risk can be greatly reduced by reducing vulnerability. An elevated home is much less vulnerable to storm surge than one whose foundation rests on the ground (Figure 2) . Similarly, communities with accurate knowledge of their storm surge risk can properly prepare for the hazard, and are thus less vulnerable to it.\nTo most effectively reduce the risk of a natural hazard, it must first be adequately assessed. Adequate assessment of risk requires adequate assessment of each of its components. Specifically, it requires the assessment of the storm = 0.2% probability of occurring each year, etc.) The flood height is called the return level and the denominator in the fraction defining its probability is called the return period. One-hundred-year flood levels and other return levels are important because structures are often designed with these values in mind. The average home must be able to withstand the 100-year flood + 1 ft., while more critical infrastructure, e.g., hospitals and protective levees, is built to withstand flood levels with even higher return periods. These values are also used to inform flood insurance rates [2] . While several hazards can cause flooding, flooding due to hurricane storm surges is especially important for coastal communities. Storm surge is the primary cause of life and property loss during severe hurricanes in the United States (Figure 3 ) [11] . Understanding the 100-year flood due to storm surge plays a central role in saving lives and property.\nA return curve can be used to graphically depict multiple return levels and their associated probabilities ( Figure  4 ). Assuming these annual exceedance probabilities do not change, they can be used to determine exceedance probabilities over time using concepts from elementary probability theory. For example, we can compute the probability that the 100-year flood will occur at least once in 100 years.\nTo do so, we must first calculate the probability that it will not. The probability that the 100-year flood will not occur in a given year is 99%, the probability that it will not occur in two years is 99%×99% = 98%, and the probability that it will not occur in 100 years is (99%) 100 = 37%. Thus, the probability that the 100-year flood will occur at least once in 100 years is 1 − (99%) 100 = 1 − 37% = 63%, i.e., it is quite likely (though it is not 100%, as its name might imply). Typically, the computation of a desired return period requires data collected over lengthy time periods. This poses challenges in storm surge hazard assessment due to 1) the rarity of hurricane and storm surge events, and 2) the limited amount of data describing those events. This is especially problematic for regions with historically low cyclonic activity, such as the North Atlantic coast of the United States, and regions where data collection has historically been scarce, such as the northwestern Pacific Ocean. Furthermore, available data must be carefully modeled in order to extrapolate high return levels from lower impact, higher probability events. Return periods have been gravely underestimated when, e.g., linear extrapolation is used in place of extreme value analysis. Additionally, computing return periods in this way relies on an assumption of stationarity, i.e., that the risk of storm surge is not changing and storm surges in future climates will follow the patterns of those in the past. There is increasing evidence to refute this assumption. Variations in local mean sea levels are evident and directly impact the 100-year flood level. This should be accounted for, in the most elementary way, by adding the expected value of sea level rise to computed storm surge return levels, or with more sophisticated methods, e.g., including sea level rise probability distributions in the calculation of flood probability distributions:\n(Here, and are random variables that describe maximum storm surge height and mean sea level height. Their probability density functions are and , respectively, and is a specified value used to define the probabilities of their sum, which has the probability density function + .) However, this in itself is insufficient for accounting for the impacts of impending climate changes. There is a general consensus among climate scientists that tropical cyclones are becoming more intense, and though there is some divergence regarding the direction, most climate models predict changes in tropical cyclone frequency [9] . This has direct implications for storm surges, which are not accounted for in the more traditional approaches to risk assessment described above.\nRecently, new methods of computing storm surge risk that more comprehensively account for the impacts of climate change have been developed. Thousands of synthetic tropical cyclones can be generated using downscaled data from climate models in order to simulate representative hurricanes, i.e., hurricanes from the modeled climate, including those climates for which there is insufficient hurricane and/or storm surge data and those climate conditions which have not yet occurred [5] . To estimate the storm surges associated with these hurricanes, the storms can be used as the meteorological forcing in numerical models used to simulate coastal hydrodynamics (e.g., the Sea, Lake, and Overland Surges from Hurricanes (SLOSH) model [6] and the ADvanced Circulation (ADCIRC) model [10] ). These models numerically solve the shallow water equations, a depth-averaged approximation of the NavierStokes equations, to estimate water elevations and currents. The numerical models can estimate the maximum storm surge height that would have occurred over the duration of each synthetic storm at any specified location. In the end, the thousands of synthetic hurricanes yield thousands of synthetic maximum storm surges, producing a large sample of storm surges from which extreme value statistics can be computed. Specifically, the generalized Pareto distribution (GPD) can be used to compute return curves for the synthetic storm surges of a given climate. The probability density function of the GPD,\nis defined by fitting the extremes of the synthetic storm surge data. Here, ℎ is storm surge height, is a threshold parameter defining which storm surge heights are classified as \"extreme,\" is the probability that any given storm surge exceeds it, and and are scale and shape parameters used to fit the GPD to the data. We can use the GPD to estimate the 100-year flood level for past, present, and, most importantly, future climate scenarios.\nApplications of this approach to risk assessment are vast. Not only can the 100-year flood level be used to more accurately assess flood risk and design sound infrastructure, it can inform strategies for climate adaptation. As the climate changes, communities can implement various strategies to increase their resilience to storm surges. Strategies include natural, nature-based, structural, and non-structural approaches, such as preservation of wetlands, introduction of engineered sand dunes, construction of levees, and development of policies mandating retreat, respectively. These types of proactive approaches are more effective than reactive approaches. In the long run, they are more cost effective and save more lives and property [4] . Despite the large return on investment should a storm surge event occur, reactive approaches, such as the controlled release of two reservoirs during Hurricane Harvey to protect downtown Houston at the expense of homes in smaller communities [12] , dominate emergency management practices because proactive approaches often come at a higher initial cost of implementation. Adopting resilience measures incrementally, as the climate changes and the risk of storm surge increases, is a more practical means of implementation for small communities and their local governments. These types of adaptation strategies were developed and studied for several communities in the Northeast United States as part of the project Structures of Coastal Resilience (SCR), which was developed with the goal of addressing the flood risks to vulnerable coastal populations in the wake of Hurricane Sandy ( Figure 5) .\nLike the goals of many high impact projects, the goal of SCR was an ambitious one. As described above, comprehensive risk assessment is much more involved than e.g., computing statistics of historical flood data. The flood hazard, exposure, vulnerability, and all that each of the three entail must also be considered. The challenges we face as a society are growing more and more complex in a similar fashion. Effective, innovative solutions to these difficult problems require diverse perspectives and interdisciplinary teams. This proved to be instrumental to the success of SCR. The team that united to undertake its lofty aims included mathematicians, computational scientists, structural engineers, geoscientists, architects, and experts in public policy, among others. Additionally, several team members had expertise in geographic information systems Figure 5 . Layered adaptation strategies for improving storm surge resilience can be implemented incrementally and may be more practical for coastal communities than traditional approaches.\n(i.e., ArcGIS), a platform that facilitates the creation, management, sharing, and analysis of spatial data. This greatly supported communication between team members from differing academic disciplines, and aided in presenting the research findings of the project in a mode more accessible and understandable to public audiences than more traditional academic formats ( Figure 6 ). The team also included members from several organizations, including four universities, and several groups historically underrepresented in STEM fields, including both women and minorities (and women minorities, like me!). In the end, the diversity of the team played an important role in the development of creative solutions to a major research challenge. "}]