[{"section_title": "Introduction", "text": "Brown shrimp (Farfantepenaeus aztecus) is a commercially important fishery species of the northern Gulf of Mexico, and landings generated over $245 million (US dollars) in 2013 (National Fig. 1. Map indicating the location of the Gulf of Mexico and Galveston Bay, Texas, U.S.A. Within Galveston Bay, approximate locations of areas of marsh (green), non-vegetated marsh edge (NVME, yellow), shallow open water (SOW, light blue), and deeper (≥1 m deep) water (dark blue) also are indicated. inshore bays (Fry, 2008). Juveniles grow rapidly to sub-adult size and then migrate offshore to complete their growth to maturity (Trent, 1967). Young brown shrimp in the northern Gulf of Mexico utilize shallow estuarine habitats and grow from postlarvae (10-15 mm TL) to subadults (55-80 mm TL) within a few months (Cook and Lindner, 1970). While brown shrimp juveniles occur in several habitat types including oyster reef (Stunz et al., 2010) and shallow open water (Fry, 2008;Minello, 1999), highest densities are found in seagrass and salt marsh (Minello et al., 2003;Stokes, 1974). Relatively little seagrass habitat exists in Galveston Bay or in many estuaries of the northwestern Gulf of Mexico (Handley et al., 2007), and the majority of brown shrimp are found associated with emergent marsh vegetation (Minello and Rozas, 2002;. Indeed, brown shrimp commercial yield has been correlated on a large scale with the presence of intertidal vegetation (Boesch and Turner, 1984;Turner, 1977). The Galveston Bay system is the largest estuary in State of Texas, U.S.A. (Fig. 1) and the salt marshes and shallow water surrounding the bay are particularly important habitats for young shrimp (Minello et al., 2008). Spartina alterniflora is the dominant shoreline vegetation (Minello and Webb, 1997), and this intertidal habitat supports high densities of young brown shrimp when flooded . Some mechanisms linking salt marsh habitats with brown shrimp production have been identified (Zimmerman et al., 2000). Growth of juvenile shrimp is mainly a function of temperature and food availability (Zein-Eldin and Aldrich, 1965), with growth rates commonly reaching 1 mm day −1 (Knudsen et al., 1977). Young brown shrimp feed on benthic invertebrates such as amphipods and polychaete worms Zimmerman, 1991, 1998), which often are most abundant within marsh vegetation (Whaley and Minello, 2002). These studies support the conclusion that growth rates should be highest when the vegetated marsh surface is available for foraging (Minello and Zimmerman, 1991). Shrimp access to the vegetated marsh surface is dependent upon tide height and marsh surface elevation (Childers et al., 1990;Minello et al., 2012). In the northern Gulf of Mexico, tides are microtidal (<1 m), predominantly semidiurnal, and strongly wind driven, resulting in water levels that regularly deviate from predicted tides (Minello et al., 2012;Rozas, 1995). The increased growth rates associated with access to the vegetated marsh surface also may reduce the total time shrimp are available to predators (Rozas and Zimmerman, 2000), since mortality rates due to predation appear to decrease as shrimp grow (Minello et al., 1989). Fish predation appears to be the primary source of mortality of young brown shrimp (Minello et al., 1989;Minello and Zimmerman, 1983), and vegetative structure also provides protection from such predation, likely resulting in greater survival when on the marsh surface (Kneib, 1995;Orth et al., 1984;Minello et al., 2003). Salinity effects on shrimp survival and growth are less clear. Laboratory experiments have shown little correlation between shrimp growth and salinity (Zein-Eldin, 1963;Zein-Eldin and Aldrich, 1965), but caging experiments along a salinity gradient in Barataria Bay, Louisiana suggest that low salinities result in slower growth rates in estuarine habitats (Rozas and Minello, 2011). Brown shrimp production from the Galveston Bay system, or any given bay system in the northern Gulf of Mexico, is highly variable from year to year. Hence it is difficult to predict annual commercial harvests from the Gulf or to assess the current status of brown shrimp stocks. The recent Habitat Assessment Improvement Plan (HAIP) of the NMFS calls for adjustments to the current stock assessment methodology, and the improvement of fisheries management through the integration of habitat science (Yoklavich et al., 2010). Since recruitment of juveniles to the fishery appears dependent upon processes that take place during the estuarine phase of the shrimp life cycle, the incorporation of juvenile habitat effects on production should support a more complete stock assessment methodology. Several recent models using a variety of approaches have focused on the production of juvenile brown shrimp. These have ranged in complexity from a relatively simple spatial density model estimating brown shrimp production from Galveston Bay marshes using an equilibrium yield approach (Minello et al., 2008), to a bioenergetics model examining the potential impacts of freshwater diversions of the Mississippi River on the production of juvenile brown shrimp (Adamack et al., 2012), to spatially-explicit individual-based models (IBMs) investigating the effects of habitat fragmentation and inundation on brown shrimp production (Haas et al., 2004;Roth et al., 2008). These IBMs simulate individual shrimp movements at a high spatial resolution (1 m 2 cell size) over relatively small areas (1-25 ha), and require long simulation times on relatively sophisticated computers. In this paper, we present a spatially-explicit, individual-based model which simulates the cumulative effects of temperature, salinity, and access to emergent marsh vegetation on the growth and survival of young brown shrimp. We developed our model to estimate annual shrimp production from bay systems in the northern Gulf of Mexico and parameterized the model using 30 years of environmental data for Galveston Bay. We first describe model structure and function (Section 2), model calibration (Section 3), baseline simulations (Section 4), and sensitivity analyses (Section 5). We then use the model to explore the uncertainty in estimations of shrimp production resulting from uncertainty in the timing of shrimp recruitment to the bay system (Section 6). Model production also was compared with abundance (CPUE) estimates from Galveston Bay and coastal Gulf waters as one means of assessing model performance (Section 7)."}, {"section_title": "Model description", "text": "The model, which is spatially-explicit and individually-based, simulates the biomass production of brown shrimp in salt marsh habitats of the northern Gulf of Mexico and currently is parameterized to represent the environmental conditions and habitat characteristics of Galveston Bay. Three habitat types utilized by shrimp are included in the model: (1) marsh -regularly flooded intertidal salt marsh vegetation; (2) non-vegetated marsh edge (NVME) -water near (<150 m from) the marsh vegetation; and (3) shallow open water (SOW) -relatively shallow (<1 m deep) non-vegetated water farther (>150 m) from the marsh edge ( Fig. 1). These three habitat types comprise 17%, 28%, and 55%, respectively of the 63,500 ha of Galveston Bay shrimp habitat represented in the model. The 100 habitat cells (635 ha each) in the model also are identified by low (0-10 PSU), intermediate (10)(11)(12)(13)(14)(15)(16)(17)(18)(19)(20), and high (>20 PSU) salinities, that change on a monthly basis (Fig. 2). Salinity patterns in the bay were determined by the TxBLEND model (Guthrie et al., 2014). Postlarval shrimp (10 mm TL) are recruited into non-vegetated marsh edge and shallow open water on a daily basis; their distribution is based on relative densities observed in salinity-habitat combinations (Minello, 1999). No shrimp are recruited directly into marsh habitat. A percentage of shrimp move into marsh habitat from the non-vegetated marsh edge when the marsh vegetation is flooded, and all shrimp move out of the marsh into the non-vegetated marsh edge when the marsh is no longer flooded. Shrimp in the shallow open water (>150 m from marsh vegetation) do not leave that area. Shrimp growth, emigration, and mortality occur in all cells, with growth rates and mortality probabilities differing among cells (and also depending on temperature and salinity, see Fig. 3). Shrimp in the model recruit into the bay as postlarvae (10 mm TL), and they emigrate from nursery habitats to the open bay when they attain a length of 70 mm. The quantitative representations of movement, growth, mortality, and emigration of individual shrimp included in the model are summarized schematically in Fig. 3. Rules representing the movement of individuals, described in the preceding paragraph, are probabilistic. Each hour when the marsh is flooded, each individual located in either the marsh or the nonvegetated marsh edge has a 69% probability of moving to a cell with the same salinity in the marsh vegetation and a 31% probability of moving to a cell with the same salinity in the non-vegetated marsh edge. If there is no cell with the same salinity, the individual moves into a cell with the salinity closest to the salinity of the cell from which it moved. Thus any given individual may move back and forth between these two areas during periods of marsh flooding, but is likely to spend slightly more than twice as much of this time in the marsh vegetation. These values were based on relative densities in these habitats at flood tide reported by Minello et al. (2008). Growth is a function of the water temperature, salinity, and habitat type (i.e., marsh, non-vegetated marsh edge, shallow open water) to which an individual is exposed (Fig. 3). A probabilistic base growth rate (0.0416 ± 0.0104 mm h −1 ) is multiplied by two indexes representing (1) a water temperature-salinity effect and (2) a habitat effect. The water temperature-salinity effect is represented as a polynomial function of water temperature, which is different for each of the three salinity zones (Fig. 4). Hourly water temperatures are calculated based on relationships between the median air temperature and measured water temperatures in marsh and non-vegetated marsh edge (see Appendix 1). The habitat effect is represented as a constant, which is different for each of the three habitats (1.28, 1.14, and 1.0 for marsh, non-vegetated marsh edge, and shallow open water, respectively). These values are based on based on experimental growth rates from field studies and infaunal prey distributions (Minello and Zimmerman, 1991;Rozas and Minello, 2011;Whaley and Minello, 2002) Mortality (probability of dying) is a function of a base instantaneous rate (0.00083 h −1 ) multiplied by two indexes representing (1) a shrimp size effect and (2) a habitat effect (Fig. 3). Mortality is reduced as shrimp grow, and the size effect is calculated as 53.092 * (total length in mm) −1.1163 . The habitat effect is "}, {"section_title": "Multiplier", "text": "Temperat ure °C Salinity zone 1 (< 10 PSU) Salinity zone 2 (10-20 PSU) Salinity zone 3 (>20 PSU) Fig. 4. The interaction between temperature and salinity on growth in the model. Multiplier adjusts base growth rate of 1 mm d −1 (TL). represented as a constant, which is different for marsh vegetation (0.69) versus the two areas of non-vegetated water (1.38). Input data required by the model for each calendar year being simulated include: (1) current elevation of the marsh edge, (2) hourly tide heights, (3) daily median air temperatures, and (4) monthly distribution of salinity zones among habitat types for the calendar year being simulated. The number of individual postlarval shrimp recruiting into the bay system each day during the simulation period is fixed. Graphs of input data for January through August, 2012 are presented in Fig. 5. Elevation of the marsh edge is a function of the elevation measured in the baseline year of 2013 (1.477 m, NOAA tide gauge 8771450, Galveston Pier 21, http:// co-ops.nos.noaa.gov/) and relative sea level rise over the years simulated (Fig. 5a, see Appendix 1 for details). The time series of environmental data representing hourly tide heights ( Fig. 5b), daily median air temperatures (Fig. 5c), and monthly salinities ( Fig. 5d) are based on data from NOAA Tides and Currents (https:// tidesandcurrents.noaa.gov/waterlevels.html?id=8771450), NOAA National Center for Environmental Information, (http://www.ncdc. noaa.gov/cdo-web/search), and the Texas Water Development Board's TxBLEND model (Guthrie et al., 2014), respectively (see Appendix 1). The relative numbers of individual shrimp entering Galveston Bay (Fig. 5e) are based on data from collections of postlarvae in a Galveston Bay tidal pass (Matthews, 2008) and abundance patterns observed in marsh habitat (Rozas et al., 2007). A detailed model description following the ODD (Overview, Design concepts, Details) protocol for describing individual-based models as outlined by Grimm et al. (2006) and Railsback and Grimm (2012) is presented in Appendix 1. In addition to the equations and logical rules that constitute the model, which are summarized above, Appendix 1 describes the rationale behind the model, model design concepts, key assumptions, intermediate calculations linking information sources to the representation of that information in the model, and the sequence of events and processes involved in the execution of the model."}, {"section_title": "Model calibration", "text": "We calibrated the model such that (1) simulated annual brown shrimp production was scaled to reasonable values, and (2) simulations could be run in a reasonable amount of time on available computing facilities. We accomplished (1) by assuming each simulated shrimp was a \"super-individual\" (Scheffer et al., 1995) representing 1 million \"real\" shrimp. This calibration resulted in simulated monthly and annual mean abundances and biomasses similar to those estimated based on field data from a polyhaline marsh complex in Galveston Bay spanning 11 years (Rozas et al., 2007). We then accomplished (2) by multiplying the input data representing daily shrimp recruitment (Fig. 5e) by 0.5. This kept the number of individuals being simulated during any given (simulated) hour under 2000 and resulted in simulation times under 10 min on standard desktop computers. Since simulated shrimp behave independently of each other (i.e., there are no densitydependent relationships in the model), neither of these calibrations affect the interpretation of simulation results with regard to the relative influence of environmental factors on shrimp production (Fig. 6)."}, {"section_title": "Baseline simulations", "text": "We used a baseline version of the model, parameterized and calibrated as described above, to simulate annual brown shrimp production from Galveston Bay under environmental conditions representative of those observed from 1983 to 2012. We ran 10 replicate stochastic (Monte Carlo) simulations representing each  of these 30 years (i.e., using the tide, temperature, and salinity input data corresponding to each year). Mean annual (January through August) production ranged from 27.5 kg ha −1 in 1997 to 43.5 kg ha −1 in 2012, with an overall mean of 34.8 (±0.70 SE) kg ha −1 (Fig. 7, see Fig. A2.1, Appendix 2, for results of individual simulations)."}, {"section_title": "Sce narios", "text": ""}, {"section_title": "Sensitivity analyses", "text": "We examined the sensitivity of model estimates of annual brown shrimp production to changes of ±10% relative to baseline in values of key model parameters (growth rate, probability of mortality, and probability of moving into marsh vegetation of individual shrimp) and values of environmental input data (tide heights, median air temperatures). We also performed simulations in which the salinity of the entire bay was designated low (0-10 PSU), intermediate (10-20 PSU), or high (>20 PSU). For all analyses we ran 10 replicate stochastic simulations of each scenario for each year from 1983 through 2012 and compared the mean production of the treatment to the corresponding year's mean baseline value (Table 1). Increasing growth rates by 10% caused an overall 16% increase (annual range 13-20%) in production, whereas a 10% decrease resulted in an overall 18% decrease (annual range 16-21%) in production. A 10% increase in mortality probabilities resulted in an overall production decrease of 15% (annual range 11-16%) while Table 1 Results of sensitivity analysis showing the mean increase or decrease in shrimp production (kg ha −1 ) associated with a 10% increase or decrease in each parameter. The salinity zone patterns differed among the 30 simulated years and so the delta value was variable by year as well. a 10% decrease resulted in an 18% increase (annual range 14-21%) in production. When we increased the shrimp's probability of moving into the marsh by 10%, overall production increased 5% (annual range 3-8%) and conversely, decreased 5% (annual range 1-8%) with decreased probability of movement. We also conducted simulations by changing values of environmental input data by ±10%. Mean overall production estimates increased 11% (annual range 5-21%) in response to increasing tide heights (and thus, marsh habitat access) and decreased 19% (annual range 14-24%) with a decrease in tide height (and marsh access). The thirty year mean production was affected negatively by both decreasing and increasing air temperature. A 10% decrease in air temperature resulted in an overall 14% decrease (annual range 7-19%) in annual production. Increasing temperature 10% decreased production by a mean of 2%, with annual values ranging from a decrease of 12% to an increase of 8%. Although the overall mean change was negative, nine years of the 30 simulated saw an increase in production with an increase in temperature (Table 1, see Figs. A2.2 and 2.3, Appendix 2, for results of example year, 2012). Simulations in which bay water salinities were entirely low (0-10 PSU), intermediate (10-20 PSU), or high (>20 PSU) resulted in overall mean production rates decreasing 55 (annual range 49-59%), 7 (annual range −12 to +9%), and 0% (annual range −4 to +16), respectively, from the baseline mean."}, {"section_title": "Simulation of effects of timing of recruitment on brown shrimp production", "text": "To explore the uncertainty in estimations of shrimp production resulting from uncertainty in the timing of postlarval shrimp recruitment to the bay system, we ran simulations in which we shifted the time series of input data representing recruitment such that recruitment occurred 14, 21, and 28 days earlier than baseline, and 14, 21, 28, 35, and 42 days later than baseline. We did not change the relative shape of the recruitment curve ( Fig. 5e), but rather we shifted the entire curve earlier or later in the year. For each of these 9 scenarios (these 8 shifts plus a baseline scenario), we ran 10 replicate stochastic (Monte Carlo) simulations under environmental conditions representing each of the 30 years from 1983 to 2012 (i.e., using the tide, temperature, and salinity input data corresponding to each year) (a total of 9 × 10 × 30 = 2700 simulations). Mean production estimates decreased monotonically as recruitment occurred earlier than baseline under all environmental conditions simulated ( Fig. 8, see Fig. A2.4, Appendix 2, for results of individual simulations). When recruitment occurred up to 21 days later than baseline, mean production estimates tended to increase or remain essentially unchanged under all environmental conditions. However, recruitment delays of 28 or more days affected mean production estimates differently under different environmental conditions, with estimates sometimes continuing to increase noticeably, sometimes decreasing noticeably, and often remaining relatively unchanged relative to shorter delays (e.g., under environmental conditions representative of 1987, 2012, and 1984, respectively)."}, {"section_title": "Model evaluation", "text": "Patterns that emerged from our model included: seasonal trends in relative population size and structure, annual production variability, and inter-annual production variability. Seasonal trends in relative population size and structure were verified against field data collected in Galveston Bay at Galveston Island State Park (GISP) from 1982-1992 (Rozas et al., 2007). We compared field data to our model output of the monthly mean size of shrimp, the size frequency distribution, the population size, and the standing biomass. Since the GISP data were used to derive some of our growth and mortality parameters (Minello et al., 1989;Minello et al., 2008;Roth et al., 2008;Rozas et al., 2007), we used the comparisons as a method of verifying that the model processes were reproducing patterns that characterize the systems internal organization. The modeled monthly means for shrimp size, and standing biomass followed patterns similar to the GISP data set (Figs. 9 and 10). Size distributions also were similar over time. Minello et al. (2008) estimated a mean standing crop of 19,382 shrimp ha −1 in the polyhaline marsh complex over the period of April through November. Our model estimates a mean of 22,848 shrimp ha −1 in the polyhaline marsh (Zone 3) over the period of April through August for the years 1893 through 2012. We estimated that secondary production lost to predation (shrimp that die in the model) was a mean of 28% of the total production (kg ha −1 ). This is less than the estimate from Roth et al. (2008) of 37%. Several data sets estimating brown shrimp abundance were used to evaluate our model output. The Texas Parks and Wildlife Department collects shrimp using trawls at random locations in Galveston Bay every month (Brown et al., 2013;Martinez-Andrade et al., 2005), and monthly catch per unit effort (CPUE) data from 1982 through 2011 were available for model comparisons. Southeast Area Monitoring and Assessment Program (SEAMAP) summer trawl surveys provided another fishery independent source of abundance data (CPUE) available for most years of our simulations (1987-2012). We looked for general trends in inter-annual  1993 1994 1995 1996 1997 Production (kg/ha) variability to facilitate comparison of our modeled production estimates (kg ha −1 ) against catch data. From 1982 through 2011, the mean size of shrimp caught by the TPWD trawls was 87.4 mm TL (Brown et al., 2013), and we assumed that their samples represented shrimp that had recently left the marsh complex and moved into open bay habitats. We compared TPWD CPUE from March through September with the modeled monthly production in kg ha −1 (Fig. 11), and there are similarities in the seasonal pattern. Months of peak production in the model generally coincided with months of peak CPUE. Our estimates of annual production only include production through August, since TPWD data show that there are very few brown shrimp caught in the bay after this time. Annual variability in modeled production was lower than expected when compared to TPWD data, and there was a poor relationship between our annual model output and TPWD mean CPUE for each year. A linear regression was not significant with an R 2 value of only 0.005. SEAMAP trawl surveys follow a stratified random sampling method and sample across the northwestern GoM from near shore out to the border of the United States Exclusive Economic Zone (EEZ). Linear regression analysis of SEAMAP summer survey CPUE with our model's annual output was significant (p = 0.0005) and had an R 2 of 0.40 ( Fig. 12). Since the SEAMAP summer survey is conducted in June and July, we also examined the relationship with our model output up until May of each year from 1987 through 2012. We expect shrimp that emigrated from the marsh complex in May recruitment. Minus 14, −21, and −28 represent recruitment occurring 14, 21, and 28 days earlier than baseline, whereas 14, 21, 28, 35, and 42 represent recruitment occurring 14, 21, 28, 35, and 42 days later than baseline. The relative shape of the recruitment curve ( Fig. 5e) was not changed, the entire curve was shifted earlier or later in the year. would be available to the SEAMAP survey in June and July. The May model output has a mean production of 9.2 kg ha −1 , is more variable than the August production estimates, and ranges from 3.5 to 18.8 kg ha −1 . Regression analysis of the model's May production with the SEAMAP summer CPUE was significant (p = 0.002) and had an R 2 value of 0.45 ( Fig. 12)."}, {"section_title": "Discussion", "text": "Model estimates of annual brown shrimp production from Galveston Bay differed noticeably under different environmental conditions affecting the growth, mortality, and access to marsh vegetation of juvenile brown shrimp. The lowest production estimate generated under temperatures, salinities, and tides (marsh flooding events) representative of the years from 1983 to 2012 was approximately 63% of the highest estimate. By comparison, model sensitivity to the uncertainty associated with a 10% change in values of key parameters caused less than a 25% change in baseline production estimates under any given set of environmental conditions. Galveston Bay is typical of most bay estuarine systems of the northern Gulf of Mexico, and this variation in simulated production estimates is consistent with the year-to-year variability in estimates of brown shrimp catch per unit of effort (CPUE) in the northern Gulf of Mexico (Pollack and Ingram, 2012). The importance of interaction between environmental conditions within and outside the bay system in generating this year-to-year variability in brown shrimp production was emphasized by simulations in which we shifted the seasonality of recruitment. Over the range of seasonal shifts simulated (from 28 days earlier to 42 days later in the year), the lowest production estimate was approximately 70% of the highest estimate. These simulations suggest that shifts in seasonality of recruitment caused by environmental conditions outside the bay may cause differences in production in any given year equal to those resulting from differences in environmental conditions within the bay. Furthermore, although earlier recruitment generally results in relatively lower production and later recruitment in relatively higher production (undoubtedly temperature-related), recruitment delayed beyond some threshold, which depends on conditions within the bay, may result in relatively lower production. In our simulations, this threshold ranged from a delay of 28-42 days (e.g., under bay conditions representative of the calendar years 2012 and 2007, respectively). Various mechanisms that may cause variability in the timing of postlarval recruitment have been proposed. During winter and early spring, Arctic frontal passages are common and drive currents offshore, delaying postlarval emigration from Gulf waters (Benfield and Downer, 2001;Wenner et al., 1998). Additionally, brown shrimp may actively delay their emigration from the Gulf to shallow water habitats in response to cold frontal passages via vertical migration (Rogers et al., 1993). Hughes (1969) suggested that pink shrimp Farfantepenaeus duorarum sense changes in salinity and tide state as cues to enter estuaries, and Blanton et al. (1999) found evidence that white shrimp Litopenaeus setiferous likely utilize a set of cues that include tidal phase, water temperature, and wind. It also has been suggested that timing of recruitment may be affected by endogenous rhythms that control the swimming activity of postlarval penaeids (Ogburn et al., 2013). Superimposed on effects of timing of recruitment on shrimp production are effects of differences in magnitude of recruitment, which we held constant in all our simulations. This simplifying assumption facilitated identification of the relative effects on production of environmental conditions within the bay, in which we were most interested. This assumption could be relaxed in future work with the model. Data from 22 years of sampling postlarvae entering Galveston Bay (Matthews, 2008) suggest that annual peak abundances may be as much as 80 times the mean annual abundance, and peak annual population estimates of small shrimp (12-20 mm total length) based on data collected at the Galveston Island State Park over an 11-year sampling period differed by as much as five times (Rozas et al., 2007). Our model calibration exercises suggested a linear relationship between model estimates of shrimp production and total number of shrimp recruited during a simulation. However, this linear relationship results from our representation of the growth, mortality, and movements of individual shrimp as being independent of shrimp population density. These also are simplifying assumptions that could be relaxed in future work with the model, perhaps drawing on some of the studies mentioned below. Brown shrimp appear to feed mainly on benthic infauna (McTigue and  Laboratory and field caging studies have demonstrated that foraging by both brown shrimp and white shrimp Litopenaeus setiferous can reduce populations of benthic infauna (Beseres and Feller, 2007;Zimmerman et al., 2000). Field caging experiments have shown some evidence of food limitation of growth (Rozas and Minello, 2009;Rozas et al., 2014), and as shrimp population density increases, per capita availability of food will become limiting at some point. Documenting a densitydependent effect on shrimp growth, however, is difficult because brown shrimp may move to avoid areas of low prey density and may consume alternate food items such as benthic algae and phytoplankton during periods of low infaunal abundance (Gleason, 1986;Gleason and Wellington, 1988;Gleason and Zimmerman, 1984). Brown shrimp mortality appears to result mainly from predation, and laboratory experiments do not suggest a strong relationship between brown shrimp density and mortality (Minello et al., 1989). While the functional response of fish predators may be affected by shrimp density (Holling, 1959), it is likely that such a relationship is size-related, since smaller shrimp are found in higher densities than larger shrimp; our model includes a size-related mortality function. However, seasonal and annual changes in fish predator abundance (Minello and Zimmerman, 1983;Overstreet and Heard, 1978;Rooker et al., 1998) likely change predation rates. The abundance and composition of brown shrimp predators also differs spatially within Galveston Bay, as well as among other bays of the northern Gulf of Mexico (Nelson, 1992). Primary assumptions in our model are that brown shrimp abundance and growth are higher in salt marsh vegetation than in shallow open water. High densities of brown shrimp on the marsh surface and particularly at the marsh edge have been consistently found in Galveston Bay and other Texas estuaries (Minello et al., 2008;, but this pattern may not occur in all estuarine systems and may be related to tidal flooding characteristics (Minello et al., 2012;Rozas and Minello, 2015). Information on habitat-related shrimp growth is limited, but there is some evidence from caging experiments that brown shrimp growth is increased in marsh vegetation (Minello and Zimmerman, 1991;Rozas and Minello, 2009). Populations of benthic infaunal prey also are higher in marsh vegetation than adjacent open water and generally highest at the marsh edge (Whaley and Minello, 2002). This edge effect has not been incorporated into our model, and the model could perhaps be improved by separating marsh edge habitat from the rest of the marsh. Delineation of the area of marsh edge habitat, as opposed to the area of marsh vegetation inundated at high tides, as currently represented in our model, would require finer-scale spatial resolution of habitat distribution in the bay. Such an approach would allow us to simulate the effect of changes in marsh edge on shrimp production, but the explicit inclusion of such fine spatial resolution also would result in longer simulation run times. Future work with the model will be directed at potential incorporation of modeled environmental effects into the Gulf of Mexico brown shrimp stock assessment model (SS-3, Hart, 2012). We expect to explore the relative benefits of relaxing some current model assumptions and also re-parameterize the model to represent conditions in Barataria Bay, Louisiana. Linking living marine resources and their habitat is essential to fisheries stock management (Yoklavich et al., 2010). Ultimately, we hope our model will provide a useful tool, both conceptually and quantitatively, for exploring the linkages between environmental conditions in estuarine nursery habitats in the northern Gulf of Mexico and the production of shrimp species utilizing these habitats (Beck et al., 2001;Boesch and Turner, 1984)."}, {"section_title": "Acknowledgements", "text": "This research was conducted through the NOAA National Marine Fisheries Service, Southeast Fisheries Science Center by personnel from the Fishery Ecology Branch (FEB) at the Galveston Laboratory. The assistance of everyone in the FEB was essential for the successful completion of this project. The model was developed with Habitat Assessment Improvement Plan funding from the NOAA Office of Science and Technology (Project # 11-006). We would like to acknowledge Dan Childers and Jenny Cutler for early work on a similar model. Salinity data from the TxBLEND model was provided by Carla Guthrie and Joe Trungale. The GIS analysis was performed by Philip A. Caldwell. Glenn Sutton and Harmon Brown provided shrimp abundance data from the Texas Parks and Wildlife Department trawl surveys. Rick Hart provided SEAMAP nominal data and brown shrimp abundance indices for the Gulf of Mexico. The findings and conclusions in this report are those of the authors and do not necessarily represent the views of NOAA."}, {"section_title": "Appendix 1.", "text": "This appendix contains a description of the model following the ODD (Overview, Design concepts, Details) protocol for describing individual-based models as outlined by Grimm et al. (2006) and Railsback and Grimm (2012). The model is programmed in NetLogo ® (Wilensky, 1999), which is freely downloadable and runs on most operating platforms. Note that some material included in this appendix, particularly related to the description of submodels <!-(Section 3.3), also is described in the text. This material is repeated here for sake of completeness with regard to the ODD protocol. 1. Overview"}, {"section_title": "Purpose", "text": "The purpose of this model is to simulate the recruitment, growth, mortality, and biomass production of brown shrimp in salt marsh habitats of the northern Gulf of Mexico as a function of temperature, salinity, and access to the tidally inundated, vegetated marsh surface. The model currently is parameterized based on available literature describing relationships between brown shrimp and the environmental characteristics of Galveston Bay, Texas. However, the model could be re-parameterized to represent the environmental conditions in other northern Gulf of Mexico salt marshes, such as those found in Barataria Bay, Louisiana, and model production estimates could be used as input to the brown shrimp stock assessment model of the U.S. National Marine Fisheries Service (SS-3)."}, {"section_title": "Entities, state variables, and scales", "text": "State variables include (1) 100 habitat cells and (2) a variable number of individual shrimp. Attributes of habitat cells include (1) location (x and y coordinates), (2) habitat type, (3) salinity zone (low, 0-10 PSU; medium, 11-20 PSU; high, >20 PSU), (3) current salinity (PSU), and (4) water temperature ( • C). Attributes of individual shrimp include (1) state (alive, dead, emigrated), (2) age (hours), (3) recruitment-day (day-of-year), (4) death-day (day-of-year), (5) emigration-day (day-of-year), (6) size (total length in mm), (7) inmarsh? (yes or no), (8) in-habitat (current habitat type), (9) in-zone (current salinity zone), (10) prob-mort (current daily probability of dying), (11) growth/h (current hourly growth rate), and 12growth/day (current daily growth rate). Each simulated individual shrimp is a \"super-individual\" (Scheffer et al., 1995) representing 1 million \"real\" shrimp. The global environment is defined by (1) the 100 habitat cells, each representing a 635-ha area of the 63,500 ha Galveston Bay system, including habitats of intermittently flooded marsh vegetation (Marsh, 17 cells), non-vegetated marsh edge (NVME, 28 cells), and shallow non-vegetated water (SOW, 55 cells), (2) height of the marsh edge, and (3) time series of input data representing (a) tide heights, (b) median air temperatures, (c) the distribution of salinity zones among habitat types, and (d) number of newly-recruited shrimp. Each simulated time step represents one \"real\" hour, and simulations are run for 5832 h, which represents the period from January 1 through August 31st. This time span should be sufficient to represent environmental influences affecting the annual production of brown shrimp, since few shrimp appear in the open bay after the end of August (Brown et al., 2013;Martinez-Andrade et al., 2005), and most shrimp are spawned and harvested within a year."}, {"section_title": "Process overview and scheduling", "text": "An overview of the sequence of events and processes involved in the execution of the model is provided in Fig. A1.1. After values of model parameters are set, spatial structure of the model is defined, and output files are initialized, time series of values of input data for the year being simulated are read into the model. Then sub-models are executed iteratively until the end of the 243-day (January through August) simulation. Sub-models calculating (1) water temperatures in vegetated and non-vegetated habitats, (2) tide height and marsh flooding, (3) shrimp movements, (4) shrimp mortality, (5) shrimp emigration, and (6) shrimp growth, as well as sub-models (7) summarizing attributes of the shrimp population and (8) writing simulation results to output files, are executed each hour. Sub-models updating (1) shrimp recruitment, and (2) median air temperature are executed at the beginning of each day. Sub-models updating the distribution of salinity zones are executed at the beginning of each month."}, {"section_title": "Design concepts", "text": ""}, {"section_title": "Basic principles", "text": "Juvenile brown shrimp are present in several habitat and bottom types as well as shallow open water (Fry, 2008;Minello, 1999;Stunz et al., 2010), but they are found in highest densities associated with emergent vegetation along the edge of salt marsh habitats (Minello et al., 2003;Minello and Rozas, 2002; Ini tiali zation Set parameter values (m arsh edge elev ation (m ), prob abi lity of moving into marsh if marsh is flooded, si ze (mm) at whi ch shrimp are recruit ed to mar sh, si ze (mm) at whi ch sh rimp emi gra te from marsh) Create in itial habi tat types (m arsh vegetation, non-vegetat ed wate r < 150m from marsh edge, non-vegetated water ≥ 150m from marsh edge) and salini ty zon es (low, medium, hi  Daily shrimp recruitment (number of individuals, 365 v alues, the same for all years si mulat ed) Fig. A1.1. Overview of the sequence of events and processes involved in the execution of the model. . Understanding the relative value of juvenile habitats, potential nurseries, and essential fish habitat (EFH) is critical to the management of adult populations (Adams et al., 2006;Beck et al., 2001). In our model, we are examining the basic principles associated with the nursery role concept, specifically, how differences in habitat and environmental qualities affect the successful recruitment of sub-adult shrimp to the fishery. Linkages between environmental variables (e.g., salinity, temperature, access to emergent marsh vegetation) and brown shrimp vital rates have been identified (Barrett and Gillespie, 1973;Boesch and Turner, 1984;Turner, 1992;Zein-Eldin and Aldrich, 1965;Zimmerman et al., 2000;many others). Salt marshes provide refuge from predators (Minello, 1993;Minello et al., 1989;Minello and Zimmerman, 1983) and abundant food to support rapid growth Zimmerman, 1991, 1998;Whaley and Minello, 2002). Here, we model the cumulative effects of these linkages."}, {"section_title": "Emergence", "text": "Population size, standing biomass, and size structure emerge from the model processes controlling growth, mortality, and movement of individuals. Production from the marsh is driven by the effects of temperature, salinity, and tide height on the processes of growth, mortality, and movement."}, {"section_title": "Adaptation", "text": "Shrimp that recruit to the marsh complex have the ability to move between vegetated and non-vegetated habitats. During each time step in which the marsh surface is flooded, each shrimp has a 0.69 probability of staying in or moving into marsh vegetation. This recreates in the model, abundance patterns that have been observed in the field (Minello et al., 2008;Minello and Rozas, 2002), and is indirectly objective-seeking."}, {"section_title": "Sensing", "text": "Shrimp in the marsh complex (marsh vegetation plus marsh water) can sense when the vegetated marsh is flooded and is accessible. When a shrimp moves from one patch to another, it also can sense the salinity of other patches, which allows movement to a patch with the same salinity of the one it is leaving."}, {"section_title": "Stochasticity", "text": "During initialization, and subsequently when the number of cells representing each type of salinity zone changes, salinity zones are assigned to cells stochastically. During simulations, each hour, the order in which individual shrimp are chosen to execute their activities is randomized. Mortality of individuals is represented as a daily probability of dying, and movement of individuals between the vegetated marsh surface and the non-vegetated marsh is represented probabilistically."}, {"section_title": "Observation", "text": "The most important model output is an estimation of annual brown shrimp production from the shallow estuarine habitats of the bay. The total population of shrimp in the bay, the shrimp density within each habitat type and salinity zone, and the standing biomass can be observed from the model. The production of shrimp per hectare of marsh complex and per hectare of shallow water also can be observed, as can the number of shrimp recruited to the open bay population."}, {"section_title": "Details", "text": "3.1. Initialization (Fig. A1.1) First, values are assigned the parameters representing (1) elevation (m) of the marsh edge for the year being simulated (=1.477 + ((calendar-year − 2013) * 0.0053)), (2) probability of an individual moving into (staying in) marsh vegetation (=0.69), (3) size (total length in mm) of shrimp at recruitment (=10), and (4) size of shrimp at emigration (=70). The estimate of the average elevation of the marsh edge in 2013 was based on tide gauge station data from measurements at 12 marshes in 2013 (http://co-ops.nos. noaa.gov/). This elevation is adjusted for the year being simulated based on estimated changes due to relative sea level rise (Fig. 5a) (see Section 3.3.5). Next, habitat types (which do not change during the simulation) and salinity zone types (which do change during the simulation) are assigned to cells. Moving from left to right along a 25 × 4 cell lattice, 17 cells are defined as marsh, 28 cells are defined as nonvegetated marsh edge (NVME), and 55 cells are defined as shallow open water (SOW). The relationship of this spatial arrangement of habitat types to the geography of Galveston Bay is shown in Figs. 1 and 2. The 100 habitat cells, each representing 1% of the total modeled area in Galveston Bay, were identified based on a GIS analysis of 2006 USFWS National Wetland Inventory (NWI) data and a bathymetry analysis for the bay. Habitat types from this analysis were classified as either marsh vegetation, or shallow water. Previous analyses in Galveston Bay estimated that the water (ponds and creeks) included within the marsh complex was 1.63 times the amount of vegetated area (Minello et al., 2008). We used this multiplier to estimate the total amount of water associated with the marsh vegetation identified in the NWI for the bay. The marsh complex, therefore, consisted of 45 patches (17 patches of marsh and 28 patches of NVME), with the remaining 55 patches of SOW. The appropriate number of cells in each habitat type is assigned to a particular salinity zone based on a GIS analysis of the TxBLEND model output for the month (see section on input data below). (Fig. A1.1) Hourly tide heights, daily median air temperatures, monthly distribution of salinity zones among habitat types, and daily recruitment numbers are read from external files. We developed these input data for Galveston Bay based on analyses of data collected over the 30-year period from 1983 to 2012. Hourly tide heights (Fig. 5b) were based on tide data from the Pier 21 NOAA tide gauge (NOAA Tides and Currents https://tidesandcurrents. noaa.gov/waterlevels.html?id=8771450). Daily median air temperatures (Fig. 5c) were obtained from the NOAA National Center for Environmental Information, (http://www.ncdc.noaa.gov/cdoweb/search). Monthly salinity values for each of the three salinity zones (Fig. 5d), as well as the numbers of cells representing each salinity zone, were based on TxBLEND modeling of the Galveston Bay system (Guthrie et al., 2014). Salinity zones were categorized as low (0-10 PSU), medium (10-20 PSU), or high (>20 PSU) and salinities within these zones, as well as distribution cells representing these zones, were estimated monthly based on TxBLEND output. We assumed that daily salinities did not vary within months."}, {"section_title": "Input data", "text": "Daily recruitment numbers (Fig. 5e) were based on several studies of the magnitude and timing of postlarval recruitment, as well as our unpublished data, which indicated that shrimp begin to move through the passes into the bays in mid-March with peak recruitment numbers occurring in April (Baxter and Renfro, 1967;Berry and Baxter, 1969;Matthews, 2008). Abundance patterns from drop sampler data recorded monthly and bi-monthly over 11 years in the marsh complex within Galveston Island State Park indicated that abundance of settlers appears to peak two weeks after the average peak of postlarvae entering the bay (Rozas et al., 2007). We used the temporal pattern of recruitment from the passes with a delay of two weeks as a recruitment pattern for shrimp to the marsh. Since shrimp density in Galveston Bay differs depending on habitat type and salinity (Minello, 1999;Minello et al., 2008), we distributed the recruited shrimp among habitat cells based on the current spatial distribution of habitat types and salinity zones using a standardized relative density matrix (described in Table A1.1). (Fig. A1.1) 3.3.1. Update salinity zones (low, medium, high). The number of cells in each salinity zone in each habitat type is updated monthly based on input data, with each cell assigned a salinity zone probabilistically based on its habitat type and a salinity corresponding to its salinity zone (see data input section)."}, {"section_title": "Submodels", "text": "3.3.2. Update shrimp recruitment. Shrimp recruitment (number of shrimp entering the system) is updated daily (shrimp are recruited into the system in a single cohort at midnight) based on input data (Fig. 5e, see data input section). 3.3.3. Update median air temperature. Median air temperature is updated daily based on input data (Fig. 5c, see data input section). 3.3.4. Calculate temperatures in vegetated and non-vegetated habitats. Hourly temperatures in marsh cells and the non-vegetated habitats (NVME and SOW) are based on daily median air temperature ( Fig. 5c) and hourly bottom water temperatures measured from March 16, 2006 through May 31, 2007 in a Galveston Bay Table A1.1 Description of process flow for recruit distribution using the relative density matrix. The following steps are included in the model programming as a method of distributing the daily recruits to the system. marsh complex, both within the vegetation (5 m from the edge) and in shallow water (ranged between 0.5 and 1.5 m deep depending on tide) outside of the vegetation (unpublished data). We first calculated mean hourly deviations of field data from mean daily water temperatures by month. Next we developed monthly regressions between the non-vegetated water temperature and the median daily air temperature. We then estimated hourly non-vegetated water temperatures functions by month and hour. Finally, we estimated hourly vegetated water temperatures based on an empirical relationship between the vegetated water temperature data and non-vegetated water temperature data. 3.3.5. Update tide height and calculate marsh flooding. Hourly tide height (Fig. 5b) is based on hourly tide station data (NOAA gauge 8771450, Galveston Pier 21) and is used to determine if the marsh surface is flooded. In 2013, we measured flooding rates in twelve salt marshes of Galveston Bay, and related average water level at the marsh edge to an elevation of 1.477 m on the Pier 21 gauge (station datum). If the station datum was 10 cm higher than this marsh edge height in 2013, we considered the marsh to be flooded and accessible to brown shrimp. For other years, we adjusted this level on the Pier 21 gauge to account for relative sea level rise over the period of our model runs (Fig. 5a). The bay experienced relatively high levels of subsidence over this period due to oil and groundwater extraction (Feagin et al., 2005). We plotted mean sea level on the Pier 21 gauge from 1970-2014 and determined that relative sea level on the station datum increased 5.4 mm/year over that period. We therefore adjusted the elevation of the marsh edge in relation to the gauge by this amount each year. This adjustment assumes that the gauge and the marshes are sinking relative to sea level at the same rate, and that the vertical location of the marsh edge is mainly determined by an inability of S. alterniflora to withstand further tidal inundation (McKee and Patrick, 1988;Minello et al., 2012;Tiner, 1993). 3.3.6. Calculate shrimp movements. Shrimp move between the NVME and marsh when the latter is flooded. Shrimp in the marsh move to the NVME when the former no longer is flooded. Shrimp in the SOW do not leave that area. Shrimp growth, emigration, and mortality occur in all areas, with growth rates and mortality probabilities differing among areas (and also depending on temperature and salinity, see Fig. 3). The quantitative representations of movement, growth, mortality, and emigration of individual shrimp included in the model are summarized schematically in Fig. 3. Rules representing the movement of individuals, described in the preceding paragraph, are probabilistic. If the marsh is flooded, each hour each individual located in either the marsh or the NVME has a 69% probability of moving to a cell with the same salinity in the marsh and a 31% probability of moving to a cell with the same salinity in the NVME. If there is no cell with the same salinity, the individual moves into a cell with the salinity closest to the salinity of the cell from which it moved. Thus any given individual may move back and forth between these two areas during periods of marsh flooding, but is likely to spend slightly more than twice as much of this time in the marsh. 3.3.7. Calculate shrimp mortality. Mortality (probability of dying) is a function of a base rate (0.00083 h −1 ) multiplied by two indexes representing (1) a size (of the individual) effect and (2) a habitat effect (Fig. 3). The size effect is based on total length (53.092 * (total length in mm) −1.1163 ). Thus mortality decreases exponentially as total length increases, following the pattern described by Roth et al. (2008) and supported by field data from Minello et al. (1989). The habitat effect is represented as a constant, which is different for marsh vegetation (0.69) versus the two areas of non-vegetated water (1.38). The presence of marsh vegetation reduces brown shrimp mortality (Minello, 1993;Minello et al., 1989). There also is some experimental evidence of temperature related mortality. Zein-Eldin and Aldrich (1965) reported increased mortality at temperature extremes, especially for brown shrimp in lowsalinity water (as high as 80% mortality in 11 • C water that had less than 15 PSU). However, there is limited data on the behavior of shrimp under these conditions in the field, and potentially, they can avoid extreme temperatures through movement to deeper water or by burrowing in the substrate (Aldrich et al., 1968). Thus, we chose not to include temperature-related mortality in the model. 3.3.8. Calculate shrimp emigration. Individuals emigrate when they attain a length of 70 mm (they are recruited at a length of 10 mm) (Cook and Lindner, 1970). 3.3.9. Calculate shrimp growth. Growth is a function of the water temperature, salinity, and habitat conditions (marsh, NVME, SOW) to which an individual is exposed (Fig. 3). A probabilistic base growth rate (0.0416 ± 0.0104 mm h −1 ) is multiplied by two indexes representing (1) a water temperature-salinity effect and (2) a habitat effect. The water temperature-salinity effect is represented as a polynomial function of water temperature, which is different for each of the three salinity zones (Fig. 4). Hourly water temperatures for NVME and SOW are calculated based on the median air temperature, and hourly water temperatures for the marsh is calculated based on a relationship between the water temperature in open water and that in the marsh. The habitat effect is represented as a constant, which is different for each of the three habitats (1.28, 1.14, and 1.0 for marsh, NVME, and SOW, respectively). Brown shrimp grow ≈1 mm per day in total length (Knudsen et al., 1977), and experience fastest growth at ≈30 • C, assuming access to plentiful food (Zein-Eldin and Aldrich, 1965). Salinity  1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 Production ( 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 Production ( appears to affect growth both directly through osmoregulatory costs and indirectly by controlling the abundance of benthic infaunal prey (Adamack et al., 2012;Rozas andMinello, 2011, 2015), with growth being lowest at salinities between 0-10 PSU. While it has been difficult to directly measure the effect of intertidal vegetation on shrimp growth due to potential experimental artifacts (Kellison et al., 2003;Peterson and Black, 1994), there is some experimental evidence suggesting that growth rates of brown shrimp are increased in marsh habitat (Minello and Zimmerman, 1991;Rozas and Minello, 2009). Benthic infaunal food for shrimp also is found in higher abundance on the vegetated marsh surface, especially within the first meter from the edge (Whaley and Minello, 2002). Based on these data, we represented growth rate as being fastest when shrimp are in the marsh, and slowest when they are located in the SOW. 3.3.10. Summarize attributes of shrimp population. After each hour of simulated time, (1) standing biomass (kg ha −1 ) of the shrimp population (calculated as (0.000006 * (mean-sizemm 3.071 ) * number of simulated shrimp * number of real shrimp per simulated shrimp)/63,500) and (2) shrimp biomass production (kg ha −1 ) (calculated as 0.000006 * (70 3.071 ) * number of emigrated shrimp) are calculated. production (kg ha −1 ) to changes of ±10% relative to baseline in parameter values representing individual growth rate, probability of mortality, and probability of moving into (staying in) the area of intermittently flooded marsh vegetation. Production from January through August in Galveston Bay, Texas, U.S.A., is presented for each of 10 replicate stochastic (Monte Carlo) simulations run under environmental conditions representing the calendar year 2012 and the indicated parameter changes. 3.3.11. Write to output files. After each hour of simulated time, in addition to the current values of the attributes of the shrimp population described in the previous section, the current values of environmental conditions (tide height, median air temperature, water temperatures in vegetated and non-vegetated habitats, salinities in low, medium, and high salinity zones) and descriptors of current habitat conditions (number of cells in salinity zone in each habitat type and whether or not the marsh is flooded) are written to Excel text files."}, {"section_title": "Appendix 2.", "text": "This appendix contains results of each of the replicate stochastic (Monte Carlo) simulations run under baseline conditions and as part of the various sensitivity analyses presented in the text. These include sensitivity of model estimates of brown shrimp (Farfantepenaeus aztecus) production (kg ha −1 ) (1) to changes in the number of \"real\" shrimp represented by each simulated shrimp, example year, 2012 ( Fig. A2.4), (2) to the 30 different sets of baseline environmental conditions (Fig. A2.1), (3) to changes of ±10% relative to baseline in parameter values representing individual growth rate, probability of mortality, and probability of moving into (staying in) the area of intermittently flooded marsh vegetation in example year, 2012 ( Fig. A2.2), (4) to changes of ±10% relative to baseline values of the time series of input data representing tide heights and median air temperatures in example year, 2012 ( Fig. A2.3), and (5) to changes relative to baseline in the timing of shrimp recruitment (Fig. A2.5).   1993 1994 1995 1996 1997 Production (kg/ha) Fig. A2.5. Sensitivity of model estimates of brown shrimp (Farfantepenaeus aztecus) production (kg ha −1 ) to changes relative to baseline in the timing of shrimp recruitment. Production from January through August in Galveston Bay, Texas, U.S.A., is presented for each of 10 replicate stochastic (Monte Carlo) simulations run under environmental conditions representing the indicated calendar year with the indicated change in the timing of recruitment. Minus 14, −21, and −28 represent recruitment occurring 14, 21, and 28 days earlier than baseline, whereas 14, 21, 28, 35, and 42 represent recruitment occurring 14, 21, 28, 35, and 42 days later than baseline. The relative shape of the recruitment curve (Fig. 5e) was not changed, the entire curve was shifted earlier or later in the year."}]