[{"section_title": "RELATED NCES REPORTS", "text": "Trends in the Receipt of Pell Grants: Selected Years, 1995-96 to 2007-08 (NCES 2011."}, {"section_title": "Persistence and Attainment of 2003-04", "text": "Beginning Postsecondary Students: After Six Years (NCES 2011-151)."}, {"section_title": "Persistence and Attainment of Beginning", "text": "Students With Pell Grants (NCES 2002-169).  (NCES 2006-180) http://nces.ed.gov/pubsearch/ pubsinfo.asp?pubid=2006180 Students Longitudinal Study (BPS:04/06) Methodology Report (NCES 2008-184) http://nces.ed.gov/pubsearch/ pubsinfo.asp?pubid=2008184.   NOTE: \"Low income\" includes only those students in the 1st through 25th percentiles of income. For dependent students, this is the income of the parent(s). For independent students, this is the student's income plus any income from a spouse, if applicable. Percentile ranks were calculated separately for dependent and independent students. Detail may not sum to totals because of rounding.    NOTE: \"Middle-low income\" includes only those students in the 26th through 50th percentiles of income. For dependent students, this is the income of the parent(s). For independent students, this is the student's income plus any income from a spouse, if applicable. Percentile ranks were calculated separately for dependent and independent students. Detail may not sum to totals because of rounding.   NOTE: \"Middle-high income\" includes only those students in the 51st through 75th percentiles of income. For dependent students, this is the income of the parent(s). For independent students, this is the student's income plus any income from a spouse, if applicable. Percentile ranks were calculated separately for dependent and independent students. Detail may not sum to totals because of rounding."}, {"section_title": "2004/06 Beginning Postsecondary", "text": ""}, {"section_title": "THIS ANALYSIS", "text": "Total students (in thousands) Table S4.-Standard errors for table 4: Percentage distribution of cumulative persistence and attainment  Table S4.-at any institution of middle-high income quartile, first-time beginning students in 2003-04,  Table S4.-by initial Table 5.-income quartile, first-time beginning students in 2003-04, by initial degree program, receipt Table 5.-of Pell Grants, and dependency status: Spring 2009 NOTE: \"High income\" includes only those students in the 76th through 100th percentiles of income. For dependent students, this is the income of the parent(s). For independent students, this is the student's income plus any income from a spouse, if applicable. Percentile ranks were calculated separately for dependent and independent students. Detail may not sum to totals because of rounding. Total students (in thousands) Table S5.-Standard errors for table 5: Percentage distribution of cumulative persistence and attainment  Table S5.-at any institution of high income quartile, first-time beginning students in 2003-04,  Table S5.-by initial "}, {"section_title": "Total students (in thousands)", "text": "GLOSSARY G1"}, {"section_title": "Glossary", "text": "All of the variables used in this report are described in this glossary, and can be found in the 2004/09 Beginning Postsecondary Students Longitudinal Study PowerStats. PowerStats is a web-based application that generates tables from selected NCES datasets. It can be accessed at http://nces.ed.gov/datalab. In the glossary, items are listed in alphabetical order by item label. The name of each variable appears to the right of the variable."}, {"section_title": "BPS:04/09 panel weight WTB000", "text": "The BPS:04/09 panel weight was used to produce the tables in this report. This is the longitudinal study weight that is used for the analysis of the beginning students for whom sufficient survey data were available to be included as sample members in all 3 years of the BPS interviews (2004, 2006, and 2009)."}, {"section_title": "Cumulative Pell through 2009 PELLCU09", "text": "Indicates the cumulative amount of Pell grant funds a student received between the 2003-04 and 2008-09 award years. For these Web Tables, this continuous  No degree, still enrolled The respondent had not attained a degree by spring 2009, but was still enrolled in postsecondary education. No degree, left The respondent had not attained a degree by without return spring 2009, and was not enrolled in a postsecondary institution in spring 2009. In these Web Tables, all categories excluding \"no degree, left without return\" were collapsed to \"Attained or persisted as of spring 2009.\""}, {"section_title": "GLOSSARY G2", "text": "Degree program, 2003-04 UGDEG Indicates the undergraduate student's degree program during the 2003-04 academic year. It is based primarily on the 2004 interview question \"What degree were you working on at [the National Postsecondary Student Aid Study (NPSAS) sample school]?\" For nonrespondents, the degree program reported by the NPSAS institution or reported by the student in the federal financial aid application was used. This variable was edited to ensure that the degree program students reported was actually offered by their institution. Thus students who reported working on a bachelor's degree at a 2-year college were classified as in an associate's degree program and students who reported working on a bachelor's degree or an associate's degree at a less-than-2-year college were classified as in a certificate program. This variable has four categories: No degree The student was not enrolled in a certificate or degree program."}, {"section_title": "Certificate", "text": "The student was enrolled in a certificate program below an associate's degree. Associate's degree The student was enrolled in an associate's degree program. Bachelor's degree The student was enrolled in a bachelor's degree program. In these Web Tables, the categories \"Associate's degree\" and \"Bachelor's degree\" were collapsed to \"Degree-seeking.\""}, {"section_title": "Dependency status DEPEND", "text": "Student's dependency status for federal financial aid purposes. Students were considered to be financially independent of their parents for federal financial aid purposes if they were age 24 or older on December 31 of the academic year or if they met any of the following criteria: were married; had dependents; were veterans of the U.S. military or on active duty; were orphans or wards of the court; or were enrolled in a graduate or first-professional degree program. All other students under 24 were considered dependent unless they could document that they were receiving no parental support and were determined to be independent by a financial aid officer. Taken from the Free Application for Federal Student Aid (FAFSA), student interview, or institution records."}, {"section_title": "Dependent Independent", "text": ""}]