[{"section_title": "", "text": "the importance of this community, the history of American Beach was researched with regard to its origins. Then the most feasible options for the protection of American Beach were taken into consideration and presented as several recommendations. Chapter 2 discusses the three most common threats to African American coastal communities and how those threats can be mitigated. Chapter 3 examines the history of several historic African American beach communities, outlining their history, and focusing on how their cultural landscapes have, or have not been protected. In addition, this chapter ends with an analysis of all available protections, including some not found in service to these beaches. Chapter 4 discusses American Beach with regard to its historic context and significance within the greater African American narrative of Amelia Island and the United States. It also introduces American Beach as a case study through a brief version of an Area Character Appraisal. As will be discussed in further detail, Area Character Appraisals are meant to document, assess and define the design elements that make a particular neighborhood or community unique. Chapter 5 discusses the existing protective infrastructure that is in place with regard to American Beach. The neighboring city of Fernandina Beach is examined with regard to how it was able to create two historic districts, and how those historic district guidelines can be used for American Beach. Then the legal documents that are currently on the books in Florida and Nassau County were examined to see what codes, laws and ordinances are available to protect this historic community. Also in this chapter, several organizations that have been involved with American Beach's recognition and protection over the years are acknowledged to see which ones have been beneficial to the community. Finally, Chapter 6 examines the best options for preserving American Beach. The hope is that this thesis will be a useful tool for the community of American Beach, and give them additional options with regard to preserving their community's historic character and cultural heritage."}, {"section_title": "CHAPTER 2: THREATS TO COASTAL COMMUNITIES", "text": "Coastal communities will always have threats, especially those that are historically African American. These places face threats from human interaction as well as threats from the natural environment. This chapter looks at three specific threats: loss from neglect, loss of character from incompatible development, and loss from natural disasters. These threats are looked into so that communities know what they are up against, and how they can prepare or avoid further damage and loss."}, {"section_title": "Loss from Neglect", "text": "The Civil Rights Act was signed into law by President Lyndon B. Johnson on July 2, 1964, but was first brought to the forefront by President John F. Kennedy during a nationally televised address on June 6, 1963. President Kennedy spoke to the nation about taking action to guarantee equal treatment for every American regardless of race. President Kennedy was assassinated before he could sign this Act into law, so President Johnson was the one who officially signed the Act. The purpose of the Civil Rights act was: To enforce the constitutional right to vote, to confer jurisdiction upon the district courts of the United States to provide injunctive relief against discrimination in public accommodations, to authorize the Attorney General to institute suits to protect constitutional rights in public facilities and public education, to extend the Commission on Civil Rights, to prevent discrimination in federally assisted programs, to establish a Commission on Equal Employment Opportunity, and for other purposes. 1 The Civil Rights Act set out to accomplish equality for all, and this allowed for a new found freedom for African Americans across the country. While these advancements were something to celebrate, they also ironically became the downfall for these once lively African American coastal communities. These coastal African American communities flourished during segregation, but after the passage of the Civil Rights Act, they slowly began to disappear. Places that were once off limits to African Americans were now the hot spots to be, and most of the time closer to home. This new way of vacationing was the beginning of the end for many African American coastal communities. The decline of these once lively communities came about due to the lack of vacationers frequenting the area. Many of the communities began to see vacant and boarded up buildings because the heirs of former residents had no interest in the area, and did not want to vacation in the same places they did as children. People also did not want to frequent areas that while enjoyable at the time, tended to be a reminder of social, cultural, and political strife. There was also little interest from white public with regard to venturing to these once black resorts. As fewer people came to the area, the businesses had to close up due to a lack of revenue. As the boarded up buildings begin to age at a much faster rate along the coast, they were eventually condemned and torn down. The demolishing of these communities shows just what happened in the name of progress; a loss of a community's history and resources. Even if the entire community was not demolished, the increase in vacant and dilapidated properties puts the rest of the community at risk. The property values will go down as the area becomes undesirable, which increases hazards including safety issues. There is even the possibility of condemnation by local authorities. American Beach is one of those communities that has faced issues due to loss by neglect. Buildings have been abandoned and demolished and lots have been left unkempt. The neglect is due to a variety of different factors, whether it is the inability to pay for the maintenance and upkeep of the structures, or the lack of desire to frequent the area. These issues of neglect and unkempt lots have led to tensions within the community as to how things should be handled."}, {"section_title": "Loss of Character from Incompatible Development", "text": "The next threat is the loss of character from incompatible development, which ties in with the first threat of loss from neglect. The lack visitors frequenting African American resort communities, it made it easier for outsiders to come in and buy up the land (for cheap) from those who had no idea of its worth. This \"coastal capitalism,\" began as soon as blacks began leaving these once lively coastal communities. In his book, The Land Was Ours: How Black Beaches Became White Wealth in the Coastal South, Andrew Kahrl addressed this issue of coastal capitalism and how it has affected these historic African American communities. Kahrl states that coastal capitalism is \"characterized by the commodification of the beach as a commercial asset.\" 2 This trend of turning public coastal land into private spaces started a new form of exclusivity. This change been noted through real estate trends within the United States as the properties along the coast have increased in price over the years. The most sought after land is either beach front, or a short walking distance to the beach. While all beach communities regardless of their history face these challenges, historically African American coastal communities are the ones that have suffered the most. Many of these African American communities are threatened due to development and an insensitivity to a storied past. As the demand for prime real estate increased, the prices and the taxes increased which led to locals being pushed out due to lack of funds or a tempting offer. In these once undesirable sections of the coast, developers and individuals also realized they could buy up prime oceanfront real estate for a fraction of the cost. This led to several African American coastal communities being bought up and bulldozed. Kahrl mentions that during the time of segregation, African American beaches and coastal land ownership by African Americans was at its height, and it has \"steadily eroded in the half-century since.\" Kahrl sees this \"erosion\" of African American coastal ownership as \"less of a matter of historical inquiry and contemporary concern than the manner in which black coastal landownership disintegrated and how such lands became incorporated into modern coastal economies .\" 3 This taking of the land by outsiders and making it a private retreat with large scale buildings has produced a lack of sensitivity to the history of the place that was once there. Many African American communities have over the years been turned into massive resort complexes. These complexes are out of touch with the community's original character and intent. The scale of these modern and contemporary buildings is vastly different than what was previously there, and those buildings take away from the livability of the locals. There is almost a type of competition between developers who understand the land values/investment opportunities, and preservationists who understand the historic and cultural values of a place. The most feasible way to be able to properly protect these communities, is through education. Most likely, the people visiting these resorts have no clue of the history of the area. Preservationists can make strides to protect these disappearing African American coastal communities by cultivating advocacy, educating the community and the locals, and simulating interest with regard to the significance of the place. Three of the African American beach communities in the next chapter no longer exist because of the threat of incompatible development. In addition, American Beach has lost a significant amount of its original acreage because of the large scale resort communities directly to its north and south."}, {"section_title": "Loss from Natural Disasters", "text": "The final major threat to African American coastal communities is the same thing that threatens all coastal communities; the occurrence of natural disasters. The most common and widespread being flooding. Coastal communities also face the possibility of extreme natural disasters --hurricanes and coastal storms, as well as the long term threat of coastal erosion. With regard to flooding, the National Oceanic and Atmospheric Administration (NOAA), created a technical report in February 2018, the Patterns and Projections of High Tide Flooding Along the U.S. Coastline Using a Common Impact Threshold. This report notes in its Executive Summary that NOAA has established three coastal flood severity thresholds to ensure public safety. These flood thresholds are \"based upon water level heights empirically calibrated to NOAA tide gauge measurements from years of impact monitoring by its Weather Forecast Offices (WFO) and emergency managers.\" The types of flooding are broken down by severity: minor flooding is flooding that is more disruptive than damaging, moderate flooding is damaging, and major flooding is destructive. The intent of this report by NOAA is to provide \"an objective and nationally consistent set of impact thresholds for minor/moderate/major coastal flooding.\" The report notes that definitions of these types of flooding are currently lacking, and which limits the ability of new and/or effective products that relate to flood mitigation. NOAA also states that the coastal communities in the United States need guidance about flooding which could happen in the near future, in the coming season, or in the long run. This report gives guidance with regard to exposure and potential vulnerability. 4 The most common type of flooding --minor flooding (also known as high tide flooding or nuisance flooding), leads to public inconveniences such as road closures, overwhelmed storm drains, and the deterioration of infrastructure such as roads and railways. These inconveniences play a huge impact on business and the quality of life for those living in the area. Flooding is increasing around the coastal regions, with more issues occurring along the East and Gulf Coasts. According to the National Ocean Service (NOS), the increase in high-tide flooding is due to \"climate-related sea level rise and land subsidence (sinking) combined with loss of natural coastal barriers.\" The effects of rising seas along the coastline is predicted to become more noticeable, more severe, and cause more of an impact on these communities and environments than any other climate-change related factor. 5 Another type of flooding is caused by storm surge, which is a common issue during large storms and hurricanes. Storm surge is an abnormal rise in seawater during a storm, which is caused by the storm's winds pushing water onshore. The amplitude of the surge depends on the orientation of the coast with regard to the storm's track, as well as the storm's intensity, size and speed. 6 Besides the effects of flooding from large storms and hurricanes, another threat to coastal communities comes from changes to the shoreline from the waves, currents, tides, and windthis is known as coastal erosion. Coastal erosion is defined as the loss of shoreline sediment. It is a natural, but complex process that continually reshapes the shoreline. Coastal erosion can also be greatly influenced by human interaction and activities including: dredging of ports and nautical waterways, construction of harbors and dams, shoreline armor (seawalls, breakwaters, etc.), and even beach renourishment (the adding of sand). 7 Many coastal communities attempt to stabilize the coast line to protect residential and commercial properties and infrastructure, by building shoreline armoring. Shoreline armoring is made up of structures intended to hold the sea back and to prevent the loss of the shoreline sediment. Often times, shoreline armoring can be detrimental instead of beneficial. The armored shorelines prevent the loss of erosion and help to block the waves by creating a barrier, but often times, that barrier eliminates marine habitats and prevents the natural movement of sediments. The best way to provide for coastal protection, and prevent damage to the natural cycle of the coast, is to make sure that the stabilization efforts are site specific, and they balance the needs of humans and the natural environment. These above mentioned changes in the coastline can be catastrophic and costly. It is imperative to prepare coastal communities for these threats, and give them the ability to bounce back if possible. Local and state governments have been on the forefront in efforts to minimize the environmental, social, and economic impacts of coastal erosion and natural disasters. Through these organizations, communities have tools, information, and training to prepare themselves for the inevitable. In addition to these smaller organizations, there are federal organization like NOS, a branch of NOAA. NOS is dedicated to preparing coastal communities for the threats they will face from natural disasters, sea level rise, storm surge, erosion, etc. One important task that coastal communities can do is to create and build a resilience plan. That way when a disaster occurs, the community is able to take immediate action after the disaster. An assessment of the damage and figuring out a positive solution to deal with the damage will help these communities bounce back and hopefully minimize loss and reduce vulnerabilities. Another branch of NOAA is the National Coastal Zone Management Program, which addresses the nation's coastal issues through a partnership between the federal government, coastal and Great Lakes states and territories. This program is authorized by the Coastal Zone Management Act of 1972, 8 and \"provides the basis for protecting, restoring, and responsibly developing our nation's diverse coastal communities and resources .\" 9 Natural disasters, especially hurricanes have led to the decline in historic structures and landscapes. Many of these disasters create issues with cleaning, clearing and rebuilding, especially for those who are disproportionately affected or ineligible for disaster relief loans. 10 If financial or physical help is not given to those who need it most, these historic properties will not be able to be rebuilt or repaired, thus causing their imminent loss. The Federal Emergency Management Agency (FEMA) is responsible for disaster relief, and the organization has a multitude of policies with regard to how it acts with response to disaster recovery, mitigation and preparedness responsibilities. Unfortunately, while there are a multitude of policies in place, there have been issues with communities receiving help and funding after a disaster occurs. Many of the areas that do not receive immediate assistance tend to be those that are either under privileged or minority communities. Part of the problem is that while there are various federal agencies that provide a range of assistance after major disasters, state, territorial, and local governments are the primary entities in charge of recovery efforts. The state and local governments have to apply for federal assistance themselves. These governments are also responsible for what actions will be taken with regard to recovery. Those homeowners who have experienced loss due to a disaster must first seek help through their homeowner's insurance company. If the individual has not been granted assistance, then they could be eligible for federal funding. The Stafford Act specifies that \"federal agencies providing financial assistance after a major disaster cannot provide assistance to an individual for the same loss for which another the Office of the Legislative Counsel, from the U.S. House of Representatives. \"Coastal Zone Management Act of 1972,\" Office of the Legislative Counsel, accessed March 2018, https://legcounsel.house.gov/Comps/Coastal%20Zone%20Management%20Act%20Of%201972.pdf. 9 \"The National Coastal Zone Management Program,\" Office for Coastal Management, National Oceanic and Atmospheric Administration, accessed March 2018, https://coast.noaa.gov/czm/. 10 The people who are disproportionately affected or ineligible for disaster relief loans tend to be because they are tenants and rent property instead of owning the property. federal program or private insurance company has provided compensation.\" 11 This keeps people from double dipping into financial reserves. Many times, people who rent have a harder time receiving financial assistance than someone who owns their home. Other issues with low income and minority communities is with regard to how long it takes for these communities to receive funding. Often times the more prominent and important areas of towns and cities are taken care of first, and the outlying areas do not receive assistance until a much later date. Though not typically thought of as historic preservation, it is worth looking into all types of protections which could help maintain the historic character of coastal communities. Coastal management, disaster planning, and conservation issues in the United States are important avenues to be aware of when it comes to protecting all coastal communities. These communities face constant threats from erosion, natural disasters, and lack of environmental sensitivity. Thus it is important to look at the different areas of preservation and conservation that address these concerns, and make sure that threats to the character and historic fabric of these coastal communities are minimized and mitigated. As will be discussed in Chapter 3, historic African American beaches have all faced hardships due to at least one, if not all of these threats. These communities have either persevered and figured out ways to protect themselves, or they have succumbed to outside forces and have been lost forever. The first step in trying to save these communities is identifying the threats. Only then can something be done to save them. 11 More information regarding federal assistance can be found in the January 2010 Report to Congressional Requesters by the United States Government Accountability Office. \"Disaster Assistance: Federal Assistance for Permanent Housing Primarily Benefited Homeowners; Opportunities Exist to Better Target Rental Housing Needs,\" United States Government Accountability Office, January 2010, 3. https://www.gao.gov/assets/310/300098.pdf"}, {"section_title": "CHAPTER 3: AFRICAN AMERICAN BEACHES -THEIR HISTORY AND METHODS", "text": "As previously noted, African American coastal communities began to appear during segregation. These coastal communities were sometimes advertised in newspapers, magazines, and city directories, but more often than not they became popular due to word of mouth. The most recognizable guide for African Americans during the middle part of the 20th century, was known as The Negro Motorist Green Book (The Green Book). This guide was published from 1936 to 1963. The 1940 edition of The Green Book can be seen in Figure 1. The idea for The Green Book came from Victor H. Green, a postal worker in New York City who started the guide as a local publication. When the response for copies of other locations became so great, Green made the guidebook a national publication. The Green Book was meant to be a guide to inform African Americans travelers about services, facilities, and lodging that were safe places for them to patronize. According to the 1936 introduction of the guide, the purpose of the guidebook was, \"to give the Negro traveler information that will keep him from running into difficulties, embarrassments and to make his trips more enjoyable.\" 12 The Green Book was updated every year with new businesses and locations. The travelers frequenting these establishments were encouraged to mention that they heard about said establishment from The Green Book. In addition to The Green Book, the United States Department of the Interior published their own guide during this era. The publication was known as \"A Directory of Negro Unfortunately, during segregation, the summer season was a difficult time for African Americans. Many of the local bathing spots were for whites only, and the only accessible places to swim (runoffs, ponds, streams) were less than desirable and often dangerous. The few beaches that were set aside tended to be inferior in quality. It was because of these trying times that several elite African Americans began to establish their own coastal communities as early as the 1890s. This small, but influential group of wealthy African Americans realized that an afternoon of rest, relaxation and play provided a reprieve from their daily struggles. These affluent communities embraced the leisure lifestyle and the opportunity to create their own coastal getaways. Several of these African American coastal communities began to appear along the Atlantic Coast, the Great Lakes, the Gulf Coast and the West Coast. These communities became a place for \"recreation and relaxation without humiliation,\" 14 and a safe haven to spend the day, the weekend, or the summer season. While these coastal communities were all created for, and used by African Americans, these communities also reflected the diversity of black America. The communities tended to be either exclusive retreats with entry restricted to only residents and their guests, religious campgrounds where spirituality took precedence, or \"bawdy, raucous beaches where the sound of jazz and R&B drifted out onto the waters, where flasks of moonshine passed from coat pockets to hands, and where pairs of dice bounced off hard surfaces.\" 15 The heyday for most of these communities was from the 1940s to the 1960s, when they were well established, and the entertainers popular. When the Civil Rights Act was passed on July 2, 1964, many African Americans who had frequented these communities began going to vacations spots that were closer to home, and not previously open to them. The lack of an influx of people, entertainment, and business to these communities ultimately lead to most of their downfalls. This chapter looks at eight historically African American beaches in the United States. These eight beaches were used to survey some of the remaining key examples of historic African American Beaches to compare their history, significance, current status (an active or lost community), and, if possible, the protective measures put in place that have kept these communities alive. While this is a fraction of all of the beaches that were once home to thriving African American communities, the following places were chosen because of their strong historical significance, their ties to the community (both past and present), and the amount of tangible protective strategies available. The communities chosen are focused on the east coast of the United States, with one in the Great Lakes Region, and another on the Gulf Coast. While there are a few remaining communities on the West Coast, they were not included in this survey. It is important to note that more often than not, African American historic sites are preserved on a more informal basis, and thus they do not often get the recognition they deserve. This study of African American beaches shows that there are a range of communities. Some of the beach communities were built by and for a small, but elite group of African Americans who were very exclusive, other communities were open to all classes and were meant for enjoying the entertainment aspect of that community, and still others were meant as religious retreats. A map of the African American beaches that were used in this study can be found in Figure 2  Hurricane Hazel destroyed wooden buildings from the 1930s and 1940s. 16 In 1966, Atlantic Beach became its own municipality, which made it one of the few African American owned, and governed beach communities in the United States. 17 A decline in visitation occurred due to the passage of the Civil Rights Act, so Atlantic Beach sought novel ways to bring revenue and tourists to the city. Since the community has strong ties to the Gullah-Geeche 18  17 Anna Hopkins, \"Black beaches that broke barriers: African American owned vacation spots that made history,\" The Weekly Challenger (St. Petersburg, FL), September 7, 2017, accessed September 2017, http://theweeklychallenger.com/black-beaches-that-brok-barriers-african-american-owned-vacation-spotsthat-made-history. 18 The Gullah-Geeche corridor runs from the Carolinas, down through Georgia and into northeast Florida. The Gullah-Geeche people are descendants of slaves who were brought to the United States from West Africa. The Gullah-Geeche people practice their own unique culture and speak their own unique language. The traditions of their ancestors are alive and well, and can be seen in the sweetgrass baskets that are woven to this day. Anna Hopkins, \"Black beaches that broke barriers,\" September 7, 2017. The first peak was from the 1920s to the 1940s, and the second peak was from the 1950s to the 1960s. Unfortunately, the passage of the Civil Rights Act contributed to the decline of the community due to a lack of people coming to the area, and thus leading to the lack of reinvestment in the community. The area is slowing being revitalized and it has become a community of mostly yearround residents.    and Cottage City Historic District Commission. These partnerships strengthen the community through its connections, and allow for additional resources with regard to preservation and protections. These partnerships can also lead to additional funding through grants which will allow for the rehabilitation and revitalization of buildings, landscapes and the community. Additional options for protections of these historic communities include documentation of the community. This can be done either through a federal organization like the National Register of Historic Places, the National Historic Landmarks Program, or through a private organization that can create a report for the community. Documentation is important because it provides a document of the historical property, building or community by making a detailed record of the value and significance associated with what is being documented. Documentation also acts as a way to interpret or to mitigate the anticipated loss of a property through the recording of information. 52 While documentation does not physically protect the buildings and structures that are being recorded, it may sometimes be the only viable option. Documentation is useful because it helps create a snapshot of what is being threatened and preserves it through images, drawings, photographs, and oral and written history. Another method to preserve a specific building or structure is through the addition of easements. Easements are voluntary legal agreements, that are usually executed as a deed, and meant to permanently protect a specific place. The easement is a part of the chain of title of the property, and runs in perpetuity making sure that all future owners protect the property. Easements are donated by the owner of a property who \"places restrictions on the development of, or changes to, the property and transfers these restrictions to a qualified organization. The organization must be capable of taking on an easement financially and physically, as the organization will need to do inspections of the property in its care. Easements are useful because they protect the historic character of the property, while also allowing the property to be privately owned. The main benefit for property owners is that easements provide tax benefits. 54 It is also 52       The occupation of the Union forces brought freedom to the slaves from the local plantations. After the Civil War, a former slave by the name of Franklin E. Town sought to buy land near the river and close to Jacksonville. While Town never actually purchased property on the south end of the island, and his relationship to the town is unclear, the area became known as Franklintown. Several African American families remained on the island after emancipation and took up residence in Franklintown. One of the early settlers was Gabriel Means, an ex-slave from the The beach was originally a private vacation spot for the company's employees and their family members. The first structures built on the land were private vacation homes for the founders, an open air pavilion for company outings, and guest houses for company officials and employees. The company later opened the beach as a leisure spot to all African Americans. They named it American Beach to \"remind everyone, blacks as well as whites, that the people there were just as American as others in this country.\" 67 This beach community was meant to be a place for \"recreation and relaxation without humiliation,\" and it became known as the \"Negro Ocean Playground.\" Eventually, the other lots were bought by professionals and educators in the area as vacation properties. These single family vacation houses make up most of the buildings within the community.   In 1938, Louis Dargan Ervin had a modest two and a half story home built at 5448 Gregg Street. Ervin was one the first full time agent of the Afro-American Insurance Company. He worked for the company for sixty-three years, and worked his way up the ladder to become inspector, auditor, superintendent, manager, director, cashier, and finally the vice-president. Ervin Street was named for him. Ervin's home on Gregg Street was one of the first houses built at American Beach. The house is on its original site, and retains its original materials, setting and feeling. The house is one of the few original oceanfront buildings in the community, and the only one that has not been significantly altered. The only alteration to the building is regarding the enclosure of the rear porch, but it was made within the first year after the house was constructed. Ervin's Rest is a wood frame building that was constructed over a concrete block two car garage, with its main facade facing the Atlantic Ocean. The exterior siding consists of its original asbestos shingles, and its original wooden, 2/2, double hung windows.  American Beach is a unique African American coastal community in Florida. It has experienced a lot in its eighty plus year history. There have been reasons for celebration and times of despair, but this community has kept a hold of its history and character. There is always going to be a threat from outside forces when there is a community in such an ideal location. While much of the original acreage has been lost and turned into large developments, the core of American Beach and its heart is still there. The community needs to find a way or a variety of ways to make sure that American Beach is protected and around for generations to come. The next chapter addresses what current protections are in place, and which ones need work."}, {"section_title": "CHAPTER 5: EXISTING PROTECTIVE INFRASTRUCTURE", "text": "While American Beach has issues with regard to overdevelopment in the surrounding areas, there is a small but passionate group of people who want to protect this special place. It is due to their hard work over the years that American Beach still retains much of its historic fabric. There have been changes in the area, but due to the amount of support the community has received thus far, it is possible to find ways that will "}, {"section_title": "Lack of Infrastructure", "text": "One of the reasons American Beach has been mostly spared from development is due to a lack of infrastructure within the community. The houses and buildings lack municipal services and utilities. There are also several unpaved roads, minimal fire hydrants and a lack of street lights. There is a small utility provider in the community, American Beach Villas, who provides water to the former A.L. Lewis Motel and a few other residents. There are restrictions when it comes to the septic and well placement on the lots. The setback restrictions require the septic system to be at least five feet from the house, and 75 feet from the well. These restrictions limit the size and square footage of the homes within the community, but, it is possible to ask for a variance from the state. These homes are able to hook up to Nassau County's utilities if the property is located towards the south end of American Beach, near Burney Park. Since the county owns the park, they provide services to its facilities. The houses at this end of American Beach tend to be newer and larger, and have modern conveniences with regard to their plumbing and water. Due to the lack of utilities and infrastructure at American Beach, it has made it difficult for properties to be sold thereby protecting the character of the area. The small 50' by 100' lots have also helped keep developers at bay. These small lots are all individually and privately owned, which makes it difficult to buy up any number of them to develop. While the lack of infrastructure has had a preserving effect on the community, it is not the best solution for the future of American Beach. There are inevitable issues with a lack of proper water and waste facilities. Septic tanks always have the possibility of overflowing or seeping into the ground, which will then affect the drinking water of those using the well. There is also always a risk of fire, and the lack of fire hydrants and water pressure put the community at risk of loss due to natural causes.  83 The Community Redevelopment Act was adopted in 1969, and its purpose it to help revitalize downtowns, preserve historic structures, and enhance the community and designated a CRA district. 84 To be able to document the required conditions listed above, the local government must conduct and prepare a report called a \"Finding of Necessity.\" This report determines if those required conditions exist which then allows the local government to establish a community redevelopment agency and create a CRA to: \"improve their targeted areas,\" exercise the powers of a local government, and finance the project. CRAs are funded through Tax Increment Financing and revenue bonds. This type of financing system is successful because it \"provides specific public services without increasing or levying any new taxes.\" 85 How that works is by determining the value of real property from a fixed date. This fixed date allows for a frozen tax base. The increase in \"total taxable property value between the base year and year two is called 'the increment.' The total tax increment revenues are deposited into the CRA's trust fund for use in redevelopment projects only within the CRA district.\" 86 This allows for any money paid on the properties within the CRA to be funneled back into the community, ultimately acting as a revolving fund to help with preservation and community needs. Currently, the Nassau County Planning Department has been in talks with the American Beach Property Owners' Association, Inc. to once again try to establish a CRA. The first CRA was originally prepared for the Association, and for consideration by the Nassau County Commission in September of 2001. Unfortunately, the proposal was not accepted due to internal issues and community disagreement. At the time of the first CRA, \"several members of the homeowners association asked Nassau County commissioners to declare the beach blighted and create a Community Redevelopment Agency.\" 87 These members wanted a CRA so that tax money could be used within the community for improvements to the beach's infrastructure. The property owners in disagreement with this plan did not want the CRA because it would \"drive up property values and create an incentive for people to sell out.\" Those property owners sued to stop the CRA, and the plan ultimately fell through due to lack of support. 88 The proponents for the redevelopment and rehabilitation of American Beach are pushing for the CRA because there are health concerns for the community due to the lack of adequate water and sewage disposal. The hope of the Nassau County Planning Department is that the CRA will allow for the proper infrastructure to be added to the community to improve the lives of the residents. The idea of redevelopment and rehabilitation, along with updated roads, and proper water and sewage have added to the uneasiness of the community. These changes bring concerns that the plan would make it easier for developers to encroach even further on the remaining acreage. The health and safety of those living in the community are important to keeping the area vibrant, which includes adding proper sanitary needs that meet code. Meeting these needs and keeping the community as undiluted as possible is a high priority to making sure the authenticity and character of this historic beach remains for years to come. To be able to successfully designate American Beach as a CRA, the plan needs to have the support of the members of the community. Without the communities support and understanding of the process, the CRA will be shut down again."}, {"section_title": "Neighboring Fernandina Beach", "text": "Fernandina Beach is the only incorporated municipality on Amelia Island. The city is located on the northern end of the island and has two historic districts: the Old Town Historic District and the Downtown Historic District. This section will look at the history of each of these historic districts, and the historic preservation guidelines associated with each district. The analysis of these historic districts will give a better insight as to how American Beach could possibly create its own recognized historic district."}, {"section_title": "Old Town Historic District", "text": "The area that is now known as Old Town was originally settled by the local Native Americans, the Timucuans. The area was chosen due to its location along the Amelia River and because of the high and dry ground and the fertile soil. The area was originally the site of the town of Fernandina, and named for King Ferdinand VII of Spain. It was platted in 1811 by the Spanish, and was the last town platted in the Laws of the Indies in the Western Hemisphere. 89 The original grid was over 26 blocks and mostly remains to the present day. The forty contributing structures that exist in Old Town date from the late 19th and early 20th centuries. The full block of green space that overlooks the Amelia River was included in the original design, and is known as the San Carlos Plaza. This green space is now administered by Fort Clinch State Park. The area also contains a historic cemetery (Bosque Bello Cemetery), which takes up two of the blocks. Fortunately, Old Town has been relatively preserved from development due to its 89 Laws of the Indies was a planning edict from 1573 that contained an entire body of laws, with 148 principles governing the planning and development of a town. The Laws were issued by the Spanish Crown during the 16th, 17th, and 18th centuries while it governed its American and Philippine possessions of the Spanish Empire. The Laws regulated social, political and economic life. While the laws were criticized they were also the most comprehensive laws instituted for a colonial empire, and also set forth humane principles for the treatment of Native Americans. \"Laws of the Indies,\" Encyclopaedia Britannica, accessed January 2018, https://www.britannica.com/event/Laws-of-the-Indies.  These guidelines help keep the area's character and historical significance intact."}, {"section_title": "Downtown Historic District", "text": "In the 1850s, the town moved to its current location (south of Old Town), due to the construction of the railroad.  Recommending administrative changes as required to strengthen code and guidelines for dealing with matters that affect preservation of historic properties, districts and sites, and other cultural 91 \"City of Fernandina Beach Downtown Historic District Design Guidelines,\" Thomason and Associates Preservation Planners (Nashville: 2013). 92 \"Building in the Downtown + Old Town Historic Districts and Community Redevelopment Area,\" City of Fernandina Beach, August 2013, https://www.fbfl.us/DocumentCenter/Home/View/1662. This statute provides protections for the state of Florida's rich and unique heritage and its historic properties. The state's resources are important to its legacy and should be valued and conserved for present and future generations. The statute notes that \"The destruction of these nonrenewable historical resources will engender a significant loss to the state's quality of life, economy, and cultural environment.\" This statute is also meant to assist local governments to \"expand and accelerate their historic preservation programs and activities.\" This statute discusses the responsibilities of the state that it must: care for, consider the effect of, avoid or mitigate harm, locate, inventory and evaluate, and in general assume responsibility for all state owned historic properties. This statute is relevant because it describes how the state of Florida is responsible for those properties that are on, or eligible for the National Register of Historic Places. This is important to American Beach because it has two properties listed on the National Register, as well as having its historic district on the Register. This statute also allows for the possibility of state funding for historic properties."}, {"section_title": "F.S. 267.074 -State Historical Marker Program", "text": "This statute is responsible for informing the general public about \"persons, events, structures, and other topics relating to the history and culture of the state.\" It is also meant to and are now the main governing force in the community. American Beach has zoning codes for single, and multifamily buildings, as well as zoning for commercial areas of its community. The different types of zoning allow for the community to have small businesses that enhance the character and are reminiscent of the history of the bustling beach days. single-family dwellings, duplexes and townhouses, and multiple family dwellings. The different types of buildings are restricted to certain sides of the street and in certain parts of the community. This zoning code also addresses permitted accessory buildings and structures. The conditional uses for this area follow Article 28, Section 18.14 which allows for home occupations, day nurseries, schools, churches, cemeteries, etc. The minimum lot requirements and the minimum yard requirements for the residential general zoning district are discussed in length for each type of building/structure. This zoning code also limits the height of the buildings, the maximum lot coverage for each building type, and the maximum density. It also addresses parking and accessory buildings. This zoning code fits with most of the buildings with in the community, although there are some that look like they might be larger with regard to height, scale and mass. If those buildings did not follow the zoning codes, then the zoning codes either need to be enforced more, or there should be less variances granted. Article  This zoning code allows for small groups of selected establishments to be located approximately and serve the neighborhood. This commercial zoning is not intended for use by major commercial or service establishments. It does permit small-scale retail businesses, service establishments, and professional or business offices. The zoning codes for commercial buildings have guidelines with regard to the permitted uses, accessory structures, special restrictions and conditional uses. The code also addresses the building size, lot and yard requirements, as well as the height, scale and massing of the buildings. This zoning code relates to the commercial aspect of American Beach. Since the creation of the zoning codes, minimal commercial buildings have been added to the community and thus there is not enough evidence to support the strength of this zoning code.  Figure 21. This map shows the current zoning codes for American Beach and the surrounding areas, and how those zoning codes and ordinances relate to each other. While the overlay zoning codes for American Beach are clearly laid out above, if these codes are not well adhered to incompatible development will be allowed to overtake the community. 97 According to the U.S. Forest Service, silviculture is the \"art and science of controlling the establishment, growth, composition, health, and quality of forests and woodlands to meet the diverse needs and values of landowners and society such as wildlife habitat, timber, water resources, restoration, and recreation on a sustainable basis.\" \"Silviculture,\" U.S. Forest Service, accessed February 2018, https://www.fs.fed.us/forestmanagement/vegetation-management/silviculture/index.shtml. Unit has jurisdiction over. The South Amelia Island Shore Stabilization Association (SAISSA) was formed in 1993. SAISSA was created in response to a strong six-day storm that occurred the year before, and left the natural sand dunes almost completely destroyed, and also threatened several of the buildings along the shoreline. The SAISSA's purpose is \"to protect, preserve, restore and enhance the beach/dune system on the South end of Amelia Island.\" 99 The association has worked to find solutions to restore and stabilize the shoreline. SAISSA works with consultants, state and federal officials, and property owners to finance and figure out solutions for these large scale renourishment projects. SAISSA has completed three separate beach renourishment projects (and constructed three structures) since 1994. The last project that was completed was in 2011, and Due to the use of dredging sands to be placed on the shoreline this project was unique because of its cost sharing component that creates a savings of approximately $13.5 million. While the dredged sand did not make it the entire length of the shoreline, the natural down drifts associated with the coastline allowed for the shoreline further south to reap the benefits of the added sand. Unfortunately, this most recent project did not encompass American Beach, but it proved that there is a way to protect the coastline from erosion and natural disasters. As noted above, Section 5-5 of the Nassau County Code of Ordinances does cover the unincorporated areas of Amelia Island. Since there is only a minimal amount of service provided by the county, the area is not as high of a priority. The state of Florida does have coastal management programs and strategies in place for the areas that are the most populated, but tends not to do as much with the less populated areas. This issue can be due to financial issues and the lack of the communities paying taxes. Private areas are protected because they require their residents to pay fees which allows for funding and the ability to buy protections. American Beach is in need of federal, state, and local coastal protections to make sure that its coastline is also taken care of and nourished accordingly. This map is useful with regard to flood hazard areas within the county. The map shows the possible changes in the water level due to severe storms and flooding. A rise in the water level would affect those historic properties that were not built on stilts or raised pillars. These low lying structures would suffer the most water damage due to flooding and storm surge. For houses built now and in the future, they would have to comply with the local building codes regarding flood mitigation. The changes in codes for construction affects the overall style of the homes that would be constructed, but would not be completely out of character for the community. There are several houses that were built between the 1930s and 1960s that are raised on concrete block pillars, including A.L. Lewis' first home and Ervin's Rest. The foundation notes that they also work to \"preserve and rebuild the area in the same spirit in which it was created.\" They are able to make a difference in the community through the sponsoring of events, educational programs, advocacy, and the contribution of architectural The ABPOA has initiated several community projects, including the addition of sidewalks and the planting of palm trees along Lewis Street. The ABPOA notes on their website that their community is in a transitional phase. The community has an assortment of buildings from modest and well kept, to new and large, to neglected and abandoned, there are also several vacant lots throughout the community. The redevelopment of the community seems to be seen as something the ABPOA wants to happen. The association notes that because there is a lack of infrastructure, the redevelopment of the area is slow moving. They note that they are working closely with the Nassau County Board of Commissioners to \"find ways to provide reliable public water service for potable water, sewage collection and fire protection for the American Beach Community.\" Besides working with the county to add much needed infrastructure to the community, the ABPOA was a part of the creation of Burney Park and is now focused on the revitalization of a historical oceanfront restaurant and nightclub once known as Evans' Rendezvous. The ABPOA also hosts special events in partnership with Friends of American   because it adds more resources that can be used by the community. It also keeps developers from taking land and privatizing it. The new and updated parks and historic areas will also help bring in additional resources. They will improve tourism and add revenue that will go back into the community. All of these resources play important roles within the American Beach community. Whether they are community driven or state regulated, they create different levels of historic protections that can be utilized by the community. It just takes funding and a group of people committed to the cause to create a protected, yet progressive community."}, {"section_title": "CHAPTER 6: RECOMMENDATIONS AND CONCLUSION", "text": "As previously mentioned, historically African American coastal communities face three fared well was the creation of a master plan, a comprehensive plan, and/or future plans for the community. These plans allow for the protection and the progress of the community through an established document that helps to thwart off outside pressures. It also gives those within the community a chance to understand what changes will be taking place, and how those changes will be implemented. These communities are different with regard to their individual histories and how they came to be, but they have managed to weather multiple storms and have been able to be relevant in modern times. Since there is only a fraction of the African American coastal communities left in the United States, it is more important than ever to make sure American Beach is around for generations to come. There are a variety of ways to protect a historic community, but the ones best suited for American Beach are listed below in no particular order. Option 1 --Establish Official Design Guidelines for American Beach With regard to American Beach, there should be a set of design guidelines put in place that keep with the character of the community, but also allow for the homeowners to express themselves to some extent. In order to established official design guidelines for American Beach, there will need to be an official Area Character Appraisal (ACA) for the community. As mentioned in Chapter 4, an ACA would allow for proper documentation and assessment of the community before the design guidelines can be established. The ACA will define the elements of the community that make it unique and will help ensure that any future development will be compatible with the existing character of American Beach. The ACA is an important tool for developers and residents so they will have the proper understanding and knowledge of the history and makeup of the community, and how it has evolved throughout the years. Without this understanding, the design guidelines would not be able to effectively maintain the rhythm of American Beach with regard to its height, scale, mass and landscaping. The best guidelines to follow would be the \"Old Town Fernandina Preservation and Development Guidelines.\" This set of guidelines is the most relevant for the community, because Old Town Fernandina is located within the same county in Florida as American Beach. The guidelines for Old Town relate the character, landscape, history and overall feel of the community without being difficult for a nonpreservationist to understand and comply with. As noted in Chapter 5, the guidelines lay out the specific goals for Old Town's preservation. These goals can be used to help American Beach come up with their own set of goals with regard to creating design guidelines. The formatting of the preservation and development guideline for Old Town can be found in Appendix A, and are broken down in a way that would be a good format for American Beach to follow if the community is intending to create their own design guidelines. The guidelines for Old Town also include a multitude of photographs, drawings, maps and other visual reference to help with the maintaining of the community's character. The guidelines include a glossary of terms so that anyone reading the document will know exactly what each of the architectural and preservation terms mean. Also, at the end of the document, there is a section dedicated to \"Incentives and Assistance for Rehabilitation.\" This section is important for those using this document as a guide for their own future use. The Federal Rehabilitation Tax Credits and the Local Property Tax Exemptions for Historic Properties are described in detail. These are great resources for historic communities in need of financial help. These tax exemptions would provide an excellent opportunity for American Beach to utilize the funds to create a set of design guidelines for the community, or use the funds for other rehabilitation projects within its National Register Historic District. Option 2 -Establish a Community Redevelopment Area As previously noted in Chapter 5, there have been past efforts to create a CRA, but it fell through due to internal disagreements within the community. There is once again the option for a CRA to be put in place for American Beach. This option is feasible, and one of the best protective strategies for the community at this time. It will allow for American Beach to become a part of the Nassau County grid and allow for updated and much needed infrastructure, and community improvements. The CRA is established by the local government and it functions within that local government. As previously noted, the CRA will be funded through Tax Increment Financing and revenue bonds. This type of financing system is successful because it will provide much needed public services to the community without having to increase or levy taxes. The residents of American Beach can look to Fernandina Beach's CRA as a positive example of this process. Fernandina Beach's CRA was put in place to create a redevelopment area along the city's historic shrimping waterfront. This waterfront does not have any historic or contributing structures left. The CRA was developed to help this historic area develop and progress positively while also keeping with the character of the historic district nearby. The CRA creates appropriate guidance to ensure the changes to the area are compatible with the Historic District Guidelines. These restrictions are monitored and maintained by the city's Historic District Council to make sure that the progress of the area is not insensitive, and does not cause any harm. The creation of a CRA for American Beach would be beneficial to the community, and allow progress while also maintaining a level of protection and regulation. The CRA would be monitored by the American Beach Property Owners Association and the Nassau County Planning Department since these entities are the main governing force for the community. As long as the entire community comes together, the CRA can be approved and allow for the revitalization of American Beach."}, {"section_title": "Option 3 --Create a Stronger Property Owners' Association", "text": "As mentioned in Chapter 5, American Beach currently has a homeowners' association -the American Beach Property Owners' Association (ABPOA). This association was formed in 1982 and is the main governing body for the community. While the ABPOA has governing ability over the community, it currently has limited powers. As noted in a Final Order of Dismissal (Order) from April 15, 2015, the document states the ABPOA has Articles of Incorporation and Bylaws, but no Declaration of Covenants. In addition, the Order notes that Section 720.301(4) of the Florida Statutes defines \"Homeowners' Association\" as: (9) \"Homeowners' association\" or \"association\" means a Florida corporation responsible for the operation of a community or a mobile home subdivision in which the voting membership is made up of parcel owners or their agents, or a combination thereof, and in which membership is a mandatory condition of parcel ownership, and which is authorized to impose assessments that, if upaid, may become a lien on the parcel. The term \"homeowners' association\" does not include a community development district or other similar special taxing district created pursuant to statute. 119 This states that a Florida corporation responsible for the operation of a community (the property owners' association), must have a mandatory membership condition of parcel ownership, and, the organization is authorized to impose assessments. The Order also states that the Respondent, ABPOA is not a homeowners' association controlled by Chapter 720, Florida Statutes. Since the ABPOA is not officially recognized, the association does not have the proper power to conduct business or protect the history of the community. The Order also notes that it was not able to find any provisions within the governing documents that allow for the ABPOA to follow the above mentioned conditions. 120 While the ABPOA's Articles of Incorporation lay out the creation of the association, they do not fully discuss the entirety of the association's reach. The existence of the ABPOA is to be perpetual, and the purpose of its creation was \"to promote the unity and property rights of property owners of American Beach. Currently, on their website, the ABPOA has an option for paying dues/signing up to become a member of the organization. The fee is $60.00 and the website mentions that payments 120 There is a possibility that the ABPOA does have a proper Declaration of Covenants that allows for it to have more control over the community. But, the Order states that the Petitioner did not include the document, and the ABPOA did not respond to emails asking for the associations Bylaws and Declaration of Covenants. This suggestion with regard to the increase of power for the ABPOA comes from analysis of the Final Order of Dismissal, Articles of Incorporation and the Florida Statute relevant to this issue. 121 American Beach Property Owners' Association, \"Articles of Incorporation,\" February 23, 1996, accessed March 2018, http://search.sunbiz.org/Inquiry/CorporationSearch/ConvertTiffToPDF?storagePath=COR%5C0108%5C05 06%5CCH002716.tif&documentNumber=N96000002018 are due on January 1st of each year. The website does not share any of the founding documents for the association, which should be accessible to their members for transparency's sake. The ABPOA is the face of the community, and they work with Nassau County to make sure American Beach is represented in current and future projects. If the association had more say over its jurisdiction, then it would be able to enforce proper protections regarding the preservation of the community. The ABPOA would be able to work with an organization to create an Area Character Appraisal and design guidelines for American Beach, which it could then enforce. This would allow for the preservation of the community's history, while also allowing for positive progress and revitalization to occur."}, {"section_title": "Conclusion", "text": "Some of the best ways to stop loss is through education and outreach. Preservationist, or even local community members can advocate for their historic communities by educating property owners about the significance of their properties and the proper protective measures to take. Bringing the history and significance of the area to the forefront through education can lead to a better understanding of how historic preservation is attractive to, and beneficial for communities. To be able to successfully protect American Beach, the ABPOA and Nassau County need to work with the community so they understand that future progress, when done sensitively can be beneficial. The importance of these organizations to reach out and educate the residents will help with the internal issues that the community has previously faced. If the fears of the community are eased, then there is a possibility of growth that compliments and works with the historic fabric and heritage of the community. There is an array of options when it comes to protecting historic communities, especially those with such a unique history. While this thesis covers several options, there are more possibilities to protect American Beach. The hardest part besides cooperation from the residents, is finding the funds and financial backing to protect and preserve the historic fabric. Fortunately, there are options when it comes to federal, state, or local preservation grants especially if the community or property is protected by a governmental entity. As noted previously, historically significant communities listed on the National Register of Historic Places are eligible for grants and federal funding. These financial incentives are useful to homeowners who have properties that are in dire need of rehabilitation. There are also other options to find funding, including private donors, non-profits, or grants given by preservation organizations. One of the most helpful financial options for historic African American communities comes from the African American Cultural Heritage Action Fund (Action Fund). This fund is sponsored through the National Trust for Historic Preservation, and its mission is, \"to draw attention to the remarkable stories that evoke centuries of African American activism and achievement, and to tell our nation's full history.\" The Action Fund is used to provide grants to African American historic sites and to empower youth through Hands-On Preservation Experience. It is also used for research (to see how preservation impacts contemporary urban issues), and as advocacy for underrepresented groups. The fund also works with communities and cities to protect significant African American historic places. 122 Additional resources for the preservation of historic African American sites include, the While these are only a few options that can help historic African American coastal communities protect themselves and preserve their unique histories. These historic African American coastal towns are important resources for their cities, their states and the nation, and they need to be taken care of. While nothing remains the same, and we all must adjust to the changing times, my hope is that the spirit of American Beach and these other small African American coastal communities will be properly protected and around for many more years to come. contributing and non-contributing buildings, and also what to do with regard to relocation and demolition. VIII. Design Guidelines for New Construction -This section is necessary because it allows for new construction, while also making sure the new buildings are compatible with the character of the community. The lot coverage, height, scale and mass of the buildings, and landscaping are all discussed. IX. Setting and Landscape -The fences, walls, hedges, parking, old trees, public streetscape, and community landmarks are discussed. The proper care and addition to the setting are important in staying within the character of the community. Also, the maintenance of the original grid and/or pattern of the community should be preserved if possible."}]