[{"section_title": "INTRODUCTION", "text": "Academic R&D in the United States is largely funded by the federal government through various agencies. The literature suggests that academic R&D leads to higher returns than private R&D from industry (Broström & Karlsson, 2017;Youtie & Shapira, 2008). Some suggest this is due to the public nature of government-funded academic R&D, while others argue academic R&D lacks a commercial focus and consequently contributes little to economic growth (for an earlier discussion of R&D-economic growth relations, see Anselin, 1997;Mansfield, 1991;Jaffe, 1989). There is also a disproportionate amount of academic R&D in basic research, whereas businesses tend to focus on applied research and development. This academic focus is perceived as a drain in funding by some, especially if desired results are not achieved, while others see it as a necessary step to create innovation (Baumann & Kritikos, 2016;Youtie & Shapira, 2008;Jaffe, 1989). Federally funded university R&D is a source of knowledge that can benefit both the institution conducting the research and the region in which the institution is located. Since the Bayh-Dole Act of 1980, universities and others conducting federally funded research have been able to retain the patents or licenses from their findings. The data show that university R&D mostly occurs in large, public, Midwestern U.S. universities with combined funding across the U.S. in 2014 of $7 billion, of which 56 percent came from the federal government (Weinberg et al., 2014). This funding is an incentive for further innovation for most universities, but it also allows the commercialization of their findings. Although the U.S. Patents and Trademark Office (USPTO) indicates that the number of patents granted to universities is small relative to the number granted to firms, there is still a positive trend of increased of academic patenting. The process by which universities and firms can patent R&D findings is assumed to promote economic growth, though the extent of that growth has not been fully determined. Following growth accounting methods, the value of innovation is assumed to come from R&D investment from academia, industry, state government, and federally funded research development centers. The importance of R&D in regional economic development is presented in a way that underscores the need for future investments. For example, a study in the 1990s finds university R&D is an important stimulus for economic development leading to increases in GDP of $15.5 billion CAD and an employment spike of up to 200,000 in Canada (Martin & Trudeau, 1998). There is a dependency between basic and applied research, as well as between basic research and development, which highlights the importance of academic R&D in an economic growth framework. Moreover, universities rely heavily on federal government assistance to be able to conduct research. Given the ongoing debate in the literature about the impact of academic R&D on economic growth, this paper seeks to investigate empirically the extent of the contribution of federally funded university R&D to economic growth. Furthermore, since any impact of R&D has significant public policy implications, this paper runs several scenarios for a group of U.S. states to find both the long-and short-term impact of federally funded university R&D on the states' economies. This paper particularly aims to answer the following four broad questions: • What is the trend in federally funded academic R&D in the United States? • What role does federally funded academic R&D play in short-term economic growth? • What role does federally funded academic R&D play in long-term economic growth? • What are the implications of the impact of federally funded academic R&D for the selected regional economies? In the sections that follow, this paper first reviews the literature on the relationship between R&D and economic growth. The third section introduces data issues, concepts, and research questions. The fourth section deals with study methodology. The fifth section presents the trends in academic R&D. The sixth section presents the study's findings. The seventh section discusses the implications and limitations of this study. The conclusion follows. defines basic research as the experimental or theoretical work undertaken primarily to acquire new knowledge of the underlying foundations of phenomena and observable facts. Applied research is the original investigation undertaken to acquire new knowledge and is directed primarily toward a specific practical aim or objective. Finally, development or experimental development is the creative and systematic work that draws on knowledge gained from research and practical experience, directed at producing new products or processes or improving existing ones (OMB, 2017). Generally, universities and research facilities expand their R&D resources on basic and applied research, whereas firms focus on the development of products and processes. R&D aims to gain additional knowledge that allows for technological progress and innovation. The potential increase in the stock of knowledge is a result of a collaborative effort among firms, universities, research facilities, and individuals. Successful creation of knowledge results in technological advancement that facilitates production and increases consumption within an economy. Innovation and progress spur economic growth alongside capital and labor. The eminent economist Joseph Schumpeter advanced this \"innovation economics\" model in identifying innovation as the critical dimension of economic change. His theory emphasized the role of innovation, entrepreneurial activities, and market power in promoting economic growth (Schumpeter, 1942). The investments that government and businesses make in basic and applied R&D are critical for growth and development of subsequent technologies, products, firms, and industries. Estimates of the contribution of R&D to economic growth were initially developed by Solow (1956) in a production function framework commonly referred to as \"total factor productivity\" (Solow, A Contribution to the Theory of Economic Growth, 1956). Recent estimates show that technological and scientific innovation are responsible for about half of America's economic growth (Ezell & Andes, 2016). Therefore, innovation is key to increasing economic growth and wages in the long run, as it is an indicator of productivity. According to the Information Technology and Innovation Foundation, U.S. productivity from the mid-2000s to the present has been at its lowest level since the 1940s, due in part to the lack of innovation (Baily & Montalbano, 2016). The U.S. trails behind technology-intensive countries such as Germany or Japan, which translates into significant losses in potential economic growth. An increase in productivity by a mere percentage point is found to boost the economy by $2.3 trillion in a single year while simultaneously shrinking the federal budget deficit by more than $400 billion (Foundation, 2016). Investment in R&D and innovation are tightly linked in promoting economic growth. Often, the direct impact of R&D is complemented by spillover effects which contribute to greater economic growth. For instance, the real effects of academic research, spillover effects using corporate patents and R&D, university research show a significant effect of academic R&D on corporate patents for drug, medical tech, electronics, optics, and nuclear technology areas (Jaffe, 1989). Moreover, industrial innovations heavily rely on academic R&D, and such spillovers are facilitated by the geographic coincidence of universities and research laboratories within and across states (Zoltan, Audretsch, & Feldman, 1992;Mansfield, 1995). The more recent literature emphasizes the importance of R&D for innovation. A slump in economic growth was partly attributed to the lack of investments in R&D which prompted increased spending in research from 1980. Industrial investments in R&D was heavily used as a strategic policy aimed at addressing the U.S. productivity slowdown during that period to present (Broström & Karlsson, 2017). Furthermore, continued promotion of R&D is necessary to increase the private economic value of research by-products such as patents. The literature finds that patents, licenses, and startups derived from R&D are significantly and positively related to their scientific value and the potential for economic gain (Kogan, Papanikolaou, Seru, & Stoffman, 2017). This paper seeks to quantify the effect of R&D on economic growth at the state level. Particularly, it focuses on the effect that federal subsidies to universities have on local and regional economic growth. Universities receive R&D funding from various sources including businesses, federal and state governments, nonprofit organizations, and donations. The federal government provides a sizable portion of universities' R&D funding through its various agencies. The federal government spent $131.4 billion in 2015 and an estimated $145.4 billion in 2016 on university R&D funding. Its largest grant-awarding branches are the National Science Foundation, the U.S. Department of Defense and Technology, the U.S. Department of Agriculture, the U.S. Department of Commerce, and the U.S. Department of Homeland Security (National Science Foundation, 2017)."}, {"section_title": "R&D and Spillover Effect", "text": "The measurement of R&D effects is a difficult concept, rife with endogeneity issues. R&D itself creates a pool of knowledge that sometimes is non-rival and non-excludable to others, effectively making R&D outcomes a public good. The subsequent creation of a large stock of knowledge capital fosters cooperation, innovation, and investment within an economy. This makes the direct link between federally funded R&D and the corresponding economic benefits difficult to establish. Solow developed an econometric framework for the effect of technological progress on aggregate output (gross national product) between 1909 and 1949. Assuming constant returns to scale and that factors are paid their marginal products, he found technical change to be neutral on average. His main contribution lies in his Solow residuals, whereby changes in aggregate output not caused by labor and capital were assumed to be from technical changes (Solow, 1957). Griliches later expanded this framework in a \"knowledge production framework\" (Griliches, 1979). Issues relating to the adequate measurement of output in R&D-intensive industries and the measurement of the so-called stock of R&D \"capital\" were raised. The capital stock was modeled following a spillover effects model. Further, Jaffe expanded on Solow's model, and particularly on Griliches' knowledge production framework, to analyze R&D spillovers using the number of patented innovations (Jaffe, Technological Opportunity and Spillovers of R & D: Evidence from Firms ' Patents, Profits, and Market Value, 1986). He later enriched the model by including additional indicators for R&D spillovers such as corporate patents, corporate R&D, university research, geographical characteristics, and state R&D expenditures (Jaffe, 1989). Jaffe found significant effects of academic R&D on corporate patents, especially in the life sciences field. More recent research on the effect of R&D on economic growth focuses on the dissemination of sciences using Solow's total factor productivity model (Mansfield, 1995). This paper will take advantage of a Cobb Douglas production function, as widely used in the literature, to analyze the effect of R&D on economic growth while accounting for spillovers. Most of the research focuses on the by-product of R&D in the form of academic articles. Another important consideration in evaluating the impact of R&D is the capacity of a university or a firm to absorb from the already-present knowledge stock. Similarly to Knott, with her research quotient and organizational IQ framework, this paper will aim to isolate the effect of federal R&D funding to a state's universities on its gross domestic product (Knott, 2008)."}, {"section_title": "R&D in the U.S.: An Overview", "text": "The Bayh-Dole Act of 1980 (the Act) made it possible for universities, small businesses, and nonprofit institutions to retain the patent and licensing rights from their federally funded research. It is perhaps one of the most influential pieces of legislation about intellectual property in recent times. The Act removed the restrictions that had previously allowed only the government itself to retain ownership of what was created with government funds (Matthew, 2008). R&D plays a significant role in the technological advancement and the process of innovation. The share of patents granted to research universities dramatically increased due to the Act. R&D is widely recognized as a contributor to economic growth alongside capital and labor. The economic impact of R&D can be measured in its commercial transfer, scientific dissemination, and export of resources. The subsequent movement of knowledge through publications, conference and working papers, and collaboration among different entities increase the value of R&D (R&D: National Trends and International Comparisons, 2014). Since our regional scenarios focus on Tennessee and its neighbors, this R&D overview will use a select number of southern and southeastern states in comparing R&D behaviors. These states are Alabama, Florida, Georgia, Kentucky, Mississippi, North Carolina, South Carolina, Tennessee, and Virginia. Among the selected states, North Carolina leads by investing 2.18 percent of its potential GDP in R&D (Table 1). Virginia, Alabama, Georgia, and South Carolina spend from 1.30 percent to 1.08 percent on average on R&D outlay. In descending order, Kentucky, Florida, Tennessee, and Mississippi spend between a high of 0.98 percent and a low of 0.66 percent in R&D. It is to be noted that Tennessee spends 0.66 percent of its corresponding GDP on R&D. Between 2005 and 2015, Alabama, Florida, Georgia, Kentucky, Mississippi, North Carolina, South Carolina, Tennessee, and Virginia were granted a total of 124,427 utility patents, accounting for about 10.73 percent of all patents granted by the U.S. Patents and Trademark Office (USPTO). Moreover, these states held about a fifth of all licenses (18.37 percent) and startups (18.16 percent) in the nation. Overall, North Carolina, Florida, and Georgia seem to invest more in R&D and have a higher number of patents granted, licenses, and startups than their counterparts in Table 1."}, {"section_title": "Academic R&D and Output", "text": "Some researchers note that universities have assumed an expanded role in science and technology-based economic development (Youtie & Shapira, 2008). Investments in R&D in general, and specifically in academic research, should respond to the economic needs of an area. This highlights the importance of regional and local contexts when responding to R&D needs. Transformation hubs such as Silicon Valley (Northern California) and Route 128 (the Boston metropolitan region in Massachusetts) are examples of university networks that have had a powerful influence on innovation and local economic development. Other researchers discount the importance of regional proximity when looking at the impact of university R&D, arguing that knowledge spillovers are widely available (Beise & Stahl, 1999). As seen in Tables 2 and 3, academic R&D expenditures make up a significant portion of total state R&D expenditures. The share of academic R&D for the selected states in many cases amounts to a third of total R&D expenditures, except Mississippi, where it accounts for two-thirds of the total amount. These shares of spending range from a low of 21 percent for Virginia to a high of 39 percent for Tennessee. The federal government is the largest contributor to academic R&D, in most cases funding at least half of the total. This observation demonstrates the importance of federal funding in academic institution R&D. The states with the highest levels of R&D and GDP, which were North Carolina, Florida, and Georgia, received respectively 60 percent, 53 percent, and 59 percent of their academic R&D funding from federal sources.  Business R&D was the single largest source of total R&D in the selected states, excluding Mississippi, ranging from 61 percent for Tennessee to 78 percent in North Carolina. These significant amounts of business spending on R&D resulted in increased productivity. The growth fostered through industry innovation could be increased through added investment in academia while simultaneously promoting cooperation between academia and industry. In short, the data present a skewed distribution of R&D spending, with businesses being significantly on the right tail while academia is of somewhat reduced weight. Given the importance of R&D spending to economic growth, state governments are underinvesting, as Table 3 shows. Academic R&D creates an impact far beyond economic growth. For example, Mansfield (1991) estimates the social rate of return of academic R&D on industrial innovation and finds that such innovation would not have been possible in the absence of academic R&D. From 1975 to 1985, about one-tenth of new products and processes commercialized in the information processing, electrical equipment, chemical, instrument, drug, metal, and oil industries could have been developed only with substantial delays without recent academic research (Mansfield, Academic research and industrial innovation, 1991). Furthermore, the transfer of technology from research to industry can vastly expand the resource base in such a way that companies with no internal R&D efforts achieve additional capabilities and that companies with some level of internal R&D in place find their research and development capabilities augmented and enhanced (Rahm & Hansen, 1999). Moreover, Rahm & Hansen assert that using the available knowledge and technologies developed in universities to enhance the competitiveness of U.S. industry can be a super-optimum technology policy solution (Rahm & Hansen, 1999). Table 4 below shows non-standardized academic R&D output for the selected states. Florida, North Carolina, Georgia, and Virginia have the highest numbers of total patents granted, whether business or academic. Moreover, these states seem to emphasize science and engineering program graduate enrollment, postdoctoral fellows, and researchers.  Patents, licenses, and startups for each state are among the most widely used indicators for R&D outcomes. According to the USPTO, a patent is the grant of a property right to the inventor, with a term of 20 years for a new application. There are three types of patents: utility, design, and plant. Utility patents are the most widely sought-after types of patents from R&D. They are granted to anyone who \"invents or discovers any new and useful process, the machine, article of manufacture, or composition of matter, or any new and useful improvement thereof\" (Patents Getting Started, 2015). Businesses hold the bulk of patents compared to universities and other entities. Increases in licensing and startups are alternative measures of innovation and the effect of R&D."}, {"section_title": "DATA, CONCEPTUAL ISSUES, AND RESEARCH QUESTIONS", "text": ""}, {"section_title": "Data", "text": "The National Science Foundation (NSF) reports R&D expenditure data through its National Center for Science and Engineering Statistics (NCSES). The NCSES conducts extensive surveys regarding R&D Funding and Expenditures, Science and Engineering Research Facilities, and other areas related to education, research, and funding. The data used in this study comes from a collection of R&D surveys including the Business R&D and Innovation Survey (BRDIS), the Higher Education Research and Development Survey (HERD), the Survey of Earned Doctorates (SED), the  University R&D spending accounts for an average of $1.1 billion with a maximum observation of $8 billion (Table 5). Business R&D is on average five times as high with a mean of $5.2 billion. Comparatively, state government R&D expenditures average only $32 million with a low of $160,000, suggesting a large variation from state to state and from year to year."}, {"section_title": "Balanced Panel Data", "text": "Strongly balanced panel data are constructed with 50 states and the District of Columbia (N = 51) over a period spanning from 2005 to 2015 (T = 11) for a total of 561 observations. All dollar values are adjusted for inflation (real) using 2009 chained dollars. Selected indicators are summarized in Table 6. The longitudinal setup permits a greater capacity for capturing interstate differences and intrastate dynamics (Hsiao, 2014). More degrees of freedom can be used in the analysis of R&D expenditures for each state individually over the years as well as for all states at a certain point in time. A simple cross-sectional structure would miss the delayed effects of R&D expenditures. The very nature of R&D implies lagged results that can be approximated using panel data, as is the case, for example, with an application for and granting or refusal of patents, which can take years and occur over multiple time periods. In contrast, time-series data would capture little of the difference in R&D spending between states, part of which is to be captured by spillover effects. Overall, the nature of panel data allows for an evaluation of individual state differences in spending over time, states' dynamic changes in R&D spending over time, and the combined differences of all the states in spending behaviors. This dynamic analysis could also provide insight into economies of scale from which states with higher R&D might benefit."}, {"section_title": "Selection Bias and Omitted Variable Bias", "text": "A state's decision to invest in R&D is subject to its criteria, such as the availability of funds, research activities of businesses and universities, or even a focus on R&D itself. Therefore, the very decision to invest in R&D is endogenous to the state, representing a type of selection bias. Depending on its characteristics, each state decides to invest in a specific level of R&D. This causes another selection bias due to the differences in observable characteristics between the states in R&D investment. The panel data alleviate these issues of selection biases by observing the R&D spending behaviors of each state over the entire period of interest, thus giving insight into variations in their characteristics. Moreover, the effects of R&D spending can be disentangled from other factors, such as other capital and labor spending, within total spending to achieve a level of GDP. The impact of potential omitted variables that might be the real causes for a level of GDP is minimized by the panel data structure. The framework used here is similar to that used when employing panel data to solve selection bias issues. The longitudinal aspect of the data could not capture some of the effects of variables that might be correlated with R&D expenditures but are excluded from the model. This is possible due to both the intertemporal dynamics (T = 11) of the states and the individuality of the states (T = 51)."}, {"section_title": "Research Questions and Geographical Scope", "text": "This paper uses three layers of geographies to assess (a) the short-term economic impact of academic R&D expenditures (Tennessee), (b) the long-term economic impact of academic R&D on GDP growth (across the states), and (c) scenarios for the selected states (the southeastern states). This paper addresses the following major research questions using these layers of geographies: • What is the trend in federally funded academic R&D in the United States? • What role does federally funded academic R&D play in short-term economic growth? • What role does federally funded academic R&D play in long-term economic growth? • What are the implications of the impact of federally funded academic R&D for the selected regional economies?"}, {"section_title": "METHODOLOGY", "text": ""}, {"section_title": "Short-Term Economic Contributions of Academic R&D", "text": "To estimate the short-term economic impact of academic R&D, this study employs a widely used input-output model, IMPLANpro© (www.implan.com). The following input variables are used to estimate the short-term economic impact: • Payments to researchers: technician/staff scientist, faculty, research analyst/coordinator; postgraduate researcher, graduate student, clinician, and research support; • Goods and services purchased locally, statewide, and nationally; • The vendor, contractor, and subcontractor opportunities. In estimating the economic impact of innovation, new start-ups formed as a result of federal university R&D are calculated using the AUTM survey and Census Bureau Surveys. According to our estimates, in 2014, about 10 percent of all establishments are new start-ups, employing on average eight (8) people. Using the data from AUTM and Census Bureau Surveys, on average, every $100 million in university R&D spending generates 1.52 new start-ups in the U.S."}, {"section_title": "Economic Impact Method Assumptions", "text": "Geography. A clearly defined study area allows us to identify out-of-area monetary flows. If the source of revenue for a company, institution, or industry is from outside a clearly defined area, we then argue that the monetary activity is a net addition to the area's economy. This treatment is an important component of economic impact estimates. In this study, Tennessee is defined as the geographical unit to estimate the short-term economic impact of federally funded academic R&D. Economic Impact. What is the meaning of economic impact? Economic impact refers to an economic activity's net new contribution to the region in which the activity takes place. Some examples include a visitor from out of town spending money on a hotel/motel, a new manufacturing plant operating in the region, federal or out-of-region money flowing to an area to support a new program, or an activity that is unique in the region. Economic impact analysis is different from economic contribution analysis or economic significance analysis, in which we often counterfactually remove an institution, program, or event from an economy without determining whether that given institution, event, or program may be considered net new to the region. In reporting economic impact estimates, we follow the procedure outlined below: 1. Business revenue (output) effect-direct, indirect (the effect of business-to-business interactions), and induced (the effect of employee spending of wages and salaries) by major industries. These measures combined (indirect and induced) are also called the ripple effect. The business revenue effect represents all economic activities (i.e., trades, value added, income, taxes, proprietary income, etc.) associated with the activity. Therefore, this figure should not be aggregated with any other measures reported here. 2. Employment effect-direct, indirect, and induced by major industries. 3. Labor income effect-direct, indirect, and induced by major industries. 4. Local and state taxes-total taxes by major industries. These categories of impact, except local and state taxes, are reported at the direct, indirect, and induced impact level. 1. Direct effect: Changes in economic activity during the first round of spending. 2. Indirect effect: Changes in sales, income, or employment within the region in backwardlinked industries supplying goods and services. 3. Induced effect: Increases in sales within the region from employees spending earned income (for example, doctors in a hospital spend their earnings on goods and services in the regional economy; this spending generates business revenues, employment, and wages and salaries throughout the study area economy)."}, {"section_title": "Long-Term Economic Impact of Academic R&D", "text": "The analysis of R&D impact is based on Solow's residuals or Total Factor Productivity approaches, focusing on accounting growth (Solow, 1957). A Cobb-Douglas production function will be used to evaluate the effect of R&D, and particularly academic R&D, in promoting economic growth. The difficulty lies in disentangling the effect of R&D-referred to as technical progress in Solow's works-from capital and labor investments. An alternative way to measure the link between research and economic impact by accounting for spillover effects of R&D is modeled by Griliches (1979), Jaffe (1986), and Knott (2008), among others."}, {"section_title": "Theoretical Framework", "text": "Spillover Effect. Spillover effects (positive externalities) are assumed in the presence of any and all R&D activity at the state and national level. Therefore, spillover is constructed from aggregate U.S. R&D activity for the period of interest. Conceptually, a lower knowledge stock leads both to imitation by the less-informed agent and to the invention of new knowledge for both states (Jovanovic & Rob, 1989). A significant portion of the literature uses geographical proximity for increased knowledge spillover, although there is some evidence in the literature that spillovers are facilitated by geographical coincidence (Mansfield, 1995;Jaffe, 1986 and1989;Zoltan, Audretsch, & Feldman, 1992). Another measure widely used for spillovers is the technological proximity between entities, often firms (Colino, 2016). Clusters of similar industries are formed using the North American Industry Classification System (NAICS) with the assumption that spillovers are more likely within an industry than across industries. The parametrization of spillover effects follows the literature by using an instrumental variable approach. The total impact of contemporaneous national R&D expenditures in the U.S. is assumed to impact GDP and investment in R&D. Therefore, the first stage model is: Total U.S. R&D includes combined academic, business, state, and research center R&D expenditures. State level R&D is analyzed for up to one lagged period. The vector X represents all other controls, such as employment and educational outcomes for each state. The estimates from Equation 1 will be used in the second-stage model of income impact. This is in part to mitigate simultaneity bias involving the bidirectional relationship between R&D and its outcomes (Orlando, 2002). Lagged values of patents, licenses, startups, science and engineering graduates, and faculty members are included in the analysis. It is important to note that others have used a slightly different approach, whereby spillover is computed as the sum of the differences in knowledge between a focal firm and the overall firms' average for a given year, measured using R&D expenditures (Knott, 2008). The difficulty in spillover measurement is often about quantifying the actual flow of knowledge that crosses from one entity to another. The spillover is, then, a type of indirect return. Proxies for spillovers as knowledge transfers include citations, patents, and past and present R&D expenditures for an entity and its competition. This study focuses on states and the impact of their R&D spending on GDP growth. Cobb-Douglas Production. The economic impact of R&D is estimated using a Cobb-Douglas production function using capital, labor, and the knowledge function as determinants of state GDP growth. The model closely follows the literature's specification to predict the effect of a state's R&D investments on its productivity growth (Hall & Mairesse, 1995). In equation 2, the vectors & , and , are R&D expenditures and labor, respectively, for state i in year t. The real R&D expenditures are broken down by academic, business, and state to differentiate their respective marginal effects. The labor vector, , refers to the manpower needed to carry out R&D. Individuals with bachelor, associate, master, and doctoral degrees are accounted for. Science and engineering postdoctoral fellows, non-faculty research staff, and faculty are all factors of R&D production, which in turn increases economic impact, or GDP. Overall state employment information was excluded to determine the effect of those who specialize in R&D. Finally, time-invariant effects due to the unobserved heterogeneity for each state will be analyzed with various tools including fixed and random effects models for panel data. The vector , is defined as the stock of available knowledge for research. The cumulative pool of knowledge available for research at the present time is conditional on internal and external R&D. To measure this pool of available R&D, a knowledge production function is estimated, as is consistent with the literature prominently advanced by Jaffe (Jaffe, 1986). The knowledge function relies on previous investments in R&D and the subsequent outputs derived therefrom, including patents, licensing, and startups."}, {"section_title": "Econometric Issues", "text": "Unobserved Heterogeneity. This bias comes from unobservable individual state characteristics that might affect that state's R&D spending, college graduation rates, and differences in labor and capital investment. For instance, states such as California or Texas will disproportionately invest in R&D because of a focus on technological innovation in Silicon Valley or on the exploitation of the oil industry. These differences among the states lead to an endogenous issue whereby the predictors are correlated among themselves. In other words, the covariance between the predictors and the error terms is not equal to 0: ( , , , ) ≠ 0. The unobserved heterogeneity is due to time-invariant state characteristics that can be eliminated by taking the first differences of the variables. This is the same as using a fixed effects model but only for two time periods. Since there are 11 time periods, the fixed effects model can be used to reduce the effects of the time-invariant state component. In other words, the fixedeffects model can help reduce the omitted variable bias, which is linked to the unobserved heterogeneity issue. Nonetheless, a random effects model might instead be more consistent if the issue of ( , , , ) ≠ 0 persists. The choice between a fixed-effects and a random-effects model will be made via a Hausman test under the null hypothesis that random effects are preferred due to higher efficiency, while the alternative specifies a fixed effects model is at least as consistent and thus preferred. The test rejects the null hypothesis of the random effects model being the better specification. A fixed effects model is appropriate for the data. The fixed effects specification controls for unobserved heterogeneity to be constant over time. In this case, the state-specific characteristics are correlated with the other independent variables in R&D. Multicollinearity. In the presence of strong correlations among the predictors, a simple way to improve the normality of the data is through transformation. The data is transformed into the natural logarithm. The Spearman's rho correlation coefficients still show a mostly positive pairwise relationship among variables. However, the coefficients' magnitudes are vastly lower than those of the raw data. It is tentatively concluded that the multicollinearity issue has been alleviated to some extent by this transformation, although additional checks need to be performed on the data. Aside from the reduction of the multicollinearity effect, the log transformation has the benefit of simplifying the model. The log-log Cobb-Douglas function model's coefficients are now simply elasticities about a unit percent change in the predictors, ceteris paribus. Although the log-log transformation of the production function improves the model, the issue of multicollinearity persists, with the predictor variables being highly correlated. The most problematic issue is the main variable of interest, which is R&D expenditure, specifically academic R&D, and its relationships with the factors of production such as bachelor's, master's, and doctoral students and postdoctoral fellows, among others. It is reasonable to assume the availability of academic R&D funding allows a university program to expand and to attract more talented individuals. On the other hand, it is likely that an already well-established program will be considered more favorably by funding agencies. Challenges Regarding Academic R&D and Its Outcomes. University R&D is correlated with many input factors, including education level, research staff, and production of intellectual property such as patents and licenses. A two-stage analysis is used to model the relationship between these factors of R&D production and the university portion of total R&D expenditures. Then a structural model relating R&D expenditures to state GDP will be evaluated. As mentioned previously, this model is insufficient, as it fails to disentangle the direction of the relationship between factors of input and output. For example, the availability of R&D funding might allow for increased enrollment and expansion of graduate programs, and not viceversa, in a given year. Nonetheless, the R&D spending for a period is the function of past input factors. That is, the current availability of faculty members, postdoctoral fellows, and graduate students, for instance, is necessary for obtaining R&D funds in the future. This bidirectional relationship is the main issue with this particular assessment because the outcome variables can very well be the predictor variables and vice versa. Thus, lagged input factors can be used to explain R&D expenditures. GDP and R&D Expenditures Instrumental Model. The final model looks at the relationship between R&D and GDP. The familiar capital and labor production Cobb-Douglas function are used. However, capital is replaced with R&D expenditures for two reasons. First, it is the only \"observable\" measure of capital expenditures available in the dataset. Moreover, it is the only capital that is relevant in the determination of the relationship between R&D and GDP. The instrumental variable approach is widely used in the economics literature to account for an exogenous source of variation to minimize endogeneity issues including multicollinearity or omitted variables (Hausman, 1975;Miguel, Satyanath, & Sergenti, 2004;Larcker & Rusticus, 2010). To analyze the relationship between federally funded academic R&D and GDP, this paper used the following model with the lagged R&D inputs serving as instruments, such that: The fitted values from the estimates of Equation 3 will be used in the final as seen below. The lagged variables, in this case, one period, will be used to evaluate the relationship"}, {"section_title": "STUDY RESULTS", "text": "Trends in R&D. Federal R&D spending in the U.S. represents about 0.75 percent of U.S. GDP in 2015. From a historical perspective, federal R&D as a percentage of U.S. GDP declined dramatically from 1.02 percent in 2005 and 1.01 percent in 2010 to 0.75 percent in 2015. In 2015, federal university R&D spending in the U.S. was around $37.9 billion, representing about 0.21 percent of the nation's GDP. This was a decrease from 2010 when federal academic spending was 0.25 percent of the nation's GDP at $37.5 billion.  The total short-term economic impact of federal academic funding of $400 million results in 5,027 new jobs including post-doctoral fellows being created, $804.4 million increases in business revenues, $296.1 million in personal income, $23.58 million in local and state taxes and fees, and $62.82 million in federal taxes. These impact estimates do not include the impact of increased productivity in the economy through knowledge creation, human capital formation, and other technology-related channels. Notice also that the magnitude of indirect and induced effects are on par with that of direct effects, if not greater."}, {"section_title": "Long-Term Economic Impact of Federally Funded Academic R&D", "text": "Below is the instrumental variable estimation of the relationship between GDP and R&D. Robust standard errors were used to minimize heteroscedasticity, autocorrelation, and stationarity issues. These potential biases will be subsequently tested in the robustness-check section. Each type of R&D analyzed in all models was instrumentalized using human capital variables including educational levels and availability of faculty. All variables used as instruments were lagged one period. These estimates include the impact of increased productivity in the economy through knowledge creation, human capital formation, and other technology-related channels. The results in Table 10 show a significant contribution of federal university R&D to state GDP. Academic R&D itself is highly significant in its relationship with state GDP, but federal R&D is of an even greater magnitude. The variable of interest, federal university R&D, is a significant predictor of GDP growth. A percentage increase in federal university R&D leads to a 0.127 percent boost in GDP, all else being equal. For instance, a 1 percent increase in federal academic R&D in Tennessee leads to a GDP gain of $330 million. The federal university R&D's impact on GDP is even greater than that of overall academic R&D coming from various sources, such as firms, not-for-profit institutions, and individuals. The results of this study suggest R&D marginal effects ranging from 0.10 percent to 0.35 percent. These results are consistent with the literature. For the U.S., all else being equal, an increase of $379 million in federal R&D may potentially increase GDP by $23 billion. Those results are consistent with the literature in both in the relationship between R&D and economic growth, but also in magnitude. Scenario: $400 Million Federal University R&D Impact in Tennessee Impact Type Jobs Personal Income Overall, R&D is a significant predictor of economic growth, no matter its source of funding. A 1 percent increase in a state's total R&D leads to a 0.347 percent increase in the state's GDP. For example, in Tennessee the gain from total R&D is substantial: a 1 percent increase in total R&D results in an increase of $902 million in GDP. Table 11 summarizes the gains from the most significant R&D for a few select states comparable to Tennessee. Business R&D is not significant for any of the specifications analyzed. The lower effect of business R&D compared to academic R&D might be due to competitive restrictions. Unlike academic R&D, business R&D often tends to be internal for the sake of competitiveness. This competitive secrecy hinders the measurement of potential gains in economic growth for business R&D. Lacking this characteristic, academic R&D can achieve a higher impact on GDP. The dissemination of academic R&D is also more straightforward through peer-reviewed materials and publication and therefore is less costly. Spillover effects are all highly significant for the model. The specification used in this paper relies on spillovers coming from lagged two-year periods of R&D investments to be internalized as output. The results being highly significant, although of minimal magnitude, points to a state's R&D investment promoting its own and other states' economic growth. This study's findings are consistent with the literature concerning the impact of R&D on economic growth. It extends the literature by analyzing states, which cannot be as easily categorized as firms with regard to technological proximity. Geographical proximity could be a potential dimension for measuring the effects of a state's R&D on neighboring states, which is a direction future research might take."}, {"section_title": "STUDY IMPLICATIONS, LIMITATIONS, AND FUTURE RESEARCH Implications", "text": "This study provides a pathway to improve productivity and promote innovation through arguably straightforward means. Innovation is key to economic growth, and the funding required to support and promote innovation is minimal in comparison to the expected large and positive economic consequences. The federal government could and should invest in higher levels of academic R&D specifically, as it is demonstrated that academic R&D yields the highest returns. Policies such as the Bayh-Dole Act have been crucial in promoting innovation within academia. Policies should be promoted and enacted that facilitate cooperation between businesses and universities and that even provide funding to promote such activities."}, {"section_title": "Limitations and Future Research", "text": "Sample Size and Structural Change. The study may be affected by several limitations, with the small sample size being the primary concern. This could potentially undermine our conclusions regarding the magnitude of the long-term impact of R&D on GDP. However, we conclude that our results are robust and in line with the findings in the literature. Moreover, the period of analysis (2005-2015) could potentially influence the results due to the economic recession (2008)(2009)(2010)(2011)(2012), when funding R&D may not have been among the federal government's foremost priorities. Time Lag and Spillover. Concerning the estimation itself, agreement on the number of appropriate lags for R&D is mixed. However, a large portion of the literature agrees to the point that one to three time periods seem acceptable, especially when accounting for fast-paced technological change. Moreover, the construction of spillover effects tends to differ, with some arguing for a knowledge production function methodology (Pakes & Griliches, Patents, and R&D at the Firm Level: A First Look, 1984), while others just look at the difference in \"knowledge levels.\" This paper takes a broader approach whereby total national R&D conducted would benefit all states equally. We believe this construct may need to be visited further. Estimation Biases. Several robustness checks were conducted to reduce biases in estimates: heteroscedasticity, autocorrelation, and a unit root/stationary test, which was undertaken to ensure the temporal invariability of statistical properties such as mean, variance, and autocorrelation, among others. Using a robust fixed effects model allowed for reducing this potential source of bias. Future Directions. The phase of technological change dramatically affects the life cycle of technology and products in the market. Future research may revisit the literature and carefully identify the time lag and structural breaks in translating federally funded R&D into innovation and welfare. Furthermore, the spillover concept may require robust treatment given the fact that technology and knowledge in today's world do not have a geographic boundary."}, {"section_title": "CONCLUSION", "text": "R&D investment is critical to the economic welfare of a state. R&D spending brings technological progress and innovation. Most important, it is economically beneficial. According to the results of this analysis, a significant number of states with high GDP also happen to have high levels of R&D spending. An investment in more R&D spending is beneficial to a state, although each state also needs to take advantage of the knowledge capital already available. Academic R&D seems to provide more value regarding GDP growth compared to business R&D. This finding might be due to two reasons: (1) geographical coincidence, whereby universities' R&D outcomes tend to stay local, while business activities tend to have a more national scope, and (2) it is difficult to measure private business R&D outcomes. Regarding federally funded R&D, neither short-nor long-term impacts are negligible."}]