[{"section_title": "INTRODUCTION", "text": "Causeways and artificial gravel/ sand/ and mud structures are a proven, desired, and apparently economical technique used by industry in the U.S. and Canadian Arctic for offshore exploration and development activities. Concern has been expressed over the effect these artifical features may have on preexisting circulation/ faunal migration routes/ and sediment transport pathways. Sediment pathways are affected by both the introduction of a new sediment source and by the alteration of the original transport pathways. The effects of these artificial features on longshore sediment transport studies are poorly known and may adversely affect coastal and nearshore erosion and deposition patterns.\nIn 1981 we presented initial observations indicating sediment accumulation in the vicinity of a 4.0 km solid-fill causeway extending from the northern Alaska coastline (Barnes and Minkler/ in press) and speculated on the effect causeways have on sediment dynamics (Fig 1) . In this report we document additional observed changes in bathymetry and present further data. We feel that such documentation will provide insight needed to assess natural versus man-related changes. Gravel causeways and gravel islands promise to be more prevalent in coming years in the shallow nearshore waters of the Alaskan Beaufort Sea shelf as evidenced by the addition of 1.6 x 10 yds of gravel used to extend the \"West Dock\" causeway northwest of Prudhoe Bay/ Alaska (Alaskan Construction and Oil/ Decejhber 1981).\nThe causeway (also known as \"West Dock\") consists of 3 segments each about 1500 m long. The innermost segment was built during the winter of 1974-75. The middle segment was built during the following winter (1975-76)/ and the outermost segment was built during the summer of 1981. Thus the inner segment has influenced the coastal environment for about 7 years/ the middle segment for 6 years/ and the outer segment for less than 1 year."}, {"section_title": "METHODS AND OBSERVATIONS", "text": "Precision bathymetric surveys in 1950/ 1976/ and 1981 were used to study changes in seabed topography. The data for 1950 was obtained from Coast and Geodetic Survey smooth sheet #7857. In both 1976 and 1981/ a skiff was used to survey the shallow area between the entrance to Simpson Lagoon and the West Dock (Barnes et al./ 1977 and Fig. 2) . Additional bathymetric data were gathered using the R/V KARLUK. Water depth was accoustically measured to a precision of 0.2 ft. and is believed to be accurate to ±.5 ft. A precision range/range system was used for navigation for the 1976 and 1981 surveys. Positions are believed to be accurate to 10 m. Sea level for all data was adjusted to Mean Lower Low Water (MLLW) using NOAA tide station #979-7649 located at the West Dock. Bathymetric data are given in feet since the 1950 and part of the 1976 surveys were measured in feet and we felt additional interpolation to metric units would significantly add error. The contoured bathymetry is shown in Figures 3/4 Isopachs of the differences in observed water depth were made from surveys run between 1950 and 1976 and between 1976 and 1981 where overlapping bathymetric data exists. Volume calculations from the isopachs used the mean thickness between isopach contours and the area between those contours. Considering navigation errors, line spacing, contouring subjectivity, and tidal differences, we believe the isopach map could be in error by a factor of as much as 2.\nBathymetric changes during the 26 years from 1950 to 1976 shows a change of 1 foot or less with minor erosion (-.4 cm/yr) for the area west of the causeway, and minor net deposition (+.04 cm/yr) for the area to the east of the causeway ( Fig. 6 and Table I ). The data of Barnes and Minkier (in press) are not strictly comparable as different areas are considered although the earlier values suggest similar trends. The isopach map of figure 7 shows that during the 5 years from 1976 to 1981, depth has generally decreased, suggesting deposition of up to 2.5 ft of sediment. In the area west of the causeway the average sedimentation rate is 8.5 cm/yr, and for the area east of the causeway the average sedimentation rate is 7.6 cm/yr (Table I ).\nIn water depths less than 4 feet, bathymetric data for 1976 and 1981 overlap where 1950 data are absent (Figs. 4 and 5) . For this extended area an isopach of changes between 1976 and 1981 was drawn (Fig. 8) . The results suggest an area of deposition of up to 2 ft extends inshore to about the 2-foot contour during the 5-year period between surveys (Fig. 8) . The west side shows 6.8 cm/yr average sedimentation, the east side shows 7.6 cm/yr average sedimentation. The volumes represented by the change in bathymetry were computed from the isopach maps* The areas between the isopach contours were multiplied by the mean value of the two contours* Between 1950 and 1976 the survey area lost about 10,000m /yr. While between 1976 and 1981 the survey shows the area to have gained sediment at a rate of 300,000 m /yr."}, {"section_title": "Isopach (in feet", "text": "A 37.5-cm-core sample was obtained in water 2 m deep 100 m west of the causeway (see Fig. 1 ). The core consisted of 35 cm of mud underlain by 2.5 cm of gravel. We interpret the gravel base as materials spilled during the time the causeway was being built (1975) (1976) . The accumulation of mud above the gravels would indicate an average sedimentation rate of 6 cm/yr."}, {"section_title": "DISCUSSION", "text": "Earlier papers (Barnes and Minkler, 1980, in press) discussed the effect of the causeway on the geological environment. The 1981 survey extends the coverage and further confirms that the causeway has sharply altered local sedimentation patterns. Sedimentation has occurred on both sides and offshore of the causeway (Figs. 7 and 8 ).\nPrior to causeway construction sediments in this study area would have been transported through the study area by longshore currents, by intensified currents entering the narrow entrance to Simpson Lagoon and by waves developed over long fetches in Stefansson Sound (Fig. 1) . These observations are in keeping with the general coastal and island erosion and retreat noted by other workers along the coast (Barnes et al., 1977; Lewellen 1977; Cannon and Rawlinson, 1979; . Reimnitz and Kempema (1982) observed infill of a natural sediment trap (a strudel scour) on the Sagavanirktok River delta 18 km east of the West Dock. They calculated a volume of bedload sediment moving over the delta platform of 9 m m yr . If the two inner causeway segments act as a 2500-m groin perpendicular to the shore, they could form a barrier to 22,500 m of sediment per year. This number is more than an order of magnitude less than the sediment we estimate to be accumulating around the causeway (300,000 m /yr, Table I ). The causeway apparently traps the equivalent of 10 times the bedload traveling in the nearshore. Sediments traveling as bedloads are normally much less than the total sediments in transit. In streams suspended sediment loads are 10 times bedload the causeway is apparently trapping much of this sediment also. studied changes in the texture of surficial sediment near the causeway from 1977 to 1981. These studies showed that surface sediment on the east side of the dock became coarser while sediment on the west side became finer during the 4-year period (Fig. 9) . The increased sedimentation and alteration of texture could be due to the wind regime and presence of the causeway. During the open-water season currents are dominantly westerly due to the persistent northeast winds (Mangerella et al., 1982) . The causeway acts as a groin to divert currents northward on the east side (Fig. 10) which carry with them coarser beach materials coarsening the seabed sediments. The quiet backwater created to the west of the causeway under the prevailing northeast wind would enhance the deposition of finer materials. Furthermore, "}, {"section_title": "Surface Circulation Circulation", "text": "Figure 10. Conceptual model of surface and bottom circulation with easterly winds (from Mangarella et al., 1981) .\nduring periods of northeast winds (Fig. 11 ) the area to the west of the causeway is an area of reduced wave energy that further enhances deposition of fine-grained sediment.\nData from inshore (Figs. 4, 5, and 8) suggest that the shoal extending from the east tip of Stump Island has built up 1-2 feet since 1976. In 1976 a 4-foot channel ran along the coast from Stump Island toward the causeway. This channel is about 1 foot shallower now (Fig. 6) and suggests a less effective flushing of the eastern end of Simpson Lagoon.\nArea of reduced wave energy. Figure 11 . Wave orthagonals from northeast wind with suggested areas of reduced wave energy in the quiet \"backwater\" of West Dock (from . Bathymetry is pre-causeway construction.\nSediment sources for the area could be coastal erosion, input from the Sagavanirktok and Kuparuk Rivers, the causeway itself, reworked sediment from the seabed, and combinations of these. We believe reworking of the sea floor in the coastal area to the east of the causeway is the most likely source of the deposited materials. The Kuparuk River is downstream from the sites of deposition during periods of northeasterly winds. The Sagavanirktok River is about 15 km to the east; too far to be an immediate sediment source. Coastal erosion of the 1-to 2-m-high coastal bluffs near the causeway is about 1 m per year (Barnes et al., 1977) and again too small a source to be the immediate provider of sediment. The causeway itself is composed predominantly of sandy gravel with less than 5 percent fines and again is an insufficient source; especially since only the surface of the causeway deposits are reworked.\nThe seabed in the vicinity is composed of variable amounts of sand, silt, and clay (Barnes, 1974; probably derived over time from the three sources discussed above: rivers, coastal erosion, and the causeway. As this sediment becomes resuspended during summer and fall storms, its transport and deposition are controlled by the wave and current regime in the vicinity of the causeway. This means that coarser sediment brought from the coast will be depositing on the eastern side of the causeway with its higher wave and current energy and that finer-grained sediment will be deposited in the lee of the causeway to the west where lower wave and current energies are encountered.\nIf breaks or openings in the causeway had been incorporated during 1974 and 1975 construction, they may have maintained the original sediment transport regime. The island chain bordering Simpson Lagoon (Fig. 1) could be considered as a long causeway. The fact that sedimentation rates in this lagoon are known to be low even with the Kuparuk River dumping into the eastern end (Fig. 1) , suggests that the lagoon is well flushed. The openings between the islands form about 10 percent of the barrier (causeway) length. This suggests that breaks on the order of 10 percent of the length of the causeway would be sufficient to alter the rate of siltation in the vicinity of the causeway.\nThe present bridged opening between the middle and outer segments may affect sediment transport pathways« The frequent infilling with gravel during the summer of 1981 suggests nearshdre sediments are initially attracted to the opening. Furthermore, the present opening is only 1 to 2% of the causeway length and thus may be inadequate to influence sedimentation."}, {"section_title": "SUMMARY", "text": "Repetitive bathymetric surveys and cores indicate that sediment deposition is occurring in the vicinity of an artificial-fill causeway. Previously the area had been one of seabed erosion. The change in environment is related to the change in wave and current regime brought about by the causeway construction. The combination of obstruction to shore-parallel transport and the deflection of flow offshore results in sedimentation in the vicinity of the causeway; the dominant winds from the northeast deflect coarser beach materials offshore on the windward side and favor fine-grain sedimentation in the lee. Thus the causeway acts as a groin, decreasing currents, which allows sediment to be deposited. Extension of the causeway from the water flood project will extend the area of quiet waters and deflected currents and will extend the area of sedimentaton seaward. Providing openings, similar to those in the existing barrier island chains, might maintain the present sediment transport regime."}]