[{"section_title": "", "text": "CAMD led a process that successfully advanced a clinical trial simulation (CTS) tool for AD through the formal regulatory review process at the US Food and Drug Administration (FDA) and European Medicines Agency (EMA)."}, {"section_title": "THE PROCESS OF MODEL DEVELOPMENT", "text": "A clinical trial simulation (CTS) tool was developed to describe disease progression based on longitudinal Alzheimer's Disease Assessment Scale-Cognitive sub-scale (ADAS-Cog) scores in mild-to-moderate AD, in a three-stage approach: (1) construction of a standardized database, (2) model development and evaluation, (3) FDA/EMA review for endorsement.\nTo capture the maximum amount of information available for development of the CTS tool, data from a variety of sources were needed, requiring a model that simultaneously fitted summary and patient-level data. The CAMD database consists of patient-level, control-arm clinical trial data (both on stable background therapy and placebo only) from CAMD members. A total of 3,179 patients from the CAMD database were used for model development and evaluation. Demographics, genetics, and individual items from cognitive scales (MMSE, ADAS-Cog, etc.) were included. Biomarker data were not consistently collected by industry sponsors; making their integration into the CTS tool difficult.\nThe CTS tool has three basic components that model drug, disease, and clinical trial features. The CAMD database enabled modeling of the placebo effect as well as the changing probability of a patient dropping out of a trial over time. To model the natural history of the disease, data were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (http://adni.loni.usc.edu); launched in 2003 by the National Institute on Aging (NIA), the National Institute of Biomedical Imaging and Bioengineering (NIBIB), the FDA, private pharmaceutical companies, and nonprofit organizations, as a $60 million, 5-year public-private partnership. ADNI's primary goal has been to evaluate how to combine data from magnetic resonance imaging (MRI), positron emission tomography (PET), other biological markers, and clinical and neuropsychological assessments to measure the progression of mild cognitive impairment (MCI) and early Alzheimer's disease (AD).\nModeling the drug effect was more challenging, given the lack of active treatment arm data in the CAMD database. Therefore, summary-level data from the literature were used; specifically, from 73 publications of unique trials that represented over 19,972 patients and 84,000 individual observations. However, because these trials pertain to drugs approved only for symptomatic effects (i.e., the cholinesterase inhibitors and memantine), the team reached consensus with the FDA on a modeling approach that would account for potential disease modification even in the absence of actual data from a drug that has been shown to be disease-modifying.\nDisease progression is conceptualized as the longitudinal change in ADAS-Cog over time.\n2 ADAS-Cog scores, bounded between 0 and 70, progress over time according to a sigmoid curve. 3, 4 This curve is well approximated by the logit transformation of a linear time course, the latter being defined by an intercept (baseline) and a slope (disease progression) over time. A Bateman function describes the placebo effect as a temporary beneficial change that eventually disappears, returning to the progression state and rate that would be expected under natural progression. 5, 6 The pattern associated with presumed \"purely symptomatic\" effects has so far been described as an overall function shift (intercept change with equal slope), such that the apparent rate of progression may change temporarily, but returns to the natural progression rate after some relatively short duration. [3] [4] [5] By contrast, it has been generally hypothesized that the pattern associated with a \"disease-modifying effect\" would manifest as a change (slowing) of the progression rate (slope), consistent with a benefit that continues to accrue over some relatively long duration. 3, 5 The FDA and EMA agreed to this conceptualization, recognizing that, for a disease-modifying claim, changing the rate of progression needs to be tied to a biomarker change reflecting underlying pathophysiology, as expressed in a recent FDA draft guidance. 6 "}, {"section_title": "CLINICAL TRIAL SIMULATION TOOL", "text": "This CTS tool incorporates covariates that may affect disease progression, such as age, gender, and APOE4 status. APOE4 carriers showed a faster rate of progression than noncarriers, 2 providing a quantitative estimate supporting current thinking about risk factors, with younger patients progressing faster. The model components provide a platform that enables simulation of a wide range of clinical trials according to variations in (1) drug, (2) disease state, and (3) trial design to select a trial design with a high likelihood of detecting a treatment effect as well as to evaluate the trade-off between sample size and power. The technical and scientific intricacies of the CTS tool are described in more detail elsewhere. 2 The CTS tool's flexibility to simulate beyond the standard parallel design used in most phase II and III AD clinical trials is important given that drugs may exhibit different nonlinear effects."}, {"section_title": "SYMPTOMATIC DRUG EFFECT SCENARIOS", "text": "For simulation purposes, AChEi-like effects (i.e., donepezil) can be considered as having a mean (placebo-adjusted) change in ADAS-Cog score of 2.5 points at 24 weeks (E drug,24week 5 2.5), an ET 50 (time to reach 50% of Emax) of 1.62 weeks, 2 and an effect-offset half-life (after discontinuation of treatment) of 1 week. Figure 1 (A-1 and A-2) displays the average simulated results for a 6-week cross-over and a 12-week parallel design with a pure symptomatic drug. Under these assumptions, the treatment effect in the cross-over design (placebo and treatment difference) is period-independent. Thus, in this context, a cross-over design may potentially reduce sample size with appropriate power. Table 1 summarizes the power and bias for a 6-week cross-over study and a 12-week parallel design study with a pure symptomatic drug. Approximately 89% power was achieved with 30 patients per arm (60 patients in total) in a 6-week cross-over study. The power of a 12-week parallel design with 75 patients per arm (150 patients in total) was approximately 82%. Meanwhile, as expected, the relative bias (with respect to the true mean differences at 24 week) of the 6-week treatment in the cross-over study (217.3%) was higher than the 12-week parallel study (27.3%), both of which would underestimate effects at week 24, given the achievement of a partial drug effect over the duration of the study. As shown in Table 1 , with a slower drug onset (e.g., ET 50 of 3 weeks, two times that of donepezil); the power in a 6-week cross-over study (81%) remained comparable to a 12-week parallel study (79%), although the difference of the relative bias for 6-week cross-over study significantly increased. Depending on the primary goal of the study, a trade-off can be determined for the increase in bias and the gain in power. For example, when the objective is to test if the drug has any effect rather than to measure the steady state treatment effect, the cross-over design would be favorable due to smaller sample size and higher power."}, {"section_title": "DISEASE-MODIFYING DRUG EFFECT SCENARIOS", "text": "To test disease-modifying effects, 18-month, randomized, parallel, placebo-controlled trials have been often selected. The delayed-start design may provide some empirical support for disease modifying claims. 7 The following simulation compares both designs (with N ranging from 100 to 600 patients per group) for disease-modifying drugs assumed to slow disease progression by 20%-50%. Figure 1 (B-1 and B-2 ) displays the average simulated results for a drug with moderate disease-modifying effect (50% disease-progression rate reduction, without symptomatic effect) in a 78-week (18-month) parallel trial vs. a 91-week delayed-start trial.\nFor an 18-month parallel design, approximately 85% power was achieved with 600 and 400 patients per group for 40% and 50% effects on progression, respectively ( Figure 1C ). Power to reject both hypotheses in the delayed-start design was lower ( Figure 1C) . For a moderate diseasemodifying effect of 50% progression rate reduction, 600 patients achieve an approximate 75% power, although the delayed-start design could potentially provide additional inference for disease-modifying effects.\nThese results demonstrate CTS could help development teams better understand and compare the operating characteristics of a wide range of trial design options for cognition as a primary endpoint in mildto-moderate AD. This resource allows selecting designs tailored to particular assumptions and considerations about the drug effects mechanism, magnitude, onset, and offset, within the trial's objectives. Such quantitative methodology permits a comprehensive integration of relevant information available for decision-making."}, {"section_title": "REGULATORY DECISIONS", "text": "After submitting briefing packages to the FDA and EMA, and holding face-to-face meetings with both agencies, the FDA deemed the CTS tool scientifically supported and fit for purpose to aid in the design of future clinical trials in patients with mild to moderate AD on June 12, 2013. EMA considered that the model is \"suitable for qualification for use in drug development as a longitudinal model for describing changes in cognition in patients with mild-to-moderate AD; for use in trial The CAMD CTS tool for mild-tomoderate AD patients is a prime example of integration of patient-level and literaturelevel data and the first to undergo a regulatory path for any disease. CTS tools are continuously evolving, and predictive accuracy needs to be validated using a wide variety of data sets. It is envisioned that this tool will be adopted by sponsors in AD, and that data will be shared so that the model can be enriched and expanded with biomarker data. Furthermore, given the awareness that treatment of early stage disease seems critical to achieve success, adapting and refining the model with data on predementia will enable sponsors to more accurately estimate clinical trial design in mild cognitive impairment and presymptomatic populations. This is of special interest in light of the need for appropriate outcome measures for predementia stages. The critical success factor for such future investments requires sharing of clinical trial data in these stages. As information accrues regarding optimal endpoints for different populations, including biomarkers and cognitive assessments, the quantitative approach applied in the development of the CTS tool will be instrumental in building next-generation modeling and simulation tools."}]