[{"section_title": "Abstract", "text": "This paper is part of a larger study that investigated the 'Effectiveness of collaboration on low and high achieving school students' comprehension of electrochemistry in South Africa'. The study occurred in the Ximhungwe circuit of the Bohlabela district in the Mpumalanga province of South Africa. The theoretical framework for this study was based on Vygotsky's social constructivism theory, which he defines as 'a sociological theory of knowledge that applies the general philosophy of constructivism into social settings'. A sample of 47 12th grade physical sciences students from two public schools (one of the schools is high achieving and the other is low achieving) in the circuit was purposively selected to participate in the study. Students were given electrochemistry concept test (ECT) as pre-test and post-test. Results from mean and standard deviation, and one-way between group analysis of covariance (ANCOVA) showed that high achieving school (HAS) students taught with the conceptual change teaching strategy (CCTS), specifically collaboration had significantly better acquisition of scientific conceptions related to electrochemistry than low achieving school (LAS) students, also taught with CCTS. Analysis from a scatterplot of post-test against pre-test grouped on type of school showed a linear correlation between pre-test and post-test scores for each intervention type, which indicated that there was no interaction effect. The study has shown that collaboration contribute to meaningful learning, which inadvertently improves students' comprehension and consequent achievement in electrochemistry concepts but more positive for students from high achieving schools."}, {"section_title": "INTRODUCTION", "text": "A couple of the forefront principles of Vygotsky's theories on cognitive development: the More Knowledgeable Other (MKO) and the Zone of Proximal Development (ZPD) have been used in classroom settings to enhance student achievement. According to McLeod (2014) , the MKO is indicative of someone who is equipped with a comparatively superior understanding or otherwise a superior range of abilities with respect to the particular task, process or concept. McLeod argued that MKO can refer to teacher or an older adult, or the peer group of students, or subsequently an adult who has acquired pertinently more knowledge and also experience. McLeod went further to indicate that MKO need not be indicative towards an existent individual. E-Tutors may be used in the education facilitate meaning and learning. When students first hear outward descriptions, they then turn these words inward, thus leading to modifications or transformations of their knowledge base. Accordingly, Gutherie and Wigfield (2000) indicated that cognitive engagement is enhanced when students are actively involved in social spaces where they discuss, debate, or critique each other's idea. Similarly, Wells (2000) has stated that an individual learns by interacting with a competent person. This means that lecturing can play a critical role in students' meaning making and conceptual development (Scott, 1998) . A teacher's encouragement for exploration of scientific ideas through discourse can help students understand concepts. Extended and elaborate teacher discourse helps students shift their conceptual understanding. From a social-constructivist position, classroom discourse provides opportunities for students to test the validity of their ideas and develop meaning of higher complexity (Aufschnaiter and Aufschnaiter, 2007) . Discourse within a group provides potential for a clash of ideas. Student-to-student and student-to-teacher discourse is important in a science classroom as it provides students with the tools and culture of the scientific community (Vosniadou, 2008) . This suggests that discourse provides a platform for students to be socially engaged in a meaningful learning process.\nIn tandem with the perspective of Vygotskian model of social constructivism, schooling is responsible for the creation of a social context of learning insofar as the individuals turn out to be immensely proficient with the deployment of the cultural tools (Smagorinsky and O'Donnell-Allen, 2000) . Thus, the idea of collaboration can be understood as the interactions that take place whereby the participants in a symbiotic manner tend to discover pertinent solutions as well as generate knowledge in association with each other (Smagorinsky, and O'Donnell Allen, 2000) . Furthermore, the idea of collaboration involves learning experiences, which facilitate a social context in association with which the learners understand one another by jointly working together. In the course of the process of collaboration, the students jointly operate together in order to solve a problem. Accordingly, Vygotsky, 1978 and Wertsch, 1991 have indicated that the role of social interaction in the development of cognition is the very basis of Vygotsky's theories and cannot be overemphasized. Thus, it is expedient for learners to work together to solve a given problem during collaborative discourse. It is believed that students have the opportunity to discuss concepts, practice what they do as they negotiate for more plausible outcomes and teach each other in order to deepen their comprehension of the subject matter. According to Galloway (2001) , two of the main principles of Vygotsky's work linked to collaboration are the More Knowledgeable Other (MKO) and the Zone of Proximal Development (ZPD). The MKO refers to an individual with superior comprehension or someone with greater level of competence of the subject matter (such as a particular task, process, or concept) than the learner. The MKO and the ZPD form the basis of the comprehension component of the cognitive guidance model of instruction. ZPD is defined as \"the distance between the actual developmental level as determined by independent problem solving and the level of potential development as determined through problem-solving under adult guidance or in collaboration with more capable peers\" (Vygotsky (1978, p. 86) . Vygotsky was of the conviction that when appropriate assistance is given to a student who is at the ZPD to perform a particular task, the student will be motivated enough to achieve the task. In actuality, this is the goal of collaboration, which allows students to work together on the same task, rather than in parallel on separate portions of the task. Collaborative Teaching Strategy helps students to develop their competence in some 21st-century skills, such as communication, critical thinking, metacognition, and motivation (Heyman, 2008; Thayer-Bacon, 2000) . Students who participate in collaborative activities tend to improve their communicative and critical thinking skills which increases their self-confidence.\nThe US-based Partnership for 21st Century Skills (hereinafter P21), a coalition of business leaders and educators, proposed a Framework for 21st Century Learning, which identified essential competencies and skills vital for success in twenty-first-century work and life (P21, 2007a, 2011) . These included 'The 4Cs' -communication, collaboration, critical thinking and creativity, which are to be taught within the context of core subject areas and twenty-first-century themes, which should be implemented in the 21st-century classroom. It has been observed however that during collaboration, students have the opportunity to discuss, practice by doing and teach each other, which ultimately enhance their creative, critical and innovative skills. This makes collaboration an essential tool to promote the inculcation of 21 st -century skills into students that will help them function and compete with their peers all over the world in the 21 st century. Incidentally, educators in a variety of educational settings have over the years used collaborative approaches to teaching and assessing students. Similarly, it has been observed that educators and policy formulators have identified the ability to collaborate as an important outcome in its own right rather than merely a means to an end. This is the reason why the Partnership for 21st Century Skills has identified collaboration as one of several learning and innovation skills that are important for postsecondary education and workforce success. Accordingly, collaborative learning is broadly defined as \"a situation in which two or more people learn or attempt to learn something together,\" and more specifically as joint problem solving (Dillenbourg, 1999, p. 1) . Collaborative learning is broadly defined as \"a situation in which two or more people learn or attempt to learn something together,\" and more specifically as joint problem solving (Dillenbourg, 1999, p. 1) . Roschelle and Teasley define collaboration more specifically as \"mutual engagement of participants in a coordinated effort to solve a problem together,\" (as cited in Dillenbourg et al., 1996, p. 2) . Dillenbourg and other experts have indicated that it is incredibly difficult to accept a single definition for collaborative learning as a result of the processes involved during collaborative learning. However, collaborative learning strategy occurs within small groups for effective discourse between group members. In collaborative discourse, members of each unique group work on the same task and pool their results together through negotiation and concerted effort from each other.\nSmall group discussion can be seen as one of the pertinent strategies deployed in the constructivist approach to teaching and learning. Normally, through the implementation of group study, an educator can recognise the cognitive processes (relevant to education) of the students, as they work in conjunction with one another in order to foster a pertinent understanding of scientific phenomena. It can be argued that the interaction that is centric from student to student per se encompasses the exchange of ideas as well as motivating each other by functioning in conjunction with one another with respect to accepted learning assignments. Piaget (1970) , states that other people perform a significant role within the domain of the cognitive development of others. In the course of group work it can be argued that the occurrence of a cognitive conflict is most likely to be witnessed by an individual, which through the requisite negotiations, spurs further to sophisticated structures of cognition. In addition, it can be empirically stated that according to Vygotsky's school of thought, the comparatively superior mental cognition skills are formulated as a result of the classroom social interaction that takes place between the students, which further facilitates the construction of knowledge. Further, Vygotsky delineates two sources of knowledge, namely; everyday knowledge, one that is derived from the interaction undertaken in tandem with the environment, and second, in terms of the formal instruction that is derived from the classrooms. It can be stated that the previous form of knowledge is based on the basis of peer interactions, language as well as experience, as peers play an important role in the construction of knowledge as well as the formulation of the new concepts. Learners use both form of knowledge to construct meaning. Researchers have indicated that students' peer to peer interaction is more effective than student to adult interaction as they have similar developmental levels, and it is believed contributes effectively to learner achievement."}, {"section_title": "PROBLEM OF THE STUDY", "text": "The woes of South African educational system originates from a well-developed education bureaucracy that was designed by the apartheid government to provide inferior education to fail black South African learners and prepare them only for menial work (Smut, 2014) . Apartheid-era educational disparities still suppress even the current crop of Black South African learners in post-apartheid South Africa. Majority of South African students, especially Blacks have a gargantuan fear for Mathematics and Science and see these subjects as anathema. In fact, current trends in South African students performance in internationally accredited tests, such as TIMSS (Trends in International Mathematics and Science Study) leaves much to be desired. A test on TIMSS (a 20-year-old international metric), was administered in 2011 to all participating countries including South Africa. The results indicated that a third of South African school children performed worse than if they had guessed the multiple choice answers to questions in mathematics and science (Smut, 2014; Martin et al., 2012) . This antecedent historical challenge continues to affect most South African students desiring to pursue science and mathematics in high school and beyond. It is in the light of this that the research was conducted as high school students in South Africa continue to perform poorly in Physical Sciences in general and in topics in Electrochemistry in particular since 2009, when the National Senior Certificate (NSC) examinations were introduced (Department of Basic Education Mpumalanga Province [DBEMP] 2015; Ochonogor, 2011) . Ahmad and Che-Lah (2012) observed that students experience conceptual difficulties as a result of the way they are taught in the classroom, which is predominantly the lecture (traditional) method as well as problem-solving difficulties they experience. Because of this, the majority of learners perform poorly and find it extremely difficult to attain a pass mark of 30% on the chemistry section of the NSC (National Senior Certificate) examinations. Although some stakeholders in education such as DBEMP (Department of Basic Education Mpumalanga Province) continue to support Physical Sciences learners through various interventions, results in Physical Sciences, Chemistry, and specifically Electrochemistry have been declining since 2010 (DBEMP, 2018) except for 2012. Some of the programmes organized by the DBEMP to improve the performance of Grade 12 students in particular in Physical Sciences include winter schools, spring schools, as well as special weekend camps, where expert teachers are brought together to teach students. Table 1 shows the pass percentage of students from 2010-2015 in Mpumalanga Province (DBEMP, 2018 (DBEMP, , 2017 (DBEMP, , 2016 (DBEMP, , 2015 (DBEMP, , 2014 (DBEMP, , 2013 (DBEMP, , 2012 (DBEMP, , 2011 .\nThe pass percentage at 30% shows a continuous improvement from 2010 to 2013 and then a decline in 2014 across the districts and the province, with the Bohlabela district scoring lower percentages. In 2015 there was an improvement in the district performance, which culminated in an improvement in the provincial performance as well. Similarly, the pass percentage at 30% shows a continuous improvement from 2010 to 2012 and then a decline in 2013 and 2014 in Electrochemistry and consequently Chemistry, but the Electrochemistry average is generally lower than the overall average for Chemistry so it is contributing to pull the Chemistry average down. However, in 2015 there was an improvement in the Electrochemistry performance, which led to an improvement in the learners' performance in chemistry. There was a decline in performance in galvanic cells in 2014 and then an improvement in 2015. Even though learners' achievement in electrolytic cells increased from 2013-2015, the pass percentage was less than that of galvanic cells. This suggests that students' achievement in galvanic cell, electrolytic cell and ultimately Electrochemistry indirectly affects achievement in Chemistry, which is a cause for concern as it contributes 17.4% towards the Chemistry paper (DBE, 2011)."}, {"section_title": "Purpose", "text": "The study used collaboration as a teaching strategy to compare its effect on the comprehension of electrochemistry by students from both low and high achieving schools. It was also to further investigate students' achievement when they have the opportunity to collaborate on problems related galvanic cells, electrolytic cells and electrode potential separately. The study focused on the outcome of students' negotiation during collaborative learning. This study analyzed the outcome of collaborative learning in HAS and LAS classrooms in Ximhungwe Circuit of rural South Africa in order to observe its effects on conceptual comprehension of electrochemistry by students from HAS and LAS."}, {"section_title": "Significance", "text": "First this study will show the sources of students' Alternative conception, miscomprehension and difficulties of electrochemistry. It will promote comprehensive discussion in the problem areas among students, which appears to generate positive cognitive conflicts that will probably enhance conceptual comprehension, conceptual change and problem-solving capabilities. Secondly, the study will discover and record practices and situations in the experimental group, which might give some insight into the factors that might account for the difference in performance of HAS and LAS students in electrochemistry. This study will also provide useful information as to the processes that students go through in solving a particular problem through collaboration to finally come up with a correct pooled solution. Finally, this study will have significance for future policymakers in South Africa on the use of collaboration to enhance students' comprehension and achievement in challenging high school chemistry topics such as electrochemistry. Camps organized for students in the various municipalities can also make use of collaborative learning strategies as a 21 st -century skill to help address students' difficulties in electrochemistry."}, {"section_title": "Research question", "text": "One research question was framed for this study:\n1. What is the effect of collaboration on as a teaching strategy on low and high achieving physical sciences students' comprehension of electrochemistry concepts?"}, {"section_title": "Hypotheses", "text": "The following hypotheses were framed for this study: 1. Ho1: There is no statistically significant interaction effect between type of school and conceptual change teaching strategy with respect to students' comprehension of electrochemistry concepts. 2. Ho2: There is no statistically significant mean difference between post-test mean scores of HAS and LAS students with respect to their comprehension of electrochemistry concepts.\nHo1: There is no significant interaction effect between type of school and conceptual change teaching strategy with respect to students' comprehension of electrochemistry concepts. In order to test for interaction effect between type of school and conceptual change teaching strategy, it was presumed that the pre-test shared a linear correlation with the post-test, for all groups of the independent variable, type of school. A scatterplot of post-test against pre-test grouped on type of school was plotted. The result is as shown in Figure 1 , which indicates a linear correlation between pre-test and post-test scores for each intervention type for type of school, as evaluated by visually examining the scatterplot.\nFurthermore, the interaction effect was statistically tested by determining whether there is a statistically significant interaction term, type of school*pre-test. In order to do this, a general linear model univariate analysis was conducted. The result showed that the interaction term was not statistically significant indicating that there was homogeneity of regression slopes, F (1, 44) = .003, p = .960. When the Explore procedure was run, the results generated indicated that post-test scores were normally distributed for HAS (p=.067) but not for LAS (p=.031), as evaluated by the Shapiro-Wilk's test (p < .05). However, an assessment by visual inspection of Normal Q-Q plots and histograms indicated that students' post-test scores were normally distributed. An evaluation by Levene's test of homogeneity of variances indicated that there was also homogeneity of variances, (p = .408). H02: There is no significant mean difference between post-test mean scores of HAS and LAS students with respect to their comprehension of electrochemistry concepts. In running the ANCOVA, the dependent variable represented the students' comprehension of electrochemistry concepts (post-test scores), whereas the covariate depicted the students' pre-test scores. The independent variable showed the school type, HAS or LAS. The results are presented in Table 4 .\nAfter modifications for pre-test scores, there was a statistically significant difference in post-test scores between the interventions, F(1,44) = 12.683, p = .001, partial η2 = .127.\nThe strength of the relationship between type of school and comprehension of electrochemistry concepts as shown on Table 3 was mildly strong. From Table 4 it is observed that school type accounted for 12.7% of the variance of the dependent variable when the pre-test is controlled as covariate. The result from this study, which indicated that high-achieving students performed better than low-achieving students is inconsistent with studies conducted by Kenneth and Young (1999) , and Hampton and Grudnitski (1996) . Hampton and Grudnitski (1996) reported low achieving undergraduate business students benefited the most from cooperative learning. Additionally, Kenneth and Young (1999) specifically investigated the effect of cooperative learning groups on the academic achievement of high-achieving pre-service teachers and noted that cooperative learning did not enhance their academic performance. In spite of the overwhelming evidence of high-achieving schools performing better than low-achieving schools, critical analysis of individual scores showed that some low achievers performed better than some high achievers. It is likely that low achievers received more scaffolding and help from more capable peers as opposed to high achievers who could have been at a higher level of comprehension at the time the pretest was taken. This is in line with Vygotsky's social interaction theory with reference to the concept \"the zone of proximal development (ZPD) i.e. the distance between the actual developmental level as determined by independent problem solving and the level of potential development as determined through problem solving under adult guidance or in collaboration with more capable peers (Galloway, 2001 ). Consequently, low achievers attain more than high achievers based on this concept. However, Tudge (1993) found that the degree of confidence students brought to a task was an important factor in the interaction, which accounted for high performance. Comparatively, the confidence level of high achievers was very high and that might have accounted for their high achievement in the post-diagnostic test in this study."}, {"section_title": "METHODOLOGY Research Design", "text": "The researcher found that a quasi-experimental design was suitable for the research as it was impossible to casually allocate students to a specific class division; hence the researcher employed the convenience sampling technique (Gliner et al., 2011) . For instance, in the research schools, the researcher did not casually allocate students as individuals to investigative groups and control groups as the school timetable could not be altered for the purposes of the current research. For example, all students in a specific classroom were casually allocated as an intact group to act as the Experimental Group (EG) or Control Group (CG). The main research employed four pre-established or intact groups (classes), made up of two low achieving schools and two high achieving schools. However, this article focuses on only the experimental group, which is made up of one low achieving school and one high achieving school. The experimental group teacher employed collaborative discourse combined with conceptual change texts (theoretical modification texts) with the role of a facilitator being enacted by the teacher."}, {"section_title": "Sample and Sampling Technique", "text": "The sample of the study consisted of forty-seven grade 12 physical sciences students from two high schools in the Ximhungwe circuit, which were randomly selected using the table of random numbers from six high achieving and four low achieving schools respectively. These two schools formed the experimental group and consisted of 28 students from HAS and 19 students from low achieving schools, which were taught using collaboration. In addition, the schools were selected based on their performance in the NSC examinations. This is to ensure that the findings from this study were solely based on the differences in the type of school used."}, {"section_title": "Instrumentation", "text": "The data collected in this study was mainly focused on the responses in the post-diagnostic test. The instrument used is Electrochemistry Concept Test (ECT), and a semi-structured interview protocol based on ECT. Some of the instruments were developed by the researcher and some adapted by comparing with various literature and validated by some experienced physical teachers and Physical Sciences subject advisors. In this paper, only the data on ECT in the pre and post-diagnostic pencil and paper tests are presented. A ten-question two-tiered test was constructed based on the format developed by Treagust (1988) . The first tier of each pair of questions was based on procedural knowledge and the second tier was based on conceptual knowledge, with the student choosing a reason for their choice in the first tier. This type of questioning has the potential to distinguish between procedural knowledge and conceptual knowledge when examining student work (Treagust, 1988) . The researchers created this test to assess the students' comprehension of electrochemistry concepts. Alternative conceptions reported by Sanger and Greenbowe (1997a) , Garnett and Treagust (1992b) , Ogudey and Bradley (1994) , and O'grady-Morris (2008) were examined and the Alternative conceptions were selected based on the topics and used in this study to develop ECT. There were four alternatives for each question. Distractors that represented the Alternative conceptions were also part of the four options provided for every question. A score of one is given to a student who gets the first-tier and second-tier questions correctly. A student scores zero if the first-tier questions are answered correctly but second-tier question is answered wrongly. The reason is that knowing the concept helps one to easily answer a procedural question otherwise it is mostly guesswork. A student scores one-half of the marks if the concept is correct but the procedure is wrong. Most electrochemistry questions in the grade 12 National Senior Certificate (NSC) examinations have sub-questions in this format and in most cases, students score the first tier but not the second. The interview guide had questions relating to complete circuits and movement of charged particles, electrode characteristics, everyday meanings for scientific vocabulary and redox reactions and the redox table. An internal consistency coefficient was determined to measure the Cronbach alpha in order to identify the reliability of the test. It was discovered that the reliability of the test stood at 0.82."}, {"section_title": "Method of Data Collection", "text": "Two schools out of the ten schools from the Ximhungwe circuit served as the experimental group (made up of one low-achieving school and one-high-achieving school), which were taught using collaboration. A physical science teacher was trained by the researchers and used for the study to teach the two groups of students. He was chosen because the NSC results of his students have been improving consistently over the years. The lessons were observed by the researchers in turns weekly to ensure that there was no bias in terms of the strict implementation of the teaching strategy. When the research began, a pre-test on ECT was administered to all the grade-12 students in the two schools that had signed either the consent form or informed consent form and agreed to participate in the research. When the intervention ended, a post-test using the same instrument was conducted but the questions were scrambled randomly to ensure that students do not benefit unduly. The ECT was administered as a pre-test before instruction began as treatment for four weeks after which the post-test was administered. The researchers were present to observe when and how both the pre-test and post-test were administered to ensure that the same classroom climate prevailed in all the research schools. The physical sciences educators for the research schools were advised not to be in the classrooms when the pre-test and post-test were administered to the learners in order not to possibly influence their answers. Both the pre-test and post-test were marked by two of the researchers and cross-checked by the other two to ensure that there was consistency in the marking of the scripts. The ECT involved a pencil and paper test on electrochemistry concepts for the post-test. The teacher used three hours per week, one and half hours per class period for the four weeks of treatment."}, {"section_title": "RESULTS AND DISCUSSION", "text": "Analysis of the data indicated no significance skewness or kurtosis and no outliers. Levene's test was significant (p < 05) indicating that the homogeneity of variance assumption had not been violated. Students' post-diagnostic scores were analysed and a higher score indicated the eradication of alternative conceptions as against a lower score. The researchers used mean and standard deviation to find out whether collaboration used in the study has effect on the performance of learners from both low achieving schools and high achieving schools. The two school types formed the experimental group of a major study and collaborative discourse were used to ascertain its effectiveness on students achievement from the schools. The interaction term was not included in the ANCOVA output in Table 4 as the presumption of homogeneity of regression slopes has already been validated in the scatter plot."}, {"section_title": "Research Question", "text": "What is the effect of collaboration as a teaching strategy on low and high achieving physical sciences students' comprehension of electrochemistry concepts? To answer this question, mean and standard deviation for low and high achieving students were found. Table 2 presents the post-test means and standard deviations of the LAS and HAS, taught using collaboration.\nThe results from Table 2 indicate that mean post-test ECT score (49.90 ± 8.40) for the HAS was higher than mean post-test ECT score (42.82 ± 7.24) for the LAS. This suggests that CCTS improved electrochemistry concept achievement in HAS compared to LAS.\nA Bonferroni adjustment was executed to conduct a Post hoc evaluation as shown in Table 3 to find out whether the mean differences are actually statistically significant.\nFrom Table 3 , HAS had the highest post-test scores, which was statistically significantly greater than the posttest scores of the LAS (p < .001), with a mean difference of 6.201. The pairwise comparison showed that there was a significant variation amongst the post-test mean scores of HAS and LAS with respect to comprehension of electrochemistry concepts."}, {"section_title": "CONCLUSION", "text": "This study looked at the use of collaboration to teach the topic of electrochemistry in the grade-12 CAPS Physical Sciences curriculum. The study has indicated that students have several Alternative Conceptions related to Electrochemistry, otherwise called electrochemical reactions in the CAPS document for high schools in South Africa, and these Alternative Conceptions affect students' comprehension of chemistry viewpoints. Thus, it is crucial to seek techniques to rectify these alternative conceptions so as to fulfill meaningful learning. The inferences of the current research showed that collaboration assisted students in remediation of their Alternative conceptions and improved their comprehension of electrochemistry concepts.\nHowever, students from high achieving schools performed better than those from low achieving schools on their post-test scores when taught using conceptual teaching strategy. Students from High achieving schools showed greater understanding of electrochemistry concepts compared to students from low achieving schools using conceptual change teaching strategy for both, when they were examined after the instruction. The data presented from the mean, standard deviation, Post Hoc analysis and ANCOVA were able to show the differences between the HAS and LAS students' performance on ECT. The results indicated that there were differences in the conceptual understanding of LAS and HAS students, especially when the students provided descriptive explanations that require further elaboration in the guided interview.\nFrom the findings obtained on the analysis of the results, the evidence shows that HAS students developed a better conceptual understanding (even though they were all taught using collaboration), in comparison with LAS students, suggesting that HAS students benefitted more from CCTS compared with LAS students. Thus, there must be some aspects of the collaboration that contributed to these differences in the achievement of the groups. Drawing from this, the effectiveness of the collaboration can be determined according to whether or not students in the HAS had developed a better conceptual understanding after teaching in comparison to LAS."}, {"section_title": "LIMITATIONS", "text": "The most crucial limitation of the research was the sampling technique, as intact groups were employed in the present research; thus, it was likely to have limited generalizability. A research that uses random sampling and a large sample size would provide more precise inferences and offer superior generalizability. The sample could also symbolise a larger population."}, {"section_title": "IMPLICATIONS", "text": "This study has several implications for teachers and policy formulators. Just by assigning students to groups and asking them to work together will not necessarily promote collaborative learning or achievement. In the experimental condition, students often require prompting from the teacher to ensure they adequately discuss, negotiate and come out with plausible explanations with their partners. Consequently, training students in interactive skills such as facilitating collaborative discourse, communication and being sensitive to each other's needs, may be a prerequisite of successful peer collaboration."}, {"section_title": "RECOMMENDATIONS", "text": "Collaboration as a 21 st -century skill, used in this study can be used as a tool in the South African classroom to help improve students' conceptual comprehension of electrochemistry as shown in this research. Physical Sciences teachers are encouraged to determine important concepts in the chemistry syllabus and apply relevant instructional strategies that will help increase learner achievement."}, {"section_title": "ACKNOWLEDGEMENTS OR NOTES", "text": "The University of South Africa is hereby acknowledged for granting the primary researcher a bursary and ethical clearance that enabled this work to be carried out. The Mpumalanga Department of Education is also acknowledged for granting the researcher permission to conduct the study in the Province."}]