[{"section_title": "Introduction", "text": "Recent price increases for both direct (i.e., fuel and electricity) and indirect (i.e., fertilizer) energy have resulted in higher production costs for corn producers. Indexes of prices paid by farmers for fertilizers and fuels rose 33% and 82%, respectively, between 2001 and 2005 with further increases recorded in 2006 ( Figure 1) 2 . Consequently, the share of per acre corn operating costs attributable to direct and indirect energy inputs rose from 44% in 2001 to nearly 50% in 2005(USDA/ERS 2006. Expenditures by corn producers for fuel ($42/acre) and fertilizer costs ($59/acre) were estimated to be over $100/acre, or about $8 billion in aggregate in 2006 ( Figure  2) 3 . Furthermore, while real fossil fuel prices are forecast to decline somewhat during the 2007-10 period, prices are expected to remain well above the levels experienced during the late 1990s and early 2000s ( Figure 3). 1 9 9 6 1 9 9 7 1 9 9 8 1 9 9 9 2 0 0 0 2 0 0 1 2 0 0 2 2 0 0 3 2 0 0 4 2 0 0 5 2 0 0 6 Index (1992=100) Fertilizer Fuels Source: USDA/NASS Not only is corn is an energy-intensive crop, but it is also widely grown in the United States. In 2006, the 79 million acres planted to corn for all purposes accounted for nearly one-fourth of all cropland used for crops in the United States. (Lubowski et al. 2006). Furthermore, the use of energy for domestic corn production is likely to increase during the next few years in response to growing demand for corn (Collins 2006). Based on USDA's recent Prospective Plantings report, planted acreage may reach over 90 million acres in 2007 with the increase largely linked to growing demand for corn by-products, especially ethanol (USDA/NASS 2007). While higher commodity prices resulting from increased demand may lead to a greater ability to absorb large energy-related production costs, corn producers will likely continue to seek ways to offset these costs through energy conservation where economically feasible or growing less energy intensive crops (Raulston et al. 2005). However, between 2001 and 2005 (the period of our analysis), corn producers experienced only modest increases in per acre gross value of production ( Figure 2 "}, {"section_title": "Objectives", "text": "Given that corn production is a relatively energy intensive crop and that energy prices have increased significantly in recent years, producers have received clear signals to conserve energy and/or find suitable substitutes. The objective of this analysis is to document changes in the use of energy-using or conserving practices by U.S. corn producers during a period of rapidly rising fossil fuel prices. Using field-level, probability-based surveys conducted in 2001 and 2005, we statistically tested for differences in the use of energy-related practices and technologies between the two years. This analysis also examines the extent of practice and technology adoption which is indicative of the potential for additional energy conservation by corn producers. However, we recognize that changing production systems often entails additional costs including new capital equipment, financial resources, information sources, or training. The limitations of our approach to examining producer response to changing direct and indirect energy prices should be made explicit. The analysis is essentially a comparative static analysis and does not directly test for causation (i.e., changes in production practices cannot be directly linked to energy price/costs changes). As noted above, numerous factors are likely involved with any decision to adopt new production practices or technologies. Nevertheless, documenting the levels and shifts in energy-related practice and technology adoption between two points in time offers insights into the role of energy in modern production agriculture. 10.00 12.00 1 9 9 5 1 9 9 7 1 9 9 9 2 0 0 1 2 0 0 3 2 0 0 5 2 0 0 7 2 0 0 9 $/mmBTU (2004 $) Crude Oil"}, {"section_title": "Natural Gas", "text": "Source: USDOE/EIA"}, {"section_title": "Literature Review", "text": "Most studies have found that producers respond slowly to energy and fertilizer price changes, primarily because of the costs and/or time lags associated with capital stock or production management changes (Miranowski 2005;Uri and Herbert 1991;Denbaly and Vroomen 1993;McCamley and Kleibenstein 1985) 5 . But over time, producers can adapt to rising real energy prices in a variety of ways. Field operations, crop drying and irrigation account for most of the direct energy consumed in corn production. Fuel conservation has been well documented for conservation tillage systems (which require fewer trips across the field), in-field crop drying, and low-pressure irrigation systems (Collins 2000;Werblow 2005) 6 . Custom operations, such as crop drying or field operations, also consume energy for corn production but may be able to provide services in a more energy-efficient manner (e.g., economies of scale) than those performed by farm operators (Hill 1970). Larger multi-function machines and diesel powered tractors (compared to gasoline) can also produce energy savings (Uri and Day 1992). In general, fuel use per acre declines as the number of trips over the field declines and as the size of machine increases (University of Illinois 2006aIllinois , 2006b. Depending on the level of maintenance, older tractors may be less fuel-efficient than new models (Successful Farming 2005). Conservation of indirect energy used on the farm typically focuses on the adoption of best management practices for pest control and nutrient use (USDA/NRCS 2005). The Natural Resources Conservation Service (NRCS) often recommends a combination of nutrient management practices for both economic and environmental reasons. Such practices include reducing application rates for commercial fertilizer as prices increase (especially nitrogen, which consumes large amounts of natural gas during the manufacturing process and, hence, its price is sensitive to natural gas markets); using fertilizer substitutes (such as nitrogen inhibitors, manure, or legumes in rotation with corn); improving nitrogen fertilizer efficiency by applying nitrogen several times during the growing season (especially after planting and by minimizing fall application); and acquiring more information to determine optimal application rates (i.e., setting reasonable yield goals, conducting soil and tissue tests, and seeking advice about nutrient use) (University of Nebraska 2000). Weed and insect management practices, such as cultivation and pest scouting, can also affect energy use primarily through the number of pesticide treatments. The relatively new bio-tech seed and precision agriculture technologies can reduce energy use by lowering the number of trips across the field, reducing use or changing the type of fertilizer and pesticide products, or improving tillage and chemical application efficiency via the use of guidance systems or variable rate applicators (Fawcett and Towery 2001) 7 . The relatively rapid increase in direct and indirect energy prices has generated interest in modifying current conservation programs to encourage on-farm energy conservation. Such programs as the Conservation Security Program (CSP) and Environmental Quality Incentives Program (EQIP) can encourage the adoption of selected practices, such as conservation tillage and nutrient management, which impact energy use (U.S. Department of Agriculture 2006) 8 . Also, producers with cropland designated as \"highly erodible land\" (HEL) may be able to meet commodity program participation requirements by adopting conservation tillage systems. As a result of participation in various conservation programs, producers may be required to produce a written whole-farm plan which addresses appropriate resource concerns including energy conservation along with preserving soil, water and air quality."}, {"section_title": "Data", "text": "Data for the analysis come from USDA´s 2001 and 2005 Agricultural Resource Management Survey (ARMS) of corn producers. The ARMS data used in this study are from a field-level survey of farms producing corn for grain in the 19 largest corn producing states 9 . Information is collected on input use (i.e., seed, fertilizer and pesticides), production practices (i.e., tillage, pest and nutrient management), participation in conservation program as evidenced by field-level conservation plans, sources of information on nutrient management, field operations (i.e., tillage, planting, cultivation, fertilizer and pesticide applications, and harvesting), bio-tech and precision agriculture technologies, and tractor use. Producers were also asked if they responded to recent increased fuel and nitrogen prices and, if so, how they responded. Each corn field sampled in the ARMS represents a known number of fields with similar attributes. By appropriately weighting the data for each field, inferences about the entire planted area of the surveyed states is possible. The surveyed states represent over 90% of the acreage planted to corn in the United States. A smaller number of fields were sampled in 2005 than 2001, but the amount of planted acreage actually increased (Table 1). Paired t-tests were used to test for mean differences between survey years. Due to the complex design of the ARMS survey, standard errors were estimated using a jackknife replication approach (Dubman 2000)."}, {"section_title": "Results", "text": ""}, {"section_title": "Practices/technologies associated with direct energy use", "text": "Field operations, drying and irrigation are critical activities associated with direct fuel consumption (i.e., diesel, gasoline, electricity, LP, and natural gas) (Foreman 2006) 10 . With the exception of an increase in conservation and no-till acreage, there was little change in the share of corn acreage using a particular technology for tillage, drying or irrigation (Table 1). While the mean number of trips over the field did not change (i.e., about six), the number of custom operations increased slightly between 2001 and 2005 (Table 2). However, the share of acres reporting more than seven trips over the field declined over the five year period ( Table 1). The mean size of planters and harvesters increased between the two years (Table 2), but the share of acres using relatively small equipment (i.e., less than six rows) remained about the samebetween 30 and 40% of all planted acres 11 (Table 1). While causality cannot be established between rising fuel costs and changes in production practices, some corn producers have altered their field operations since 2001. Even though the survey data indicate a statistically significant decline (1%) in the share of acreage using a diesel tractor, it is clear that the \"dieselization\" of U.S. agriculture is nearly complete and little energy conservation potential exists from the adoption of more diesel tractors. However, the average age of the largest tractor used on the field continues to increase (Table 2) and the share of the acres using a tractor of older than 15 years remains substantial (i.e., 35-39%) ( Table 1)."}, {"section_title": "Practices/technologies associated with indirect energy use", "text": "Nearly all corn acres are treated with nitrogen fertilizer (Table 3) and herbicides (Table 4) which suggest that more careful management of these inputs could have an impact on energy use as well as a potentially positive economic impact. However, only a few of the pest or nutrient management practices showed significant changes over the study period 12 . Acreage receiving all applied nitrogen after planting declined, but there was no statistically significant evidence of changes in the share of acres with multiple season applications (Table 3). A decline in the share of corn acres rotated with a legume (mirroring a significant increase in continuous corn acres) suggests that less nitrogen was available from sources other than commercial fertilizer (Table 4). On the other hand, a significant decline in the share of acres treated with insecticides and cultivated for weed control clearly saved energy 13 -a phenomenon possibly related to the significant increase in use of herbicide-tolerant and Bt seed varieties 14 (Table 4). Significant changes in the use of several nutrient use practices were unexpected (Table 3). For example, the share of acres reporting a phosphorus test declined while an increasing share of acres relied on a fertilizer dealer for nitrogen rate information 15 . Also, the share of acres reporting a yield goal in excess of actual yield (greater than 20%) increased between 2001 and 2005. Yield goal can be a critical aspect of nitrogen management because Extension services often make application rate recommendations based on a farmer's yield goal (University of Nebraska 2000). To the extent that yield goals influence nitrogen application rates, an unrealistic yield goal in excess of actual yields can lead to more nitrogen being applied than is used by the crop 16 ."}, {"section_title": "Participation in Conservation Programs", "text": "Several conservation programs have provisions designed to influence on-farm energy conservation. However, the modest share of corn acres managed under various conservation management plans (i.e., 1-9%) suggests that these programs have had a modest impact on energy use (Table 5). Survey data for 2005 indicate that participation by corn farmers in EQIP or CSP was limited. To the extent that an HEL designation on cropland encourages the adoption of energy-conserving tillage systems, a maximum of about 20-22% of all corn acreage may have been impacted. 12 In fact, nitrogen application rates were statistically unchanged between 2001 and 2005 despite a 25% increase in anhydrous ammonia prices and a near doubling of prices between 2000 and 2005 (Table 3). However, the share of acres receiving over 200 lbs/acre of nitrogen (a rate about 33% above the average) remained unchanged at 8-9% between 2001 and 2005. 13 A reviewer noted that the Prices Paid Index for agricultural chemicals (e.g., herbicides) has been fairly stable over the last several years which may have made energy-intensive field cultivation less attractive than chemical weed control. 14 While the share of acres scouted declined between the two years, this result may have been influenced by a change in how the question was asked. 15 One study found that farmers who rely on independent consultants for fertilizer recommendations had lower application rates compared to farmers using dealers (McCann and Easter 1999). 16 The mean of the yield goal/actual yield ratio did not change between 2001 and 2005 (Table 2). Clearly weather and other factors influence actual yield and account for much of the divergence between yield goal and actual yields. However, the data indicate that producers tend to be optimistic with respect to their yield goal (i.e., yield goals exceeded actual yields by 8% in our two survey years). Furthermore, national yields in 2001 and 2005 were not influenced by extreme weather events-based on USDA's 2001 baseline (USDA/WOAB 2001) expected or trend yields for 2001 and 2005 were 136 and 146 bu/acre, respectively, while actual yields were 138 and 148. However, a reviewer pointed out that a 8% yield divergence could be an economically rational response to variability in weather or fertilizer and corn prices."}, {"section_title": "Producer identified responses to increased fuel and fertilizer prices", "text": "Respondents were asked about specific responses to the nitrogen price increases in the early part of 2001 and 2005 (Table 5). Between 2001 and 2005, some producers responded to increased nitrogen fertilizer prices by changing one or more nutrient use practices on a much larger share of corn acres, especially reducing their nitrogen application rate and closer N management (i.e., soil-testing, split application, soil incorporation, etc.) 17 . With respect to fuel price increases, no 2001 data are available for comparison, but by 2005 producers indicated that they had reduced the number of field operations and increased field drying on a large share of corn acreage-a finding consistent with other survey data such as the significant increase in conservation tillage. Nevertheless, on the vast majority acres, producers did not report changing their nutrient management practices in response to the spike in nitrogen prices in the early part of 2001 or 2005."}, {"section_title": "Practices/technologies with a large potential for conserving energy use in corn production", "text": "Large and sustained fuel and fertilizer price increases would likely encourage producers to consider adopting energy-conserving practices and technologies. Based on survey data for 2001 and 2005, several potential energy-saving production practices have not been adopted on a significant share of corn acreage. For example, nearly a quarter of corn acres still utilize conventional tillage systems (including 3-4% using moldboard plows-a very energy intensive tillage operation) ( Table 1). Of all the corn irrigated with a pressure system, only about half utilized an energy-saving low pressure system. Even though the mean size of planters and harvesters is increasing, small-scale machines are still used on 30-40% of all corn acreage. Similarly, older tractors (greater than 15 years) are used for at least one field operation on 35-39% corn acres. While the use of bio-tech seed and precision agriculture technologies is increasing, adoption remained below half of all corn acres in 2005 (Table 4). The level of adoption of several recommended nutrient management practices remains modest. For example, nitrogen inhibitors and manure, which can act as substitutes for commercial nitrogen, are not widely used but, in the case of manure, local availability is constrained to regions with concentrated livestock operations (Table 3). About 12-15% of all acres still receive a single nitrogen application in the fall and only about 30% receive nitrogen after planting. Only about 25% of all acres are soil-tested for nitrogen each year. Also, setting realistic yield goals seems to be problematic for producers on 19-25% of all acres 18 ."}, {"section_title": "Conclusions/Implications", "text": "Since 2000, indexes of prices paid for fuel and fertilizer have increased significantly. Much of the previous empirical economic research concluded that farmers respond slowly to increased prices for direct and indirect energy. In general, the survey data presented in this analysis reflect modest shifts in the use of selected practices and technologies which influence energy use. Part of the slow response is likely attributable to the fact that changing production systems often entails additional costs including new capital equipment, financial resources, information sources, or training. However, significant increases in conservation tillage (and related decreases in the number of tillage operations), declines in cultivation for weed control, and fewer acres receiving insecticides likely led to reduced energy use on a significant share of acreage. Also, a significant number of corn producers, as exhibited by their willingness to rapidly adopt both bio-tech and precision agriculture technologies over a relatively short period, can respond relatively quickly to changing economic conditions and availability of new technologies. Finally, producers stated that, between 2001 and 2005, they changed certain production practices in response to energy prices. Another implication of this study is that the potential for additional energy-conservation in corn production is quite large. A significant share of acreage used to produce corn (i.e., about 25%) still uses conventional tillage, only about half of all corn acres are systematically scouted, soiltesting is used on only one-fourth of all acres, and split nitrogen applications and after planting applications are not widespread. The use of small scale (i.e., less than 6 rows) planting and harvesting machines and older tractors, which may be less fuel efficient, will likely decline over time and lead to additional energy-savings. Less than half of all corn acres currently utilize biotech seed or precision agriculture technologies. Finally, given the modest level of participation in current conservation programs, there is considerable opportunity for public policy to influence energy conservation. Static economic models used to evaluate the impact of increased input prices on net returns often assume that producers do not change input use, production practices or technologies in response to increased input prices. This study found that such an assumption can be misleading when, in fact, producers can adapt to higher energy prices. As the survey results presented in this analysis indicate, producers made adjustments between 2001 and 2005 in the practices and technologies used to produce corn and these changes were at least consistent with producer responses to sustained increases in energy-related input prices. Areas for further research include: 1) assessing the factors which inhibit rapid adoption of energy conserving technologies and practices; 2) the role of policy in agricultural energy conservation; and 3) given the likely increase in continuous corn production, what are the economic and environmental implications of changes in tillage, pest, nutrient and water management practices used to produce more corn. Additionally, econometric or other models could be used to isolate the ceteris paribus response of producers to increasing energy prices.  "}]