[{"section_title": "Abstract", "text": "Purpose: This study aimed to identify the neural basis of executive function (EF) in amnestic mild cognitive impairment (aMCI) according to beta-amyloid (Aβ) positivity. Furthermore, we explored if the identified brain areas could serve as predictors for clinical progression.\nWe included individuals with aMCI using data from [ 18 F]-florbetapir-positron emission tomography (PET), fluorodeoxyglucose-PET, and EF scores, as well as follow-up clinical severity scores at 1 and 5 years from baseline from the Alzheimer's Disease Neuroimaging Initiative database. The correlations between EF score and regional cerebral glucose metabolism (rCMglc) were analyzed separately for aMCI with low Aβ burden (aMCI Aβ-, n=230) and aMCI with high Aβ burden (aMCI Aβ+, n=268). Multiple linear regression analysis was conducted to investigate the associations between rCMglc and clinical progression. Results: Longitudinal courses differed between aMCI Aβ-and aMCI Aβ+ groups. On average, aMCI Aβ-subjects maintained their level of clinical severity, whereas aMCI Aβ+ subjects showed progression. EF impairment in aMCI Aβ-was related to the anterior cingulate cortex (ACC), whereas that in aMCI Aβ+ was related to Alzheimer's Disease -vulnerable brain regions. ACC and the posterior cingulate cortex were associated with clinical progression in aMCI Aβ-and aMCI Aβ+, respectively. Conclusion: Our findings suggest that although MCI subjects showed similar behavioral phenotypes at the time of diagnosis, EF and further progression were associated with different brain regions according to Aβ burden. Clarification of the etiologies and nature of EF impairment in aMCI are critical for disease prognosis and management."}, {"section_title": "INTRODUCTION", "text": "Mild cognitive impairment (MCI) is an intermediate state between normal aging and dementia, with evidence of cognitive impairment but preserved functional independence. 1 MCI has various etiologies, leading to its heterogeneous neuropsychological profile 2 and biomarker positivity patterns. 3 In particular, a considerable proportion (36-46%) of individuals with MCI showed low levels of beta-amyloid (Aβ) deposition. 4, 5 In addition, the clinical course of MCI is also diverse. MCI is not always a prodromal form of AD; it can be any type of dementia, and can remain stable over a long period of time 6 or may even be reversible. 7 For example, based on 41 robust cohort studies on MCI progression, 8 overall annual conversion rate was around 6.7% for all kinds of dementia, 6.5% for AD dementia, and 1.6% for vascular dementia. A considerable number of MCI cases were not progressed to dementia for more than 10 years follow-up. 8 Although memory deficit is generally considered an early cognitive alteration associated with MCI, other cognitive deficits are also widely observed in MCI. Notably, previous MCI studies have reported executive dysfunction [9] [10] [11] and frontal lobe alteration. 12 Executive function (EF) encompasses a set of topdown cognitive processes to support goal-directed behavior. 13 Consequently, EF and memory could influence each other. 14 As Seo, et al. 11 pointed out, memory and EF are closely related. More importantly, EF is an important cognitive domain in prognosis and dementia conversion. For example, previous works showed EF impairment years prior to MCI 11, 15 or AD diagnosis. 16 Compared to MCI with higher EF, MCI with lower EF is more often converted to AD after 1 year. 14 Moreover, EF test, not episodic memory tests, combined with regional cerebral glucose metabolism (rCMglc), has high predictability for conversion from normal to MCI or AD dementia. 16 Taken together, previous studies suggest the important role of EF as an early warning system in the clinical course of MCI.\nNevertheless, only a limited number of studies have directly investigated the functional neural correlates for EF impairment in MCI populations. One functional imaging study reported that connectivity strengths in dorsolateral prefrontal cortex (DLPFC) and anterior cingulate cortex (ACC) were associated with EF in MCI. 17 In terms of AD population, EF impairment was correlated with rCMglc in parietotemporal and prefrontal regions. 18 Findings from structural brain studies on MCI also suggested a correlation between parietotemporal and prefrontal regions and EF. 19, 20 However, little attention has been paid to the nature of EF impairment in MCI with pathophysiologies other than AD; i.e., MCI with low Aβ burden. It is plausible that EF failure in MCI depends on different neural substrates according to their etiologies.\n[ 18 F]-fluorodeoxyglucose positron emission tomography (FDG-PET) is a valuable index of synaptic function that provides information to understand underlying neurodegenerative pathology. 21 It is a commonly used methodology for evaluation of the brain-cognition relationship and early detection of dementia. 22 A recent meta-analysis of nine FDG-PET studies suggested that hypometabolism in posterior cingulate cortex (PCC) and precuneus (PreCu) were the most reliable and robust markers for early detection of and tracking conversion from MCI to AD. 23 Hypometabolism in ACC was also related to clinical progression, but it was much less reliable. 23 These areas could be acceptable candidate imaging biomarkers of clinical progression.\nTherefore, this study aimed to identify the functional neural basis of EF impairment in MCI separately for Aβ positivity. Furthermore, we explored whether the identified functional brain areas could serve as predictors for clinical progression."}, {"section_title": "MATERIALS AND METHODS", "text": ""}, {"section_title": "Participants", "text": "Data on individuals with MCI were selected from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (adni. loni.usc.edu). For detailed explanation of the ADNI, please refer http://www.adni-info.org. The diagnosis criteria for MCI in ADNI database were clinical dementia rating (CDR) 24 of 0.5, Mini-Mental State Examination (MMSE) scores between 24 and 30, a memory complaint with objective memory loss as defined by logical memory test score but showing no impairment in other cognitive domains, preserved activities of daily living, and nondemented. 25 Therefore, MCI from ADNI database were all amnestic MCI (aMCI). The inclusion criteria for the current study were described previously. 26 Briefly, individuals with aMCI who had conducted [ 18 F]-florbetapir-PET and FDG-PET, as well as clinical and cognitive assessment. The final analysis included 498 individuals who received baseline clinical evaluation and PET scans between April 2010 and December 2013. Among these 498 individuals with MCI, followup diagnosis and CDR sum of boxes (CDR-SOB) at 1 year later, which were assessed between March 2011 and June 2014, were collected to obtain information on clinical progression. CDR-SOB covers six domains of cognitive and daily functioning, with a score ranging from 0 to 18. It is a useful tool for staging clinical severity. In addition, renewed diagnosis and CDR-SOB at 5 years later, which were assessed between March 2015 and December 2018, were also collected to obtain information on longer clinical progression. To control for the interval time, we included subjects who had an evaluation visit at 54-66 months from baseline date."}, {"section_title": "EF measures and other clinical information", "text": "ADNI composite scores for EF (ADNI-EF) 27 were selected to measure EF. This score was developed using factor analysis on the measures including Digit Symbol Substitution and Digit Span Backwards from the revised Wechsler Adult Intelligence Scale, Trail Making Tests A and B, Category Fluency, and Clock Drawing Test. Therefore, ADNI-EF score covered a wide range of EF components. The score was standardized with a mean of 0 and a standard deviation of 1, based on the 800 subjects in ADNI. 27 Higher score meant better EF in MCI. For everyday functioning, we included the Functional Assessment Questionnaire (FAQ), which assessed the instrumental activities of daily living with a score ranging from 0 to 30. For global cognition, MMSE score was included. Information on apolipoprotein E (APOE) genotypes was also collected."}, {"section_title": "Florbetapir PET", "text": "We obtained the mean florbetapir standardized uptake value ratio (SUVR) for each participant. A detailed description of florbetapir PET acquisition and processing can be found on ADNI website (http://adni.loni.usc.edu/methods/pet-analysis-method/pet-analysis/) or in previously published reports. 28 Briefly, the subject's first florbetapir image was co-registered to their magnetic resonance image and segmented into Freesurfer (version 4.5.0, Athinoula A. Martinos Center for Biomedical Imaging at Massachusetts General Hospital, Massachusetts, MA, USA; https://surfer.nmr.mgh.harvard.edu/)defined cortical regions (frontal, anterior/posterior cingulate, lateral parietal, and lateral temporal). Next, the mean florbetapir uptake from these gray matter regions was extracted relative to the uptake in the whole cerebellum. Participants were classified as aMCI with low Aβ burden (aMCI Aβ-) or aMCI with high Aβ burden (aMCI Aβ+) according to SUVR cut-off of 1.11 for amyloid positivity. 28"}, {"section_title": "FDG-PET preprocessing", "text": "We collected the most preprocessed form of FDG-PET data from ADNI to investigate the relationship between ADNI-EF and rCMglc. ADNI-PET protocol was strictly followed in each site. ADNI preprocessing steps of FDG-PET data were previously described. 25 Briefly, a quality control process was applied to all scans, which included assessment of image resolution and uniformity, checks for statistical noise, motion assessment across temporal frames, and visual checks for common artifacts. Then, using the original raw PET images, the different temporal frames were co-registered. All image sets, including dynamic image and single-frame averaged image sets, were reoriented to a common spatial orientation and interpolated onto a uniform image grid. To reduce inter-scanner differences (17 different scanner models from three vendors), the images were smoothed with a scanner-specific filter derived from each site's Hoffman phantom, and then provided a common isotropic resolution of 8-mm full-width at half-maximum resolution. 25 We further preprocessed for group-level analysis. These scans were adjusted for their origin, and spatially normalized to the Montreal Neurological Institute (MNI, McGill University, Montreal, Canada) space using Statistical Parametric Mapping 12 (SPM12) (Institute of Neurology, University College of London, London, UK) implemented in MAT-LAB (MathWorks; Massachusetts, MA, USA). They were then smoothed with a Gaussian kernel of 8-mm full-width at halfmaximum. Finally, global normalization using proportional scaling was performed, as it has a higher signal to noise compared to that of cerebellar count normalization. 29 A region of interest (ROI)-based approach was also applied to investigate the association between rCMglc and clinical progression. The automatic anatomic labeling (AAL) algorithm and a region-combining method were applied to set ROIs to measure regional brain metabolism in the bilateral ACC (AAL template No. [31] [32] , bilateral PCC (AAL template No. [35] [36] , and bilateral PreCu (AAL template No. 67-68). 30 "}, {"section_title": "Statistical analysis", "text": "The correlations between ADNI-EF and rCMglc were analyzed separately for aMCI Aβ-and aMCI Aβ+ groups using a multiple regression model with age, sex, education, and APOE genotype as covariates. Statistical threshold was set at p<0.001, uncorrected for multiple comparisons, with an extent threshold of greater than 50 contiguous voxels. CDR-SOB was further added as a covariate to the multiple regression model to control for clinical severity. These analyses were performed using SPM12 (Institute of Neurology, University College of London).\nDemographic and clinical data were compared between groups by separate one-way analysis of variance (ANOVA) and χ 2 tests for continuous and categorical variables, respectively. Multiple linear regression analysis was conducted to investigate the associations between rCMglc and clinical progression as measured by CDR-SOB at 1 year later. Age, sex, education, and APOE ε4 genotype were included in the first step using the \"Enter\" method to control for their effects on CDR-SOB; then, ACC, PCC, and PreCu metabolism were included using the \"Stepwise\" method. Additional multiple linear regression analysis was also conducted to investigate the associations between rCMglc and further clinical progression (CDR-SOB) 5 years later. These analyses were performed using SPSS version 25.0 (IBM Corp., Armonk, NY, USA), and p values <0.05 were considered statistically significant."}, {"section_title": "Ethics statement", "text": "Institutional Review Boards approved the study procedures across institutions participating in ADNI. Written informed consent to share data for scientific research purposes was obtained from each participant. A request for access to data was approved by the ADNI Data and Publication Committee (https://adni.loni.usc.edu/wp-content/uploads/how_to_apply/ADNI_DSP_Policy.pdf). The institutional review board of Chosun University also approved the present study (IRB no. 2-1041055-AB-N-01-2017-28)."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Participant characteristics at baseline and follow-up", "text": "Based on mean SUVR, aMCI group was divided into aMCI Aβ-(n=230) and aMCI Aβ+ (n=268). The demographic and clinical characteristics of the 498 subjects are presented in Table 1 . No group differences in sex or education were found; however, aMCI Aβ-group was younger than aMCI Aβ+ group. APOE ε4 carriers were more frequent among aMCI Aβ+ subjects. CDR-SOB, FAQ, MMSE, and ADNI_EF scores were significantly worse in aMCI Aβ+ group compared to those in aMCI Aβgroup. Among them, 409 (82.1%) subjects completed evalua-tions at 1 year later. Individuals with aMCI Aβ+ (n=253, 94.4%) were more followed than aMCI Aβ-(n=156, 67.8%) (χ 2 df=1 = 59.564, p<0.001) at the 1-year follow-up ( Table 1 ). The 5-year follow-up analysis included 120 (24.1%) subjects. Remaining subjects were not followed up after 1 year (n=56), or were followed up but were not included in the analysis due to longer (n=38) or shorter (n=195) follow-up intervals than 5.0±0.5 years.\nChanges in CDR-SOB scores are shown in Fig. 1 . These scores did not differ between baseline and one-and 5-year follow-up in aMCI Aβ-group, whereas these scores were significantly increased from baseline to 1 year (p<0.001) and between the one and 5-year follow-ups (p<0.001) in aMCI Aβ+ group. CDR-SOB scores in aMCI Aβ-group were significantly lower than those in aMCI Aβ+ group (baseline, p=0.01; one-and 5-year followup, p<0.001). In aMCI Aβ-group, three individuals converted to dementia but seven reverted to cognitively normal (CN) status at the 1-year follow-up, and no individuals had additionally converted to dementia but nine had reverted to CN at the 5-year follow-up. In aMCI Aβ+ group, 33 converted to dementia but six reverted to CN at the 1-year follow-up, and 28 additionally converted to dementia and four reverted to CN at the 5-year follow-up."}, {"section_title": "Relationship between ADNI-EF and rCMglc at baseline", "text": "The relationships between ADNI-EF and rCMglc were investigated after controlling for age, sex, education, and APOE genotype. In aMCI Aβ-group, significant positive correlations between ADNI-EF and rCMglc were found mainly in bilateral ACC (Fig. 2 , Table 2 ). In contrast, in aMCI Aβ+ group, significant positive correlations between ADNI-EF and rCMglc were found in bilateral PreCu, left PCC, bilateral middle temporal gyri, bilateral inferior parietal lobule, and bilateral superior frontal gyri ( Fig. 3 , Table 2 ). These patterns of correlation remained unchanged when clinical severity was added as a covariate."}, {"section_title": "Associations of clinical progression with ACC, PCC, and PreCu rCMglc", "text": "Multiple linear regression analysis using stepwise method showed Aβ positivity-dependent distinct patterns of associations between rCMglc ROIs and CDR-SOB at 1 year. In aMCI Aβ-group, baseline ACC hypometabolism was significantly associated with a higher CDR-SOB (β=-0.260, p=0.003) independently of age, sex, education, and APOE genotype. In contrast, in aMCI Aβ+ group, baseline PCC hypometabolism was significantly associated with a higher CDR-SOB (β=-0.190, p= 0.003) independently of age, sex, education, and APOE genotype (Table 3 ). In terms of 5-year follow-up, aMCI Aβ-group showed no significant associations between rCMglc ROIs and CDR-SOB. However, aMCI Aβ+ group showed a significant as- "}, {"section_title": "Fig. 2.", "text": "Brain areas with significant positive correlations between regional cerebral glucose metabolism and executive function in amnestic mild cognitive impairment (aMCI) with low Aβ burden. Statistical parametric maps showing positive correlations between Alzheimer's Disease Neuroimaging Initiative executive function composite scores and regional cerebral glucose metabolism using a multiple regression model with age, sex, education, and apolipoprotein E (APOE) genotype as covariates in aMCI with low Aβ burden. Significant regions have p<0.001 (uncorrected for multiple comparisons) with an extent threshold of greater than 50 contiguous voxels. The yellow-red color bar represents t-score. "}, {"section_title": "DISCUSSION", "text": "The results of the current study demonstrated that aMCI Aβand aMCI Aβ+ groups had distinct brain regions correlated to EF and different predictors of clinical progression. The rCMglc in bilateral ACC and AD-vulnerable brain regions were correlated with EF in aMCI Aβ-and aMCI Aβ+ groups, respectively. Moreover, rCMglc in ACC and PCC were associated with clinical progression in aMCI Aβ-and aMCI Aβ+ groups, respectively.\nAs expected, longitudinal courses differed clearly between the two groups. On average, aMCI Aβ-subjects maintained their level of clinical severity, whereas aMCI Aβ+ subjects showed clinical progression, suggesting that aMCI Aβ-subjects had a much longer duration of illness than did aMCI Aβ+ subjects. As shown in Fig. 1 , on average, aMCI Aβ-subjects showed no clinical progression. While some aMCI Aβ-subjects showed increased CDR-SOB (n=37, 24% of aMCI Aβgroup), they numbered much less than aMCI Aβ+ subjects with progression (n=121, 47.8% of aMCI Aβ+ group). During 1-year follow-up, 2% of aMCI Aβ-subjects converted to AD dementia, compared to 13% of aMCI Aβ+ subjects. Our observations that much higher progression rate in aMCI Aβ+ subjects were largely consistent with previous reports on longitudinal studies of MCI, 31, 32 which have examined conversion rate separately for Aβ positivity. Along with previous report, 33 Fig. 3 . Brain areas with significant positive correlations between regional cerebral glucose metabolism and executive function in amnestic mild cognitive impairment (aMCI) with high Aβ burden. Statistical parametric maps showing positive correlations between Alzheimer's Disease Neuroimaging Initiative executive function composite scores and regional cerebral glucose metabolism using a multiple regression model with age, sex, education, and apolipoprotein E (APOE) genotype as covariates in aMCI with high Aβ burden. Significant regions have p<0.001 (uncorrected for multiple comparisons) with an extent threshold of greater than 50 contiguous voxels. The yellow-red color bar represents t-score. was coded as the number of epsilon 4 alleles (0, 1, or 2). Sex was coded as 0 and 1 for female and male, respectively; † R 2 =0.062, p=0.008; ‡ R 2 = 0.108, p=0.005. different conversion rates between aMCI Aβ-and aMCI Aβ+ groups also suggest that Aβ deposition is a very early process in the course of AD. Our results support that, although MCI subjects were diagnosed using the same criteria and showed similar behavioral phenotypes at the time of diagnosis, underlying pathologies could to lead different clinical courses.\nThe relationship between brain function and cognition is important for the understanding of underlying pathology. Multiple etiologies could cause superficially similar symptoms; i.e., EF impairment in aMCI; however, the neural base for impairment may differ. We found clear differences according to Aβ positivity in the current study. Our findings in aMCI Aβ-group suggest that bilateral ACC is a critical brain area responsible for Aβ-independent EF impairment. Similar to our results, a previous study reported that metabolism in ACC was correlated with EF measured by fluency test and declined with normal aging. 34 There is rich literature supporting the role of ACC in cognitive control, such as monitoring and evaluative processes. 35 Given that ACC is connected to DLPFC and parietal cortex 35 and serves as a hub in brain networks associated with cognitive control, 36 reductions in cerebral glucose utilization in ACC in our aMCI Aβ-subjects indicates that their EF impairment could be related to an inefficient brain system for cognitive control. On the other hand, our study also revealed that EF impairment in aMCI Aβ+ group was related to the default mode network (DMN), which was mainly affected by Aβ pathology 37 rather than isolated dysfunction of EF-related brain system. Hypometabolism, particularly in PCC and PreCu, key areas of DMN, was the most robust feature in the progression from MCI to AD. 23 Previous studies reported that EF impairment in MCI and AD were correlated to both temporoparietal and prefrontal regions. [18] [19] [20] These reports and our findings altogether suggest that EF failure in aMCI due to AD may be the consequence of AD pathology, rather than pure EF-related brain systems. Taken together, the current findings indicate that, although the two subgroups were superficially in the same aMCI category, EF impairment process depends on completely different functional brain regions according to the Aβ burden. Information on neuropathology is important to understand clinical characteristics and diverse patterns of clinical progression in MCI. 38 Another point worth mentioning is that we adopted a composite scoring system for EF, which was developed through factor analysis of the wide range of EF tests. 27 EF is basically an umbrella term encompassing decision-making, abstract thinking, planning, integrative attention, inhibition, maintenance, monitoring, set shifting, etc. 13 A single EF test covers only a subset of executive components. Therefore, combining results from multiple EF tests could be used to more precisely assess the neural substrates of EF compared to a single test.\nGiven that EF and its related brain areas can play an important role as an early warning system in clinical progression, 11, 39 the current study examined separately whether ACC, PCC, and PreCu were associated with clinical progression according to Aβ positivity. ACC and PCC were associated with clinical progression at 1 year in aMCI Aβ-and aMCI Aβ+, respectively. However, ACC was no longer useful for the prediction of clinical progression at 5 years in aMCI Aβ-group, whereas PCC was still associated with clinical progression at 5 years in aMCI Aβ+ group. Our results indicate that ACC, but not posterior brain areas, can be a useful predictor for short-term Aβindependent clinical progression regardless of age, sex, education, and APOE genotype. Given that ACC is a main node of cognitive control network, 36 alterations in EF-related brain systems might play a role in the pathogenesis of Aβ-independent clinical progression. In contrast, hypometabolism in PCC in aMCI Aβ+ can be a useful predictor for both short-term and long-term clinical progression regardless of age, sex, education, and APOE genotype. This finding is consistent with those of a recent meta-analysis which investigated brain regions with hypometabolism to predict the conversion from MCI to AD. 23 Based on nine studies, they concluded that hypometabolism in PCC and PreCu were the most robust regions for early detection and disease tracking. 23 Previous studies considered PCC and PreCu as a single cluster, whereas this study used separate ROIs for these regions. In the current study, only PCC, and not PreCu, was a significant predictor of clinical progression. This finding might be attributable to the high correlation between PCC and PreCu (Pearson correlation, r=0.361, p< 0.001). We applied stepwise regression. After including PCC in the regression model, PreCu did not significantly increase the model fit. PCC is a key node of DMN 40 that is altered in AD dementia that involves very early stages of AD trajectory and leads to the neurodegeneration process in AD. 41 Despite its significant implications, the current study had some limitations and needs future improvements. First, sample size at the 5-year follow-up was small, since we excluded data if the evaluation interval times more or less than 5 years from baseline date. Consequently, the associations of rCMglc ROIs and long-term clinical progression were interpreted with caution. Further studies based on larger sample sizes for longterm clinical progression are advised to replicate our results. Second, we investigated the neural correlates for EF in terms of localizationist view. Given that ACC and PCC are the hubs of cognitive control network and DMN, respectively, further network-based neural correlate studies using functional and structural imaging are warranted to extend our knowledge of the mechanisms of underlying EF impairment in MCI.\nIn conclusion, to our knowledge, the current study is the first to separately explore the functional neural correlates of EF impairment in aMCI with and without Aβ pathology. Given the role of EF as an early warning system and the pathophysiological heterogeneity in MCI, clarification of the etiologies and the nature of EF impairment in MCI are critical for disease prognosis and management. EF impairment in aMCI Aβ-was related to ACC, the main node of cognitive control network, whereas EF impairment in aMCI Aβ+ was related to the PCC, PreCU, and other AD-vulnerable brain regions. Moreover, ACC and PCC were associated with the clinical progressions of aMCI Aβ-and aMCI Aβ+, respectively. These findings suggest that, although MCI subjects showed similar behavioral phenotypes at the time of diagnosis, EF impairment and further clinical progression was associated with completely different brain regions according to their Aβ burden."}]