[{"section_title": "Abstract", "text": "A shortage of female and minority students pursuing science, technology, engineering, and mathematics (STEM) careers has prompted researchers and policy makers to examine the current STEM supply pipeline. This study examined factors influencing STEM career aspirations of a nationally representative sample of 9th-grade students (N = 21,444). Characteristics of students who aspired to STEM careers and non-STEM careers were examined. Guided by the career aspirations model (Mau & Bikos, 2000) , the authors conducted logistic regression analyses to investigate variables predicting STEM career aspirations. Results indicated that race, gender, socioeconomic status, math interest, and science self-efficacy were the most important predictors of STEM career aspirations. Counselors in school and related career services contexts are encouraged to consider these important factors in identifying high school students who are interested in STEM career choices, as well as in planning career interventions to facilitate their career paths. Future researchers could test the applicability of this model with middle school students or adults."}, {"section_title": "STEM Career Aspirations of Women and Minorities", "text": "Among career aspiration studies, many researchers have focused on the STEMrelated aspirations of women (Betz & Hackett, 1983; Nauta & Epperson, 2003) and racial and ethnic minorities (Austin, 2010; Fouad & Santana, 2017; Fouad & Smith, 1996; Gainor & Lent, 1998; Grossman & Porche, 2014) . For example, Mau et al. (1995) examined characteristics of eighth-grade female students who aspired to careers in science or engineering (SE). They found that girls who aspired to SE careers scored significantly higher on several academic and psychological variables, such as educational aspirations, perceived parental expectations, grade point average, academic proficiency, locus of control, and self-esteem, than did girls who aspired to homemaking occupations. Likewise, Mau (2003) investigated persistence of career aspirations in SE careers as a function of gender and race. That study's results showed that men were more likely than women to persist in SE career aspirations. It also found that although students of underrep-resented racial and ethnic backgrounds might be less likely to aspire to SE careers, those who did were just as likely to persist as those in the majority. More recently, Schuster and Martiny (2017) found that women were less likely to aspire to STEM careers because of gender stereotypes.\nMost previous studies concerning factors associated with female and minority students' STEM career aspirations either were limited by small sample sizes or were not longitudinal in nature. Researchers also tended to focus on a few measurements with no theoretical framework to guide their studies. Generally, STEM-related research is largely conducted at the college level. Educational goals and career aspirations of high school students are the most significant predictors of eventual educational (Gottfredson, 1981) and career (Dika, Alvarez, Santos, & Suárez, 2016) attainment. Thus, research focusing on the career aspirations of younger students should be more critical because early interventions can be well implemented in the middle and high school levels (Fouad & Santana, 2017) . Mau and Bikos (2000) developed a career aspirations model (CAM) for underrepresented high school students. Their model, consisting of four clusters of variables, was developed based on an extensive literature review, as well as SCCT (Lent et al., 1994 ), Gottfredson's (1981 Gottfredson's ( , 2005 theory of circumscription and compromise, and the status attainment model (Blau & Duncan, 1967; Sewell, Haller, & Portes, 1969) . The four clusters of variables are (a) gender and race, (b) familial/parental (e.g., socioeconomic status [SES] , parental educational expecta-tions, parental involvement), (c) school/academic (e.g., academic achievement, school engagement, school belonging, teacher influence), and (d) personal/psychological (e.g., math and science self-efficacy, identity, utility, interests). Using a nationally representative sample of 24,599 high school students, Mau and Bikos (2000) found that the CAM had a good fit to the data, with 72% prediction accuracy. Gender and race significantly predicted career aspirations beyond the contribution of familial/parental, school/academic, and personal/psychological variables. Although the CAM has been empirically proven to be descriptive of the educational and vocational aspirations of female and minor-ity students, to our knowledge, no study has been conducted to examine the robustness of the model in predicting STEM career aspirations."}, {"section_title": "STEM Career Aspirations Model", "text": ""}, {"section_title": "Present Study", "text": "Guided in part by the CAM (Mau & Bikos, 2000) , we investigated factors influencing aspirations in STEM careers using a nationally representative sample of 21,444 ninth-grade students. The following two research questions were investigated: (a) Are there differences in familial/parental, school/academic, and personal/ psychological characteristics as a function of STEM career aspirations? and (b) How do those factors affect students who are pursuing a STEM career? We believe that findings from this study will help school counselors and admin-istrators identify potential pools of students who show interest in STEM careers and will help them understand the support students need to achieve their goals."}, {"section_title": "Method Data Sources", "text": "We used data from the High School Longitudinal Study of 2009 , which was conducted by the National Center for Education Statistics (NCES; Ingels et al., 2014) . The current study was approved by our university's institutional review board. The HSLS:09 is the fifth in a series of NCES secondary longitudinal studies. The base-year survey is composed of a nationally representative sample of 21,444 ninth-grade students. The HSLS:09 base year took place in the 2009-2010 school year, with a randomly selected sample of fall term ninth graders in more than 944 public and private high schools. The HSLS:09 target population was defined in the base year as regular public schools, including public charter schools, and private schools in the 50 states and the District of Columbia that provided instruction to students in both the ninth and 11th grades as of the fall of 2009.\nData were collected through a stratified, two-stage random sample design, with primary sampling units defined as schools selected at the first stage and students randomly selected from the sampled schools within the second stage. A total of 944 schools out of 1,889 eligible schools participated in the baseyear study, resulting in a 50% weighted response rate. The first follow-up sample (with sample refreshment) was composed of 23,415 eleventh graders (50.9% male, 49.1% female; 55.3% White, 15.4% Hispanic, 10.4% Black, 8% Asian, and 10.9% other) and took place in 2012 when most sample members were in the spring term of the 11th grade. Students took a mathematics assessment and survey online. Students' parents, principals, and mathematics and science teach-ers, as well as the school's lead counselor, completed surveys by phone or online (Ingels et al., 2014) ."}, {"section_title": "Variables", "text": "The core research questions for the HSLS:09 explored secondaryto-postsecondary transition plans and the evolution of those plans, the paths into and out of STEM, and the educational and social experiences that affected these shifts. We selected the key dependent and independent variables for this study.\nDependent variables. STEM aspiration was measured by the following survey question: \"Which occupation do you expect or plan to have when you are 30 years old?\" Although expectations are sometimes distinguished from aspirations in theory, almost all empirical research has used the same operational definition for both terms (Morgan, 2006) . This survey question elicited future plans, which generally are optimistic, thereby qualifying as sufficiently idealistic for the analytic and explanatory purposes of those who wish to have a measure of aspirations. We chose to use 30 years as the age of interest in this survey question because most people have established their careers around that age. According to career development theory, becoming established in a career generally occurs between the ages of 25 and 45 (Niles & Harris-Bowlsbey, 2017) .\nResponses to STEM careers were coded as a dichotomous variable (STEM or non-STEM) based on the taxonomy of the O*NET code of occupations. More specifically, the following STEM careers were included for analysis: computer and mathematical occupations; architecture and engineering occupations; and life, physical, and social science occupations. A survey response indicating that the respondent expected or planned to have a STEM career was coded as 1, whereas a response indicating a non-STEM career aspiration was coded as 0.\nIndependent variables. Mau and Bikos (2000) identified four clusters of variables-gender and race, familial/parental, school/academic, and personal/ psychological-that significantly predicted the occupational aspirations of female and minority students. We included these four clusters of independent variables in the analyses.\nGender and race cluster. Both gender (0 = male, 1 = female) and race (0 = White, non-Hispanic; 1 = African American, Hispanic, Native American, Alaskan, or Pacific Islander) were coded as dichotomous variables. We did not include Asian Americans in this analysis because they are not considered a minority in STEM areas.\nFamilial/parental cluster. The familial/parental cluster included four variables. Parental educational expectations were measured by the survey question \"How far in school [does the] parent think his or her children will get?\" We measured student educational expectations with the question \"As things stand now, how far in school do you think you will get?\" SES was indicated by the parent's or guardian's level of education, the parent's or guardian's occupation, and family income. Finally, parental involvement was a composite variable derived from survey questions asking about activities that any family members did with the student (e.g., visited a zoo; built or fixed something, such as a vehicle or appliance; discussed a program or article about math, science, or technology). School/academic cluster. The school/academic cluster included seven variables. The last four variables were composite variables created through principalcomponents factor analyses and standardized to a mean of 0 and a standard deviation of 1 using a 4-point Likert scale (1 = strongly agree, 4 = strongly disagree). Math achievement was assessed by a 72-item, criterion-referenced measure. We also used the final grade in the ninth graders' most advanced eighth-grade science course and the final grade in the ninth graders' most advanced eighth-grade math course. School belonging was measured by five questions that asked participants about their perceptions of their school, for example, \"Do you feel safe at this school?\" and \"Do you feel proud being part of this school?\" (Cronbach's α = .72). We used four questions to assess participants' school engagement: (a) \"Do you go to class without your home-work done?\" (b) \"Do you go to class without pencil or paper?\" (c) \"Do you go to class without books?\" and (d) \"Do you go to class late?\" (Cronbach's α = .67). Math/science teacher's positive influence was a composite variable derived from six survey items: (a) \"Values/listens to students' ideas,\" (b) \"Treats every student fairly,\" (c) \"Thinks all students can be successful,\" (d) \"Thinks mistakes are okay if students learn,\" (e) \"Makes math interesting,\" and (f) \"Makes math/science easy to understand\" (Cronbach's α = .78). Finally, math/science teacher's unfair treatment was a composite variable derived from the following four survey items: (a) \"Math teacher treats males/females differently,\" (b) \"Math teacher treats some kids better than others,\" (c) \"Science teacher treats some kids better than others,\" and (d) \"Science teacher treats males/females differently\" (Cronbach's α = .68).\nPersonal/psychological cluster. The personal/psychological cluster included eight composite variables derived from principal-components factor analysis and standardized to a mean of 0 and a standard deviation of 1 using a 4-point Likert scale (1 = strongly agree, 4 = strongly disagree; Ingels et al., 2011) . Four variables pertained to math: (a) math identity, which was measured by two items (i.e., \"You see yourself as a math person\" and \"Others see me as a math person\"; Cronbach's α = .84); (b) math utility, which was assessed by three items (i.e., \"Math courses are useful for everyday life,\" \"Math courses will be useful for college,\" and \"Math courses are useful for future careers\"; Cronbach's α = .78); (c) math self-efficacy, which was assessed by four items (e.g., \"can do excellent job on math tests\"; Cronbach's α = .90); and (d) math interest, which was measured by six items (e.g., \"enjoying math course very much\"; Cronbach's α = .75). The remaining four variables pertained to science: (a) science identity, which was measured by two items (i.e., \"You see yourself as a science person\" and \"Others see me as a science person\"; Cronbach's α = .83); (b) science utility, which was assessed by three items (i.e., \"Science courses are useful for everyday life,\" \"Science courses will be useful for college,\" and \"Science courses are useful for future career\"; Cronbach's α = .75); (c) science self-efficacy, which was assessed by four items (e.g., \"can master skills in science course\"; Cronbach's α = .88); and (d) science interest, which was measured by six items (e.g., \"enjoying science course very much\"; Cronbach's α = .73)."}, {"section_title": "Data Analysis", "text": "First, we conducted bivariate analyses to compare various characteristics by ninth graders' STEM aspirations. Three separate multivariate analyses of variance (MANOVAs) were conducted to compare differences in STEM aspirations by three clusters of variables (familial/parental, school/ academic, and personal/psychological), followed by univariate analyses of variance (ANOVAs) on these variables. Second, given the dichotomous nature of the dependent variables, we conducted logistic regression analyses to examine factors predicting STEM aspirations. Guided by the CAM (Mau & Bikos, 2000) , we selected four clusters of variables and entered them in blocks using a forward stepwise procedure. Model 1, the baseline analysis model, included gender and race only, without any controls. In Model 2, we added four familial/parental variables (SES, student educational expectations, parental educational expectations, and parental involvement) to the baseline model. Next, in Model 3, we added school/ academic variables to Model 2. Finally, in Model 4, we added personal/ psychological variables to Model 3. Logistic regression analyses have several advantages over other multivariate techniques (e.g., discriminant or multiple regression analyses). Most important is that they permit violation of normality and are interpretable in terms of prob-ability (Cizek & Fitzgerald, 1999) . Based on weighted samples, the analyses were created to adjust for the oversampling bias, and the observations were redistributed to represent the distribution in the population. To do this, we used the following formula: normalized weight = [sample weight] × [sample n/population N (sum of weights)]. We also used design effects to adjust standard errors for hypothesis testing. Table 1 presents descriptive statistics and the bivariate analysis results for all of the independent variables by STEM aspiration. Of the 21,444 ninth-grade students, 2,416 aspired to STEM careers, with the remaining 19,028 students aspiring to non-STEM careers. STEM career aspirations were distributed among computer and mathematical occupations (n = 324); architecture and engineer-ing occupations (n = 986); and life, physical, and social science occupations (n = 1,106). Results of the MANOVA showed significant differences in familial/parental variables, Wilks's Λ = .97, F(4, 9907) = 66.63, p = .000, η p 2 = .03; school/ academic variables, Wilks's Λ = .95, F(8, 18252) = 131.13, p = .000, η p 2 = .05; and personal/psychological variables, Wilks's Λ = .92, F(8, 13888) = 147.66, p = .000, η p 2 = .08. Results of the subsequent univariate ANOVAs are presented in Table 1 ."}, {"section_title": "Results", "text": ""}, {"section_title": "Familial/Parental Variables", "text": "As indicated in Table 1 , students who aspired to STEM careers reported significantly higher SES and parental involvement than did students who aspired to non-STEM careers. In contrast, students aspiring to non-STEM occupations reported higher educational expectations than did those aspiring to STEM occupations. There were no significant differences in STEM aspirations as a function of parental educational expectations."}, {"section_title": "School/Academic Variables", "text": "Students who aspired to STEM careers scored significantly higher on all of the school/academic variables than did their non-STEM counterparts, except for school belonging. Specifically, STEM students scored significantly higher on math standardized tests and had higher final grades in their most advanced math and science courses than did non-STEM students. Although STEM students were more likely than non-STEM students to have greater school engagement, they were less likely than non-STEM students to have a sense of school belong-ing. In addition, more STEM students than non-STEM students agreed that their math and science teachers had a positive influence on them. Finally, more STEM students than non-STEM students reported that their math and science teachers engaged in unfair treatment toward their students.\nPersonal/Psychological Variables STEM students had significantly higher math/science self-efficacy, math/ science identity, and science utility than did their non-STEM counterparts. In contrast, non-STEM students had significantly higher math and science interests than did STEM students. "}, {"section_title": "Logistic Regression Model", "text": "We conducted logistic regression analyses (Models 1-4) to examine variables predicting STEM aspirations. The percentages of variance in STEM aspirations accounted for by the models were as follows: 40% (Model 1), 53% (Model 2), 55% (Model 3), and 56% (Model 4). Results of the logistic regression analyses are provided in Table 2 . The greater the regression weight, the more the predictor was weighted in the model. Model 1 considered only gender and race in predicting STEM aspirations. The baseline analysis model indicated that female students were significantly less likely than male students to aspire to STEM careers (β = -.58, p < .0001). In addition, minority students were significantly less likely than White students to aspire to STEM careers (β = -1.48, p < .0001). Model 2 examined familial/parental variables after controlling for gender and race. Among the familial/parental variables, SES (β = .40, p < .0001), student educational expectations (β = -.04, p < .001), parent educational expectations (β = -.15, p < .0001), and parental involvement (β = -.10, p < .0001) significantly predicted STEM aspirations. Gender and race also remained significant variables.\nModel 3 examined school/academic variables after controlling for gender, race, and familial/parental variables. Among the school/academic variables, math test (β = -.02, p < .0001), school belonging (β = .14, p < .001), math/ science teacher's positive influence (β = -.11, p < .001), and math/science teacher's unfair treatment (β = .07, p < .01) significantly predicted STEM aspirations. In addition, gender, race, SES, parental educational expectations, and parental involvement remained significant predictors, whereas student educational expectations did not.\nModel 4 examined personal/psychological variables after controlling for the variables included in the previous models. With these other variables held constant, math self-efficacy (β = .10, p < .01), math interest (β = .24, p < .0001), and sci-ence self-efficacy (β = .25, p < .0001) significantly predicted STEM aspirations. In addition, gender, race, SES, parental educational expectations, and math test remained significant predictors, whereas student educational expectations, parental involvement, school belonging, math/science teacher's positive influence, and math/science teacher's unfair treatment did not."}, {"section_title": "Discussion", "text": "This study examined female and minority high school students' STEM career aspirations as a function of four clusters of variables within the structure of the CAM (Mau & Bikos, 2000) . The CAM provided a theoretical framework for the selection of variables and design of the study. Moreover, we chose to use a national sample of students who were followed longitudinally from ninth through 11th grade. To examine the applicability of the CAM to STEM career aspirations, we simultaneously examined the four clusters of variables represented by 20 individual variables. Of the 20 variables, we selected 13 for the logistic regression analyses predicting STEM aspiration, with the final model accounting for 56% of the variance. As shown in Table 2 , these 13 variables are well represented in the four clusters of variables within the structure of the CAM, which indicates that the CAM can be used to understand the STEM career aspirations of underrepresented high school students.\nOur results support prior findings indicating that gender, race, and math/ science self-efficacy have a statistically significant effect on career aspirations (Brown, Concannon, Marx, Donaldson, & Black, 2016; Mau & Bikos, 2000; Ocumpaugh, San Pedro, Lai, Baker, & Borgen, 2016) . Moreover, our results point to the importance of familial influence in students' career aspirations. This finding is consistent with previous studies that have demonstrated that familial factors predict educational and career aspirations (Kim et al., 2015; Raque-Bogdan et al., 2013) . Given these findings, counselors in school and related contexts should consider familial influence, as well as math/science self-efficacy and interest, when helping students prepare for college and STEM career pathways. Furthermore, counselors should work closely with school teachers and administrators to develop comprehensive policies that encourage STEM career aspirations and can be advocates for traditionally underserved populations.\nUsing the CAM as a conceptual framework, we found that several important factors significantly influenced STEM career aspirations. These factors include being male or White; having a higher SES; having greater parental educational expectations; having greater math achievement; and, most important, having higher math interest and math/science self-efficacy. In line with previous studies (Howard et al., 2011; Mau, 2003; Mau & Bikos, 2000; Padilla-Carmona & Martínez-García, 2013; Riegle-Crumb, Moore, & Ramos-Wada, 2011) , gender and race were salient predictors of high school students' career aspirations and, as might be expected, remained strong predictors of STEM aspirations when all familial/parental, school/academic, and personal/psychological variables were taken into consideration. As with many prior studies (Belser, Prescod, Daire, Dagley, & Young, 2017; Fouad et al., 2010; Gnilka & Novakovic, 2017; Haynes & Jacobson, 2015; Raque-Bogdan et al., Note. Model 1 = gender and race only, without any controls; Model 2 = gender, race, and four familial/ parental variables (socioeconomic status [SES] , student educational expectations, parental educational expectations, and parental involvement); Model 3 = gender, race, the familial/parental variables, and four school/academic variables (math test, school belonging, math/science teacher's positive influence, and math/science teacher's unfair treatment); Model 4 = gender, race, the familial/parental variables, the school/academic variables, and three personal/psychological variables (math selfefficacy, math interest, and science self-efficacy). STEM = science, technology, engineering, and mathematics. *p < .01. **p < .001. ***p < .0001. Schuster & Martiny, 2017) , the female and minority students in our study experienced several barriers, such as lack of confidence, unfair treatment, discrimination, financial pressure, stereotypes, and biases, which help explain their lack of interest in STEM careers. Because female and minority students encounter many barriers in their educational and vocational pursuits, counselors working in school and other contexts should provide system-wide supports that increase female and minority academic, career, and personal/social success. Moreover, counselors should collaborate with critical stakeholders to help mitigate barriers to academic success by promoting academic achievement, self-efficacy and identity, and self-advocacy for these students.\nIt is interesting to note that student educational expectations, parent involvement, school belonging, math/science teacher's positive influence, and match/science teacher's unfair treatment were initially significant predictors of STEM aspiration. Yet, the importance of these variables diminished once other variables (e.g., math test, math/science self-efficacy) were entered into the prediction model. Another interesting finding is that students who aspired to STEM careers reported lower school belonging than did those who aspired to non-STEM careers. It is unclear why they felt this way, but future studies may provide insights into this phenomenon. Nevertheless, when school belonging was weighted against other variables in the CAM (Mau & Bikos, 2000) , its importance diminished. These findings suggest that subject-specific selfefficacy is a strong moderator of career aspirations among high school students. Our findings support previous research that highlights the function of career self-efficacy in the career decision-making process (Austin, 2010; Tang, Pang, & Newmeyer, 2008) . Therefore, the moderating role of STEM-specific self-efficacy described by SCCT (Lent et al., 1994) and the CAM was also confirmed in this study."}, {"section_title": "Limitations and Future Research", "text": "This study has several limitations. First, we used self-report measures that might be susceptible to error because of the maturity of ninth graders in knowing what occupations they are likely to enter at age 30 as well as the memory recall accuracy of activities surveyed in this study. Second, survey questions may not provide sufficient insight into specific details and extenuating circumstances affecting respondents' answers. Future researchers could use multimethod assessments that could include observations and focus group interviews targeting underrepresented populations. Third, the STEM occupations used in our study were based on the taxonomy of the O*NET code of occupations, with a focus on computer and mathematical occupations; architecture and engineering occupations; and life, physical, and social science occupations. These differences in STEM definition should be considered when interpreting and comparing our results with those of other studies. Finally, studies (e.g., Mau, 2003) have shown that the attrition rate among female or minority students who aspire to STEM careers far surpasses the attrition rate among male or White students. Further research investigating what contributes to the attrition, especially among female and minority students, is needed. Despite these limitations, our findings, which are based on a nationally representative sample, add to the understanding of STEM career aspirations. Our study also included multiple variables as guided by established theoretical frameworks and used advanced statistical methods."}, {"section_title": "Conclusion", "text": "Our findings support previous research (Mau, 2003; Mau & Bikos, 2000; Schuster & Martiny, 2017) indicating the existence of important factors influencing the STEM career aspirations of female and minority high school students. In particular, this study adds to the understanding of the roles of familial support, school influence, and career self-efficacy in the STEM career decision-making process. Our findings are consistent with SCCT (Lent et al., 1994 ) and the CAM model developed by Mau and Bikos (2000) . Despite steady improvement in enrollment and educational attainment of female and minority students in higher education, women and minorities remain underrepresented in the STEM supply pipeline. Therefore, it is important that future researchers use longitudinal designs to examine the STEM aspirations of female and racial/ethnic minority students. Such research will help provide a life-span perspective of these students' career development."}]