[{"section_title": "INTRODUCTION", "text": "Coastal regions of Alaska are affected by intense storms, the frequency and intensity of which are predicted to increase as a result of global climate change (IPCC, 2007;Pisaric et al., 2011;Vermaire et al., 2013). While storms are important for the maintenance of salt-affected coastal ecosystems through regular flooding, salinization, and sedimentation (Reed, 1989;Hopkinson et al., 2008;Bianchi and Allison, 2009;Blum and Roberts, 2009;Kirwan et al., 2010;Kokelj et al., 2012;Tweel and Turner, 2012), they can also erode shorelines, degrade freshwater and terrestrial habitats, damage village infrastructure, and lead to loss of lives (Reimnitz and Maurer, 1979;Solomon et al., 1994;Atkinson, 2005;Jorgenson and Brown, 2005;Lantuit et al., 2012). The Yukon-Kuskokwim Delta (YKD) is particularly vulnerable because its position on the eastern edge of the Bering Sea lies within a region of frequent storm tracks (Mesquita et al., 2010) and extensive low-lying coastal flats (Dupré, 1980;Jorgenson and Ely, 2001). Despite frequent storm surges in the region, there are few published summaries of the magnitude and extent of flooding on the YKD. Those that do exist consist of local observations by village residents (Fienup-Riordan, 1999 and recent shortterm records (Jorgenson et al., 2012). In western Alaska, storms consist primarily of extratropical cyclones of ocean origin that form from poleward-moving tropical systems or from strong temperature gradients between air masses (Johnson and Kowalik, 1986;Blier et al., 1997;Klein et al., 2000;Mesquita et al., 2010;Atkinson, 2012). The occurrence of Bering Sea storms has been well documented at Nome, where there is a long record of storms from news accounts since 1898 compiled by Mason et al. (1996), weather data since 1906 from the National Weather Service, and NOAA tide gauge data since 1992. Wise et al. (1981) noted that western Alaska has suffered the most storms within the state because of the long fetch of open water to the southwest and the shallow sea floor in the eastern Bering Sea. In a summary of 60 storms recorded on the Seward Peninsula between 1899 and 1993, Mason et al. (1996) determined that the storms were cyclical in nature, with 38% of all storms occurring within four short periods. Detailed accounts exist of some of the large storms, including storms in 1960, 1974, 1978, 1992, 2004, 2005, and 2011 (Fathauer, 1975;Blier et al., 1997;Larsen et al., 2008;Mesquita et al., 2009;Dau et al., 2011;Herndon, 2011). For the YKD, historical evidence of impacts of large storms comes from oral records of the indigenous Cup'ik and Yup'ik cultures in western Alaska (Fienup-Riordan 1999. These records document a history of flooding with loss of life, but little effect on human settlements, given the nomadic lifestyle of the indigenous people until the middle of the last century. Storm-induced changes in coastal ecosystems could have wide-ranging effects, especially at high latitudes, where global climate change is expected to be most severe and detectable (Chapin et al., 1995;Lynch et al., 2003;Robinson, 2004;Bianchi and Allison, 2009). The YKD is one of the largest deltaic systems in North America, and the Yukon River alone has the fifth largest hydrologic output, discharging an average of 60 million tons of sediment annually (Brabets et al., 2000). The YKD is also home to the largest subsistence-based economy in Alaska (Fienup-Riordan, 1999), and it is one of the most important breeding areas for migratory waterbirds in North America (Spencer et al., 1951;Klein, 1966;Gill and Handel, 1990). Because of the extremely low coastal gradient on the YKD, storm surge events will likely have the greatest effect on habitats along the broad transition zone from saline to nonsaline habitats (Jorgenson, 2000;Jorgenson and Ely, 2001) where bird nesting densities are the highest (USFWS, unpubl. data). The combined effects of inundation, salinization, and sedimentation from storm-driven tides, often reaching far inland, could have dramatic impacts on plant communities, permafrost stability, and landscapes used by wildlife. Little is known about the magnitude of flooding caused by storm surges on the YKD because few people inhabit areas inland from the coast, where the extent of flooding could be best monitored, and there are no permanent tide gauges to monitor storm water levels between the Alaska Peninsula and the Seward Peninsula. This data gap can be partially addressed through satellite imagery. Remote sensing imagery, including Landsat (Bianchette et al., 2009), MODIS (NASA, 2012;Brakenridge et al., 2013) and SAR (Pope et al., 1997;Kiage et al., 2005), has been used to document water extent, either directly, or indirectly by mapping flood-altered vegetation. Documentation of the current extent of coastal flooding is especially important given estimated sea-level rise in the next century of 20 to 60 cm (IPPC, 2007), to as much as 1 m (Rahmstorf, 2007). Specific objectives of the study were to (1) compile physical information on the large storms in the Bering Sea region during the last century that are most relevant to the YKD; (2) map the extent of storm surges from Radarsat-1 and MODIS imagery for storms where remote sensing data were available; (3) compile water-level data for storms; and (4) map drift lines (the high point of material deposited by ocean waters) as indicators for flooding extent."}, {"section_title": "STUDY AREA", "text": "The study focuses on storm information at two scales: the broader Bering Sea region for storm and climatic information, and the smaller central YKD region for quantifying flooding extent. The 6730 km 2 flooding study area on the outer YKD extends between the Askinuk Mountains (61˚ 47ʹ 17ʺ N) on the northern edge of Kokechik Bay and Nelson Island (60˚ 53ʹ 28ʺ N) at the mouth of Baird Inlet, approximately 100 km to the south (Fig. 1). The eastern edge of the study area was delineated by a straight N-S line (164˚ 29ʹ 31ʺ W) to assure the study area encompassed the main areas used by nesting waterfowl and the local villages of Hooper Bay, Chevak, and Newtok (Fig. 1). The area is dominated by wet and moist tundra, pockmarked with innumerable small ponds and lakes, and laced with tidally influenced meandering rivers and sloughs (Tande and Jennings, 1986;Kincheloe and Stehn, 1991;Babcock and Ely, 1994;Jorgenson, 2000). Low-lying, salt-affected areas are dominated by early successional graminoid meadows. Inland areas are underlain with discontinuous permafrost and dominated by dwarf birch and lichen scrub, with elevations ranging from 2.8 m to 3.6 m above mean sea level. Climate and tidal records for the region are sparse. At Bethel, the closest long-term climate station (215 km southeast), mean monthly temperatures (1911 -2011) range from −14.1˚C in January to 13.3˚C in July. Annual precipitation averages 41.1 cm, including an average snowfall of 157.0 cm (1981 -2010). Nearby tidal records are limited to Kokechik Bay (1982 -84) and Anguvriak Bay (2008 -12). To provide a better historical perspective, we include information for Nome, situated on the southern coast of the Seward Peninsula in the northern Bering Sea, because it has a long climatic record (since 1900) and a permanent tide gauge (since 1992)."}, {"section_title": "METHODS", "text": ""}, {"section_title": "Characteristics of Regional Storms", "text": "We compiled information about the largest storms in the Bering Sea region over the last century and the largest storm in the central YKD for each year over the past two decades. Sources included a comprehensive storm listing for the Bering region (Wise et al., 1981) and Nome (Mason et al., 1996), storm modeling for large storms since 1950 (Chapman et al., 2009), case histories for individual large storms (Mesquita et al., 2009;Dau et al., 2011), storm reports (NCDC, 2014a) and ocean analysis weather charts (http://nomads.ncdc.noaa.gov/ncep/NCEP) from the National Climatic Data Center, and other newspaper and unofficial accounts. Data on individual storms included minimum central surface barometric pressure, maximum winds at Nome and Bethel (NCDC, 2014b), wind direction, maximum surge heights at Nome and Hooper Bay as modeled by Chapman et al. (2009), and maximum water levels in meters above mean sea level (m amsl) at Nome (records 1992 -94, 1998 -2012) from the NOAA tide gauge (http:// tidesandcurrents.noaa.gov/)."}, {"section_title": "Flood Mapping", "text": "We mapped the areal extent of three floods from available satellite imagery (Radarsat-1 for floods in 2005 and 2006 and MODIS for the flood in 2011). We used Radarsat-1 SAR imagery archived (1996 -2008) at the University of Alaska Fairbanks to detect storm surge boundaries because of its unique characteristic of cloud penetration and the relatively high frequency of overpasses (Kiage et al., 2005). We searched the archives of images of the study area for times of known flooding events, as determined from observations of field personnel, published reports (e.g., Mesquita et al., 2009), and available weather data at Hooper Bay and Chevak (http://www.arh.noaa.gov). Radarsat-1 images of flooding were obtained for 23 September 2005 and 29 October 2006. We obtained a MODIS image from 9 November 2011 shortly after peak flooding (http://lance-modis.eosdis.nasa. gov). The mostly cloud-free image had a 250 m resolution. Flooding extent was visually interpreted from the images on the basis of spectral characteristics and pattern recognition. For the SAR images, flooded areas were dark gray to black, in contrast to the light gray and whiter areas that were not flooded. During interpretation, we referred to a high-quality Radarsat-1 image of the area during normal tides (26 July 2005) to help differentiate the spectral characteristics and patterns of non-flooded areas. For the MODIS image, the extent of flooding was evident in the sharp color contrast between the brown flooded areas and the white unmelted snow. In areas with clouds, the flood boundary was interpolated between cloud-free areas to complete the flooded region. The initial delineation was then reviewed on a Landsat Geocover (MDA Federal, 2004) base map, and small adjustments were made to align the boundaries with margins of upland areas using ArcGIS software (ESRI, Redlands, California). \nVisual image interpretation of flood distribution from Radarsat-1 and MODIS imagery indicates that the 2005, 2006, and 2011 storms covered 3166 km 2 (47.1%), 2187 km 2 (32.5%), and 2652 km 2 (39.4%), respectively, of the land (including lakes and rivers) in the 6730 km 2 YKD study area (Fig. 3). The maximum inland extent of the flooding, as measured by the shortest straight-line distance from the outer coastline (mudflat-vegetation transition) to the inland floodwater margin, was 30.3 km in 2005, 27.4 km in 2006, and 32.3 km in 2011. Most of the flooding in 2011, when the ground was covered with snow, was within 15 km of the coast, with the more distal flooding associated with large river channels. The accuracy of flood mapping was limited by poor spectral resolution and clouds in the 2005 and 2011 imagery; thus, the mapping provided only a coarse delineation of flood boundaries. Numerous small permafrost plateaus with elevations of 2.8−3.5 m were included within the flooded area, but probably were not flooded. The 2006 Radarsat-1 image provided higher resolution and contrast for flood mapping, and many of the small patches of higher terrain were mapped as not flooded. An additional constraint for the 2005 and 2006 Radarsat-1 images was that the time of image capture may not have coincided with the maximum storm surge. The mapping of maximum extent using MODIS was not limited by timing of the surge, however, because of the persistence of the sediment-stained snow on the image taken soon after the flooding."}, {"section_title": "Water Levels", "text": "Tidal information was compiled from the NOAA tide gauge at Nome for 1992 and 1998 -2012, from a network of crest gauges during 1994 -98 (Jorgenson and Ely, 2001), and from water-level recorders at the Tutakoke River mouth for 2007 -12. Maximum water levels (m amsl) for the Tutakoke River area were obtained from occasional monitoring in the area with crest gauges, digital water-level recorders (Hobo U20 water-level data logger, Onset Corp.), and field surveys of drift lines. All observations were made relative to a control-point network established with Differential Global Positioning System (DGPS) surveys of drift lines. The crest gauges consisted of a cork with bristles that moved up with water level inside a PVC pipe to record annual peak stage. Crest gauges were measured once each year at mid-summer during 1995 -98, and we assumed that the peak stage occurred the previous fall. We used data from the network of crest gauges near Tutakoke (Jorgenson and Ely, 2001). Linear regression was used to estimate water level at the coast (Tide Gauge 2, or TG2) for each year on the basis of crest gauge elevations and distance from the coast. Watersurface slope of the annual regressions averaged 0.05 m/km for the network that extended 5.6 km inland. Tide gauges using Hobo Water Level Loggers (U20-001) were installed at Tide Gauge 1 (TG1) in 2007 (at 0.30 m amsl, 61˚14ʹ 43ʺ N, 165˚37ʹ 08ʺ W) and at TG2 in 2009 (at −1.40 m amsl, 61˚14ʹ 36ʺ N, 165˚38ʹ 33ʺ W). Water levels were recorded every 30 minutes. We estimate that at that interval, actual peak stages could be as much as 10 cm different from the recorded peak stage. Median water depths (1.40 m) were calculated for TG2 and used to estimate the elevation of the sensor and mean sea level. For analysis of water-level frequencies from the tide gauges, we used the maximum value from either station as the maximum daily water level for each date. Elevation of drift lines associated with the 1974 and 2005 storms was surveyed in 2007 and tied into the control point network to provide approximate elevations of maximum surge levels. Given errors in DGPS surveys of the control-point network, physical stability and calibration drift of the water-level recorders, and drift line variability, we estimate the vertical accuracy of the measurements to be mostly within 10 cm, with a maximum error of 20 cm. We report data to decimeter precision to be consistent with the accuracy of the data. All elevations reported hereafter in meters (m) correspond to meters above mean sea level (m amsl).\nThe frequency of tidal inundation and storm flooding was summarized from the intermittent record collected from two tide gauges (TG1 and TG2) at the mouth of the Tutakoke River from 21 July 2007 to 26 June 2012 (Fig. 4). The mean daily maximum water level (normal higher high water) was 1.2 m (Fig. 5). The mean monthly maximum water level was 1.8 m (n = 51). The mean annual maximum water level was 2.5 m (n = 6), and the median was 2.3 m. Assuming that the tidal range is equally distributed around mean sea level (our gauges did not adequately record low water levels), the mean daily tidal range was 2.4 m and the mean monthly maximum tidal range was 3.6 m. Storm flooding with water overbank occurred almost every year. Flat vegetated meadows occur on overbank environments at elevations of 1.8 to 2.1 m (Jorgenson and Ely, 2001), and we assigned 2.1 m as the typical elevation at which floodwater goes overbank over broad areas.  (Fig. 4). Crest gauges recorded overbank flooding during 1994 -97 with maximum elevations of 2.6 m ( Table 1). Over the period of observation, overbank flooding occurred 14 times during 10 years. If we combine tide and crest gauge data, mean annual maximum water level was 2.4 m. Overbank flooding (cumulative frequencies > 2.1 m) occurred 0.77% of the time (once in 130 days, 2.8 times per year) and flooding higher than 2.5 m occurred 0.08% of the time (once in 1300 days, 3.6 years) recorded over 1300 days within a five-year period. But these overbank frequencies are skewed slightly upward because the sensors were usually inoperable during the coldest months, presumably when storm surges were lower and less frequent because of sea ice, and because of the short record. Duration of flooding was relatively short because of the large amplitude of the tidal cycles. In 2010, overbank flooding at the Tutakoke River site persisted for three hours when it reached an elevation of 2.4 m. In 2011, overbank flooding from the 8 -9 November storm persisted for approximately 14 hrs after reaching an elevation of 3.3 m at 0:30 am November 9 (Fig. 6), assuming that inland floodwater Maximum water levels at the Nome gauging station were recorded in 2004 and 2005 (2.9 m), but water levels during the storms in 1992 (2.5 m) and 2011 (2.7 m) also indicated extreme events (Table 1). The water levels were did not totally recede when water levels at the coast were slightly below bank level for a few hours. To evaluate the frequency of larger storms over a broader region we compared tide gauge data at Nome and Tutakoke. highly correlated (R 2 = 0.90, n = 8, p < 0.001) between Tutakoke and Nome. Water levels were higher at Tutakoke for a given storm event (with smaller differences at higher elevations) because of the larger tidal range at Tutakoke and differences in coastal topography (Fig. 7). Maximum wind speeds at Nome and Bethel (Table 1) southwest of Tutakoke were weakly correlated (R 2 = 0.33, n = 29), indicating that storms have large regional effects but that individual storm tracks are an important factor in determining distal wind speeds and flooding. Peak water elevations for the 1974 and 2005 storms were estimated from elevation surveys of drift lines near the upper Kashunuk and Tutakoke Rivers (Fig. 8). The highest surge elevation was attributed to the 1974 storm because the weathered and lichen-covered driftwood appeared consistent with that age. Large old driftwood logs (> 10 cm diameter) were found around the margins of the elevated permafrost plateaus, while small driftwood (< 10 cm diameter) was uncommonly found toward the centers of the plateaus. The drifted debris associated with the 2005 storm was primarily composed of sedges and grasses that were found along the rims of the plateaus, but not on the higher centers (Fig. 8). This lighter, more buoyant material provided a more reliable estimate of maximum surge level than large, dense pieces of driftwood. The mean elevation for the highest three pieces of the 1974 driftwood was 2.97 m (± 0.05 SD) at the upper Tutakoke T4 transect. Because only small driftwood was found on the top of the plateaus, while large driftwood was stranded along the margins, we estimated that to carry the small wood across the plateaus while stranding the larger logs along the margins, water levels must have been 0.2 m higher than the observed drift lines, for an estimated water-surface elevation of 3.2 m. The mean elevation of the three highest points of the 2005 wrack line was 2.83 m (± 0.17 SD) at upper Tutakoke (T4), 2.82 m (± 0.05 SD) at upper Kashunuk (K1), and 2.89 m (± 0.05 SD) along the Manokinak (M2 site). From these data, we estimate the water surface at the coast at the Tutakoke River mouth was 3.5 m for 1974 and 3.1 m for 2005. While we attribute the driftwood to the 1974 storm, we are not certain that it was not associated with the 1978 storm. Surveys of vegetation impacts after the 1974 and 1978 storms by Dau et al. (2011) found that the 1978 storm affected more area with mud and debris."}, {"section_title": "Drift Line Mapping", "text": "Driftwood (large woody debris) transported onto the tundra by past large storm events was readily evident on high-resolution IKONOS images (1 m pan-sharpened), which were obtained for the area in 2007 and 2008. The images were visually examined over the entire study area, and driftwood deposits were mapped as small polygons in ArcGIS. Elevations for the driftwood patches were obtained from a digital elevation model (DEM) strip that crosses the study area. The DEM strip, derived from light detection and ranging (LiDAR) data, was acquired by Airborne Imaging (2011) and adjusted to the local tide gauge data (Macander et al., 2012) (Fig. 1). Drift lines associated with the large 1974 and 2005 storms were surveyed in the upper Tutakoke (T4) and upper Kashunuk (K1) areas in 2009."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Regional Storms", "text": "Information was compiled for 39 storms, of which 17 were large regional storms documented for Nome over the last century and 22 were major and minor storms that occurred since 1992, when a tide gauge was installed at Nome (Table 1). These storms include some of the 89 storms in the Bering region identified by Wise et al. (1981) for the period 1898−1980, the 60 storms at Nome cataloged by Mason et al. (1996) for 1899−1993, and the 52 storms listed by Chapman et al. (2009) for western Alaska for 1954−2004. Our list also includes the largest storm each year for the recent period of instrumentation (1992 to 2012). Most storms during which coastal flooding has been documented have occurred during the fall, with 74% of the storms we list occurring in October or November. The strongest storms with high surge levels had minimum central surface pressures below 965 mb, and the 1966, 1974, 1996, 2004, 2009, and 2011 storms had pressures of 950 mb or lower. However, even more moderate storms could be intense enough to affect terrestrial habitats, for example, the Bering Sea storm in late October 2006 (982 mb; see below). The largest storms affecting the YKD include those of 1931, 1960, 1974, 2004, 2005, and 2011 (Table 1). The 1931 storm caused the worst flooding in the YKD, as remembered by elders in the 1990s, and resulted in the starvation of villagers at Old Chevak and Qissunaq (Fienup-Riordan, 1999). The 1960 storm had very strong winds (30.8 m/s) recorded in Nome and caused more than $100 000 of road erosion damage, while in Unalakleet it was reported to be the worst storm ever witnessed in 55 years (NCDC, 2014a, storm data report October 1960). The lowlands of the YKD were reported to be completely covered by water (Fienup-Riordan, 1999). The 1974 storm tied for the strongest winds recorded in Nome, and damage costs in the surrounding communities totaled $250 000 in Unalakleet, $100 000 in Teller, $35 000 (associated with erosion of the airport road and warehouse damage) in Hooper Bay, and $18 000 in Nome (NOAA storm data November 1974, Wise et al., 1981). The 2004 storm caused $20 million in damages throughout the region, affecting numerous coastal and inland settlements (NOAA storm data October 2004). The 2005 storm caused extensive damage at numerous villages and washed over lower roads at Scammon Bay. Finally, the 2011 storm had the lowest central pressure recorded (944 mb) in the eastern Bering Sea, caused tens of millions of dollars in damages, and was considered to be the strongest storm to affect the region since 1974 (NOAA storm data November 2011). Damage costs have climbed rapidly in recent years because of increased infrastructure and better damage assessment. Tracks of two major storms (23 Sep 2005 and 8 -9 Nov 2011, Table 1) and one minor storm (29 Oct 2006) for which we had satellite imagery show the storms moving up from the southwest through the middle of the Bering Strait (Fig. 2). As a result, prevailing winds on the YKD were from the south-southwest. The minimum central pressure was much lower for the September 2005 and November 2011 storms (with 962 and 944 mb lows, respectively) than for the October 2006 storm (982 mb low). The three storms were all very large in extent, affecting nearly the entire Bering Sea region."}, {"section_title": "Drift Line Mapping and Elevations", "text": "Drift lines, predominantly composed of large fragments (up to 40 cm in diameter) of large, weathered and barkless tree trunks, were abundant throughout most of the study area and were readily detectable on IKONOS imagery (Figs. 9 and 10). Drift lines most commonly occurred along the margins of the permafrost plateaus, although large individual logs were present across the active and inactive floodplains, especially logs that had extended lateral roots, which effectively anchored them and prevented them from drifting farther inland. Many of the driftwood deposits occurred in clusters along the outer coast, where they were associated with small permafrost plateaus. Driftwood was frequently found up to 25 km from the coast, and clusters of driftwood were uncommonly found 26−32 km from the coast up the Kashunuk River. The most distant driftwood detected occurred up the Kashunuk River at 36.8 km straight-line distance from the nearest coastal margin. Large stringers of driftwood frequently occurred along the margins of permafrost plateaus (Fig. 10). Twenty seven percent of the driftwood deposits occurred beyond the inland margins of the 2005 flood, most of it within 3 km of the 2005 flood boundary. The farthest driftwood location was 10.1 km beyond the 2005 flood boundary and 2.6 km from the upper Kashunuk River. (1995 -2012)."}, {"section_title": "FIG. 7. Comparison of peak water levels at Nome and Tutakoke River", "text": "FIG. 8. Views of drift lines associated with (left): the 2005 storm (note grass windrowed against plateau edge) and (right): the 1974 storm (note weathered driftwood). The drift deposits commonly occur around the margins of the permafrost plateaus, which typically are 1 to 1.5 m higher than the adjacent floodplain. Driftwood was found at elevations from 1.5 to 3.2 m along the narrow DEM strip (Fig. 11). Most driftwood occurred at elevations above 2.2 m, indicating that it was stranded along the margins of permafrost plateaus, which typically ranged from 2.8 to 3.3 m. A minor amount of driftwood was found at elevations of 1.8 -2.2 m, which typically supports flat saline and brackish meadows."}, {"section_title": "DISCUSSION", "text": "Long-term weather records and storm observations indicate that storms large enough to inundate and thus threaten coastal areas have occurred regularly on the YKD over the past century. Its low coastal gradient and flat landscape make the outer YKD highly susceptible to coastal flooding from these storms. Our analysis of Radarsat-1 and MODIS imagery of flooding events in 2005, 2006, and 2011 revealed that large storms can cause flooding of landscapes 27 -32 km from the coast. Estimates of flooding extent based on drift line mapping indicate that very large storms (100-year return period) inundate coastal wetlands up to 37 km inland. The largest storms could lead to longterm changes in landscape due to erosion and salinization, the effects of which could be exacerbated if climate change leads to an increase in the frequency and magnitude of storm surge events."}, {"section_title": "Flooding Magnitude and Frequency", "text": "Large storm surges that reach elevations greater than 3.0 m amsl, as indicated by tide gauges, drift line observations, or modeling of offshore conditions, have occurred at least three times during the last 50 years (in 1974, 2005, and 2011). Our data, as well as historical records, indicate the 2011 storm was the largest since 1974, which was probably the largest storm of the century in the region. Surge modeling for Hooper Bay offshore by Chapman et al. (2009) indicates that the 1974 storm (3.1 m) was the largest event that has occurred, but estimated the 2004 (2.6 m) storm as the second-largest event. Stage-frequency analyses by Chapman et al. (2009) calculated the water levels for the 50-year and 100-year return periods for their offshore modeling nodes at Hooper Bay to be 3.04 m and 3.51 m, respectively. Their frequency analyses and our water-level estimate of 3.5 m at Tutakoke indicate that the 1974 flood was close to a 100-year event, although Chapman et al. (2009) estimated it to have a ~50-year return period. The 2005 (next highest drift line just below the 1974 drift line, 3.1 m) and 2011 floods (3.3 m) were closer to 50-year events. At Nome, the 1974 storm had a modeled water level of 2.86 m, similar to the 2.87 m that Chapman et al. (2009) estimated for 50-year events. The discrepancy between our interpretations of the flood frequency of the 1974 event and that of Chapman et al. (2009) could be due to their model inputs and algorithms, nearshore bathymetric and tidal channel effects, and limits in accuracy of our data. Lack of long-term data prevented a more rigorous analysis of flood frequencies for large events. While we consider the 1974 storm to be the largest recorded event (especially for the Nome area), Fienup-Riordan (1999) reported that residents at Chevak remember the 1931 flood as the worst that they had experienced. Smaller storms that cause minor overbank flooding for several hours or less have occurred almost yearly on the YKD and thus regularly affect the lower-lying brackish and slightly brackish wet meadows. Most of the storms occur late in the year, after the plant-growing season and bird nesting. Brackish fringe wet sedge meadow, which has a mean elevation of 1.6 m (Jorgenson and Ely, 2001) and a median monthly maximum water level of 1.8 m, floods on a monthly basis."}, {"section_title": "Comparison with Other Arctic Regions", "text": "Storm-induced flooding appears to be more frequent on the YKD than across the coastal plain of Arctic Alaska and Canada, as evidenced by studies near Barrow (Reimnitz and Maurer, 1979), on the Colville River Delta (Jorgenson et al., 1997) and on the Mackenzie River Delta (Pisaric et al., 2011;Vermaire et al., 2013). Coastal tundra landscapes of the YKD are likely inundated more regularly than other high-latitude areas because of the longer ice-free periods of the Bering Sea, the greater tidal range on the eastern shore of the Bering Sea (2 -3 m on the YKD compared to < 0.5 m on the Beaufort Sea coast), and the low elevational gradients. Flood duration is also affected by the greater tidal range: small floods last only a few hours because water levels drop below the bank during low tide, but during larger storms, wind-driven surges can persist through several tidal cycles, as was evident in 2011."}, {"section_title": "Flooding Extent", "text": "The flat terrain associated with coastal deltas makes them particularly vulnerable to storm flooding. The far inland extent of flooding that we documented for the YKD is similar to what has been documented on the Mackenzie Delta, where a large storm in 1999 affected vegetation up to 30 km inland from the delta front (Thienpont et al., 2012). On the Colville Delta, salt-killed tundra affected by the 1970 storm was found up to 10 km inland (Jorgenson et al., 1997). The 2005 and 2011 floods on the YKD extended inland as far as 32 km, while driftwood indicates that floodwater from older, larger storms (e.g., 1974) extended inland as far as 37 km. The inland extent of flooding from storms is limited by the short duration of the overbank tidal surge (14 hours for the 2011 flood), the elevation of water at the coast, the slope of the water surface, and the velocity of the surge. For the 2011 storm, most of the flooding occurred within 15 km of the coast. This is somewhat less than our calculation of potential inland flood extent of 24 km for the 2011 storm, which was based on the average surface water slope of 0.05 m/km observed by Jorgenson and Ely (2001) and a height of water overbank of 1.2 m (1.2/0.05 m per km = 24 km). Snow can potentially affect the extent of storm surges by cooling water and increasing its viscosity, elevating the surface of the ground, and increasing flow resistance across the surface, but little is known about snow effects. While the effects of snow on storm flooding are unknown, we attribute the smaller extent of the 2011 flood, given the 3.3 m peak water-surface elevation at the coast, to the surface friction and water cooling associated with the snow (and ice) that could be seen on the MODIS image. Snow generally starts to accumulate by October and is widespread by November. It is difficult to predict the extent of flooding from weather parameters alone. Storm impacts are largely a function of wind speed and direction, which are dictated in part by the magnitude of the pressure gradient and distance of the eye of the storm from the area of impact. However the lower minimum pressure in the 2005 and 2011 storms and the steepness of the pressure gradient where the storms intercepted the outer YKD (Fig. 2)."}, {"section_title": "Impacts", "text": "Frequent small storms and rare large storms can have both beneficial and negative consequences on deltaic ecosystems, wildlife, and local residents. Frequent sedimentation is essential to maintaining the surface elevations and productivity of delta wetlands (Jorgenson and Ely, 2001;Blum and Roberts, 2009). Heavy sedimentation, however, can be detrimental, and we have observed elimination of Carex subspathaceae in saline fringe wet graminoid meadows that were buried by 5 -10 cm of sediment from the 2005 storm. Mats of mud can also be brought in by floating ice and bury large patches of meadow vegetation, as we observed for the 2011 storm. Salinization from inland penetration of storm surges can affect water quality and damage non-saline wetlands. We observed numerous isolated incidences of salt-killed tundra along the margins of the permafrost plateaus and on slightly brackish inland meadows caused by the 2005 storm. Melting along the margins of these plateaus led to the formation of thermokarst \"moats.\" Extensive patches of salt-killed tundra have been persistent since the 1970 storm on the Colville Delta (Jorgenson et al., 1997) and since the 1999 storm on the Mackenzie Delta (Kokelj et al., 2012). The lack of salt-killed vegetation on top of the permafrost plateaus indicates that this terrain is rarely flooded. Wildlife can be severely affected by storm surges depending on the timing of the flooding events in relation to the seasonal life cycle of the species (Dau et al., 2011). Flooding impacts on the YKD are most evident for migratory birds, as the YKD harbors one of the greatest concentrations of nesting waterbirds in North America (Spencer et al., 1951;Gill and Handel, 1990), the majority of which nest near the coast (Platte and Stehn, 2012). Fortunately, the majority of severe storms occur in late autumn, by which time most migratory birds have flown south to their wintering areas, although spring and mid-summer flooding events do occur and can negatively affect nesting birds (Hansen, 1961;Dau et al., 2011). It is probable that the greatest impact on local avifauna is due to the long-term effects of habitat alteration by autumn storms. Non-avian species are also likely negatively affected by large storm surge events. Some non-migratory species, such as microtine rodents, are greatly affected by extensive and persistent flooding, and consequently do not reach the great abundances characteristic of less frequently inundated regions such as Alaska's Arctic coastal plain. Finally, salinization and sedimentation of freshwater wetlands are likely to have impacts on local and migratory populations of fish. Native villages on the YKD have been seriously affected by past storms, and settlements are continuing to adapt to flooding threats, often at great cost. The YKD is home to 25 000 people, 85% of whom are Yup'ik or Cup'ik natives, and seven villages along the YKD coast are imminently threatened by flooding and coastal erosion (GAO, 2009). Within our study area, the old village of Uyivenqegglic, at the mouth of the Kashunuk River (Fig 1.), was historically occupied by more than 100 people in the 1890s, but was later abandoned because of periodic flooding (Fienup-Riordan, 1999;Mikow, 2010). Chevak elders recall villagers seeking shelter in the Old Chevak church during the 1931 flood. Because of the flooding and other factors, the villagers eventually settled upriver at Old Chevak, and later they moved to the current site of Chevak on the Ningitqvak River."}, {"section_title": "Response to a Changing Climate", "text": "The coast of the YKD may witness additional storm surges and impacts from these events if changes in weather patterns due to global climate change lead to an increase in the frequency and intensity of storms (IPCC, 2007;Pisaric et al., 2011;Vermaire et al., 2013). A warming climate could also magnify the impact of Bering Sea storms by limiting the formation of shorefast and sea ice. Sea ice formation can impede coastal flooding as evident from the lack of large storm surges after sea ice has formed in the eastern Bering Sea. Sea ice is absent in the central Bering Sea during October, but typically forms a narrow shelf along the coast by November and is continuous across the mid-Bering Sea north of Nunivak Island by December (http:// nsidc.org/data). Sea ice is effective at dampening the effects of winds on storm surges, and a delay in formation of sea ice until later in autumn could result in increased fetch over open water and an increase in coastal flooding (Jones et al., 2009). Sea ice can also affect sediment delivery because thick sediment layers deposited on nearshore ice can be rafted inland. Sea level rise associated with climate warming would also increase the frequency of overbank flooding. For intermediate scenarios of climate change (RCP4.5), global sea level rise is projected to be 0.3 -0.6 m by 2100, with rates in the Bering Sea possibly slightly lower than the global average (Church et al., 2013). For a projected sea level increase of 0.5 m, which is within this broader range, mean maximum monthly sea levels would increase from 1.8 m to 2.3 m and cause overbank flooding on a monthly basis. While higher sedimentation rates on the outer delta will allow some ecosystem types to keep up with sea-level rise, sedimentation on slightly brackish wet meadows farther inland will be affected by this increased flooding. The increased frequency of flooding will likely affect nesting birds. Similarly, a 0.5 m increase above the current median annual maximum flooding (~2.4 m) would cause the permafrost plateaus with lowland moist low scrub (mean elevation 2.8 m) to be flooded on an annual basis, although thawing permafrost is likely to reduce elevations of this terrain before that happens."}, {"section_title": "SUMMARY", "text": "The extent of inland flooding due to storm surge events on the central YKD was determined for the first time using Radarsat-1 and MODIS imagery acquired during the time of fall storms in 2005, 2006, and 2011. Flood mapping and monitoring of water levels in this study indicate that small storms cause overbank flooding of coastal meadows on an annual basis on the outer YKD and large storms periodically cause flooding 27 -32 km inland from the tidal flat margins. Drift line mapping indicates that the maximum extent of historical flooding was 37 km inland. Field surveys of driftwood attributed to a large storm in 1974 were used to estimate its peak stage at the coast as 3.5 m, an elevation estimated to have a ~100-year return interval at Hooper Bay. Peak water levels at the coast were estimated to be 3.1 and 3.3 m for the 2005 and 2011 storms, respectively, which correspond to ~50-year events. Extensive storm-induced flooding occurs mostly during the fall before sea ice has formed. Global warming is likely to delay formation of sea ice to later in the year and raise sea levels, thus increasing the likelihood of storm flooding during early winter and the frequency of overbank flooding. While coastal ecosystems are dependent on frequent sedimentation and salinization from small floods, larger storm floods can cause salinization of freshwater ponds and nonsaline meadows, damage vegetation along the margins of permafrost plateaus and cause thermokarst, and affect village infrastructure."}]