[{"section_title": "Abstract", "text": "The development of disease-modifying therapies for Alzheimer's disease is an urgent public health emergency. Recent failures have highlighted the significant challenges faced by drugdevelopment programs. Longitudinal cohort studies are ideal for promoting understanding of this multifactorial, slowly progressive disease. In this section of the special edition, we review several important lessons from longitudinal cohort studies which should be considered in diseasemodifying therapy development. In the final section, we introduce the clinical cohort of the Center for Neurodegeneration and Translational Neuroscience. This newly established longitudinal study aims to provide new insights into the neuroimaging and biological marker (biomarkers) correlates of cognitive decline in early Alzheimer's disease and Parkinson's disease (PD)."}, {"section_title": "Introduction", "text": "Affecting more than 45 million people worldwide, Alzheimer's disease (AD) is the most common neurodegenerative disease of the central nervous system. The morbidity, mortality, and costs associated with caring for those afflicted by this disease have been well established [1] . With estimates predicting a tripling in prevalence rates by 2050, the search to find disease-modifying therapies (DMTs) has become an urgent global health emergency. Longitudinal cohort studies have been an important source of information regarding the complex chain of events that occur in AD. The insights gleaned from these studies have been used to inform a new generation of increasingly sophisticated clinical trials that have permitted testing of candidate agents earlier in the disease course [2] . Despite significant advances in our understanding of disease, it has been more than 14 years since the last symptomatic agent was approved, and no agent has ever demonstrated disease-modifying effects in clinical trials. The recent spate of high-profile failures [3] has highlighted the challenges for DMT development and thrown into question some of the most fundamental assumptions about AD therapeutics [4] .\nAs part of this special issue introducing the newly established Center for Neurodegeneration and Translational Neuroscience (CNTN), we present five learnings from longitudinal cohort studies and briefly discuss their application in clinical trials. In the final section, we introduce the clinical core of the CNTN. The clinical core of CNTN is a newly established longitudinal cohort study that integrates lessons learned from other cohort studies and brings several new contributions to the field. The following are some among these contributions: (1) an \"ADNI approach\" to studying cognition in Parkinson's disease (PD); (2) an expanded battery of cognitive testing to better elucidate executive dysfunction in mild cognitive impairment (MCI); (3) positron emission tomography (PET) imaging of microglial activation in the AD and PD disease continuum; and (4) a multimodal recruitment and retention strategy focused on minority recruitment."}, {"section_title": "Longitudinal cohort studies in AD research", "text": "Randomized controlled trials (RCTs), which attempt to limit bias and confounding through balanced randomization of carefully selected cohorts, have long been considered the \"gold standard\" for medical evidence [5] . Any DMT will only be approved based on the results of a well-conducted RCT [2] . The application of RCTs to a slowly progressive disease such as AD is challenging and typically requires enrolling thousands of participants (across hundreds of clinical trial sites) to achieve the requisite statistical power. The degree of complexity required for running large, complicated RCTs has led to a skyrocketing of expenses, and it is now estimated to cost more than $5 billion to bring a DMT to market [6] . It is, therefore, critical that RCTs be informed with a robust knowledge of disease progression and pathogenesis.\nLongitudinal cohort studies in AD represent an important resource of information for designing clinical trials. The questions addressed in longitudinal cohort studies of individuals with AD (or at high risk for developing disease) are often different from those of RCTs (regarding, for example, disease trajectory, biomarker evolution, and populationbased outcomes) but are no less important. When collected over large periods of time, cohort studies can detect outcomes that appear slowly or inconsistently. These outcomes may not be detected in more narrowly focused clinical trials. Cohort studies, which are often not subject to the same rigorous balanced randomization requirements of RCTs, may also include a wider diversity of participants, more reflective of \"typical\" rather than \"ideal\" patient populations [7] . Over the past 3 decades, longitudinal cohort studies have provided key insights into the biological markers (biomarkers), risk factors (environmental and genetic), epidemiology, and disease trajectory of AD.\nThe Alzheimer's Disease Neuroimaging Initiative (ADNI) serves as a model for conducting longitudinal cohort studies in AD. Launched in 2005, ADNI is a multicenter, longitudinal observational study of cognitive normal elderly, MCI, and early AD [8] . An important contribution of ADNI is its approach to data integrity. Using a study protocol that emphasizes standardized data collection across all clinical sites, ADNI is conducted like a clinical trial but has no intervention. Rigorous adherence to a study protocol improves the reproducibility of data [9] . Now in its third iteration and having expanded to sites all over the world, the ADNI dataset represents a rich repository of multimodal imaging, AD biomarkers, genetics, neuropathology, and neuropsychological testing that is freely and openly shared with collaborators through the ADNI website.\nIn the following sections, we highlight several lessons learned from both ADNI and other longitudinal cohort studies of AD and consider their impact on DMT development.\n2.1. Even at the most experienced academic medical centers, misdiagnosis rates for AD consistently exceed 20%. Eligibility for DMT clinical trials should be confirmed by diagnostic biomarkers Neuropathology has long been considered the \"gold standard\" for the diagnosis of AD. The National Alzheimer's Coordinating Center includes a large neuropathology dataset that allows for examination of clinicopathological correlates [10] . An important lesson from the National Alzheimer's Coordinating Center is the significant number of participants who present phenotypically with AD but lack amyloidosis. These individuals are described as having suspected nonAlzheimer pathology (SNAP) [11] . Individuals with SNAP are unlikely to respond to antiamyloid therapies [12] . Looking at a sample of 919 demented subjects, Beach et al. [13] found that a clinical diagnosis of \"possible\" or \"probable\" AD was 71% to 87% sensitive and 44% to 71% specific for AD. The authors, furthermore, estimated that the positive predictive value of a clinical diagnosis of AD was 83% (for moderate plaque load, Braak stage III or IV). Although 80% hit rate may appear reasonable, in the context of a clinical trial, this level of misdiagnosis is problematic (again, assuming a poor response rate in non-AD individuals). For example, applied to a trial with a 50% response rate, a 20% misdiagnosis rate would effectively reduce the response rate by 10% [13] . To achieve the same statistical power, recruitment to the trial would need to be doubled. Studies examining misdiagnosis rates in clinical trials have reported even higher numbers, particularly when applied to populations earlier in the AD continuum [14] . These findings are highly supportive that clinical trial populations be enriched by AD diagnostic biomarkers. A recent examination of the AD drug-development pipeline, however, revealed that less than half of phase II and III DMTs used diagnostic biomarkers as entry criteria [15] ."}, {"section_title": "Variability in clinical progression is common in AD,", "text": "particularly early in the disease continuum. To detect drugplacebo treatment differences, multimodal stratification strategies should be incorporated into the trial design so as to increase the likelihood that participants will progress during the course of the trial AD is now conceptualized as a clinicobiological entity progressing seamlessly from an asymptomatic high-risk state to MCI and finally ending in dementia. A growing consensus suggests that DMTs must be introduced at a time point when the pathological processes can still be overcome. Testing therapeutics in participants with minimal (or no) symptoms represents a significant paradigm shift for the field. For the trials to be successful, studies need to be designed to detect significant drug-placebo differences. This requires the selection of participants with a high likelihood of progression during the study. Clinical progression in AD, however, is variable, particularly early in the disease course. Based on clinically diagnosed samples, individuals with MCI progress to dementia at a rate of 10% to 25% per year [16] . A relatively large percentage of these individuals will never convert, and some will even revert back to having normal cognition [17] . Study designers respond to this problem by increasing the trial's statistical power. This means that some clinical trials are expected to enroll thousands of participants over extended periods of time. As a result, new AD studies may now exceed 7 years in length.\nPredictive modeling provides a potential alternative solution to this problem. ADNI was specifically designed to validate biomarkers for clinical trials and has driven much of the research on predicting disease trajectory. As no single biomarker or cognitive assessment has demonstrated clear efficacy, investigators have increasingly turned toward multimodal classifiers to inform predictive models. In cognitively normal subjects, combinations of cerebrospinal fluid biomarkers (with cutoff points , 220 pg/ mL; Ab, 42; and .61 pg/mL of total tau and 21 pg/mL of phosphorylated tau) predicted cognitive decline and progression to MCI within 3 years [18] . In MCI populations, many predictive models have been developed. An interesting model developed by Barnes et al. was a relatively simple point-based tool used to predict conversion from MCI to AD, incorporating the following elements: (1) the Functional Assessment Questionnaire (2-3 points); (2) magnetic resonance imaging of hippocampal subcortical volume (1 point) and middle temporal lobe thinning (1 point); (3) ADAS-Cog (2-3 points); and (4) the Clock Drawing Test (1 point), the 3-year conversion rate of individuals with a score of 7 to 9 points was 91% [19] . Given the costs associated with recruiting thousands of participants across hundreds of clinical trial sites, it is important that clinical trials begin to integrate predictive models into their designs. [20] [21] [22] . Other MCI clusters include language impaired, visuospatial impaired, and executive dysfunction. An important cluster appears to be those with executive dysfunction (about 1/3 of individuals). This executive dysfunction cluster may represent a valuable population for clinical trials as individuals with both executive dysfunction and elevated levels of cerebrospinal fluid phosphorylated tau exhibit an extremely fast rate of progression from MCI to AD [23] . With the current slate of clinical trials needing more than 20,000 MCI participants to complete recruitment, these cluster analyses from ADNI support the need for a reexamination of clinical trial inclusion guidelines to include more extensive neuropsychological measures, in particular, tests that probe impairments beyond memory functioning [15] ."}, {"section_title": "Executive dysfunction is an important", "text": "2.4. AD is a multifactorial neurodegenerative disease likely caused by numerous related and parallel biochemical pathways in addition to amyloid plaque and neurofibrillary tangle formation. There is a need to better understand these additional factors involved in disease pathogenesis Mixed pathologies are common at autopsy in patients diagnosed with AD in the National Alzheimer's Coordinating Center [24] . Common co-occurring pathologies include microinfarcts, white matter lesions, Lewy bodies, and other protein aggregates such as TDP-43 and argyrophillic grains [25] . ADNI includes a group of participants with SNAP-biomarker evidence of neuronal damage without amyloidosis. Because a notable percentage of individuals with plaques and tangles do not manifest dementia, it is possible that the mere presence of amyloid plaques and neurofibrillary tangles alone is not sufficient enough to cause cognitive dysfunction [26] . New research indicates that other metabolic and neuronal processes also play a role. Multiple lines of evidence-increased levels of inflammatory cytokines in AD brains [27] , rings of activated microglial cells surrounding amyloid plaques [28] , and increased levels of the inflammatory marker YKL40 in the cerebrospinal fluid of AD individuals [29] -point to a key role for neuroinflammation in AD pathogenesis. Given the recent failures of several multibillion-dollar trials testing amyloid-lowering agents, it is imperative that a more integrated understanding of the full diversity of processes involved in AD pathogenesis be integrated and considered when developing DMTs. In this same vein, DMT drug development must also be open to the idea that multiple drug targets may need to be engaged to have a meaningful impact on disease progression. The recent development of clinical trials testing combination therapies should be embraced as an important trend in AD drug development [30] ."}, {"section_title": "Clinical trial populations do not accurately represent the diversity of people affected by AD. Clinical trials need to do more to engage underrepresented patient groups", "text": "Longitudinal cohort studies have been key in informing an understanding of the epidemiology of AD. Although the highest incidence rates are seen in North America and Western Europe (10.5 per 1000) [31] -age continues to be the most important risk factor-AD is experienced in all regions of the world. Longitudinal cohort studies have also reported that certain racial and ethnic groups (AfricanAmericans and Hispanics) living in the United States may experience an increased risk for AD compared with both Caucasians and their racial and ethnic counterparts living in their native regions [32] . Despite strong evidence of prevalence across racial and ethnic lines, AD clinical research and clinical trials have traditionally been composed almost entirely of college-educated, Caucasian populations [33] . Low diversity in research studies reduces the generalizability of findings. Barriers to participation in clinical trials for underrepresented patient groups include mistrust of the medical establishment, language, logistical challenges, and lack of cultural sensitivity in recruitment materials [34, 35] . To ensure that the findings of clinical trials are broadly generalizable, minority recruitment efforts need to be emphasized, and study designs need to accommodate underrepresented patient group."}, {"section_title": "The clinical core of the CNTN", "text": "The CNTN is a newly established biomedical collaboration between the Cleveland Clinic Lou Ruvo Center for Brain Health [36] and the University of Nevada, Las Vegas (UNLV). The CNTN is funded by the NIH/NIGMS through a Center for Biomedical Research Excellence (COBRE) grant. Modeled on two successful federal AD programs-ADNI and the Alzheimer's Disease Coordinating Centers (ADCs)-the clinical core of the CNTN collects longitudinal data on a trial-like cohort of more than 170 research participants with AD, PD, and a cognitively normal control group. Demographic data for the CNTN cohort are presented in Table 1 . Similar to ADNI, data collection is standardized through the use of clinical trial-like protocol. The primary focus of the CNTN is to better understand the functional connectivity, neurocognitive correlates, and genetic correlates of cognitive decline in early AD and PD and to develop multimodal predictive models for cognitive decline in both the diseases. As a result, cognitive function is emphasized in participant selection. The AD group consists of participants with MCI and mild-to-moderate AD dementia, whereas the PD group includes participants with normal cognition and MCI (PD-MCI) [37] . Participant eligibility is determined during a screening visit. To ensure performance above floor levels, participants are required to achieve a score of 15 or greater on the Montreal Cognitive Assessment at baseline. After completion of the initial assessments, a panel of clinicians assigns a diagnosis based on the established criteria [38] [39] [40] ."}, {"section_title": "Assessments", "text": "Assessments for the CNTN are completed annually and include the following: (1) a structural and functional magnetic resonance imaging; (2) neuropsychological battery; and (3) standardized clinical visit. AD, MCI, and normal controls undergo amyloid PET at baseline. Amyloid PET identifies which participants are on the AD disease continuum and which participants have SNAP. All participants have extensive genetic analysis (genotyping, targeted gene arrays, and whole exome sequencing). Notably, PD participants are scanned before their morning dose of carbidopa/ levodopa (in the practically defined OFF state) and one hour after their first dose of the day (practically defined ON state). This allows for exploration of the neuroanatomical networks underlying cognitive decline in PD as well as permitting the effects of dopaminergic therapy on these networks [41] .\nThe neuropsychological test battery is central to the CNTN. A unique feature of the neuropsychological battery is that it integrates ADNI assessments-allowing for direct comparisons with the ADNI dataset-but also expanding the ADNI approach to participants with PD. This will allow for direct comparisons of cognitive decline in these two related neurodegenerative diseases [42] . The CNTN also expands on the ADNI neuropsychological test battery by including several additional neuropsychological measures of executive function (Table 2 ). This expanded investigation into executive functioning will allow for interrogation of cognitive decline particularly relevant to PD and increasingly recognized as an antecedent to cognitive decline in MCI."}, {"section_title": "Inflammation", "text": "Another aim of the CNTN is to more fully elucidate the role of inflammation in neurodegenerative disease. There have been relatively few investigations into the correlations between inflammation and cognitive symptoms in AD or PD. The CNTN's contribution to this area of study will be to probe the relationship between inflammation and neurocognitive testing by using PET ligands related to microglial activation (GE-180). It is hypothesized that differences between amyloid-positive and amyloid-negative participants will provide crucial information about the role of inflammation in cognitive symptomatology.\nTo improve the generalizability of research findings from the CNTN, recruitment to the CNTN will attempt to match the racial and ethnic composition of the state of Nevada (Table 3) . To achieve this goal, the CNTN has developed a comprehensive, multipronged recruitment strategy. A successful element of the recruitment strategy includes the development of a Community Outreach Committee. Consisting of a diverse mix of community leaders from traditionally underrepresented patient groups, this committee meets regularly to shape and guide recruitment efforts. Another novel recruitment strategy is the use of Healthybrains.org [43] . Healthybrains is an interactive, Web-based brain health and clinical trial registry that allows individuals to take active steps in their brain health and learn about clinical trial opportunities. It is free to use and has registered more than 15,000 participants. More than 15% of referrals to the CNTN come from HealthyBrains. Through the first 3 years of its existence, retention to the clinical core remains high (95%). Retention strategies include an annual newsletter to participants and an optional \"annual results visit\" with the study PI. During the results visit, participants are able to learn the results of selected assessments."}, {"section_title": "Data sharing", "text": "Data sharing is key to the CNTN's mission. All CNTN data are entered into the study database (OpenClinica) and made available to collaborators through the CNTN website, www.nevadacntn.org. To facilitate the greatest amount of collaboration, data will be provided at several levels of complexity. For example, the database will include a repository of postprocessed imaging data (volumetrics using FreeSurfer) that will permit rapid analysis of more basic questions, whereas the raw images will be made available for investigator seeking to perform complex imaging analyses on the original data."}, {"section_title": "Conclusion", "text": "Longitudinal cohort studies have been invaluable tools in increasing our understanding of the pathophysiologic changes that underlie this devastating disease. Lessons learned from cohort studies will need to be incorporated into DMT programs if much-needed new therapies are to be brought to the market. Discussed are five lessons learned from cohort studies that we feel are important to DMT development. Finally, a recently launched cohort study-the clinical core of the CNTN-is introduced. The CNTN integrates lessons learned from other cohort studies and brings several new contributions to understand early cognitive decline in AD and PD."}, {"section_title": "Acknowledgments", "text": "This work was supported in part by a Center of Biomedical and Research Excellence (COBRE) grant (reference number: 1P20GM109025-01A1). The funding source had no role in the study design, collection, or interpretation of the data."}, {"section_title": "RESEARCH IN CONTEXT", "text": "1. Systematic review: Alzheimer's disease (AD) presents variably and progresses slowly. There have been few successes in randomized controlled trials, particularly in trials of disease-modifying agents.\nInsights from longitudinal cohort studies are informing a new generation of sophisticated clinical trials. We review the findings from several important longitudinal studies of AD and their application to new drug development.\n2. Interpretation: Clinical trials need to require diagnostic biomarkers for screening; stratification strategies should be incorporated into clinical trial design; neuropsychological screening for mild cognitive impairment should be expanded; the biological understanding of AD should be expanded beyond amyloid plaques and tau; and clinical trials need to do more to engage underrepresented patient groups.\n3. Future directions: We introduce a newly launched longitudinal cohort study, the Center for Neurodegeneration and Translational Neuroscience. By studying AD and Parkinson's disease concurrently, the Center for Neurodegeneration and Translational Neuroscience represents a novel approach to the study of these two important neurodegenerative diseases."}]