[{"section_title": "", "text": "and the theme of effective and responsible scientific communication is among them.\nThe expansion of the outbreak has demanded a rapid response from public health authorities; fundamental epidemiological and scientific evidence has been acquired at break-neck speed to support those decisions. The demanding pace and large volume of COVID19 science generated in the last three months, however, has made timely scientific communication through the conventional route of published biomedical journals at best challenging, and at worst obsolete. Twitter has an estimated global user network of 330 million monthly users, including an extensive network of scientists and epidemiologists who frequently use this media for scientific exchange [4, 5] . We propose that Twitter has played a fundamental -but often precarious -role in permitting real-time global communication between scientists during the COVID19 epidemic, on a scale not seen before.\nHere, we discuss three key facets to Twitter-enabled scientific exchange during public health emergencies, including some major draw-backs. This discussion also serves as a succinct primer on some of the pivotal epidemiological analyses (and their communication) during the early phases of the COVID19 outbreak, as seen through the lens of a Twitter-feed. We do not cover the other major roles of Twitter and other social media during this epidemic, including transmission of rapid situational awareness reports, advisories, and public education from formal public health agencies and normative bodies [6, 7] . Similarly, concerns of malignant misinformation about COVID19 deliberately spread through this medium are beyond the scope of this commentary [8] .\nM a n u s c r i p t"}, {"section_title": "Outbreak genomics in the age of Twitter", "text": "Twitter accelerated the rapid, global dissemination of the first whole genome sequence of SARS-CoV-2 from a consortium led by Fudan University, Shanghai, to the global science community approximately 10 days after the first alerts of the SARS-CoV-2 outbreak [9]. This sequence data permitted development of a PCR diagnostic assay, the protocol of which was disseminated mere days later through Twitter [10]. Between Jan 11-18, the first genomic analyses of viral genomes sequenced from Chinese cases, and then initial Thailand cases, were posted in real-time to Twitter "}, {"section_title": "Open-source epidemiology: early COVID19 line listing and epidemic parameter estimation through social media", "text": "As with other outbreaks, early estimation of epidemic parameters during the first month of the COVID19 epidemic has been critical to predict the epidemic trajectory and inform decision-making. A c c e p t e d M a n u s c r i p t"}, {"section_title": "Snakes and ladders: the opportunities and challenges of Twitter in scientific conduct and communication during public health emergencies", "text": "As highlighted in an early 2020 Nature Microbiology editorial, global scientists openly reprimanded a group who published a genomic SARS-CoV-2 analysis through Twitter but failed to properly acknowledge the source of this molecular data [37] . Such open critique through this medium helps enable codes of conduct around epidemic sequence data sharing [38] . Real-time rebuttal, coupled with supporting pre-print analyses, led to fast rejection of an invalid scientific conclusion that snakes were a probable animal reservoir for SARS-CoV-2, a claim that had led to widespread misinformation [39, 40] . Similarly, prompt corrections over journalist misinterpretations of supposed pangolin origins to the SARS-CoV2 outbreak has been valuable.\nIn this way, Twitter has facilitated vital counter-narratives from the scientific community during these and other instances of controversial scientific communication, be they claims of the zoonotic origins of SARS-CoV2, alarmist interpretation of upper-end 0 estimates, or confusion on whether particular public health policies were grounded on goals of 'herd immunity'. Twitter has and continues to serve as a valuable medium to discuss the caveats and future directions in applying infectious disease models in COVID19 decision-making [41] [42] [43] [44] . Still, Twitter remains the doubleedged sword of rapid scientific communication during the ongoing COVID19 pandemic. As advocated on Twitter itself, scientists will need to exercise great care in their communication using this and other social media to share their research as this outbreak unfolds throughout 2020 [45] ."}]