[{"section_title": "Introduction", "text": "Since the mid-1950s, scientists have raised concerns about the use of medically important antibiotics in animal production (Burbee, Green, and Matsumoto, 1985). While antibiotic treatments can improve the health of livestock and promote growth, these scientists noted that frequent use of antibiotics could introduce selection pressures for antibiotic resistance among pathogenic bacteria. Drug-resistant bacteria could then spread to other animals or humans, inflicting substantial costs on the human health care system and livestock producers everywhere. In contrast, only 32% of cattle production uses either a production or marketing contract in 2017 (Burn and MacDonald, 2018). Beef production has several important features that make the use of antibiotics more likely. As cattle mature, they may be shipped between facilities prior to slaughter. On average, cattle travel 339 miles to arrive at a feedlot, and 55.3% of cattle are shipped across state lines (APHIS, 2011). The shipping process introduces risks because new animals may carry infectious diseases or become stressed. Animals that endure prolonged periods of stress are more vulnerable to infection. The longevity of beef cattle also increases the likelihood that they will experience bacterial infections and require the administration of medically important antibiotics. Consumer preferences for antibiotic-free products have changed animal product labels. Demand for antibiotic free animal products has motivated many producers to change their production systems from conventional to antibiotic free. Examples from outside of beef production include Perdue and Tysons, which are either drastically reducing antibiotic use or producing antibiotic free chicken (Drovers, 2015). Smithfield-the largest pork producer in the U.S-also launched an antibiotic free pork line (Rousseau, 2017). While the unique features of the beef industry introduce challenges in reducing or eliminating the use of antibiotics, recent consumer reports indicate that advancements have been made to satisfy consumer demand (U.S."}, {"section_title": "PIRG, 2019).", "text": "An initial examination of the data indicates differences between those farmers and ranchers that use at least one VFD and those that do not. Among producers reporting VFD use, fees charged by veterinarians for providing a VFD differ by an operation's type. At the median, veterinarians charge cow-calf operators about 28% more for a VFD than reported by either backgrounders or feedlot operators. We also found that VFD operations on average have more head of cattle and received higher sale prices for all cattle, but that non-VFD operators reported receiving more per head. These findings suggest that the implementation of new FDA policies on antibiotics did impose measurable compliance costs on producers, and that these costs were unequally distributed across the beef industry. The results of the logistic regression indicate that the VFD usage does differ by the average age of operators and the characteristics of the operations they manage. VFD usage is positively correlated with the price of a VFD, which could reflect a higher willingness to pay for the VFD due to unobservable characteristics. We found that the presence of a previously existing relationship with a veterinarian and that more debt leverage on farms were significant factors in determining whether an operation established a new relationship with a veterinarian in response to FDA policies implemented in 2017. Our paper adds a national perspective to the existing literature on the effects of recent FDA policies on livestock production. Previous research by Ekakoro et al. (2019), examined the perception of the VFD policies amongst Tennessee cattle producers. The study found Tennessee cattle producers were either not familiar or slightly familiar with the VFD guidelines. Schulz and Rademacher (2017) conducted a survey of practicing veterinarians to examine veterinarians and their own outreach to producers as well as the potential costs and continued education for the anticipated policies changes."}, {"section_title": "Policy background", "text": "Since the 1980's, the FDA has adopted policies that promote the judicious use of medically important antibiotics in both companion animals and livestock. In 2012, policy makers began releasing Guidance for Industry (GFI) documents that detailed best practices for livestock producers. GFI #209, entitled \"The Judicious Use of Medically Important Antimicrobial Drugs in Food-Producing Animals,\" was published in April 2012. As the title suggests, GFI #209 included policies for reducing the use of antibiotic drugs that are important to human medicine. These policies required oversight from licensed veterinarians for all therapeutic uses of medically important antibiotic drugs, and additional oversight for prophylactic or metaphylactic use of antibiotics in feed or water. To use antibiotics in feed or water, a VFD is required. This requirement is intended to reduce selection pressures for antibiotic resistance among pathogens and places a regulatory compliance cost on producers who choose to use antibiotics in feed (FDA, 2013). GFI #209 also discouraged the use of antibiotics for growth promotion and feed efficiency. The policies defined within GFI #209 were revised in 2015 under 21 Code of Federal Regulations (CFR) part 558. Under this revision, VFD drugs were no longer exclusively categorized as Category II drugs. Category II drugs require a withdrawal period to allow the drug to break down and be eliminated from an animal's system 3 . Instead, each VFD drug is categorized on a case-by-case basis as a Category II or Category I, which do not require a withdrawal period. Each drug is categorized based on whether the drug will produce an unsafe residue in edible products from the treated animal. The FDA subsequently established Guidance for Industry #213 (GFI #213), which was implemented as of January 1, 2017. GFI #213 required producers to obtain a VFD when using medically important antibiotics in medicated feed and phases out the use of antibiotics for growth promotion and feed efficiency (FDA, 2017). Under the new guidance, farmers and ranchers are required to have an established and ongoing relationship with a consulting veterinarian and complete a veterinarian-client-patient-relationship (VCPR) agreement. All VFD drugs are to be issued by the veterinarian within the context of the VCPR. Out of the 292 new drug applications affected by GFI #213, 84 drugs have been permanently withdrawn from the industry. The remaining 208 applications are broken into two groups. The first group includes drugs for oral dosage for products to be administered via water. The second group includes drugs used in feed but that were once deemed over the counter and now require a prescription (FDA, 2020). As of September 2018, the FDA's Center of Veterinary Medicine (CVM) has issued a next step to continue ensuring judicious use of medically important antimicrobials. They have developed a five-year plan that evaluates new and currently approved antibiotics products for animals based on their risks to human health. This is a collaborative process of key stakeholders to supports stewardship of antimicrobial products by veterinarians. Data collection on antibiotic use and resistance will also help measure the effect of federal guidelines on resistance. Preliminary evidence suggests that the implementation of GFI #213 has had similar impacts on different animal producer types. Michigan State University collected survey responses from farmers in 48 states, representing beef, dairy, sheep, goat, swine, poultry and other minor species. All animal producers shared similar economic impacts from the new VFD guidelines. Producers reported paying more in veterinarian fees associated with treatment of the herd, which increased the per unit cost of production. Some producers have reported paying higher veterinary fees and shipping costs as a result to the implementation of GFI #213 (Ferry, 2019). Another study by Sneeringer et al. (2020) found that producers reported some increases in cost due to the new policies, but the costs were generally small. A related study found that although the new policies led to a drastic drop in sales of antibiotic for food producing animals, potential from increased costs and prohibition of certain antibiotics, there were no major impacts on meat production (Sneeringer, Bowman, and Clancy, 2019)."}, {"section_title": "Data", "text": "This paper uses a subset of data from the Agricultural Resource Management Survey (ARMS, 2019). The ARMS has been administered annually by the National Agricultural Statistics Service (NASS) and the Economic Research Service (ERS) since 1996 and represents the USDA's most comprehensive source of information on the economic wellbeing of American farms and ranchers. Every ten years a supplementary survey is used to over-sample cattle and calve producers, who receive a different survey instrument with an expanded list of questions. This richer dataset provides a enough observations to allow for measurement of the economic wellbeing and management practice on cattle and calve operations alone. The 2018 cattle and calves ARMS is the most recent version of this data (USDA, ERS, 2020). Within this survey, questions were introduced concerning the effects of Guidance #213 and producers' uptake of veterinary services. A typical ARMS sample has over 15,000 farms; however, this paper only focuses on 2,022 calving operations from the 2018 calving survey included in the data. Due to missing observations for important variables, this study includes a sample size of 1,953. 4 The summary statistics reported below include sample weights that reflect an observation's probability of selection as well as what part of the sample population it represents. Probability weights are constructed to prepare population estimates from the survey results (ERS, 2019). To describe important forms of heterogeneity within cattle production, operations are broken into three different categories based on the life stage of their cattle. Median values of key features of each category are summarized in Table 1. Due to the skewed nature of the data, Table   1  Backgrounder operations represent the largest group with 31% of operators having a veterinarian visit to provide at least one VFD, but they also had the largest share of farmers obtaining a VFD. Calving operators are the smallest share with only 14% of farmers or ranches to have a veterinarian visit to provide at least one VFD. At the median, veterinarians wrote backgrounders and calving operators only one VFD in 2018, while the median feedlot operation had two VFDs written. An interesting statistic is the costs associated with a veterinarian visit for the sole purpose of providing a VFD for your beef cattle or for the reasons associated with changes in FDA policies as they apply to the beef cattle herd. The costs associated with the veterinarian visiting, due to changes caused by the new FDA regulations varies greatly by operation type. The median cost to calving operations is $200, which is 33% more than backgrounder pay and 100% more than feedlot operations. Only 13% of male principal operators used VFDs in 2018, and even fewer female principal operators, less than 1%, used VFDs. Also, most producers who use VFDs are in the age range of 50 to 69 years old, but many producers are in the same age range. Producers using VFDs have a high school degree at 40%, and 3% have some college or associate degrees."}, {"section_title": "Estimation approach", "text": "We estimate the relationship between producer characteristics and changes in the veterinary services they used in 2018. We first identify the probability of acquiring at least one VFD conditioned on producer characteristics. Second, we estimate the probability of establishing a new relationship with a veterinarian in response to the FDA policies imposed in January 2017. A logit model is used in both cases to evaluate conditional probabilities. A comprehensive model is estimated, then the best set of covariates is determined using an elastic net and cross validation (CV) approach. The first estimates represent the conditional probability of obtaining one or more VFDs in 2018. We allow this probability to depend on the size of the operation as measured by the number of head of cattle, , the costs of obtaining a VFD, the distance the veterinarian needed to travel, , and the demographic characteristics of the herd manager(s). The total number of decision makers within an operation, , the average age of managers, , the proportion of female decision makers, , and whether the respondents were non-white, , were included as independent variables. Whether the operation had an existing VFD, , a vector of dummies capturing the production type, , the value of the farm, , the revenues generated by the farm, , total debt owed by the operation, , and primary operator's years of education, , are also included. We then define = [ , , , , , , , , , , , , ] as the matrix of independent variables and as the vector of coefficients. We use the standard formulation for a logit function, where indicates whether the operation used a VFD for the disease prevention, control, or treatment: (1) Pr( = 1| ; ) = 1 1 + exp (− ′ ) . Our approach to estimating the probability of establishing a new relationship with a veterinarian as a result of changes to FDA policy follows the specification shown in Equation 1. We initially include the same covariates as described above. However, only 74 respondents (<5%) indicated that they changed their production practices as a result of the changes to federal guidelines, indicating that coefficient estimates may be less precise. The small proportion of candidates in certain groups leads us to think carefully about which independent variables to include. Only those covariates that add substantial information to the estimation process should be included in our preferred specification. While we initially consider more comprehensive specifications, we use an elastic net to impose a penalty on the use of additional parameters and CV methods to determine model performance out of sample, which together select the model that best balances goodness of fit with parsimony."}, {"section_title": "Results and discussion", "text": "The initial results presented are generated using a comprehensive model of the probability of either obtaining a VFD or establishing a new relationship with a veterinarian in response to the FDA policies implemented on January 1 st , 2017. The next set of results presented represent simpler models that are selected based on an optimal model selection approach. Table 3 presents the results of our comprehensive logistic regression for both outcome variables. The top block of results refers to operator characteristics; the second block contains characteristics of the operation; and the third block contains costs associated with obtaining a VFD. Notes: standard deviations are reported within parentheses; *** < 0.01, ** < 0.05, * < 0.10. The probability of obtaining a VFD is well correlated with several characteristics. In the second column of Table 3, the coefficient estimates associated with the fee charged for VFD, the average age of the operators, whether there was an existing relationship with a veterinarian, dummy variables for operation type, and debt values are statistically significant. Farm value is significant only at the 0.1 level. Surprisingly, the probability of obtaining a VFD is increasing with the cost of the VFD. Because the price of a VFD is determined by the market for veterinarian services, this counterintuitive result could reflect operator's greater willingness to pay for VFDs. Among the coefficients on the demographic variables, only the average age of the managers is statistically significant. The probability of obtaining a VFD decreases with the average age of the managers. Backgrounding producers-the omitted production category-are more likely than the other groups, all else equal, to obtain a VFD. Obtaining a VFD is 14% less likely among calving operations and feedlots 5% less likely among feedlot operations. Higher debt and revenues also increase this probability. The per dollar magnitude of these effects is very small, and the effect is non-linear. Unsurprisingly, having an existing relationship with a veterinarian substantially increases the probability of obtaining a VFD. An operation with an existing relationship with a veterinarian is 29% more likely to acquire a VFD. Our model includes the size of the herd, indicating that the correlation between having an existing relationship with a veterinarian and obtaining a VFD reflects differences in producer attitudes toward veterinary care, disease prevalence, or one or more other unobserved characteristics. A similar approach is used to evaluate the covariates of the probability of establishing a new relationship with a veterinarian as a result of the changes in FDA policy. The small number of operations that made this transition makes it difficult to identify covariates. Only the having a previous relationship with a veterinarian and the level of debt were statistically significant. The magnitude of and inference we apply to the parameter estimates is similar to the probability of obtaining a VFD. The strong correlation between having an existing relationship with a veterinarian and establishing one in response to FDA policies is surprising. Having an existing relationship with a veterinarian was associated with a 5% higher probability of adjusting production practices in response to changes in FDA policy. This result may indicate that operations established relationships with different veterinarians. The small subset of producers who did establish new relationships and the poor model fit (pseudo 2 = 0.0442) do leave the estimates vulnerable to mistakes made during the survey process. The results of the comprehensive model indicate that several of the candidate dependent variables are contributing little information to estimation. We therefore compare subsets of to determine which leads to the best model performance. Employing an elastic net and CV approach indicates that VFD fees, distance traveled by veterinarians, the total number of operators, the average age of operators, having an existing relationship with a veterinarian, the production type, farm value, and debt generate the best model of the probability of obtaining a VFD that balances model fit with parsimony. Only having an existing relationship with a veterinarian and operation debt are included in the model of the probability of establishing a new relationship with a veterinarian following the implementation of FDA policies. Notes: standard deviations are reported within parentheses; *** < 0.01, ** < 0.05, * < 0.10. While the estimates generated do not differ substantially from those generated using the comprehensive model, we are able to improve the precision of the statistically significant coefficients."}, {"section_title": "Conclusion", "text": "The relationship between livestock producers and veterinarians is evolving to comply with FDA guidance in GFI #209 and #213, which targets the enhancement of human health and consumer preference. While reductions in antibiotic use over time are attributable to both factors, Sneeringer, Bowman, and Clancy (2019) show that the recent implementation of GFI #213 has resulted in a rapid decline of medically important antibiotics in livestock production. We find that VFD practices differ substantially by operation and operator characteristics. Limited data make it difficult to determine characteristics that determine which factors influence the establishment of a new relationship with a veterinarian in response to FDA policies. Both the summary statistics and the estimates derived from the logistic regressions indicate that the share of producers that obtain a VFD differs substantially by producer type. Counterintuitively, our results also indicate that the fee charged for a VFD increases the probability of obtaining a VFD, which may indicate that certain producers have a higher willingness to pay for VFDs. Whether the operators have an existing relationship with the veterinarian is strongly correlated with obtaining at least one VFD. Older producers obtain fewer VFDs, while those with higher revenues and costs obtain more. Debt and an existing relationship with a veterinarian increase the probability of establishing a new relationship with a veterinarian. The finding that those with an existing relationship are more likely to establish a new relationship with a veterinarian is surprising, but may be attributed to a small subset of respondents (69) who both had an existing a relationship and established a new relationship, whereas only 5 respondents did not have an existing relationship and established a new relationship."}]