[{"section_title": "Abstract", "text": "Background: Limited research has focused on correlates of injection drug"}, {"section_title": "", "text": "in rural areas, particularly in Appalachia. The prevalence of lifetime IDU among drug users in Appalachia has been estimated as high as 75%-78% among drug users recruited from the community 2 and from rural jails. 6 A majority of rural Appalachian drug users have indicated that injection is the primary and preferred method of using drugs. 6 Specific to women, the prevalence of injecting among drug users has been reported to be significantly higher among rural Appalachian women compared to urban women (38% vs 10%). 7 With high prevalence of drug injection in rural Appalachia among women, it is important to understand the potential correlates of IDU which have been less examined in the literature. Compared to noninjectors, rural Appalachian injectors are more likely to report anxiety and depression, more lifetime drug use, and health issues like Hepatitis B and C. 1 However, other factors associated with initiating injection practices and sustaining injection behavior among women have received limited attention. Based on theoretical assumptions that relationships are critical factors in women's initiation, maintenance, and relapse to drug use, [8] [9] [10] family and partner relationships may also be critical factors in women's initiation and sustainability of injection practices. This study explores relationships, as well as health factors, that may be associated with drug injection."}, {"section_title": "Women Injectors", "text": "Gender research highlights the unique vulnerabilities of women who use drugs. While gender studies in general typically report that males engage in higher rates of drug use than females, 11 these findings are not consistent for prescription opioids among rural Appalachians. 7 Opioid use and abuse may be exacerbated among women because in general, they are more likely to seek health services and have health problems with associated chronic pain than men, which may increase the likelihood of using prescribed opioids. 12 Thus, opioid use and abuse may pose unique risks for women.\nResearch has shown significantly higher rates of opioid injection among women (36.1%) compared to men (20.1%). 13 Globally, male injectors outnumber women 4 to 1, and women are often overlooked in targeted prevention and intervention programs associated with IDU risk.\n14 However, women appear to be at increased risk due to a shorter time span between drug use initiation and initiating injection, suggesting a faster trajectory to IDU compared to men. 15 This is concerning since there are unique health-related risks associated with injection practices among women. Women are more likely to engage in IDU in high-risk sites including the jugular vein compared to men. 16 Women also self-report more injection-related injuries and disease, including higher rates of abscesses, thrombosis, and septicemia, as well as increased mental health issues, sexually transmitted diseases, and victimization associated with physical and sexual violence. 14, 17 Other research has shown a higher prevalence of women testing positive for HCV than men. 18 Women are exposed to numerous unique contextual and relational factors found to enhance IDU risks and exacerbate health-related consequences. Specifically, women injectors are more likely than male injectors to report having an IDU sex partner, being injected the first time by a sex partner, and engaging in sexual intercourse before or after IDU. 15, [19] [20] [21] [22] The relationship context can also facilitate women's injection practices through male partners' desire to control IDU-initiated women's access to and use of drugs, 23 as well as being a way for drugusing couples to sustain a longer, more intense high with fewer economic resources. 24 Women injectors also engage in higher rates of high-risk injection sharing practices, particularly drug preparation equipment, 19, 22, 25, 26 and they frequently report social persuasion or social influence as motivators for IDU with a sexual partner or a peer group. 22 Considering these high-risk injecting practices among women, it is important to better understand these relational and contextual factors associated with sustaining and ceasing injection careers, especially among rural Appalachian women. Studies focused on rural Appalachia have identified a unique sense of \"home\" associated with the area, as well as strong bonds within kinship networks. 27 Thus, the association between relationships and high-risk behaviors may be unique among individuals from rural Appalachia. Based on other studies which have applied theoretical assumptions to associate women's initiation, maintenance, and relapse to drug use with their relationships, 8, 10 it is anticipated that injection careers would also be strongly influenced by relational factors. This is the first study to examine these relational and contextual factors among rural Appalachian women."}, {"section_title": "The Current Study", "text": "Despite growing trends in IDU and related health consequences in rural Appalachia, there has been a limited focus on unique high-risk groups who may be at increased health risk from IDU, including women. Studies of rural Appalachian women drug users are challenging because recruitment can be limited by the lack of formal treatment opportunities, travel distances to study sites, and the generally protective nature of rural social networks. Thus, local rural jails provide important venues for screening and recruitment of high-risk women drug users from Appalachia. 6 Jails are different from prisons because individuals typically stay for a shorter period of time and often have limited access to health and behavioral health services, despite jails housing a high volume of drug users. 28 The present study examines correlates of IDU among rural Appalachian women who were randomly selected from local regional jails. The study specifically examines: (1) differences between injectors and noninjectors, and (2) the unique correlates of recent IDU and past IDU among rural Appalachian women."}, {"section_title": "Methods", "text": ""}, {"section_title": "Participants", "text": "During the study recruitment phase, 900 incarcerated rural Appalachian women were randomly selected from 3 jails. Of the 900 women randomly selected, 688 participated in the study screening sessions, and 440 (64%) met study eligibility criteria. However, despite screening for projected release dates, 40 women were released from jail prior to being scheduled for the baseline interview. The final study sample (N = 400) participated in face-to-face interviews prior to jail release."}, {"section_title": "Procedure", "text": "Targeted recruitment dates were randomly selected each month at each of the 3 jails (1 day per jail per month). The 3 targeted jails were selected for study recruitment based on their location in rural Appalachian counties as defined by Beale codes (also called Rural-Urban Continuum Codes) ranging from 5 to 9, 30 the daily census of female inmates in each facility, and their willingness to serve as a study data collection site. Over the course of 32 months (from December 2012 to August 2015), jail rosters were reviewed by the research team to determine the number of women on site on each of the randomly selected days. All women residing in each jail on each recruitment day who had a projected time frame for release between 2 weeks and 3 months (as verified by jail records) had an equal opportunity of being selected for study screening. This targeted time frame for recruitment was selected in order to maximize the opportunity for follow-up in the community postrelease.\nUsing this sampling frame, potential participants were randomly selected (using Research Randomizer, www.randomizer.org) for study screening. Approximately 10-20 women in each jail on each recruitment day were randomly selected based on jail census and time frame eligibility. Women randomly selected for study screening were invited to a private, confidential group room in the jail, provided with informed consent, and encouraged to ask questions about the study. Study screening and data collection procedures were approved by the university Institutional Review Board and protected under a federal Certificate of Confidentiality. Study screening assessments were administered in a group setting. For participants with limited reading ability, the assessments were administered one-on-one with the interviewer. Preliminary analysis indicated that there was no variation in participation rates based on group or individual screening.\nScreening sessions lasted approximately 20 minutes, and instruments included the NIDA-Modified Alcohol Smoking Substance Involved Screening Test (NM-ASSIST) 29 and 5 questions from the Risk Behavioral Assessment 31 to ascertain risky sexual behavior. Study eligibility criteria included: (1) moderate risk of substance abuse based on an NM-ASSIST score of 4+ for any drug 29 ; (2) self-reported sexual risk behavior in the 3 months before incarceration; (3) residence in a rural county in Appalachia prior to incarceration; 30 and (4) willingness to participate in the study.\nFollowing the screening, eligible participants were interviewed face-to-face in a private, confidential room within the jail. Interviews were conducted by trained female interviewers who lived in the targeted counties, and no jail staff or representatives from the criminal justice system were present. Interviews also included HCV pretest counseling and the opportunity to engage in HCV screening using OraQUICK ADVANCE Rapid HCV Antibody Test (OraSure Technologies, Inc., Bethlehem, PA). Interviews and testing procedures lasted approximately 1.5 hours, and participants were paid $25."}, {"section_title": "Measures", "text": ""}, {"section_title": "Demographics", "text": "Participants were asked to report a number of demographic characteristics including age at the time of the baseline interview, race (category of racial group identified), marital status (coded as married/living as married vs not married), having any children (coded as yes/no), education (coded as having at least high school education or GED diploma vs less than high school education), employment (coded as working vs not working prior to incarceration), income (total household income from all sources during the 6 months before incarceration). Considering the jail-based sample, number of days served during the current incarceration and lifetime months incarcerated were also included. In addition, HCV screening status (screening either positive or negative for the presence of HCV antibodies based on the OraQuick rapid screen) was also examined.\nAs shown in Table 1 , the average age of the sample was 32.8 (SD = 8.2), and the majority of study participants identified as white (99%). About a third of women were married (32%) and 87.2% reported having children. Further, 68.3% of women reported having at least a high school education or GED, 22.8% were working 6 months before incarceration and had a household income of about $8,000 in the last 6 months before incarceration. Study participants spent about 70 days in jail during the current incarceration period, and they reported 16.2 months as their average lifetime months served incarcerated."}, {"section_title": "Injection Status", "text": "Injection status was based on self-reported responses to patterns of lifetime and recent use. Three categories of injectors were examined including: (1) Noninjectorreported never injecting drugs; (2) Past injectorreported lifetime IDU, but not in the year before incarceration; and (3) Recent injector-reported IDU in the year before incarceration.\nOne participant had missing data for injection variables, so analyses were based on n = 399. Overall, 75.3% of the sample reported lifetime IDU. More than half (59.9%) reported injecting drugs during the year before incarceration (recent injectors), and about 15.5% reported injecting drugs, but not during the year before entering jail (past injectors). About one-fourth of women (24.6%) reported never injecting drugs (noninjectors). Overall, 59% screened positive for the presence of HCV antibodies."}, {"section_title": "Correlates of IDU", "text": "The following variables were examined to better understand the unique correlates of IDU for rural Appalachian women: (1) Social/familial drug use context as measured by having family members with drug problems, and a selfreported number of days of drug use by others (family, friends, partners) in the respondent's residence; (2) Parenting measured by number of children under the age of 21, involvement with Child Protective Services, and custody status; (3) Health and mental health including chronic health problems (self-reported by participant), depression/anxiety (measured by symptom checklists on the Global Appraisal of Individual Needs [GAIN] 32 ), and incidents of victimization/violence as measured by the GAIN 32 ; (4) Past year drug use including use of marijuana, heroin, stimulants, etc., prior to entering jail, as well as indicators of drug use risk as assessed using the GAIN criteria for drug dependence, 32 and self-reporting overdose of drugs; and (5) Risky sexual behavior including number of lifetime male sex partners, substance use before sex, and having a recent male partner who injected drugs."}, {"section_title": "Statistical Analysis", "text": "Using Stata/SE (13.0) (StataCorp LP, College Station, TX), frequencies and proportions were calculated for categorical variables, while means and standard deviations were computed for continuous variables. The descriptive results for key study variables are provided in Table 1 , and group differences by injection category are reported in Table 2 . A series of simple multinomial logistic regressions were used to establish significant group differences when comparing women who reported never injecting drugs (noninjectors) to past and recent injectors. Those variables that differed significantly across the injection categories were then included in the multivariate multinomial logistic regression models to understand factors associated with recent and past injection. This approach was used because the dependent variable was treated as categorical with more than 2 categories under assumption that different drug injection statuses have no natural ordering. That is, drug injection statuses cannot be ordered from lowest to highest categories and represented by a numeric value. A stepwise deletion approach was used to eliminate nonsignificant associations, resulting in a final model with 8 independent variables. The threshold P value for inclusion in the multivariate model was set at P ࣙ .15. 33 Analyses were examined for multicollinearity among the covariates using the Variance Inflation Factor (VIF) and no problematic variables were observed. Results of the multivariate regression models report the relative risk ratios (RRR) and 95% confidence intervals."}, {"section_title": "Results", "text": ""}, {"section_title": "Comparisons Between Injectors and Noninjectors", "text": "Comparisons between recent and past drug injectors with noninjectors are presented in Table 2 . Group differences were established using a series of simple multinomial logistic regressions. Recent injectors were younger relative to noninjectors (P < .001), while no significant differences were observed between past injectors and noninjectors. Age was treated as a control variable in subsequent analyses. Note: Sample sizes listed in the \"N\" column include the number of participants with valid data for each of the variables.\nInjectors reported significantly higher risk living environments. On average, recent drug injectors reported more days of drug use by people living with them (P < .001) and were more likely to self-report having family members with drug use problems (P < .05) than noninjectors. Injectors also reported more complicated parenting situations. Specifically, recent injectors had, on average, more children under the age of 21 (2.1 children, P < .05) and were more likely to have an open case with Child Protective Services (61.6%, P < .001) compared to noninjectors. A significantly higher proportion of recent and past drug injecting women had also lost custody of their children when compared to noninjecting women (55.5% and 50.9% vs 10.6%, respectively, P < .001, P < .01).\nWith regard to health and mental health issues, as expected, recent (70.1%) and past (63.6%) injectors were more likely to screen positive for HCV antibodies, relative to noninjectors (26.7%, P < .001). Fewer recent and past injectors reported other chronic health issues, relative to noninjectors (P < .05). Recent injectors were more likely to endorse GAIN symptoms consistent with major depression relative to noninjectors (74.1% and 58.1%, respectively, P < .05), but there were no significant differences between injector groups on measures of anxiety. While there were no significant differences between injection status and lifetime victimization, recent injectors were more likely to be victimized at a younger age than noninjectors (14.4 and 16.7, respectively, P < .05).\nWhen examining past year drug use, recent injectors were more likely to use marijuana, anti-anxiety medication, opiates, stimulants, methamphetamine, and buprenorphine (Table 2 ). In addition to more drug use, recent injectors had worse indictors for drug use severity, including GAIN scores consistent with drug dependence (P < .001) and incidents of lifetime drug overdose (P < .001).\nFurther, recent injectors and past injectors reported more lifetime sexual partners relative to noninjectors (average of 37.3 and 42.0, respectively, compared to 17.1, P < .001). Recent injectors (88.1%) were more likely to use substances before their last sexual intercourse relative to noninjectors (65.9%, P < .001). Finally, recent (77.9%) and past injectors (47.3%) were also more likely to have had a male partner who injected drugs compared to noninjectors (23.1%) (P < .001, P < .01, respectively)."}, {"section_title": "Correlates of Past and Recent IDU", "text": "Dependent variables which were statistically significant at the bivariate level were included in multinomial logistic regression analyses to examine independent correlates of drug injection status (Table 3) . Women were at a higher estimated risk of being a recent (RRR = 4.61, P < .001) and a past injector (RRR = 5.80, P < .001) if they screened positive for HCV antibodies, relative to noninjectors. Women who reported other chronic health problems had a lower estimated risk of being a recent (RRR = .37, P < .05) or past injector (RRR = .24, P < .01), relative to noninjectors.\nWhen examining correlates of recent IDU relative to never injecting, increased age was associated with decreased risk of being a recent injector compared to a noninjector (RRR = .94, P < .05). High-risk drug use was also associated with an increase in risk of being a recent injector relative to never injecting, including drug dependence consistent with GAIN scores (RRR = 8.21, P < .001), drug overdose (RRR = 3.54, P < .01), and marijuana use in the past year (RRR = 3.14, P < .01).\nRisky sexual behavior was also associated with IDU risk. Specifically, among women who had a drug injecting main partner, the relative risk of being a recent injector as opposed to never injecting was also significantly increased (RRR = 6.57, P < .001). In addition, having Notes: The total sample for this analysis is based on 399 participants with a valid response to the injector status variable. A series of simple multinomial logistic regressions was used to test for significant group differences. Comparison group: noninjectors, * P < .05; * * P < .01; * * * P < .001; * * * * P < .1.\nmore lifetime male sex partners was the only other factor significantly and positively associated with an increase in expected relative risk of being a past drug injector relative to having never injected drugs (RRR = 1.01, P < .05)."}, {"section_title": "Discussion", "text": "The overall aim of this study was to better understand correlates of IDU among rural Appalachian women drug users. Appalachia is a region of the country experiencing steady increases in opiate injection, HCV infections, and drug overdoses. [3] [4] [5] A number of factors have been associated with the drug abuse epidemic in this region including overprescribing pain medication among some rural physicians, 34 targeted marketing of addictive pain medication by some pharmaceutical companies, 35 and limited affordable treatment options. 36, 37 These factors, coupled with dire economic conditions associated with reductions in coal mining and other industries in Appalachia, have led to rising public health concerns mirroring southern Indiana prior to its recent HIV outbreak. 38 In fact, following the HIV outbreak in this small rural area, the CDC conducted an investigation into the indicator variables associated with IDU as a way of identifying US counties most vulnerable to the rapid spread of HIV. 38 Counties in rural Appalachia were disproportionately represented in the list of 220 counties identified as most vulnerable, with 2 target counties in this study ranking in the top 10 (4th and 8th). Thus, research on correlates of IDU in rural Appalachia is critical.\nTo provide context for the study findings, it is important to recognize that rural Appalachian women in this study were randomly selected from 3 jails. While they were screened for substance use using the NM-ASSIST, the majority of women reported lifetime drug injection (75.3%). Injectors were significantly more likely to screen positive for HCV antibodies compared to noninjectors, findings which were noted in both the bivariate analysis and multivariate models. These findings are consistent with other research that has consistently demonstrated the link between IDU and HCV. [39] [40] [41] [42] While this study focused primarily on injector status, it is important for future research to expand these findings to shared injection practices. It is interesting to note, however, that about one-quarter of the noninjector sample also screened positive for HCV antibodies (26.7%), suggesting that future research should also examine other risk factors for HCV transmission among rural Appalachian women drug users (such as intranasal transmission 43 ). Both past and recent injectors reported riskier sexual behaviors compared to noninjectors. Specifically, injectors reported having more lifetime sexual partners, were more likely to have a partner who injected drugs, and were more likely to use drugs before sexual intercourse compared to noninjectors. In addition, having an injecting main partner was differentially associated with being a recent injector in the logistic regression model. Women's initiation and sustained IDU through relationships is supported in the literature. 8, 10, 15, [19] [20] [21] [22] This finding is particularly salient considering the importance of relationships in Appalachian culture which are typically characterized by close-knit families, extended families, and traditional partners. 43 Future research should examine the extent to which adherence to these traditional relationship beliefs, as well as the stability of those relationships over time, influence high-risk drug use.\nAt the bivariate level, other relational factors emerged in that recent injectors were more likely to report drug use by others in the home and having more family members with \"drug problems.\" In addition, recent injectors reported having more children, more involvement with Child Protective Services, and were more likely to have lost custody of their children. This is consistent with other research which has reported that living with children may be protective for IDU. 44 This also may be consistent with the notion that women who want to continue using, and perhaps continue injection practices, may be more likely to have children living with other family members-contributing to the increasing rate of grandparents raising their grandchildren in rural Appalachian communities. 45 Recent injectors also reported more mental health issues and earlier victimization experiences. Other studies have reported increased mental health issues among injectors recruited from Appalachian communities. 2 In addition, the association between victimization experiences and high-risk injection practices like sharing syringes has also been established. 23 Having a history of victimization can also serve as a barrier to health and behavioral health service utilization for women drug users, 46 ,47 which may be particularly problematic for rural Appalachian women. 48 These findings suggest that injection may be a marker for more serious mental health comorbidities, as well as an increased need for behavioral health services. Thus, future research should focus on the complexity of co-occurring treatment needs and treatment barriers among rural Appalachian women injectors with an eye to increasing access and utilization of services."}, {"section_title": "Limitations", "text": "Findings from this study should be examined with an understanding of some limitations. This research focused primarily on injector status among women in the criminal justice system, which may have missed important differences among injectors who also shared needles and other drug injection equipment works. Considering the infectious disease risks associated with sharing practices, these variables should be examined in future research. Also, Appalachians can be characterized as a unique cultural group, 49 so findings may not translate to other rural women. However, due to the random selection design and the likelihood of criminal activity that accompanies the drug using lifestyle, it is feasible that study findings may inform other work with Appalachian women IDU who may not be incarcerated. Self-report data included sensitive information like drug use and injection, which may increase the social desirability response bias. In addition, due to the nature of recruitment from a county jail, participants may have had varying times of incarceration, which may have affected potential recall bias for activities prior to entering the jail. While face-to-face interviews were conducted in a private room with no correctional officers present, and a Certificate of Confidentiality was obtained to increase protections, it is still possible that women were concerned about confidentiality in the jail environment. In addition, these data are crosssectional; therefore causality cannot be inferred from the findings."}, {"section_title": "Conclusion", "text": "Despite limitations, this study makes an important contribution to understanding factors associated with IDU among rural Appalachian women drug users. These factors are strongly associated with both relational and health characteristics. Studies have shown that women are often overlooked for targeted prevention and intervention programs associated with IDU risk.\n14 This disparity in targeted services is even more pronounced in rural communities where health and behavioral services are limited and less accessible. In the current study, recruiting from the local rural jail proved to be a viable real-world setting to recruit high-risk women drug users, and subsequently, an important venue for outreach and interventions in Appalachia, especially considering the high-risk behaviors noted among this sample.\nStudy findings on the specific factors associated with IDU risk among rural Appalachian women have important implications for tailoring and targeting interventions. In considering future interventions, findings from this study suggest that a number of relational and health factors are associated with rural Appalachian women's injection practices. Of particular interest is the role of a risky, injecting partner in sustaining IDU among women. Finally, future research should examine the relationship context in different cultural groups with an eye to developing and implementing more effective intervention programs."}]