[{"section_title": "Abstract", "text": "Background: Mounting evidence showed the self-reported levels of physical activity are positively associated with white matter (WM) integrity and cognitive performance in normal adults and patients with mild cognitive impairment (MCI). However, the objective measure of cardiorespiratory fitness (CRF) was not used in these studies. Objective: To determine the associations of CRF measured by maximal oxygen uptake (VO 2 max) with WM fiber integrity and neurocognitive performance in older adults with MCI. Methods: Eighty-one participants (age = 65 ± 7 years, 43 women), including 26 cognitively normal older adults and 55 amnestic MCI patients, underwent VO 2 max test to measure CRF, diffusion tensor imaging (DTI) to assess WM fiber integrity, and neurocognitive assessment focused on memory and executive function. DTI data were analyzed by the tract-based spatial statistics and region-of-interest approach. Results: Cognitively normal older adults and MCI patients were not different in global WM fiber integrity and VO 2 max. VO 2 max was associated positively with DTI metrics of fractional anisotropy in ∼54% WM fiber tracts, and negatively with mean and radial diffusivities in ∼46% and ∼56% of the WM fiber tracts. The associations of VO 2 max with DTI metrics remained statistically significant after adjustment of age, sex, body mass index, WM lesion burden, and MCI status. The DTI metrics obtained from the area that correlated to VO 2 max were associated with executive function performance in MCI patients. Conclusions: Higher levels of CRF are associated with better WM fiber integrity, which in turn is correlated with better executive function performance in MCI patients."}, {"section_title": "INTRODUCTION", "text": "Alzheimer's disease (AD) currently lacks effective treatment; therefore, identification of modifiable risk factors is critical for AD prevention [1] . Amnestic mild cognitive impairment (MCI) is considered as an intermediate phase between age-related cognitive decline and AD, and may represent a critical time window for implementing prevention strategies to attenuate or delay cognitive decline [2] .\nWhite matter (WM) fiber integrity, as assessed by MRI diffusion tensor imaging (DTI), is correlated with cognitive performance [3] and is sensitive to WM fiber damage [4] . DTI studies in AD have observed WM fiber damage in widespread brain regions, most notably in the frontal and temporal lobes, the posterior cingulum, the corpus callosum (CC), the superior longitudinal fasciculus (SLF), and the uncinate fasciculus (UF) related to the memory and executive function [5, 6] . Similar observations are reported in MCI patients; however, findings in MCI are inconsistent, most likely due to the heterogeneity of MCI population [5] .\nMounting evidence indicates that 1) individual levels of physical activity or cardiorespiratory fitness (CRF) are associated positively with WM integrity and cognitive performance in normal older adults and patients with MCI [7] [8] [9] [10] ; 2) regular exercise may improve cognitive performance [11, 12] . However, these studies are relied mainly on the self-reported physical activity questionnaires that may not reflect objective measurements of CRF.\nThe purpose of this study was to examine the relationships between objective measure of CRF, WM fiber integrity, and cognitive performance in MCI patients. Maximal oxygen uptake (VO 2 max), the \"gold-standard\" measurement of CRF [13] , was used to quantify the level of physical fitness [14] , and DTI metrics was used to assess white matter integrity. We hypothesized that there are positively correlations between VO 2 max, WM fiber integrity, and cognitive performance in MCI patients."}, {"section_title": "MATERIALS AND METHODS", "text": ""}, {"section_title": "Participants", "text": "Fifty-five participants with amnestic MCI and 26 cognitively normal older adults who were similar in age and sex were recruited through communitybased advertisement and the University of Texas Southwestern Medical Center Alzheimer's Disease Center. The diagnosis of amnestic MCI was based on Petersen criteria [2] , as modified by the Alzheimer's Disease Neuroimaging Initiative project (http://adniinfo.org). Specifically, we used a global Clinical Dementia Rating scale of 0.5 with a score of 0.5 in the memory category, objective memory loss as indicated by education-adjusted scores on the Logical Memory subtest of the Wechsler Memory Scale-Revised immediate and delayed recalls, and a Mini-Mental State Examination (MMSE) score between 24 and 30 [15] . Further clinical evaluation of MCI was performed based on the recommendations from the Alzheimer's Disease Cooperative Study Diagnostic Criteria (http://adni-info.org).\nInclusion criteria were men and women aged 55-80 years who were diagnosed with amnestic MCI or judged to be cognitively normal. Medical conditions with potential impact on cardiorespiratory function and white matter integrity were excluded from this study. Exclusion criteria included major neurologic, vascular, or psychiatric disorders, uncontrolled hypertension, clinically diagnosed or self-reported diabetes mellitus, sleep apnea, body mass index (BMI) ≥35 kg/m 2 , current or a history of smoking. Individuals with a pacemaker or any metals in their body were excluded as were subjects with a physically active lifestyle (defined as participation in moderate intensity aerobic exercise training over the past two years for 3 times per week with each session lasting >30 min). Screening procedures included a detailed medical history and medication questionnaire, a comprehensive physical examination, 12-lead electrocardiogram (ECG), echocardiography, carotid artery ultrasound to exclude severe stenosis (>50%), and 24-h ambulatory blood pressure monitoring. Group "}, {"section_title": "Magnetic resonance imaging (MRI)", "text": "All MRI data were acquired by a 3-Telsa scanner (Philips Medical System, Best, The Netherlands) using a body coil for radiofrequency transmission and an 8-channel head coil with parallel imaging capability for signal reception.\nDTI was acquired by a single-shot echo-planarimaging (EPI) sequence with a sensitivity encoding (SENSE) parallel imaging scheme (reduction factor = 2.2). The imaging matrix was 112 × 112 with field of view (FOV) = 224 × 224 mm 2 (nominal resolution of 2 mm), which was filled to 256 × 256. Axial slices of 2.2 mm thickness (no gap) were acquired parallel to the anterior-posterior commissure line. A total of 65 slices covered the entire hemisphere and brainstem. Echo Time (TE)/Repetition Time (TR) was 51/5630 ms. Diffusion weighting was encoded along 30 independent orientations with the b-value of 1000 s/mm 2 . The scan duration was 4.3 min. Automated image registration was performed on the raw diffusion images to correct distortions caused by motion artifacts or eddy currents. DTI data was acquired twice in each subject to improve signal-to noise ratio (SNR) by averaging the scans.\nFMRIB Software Library (FSL, https://surfer.nmr. mgh.harvard.edu/fswiki) was used to preprocess the DTI data and run voxelwise statistics. First, data from both DTI scans were merged in temporal order, corrected for eddy currents and head motion, and averaged over scans to increase signal-to-noise ratio. Next, a brain mask was created using the Brain Extraction Tool (BET) from FSL to delete non-brain tissue and the diffusion tensor was calculated by the DTIFIT [16] . Individual images with fractional anisotropy (FA), mean (MD), radial (RD), and axial (AxD) diffusivities were visually inspected and analyzed by voxelwise and regional-of-interest (ROI) statistics.\nTract-based spatial statistics (TBSS) was used to perform voxelwise statistic [17] . First, individual FA images were eroded slightly to remove outliers and registered non-linearly into the JHU-ICBM-FA template as a common space in order to correspond the results from voxelwise and ROI analyses [18] . Next, the group mean FA image was created and thinned to generate a mean FA skeleton which represents the centers of all tracts common to all subjects within the group. We then set a threshold for voxels with FA value greater than 0.20 to minimize partial volume effects from gray matter and cerebrospinal fluid. Finally, individual MD, RD, and AxD images were transformed into this skeleton space, by applying the parameters from the normalization of the FA image to the template space. The resulting MD, RD, AxD, and FA skeleton maps were then fed into voxelwise and ROI-based group statistics. ROI analysis limited to the TBSS skeleton was performed using the deep WM atlas (ICBM-DTI-81 White-Matter Atlas) [18] .\nT1-weighted high-resolution image was acquired by 3D magnetization-prepared-rapid-acquisitionof-gradient-echo (MPRAGE) sequence using the following parameters [19] : TE/TR = 3.7/8.1 ms, flip angle = 12 • , FOV = 256 × 256 mm, number of slices = 160 (no gap), resolution = 1 × 1 × 1 mm 3 , SENSE factor = 2, and scan duration = 4 min. Brain tissue volumes were calculated by the FreeSurfer (http://ftp.nmr.mgh.harvard.edu). WM lesion volume was estimated by the volume of hypointensity signals and normalized to intracranial volume [20] . The reproducibility of DTI and brain tissue volume measurements with T1-weighted image have been documented in previous studies [21] ."}, {"section_title": "Maximal oxygen uptake (VO 2 max)", "text": "VO 2 max was measured on a treadmill using a modified Astrand-Saltin protocol [22] . The treadmill grade was increased by 2% every 2 min until exhaustion while subjects walked, jogged, or ran at a fixed speed. The speeds were selected based on the individual subject's cardiorespiratory fitness level, which was assessed via a submaximal exercise test conducted prior to VO 2 max testing [8] . VO 2 was measured during the second minute of each stage using the Douglas bag method, and breath-by-breath VO 2 was also monitored continuously using an online computer system. Gas fractions were analyzed by mass spectrometry (Marquette MGA 1100) and ventilatory volume was measured by a Tissot spirometer. Exercise blood pressure, 12-lead ECG, and heart rate (HR) were monitored continuously by a registered nurse or a board-certified cardiologist. Lactate concentration at maximal exercise intensity was measured by finger stick (Yellow Springs Instruments (YSI) 23L, Yellow Spring, OH). Mass spectrometry and gas sampling system were calibrated before each test to ensure measurement accuracy and reliability.\nVO 2 max was defined as the highest VO 2 measured from a > 30-s Douglas bag during the last stage of testing. The criteria to confirm that VO 2 max was achieved included an increase in VO 2 <150 ml despite increasing work rate of 2% grade, a respiratory exchange ratio ≥1.1, and HR within 5 beats/min of age-predicted maximal values. In all cases, at least two of these criteria were achieved, confirming the identification of VO 2 max based on the American College of Sports Medicine guidelines [23] . In cases in which a subject did not meet at least two of these criteria, they were brought in to repeat testing a minimum of one week after the original test. Of note, our previous studies have demonstrated that by using these methods, VO 2 max can be measured reliably in sedentary elderly subjects [8, 14, 24] ."}, {"section_title": "Neuropsychological test", "text": "Neuropsychological assessment focused on executive function and episodic memory was administered and scored by a trained psychometrician. Executive function was assessed using scores from the Trail Making Test (Part B total time and total time of Trails A subtracted from Trail B-TMT B-A), Digit Span Backward (total correct), Letter Fluency (FAS total), and the Wisconsin Card Sorting Test (WCST) (total perseverative responses). Episodic memory was assessed with long delayed free recall and total learning scores from the California Verbal Learning Test and delayed recall from the Wechsler Memory Scale-III Visual Reproduction subtest. Global cognitive function was assessed with the MMSE and the Montreal Cognitive Assessment."}, {"section_title": "Statistical analysis", "text": "Cognitively normal older adults and MCI subjects were compared by independent t-test. TBSS was used to perform voxelwise correlation analysis of VO 2 max and DTI metrics in all subjects. In TBSS, multiple comparisons were corrected by threshold-free cluster enhancement with 5,000 permutations [25] . The corrected statistical maps were threshold by p < 0.05. Subsequently, individual mean values of DTI metrics were extracted from the significant voxels identified by TBSS and analyzed by multiple linear regression. In multiple linear regression analysis, we examined whether VO 2 max explains the variability of FA, MD, and RD after adjusting for age, sex, BMI, WM lesion burden, and MCI status. To explore the association between neuropsychological measures and FA, MD, and RD, we used partial correlation, including age, sex, and education as covariates. Because neuropsychological performance was different between the groups, we conducted this analysis separately in normal subjects and MCI patients. Data normality was checked by the Shapiro-Wilk test and the visual inspection of histogram and Q-Q plots. All data are reported as mean ± standard deviation. Statistical significance was set a priori at p < 0.05. Statistical analyses were performed using SPSS 20 (IBM Inc.; Chicago, IL)."}, {"section_title": "RESULT", "text": ""}, {"section_title": "Subject demographics", "text": "Cognitively normal older adults and MCI patients were similar in age and educational level (Table 1) . MCI subjects showed lower performance on Montreal Cognitive Assessment, memory, and executive function tests including CLVT delayed recall and TMT part B relative to normal older adults (p < 0.05); however, the scores on MMSE, WCST's perseverative response, letter fluency, and backward digit span were not different. Global WM integrity, as measured by DTI metrics extracted from the whole brain TBSS WM skeletons and lesion volume, whole brain volume, and VO 2 max were not different between normal older adults and MCI patients (p > 0.05) ( Table 1) ."}, {"section_title": "VO 2 max and DTI metrics", "text": "TBSS showed that VO 2 max is associated positively with FA in ∼54% tracts, negatively with MD, RD, and AxD in ∼46%, ∼56%, and ∼5% of the WM fiber tracts (Fig. 1A, Table 2 ). Anatomically, these voxels were located in the CC, UF, SLF subcomponent I (SLF I), and cingulum (Table 2 ). Figure 1B shows the scatter plots of VO 2 max with FA, MD, RD, and AxD extracted from the significant WM skeletons.\nResults from multiple linear regression analysis are summarized in Table 3 . After adjustment for age, sex, BMI, and WM lesion volume, VO 2 max explained an additional 9% variance of FA, 3% variance of MD, and 4% variance of RD. Of note, MCI status also showed statistically significant influences on MD and RD after accounting for the covariates. Table 4 summaries the results of partial correlation between cognitive performance and DTI metrics that were extracted from the areas correlated with VO 2 max. In all subjects, FA positively, and MD and RD were negatively correlated with the performance on several aspects of executive function as assessed by TMT part B, TMT part B-A, letter fluency, and backward digit span (partial correlation coefficients ranged between 0.30 to 0.40; p < 0.05). Of note, these correlations were observed primarily in patients with MCI."}, {"section_title": "DTI metrics and neuropsychological performance", "text": ""}, {"section_title": "DISCUSSION", "text": "The main findings from this study are that 1) VO 2 max, an objective assessment of CRF, is positively correlated with WM fiber integrity in older adults who have normal cognitive function or MCI; and 2) WM fiber integrity is also positively correlated with executive function, especially in MCI patients. These findings suggest that maintenance or improvement of CRF in older age may delay or slow cognitive decline even in those who have high risk of AD. Current literature suggests that increase in CRF may improve WM microstructural integrity in cognitively normal older adults [7, 8] . Our prior study in the Masters Athletes showed an 83% reduction in the volume of deep WM lesions and higher FA values in the right superior corona radiate, both sides of the SLF, Voxel counts were calculated based on Fig. 1A . The numbers in percentage represent the proportion of significant voxels relative to the whole white matter fiber tract. Each voxel is 1 mm 3 . FA, fractional anisotropy; MD, mean diffusivity; RD, radial diffusivity; AxD, axial diffusivity.\nthe right inferior fronto-occipital fasciculus, and the left inferior longitudinal fasciculus relative to sedentary older adults [8] . The Lothian Birth Cohort 1936, a longitudinal study of aging, also reported that higher level of self-reported physical activity was associated with higher FA in 12 major WM fiber tracts, normalappearing WM volumes, less gray matter atrophy, and lower WM lesion load in adults in their 70 s [26] . Similar findings were also reported in older adults with cerebral small-vessel disease [7] , seniors (older than 80 years) with multiple cardio-metabolic conditions and physical function limitations [27] , and in cognitive healthy, middle-aged adults (between 40 and 65 years) with a positive family history for AD and positive apolipoprotein E4 (APOE4) [28] . The present study extended this line of literature by focusing on MCI patients who had a sedentary lifestyle, but otherwise healthy and without significant cardiovascular risk factors. While age, sex, and WM lesion burden are the major factors for the observed individual differences in WM fiber integrity, lower VO 2 max contributed to an additional 9% reduction of FA and 4% elevation of RD in older adults including MCI patients. While FA provides an index of overall tissue microstructural integrity, alterations in RD, a measure of water molecule diffusion perpendicular to the WM fibers, are likely to reflect myelin integrity [29] . Thus, our data suggest that high level of CRF may delay or slow myelin deterioration and maintain WM integrity in older adults including MCI patients. Conversely, low level of CRF may accelerate WM damage and cognitive decline which should be monitored closely for further deterioration. Future clinical trials of increases in physical activity such as aerobic exercise training are needed to validate the benefit of high CRF in maintaining WM integrity.\nSimilar to the observations in AD, MCI is associated with reduced FA and increased MD in the temporal regions, the hippocampus, the posterior cingulum, the genu and the splenium of the CC when compared to cognitively normal controls [5, 6, 30] . The increased axial and mean diffusivity in mesial parietal/splenial white matter may be the early abnormalities to occur, but increased RD and decreased FA in the splenium of the CC is likely correlated WM diffusion metrics were extracted from the significant skeleton voxels shown by Fig. 1A . p < 0.05 are bolded. WM lesion volume was log-transformed before analysis. ␤, standardized beta coefficient; MCI, mild cognitive impairment; VO 2 max, maximal oxygen uptake; WM, white matter. with dementia severity [31] . However, in the present study, we did not find group differences in both the global and voxelwise-based analysis of DTI metrics between MCI and healthy older adults. This discrepancy with previous studies is likely due to the selected cohort of early stage MCI subjects in the present study who were otherwise healthy and only had mild cognitive decline (mean MMSE score of 29, no group differences between normal older adults and MCI). However, we did find that even in this mild MCI cohort, MCI status contributed to an additional 3% elevation of MD and RD after adjustment for age, BMI, sex, and WM lesion burden in those WM tracts correlated with VO 2 max (Table 3) . These findings are consistent with the report that neurocognitive deficits at the early stage of AD are associated with WM fiber abnormalities [30, 32, 33] . In this study, we found strong associations between VO 2 max and DTI metrics (FA, RD, and MD) in the genu of CC, UF, SLF I, and cingulum. The CC is the major inter-hemispheric commissure that connects most of the neocortical areas. Fibers from the prefrontal and inferior frontal areas course through the rostrum and genus of the CC [34] . The UF connects the anterior temporal lobe with the medial and orbital prefrontal cortex [34] . The cingulum bundle stretches from the frontal lobe around the rostrum and the genu of the CC and lies in the WM of the parahippocampal gyrus [34] . SLF I links the superior parietal lobule and the superior frontal gyrus, and projects to the supplementary motor area, dorsal area 6, and area 9 [34] . Alterations to the integrity of these corticocortical association fiber tracts between the frontal lobes and other brain regions contribute to impaired executive performance observed in both rhesus monkeys and human subjects [3, 35, 36] . Our correlational analyses between DTI metrics and neuropsychological performance are consistent with these findings. We also observed that the correlation between the DTI metrics and executive function performance was stronger in MCI than cognitively normal older adults (Table 4 ). These findings suggest that the underlying AD process in MCI may result in aspects of executive performance becoming more susceptible to WM structural deteriorations [37] .\nThe underlying mechanism(s) by which physical activity protects WM structural integrity leading to improvement in neurocognitive function are not well understood. A growing body of evidence suggests that attenuation of cardiovascular aging associated with increases in physical activity may be one mechanism. For example, increases in physical activity are associated with reduced carotid artery stiffness and improved brain perfusion and executive performance [38] . In addition, age-related elevation in central artery stiffness and pulse pressure has been shown to be associated positively with cerebral blood flow pulsatility and WM lesion volume which may be reversed with aerobic exercise training [39] [40] [41] [42] . Further, Tarumi et al. have demonstrated that the decreases in FA and elevations in RD are associated with central arterial stiffening and reduced baroreflex sensitivity in many brain regions, suggesting a link between cardiovascular and brain health [43] .\nThese potential underlying vascular mechanisms linking physical activity and WM integrity are consistent with extensive studies which indicate that the presence of cardiovascular disease risk factors is related to brain hypoperfusion which in turn may affect brain metabolic homeostasis and toxic protein clearance leading to neuronal damage, cognitive decline, and AD [44] . In this regard, neuroimaging studies have shown that brain hypoperfusion in the mediotemporal area, the posterior percuneus, and the associative fronto-temporal-parietal regions predict progressive cognitive decline in MCI [44] [45] [46] . In addition, both animal and human studies have shown that aerobic exercise stimulates the release of musclederived angiogenic growth factors such as vascular endothelial growth factor which may reach the brain via the circulation and increase brain capillary density via angiogenesis and lead to improvement in brain perfusion and function [47] [48] [49] .\nThis study was strengthened by the measurement of VO 2 max to investigate the associations between CRF and brain WM integrity in MCI patients. Further, the study population was screened rigorously to exclude neurological and psychiatric disorders, cardio-and cerebrovascular diseases, and other potential confounding variables which may influence the CRF-WM integrity relationship [50] . There are several limitations in the current study. First, this study is a cross-sectional study which limits the understanding of causality. Second, the present study was based on a relatively small sample size of sedentary older adults including MCI patients. Thus, the result may not be applicable to the general population. Finally, the data interpretation of WM integrity relied on the mechanisms and validity of DTI, an indirect assessment of WM microstructural integrity. In a setting of aging and associated brain atrophy, the influence of extracellular free water on the mapping of diffusion MRI should be considered in data interpretation [51, 52] ."}, {"section_title": "Conclusions", "text": "This study indicates that the level of VO 2 max, an objective measure of cardiorespiratory fitness, is associated positively with WM fiber integrity measured with MRI diffusion tensor imaging, and several aspects of executive function performance in patients with amnestic MCI. These findings support the hypothesis that physical activity, which can improve physical fitness even in old age, may have protective effects on WM neuronal fiber integrity in older adults who have high risk for AD."}]