[{"section_title": "Executive Summary", "text": "This document summarizes the major findings of a Gulf of Mexico Application Pilot project led by NASA Stennis Space Center (SSC) in conjunction with a regional collaboration network of the Gulf of Mexico Alliance (GOMA). NASA researchers processed and analyzed multi-temporal Landsat data to assess land-use and land-cover (LULC) changes in the coastal counties of Mobile andBaldwin, AL between 1974 and2008. Our goal was to create satellite-based LULC data products using methods that could be transferable to other coastal areas of concern within the Gulf of Mexico. The Mobile Bay National Estuary Program (MBNEP) is the primary end-user, however, several other state and local groups may benefit from the project's data products that will be available through NOAA-NCDDC's Regional Ecosystem Data Management program. Mobile Bay is a critical ecologic and economic region in the Gulf of Mexico and to the entire country. Mobile Bay was designated as an estuary of \"national significance\" in 1996. This estuary receives the fourth largest freshwater inflow in the United States. It provides vital nursery habitat for commercially and recreationally important fish species. It has exceptional aquatic and terrestrial bio-diversity; however, its estuary health is influenced by changing LULC patterns, such as urbanization. Mobile and Baldwin counties have experienced a population growth of 1.1% and 20.5%, respectfully, from 2000-2006. Urban expansion and population growth is likely to accelerate with the construction and operation of the ThyssenKrupp steel mill in the northeast portion of Mobile County. Land-use and land-cover change can negatively impact Gulf coast water quality and ecological resources. The conversion of forest to urban cover types impacts the carbon cycle and increases the freshwater and sediment in coastal waters. Increased freshwater runoff decreases salinity and increases the turbidity of coastal waters, thus impacting the growth potential of submerged aquatic vegetation (SAV), which is critical nursing ground for many Gulf fish species. A survey of Mobile Bay SAV showed widespread decreases since the 1940s. Prior to our project, coastal environmental managers in Baldwin and Mobile counties needed more understanding of the historical LULC, and therefore to properly assess the impacts of increasing urbanization. In particular, more information on the location and extent of changing urbanization LULC patterns was needed to aid LULC planning and to assess predictions of future LULC patterns. Our products will assist the coastal environmental managers and land-use planners make better LULC planning and implementation decisions. Our project also helped to establish a historical baseline of LULC distributions, which is a fundamental need in any stewardship plan. The primary research objective of our project was to produce historic and current geospatial LULC change products. A multi-decadal coastal LULC change product was the major project deliverable. The geographic extent and nature of change was quantified and assessed for the upland herbaceous, barren, open water, urban, upland forest, woody wetland, and non-woody wetland-dominated land cover types. We focused on regional analyses of decadal-scale urban expansion and watershed-scaled analyses of LULC change for multiple areas of concern to the Mobile Bay NEP ( Figure A). We used the following dates to derive LULC classification products from Landsat data: 1974Landsat data: , 1979Landsat data: , 1984Landsat data: , 1988Landsat data: , 1991Landsat data: , 1996Landsat data: , 2001Landsat data: , 2005Landsat data: , and 2008. We assessed the accuracy of our products using randomly sampled locations and digital geospatial reference data including field survey data, high resolution ortho-rectified aerial photography, high resolution multispectral and panchromatic satellite data displays (from QuickBird and Corona sensors), digital elevation model data, and National Wetlands Inventory wetland cover type data. NOAA's Coastal Change Assessment Program's (C-CAP) and National Land Cover Database (NLCD) products were used for qualitative comparison in assessing map accuracy. We calculated an average overall accuracy of 87% with similar overall accuracies for the older (MSS) and newer (TM and ETM) Landsat LULC products. Figure B. Landsat-derived land-use andland-cover data product for 1974 (left) and2008 (right) showing surveyed area within Mobile and Baldwin counties. Figure B shows an example of the LULC products computed during the project. It shows LULC in 1974 (baseline, left) and in 2008 (right). We found a substantial LULC change over the 34-year study period. The most striking qualitative (visual) change is the urban expansion around the City of Mobile and along the Eastern Shore. In the northeast portion of the study area, some upland forest has changed to the upland herbaceous land cover type. The latter change is probably transitional, due to forest harvesting cycles. LULC change was normalized within each class to the baseline (1974; Figure C). Urban landscapes consistently increase through time and there is an approximate 30% increase in urban land-cover between 1974 and 1979, with that change increasing to almost 60% when considering the entire time series. There is noteworthy fluctuation amongst the upland herbaceous and upland forest landscapes. These data suggest a cyclical land swapping between upland herbaceous and upland forest landscape, however, our research is unable to make this conclusion definitely. The non-woody wetlands decreased over time (-6.4%, or ~2400 acres), while the woody wetlands slightly increased (+3.4%, or ~6500 acres). Urban expansion in northern Mobile Bay is shown in Figure D. These satellite-based estimates indicate that during the 34-year study period urban areas increased from 80,972 to 128,662 acres, representing a 58.9% increase, or 1.73% per annum for both counties. The period between 1974 and 1984 shows the greatest expansion in the urban landscape (21428 acres, or 1.48%, Mobile and Baldwin counties), and the expansion was most dominant in the northern Mobile Bay region shown in Figure D. Information from the project was immediately used for aiding Mobile Bay NEP LULC planning efforts. Results from the project were incorporated into the Mobile Bay NEP's State of the Bay report.    Bay between 1974Bay between and 1984Bay between (left) and 1974Bay between and 2008. Yellow regions in both figures were urbanized in 1974figures were urbanized in . Red regions show the growth of urban regions from 1974figures were urbanized in to 1984figures were urbanized in (left) and 1974figures were urbanized in to 2008. The backdrop is a USGS DEM where dark grays designate lower elevations and lighter grays and white tones denote higher elevations."}, {"section_title": "Background", "text": "The purpose of this project was to quantify and assess geospatial land-use and land-cover (LULC) changes in the coastal counties of Mobile and Baldwin, AL. These two counties border Mobile Bay, which has the fourth largest freshwater inflow in the United States. The Mobile Bay estuary is economically vital to the nation in terms of shipping, fishing, and recreation. It is environmentally important in multiple ways, for example, it provides invaluable nursery habitat for commercially and recreationally important fish species. The region also has exceptional aquatic and terrestrial bio-diversity. The health of the estuary is influenced by changing land-use patterns, much of which has been attributed to urbanization since Hurricane Frederic in 1979. Mobile was designated as an estuary of \"national significance\" in 1996 (MBNEP, 2007). Mobile Bay has been identified by participants of the Gulf of Mexico Research Requirements Planning Workshop as an area of critical study. The Mobile Bay estuary was selected by NASA Stennis Space Center (SSC) and its partners as a region for investigation because of the observed anthropogenic changes and because of its environmental diversity and ecological importance. This work is supported by several Federal, state, and locally led research projects currently active in Mobile Bay, Grand Bay, Weeks Bay, and the Mississippi Sound."}, {"section_title": "Objectives", "text": "This project included several objectives. The initial objective was to survey the needs of the Mobile Bay coastal environmental managers to formulate a project topic. It was determined that NASA data and data products could assist Mobile Bay National Estuary Program (MBNEP) with validating land-cover and land-use changes identified through a separate MBNEP funded project with USGS, thus initiating this collaboration. The primary research objective was for NASA SSC to compute Landsat-based historic and current LULC change detection products for MBNEP that would be used as decision support tools for coastal resource planning and outreach and education for addressing coastal community LULC planning needs. Within this objective, we focused on decadal-scale urban expansion and 'areas of interest' (Figure  1), determined by MBNEP. The resulting digital and static products will be transferred to MBNEP and NOAA-NCDDC, one of NASA's Federal agency partners, for dissemination, further evaluation, and use. Throughout this project it was our goal to develop NASA-specific LULC data products for the Mobile Bay LULC planning community using methods that could be transferable to other coastal regions along the Gulf of Mexico. A third objective was to establish and maintain communication with and seek guidance from our federal and Mobile Bay coastal environmental manager partners.  "}, {"section_title": "Primary Project End-User: Mobile Bay National Estuary Program", "text": "The Mobile Bay National Estuary Program was established in 1995 to \"promote wise stewardship of the water quality characteristics and living resource base of the Mobile Bay estuarine system\" (MBNEP, 2008b). Sponsored by the EPA and administrated through Dauphin Island Sea Lab, this program does not have regulatory power; however it is responsible for bringing together all facets of the Mobile Bay community (e.g., government, industry, academia, non-profits, and citizens) to help provide, protect, and conserve the Mobile Bay environment. Yearly goals and objectives of MBNEP are described in Comprehensive Conservation and Management Plan (CCMP) Work Plans with the most recent one published for FY2009. MBNEP is currently active in approximately 50 coastal conservation projects throughout Mobile and Baldwin counties (MBNEP, 2008a). One issue of concern for the Mobile Bay region is the rapid increase of the human residential population, especially in Baldwin County, and its effect on the land and on coastal waters (U.S. Census Bureau, 2008). MBNEP has responded to these concerns by including these issues in their FY2009 Work Plan: \"this project [the collaboration between MBNEP and NASA SSC] will be of inestimable value in helping us assess coastal change due to development and its impact on water quality, habitat, and living resources populations. It will also allow us to better educate our coastal communities about these impacts and options for future planning\" (MBNEP, 2008a). The explicit mention of the working relationship between NASA SSC and MBNEP in the Work Plan identifies the value of this collaboration to the end-users."}, {"section_title": "Methods", "text": ""}, {"section_title": "LULC Product Generation", "text": "Target dates for NASA-generated LULC products for Mobile Bay (herein, MB-LULC) were determined using two criteria: 1) Correspondence with pre-existing federal agency land-use and land-cover classification products (National Wetlands Inventory, NWI; National Land Cover Database, NLCD; and Coastal Change Analysis Program, C-CAP); and 2) End-user's requirements. Figure 2 shows a timeline indicating the MB-LULC products, hurricanes that most significantly impacted the Mobile Bay region, and the major pre-existing, nationally sponsored, LULC products for this region. Multiple scenes of Landsat data were acquired for generating single date LULC classifications across the entire scene of acquired data according to the dates shown in Figure 2 : 1974: , 1979: , 1984: , 1988: , 1991: , 1996: , 2001, and 2008 (Table 1). The study area was located within path 21 and row 39 for the WRS-2 system that is used with most Landsat data. For the Landsat MSS (Multispectral Scanner) data, the WRS-1 system was used and our study region was found within path 22 and row 39. Landsat MSS data was acquired for three dates, Landsat TM (Thematic Mapper) for five dates, and Landsat ETM (Enhanced Thematic Mapper) for one date (Table 1). The MSS data used in subsequent classification consisted of four bands, including one green band and red band and 2 NIR (near infrared) bands. The TM and ETM data used in classification consisted of blue, green, red, NIR (near infrared), and 2 SWIR (short wavelength infrared) bands. The thermal band of Landsat TM and ETM data was not utilized, due to its lower spatial resolution.  The nine Landsat scenes were co-registered to a \"master\" ortho-rectified Landsat scene acquired 26 September 1991. The ortho-rectified scene data set was produced and acquired through the NASA Scientific Data Purchase program. Geo-corrected Landsat data was rescaled to planetary reflectance for computing NDVI (Normalized Difference Vegetation Index) data products. The latter were occasionally used as collateral data in evaluating and refining the LULC products. Geo-corrected raw data were utilized as the primary data source for producing our LULC products. Each LULC product was primarily based upon classification of one date of Landsat data using ERDAS Imagine for image processing and analysis. Classification was performed using a hybrid unsupervised/supervised approach. Initially, a given Landsat data set was subjected to unsupervised classification using ISODATA clustering with 20 total clusters, convergence set to 0.995 (on scale of 0 to 1), 100 iterations, and cluster means initialization along the principal axis. A description of the ISODATA algorithm described further in the ERDAS Field Guide (Leica Geosystems, 2005). The resulting classification was then recoded into water, forest-dominated land, and non-forest dominated land. This \"first cut\" classification was used to isolate raw data into two subsets of forest-dominated and non-forest dominated raw data, respectively. The two raw data subsets were subjected to unsupervised classification, clustering to 16 classes for the forest-dominated raw data and 20 cluster classes for the non-forested raw data. These cluster classes of the aforementioned classifications were described with respect to the LULC scheme. Some clusters pertained to multiple LULC categories. The raster attribute table for each classification was edited to include an attribute column for each LULC category. Table 2 shows the MB-LULC classes in relation to the C-CAP classification scheme. On a per-cluster class basis, we assigned a value of one to the attribute column for each LULC class when the cluster included that LULC category and we assigned a value of zero for each LULC class when the cluster class did not pertain to a given LULC class. Spatial models were constructed to produce binary masks of each targeted LULC class. C-CAP products were used to reduce classification confusion within certain targeted classes; in particular, urban, woody wetlands, and non-woody wetlands. C-CAP LULC data products for 1996, 2001 were recoded into the same seven classes as used in the aforementioned Landsat classifications. Images showing the maximum extent of urban, woody wetlands, and non-woody wetland LULC categories were computed from the union of the 1996, 2001, and 2005 extent of each applicable category. These masks were not completely mutually exclusive; additional editing was performed using a maximum value compositing approach to compute a discrete, thematic wall-to-wall refined classification. A spatial model was implemented to merge the individual classifications of LULC classes into a wallto-wall product. This model used a maximum value compositing technique in which certain LULC categories were weighted higher in order to reduce classification confusion -the weighting is given in Table 3. If needed, additional classification refinement was completed to reduce visible classification error. Such refinement usually was completed by reclassification of an identified problematic class, generally using raw data masking and cluster busting techniques described by Jensen (1996). Summary area tables were produced for each LULC classification (one for each targeted date). The classification products were also subset to derive additional products for watershed areas of interest ( Figure 2). LULC classification summary statistics were computed for the following watersheds of interest: D'Olive Bay, Three Mile Creek, Upper Fish River, Dog River, Fowl River, and Big Creek Lake. A subset of the study area in northern Mobile Bay was selected and utilized for demonstration purposes. "}, {"section_title": "LULC Change Detection", "text": "LULC change detection products were generated using standard GIS overlay analysis techniques. Our change detection approach involves comparison of two dates of LULC classifications. The LULC categories of the first date were recoded into values of 10, 20, 30, 40, 60, and 70, and the LULC categories of the end date retained the original class values of 1, 2, 3, 4, 5, 6, and 7. An additive overlay was computed by adding the two classification dates resulting in a change matrix image comprising 49 possible classes. This approach was implemented via a spatial model for several two date comparisons, shown in Table 4. To insure comparability between dates, only intersection areas were considered, using all of the dates of LULC products. LULC change detection products (Table 4) were produced for Mobile and Baldwin counties. Products highlighting the change since 1974 (the baseline, or first year of our study) were produced to better understand the magnitude of change through time. Decadal-scale change products were produced to understand the absolute magnitude of change on an approximate 10-year basis. We calculated decadal-scale change on the county and watershed scale: D'Olive Bay, Three Mile Creek, Fish River, Dog River, Fowl River, and Big Creek Lake.  1974 1979 1974 1984 1974 1984 1984 1996 1974 1988 1996 2008 1974 1991 1974 2008 1974 1996 1974 2001 1974 2005 1974 2008 \n"}, {"section_title": "Single Date LULC Map Accuracy Assessment", "text": "Product accuracy of Landsat-based, single date LULC maps was completed according to the following protocol. Locations on each date of classification were randomly sampled using a stratified random sampling approach in which the drawn sample per class was proportionally allocated according to class frequency. The randomly sampled locations were viewed on available digital reference data that included ground reference data, high resolution ortho-rectified aerial photography, high resolution multispectral and panchromatic satellite data displays (from QuickBird and Corona sensors), digital elevation model data (for wetland class assessment), and NWI wetland cover type data (for wetland class assessment). C-CAP and NLCD products were used for qualitative comparison in assessing map accuracy. Landsat false color composites \"RGBs\" were used as a reference in LULC map accuracy assessment. We performed spatial averaging of available high resolution aerial and satellite data products into moderate resolution resolutions of Landsat data (30 meter and 60 meter, respectively) to understand the effects of spatial resolution on the appearance of LULC on multispectral imagery. Map accuracy assessment was also performed for C-CAP products to cross-compare Landsat LULC products from this study to those generated from C-CAP. C-CAP products are generated from multiple dates of Landsat data, whereas the products from our study are primarily generated from one Landsat data set per date. Accuracy statistics were summarized for several dates of LULC products: 1979LULC products: , 1996LULC products: , 2001LULC products: , 2005LULC products: , and 2008.\n"}, {"section_title": "Results and Discussion", "text": ""}, {"section_title": "Mobile and Baldwin Counties", "text": "Nine land-use and land-cover maps were produced showing the spatial distribution of seven landscape types in Mobile and Baldwin counties (Appendix I). Figure 3 shows the LULC products for 1974 (left) and 2008 (right), the temporal extremes of this project. The geospatial extent of each cover type for all data products are shown in Table 5. The most striking qualitative (visual) change between the LULC in 1974 and 2008 is the urban expansion around the City of Mobile and along the Eastern Shore. In the northeast portion of the study region, there has been a transition from upland forest to the upland herbaceous land-cover. However, Table 5 shows that the aforementioned land-cover transition has been temporally variable across the time series.  Percent coverage throughout the study period for Mobile and Baldwin counties for each landscape class is shown in Figure 4 and Table 6. Upland forest and open water are the most dominant LULC types, at around 30% throughout the study period; however, the open water class is more consistent through time. Upland forest and upland herbaceous are the most dynamic land-covers. These classes have an inverse relationship, thus suggesting that the two transition between each other. Because the data were computed for the entire study area (and no pixel-by-pixel time series was constructed), we are not able to conclude with certainty that individual parcels of land are alternating between upland herbaceous and upland forest, though this is a common phenomenon with respect to pine plantation forestry. The dynamism within the upland herbaceous and upland forest land-covers is most dramatic between 1974 and 1984. Both wetland classes, non-woody and woody, are fairly consistent through time. Between 1994 and 2008, there is a 0.17% reduction and a 0.45% increase of non-woody and woody wetlands, respectively. While the percentage loss and gain may seem trivial, it equates to a loss of 2395 acres of non-woody wetlands and a gain of 6488 acres of woody-wetlands. The scope of this project did not allow us to determine, at the land parcel level, if there is conversion between the two wetlands classes. However, we are able to conclude that between 1974 and 2008 there has been a net gain of 0.25%, or 4103 acres, for the two wetland classes. Table 7 shows the relationship between upland herbaceous and upland forest. Negative values indicate that there was land loss during the period and positive values indicate land gain. The inverse relationship is consistent, except between 1988-1991 where the change for both classes was minimal (about 0.20%). The exchange of land is almost (within 1%) one-to-one over the entire study region for four of the change intervals. A small portion (always <1.0%) of the study region is barren land. This LULC classification includes bare sand (beaches), which are mostly found on Dauphin Island, Pelican Island, and Gulf Shores. This landcover is affected by beach re-nourishment efforts and the removal of beaches post-Katrina, for example. The urban landscape is consistently expanding, growing from 5.59% in 1974 to 8.88% in 2008. Additional geospatial products depicting urban land cover change is found in Appendix I and II.    1974-1979 1979-1984 1984-1988 1988-1991 1991-1996 1996-2001 2001-2005 2005-2008  Land-use and land-cover change over time since 1974 (see Table 4) is shown in Figure 5 and Table 8. On Figure 5, the x-axis data points represent the latter extreme of temporal change -so 1979 represents change from 1974 to 1979 and 1984 represents change from 1979 to 1984. Positive values indicate an increase in percent land-use or land-cover since 1974 and negative values indicate a reduction in percent land-use or land-cover loss. One would speculate that largest percent changes should occur when considering the longest period of time (i.e., the 2008 data point which represents change between 1974 and 2008); however the largest variances occurred from 1974-1996, followed by 1974-1979.    1974 1974-1979 1974-1984 1974-1988 1974-1991 1974-1996 1974-2001 1974-2005 1974-2008  Land-use and land-cover geospatial statistics for Mobile and Baldwin counties on a decadal time scale (1974-1988; 1984-1996; 1996-2008) and over the 34-year study period  is shown in Table 9. Figure 6 shows these data graphically for the decadal time steps, and does not include those data for the entire study period. The data shown in Table 9 and Figure 6 reinforce that absolute change over time is quite minimal (around 1%), except for the upland herbaceous and upland forest classes. However, when landscapes only comprise a small percentage of the total (urban, non-woody wetland, and barren each average <10%) small percentage change actually represents a large relative change. As stated above in the discussion of wetlands, minimal change over Mobile and Baldwin counties equates to about 145,000 acres, which maybe more significant when planning restoration/conservation efforts.  (1974-1988; 1984-1996; 1996-2008) and for the 34-year study period is provided. 1974-1984 1984-1996 1996-2008 1974-2008 1974-1984 1984-1996 1996-2008 1974-2008 Open  Figure 6. Decadal land-use and land-cover change for Mobile and Baldwin counties."}, {"section_title": "Class Change (acres) Percent Change", "text": "An alternative method to represent LULC data is to normalize change in each class to the baseline (1974). Figure 7 shows this analysis for all landscapes except barren. The relatively small absolute change for wetlands, discussed above, that considered each LULC classification percent relative to all classifications, are now larger. For example, the urban landscape is consistently increases through time. There is an approximate 30% increase in urban land-cover between 1974 and 1979, with that change increasing to almost 60% when considering the entire time series. We are also able to better appreciate the fluctuations occurring for the non-woody wetlands.  1974and 1984. However, between 1984 there was a dramatic loss of urbanized areas and increase of upland forested land. The details of this transition, including the drivers for change, warrant more investigation.  (1974-1988; 1984-1996; 1996-2008) and for the 34-year study period is provided. 1974-1984 1984-1996 1996-2008 1974-2008 1974-1984 1984-1996 1996-2008 1974-2008 (1974-1988; 1984-1996; 1996-2008) and for the 34-year study period is provided. 1974-1984 1984-1996 1996-2008 1974-2008 1974-1984 1984-1996 1996-2008 1974-2008 (1974-1988; 1984-1996; 1996-2008) and for the 34-year study period is provided. 1974-1984 1984-1996 1996-2008 1974-2008 1974-1984 1984-1996 1996-2008 1974-2008 Figure 10. Decadal land-use and land-cover change for Upper Fish River. Table 13. Land-use and land-cover geospatial statistics for Dog River. Change on a decadal scale (1974-1988; 1984-1996; 1996-2008) and for the 34-year study period is provided. 1974-1984 1984-1996 1996-2008 1974-2008 1974-1984 1984-1996 1996-2008 1974-2008 Figure 11. Decadal land-use and land-cover change for Dog River. Table 14. Land-use and land-cover geospatial statistics for Fowl River. Change on a decadal scale (1974-1988; 1984-1996; 1996-2008) and for the 34-year study period is provided. 1974-1984 1984-1996 1996-2008 1974-2008 1974-1984 1984-1996 1996-2008 1974-2008 Figure 12. Decadal land-use and land-cover change for Fowl River.  (1974-1988; 1984-1996; 1996-2008) and for the 34-year study period is provided. 1974-1984 1984-1996 1996-2008 1974-2008 1974-1984 1984-1996 1996-2008 1974-2008 Open  Figure 13. Decadal land-use and land-cover change for Big Creek Lake.\n\n\n\n\n\n"}, {"section_title": "Urban Growth for Mobile and Baldwin Counties", "text": "Urban expansion in Mobile and Baldwin counties during the study period , and for the northern Mobile Bay demonstration region on a decadal time scale, is shown in Figures 14 and 15. Appendix II includes figures showing decadal-scale urban expansion for the watershed areas of interest. These satellite-based estimates indicate that during the 34-year study period urban areas increased from 80,972 to 128,662 acres, representing a 58.9% increase, or 1.73% per annum. The period from 1974 to 1984 shows the greatest expansion in the urban landscape (21428 acres, or 1.48%, c.f. Table 7). The urban expansion occurring from 1996 and 2008 was comparable to the expansion observed from 1974 to 1984 in absolute acres classified as urban; however the spatial distributions of the expansions appear to be quite different.   Table 16 shows the conversion of the land-use and land-cover classes to the urban landscape for Mobile and Baldwin counties between 1974 and 2008. In Table 16, the landscape listed to the left of the arrow indicates the landscape in 1974 that was converted to urban by 2008. This analysis is useful because we are able to determine which land types were most affected by the spreading urbanization. The data shown in Table 16 indicate that approximately 34% of the acres that were upland forest in 1974 were converted to urban by 2008. Upland herbaceous was the next most affected land-coverapproximately 7% of the baseline land-cover was converted to urban.   1979, 1996, 2001 The overall accuracy ranged from 83.13 (2005) to 89.33 (1979) and the Kappa values for these classifications ranged from 0.78 (2005) to 0.87 (1979). The sampling intensity for these assessments ranged from 150 (1979) to 190 (2008) total random samples per classification. In all cases, the overall accuracy exceeded 80% and the Kappa either approached or exceeded 0.8 (on a scale of 0 to 1). The use of Landsat MSS data (1979, at 60 m, rather than post 1984 at 30 m) did not seem to lower the accuracy. However, we acknowledge only one MSS product was assessed for accuracy and additional accuracy assessment is needed to assess further. Table 17. Overall accuracy of 1979Overall accuracy of , 1996Overall accuracy of , 2001Overall accuracy of , 2005Overall accuracy of , and 2005  Accuracy assessment was completed for the 2005 C-CAP product produced prior to Hurricane Katrina. The 2005 C-CAP classification yielded an overall accuracy of 86.25% compared to the 2005 Landsat result of 83.13% overall accuracy. The C-CAP product produced a higher overall Kappa value of 0.83 compared to the Landsat result of 0.78. The C-CAP and the Landsat classification were both assessed using 160 randomly sampled points. The higher relative accuracy of the C-CAP product was expected, in part due to C-CAP employing multiple Landsat dates to produce the classification, and in part due to the C-CAP process being more labor and resource intensive. The 2005 Landsat product was one of the first ones produced in this study, which may also partially help explain its lower accuracy. However, even as is, the overall accuracy of all of the non-C-CAP products appears to be acceptable.  1984Urban 1984-1996Growth 1996Urban 1996-2008Growth 1974Urban 1974-2008 Growth  1974-1984 "}]