[{"section_title": "Abstract", "text": "Abstract-The prominent morphometric alterations of Alzheimer's disease (AD) occur both in gray matter and in white matter. Multimodal fusion can examine joint information by combining multiple neuroimaging datasets to identify the covariant morphometric alterations in AD in greater detail. In the current study, we conducted a multimodal canonical correlation analysis and joint independent component analysis to identify the covariance patterns of the gray and white matter by fusing structural magnetic resonance imaging and diffusion tensor imaging data of 39 AD patients (23 males and 16 females, mean age: 74.91 ± 8.13 years) and 41 normal controls (NCs) (20 males and 21 females, mean age: 73.97 ± 6.34 years) derived from the Alzheimer's Disease Neuroimaging Initiative database. The results revealed 25 joint independent components (ICs), of which three joint ICs exhibited strong links between the gray matter volume and the white matter fractional anisotropy (FA) and significant differences between the AD and NC group. The joint IC maps revealed that the simultaneous changes in the gray matter and FA values primarily involved the following areas: (1) the temporal lobe/ hippocampus-cingulum, (2) the frontal/cingulate gyruscorpus callosum, and (3) the temporal/occipital/parietal lobe-corpus callosum/corona radiata. Our findings suggest that gray matter atrophy is associated with reduced white matter fiber integrity in AD and possibly expand the understanding of the neuropathological mechanisms in AD."}, {"section_title": "INTRODUCTION", "text": "Alzheimer's disease (AD) is a common progressive neurodegenerative disease that is clinically characterized by cognitive impairments, such as declines in memory (Cummings et al., 1998; Dartigues, 2009) . The prominent morphological alterations of AD occur both in gray matter and in white matter. Using structural magnetic resonance imaging (MRI), numerous studies have identified gray matter volume reductions that primarily occur in the medial temporal structures, the insular, the thalamus, cingulate areas, and the parietal and frontal areas (Baron et al., 2001; Frisoni et al., 2002; Zhang et al., 2009; Yang et al., 2012; Margarida Matos et al., 2013) ; for review, see (Frisoni et al., 2010; Yang et al., 2012) . The decreases in white matter volume primarily occur in the corpus callosum, the cingulum, the parahippocampal, the uncinated fasciculus, the superior longitudinal fasciculus, the frontal lobe and the temporal lobe in AD patients compared to normal controls (NCs) (Salat et al., 2009; Yoon et al., 2011; Li et al., 2012a) .\nMultiple diffusion tensor imaging (DTI) indices, such as fractional anisotropy (FA), radial diffusivity, axial diffusivity and mean diffusivity, can detect abnormalities in the white matter fibers in AD (Oishi et al., 2011; Shu et al., 2011; Bosch et al., 2012; Li et al., 2012b; Kincses et al., 2013) . Among these indices, FA, which represents the degree of anisotropy of water diffusion, is one of the most important parameters that are commonly used to characterize the microstructural characteristics of white matter fibers in AD (Medina et al., 2006; Zhang et al., 2009; Liu et al., 2011; Oishi et al., 2011) . FA is sensitive to white matter integrity and most probably reflects changes in white matter integrity but could not always provide specifically such measure for all circumstances http://dx.doi.org/10.1016/j.neuroscience.2015.06.031 0306-4522/Ó 2015 IBRO. Published by Elsevier Ltd. All rights reserved. * Correspondence to: X. Guo, College of Information Science and Technology, Beijing Normal University, No. 19, XinJieKouWai Street, HaiDian District, Beijing, China. Tel: +86-10-58800427; fax: +86-10-58800056. E-mail address: gxj@bnu.edu.cn (X. Guo) .\nData used in preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (adni. loni.usc.edu). As such, the investigators within the ADNI contributed to the design and implementation of ADNI and/or provided data but did not participate in analysis or writing of this report. A complete listing of ADNI investigators can be found at: http://adni.loni.usc.edu/ wp-content/uploads/how_to_apply/ADNI_Acknowledgement_List.pdf. Abbreviations: AD, Alzheimer's disease; BN, Bayesian network; CDR, Clinical Dementia Rating; DARTEL, diffeomorphic anatomical registration using exponential lie algebra; DMN, default mode network; DTI, diffusion tensor imaging; FA, fractional anisotropy; FWHM, full-width at half-maximum; ICs, independent components; jICA, joint independent component analysis; mCCA, multimodal canonical correlation analysis; MCI, mild cognitive impairment; MDL, minimum description length; MRI, magnetic resonance imaging; NCs, normal controls; PCA, principal component analysis; PLS, partial least squares; SEM, structural equation modeling; SSM, scaled subprofile modeling; TBSS, tract-based spatial statistics.\nNeuroscience 301 (2015) 553-562 (Jones et al., 2013) . Earlier DTI studies have applied univariate methods that focus on differences in the FA and found significant FA reductions that involved the majority of white matter tracts, including the body, genu and splenium of the corpus callosum, the cingulum, the superior longitudinal fasciculus and the corona radiata (Zhang et al., 2009; Oishi et al., 2011; Shu et al., 2011) ; for review, see (Chua et al., 2008; Oishi et al., 2011; Clerx et al., 2012; Amlien and Fjell, 2014) .\nStructural MRI can be used to examine changes in gray matter, and DTI can detect the diffusion characteristics that reflect the connectivity of white matter fibers. Most of the previously published studies only utilized one imaging modality and used univariate approaches such as region of interest, voxel-based morphometry (VBM) or tract-based spatial statistics (TBSS) to analyze structural MRI or DTI data. More recently, a number of studies employed different imaging modalities but analyzed each imaging dataset separately to investigate the fundamental pathology of AD (Wang et al., 2013; Balachandar et al., 2014; Racine et al., 2014) . In contrast, multimodal fusion methods can extract simultaneous information by combining multiple neuroimaging datasets into one joint analysis to better identify the hidden covariant relationships among multiple morphological measurements in AD. To date, few studies have applied multimodal fusion approaches to explore the covariant morphological differences between AD and NCs (Guo et al., 2012; Kincses et al., 2013; Teipel et al., 2014) . However, these published studies only focused on the different indices of one modality. The combination of structural MRI and DTI can effectively provide information about the covariance patterns of gray matter volume and white matter FA that are associated with AD.\nThe combination of multimodal canonical correlation analysis (mCCA) and joint independent component analysis (jICA) is a user-independent data-driven approach that was proposed by Sui et al. (2011) . MCCA and jICA feature the advantages of both mCCA and jICA as well as flexible model association and source separation . MCCA can be used to examine the intersubject covariation across the two imaging modalities by providing a linear mixing model (Correa et al., 2008) . JICA is an extension of ICA that fuses different neuroimaging datasets from the same subject and then decomposes the linear mixing signals into maximally joint independent components (ICs) and examines the inter-subject covariances and the between-group differences (Calhoun et al., 2006) . Different from the multi-modal techniques, multivariate but single-modal techniques such as scaled subprofile modeling (SSM) can only identify the uncorrelated sources based on single modal imaging data. MCCA and jICA have been validated and applied to identify the structural and functional abnormalities in the brain patterns of patients with schizophrenia (Sui et al., , 2012b . The results showed that the mCCA and jICA method is effective to find the function-structure correlation via the strong connection between joint components of the two modalities ).\nIn the current study, we performed mCCA and jICA to identify the covariance patterns of the gray and white matter by fusing the structural MRI and DTI data of AD patients and NCs derived from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database. The Principal Investigator of this initiative is Michael W. Weiner, MD, VA Medical Center and University of California -San Francisco. ADNI is the result of efforts of many co-investigators from a broad range of academic institutions and private corporations, and subjects have been recruited from over 50 sites across the U.S. and Canada. The initial goal of ADNI was to recruit 800 subjects but ADNI has been followed by ADNI-GO and ADNI-2. To date these three protocols have recruited over 1500 adults, ages 55-90, to participate in the research, consisting of cognitively normal older individuals, people with early or late MCI, and people with early AD. The follow-up duration of each group is specified in the protocols for ADNI-1, ADNI-2 and ADNI-GO. Subjects originally recruited for ADNI-1 and ADNI-GO had the option to be followed in ADNI-2. For up-to-date information, see www.adni-info. org."}, {"section_title": "EXPERIMENTAL PROCEDURES", "text": ""}, {"section_title": "Subjects", "text": "All participants were obtained from the ADNI database. According to the ADNI protocols, AD was diagnosed based on the National Institute of Neurological and Communicative Disorders and Stroke/Alzheimer's Disease and Related Disorders Association (NINCDS/ADRDA) criteria, and the severity of cognitive impairment was assessed based on the Mini-Mental State Examination (MMSE) (Folstein et al., 1975) and Clinical Dementia Rating (CDR) (Morris, 1993) scores. To minimize the effect of the scanner systems, we added the constraint that the Structural MRI and DTI data should be acquired on 3T GE Medical Systems scanners. This study included 39 AD patients (23 males and 16 females, mean age: 74.91 ± 8.13 years, range: 60-90; mean MMSE: 22.87 ± 2.32, range:18-27; CDR: 0.5 or 1) and 41 NCs (20 males and 21 females, mean age:\n73.97 ± 6.34 years, range: 60-90; mean MMSE: 29.07 ± 0.96, range: 27-30; CDR: 0). The sexes and ages of the AD group and NC group were matched, and the sex ratio and age did not significantly differ v 2 ð1Þ ¼ 0:836; p ¼ 0:361 and t (78) = 0.575, p = 0.567, respectively); however, the MMSE scores of the AD group were significantly lower (t (78) = À15.768, p = 5.693eÀ026). The sample descriptions are presented in Table 1 .\nThe ADNI study was approved by the Institutional Review Boards (IRBs) of each participating site and was conducted in accordance with Federal Regulations, the Internal Conference on Harmonization (ICH) and Good Clinical Practices (GCP). The study subjects provided written informed consent at the time of enrollment for imaging and completed questionnaires that were approved by each participating site's IRB."}, {"section_title": "Structural MRI data acquisition", "text": "All structural MRI scans were acquired with 3T GE Medical Systems scanners. The scanning parameters of T1-weighted 3D anatomical imaging data were defined as follows: pulse sequence = GR; matrix size = 256 Â 256; voxel size = 1.0 Â 1.0 mm 2 ; flip angle = 11°; slice thickness = 1.2 mm; number of slices = 196. The other parameters such as TE/TR differed across scanning sites. Additionally, the images had undergone preprocessing including non-uniformity correction and gradwarp correction to avoid the possible differences among different scans according to the ADNI protocol (http://www.loni.ucla.edu/ADNI/Data/ADNI_Data.shtml)."}, {"section_title": "DTI data acquisition", "text": "For each subject, high-resolution DTI scans were acquired on 3T GE Medical Systems scanners. The scans were collected according to the standard ADNI MRI protocol. The following parameters were used: pulse sequence = EP/SE; matrix size = 256 Â 256; voxel size = 1.4 Â 1.4 mm 2 ; flip angle = 90°; slice thickness = 2.7 mm; number of slices = 59; gradient directions = 41 (b = 1000 s/mm 2 ) and five acquisitions without diffusion weighting (b = 0 s/mm 2 ). The other parameters such as TE/TR differed across scanning sites."}, {"section_title": "Structural MRI data preprocessing", "text": "The structural MRI data were preprocessed using the VBM8 Toolbox (http://dbm.neuro.uni-jena.de/vbm8) in Statistical Parametric Mapping (SPM8, http://www.fil.ion. ucl.ac.uk/spm). This process primarily consisted of segmentation and normalization. First, each subject's MRI data were segmented into gray matter, white matter and cerebrospinal fluid (CSF) images using adaptive maximum a posteriori (MAP) (Rajapakse et al., 1997) and partial volume estimations (PVE) (Tohka et al., 2004) . Subsequently, the diffeomorphic anatomical registration using exponential lie algebra (DARTEL) (Ashburner, 2007) was applied to normalize the gray matter images and iteratively create the template. A singleconstant velocity field was used in the DARTEL to generate the diffeomorphic and invertible deformations. The subjects' gray matter images were registered to new templates for each iteration. Next, the normalized gray matter images were multiplied by the Jacobian determinants from the nonlinear deformations to preserve the absolute volume of gray matter in the subjects' native spaces. Finally, all gray matter images were smoothed with an 8-mm full-width at half-maximum (FWHM) Gaussian kernel and entered into the mCCA and jICA procedure."}, {"section_title": "DTI data preprocessing and TBSS", "text": "The DTI data were preprocessed in the FMRIB's Software Library (FSL) software (FSL 5.0, http://www.fmrib.ox.ac. uk/fsl). After correcting the eddy current and head motion with the affine registrations of each subject's diffusion-weighted images to the non-diffusion-weighted images in the FMRIB's Diffusion Toolbox (FDT) 2.0, the non-brain structures were removed using the Brain Extraction Tool, and the FA maps were generated based on the diffusion tensors reconstructed with the DTIfit program. Next, the TBSS (Smith et al., 2006 (Smith et al., , 2007 procedure was implemented on all subjects' FA images to obtain the FA skeleton images. First, each subject's FA image was nonlinearly normalized to the MNI space. Second, the mean FA image was calculated and thinned to create the mean FA skeleton image (FA > 0.2), which represents the center of the white matter tract. Third, each subject's aligned FA image was projected onto the mean FA skeleton image by calculating the maximum FA values from the nearest tract center and filling the corresponding position in the skeleton. Finally, all subjects' skeletonized FA images were calculated in the standard 1 Â 1 Â 1 mm 3 MNI152 atlas space, smoothed with a 4-mm FWHM Gaussian kernel, and then entered into the mCCA and jICA procedure."}, {"section_title": "Multimodal CCA and joint ICA", "text": "The mCCA and jICA were performed for the multivariate analysis in the Fusion ICA toolbox (FIT v2.0c; http:// icatb.sourceforge.net). Each subject's gray matter volume image and skeletonized FA image was separately converted to a one-dimensional row vector. The initial data matrix was formed by arraying 39 gray matter volume and FA vectors of AD and 41 gray matter and FA vectors of NCs into an 80-row subjects by voxels matrix. A minimum description length (MDL) criterion was used to estimate the number of ICs for each dataset and dimension reduction was performed using the singular value decomposition (SVD) of the initial data matrix (Li et al., 2007) . Second, mCCA was performed on the dimensionally reduced matrix to obtain the canonical variants matrix (D1/D2) and the associated components matrix (C1/C2) for each modality. The jICA based on the Infomax algorithm was then applied to the associated components matrix ([C1,C2] ) to obtain the maximized joint independence components ([S1,S2]) (the joint source matrix (sources by voxels)) and the mixing coefficient matrix of the jICA (W À1 ) (subjects by sources). The final mixing coefficient matrixes were calculated by obtaining the product of the canonical variants matrix and the mixing coefficient matrix of the jICA (D1 Â W À1 for gray matter (GM), D2 Â W À1 for FA), which represent the source differences between the AD and NC group for each modality, respectively. Fig. 1 shows the of flowchart mCCA and jICA procedure."}, {"section_title": "Statistical analyses", "text": "We performed a two-sample t-test on the column of the mixing coefficient matrixes of the jICA to compare the differences between AD/NC groups (p < 0.001, Bonferroni correction) (Bland and Altman, 1995) . The significant joint sources (the row of the joint source matrix) were converted to units of standard deviations (Z-scores) and then reshaped to two 3D brain maps (gray matter regions and white matter regions). We set the threshold at Z P 3 to reflect the statistically significant ICs of the gray matter covariant patterns and a threshold of Z P 2 to reflect the statistically significant ICs of the white matter covariant patterns.\nTo statistically characterize the sensitivity and specificity (Wu et al., 2013) , a multivariate receiver operating characteristic (multiV-ROC) was applied to the combination of the two indices (i.e., the mixing coefficient matrixes) for each joint independent component (joint IC): First, a logistic regression was applied on the ICA weights of gray matter and white matter in one component to calculate a column of predicted value. Then, the predicted values entered the ROC procedure. Additionally, Pearson's correlation coefficients were calculated between the subjects' MMSE scores and each column of the predicted values of the joint ICs."}, {"section_title": "RESULTS", "text": "Twenty-five joint ICs were extracted according to the MDL criterion, and a two-sample t-test with Bonferroni correction on each column of these mixing coefficients revealed significant differences between the AD patients and the NCs in the jICA weights for three interpretable ICs. These three significant joint ICs also exhibited strong correlations (r > 0.6) between gray matter volumes and white matter FA values.\nFigs. 2-4 illustrate the spatial maps of the joint covariant reductions of the gray matter volumes (left) and the FA values (right) in the AD patients compared to the NCs for three joint ICs. The middle panels show the corresponding scatter-plots of the mixing coefficient differences between the AD patients and the NCs. The positively weighted coefficients in the joint IC spatial maps illustrate decreases in the gray matter volumes and FA values in the AD patients compared to the NCs.\nFor joint IC 1, the gray matter atrophy occurred mainly in the superior/middle/inferior temporal gyri, parahippocampal area and the hippocampus, and the FA value generally decreased in the cingulum (hippocampus, Fig. 2 ). For joint IC 2, the gray matter volume reductions occurred in the superior/middle/inferior frontal gyri, whereas the FA reductions occurred mainly of the genu and body of the corpus callosum, cingulum (cingulate gyrus), external capsule and superior longitudinal fasciculus (Fig. 3) . Regarding joint IC 3, the decreases in the gray matter volumes primarily involved the middle occipital gyrus, middle temporal gyrus, and precuneus, and the FA reductions predominantly included the body/splenium of the corpus callosum (Fig. 4) . Table 2 shows the locations of the covariant decreases in the gray matter volume and white matter FA in the AD patients compared to the NCs for joint ICs 1-3. We used the AAL mask in the WFU_PickAtlas toolbox for gray matter regions and the ICBM DTI-81 Atlas in the FSL toolbox for white matter regions when we obtained the MNI coordinates and cluster size. Table 3 shows the correlation coefficients between the gray matter volumes and white matter FAs and the multiV-ROC results for the mixing coefficients of the two modalities for each joint IC. Pearson's correlation coefficients between the subjects' MMSE scores and the predicted values of the joint ICs were À0.746 (p = 2.01eÀ15), À0.632 (p = 3.10eÀ10) and À0.651 (p = 6.54eÀ11), respectively for joint IC 1, 2 and 3."}, {"section_title": "DISCUSSION", "text": "In the current study, we performed mCCA and jICA, an effective multimodal fusion approach, on structural MRI and DTI data from both AD patients and NCs to investigate the shared alterations in the gray and white matter associated with AD. The priori hypothesis about what regions (based on the existing literatures) are involved in AD was also considered in the proper selection of the relevant ICs. We found that three significant joint ICs revealed atrophy in the gray matter volumes and decreases in the white matter FA values in the AD patients compared to the NCs. Additionally, the multiV-ROC analysis revealed the high sensitivity and specificity of the discrimination.\nFor joint IC 1, the reduction in gray matter volume occurred mainly in the temporal lobe, particularly the hippocampus and parahippocampal gyrus, which generally agrees with previous reports (Frisoni et al., 2002; Guo et al., 2010 Guo et al., , 2012 . The majority of the FA decreases were located in the cingulum (hippocampus), which coincides with the findings of most DTI studies of AD Guo et al., 2012) . Killiany et al. found that AD patients with only mild symptoms show significant atrophy in the temporal lobe (Killiany et al., 1993) matter volume atrophy in the hippocampus and white matter volume atrophy in the parahippocampal gyrus lead to memory declines in people with MCI (Stoub et al., 2006) , which implies that gray matter volume atrophy in the hippocampus could be considered one of the most valuable biomarkers for the diagnosis of AD (Stoub et al., 2006; Guo et al., 2012) . The white matter fibers in the cingulum connect the prefrontal lobes to the posterior cortices, including the hippocampal formation (Bu¨rgel et al., 2006) . Villain et al. also found that hippocampal atrophy is related to the cingulum bundle (Villain et al., 2008) . These findings suggest that the reduced fiber integrity of the white matter in the cingulum (hippocampus) may also affect the gray matter reduction observed in joint IC 1, particularly in the hippocampus, and thus lead to memory impairment in AD.\nRegarding joint IC 2, the majority of the reductions in the gray matter volume were found in the frontal lobe and the anterior cingulate gyrus, which agrees with the findings of previous studies (Frisoni et al., 2002; Ha¨ma¨la¨inen et al., 2007; Guo et al., 2010 Guo et al., , 2012 ; however, the reduction in FA primarily involved the genu and body of the corpus callosum (Zhang et al., 2009; Guo et al., 2012) . The regions found in joint IC 2 primarily agree with a report by Guo et al.; who detected gray/white matter volume differences by performing joint ICA to construct covariant networks. They found gray matter volume reductions in the frontal lobe, cingulate gyrus, hippocampus and parahippocampal gyrus as well as white matter volume covariant decreases in the related superior longitudinal fasciculus, corpus callosum and corona radiata (Guo et al., 2012) . The genu of the corpus callosum has been found to connect the left and right prefrontal cortical regions (van den Heuvel et al., 2009) , and the gray matter reductions observed in the frontal lobes of AD patients primarily occur in the anterior frontal lobe (Whitwell et al., 2007) . Moreover, the corpus callosum, which connects the hemispheres, has been reported to play a vital role in higher order cognitive functions (Schulte and Mu¨ller-Oehring, 2010; Li et al., 2012a) , and the majority of the corpus callosum exhibited reduced integrity of white matter regions in the current study. The above reports suggest that the weakened integrity of the white matter fibers in the corpus callosum might be associated with the atrophy of the gray matter regions and thus might influence functional networks and affect the cognitive abilities of AD patients.\nRegarding joint IC 3, the reductions in the gray matter volumes primarily involved the occipital/temporal/parie tal/frontal lobes, the precuneus, the angular and posterior cingulate gyri; these results are similar to those reported in previous studies (Guo et al., 2010 (Guo et al., , 2012 . The FA reductions predominantly involved the body/splenium of the corpus callosum and the corona radiate, which agrees with previously published studies of white matter in AD Oishi et al., 2011; Li et al., 2012a; Kincses et al., 2013) . Chaim et al. reported that the atrophy of the splenium of the corpus callosum can reflect neuronal loss in the parietotemporal neocortical regions (Chaim et al., 2007) , which indicates that abnormal white matter fibers in the corpus callosum might have influenced the gray matter in joint IC 3. More importantly, most of the gray matter regions that were involved in joint IC 3 are associated with the default mode network (DMN), and the white matter fibers in the corpus callosum and corona radiate are essential for connecting the regions of the DMN (Luo et al., 2012) . Additionally, Rombouts et al. found that altered activity in the DMN represents a potential early biomarker of AD pathology (Rombouts et al., 2005) , which suggests that the structural covariance patterns of joint IC 3 might be associated with the DMN in AD.\nJoint IC 1 had the significant statistical power (p = 4.46eÀ12 for the gray matter volumes and p = 1.55eÀ10 for the white matter FA values) in the between-group comparisons. Moreover, the gray matter volume and FA value in joint IC 1 were the most relevant (r = 0.708) among the three joint components. The gray matter volume and white matter FA value also exhibited greater relevance for joint IC 2 (r = 0.682) and joint IC 3 (r = 0.636). The multiV-ROC analysis revealed discriminabilities with 89.7% sensitivity and 90.2% specificity for joint IC 1, 87.2% sensitivity and 75.6% specificity for joint IC 2 and 74.4% sensitivity and 90.2% specificity for joint IC 3. Multivariate jICA is available to examine the correlation of the neuropsychological scores or other scores and the expression of joint ICs. The subjects' MMSE scores and the predicted values of the joint ICs were significantly correlated for three joint ICs. Each joint IC might reflect a different aspect of the pathological abnormalities in AD, and these joint ICs might serve as potential biomarkers for the prediction of AD pathology. We found four significant ones out of the twenty-five joint ICs with Bonferroni multiple comparisons for a twosample t-test. We noted the existence of additional one significant joint IC with scattered spatial distributions primarily involving the periventricular regions. Like many multivariate techniques, the proper selection of IC components is always a problem in the ICA-related literatures (Xu et al., 2009; Caprihan et al., 2011) . To examine the consistency and stability of three significant joint sources reported in our study, we evaluated the results in different number of ICs (the number of ICs is more or less than 25 including 21, 23, 27 and 29) and confirmed that these three joint sources are significant and consistently exist in varying IC numbers.\nOther multivariate techniques investigating for the covariant patterns include Bayesian network (BN), structural equation modeling (SEM), SSM and partial least squares (PLS). The first three methods can only analyze single modal imaging data. BN and SEM are for effective connectivity in the fMRI literature. SSM is based on a modified principal component analysis (PCA). PLS has the feature of PCA and regression analysis and form a latent variable that maximizes the covariance among multi-modal imaging data (McIntosh and Lobaugh, 2004) . The sources identified by SSM or PLS are uncorrelated, but those identified by ICA are independent. Moreover, jICA, as an extension of ICA, can combine two neuroimaging datasets to find joint sources. Regarding the methodology we adopted herein, the combination of mCCA and jICA is an effective multimodal fusion method that allowed us to detect the source components that improved the identification of the covariant patterns of the brain. Sui et al. applied this method to fuse fMRI and DTI data in order to discriminate the different morphological abnormalities of the brain patterns of patients with schizophrenia and bipolar disorder . Additionally, jICA assumes that all modalities have the common mixing matrix. CCA can maximize the correlation in two datasets. Combining mCCA and jICA better estimates the source and mixing matrices to obtain higher and even weaker correlation within joint sources than does mCCA or jICA alone (Sui et al., 2012a) . Sui et al. also reported that this method is flexible and can be applied to three or more imaging modalities by extending the multi-modal CCA to a multi-set CCA (Sui et al., 2012b ).\nIn the current study, all data were from ADNI. ADNI has already performed some MRI image corrections to make quality assurance. We performed a two-sample t-test to examine between-group differences in head motion parameters for DTI data. The results showed that most head motion measures did not significantly differ between the AD group and NC group with multiple comparison corrections (All ps P 0.024). The spatial preprocessing steps of structural MRI and DTI reduced the positional difference between individual image and the template, and the effect of head motion to a lesser extent in this study. The effect of head motion was investigated in several univariate studies (Yendiki et al., 2014; Reuter et al., 2015) , and such potential effect should also be considered in the future multivariate study. In addition, we considered data from two modalities, only focusing on structural or morphological differences in AD. In fact, functional MRI can provide useful information for our understanding of the neuropathological mechanisms of AD. With the use of multi-set CCA (Sui et al., 2012b) in place of mCCA, it becomes possible to investigate simultaneous differences in gray matter volumes, white matter integrity and functional connectivity for more comprehensive grasp of multi-aspects of AD. Lastly, we are interested in applying the same technique to MCI, a preclinical prior to the onset of AD to investigate the predictability for the progression to AD with possible increased statistical power.\nIn summary, we performed mCCA and jICA to identify the covariances of gray matter and white matter that were associated with AD. The mCCA and jICA method for creating gray matter volume maps and FA value maps effectively detects the underlying gray matter atrophies that are associated with white matter connectivity in the corresponding brain areas. The results of this study predominantly correspond to those of earlier studies, which suggest that our findings are reliable. These findings could elucidate the neuropathological mechanisms of AD from a covariance patterns perspective.\nData collection and sharing for this project was funded by the Alzheimer's Disease Neuroimaging Initiative (ADNI) (National Institutes of Health Grant U01 AG024904) and DOD ADNI (Department of Defense award number W81XWH-12-2-0012). "}]