[{"section_title": "", "text": "were two girls, aged about nine and eleven, named Mary and Dorcas. Tbey attended a very common sehool, walking a distance of nearly six miles a day to do so, but as the older ones had never had as good an opportunity they considered themselves fortunate and already had glowing hopes of some time becoming teaebers. The youngest two were boys of seven ¿nd five, named George and Jobn.\nFor a time after tbe motlier's deatb they tried to keep on as they were, but crops failed and the father became diseouraged and finally bound out tbe youngest four ebildren. The two young girls seemed for a time to be doing well, but George, the seven-year-old boy, was with two maiden ladies of uncertain age who though well enougb off were very grasping, and tbougbt all .\n•I boy was for was to work bard and take all tbe scolding their hardened natures could lieap upon him; but really a girl was treated about tbe same for tbey bad a niece living witb them who fared but little better. Another thing deep set in tbese old ladies' minds was that young people should not eat mueh, so ))oor little George was seldon satisfied unless I.,izzie, acting on the motto, \"God helps those wbo belp themselves,\" helped herself on the sly and frequently gave little George a hand-out.\nTbe youngest did not thrive under the treatment of liis foster ]»arents either, but for a couple of years bad to stay and bear wliat fell to his lot-But about tbis time Peter finished bis ap-]irentieeship and to celebrate tbe happy oeeasion went to visit his si.ster Sarah who bad gone out to work in a tavern. As sbe was a %\"ery capable eook and bousekeeper sbe bad secured a very good })laee. Tbe work was heavy, with time stolen off each end of the night for extra work, but she was to have tbe sum of fifty eents per week, and was to go to school four days a week and have the privilege of going to cburch or Sunday school on the Sabbatb. On Monday she stayed from sebool to do the heavy washing, while Saturday was tbe cleaning and baking day. I have heard liir tell of the midweek bread and j)ie baking whieh sill' aeeomplisbed by working late at nigbt and baving all ready for thf big briek oven wht-n shr would get up at an early bour in the morning.\nWben Peter visited her sbe went walking witb him instead of going to cburch and they talked of the younger brothers and sisters, and he planned to call on them and find out how they were getting along, a.s the fatlier was married again and would perhaps be forgetful of them. His calls revealed the troubles of little George and also how poorly baby John, now five years old, was eared for, so at his earliest opportunity lie again eonsuited Sarah and they decided to start housekeeping and take care of these boys, as they eould easily take them from the people by proving how they had been treated. But before their I)Ian had matured little George had run away from his place and found liis way to his brother Peter, a distanee of twenty miles, through rough, unbroken country, keeping away from public roads lest he be diseovered and taken back. He was so terrorized that he had a serious sick spell after finding his brother.\nThe small, poorly furnished home was soon started and Peter and Sarah worked to eare for their two young brotiiers, though they always said George helped witli the home as much as they, Peter was away early and late and George, now nine years old, did tJie chores or worked in the garden, and oeeasionally picked up a little cash by working for neighbors.\nJohn grew strong very rapidly and as he developed a taste for hooks and study lliey planned to give him the best edueation tfiey could, and they really gave liim a good start. By perseverance he acquired what learning he could in the poor schools of the country and wlicn quite a young man studied law.\nAll this time Peter and Sarah were living lives of deprivation and hard work, but happy in the thought that they were performing a sacred duty to the; best of their ability. The three sisters had been growing, and Harriet, the oldest, was soon to marry a nice young man with whom she had become acquainted in one of the homes where she sewed, as that was the way she supported herself. They were not possessed of lands or moneys, so made their plans accordingly, and after going to the humble home of Peter and Sarah where tlie marriage ceremony was performed, they climbed into a prairie schooner drawn by a yoke of oxen and taking Dorcas, one of the younger sisters, with them, started for Illinois where they could settle on government land, They were very young, but inured to hardship, and looked for nothing better than a few acres they could call their own. For some time they lived principally on wild game while the sale of the skins furnished a little money with which to buy a few necessary articles. They entered a tract of land and began lo break and cultivate it. At first they had only a few acres, but in that productive soil it responded abundantly. A garden helped to furnish the table.\nAll tliese long months since the brothers and sisters parted in Oliio not a word had they heard from eaeh other. Now the little settlement about ten miles from their home had begun to put on the air of a town, had a post office and some stores, and iiad been named Lewiston. Thither Frank and Harriet went in their prairie schooner drawn by the faitliful ox team that ïiad i)rought them to Illinois and done the work on the farm. While there they started a letter back to the dear ones in Ohio telling where they were located and liow they were prospering, but the letter never reached its destination. Mails were then carried by men on horseback through rough, unsettled country and many a poor mail carrier was drowned in a stream when trying to ford it, or killed hy Indians, or devoured by wild heasts.\nAt any rate when they made another trip three months iater they found no answer, but with true pioneer perseverance tliey started another. In tliose days stamps were not put on letters, but when one went to the post office and found a letter, or was notified that there was a letter awaiting him, he paid thirtyfive cents to get it. They waited anotiier two months, again made the long trip over the hazardous trail to the post office and were then rewarded by receiving the longed-for letter from home.\nPeter was married and Sarah was soon to be, and Sarah and luLsband were planning to come to Illinois and no doubt would settle near them and would bring witli them Mary, who had been sick, and so lost the home in which .she had worked and shared the small pittanec tite time.s allowed, since litr father bound her out. She was now thirteen. George was now knocking around from place to place taking care of himself. Peter would kcej) the youngest boy.\nWe have no knowledge of any more communications till Harriet and family, now numbering four, since the birth of a little daugiiter which they called Mary, were happily surprised by the arrival of Sarah and husband and sister Mary. And, strange to say, Iwth Harriet and Sarah had married men named Wileox, very distantly related. Time passed. The young couples worked hard on the farms, and the two younger sisters worked out for the scattered neighbors, as was a common custom among early settlers. Mary learned tailoring and so made good wages for those days. Dorcas married the son of a Mr, Leslie. The elder Mr. Leslie died soon after, leaving his mill in Bernadotte to the son. The burg never grew mueb, thougb well situated on Spoon River. Lutber Leslie did well in tbe mill as it was patronized by all tbe farmers for miles around. As lumber was in demand Mr. Leslie also started a sawmill.\nI cannot describe all of tbe ups and downs that life at this time served these four sisters, but they had the comfort of knowing they were doing as well as any in their vicinity, and they were situated so as to be eompany for each other. But things did not remain in this liappy state long, for Sarah's husband early devrloixd a tendency to (onsumi)tion and the hard work and exposure hastened the disease; so after about eight or nine years of married life Sarah was left a widow with one child, Adda Wilcox, She was thus left without help, and wrote to her brother George to come and live with her. He eame and in tbat way she was able to hold her fine acres which in after years made a lovely home.\nGeorge tilled the land and raised stock for a few years, then Sarah married again, this time to Mr. Franeis Overton who had been teacher of tbe district school ¡n Bornadotte for a term of years. In tlie meantime Mary had married a man by the name of Mclntosb who lived but a short time. I think he was drowneiî while loosening a jam of logs in the river near the sawmill. And now as Saraii had a husband to run her farm, George went to live with Mary and work for Jiis brotber-in-law, Luther Leslie, in t)ie mill. Now, though there had been sorrow of parting and death and bard work and bardships common to pioneer life, tbere were many Iiapjiy days and jolly incidents. Tbe following incident has caused many a laugh as I remember it told by my father, George Van Dorn, and his sister Sarah, when they were botb advaneed in life. During butebering time Mr. Overton and Sarah needed help, so George hooked up the oxen and with Mary went to their aid. Arriving there George turned the team loose to go and get water while be strolled into tbe cabin a few minutes. Wben be eame out to put tbe team in the slied to feed be found they had upset a large kettle of soft soap wbieli Sarab Jiad boiled and left to cool preparatory to putting in a barrel, and lie began to scream \"Ob! Sarab, your soap will kill my oxen,\" and sbe, running out, exclaimed imperatively, as sbe viewed tbe wreck, \"Wby ! George, your oxen have spilled all my soap.\" Eaeb tbougbt only of bis own misfortune. But tbe eattle did not die, as tiicy bad not swallowed any of tbe stuff, only lost some hair wbere it bad slopped on tbem, and mueb of tbe soap was saved, so botb Sarab and George were bappy tbat it was no worse.\nBut back to my narrative. Now Mrs. Mclntosb, or Mary, and George were living comfortably and bappily, both working and saving and planning for a farm bonie to be owned and eonducted in partnersbip. After some time tbey arranged tbat George go to Iowa wbere Harriet bad already gone to live at Fort Des Moines wbere ber Iiusband was employed in a government store. If George liked the country he was to pick out a elaim and go back for Mary and wliat movable possessions tbey bad. Accorditiglv he started out on horseback about tbc first of September, witb saddlebags well filled witb provisions, and witb an Indian lilaiiket for use on rainy days and cbilly nights.\nAfter nearly three weeks' travel through an almost uninhabited wilderness be reacbed Fort Des Moines. He visited Harriet and family and looked tbe country over, bat not until be started baek did be decide on a place some forty miles from tbere. Tben be bastened bome before, tbe beavy fall rains set in, whieb would make travel bard and the streams too bigb to ford. Neat the first of November he neared bis cabin home, bis mind filled with ])lans for the future prairie home and a pleasant trip thitbei in tbc spring time witb bis sister in tbe ox wagon containing tbeit bousebold possessions. But tbe cabin seemed rearranged and strangely eold, as if deserted. He repaired to tbe nearest neigbbor, a half mile distant, and tliere learned tbe sad fact tbat soon after be bad left Mary bad been stricken witb western fever and onlv survived a few days. So be was left sorrowing and diseouraged. After a few lonely dayis witb tbe otber sisters he loaded what he needed oí the househoM articles into his wagon. yoked tbe two teams of oxen to it, and started back to Iowa to be ready for early spring farming. After bidding farewell to the families of Sarah and Dorcas he started west over tbe long, lonely trail, his oxen, horse, and dog his only companions. For days be would not see a buman being, and then more likely a wigwam or tepee where dwelt Indians, then a cabin inhabited by pioneers. When possible be kept at a distance from Indian camps, but if they could not be avoided he would have something; to offer their chief as a gift and thus make friends with them. He had been wise enough to lay in a store, of pipes, tobaeco, bright blankfts, red handkerchiefs, beads, etc., and could easily trade such things for dried beef (jerk, tliey ealled it) and otber provisions. Several times he was foreed to camp near a settlement, rest the tfam.s, and secure a sup))ly of grain for them. In Ft hruary he reached Fort Des Moines where he stayed till time to tliink of spring work, tben moved on forty miles to his little cabin with an immense fireplace, wbicb was to be his lonely bome.\nSpring was so filled with work that there was no thought of neighbors, but as summer advaneed George began to wonder wbat manner of peo])lc tiiere migbt be living abont three miles from bim, and one day he rode over to see. Near the eabin were women, one small, delicate, tidy-looking, past middle age, was standing in ber garden in wliicb grew a few flowers as well as vegetables; tbe other a young girl, comely, with dark hair and eyes, was banging clothes on the line. He inquired fi)r tlu-man of the liouse and, finding be was away, informed the ladies he would eall again as he was their neighbor. He gave bis name, learned theirs was Mesinger, and went bis way. But the faee of the girl haunted him. She did not look in good health and he thought she resembled his beloved sister Mary, and he wondered if the sadness in the dark eyes was caused by ill health or loneliness.\nBefore he had nerved himself to make another eall, which was necessary as he wanted to get aequainted with Mr. Mesinger that they might plan the harvest work together, a great prairie fire broke out. Mrs. Mesinger saw when a long way off that it was eoming right towards tlieir plaee. She immediately put her young son Samuel on the riding horse (all early settlers kept one horse wbieb was used only for riding) and told him ' ' 287 to ride fast to their young neighbor for assistance. She and daughter Almeda began to back-fire, that Is burn a small streak around the buildings, whipping the fire out next to the buildings till a strip was wide enough that the approaching avalanche of flame could find no food for its fury, Tlie boy made good time, returned with George, and by the time Mr. Mesinger was back the buildings and stock were saved and those who fought fire together were good friends. As there was a small stream intervening George's place was not endangered. Now that the neighbor's fields were laid waste, George told Mr. Mesinger to eome and help him care for his crops and there would be enough for both. As the summer advanced they became intimate friends. As George was a good cook and housekeeper as well as farmer, they ate their meals at whichever liouse they chanced to be working at meal time.\nA cow at each plaee furnished her part, the two gardens were a great source of supply, a few chickens and wild game eontributed to the variety, and with the addition of some wild fruit they had appetizing meals for hard working, hungry people, even though the bread was of unbolted flour ground in hand mills at home. Fine flour was only available when some one made the forty-mile trip to tlie Fort witli ox team and wagon, liv full George and Almeda were planning to get married, and as both were living quite a lonely life the parents made no objection, as George, being eight years her senior, was old enough to care-for her, as well as being eapable of doing so.\nBut think of a wedding in that country-no stores, no preachers, not even a justiee of the peace within forty miles. But love aud youth can bridge most difficulties. George was ready and willing to make the trip to the Fort to buy articles necessary for the oecasion, but it was hardly the proper thing for Almeda to go the lonely trip alone with George, and she was hardly able to do so. So it was decided that her mother should go with George and take Sammy along for company, as the boy was anxious to see something of the world. But as Mr. Mesinger was taken quite sick it came about that only George and Sammy were to go. The bridegroom was provided with money to buy goods for a suitable trousseau for the bride and some extras for the wedding feast-^a memorandum of extra length, yet I never heard that any fault was found with the things he brought back. On the contrary, I have often Jieard that the shoes fitted, the shawl was nice and warm, and the bonnet was comfortable and becoming and went nicely with the goods which Almeda took to a woman who had been a dressmaker in some eastern state, and who now lived about five miles from the Mesingers. While the woman .sewed Almeda helped with the housework, taking the completed dress home after a few days. And Almeda enjoyed the visit so much tliat she was lots better for it. It was about her first visit except with her married half-brothers and sisters, who never took any extra trouble to make it pleasant for her, as she was only a young girl and they had their own.\nAs the time for the nuptials neared great preparation w.is made. The cabin wa.s made a.s clean and tidy as a scrupulously neat housekeeper could make it and plenty of good things prepared for the wedding feast. I never heard all the menu but know wild turkey formed a part of it. All with whom they were acquainted were invited, and the married children.\nI must tell of them right here. Mrs. Mesinger had been married twice-first to a man named Parks who was killed or died of disease in the W'ar of 1812, leaving her with five children, Asa, Isaac, Jane, Julian, and Cordelia. Some years after she married Kiby Mesinger, who was also a soldier. They eontinued living in Onondaga County, New York, and Asa. Jane, Julian, and Cordelia married there. Asa was married to a girl named Sweet, Jane to Samuel Howd, Julian to James Benedict, Cordelia to' Durant. When the Mesingers went west they took Isaac Parks, and Orissa and Almeda Mesinger witli them, and first settled on government land in Wisconsin. Here Isaae married and Samuel was born. Afterward they moved on to Iowa, lured by prospects of a better location. Isaac went also, and soon all the others and their families, except Jane and Julian, were in Iowa. And all were near enough to be at the wedding of George and Almeda even if some did Iiave to camp more than one night on the way. George fixed his cabin ready for company and the bride, then made the trip to Fort Des Moines, brought his sister Harriet, her husband, and daughter Mary about ten years of age, and also brought the chaplain. After the wedding he took his bride, the chaplain, and his sister's fam-ily to his own home. AU this happened on October 15, 1845. After a day's visit they all embarked in tbe emigrant wagon again and went baek to the I-'ort wbere George and Almeda visited a few days, tben returned bome, taking tbeir household supplies for the winter.\nAnd now Mr. and Mrs. Mesinger and Samuel were left to spend the winter without a daughter. Orissa had married a man named Williams sometime before, living near enough to permit of frequent visits. But this tale is of George Van Dorn and Almeda, so we will follow them.\nAlmeda had suffered from western ague till ber bealtb was very mueli impaired, and as George was used to doing bousework and tbere was little for bim to do in the winter except to hunt and slay sufEicent game for table use, or ehop enough logs for the fire place, he continued efficient in the culinary department, especially as the young mistress had never cooked by a fireplaee, and be was afraid sbe might burn berself up in tbe attempt. Remember her people bad come from New York State wbere cookstoves were first used and had brought one witb tbem. At tbat time every bousebolder made most of tbe furniture bimself. Stools made from bewn slabs for bottoms and stakes for legs were used instead of cbairs.\nilowever, tbe Mesingers and Van Dorns each had a couple of roeking-chairs brouglit from tbe I-'ort. Tbe bedsteads were stakes driven into the logs on one side and legs in front; tables were bewn slabs smoothed on the upper side, long and narrow. Tbese bomemade devices were left bebind wben a family moved, tlius lessening tbe job of moving.\nA year passed with few cbange.s. Tbe first real event was tbe arrival of a little daughter November 11, lS-tfi, A horseback rider made the forty-mile trip to the Fort and brouglit a physieian wbo, of course, arrived too late to assist tbe stork, but was useful in earing for tbe mother and ehild a few days. He then left, riding the faithful horse the long trip home, his saddlebags well filled with lunch and horse feed after the eommon custom, and bearing good news to the W'ileox family.\nTlie baby was named DeMaris Van Dorn and seemed to fill a plaee to the complete satisfaction of the parents. While the doctor was there to oversee, the father hollowed out a cradle from a log for the baby. Tben they cbeerfully entered anotber long, cold winter, abiiost a period of bibcrnating. This baby \\s myself, tbc writer, now seventy-two years old.\nSpring brought plenty of bard work for the father, as tbe young motber's bealtb was still poor. Tbe wbole care of a baby is a colossal undertaking for a motber at the age of only sixteen years and five months, and no doctor within forty miles. But they were young and ambitious and eaeb did tbe best be eould and in time spring sowing and summer barvesting were over.\nAs tbey heard glowing reports of tbe climate of Oregon Territory and of the wonderful productiveness of tbe soil, they planned to sell tlieir elaim to some of tbe many immigrants now filling the new state of Iowa, just admitted to the Union, and go to Oregon, feeling convinced the climate would be hetter for tbe mother. Accordingly wben I was near eleven montbs old tbt'v started witb two large eovered wagons and four yoke of oxeii. Tlie parting was hard for motber but witb tbe hope of youth she pictured herself coming back in sbort years with good bealtli and prosperity. One ltalf-l)rother, however, objected so strenuously that he and fatber almost came to blows.\nAs motber wa.s not able to travel all day witbout resting, a comfortable bed .was arranged in one wagon for ber use botb day and night. Tbe first day's journey brought tliem to Fort Des Moines sometime in tbe nigbt, but tbey stayed in tbe wagons till morning and did not arouse the Wileoxes, preferring to eamji. Tliey were joined by the Wileoxes with a eouple of wagons and team.s, and others, and a.s they went on the number of wagons and families inereased till tliere was quite a train traveling towards what was to be tbe state of Oregon.\nIt may be interesting to note some of tbe rules followed by tlie emigrants. Tbey were to help eaeb otber tbrougb all diffieuities, but eaeb separate family provided for itself wben able; only part of tbe men at a time were to ride on horseback and watcli for game, which was always divided ; wben opportunity offered for fisliing some were detailed for tbat; eaeli day tbey drove as far as possible, hut if any team gave out, or for some reason it was necessary for one outfit to stop a day or two, at lea.st two otbers must stop witb them to insure help in time of trouble.\nIt was deemed best for small parties to stop over frequently.\nscattering tbe train over quite a long distance. As the rested teams caught up some of the tired ones would stop. Diiring these stops the women would do washing, baking, etc., that tbey were too tired to undertake when stopping only for a nigbt. Slowly they made their way over the long stretch of miles, over plain and mountain, fording rivers, as tbere was neither bridge nor ferry. Within fifty miles of a fort with a small settlement (afterwards Oregon City), tbe lieadquarters of government land agents, the whole train camped in a body, forming a corral in whieh tbe oxen could be driven and not have to have a guard to watch all night. When they bad nstid a (Jay or so they concluded to send three men ahead on hor.seback to interview tbe land agents and see the available spots tor pre-emption. Kre long, after much riding and looking, each had selectfd a plaee to stop and called it home.\nSome went into the settlement near the fort. Among them was the Wilcox family, as unele liked business life and could have employment in the government quarters. My father selected what he often said was the \"most beautiful prairie land that the sun ever shone on,\" with a border of timber on one side, mostly tall fir trees, and a stream of water, thirty miles from the settlement. Here he immediately went to work to prepare a plaee for bis family and teams, and tbe cow tbat had made the long journey with them, and even the two dogs that had helped herd the eattle and had made themselves so usefrl that they were almost considered part of the family, especially as they had been so watchful over the baby.\nFirst a eorral was built of logs of the tall fir trues for the cattle at night. Next father cut timber for a cabin, and when he had sufficient he drove to the settlement for men to help. All this time they had been living iu tbe wagons. And bere my mother stayed and cared for her babe while fatber made the tbree days' trip for men. provisions, ammunition, etc. Occasionally roving bands of Indians were to be seen, but so far they Iiad not disturbed us. While father was gone mother planned her domieile, staking it out right near to shade and water. Quite heroie, for she was not yet eighteen years of age. I have heard wonderful description of the double cabin-two rooms, with hall between broad enougb to drive an ox team bringing large backlogs for the immense fireplace. In that mild climate they needed no windows, only small openings for light and air, and doors for protection from wild beastpS.\nBut now fathtr was obliged to quit work on the house before putting the door.s in, as it was time to break prairie, which would not be much good the first year, though he might try to raise a little grain for his own use. But fortune favored, as a man living three miles down stream needed help with his ground, which had been under cultivation for a year or more, and would give father a good share for work with team. So father took his helpers back and on this trip brought mother a present, an old hen with fifteen chickens, a veritable prize.\nAbout this time father traded his riding horse, which he always considered unsafe for mother, to an Indian for a very ])rt'tty, fleetfooted Indian-trained onc^ which the Indian said was \"good for white squaw,\" ,Tnd hi.s word proved true. With the new horse came a squaw saddle with beaded blanket. All this time mother's health had been improving, and now with horseback riding she h;id a dtigrec of ha))piness hitherto unknown. When father went away to work she often went with him with me in her laj), one dog following and the otlier left to keep wild pests from her cliickt-ns and garden. Some of father's work was quite a way from home, so he made a canoe after the fashion of the Indians and would h ave his team where he worked and paddh' honu' at night .-iiid back in the morning.\nThey were living happily with bright prosjiects and, through a letter to Aunt Harriet Wilcox at the settlement, had heard good news from tlie liome folks. Father was not only earning some of the crop by helping the elder settler but also was getting his place ready to raise some another year. Some real fencing had been done with rails that he himself cut and si)lit, and the doors were hung so they no longer had to keep a fire burning outside to keep the wolves and other wild animals away, when it was rumored that gold had been discovered in California.' Many were making a rush for the mines, in fact men were wild to go, as they thought to pick up the precious metal. They -'The discovery <»r Robl in C;ilifc)rni:i wns made Janu;iry 31, lH-tH, on the .American bmrifh of the Sncnniientn River, but it was a.s Itite us-M'lv of tbal ye.ir before it bec^ime Kf'ieriilly known. loaded their wives and cliildren into wagons and with incompetent young men sent them baek to Iowa or otlier states. They started to California in gangs. \\\\'hen the Indians saw so many leaving, and feeling imposed upon by the great amount of travel whicli frightened away the game and scattered tiieir herds of ponies, they began to be savage and the war cry was sounded. This made it dangerous for the few that wished to live peaceably in the homes they had started. Numbers fiocked to the fort for protection. But with none to till the soil and such poor facilities for bringing supplies from other plaees, they soon found they must abandon this place, leaving it to the government agents.\nA eouneil wa.s liuld and some thirty men, with teani.s and wagnns loaded with what supplies the government agents could spare, made a start in the same direction the greater crowd was traveling. Among these were the Wilcoxes, my parent.s, and one other man with hi.s family. Father now had eight yoke of oxen-two wagons with four teams to a wagon--two cows, and the two faithful dogs that had been my com]]anions and protectora whenever I was outside the cabin door. Mother had her horse which she rode most of the time, carrying me in her lap. When thej forded a stream she would get into the wagon; so did Aunt Harriet Wileox and Cousin Mary, as they felt \"safer with George for teamster.\" Mother's horse turned loose would swim along near the oxen, and when one wagon was across father would mount mother's horse and swim back and take the other teams across, hanging onto the leaders' (ox) bows on the downstream side to keep the oxen from turning and swimming downstream. Sometimes he had to use the whip to keep them straight. The wagon boxes were tight like a boat and Iwlted fast to the running gears.\nAll were well armed and ready for an attack at any time, as the Indians were still on the w;ir|i;itl] trying to keep the whites from their Iiunting íírounds. l'iVen the women had fire arms and bowie-knive.s. All this time the Indians did not have guns and were very much afraid of them. The company kept together, as it was not safe for any to stop and let others go on. When thev reached the mountains the work of doubling teams so often and helping each other made progress very slow. The teams were tired, the soil was poor, and vegetation was short-They had to camp longer each day and sometimes rest for days.\nThey finally reached Waiilatpu Mission about the first of December and made application to stay till spring, but could not be allowed to do so as tbere were lots more to follow and grass would beeome scarce. However, tbey stayed two or tbree weeks and tben went on witb still more of a crowd tban before. They had only made a eouple of weeks more time when they were overtaken by some borsemen from tbe Mission who bad escaped during the great Indian massacre when nearly all at the fort were ruthlessly slain, including Rev. Marcus Whitman and his wife and family, the missionaries wbo bad been so kind to the Indians and had taught them so faithfully.'' When our party heard this terrible news tbey eamped for awbile and some of our men, well armed, rode baek a distance in tbe bope of finding some otiiers that might have gotten away, itut not till long after did they hear of any. A girl had erawled into a storage cave and must have beeome unconseious from fright, and when she came to, found herself alone with the smouldering ruins of the Mission in whieh all the dead had been burned. Sbe wandered away sbe knew not where, and after days wa.s picked up in a starving eondition by anotlier emigrant train and was cared for, eventually reaehing tbe same destination as tbe otber emigrants, and was recognized by my mother who remembered her at tbe Mission. Sbe clung to motber some time.\nWhen my people started from Oregon they bad two cows. One they left at tbe Mission as a present to tbe missionaries, tbe Wbitmans, wbo had been so kind to them. Mother was determined to keep the other, driving it as she rode on horseback through canyons and over mountains, though father kept telling her not to work so hard with it. One morning the cow was missing and mother was obliged to ride on without her, and never knt w whether she got out of the corral in seareh of better pasture, or was driven off by the Indians as she strayed away from camp. The lost cow was named Bob. I had been told the old aDr. Míircii.'í Whitman, a Presljyleriiin medit'al missionury, whose home had been in central New York, in lH3(i established ¡i mission at Waiiiatpii, twenty müeii up Wull.i W.illii Hiver from Fort Wallii Wall», and ereeted buildUiKS there. On November 2B, 1817. he and hi.s wife and several others were massacred by the Indians. (See \"Pioneer Daya of Oregon History,\" Vol. II, pp. 3(IO-M4-) -Editor. nursery rbyme of tbe eow jumping over tbe moon, hut hardly believing it, made up a version tbat suited better, viz., \"Old Bob jumped over the barner,\" the shed at the Oregon bome.\nAbout tbis time one of tbe valuable dogs that helped witb tbe bunting, and was the fierce protector of mother aud ebild, was missing. So well were, tbese dog.s trained tbat wben tbey bad a wild animal \"treed\" one would guard it and tbe otber go for father, and wh( n he beard a certain peculiar bowl be would grasp his ever loaded gun, sure of being guided to sometbing wortb sbooting. One day tbe dogs found a grizzly bear and ebased it toward a small lake in front of the wagon train. The men immediately grabbed tbeir guns. Father ran up to mother who had me in her arms on horseback, helped her down, jumped on her horse and rode furiously after the dogs. This is the only ineident I ean really remember of the long, tedious journey. I\nwas not yet three years old but I can see bow the bear jumped into the water and tlie water splashed bigb. Tbey got tbe bear wliieh meant frcsli meat. Tlie bide was saved witb many otbers to be sold to tbe first fur i ompany they came in eontaet witb.\nBut the longest journey will end in time, so after six montbs of liomeless traveling and camping tbey crossed a swift river and set foot on new soil wbere Saeramento now is. And the tliree women of tliis train. Aunt Harriet Wileox, her daughter Mary, and my mother, Almeda Van Dorn, were tlie first white women, and I was the first white child, that reached the wild land or eamp, as tbe otber family wbo started bad joined anotber party where tbey found relatives and acquaintances and camped some time before crossing tbe river.\nIn this city of tents were also many members of tbe Hudson Hay Company of early fame. I was the only white child in the whole settlement, but was not old enough to realize tbe distinction. Soon after getting into this eamp where the Hudson Bay Conii)anv had headquarters, fatber hunted up tbe bead man of this division, a Mr. Burnett, and sold him the hides and furs tliat our party bad saved up, and also sold bim tbe elaim back in Oregon for $600. He bated to part witb tbe elaim as he liked it so mucb and wanted it for a permanent bome, but be was out of money and be feared it migbt he a long time before it would be safe to go back tbere. But it was not many months before tbe government sent troops to many points in the western states and territories and the Indians were somewhat subdued.\nBut now just imagine father receiving the price for his claim and tho.se furs in weighed out gold! No eoin at all! And the only way that he could take it back to camp was in bis bat, and tbat was somewhat the worse for wear. Witbin a eouple of days fatber had seeured a large tent from tbe Hudson Bay Company and had cleared out his wagon and started two hired men with his teams to the mines with loads of men, implements, and provisions. And these men were to bring baek report of tbe mining loeation, etc. My father never went to the mines but kept teams going back and forth all the time. He also bired two eolored men, that is, he bonght their time of their masters who had brought them from the Soutli. They were cooks.\nFather and Unele Francis Wilcox, with mother and Aunt Harriet for partners, commenced keeping boarders and, by the way. did a big business in that line, as it was the only place where the great rush of mL-n that eame either by land or by sea could buy a meal.\nNot long after tbey were located a man eame in to dinner witb a fine dog following him. Father spoke the name of his lost dog and immediately the dog jumped to greet him. The stranger said he had traded for him, getting him from a man who elaimed to have raised him. Then father got me and stood me where I could see the dog, and what happened con\\inced all present that two fond friends had met after a long separation. Stub had already died and Bounce soon followed.\nEre long a number of the men that belonged to the Hudson Bay Company and Uncle Franeis Wileox and fatber began to plan for more permanent homes. Father sent to \\ew York Citv by a sea cajitain and had a large house framed and sent bv steamer all ready to set up, and thus was tbe first to erect a frame liou.sc in what is now Sacremento City. Soon carpenters began to work and numbers of men sent for their families, mostl>-Spaniards and Mexicans, but Mr. Burnett of whom I have spoken was an Ameriean, and his wife and family came by water from the Eastern States I tbink. Tbey also built tbem a bouse at tbis time, I am not informed as to tbe material. I do not know bow mueb of a family Mr. Burnett had, but of a wife and a son and daughter I am sure. This son and daughter were young and they and Cousin Mary Wilcox were soon fast friends. Mrs. Burnett had been a teaeher before her marriage and the Burnett young people had hrought their books, and as Cousin Mary had never had much opportunity for attending sehool, Mrs, Burnett tauglit them all for a time. But ere long the son, who began to be his father's helper in many ways, eoneluded that he and Cousin Mary could just as well study and work together, and in about a year after their first meeting Dwight Burnett and Mary Wilcox were married.\nAnotlier wedding with many obstacles! TIic day was set and l)oth families were interested in the preparations. I tliink it was tlie latter part of March and spring was coming on, with rain and sunshine tliat melted the snow in the mountains. The water eame pouring down into the river and filled the beautiful valley, washing away many habitations. At this time my uncle and ))art!its and the Burnetts were all living close together in some kind of small houses. The Van Dorn Hotel whieh stood on the liifihest ground in the settlement was occupied by renters, as t'.ie work and care had proved too arduous for aunt and mother. Father had a man living with them who had a team of horses. They needed an extra man in every household as there were so many lawless people. When tlicy went to bed tliis rainy night they were aware the valley was fast filling with water, so fatliei biigan to mark it and watch the time, and found it would take the quite temporary house. He ealled the teamster and told him to get out his horses and they would go to the hotel. When they left the house mother stepped from the door, where thf water was already several inches deep on the floor, into the stirru¡) of the saddle, and when seated father put his accumulated gold into her lap, and the teamster in front of her, then he mounted the other horse with me in his arms, and the horses were guided towards the liotel, swimming part of the time. When this haven was reaehed father immediately sent a boatman for Aunt Harriet and family, also the Burnetts,\nThe following day was appointed for the Burnett-Wilcox wedding and here they were at the Van Dorn family hotel on the highest ground in the settlement, the lower floor eovered with water to the depth of several inches and a boat fastened to the front steps so they could escape if matters grew still worse. But fortunately the rain stoj)()ed and the water seemed stayed tht next morning. So the young couple insisted that the wedding lie not postponed as that was considered a bad sign. A man with a boat was sent out to look into the deserted iioascs for the few nice things that had been prepared for the bride. The clothing which was packed in a chest was wet and would need a thorough renovating. The eake that my niother had concocted with the best ingredients available was soaked to a sloppy mush. In fact all that had been prepared was ruined, but they were not to be thwarted if the priest were alive. The Burnetts were Catholics and a priest was the only clerical available. There was no justice or magistrate of any kind, and no law but the law of the strongest and quickest over the weakest and slowest, or each for himself as best he could.\nSo the wedding was solemnized without fancy clothes or extra viands and sweetmeats, but there was this satisfaction, no other young people were watcliing and laughing at their discomfiture. Soon after this great inundation the government began looking after its rich estate and a dike was made to protect this seetionj and I believe it is so protected to this day. In due time California was made a state and Mr. Burnett, Dwight's father, wa.T made the first governor and eontinued in that position for either two or three terms.'' A couple of personal incidents may interest my grandchildren. While my people were living at the Van Dorn Hotel a theatrical troujje from the States found their way to the settlement, thinking to make a lot of money oif the lonely men congregated there, but finding no place at all suitable for their entertainment, they began to pack up and go to some other place. As some of tht com|)any stayed at our place I was used to playing with them, so when one of them took me to their eamp and hid me I -waŝ I'eter Hnrdeiniin Burnelt, fir.«*! frovernor of Ctilirorniii, waa born at Nashville, Teiiiie.ssee, November 15. lmi\". He be<;ame a liiwyer, removed to Oregoii in 1813, I'iinneii, prai-tic.td liiw. iinil was a legislator and ;i juilge. In 1S48 he left Oresron for Ciiliforiii i witli the Ilrsl company of Rold seekers. Arriving tliere lie worked in tlie mines, Iml in imii becnme n(rent for the Suttin interesti. He W. 1. S lU'tive in urRing the fonirition of a .state (iovernment prior lo the adni¡.«.sion of file territory into tlie Union. He waa eleeted {fovernor in Decemlier. IN411. altliDUicli California wa« not admitted as a state until Septemlwr 9, iHflO. Governor Burnett resigned in Jrinuary, 1H3I, and enpciifted in the praetiee of law in Siin Friiiicisoo, and in 1H5Î beeame a justice of the Supreme Court of California. From iHttS to lM8a lie wjis president of tlie Pacifie Hank of Sau Fraucisco. {See National Cyelopcdia American Biography. Vol. IV, p, 105.)-Editor. nob at all frigbtened. It seemed to be their idea to kidnap me, thinking tbey would be able to get a good ransom. But before they left on the boat I was missed and my fatber and friends gave alarm and began to searcb. Some one had seen the showman playing with me, so to their camp went armed men. Of eourse they denied knowing anything of my whereabouts, but at tlic point of a gun one of tbem led tbe searcbers to the plaee wbere I was bidden and soon I was bome. It' is needless to add tiiat tbe troupe was quiekly escorted from tbe little settlement and given to nnderstand tbey dare not return, A little cbild was a curiosity in tbis new land and amid sueh surroundings. Lonely men would wateb me play, thinking perliaps of little ones left bebind. One sucb brougbt me a pair of bracelets of rather crude style. It was not until sometime later wben in playing I broke one tbat motber herself realized tbat they were fasbioned out of pure gold, a loving gift fashioned by band.\nWhen I was five years old, or in the spring of 1851, my fatber disposed of most of his property in Saeremento and started for New York State, At that time they made their way down what was then t-alled the Chagres River and crossed the Isthmus with pack mules. And right here was one of the most dangerous parts of all their travels. The trip down the river was made in small boats manned by incompetent men and many were drowned. When erossing the Isthmus they were in the power of lawless Mexican mutineers given to tliievîng and robbery of tbe worst type. In eompany witb my people were several men wbo had been in tbeir employ and who like tbemselves wanted to get back to tbe States, or \"God's country,\" as tbey often ealled it. All were well armed and fully determined to protect themselves. My mother also wore a belt witb two revolvers, and sbe was capable of using them to good advantage, too, quiet, mild-spoken gentlewoman tbat slie was.\nShe rode a mule, as did all tbe rest but me, and I was carried on the back of the faihtful eolored man who was eoming back to the States with gold enough to buy his wife and his mother who were still slaves in the South. He was free beeause liis master, wbo bad taken bim to California as a body servant, bad sold bim to my father cheap when it became understood that DK M VUIS ÜKÍSSA VAN DOlíN, iisi-i! t (Mrs. I'. V. Van Ar.-dale) California would be a free state and that soon his master would have no further claim on him. Although free he came witb us as it was unsafe for a eolored man to travel alone.\nTbc nights they had to put in on the Isthmus tbey slept in -scamens' bammocks, swung bigb, out of the reaeh of prowling beasts. But a greater fear was of human marauders. Part of the company stood guard while others slept, and at different times the company were aware that the robbers were trying to overhaul them. Once they tried to separate tbe eompany by trying to get Charlie, the colored man, away, thinking part would follow him and tbus weaken tbe force. But Charlie was not easily led astray but kept close to mother, witb me ou his back in a small cbair wbich was strapped to him, and in whieh I was fastened so I could sleep at will or keep awake and watch procfcdings. Rigbt hen-I must add that the camphor chest now in my possession was strapped to a pack mule and crossed the Isthmus with me. Do you wonder that I prize it so highly? After %ve wire on board slii]) and under way for tbe States I liave heard mother say she then eame nearest real rest of mind and hody sbe bad ever cxi)cricnee(I, and father was of much tbe same mind, for be had keenly felt the dangers of erossing the Isthmus. My parents botb escaped seasickness, but I did not. However, as tbe only cliild on board I was well cared for. I still have little tokens of the friendship of both the captain and mate. At Jamaica the mate stayed with me while father and mother w< nt ashorr. I .still have the .silk dress mother liought that day, with the many other things sbe needed as she bad not been wbere there was an ojjportunity to buy for some years. To keep from ¡laying duty on ber purcbases she cut tbe silks into breadths whieh made it the same as clothing.\nArriving in N'ew York they went to a hotel awhile for a mucb needed rest. Father had Charlie, the colored man, with him as a servant until he could be sent off to his old southern home.\nFather's substance was all in gold dust which necessitated use of scales, so he took it to the mint and exchanged it for coin. At that time there were no bank exebanges and one traveling must carry his money witb bim. And tbat is wby this same eampbor chest was broken into at two different times, tbe burglars tbinking that fatber kept bis money locked up inside, but both times tbey were mistaken."}, {"section_title": "ANNALS OF IOWA", "text": "As .soon as she-could ci)mi)ose herself after arriving in a civilized country and being located comfortably, mother wrote to her sisters, Jane Howd and Julien Benedict, who had stayed in New York State when the Mesingers went west, and from whom she had not heard for years. The return mail brought a hearty\nWe stayed in New York City about three weeks during which time mother copiously replenished her wardrobe. This must have heen a wonderful experienee, for she was still a young and comely woman, not mueh past twenty, and she had but few nice clothes. Indeed she had been so low on ehanges of dresses that slie had colored some unused tent eloth with bark of a nut tret and made it into dresses, though she had saved her wedding dresa and one or two finer articles of apparel while living where there were none but savages to see her.\nWhen they felt presentable they went to Syracuse, whieh was tlirir first ride on the steam ears, and so started on a delightful round of visiting among tlie relatives here and in other points in New York State. And I, who had no brothers and sisters and never but few playmates, beeame acquainted with a number of nice cousins who have ever sinee been very dear to me.\nSoon after father bought a farm adjoining Unelc James Benediet's in Onondaga County, where we resided several years. Here my father hecame eonverted and lie, mother, and myself, aged eight, all joined the Methodist Episcopal ehureh, of whicli my mother had been a member in childhood. Father was made local preacher and for several years acted in that capacity, moving occasionally to a small town or country eommunity that needed him most. He missed an education in publie speaking as his youtli had been so full of deprivations, so went to Fulton, a college town, and was for some time under private instruction.\nIn the fall of 1860, having sold the farm near Syracuse, he bought one in Oneida County, three miles soutJi of Trenton Falls, and wr lived there till the spring of 18G2 when he again sold and started west, stopping in Ohio, Some time was spent in temporary abodes while looking for a location here and neai Bernadotte, Illinois. In October, 1862, we settled in Fairview, Fulton County, Illinois. Here I formed many acquaintanees. tlic most important in my history being Peter Van Der Veer Van Arsdalc, to whom I was married on May 16, 1866. In March, 1872, we came to Iowa and settled on a farm near Chariton, and this town has been our home ever since. Now I have led you back to the state where I started. My mother dropped dead in her garden here in 1879 and my father passed away a couple of years later. I have passed my golden wedding anniversary and still have the kind husband and four of my dear ehildren, who grew to maturity and are married and living neai in Iowa, to comfort me in my seventy-third year. I also have Iliree grandchildren and I feel that God has been very good to me.\nIn thinking this over I see I have left out about my being stolen by nn Indian in Sacremento. But fortunately I was rescued by a posse of men before he reached his tribe.\nThe editor of the Prairie farmer. In noticing the gratifying faet that Illinois beef stands A No. 1, in the New York market, both in quanity and quality, would be inclined to boast, were it not that he thinks too much encouragement is given to the improvement of beef, instead of the improvement of brains-that the mi ntal, moral and physical powers of the children are sacrificed to make them good herders of cattle, instead of intelligent and I ultivated eattle bretders. We fear that both brains and beef are too much neglected in Iowa.-Iowa Farmer and Horticulturist, June, I8.5f). "}]