[{"section_title": "Abstract", "text": "Vitamins B complex and homocysteine has been given much attention as preventive factors against cognitive decline and dementia. Hyper homocysteinaemia has been suggested as a cause or mechanism in the development of Alzheimer's disease and other forms of dementia. The present study is designed to know the role of vitamin B complex and homocysteine and its relation with cognition, using biological samples. A total of 337 subjects with a mean age of 49 years participated in the cross sectional study from different parts of Kerala state in India. Participants were administered a series of neuropsychological test batteries with major emphasis on 7-min screen test. All test procedures were administered by standard protocol after a written consent was obtained from the participating subjects. Analysis of vitamin B complex and homocysteine was done, using serum samples and the data obtained was then statistically analyzed using statistical package for social sciences (SPSS) software version 17. Vitamin B 6 and B 9 were found to be significantly related to the cognitive score (P < 0.001, p < 0.003, respectively). Independent sample test showed a highly significant change with a p value < 0.048 and < 0.019 of vitamin B 12 and homocysteine, respectively. The results of our study give us an insight that Vitamin B complex and homocysteine may be closely associated with cognitive function in elderly population. But further studies on a larger population is required to come out with a definite conclusion."}, {"section_title": "INTRODUCTION", "text": "Vitamins B complex (especially, folate, vitamins B 12 and B 6 ) has been given much attention as preventive factors against cognitive decline and dementia (Kuo et al., 2005; Morris et al., 2006b; Schneider et al., 2006; Reynolds, 2006; Sachdev, 2005; Troen and Rosenberg, 2005; Luchsinger et al., 2007a) . The primary theoretical basis *Corresponding author. E-mail: drbasheermp@gmail.com. Tel: 00291-7374854, 0091-8547161253.\nAuthor(s) agree that this article remain permanently open access under the terms of the Creative Commons Attribution License 4.0 International License for this argument rests on the known relations of folate, vitamin B 12 and vitamin B 6 as co-factors in the methylation of homocysteine (Hcy), and the importance of deficiencies in these nutrients to increased Hcy concentration (Carmel, 2000; Stabler, 2003) . Supra physiological levels of Hcy are neurotoxic in cell culture and in vivo mouse models, suggesting that Hcy toxicity may have a direct effect on cognitive decline. Numerous studies in recent years have investigated the role of Hcy as a cause of brain damage (Pacheco-Quinto et al., 2006; Fuso et al., 2005; Ho et al., 2003; Seshadri and wolf, 2003) and neurotoxic effects of Hcy can be blocked by folate, glutamate receptor antagonists or various antioxidants (Olney et al., 1987; Kim et al., 1987) . Hyper homocysteinaemia has been suggested as a cause or mechanism in the development of Alzheimer's disease and other forms of dementia. Supplementation with B vitamins including vitamin B 6 has been shown to reduce blood homocysteine levels (Malouf and Grimley, 2003) .\nHigh folate intake was associated with reduced risk of developing AD in the Baltimore Longitudinal Study of Aging (Corrada et al., 2005) , but there was no association with vitamin supplement and/or food intake of folate in the Chicago Health and Aging Project (CHAP) study (Morris et al., 2006a) . In both studies, no association was found with total intake of vitamins B12 or B6. Earlier studies relating homocysteine levels to dementia risk have shown inconsistent results (Ariogul et al., 2005; Gunstad et al., 2006; Haan et al., 2007; Mooijaart et al., 2005; Seshadri, 2006) . Moreover, there are a limited number of prospective cohort studies on B vitamins and dementia, and the findings have not been consistent. Very few prospective studies examined the levels of B vitamins and Hcy in relation to incidence of dementia (Luchsinger et al., 2004; Corrada et al., 2005; Ravaglia et al., 2005; Morris et al., 2006b; Luchsinger et al., 2007b; Wald et al., 2011) .\nSome of these studies that used serum measures found a significantly greater risk of developing AD among persons who had low levels of either vitamin B12 (<150 pmol/L) or folate (14 µmol/L) and was associated with almost double the risk of dementia and AD (Seshadri et al., 2002) . There are a lot of discrepancies existing on whether Vitamin B supplement can reduce cognitive impairment by decreasing serum homocysteine level (Wald et al., 2010; Kwok et al., 2011; De Jager et al., 2012; Ford and Almeida, 2012; Douaud et al., 2013) .\nOur study was aimed to identify the role of vitamin B complex and homocysteine level in serum of normal and cognitively impaired Indian population based on 7-min screen test and other neuropsychological tests."}, {"section_title": "MATERIALS AND METHODS", "text": ""}, {"section_title": "Participants", "text": "Participants were a part of a cross-sectional study of All the study participants had given their informed written consent and study was approved by Human ethical committee."}, {"section_title": "Procedure", "text": "The 7-min screen test was developed to assess cognitive impairment especially in dementia prone Alzheimer's disease. Various tests coming under this are orientation test, memory test, clock drawing test and verbal fluency test. The scores obtained from all the aforementioned tests were then analysed using the scoring calculator, to find out the probability of dementia related problems (Solomon et al., 1998) . Vitamin B6 was estimated by (IDVit® Vitamin B6 Immundiagnostik AG Stubenwald-Allee 8a 64625 Bensheim, Germany), folic acid assayed by Roche Elecsys 2010 immunoassay analyzer, Vitamin B12 assayed by ADVIA Centaur (Bayer diagnostic/Seimen Healthcare Diagnostics) and homocysteine assayed by ADVIA Centaur (Bayer diagnostic/ Seimen Healthcare Diagnostics)."}, {"section_title": "Statistical analysis", "text": "The data of biochemical test parameters was analysed with SPSS software version 17. Statistical tests were conducted, which include analysis of variance (ANOVA), Independent sample test and Pearson correlation."}, {"section_title": "RESULT", "text": "The 7-min screen test was administered in all the age groups and found an increasing trend in the score as age advanced (Table 1 ). Orientation score in younger age group was compared with older age groups. A statistically significant difference was found between younger age group (20 to 29) and other groups (p < 0.05). One way ANOVA was conducted between the groups and within the groups and a mean square value of 52.847 and 0.518 was obtained, respectively with a highly significant p value (< 0.001). The score in males was 1.4 ± 1.14 and for females, it was 1.58 ± 1.266. No statistically significant difference was observed between the scores of males and females (p=0.171). It was also found that when the education level increased the orientation score decreased. A statistically significant difference was observed between the highly educated and the uneducated in the orientation test score (p<0.001). In primary educated group, the value was 2.02 ± 1.104, in the secondary educated group it was 1.23 ± 1.16 but in the tertiary educated group, it was 0.98 ± 1.11. The values were statistically highly significant (p<0.001).\nMemory test was administered in all the age groups and was found to have a decreasing trend in the score as age advanced. Memory test in younger age group (20 to 29) was 15.6 ± 0.527, and in 80 and above age group, it was 12.63 ± 0.90. A statistically significant difference was found between younger and older age groups (p<0.001). Mean square value from one way ANOVA revealed a highly significant change (p<0.001) between the groups and within the groups (26.442 and 0.48, respectively). The score in males and females were compared and the values were 15.1 ± 0.802 for males and 14.7 ± 1.089 for females. A statistically significant difference was observed between the scores of males and females (p<0.001). A statistically significant difference was observed between the highly educated participants and the uneducated in the memory test score (p<0.001). In the primary educated group, the value was 14.52 ± 0.99, in the secondary educated group, it was 15.06 ± 0.94, but in the tertiary educated group, it was 15.34 ± 0.72. Statistically the values were highly significant (p<0.001).\nThe clock drawing test was administered in all the participants and seen to be correlated. The result was showing a decreasing trend as age advanced. In the younger age group (20 to 29) the value was 6.37 ± 0.74; however the value in subjects above 80 years was 3.47 ± 0.51. One way ANOVA revealed a statistically significant difference (p<0.001) between the groups and within the groups with a mean square value of 35.38 and 1.007. The score was found to be increased as the education level advanced. The score in males were 5.78 ± 1.245 and for females it was 5.52 ± 1.293. A statistically significant difference was observed between the score in males and females (p=0.06). A statistically significant difference was observed between the highly educated participants and the uneducated in the clock drawing test score (p<0.001). In the primary educated group, the value was 5.17 ± 1.35, in the secondary educated group, it was 5.85 ± 1.20, but in the tertiary educated group it was 6.17 ± 0.92. Statistically the values were highly significant (p<0.001).\nVerbal fluency (Semantic category) test was administered in all the participants and was found to be having a decreasing trend in the score as age advanced. Verbal fluency test in younger age group was compared with all other groups. A statistically significant difference was found between younger age and the older age groups (p<0.001). Mean square value between the groups and within the groups was 363.194 and 6.724. It was also found that as the education level increased the verbal fluency score also increased. A statistically significant difference was observed between the subjects with higher education level and those with lower education level. In subjects who completed tertiary level of education, the score was found to be higher than the primary educated group. The scores in the tertiary educated group and uneducated primary group were compared and found to be statistically significant (p<0.001), which shows that there is cognitive impairment in uneducated and elderly participants. The verbal fluency test in males and females were also compared. The score in males and females were 21.48 ± 3.523 and 20.5 ± 3661, respectively. Statistically significant difference was observed between the scores in males and females (p<0.001).\nBased on the 7-min screen test, probability of dementia in the different age groups was also calculated. The participants with 75.81 ± 6.92 age (n=43) showed high probability to dementia (HI) than the lower age group 'LO' (44.33 ± 16.56, n=286) . A statistically significant difference in dementia probability was observed between the higher and lower age groups (p<0.001) (Table 2) , of which eight subjects were re checked (RE). Among HI dementia probability with Alzheimer's characteristics, 39.5 % were males and 60.5 % were females. However, we got an interesting finding that as the status of education increased the chances of dementia with characteristics of Alzheimer's disease decreased (p<0.001) ( Table 3) .\nOut of these selected participants for biochemical investigation, 37.5 % belonged to HI group, 37.5 % belonged to LO group and remaining 25% belonged to RE group based on the 7-min screen test. All the participants were well matched for age and sex. A number of cognitive assessment tests were used to evaluate cognitive function in this population and a composite score was created to represent cognitive function/impairment. Descriptive statistics for each biochemical test parameters are presented in Table 4 and 5. Vitamin B 6 was estimated in all the participant groups. In the LO group, the mean serum vitamin B 6 was 58.86 ± 3.70 and in the HI group it was 35.39 ± 2.87. One way ANOVA was conducted between the groups and within the groups which showed highly significant changes. Between the groups, the mean square value was 1668.13 with a p-value of < 0.001. Within the groups the value was 9.88 with a p value of < 0.001 (Table 4 and Figure 1 ). Vitamin B 9 (folic acid) was estimated in all the participant groups. In the LO group the mean serum vitamin B 9 was 23.47± 6.37 and in the HI group it was 15.20 ± 4.93. One way ANOVA was conducted between the groups and within the groups which showed a highly significant change. Between the groups the mean square value was 206.21 with a p value of <0.003 and within the groups the value was 28.95 with a p value of <0.003 (Table 4 and Figure 2 ).\nVitamin B 12 was estimated in all the participant groups. In the LO group, the mean serum Vitamin B 12 was 262.22 ± 72.70 and in the HI group it was 215.00±28.30. Independent sample test was conducted between the groups and within the groups which showed highly significant changes with a p value of <0.048 (Table 5 and Figure 3 ). Homocysteine was estimated in all the participant groups. In the LO group the mean serum Hcy was 12.03 ± 1.78 and in the HI group it was 15.30±4.11. Independent sample test was conducted between the groups and within the groups, which showed a highly significant change with a p value of <0.019. (Table 5 and Figure 4 ). "}, {"section_title": "DISCUSSION", "text": "Micronutrient status can affect cognitive function at all ages. Vitamin deficiencies could influence memory function and might contribute to age-associated cognitive impairment and dementia. Vitamins are required for proper development of brain (Ramakrishna, 1999) . Epidemiological studies indicate that poor vitamin B 6 status is common among older people. Hyper homocysteinaemia has been suggested as a cause or mechanism in the development of Alzheimer's disease and other forms of dementia. The prevalence of Alzheimer's disease is expected to quadruple by the year 2047. Delaying its onset would decrease its burden (Brookmeyer et al., 1998) . Around one in six elderly people (70+) has mild cognitive impairment (MCI) and experience problems with memory, language or other mental functions, but not to a degree that interferes with their daily life. The B vitamins such as folic acid, vitamin B 6 and vitamin B 12 are known to control levels of homocysteine in the blood and high levels of Hcy are associated with an increased Alzheimer's risk (Smith et al., 2010) . Homocysteine levels greater than 1.9 mg/L (14 µmol/L) doubled the risk of AD in the Framingham study (Seshadri et al., 2002) but there was no relation between the plasma levels of folate and vitamins B 6 and B 12 and the risk of AD. Our study also found that homocysteine level is higher than 14 µmol/L in HI dementia probability with Alzheimer's characteristic population. But in contrast, we have observed that there is close relationship between serum level folate, vitamin B 6 and B 12 with HI dementia probability with Alzheimer's characteristics. The elevated homocysteine levels are related to cognitive decline (Elias et al., 2005; Tucker, 2005; Schafer et al., 2005; Wright et al., 2004 ) and higher dementia risk (Ravaglia et al., 2005) . Vitamin B 12 supplementation was accompanied by improved language and frontal lobe function test, results in the patients with cognitive impairment. Another study (Douaud et al., 2013) conducted recently revealed that vitamin treatment, by lowering total homocysteine levels markedly reduces gray matter atrophy in regions particularly susceptible to Alzheimer's disease. Our results are consistent with those studies suggesting that higher intake or serum level of folate is related to a lower risk of AD and thereby improve cognitive performance.\nVitamin B 12 in addition to its effects on Hcy levels, its deficiency is thought to cause neurological problems by formation of increased methylmalonic acid (MMA) or decreasing the enzyme regenerates methionine from homocysteine.\nMethionine is needed to make Sadenosyl-methionine (SAMe), which is required for the production of the phospholipids that become a part of the myelin sheath essential for the proper functioning of the nervous system. Demyelination due to B 12 deficiency can occur in the brain. When it occurs in the brain, it manifests as cognitive impairment. Further results from an Oxford University study in 2010 appear to suggest that B vitamins can slow mental decline in some elderly people with mild memory problems (mild cognitive impairment). This effect is apparent in participants with high levels of an amino acid, homocysteine, in blood (De Jager et al., 2012). Baseline homocysteine levels showed a concentrationresponse relationship with the subsequent rate of decline in cognitive test scores: the higher the homocysteine, the faster the decline. Raised homocysteine concentrations within the normal range among the elderly strongly relate to the rate of global cognitive decline.\nThe results of our cross sectional study indicate that there is a strong, graded association between plasma total homocysteine levels and the risk of HI probability dementia of Alzheimer's type. An increment in the plasma homocysteine level of 3 µmol per liter increased the risk of HI probability dementia of Alzheimer's type. A similar result was found when the single criterion of hyper homocysteinemia (baseline plasma homocysteine, >14 µmol per liter) was used. The observed association appeared to be independent of age, sex, plasma vitamin B levels and other putative risk factors for dementia and Alzheimer's disease. The relation between elevated plasma homocysteine levels and dementia has been evaluated in other cohort studies (Clarke et al., 1998) , and our studies also observed similar findings. In our study population, an elevated homocysteine level at base line was related to a decline in the scores on 7-min screen test and other cognitive tests (data not shown)."}]