[{"section_title": "Abstract", "text": "We investigated the relationship between vascular disease and risk factors versus cognitive decline cross-sectionally and longitudinally in normal older control, mild cognitive impairment, and mild Alzheimer disease (AD) dementia subjects. A total of 812 participants (229 normal older control, 395 mild cognitive impairment, 188 AD) underwent cognitive testing, brain magnetic resonance imaging, and clinical evaluations at baseline and over a period of 3 years. General linear, longitudinal mixed-effects, and Cox proportional hazards models were used. Greater homocysteine level and white matter hyperintensity volume were associated with processing speed impairment (homocysteine: P = 0.02; white matter hyperintensity: P < 0.0001); greater Vascular Index score was associated with memory impairment (P = 0.007); and greater number of apolipoprotein E E4 (APOE4) alleles was associated with global cognitive impairment (P = 0.007) at baseline. Apolipoprotein E E4 was associated with greater rate of increase in global cognitive impairment (P = 0.002) and processing speed impairment (P = 0.001) over time, whereas higher total cholesterol was associated with greater rate of increase in global cognitive impairment (P = 0.02) and memory impairment (P = 0.06) over time. These results suggest a significant association of increased vascular disease and risk factors with cognitive impairment at baseline and over time in the AD spectrum in a sample that was selected to have low vascular burden at baseline. (Alzheimer Dis Assoc Disord 2015;29:18-25) V ascular risk factors such as hyperlipidemia, diabetes, and smoking, and vascular disease, such as stroke, have been shown to alter the biological processes associated with Alzheimer disease (AD). 1 For example, elevated cholesterol intake increases amyloid-b deposition in the brains of transgenic mice expressing human amyloid precursor protein. 2 Apolipoprotein E E4 (APOE4) is a susceptibility gene for AD that has been associated with increased deposition and decreased clearance of amyloid-b and has been shown to predict progression from mild cognitive impairment (MCI) to AD dementia. [3] [4] [5] [6] In addition, APOE4 has been shown to be a risk factor for development of cerebrovascular disease though this association has not been demonstrated as consistently. 7 Vascular disease, specifically prior stroke, and vascular risk factors, primarily hypertension and diabetes, have been associated with both the occurrence and progression of AD dementia; however, the risk for the individual is modest when compared with the risk at the population level. 8-10 It has also been found that vascular disease and risk factors increase the risk of MCI and are associated with progression from MCI to AD dementia; this appears to be primarily driven by prior stroke, but some studies have also implicated hypertension, diabetes, and hyperlipidemia. 11-13 Thus, it is likely that vascular risk factors and vascular disease modify the risk of cognitive decline in the AD spectrum. However, it remains unclear whether vascular risk factors, such as hypertension and diabetes, contribute to cognitive impairment and disease progression in AD separately from cerebrovascular disease, which could directly lead to cognitive impairment regardless of the presence of AD.\nCarmichael et al 14 looked at the relationship of white matter hyperintensities (WMH) to vascular risk factors and cognition with a 1-year follow-up period in the Alzheimer's Disease Neuroimaging Initiative (ADNI) study. A more recent study by Lo and Jagust 15 used ADNI data to primarily assess the relationship between cardiovascular risk"}, {"section_title": "", "text": "scores, WMH, and AD biomarkers over 3 years. That study also assessed the relationship of cardiovascular risk scores and WMH with global cognition and executive function within individual diagnostic groups, finding variable associations mostly with poorer executive function. Building on the results of these studies, we aimed to take advantage of the 3-year follow-up period like the Lo study to investigate the same as well as other vascular disease and risk factor elements (assessing both prior history of and currently present vascular elements), multiple important covariates (including medication use), and clinical outcomes not previously explored (including memory performance). Moreover, the earlier study 14 had only a 1-year follow-up period, whereas our study had a 3-year follow-up period. Although the more recent study 15 also had a 3-year follow-up period, it assessed effects within each diagnostic group in separate models, whereas our study looked at effects across diagnostic groups and within each group within the same model. The goal of the current study was to investigate the relationship between vascular disease and risk factors and cognitive decline cross-sectionally and longitudinally in normal older control (NC), amnestic MCI, and mild AD dementia subjects. The analyses performed here accounted for various factors, which have not always been controlled for in other studies. A comprehensive pool of vascular disease and risk factors consisting of multiple elements available in the ADNI database was assessed: (1) prior history of vascular disease and risk factors was summarized by a Vascular Index score; (2) current physiological measures included serum glucose, serum total cholesterol, plasma homocysteine level, systolic blood pressure, and body mass index (BMI); (3) genetic testing included APOE4 carrier status; and (4) magnetic resonance imaging (MRI) measures included WMH volume. Our outcome measures included tests of processing speed, memory, and global cognition, and disease progression. We hypothesized that vascular disease and risk factors at baseline would be associated with greater cognitive decline cross-sectionally and longitudinally across the AD spectrum. Many population-based studies of aging and dementia have assessed the relationship between vascular disease and risk factors and cognitive impairment and disease progression. The subjects in ADNI are different from those in populationbased studies in that they are selected to have limited vascular burden at baseline and to include individuals at early stages of AD or at risk for AD similar to subjects entering early AD treatment trials. We therefore used the available ADNI variables to explore the relevance of multiple vascular risk factors and modest existing vascular disease to typical AD progression measured by cognition and disease stage. As such, our study could inform future clinical trials in early AD."}, {"section_title": "METHODS", "text": ""}, {"section_title": "Subjects", "text": "The data used in the preparation of this article were obtained from the ADNI database (http://www.adni. loni.usc.edu) (Supplemental Digital Content 1, http://links. lww.com/WAD/A94). 16 A total of 812 subjects (229 NC, 395 MCI, 188 AD dementia) participating in ADNI underwent cognitive testing, brain MRI, and clinical evaluations at baseline and up to 5 more times over a period of 3 years. Mean follow-up time was 2.3 ± 0.9 years. At baseline, subjects were aged 55 to 91 (inclusive), in good health, had a Modified Hachinski Ischemic Score r4, 17 and a Geriatric Depression Scale (short form) <6. 18 Subjects did not have a cortical stroke, multiple lacunar strokes, or a lacunar stroke in a critical memory structure on screening MRI, other neurological conditions, or active psychiatric disorders. Subjects with non-AD dementia (including vascular dementia) at baseline were excluded.\nSubjects were assigned to one of 3 diagnostic groups at baseline (NC, amnestic MCI, mild AD dementia) as previously described (Supplemental Digital Content 1, http:// links.lww.com/WAD/A94). 16 The local Institutional Review Board of each participating site approved this study. After all study procedures and risks were explained in detail, in accordance with local Institutional Review Board guidelines, written informed consent was obtained from all subjects and study partners."}, {"section_title": "Clinical Assessments", "text": "The Wechsler Adult Intelligence Scale-Revised Digit Symbol 19 was used to assess processing speed, complex attention, and visual scanning (lower scores indicate greater impairment; possible range, 0 to 110, in current analyses 0 to 87); the Rey Auditory Verbal Learning Test (RAVLT) 20 Total Learning score (ie, words recalled over 5 learning trials) was used to assess episodic memory performance (lower scores indicate greater memory impairment; range, 0 to 75); the Total Learning score reflects memory encoding which relates to aspects of executive function and is more likely to be associated with vascular disease and risk factors than memory storage; the Alzheimer Disease Assessment Scale Cognitive Subscale (ADAS-Cog) 13-item version 21 was used to assess global cognition (higher scores indicate greater impairment; range, 0 to 85); and the American National Adult Reading Test 22 (AMNART) intelligence quotient (IQ), was used to provide an estimate of premorbid verbal intelligence and serve as a proxy of cognitive reserve.\nA Vascular Index score was created to be similar in concept to the Framingham Study Stroke Risk profile 23 using the available information in the ADNI database. However, our intention was to create an index that specifically focuses on prior history of various vascular related conditions unlike the Framingham profile which also includes current physiological measurements, which we assessed separately (Supplemental Digital Content 1, http:// links.lww.com/WAD/A94). In the Vascular Index score 1 point was given for each of the following conditions if present at baseline or in the past: hypertension, hyperlipidemia, diabetes, myocardial infarction, atrial fibrillation, smoking, and stroke (range, 0 to 7). Other vascular disease and risk factors used in the analyses included: systolic blood pressure, serum glucose and total cholesterol, BMI, APOE4 carrier status (noncarrier, heterozygous carrier, homozygous carrier), WMH volume, and plasma homocysteine level. Missing values data for key predictors and dependent variables are provided in Supplemental Digital Content 1, http://links.lww.com/WAD/A94. WMH were detected on coregistered sets of T1, T2, and proton density MRI using an automated validated method yielding volume measurements corrected for cranial size. 14 The WMH measurement method used in our study was consistent with the recently published recommended neuroimaging standards. 24 WMH volume was available for 632 of the 812 subjects at the time the ADNI database was queried. Of the remaining 180 subjects, 170 subjects had adequate MRI scans; however, WMH volume data were not available for those subjects. When subjects with WMH volume data were compared with subjects without that data across all relevant baseline demographics and clinical variables, those with WMH volume data performed significantly differently (better) than those without only on Digit Symbol (P = 0.0009 after Sidak and False Discovery Rate corrections for multiple comparisons). The analyses outlined below were performed using the whole sample and repeated using the reduced sample with WMH volume data.\nDuration of AD dementia symptoms (in years) was used as a covariate. It was available only for AD dementia subjects and was set as zero for NC and MCI subjects to be able to include them in the analyses. Use of aspirin, antihypertensive drugs, and lipid-lowering drugs at baseline were each reported as dichotomous variables (present/ absent) and were included as covariates."}, {"section_title": "Statistical Analyses", "text": "All analyses were performed using SAS Version 9.2. As part of initial descriptive univariate statistical analyses, associations between diagnostic groups versus demographics, and baseline characteristics of subjects were assessed using analysis of variance with Bonferroniadjusted post hoc pairwise group mean comparison tests for continuous variables and the w 2 test for categorical variables, except for systolic blood pressure, serum glucose, and total cholesterol which had positively skewed distributions and were analyzed using nonparametric tests (Kruskal-Wallis). All of these associations are illustrated in Table 1 ."}, {"section_title": "Cross-Sectional Analyses", "text": "A general linear model approach was employed with backward elimination of predictors (P < 0.01 cut-off for all predictor terms, including interaction terms). Digit Symbol, RAVLT Total Learning, and ADAS-Cog scores were the dependent variables in 3 separate analyses. The predictors for these models were: vascular disease and risk factors and the interaction of each of these variables with diagnosis, sex, diagnosis, the interaction of diagnosis and sex, age (linear/quadratic effects), duration of AD dementia symptoms, AMNART IQ, use of aspirin, antihypertensive drugs, and lipid-lowering drugs. P values, partial unstandardized regression coefficient estimates (b) with confidence intervals (CI), estimates of percent variance in the dependent variable accounted for by the model as a whole (R 2 ), and the portion of this variance uniquely accounted for by each predictor term individually (unbiased population estimate, adjusting for the other predictors, o 2 ) were reported.\nThe inclusion of the interaction of vascular disease and risk factors with diagnosis allowed us to test for any differential relation of any given vascular variable to a given cognitive measure across diagnostic groups (Supplemental Digital Content 1, http://links.lww.com/WAD/A94). \n"}, {"section_title": "Longitudinal Analyses: Mixed-Effects Models", "text": "Mixed random and fixed coefficient longitudinal regression models were employed. A backward elimination procedure (P = 0.05 cut-off) was used on a large initial pool of fixed predictors and variances/covariances of random terms. The fixed predictors were vascular disease and risk factors and their interaction with time (in years), the covariates used in the cross-sectional analyses, and the baseline dependent variable and its interaction with time. The random predictors were correlated intercepts and linear slopes of time. Longitudinal Digit Symbol, RAVLT Total Learning, and ADAS-Cog scores were the dependent variables in 3 separate analyses. The squared correlations of predicted values from fixed and random predictor sets versus actual values were used to indicate the percent of variance of the dependent variable linearly accounted for by the predictors."}, {"section_title": "Longitudinal Analyses: Cox Proportional Hazards Models", "text": "We employed 2 separate Cox proportional hazards models to assess time to change in diagnosis from a baseline diagnosis of MCI to an endpoint diagnosis of AD dementia and from NC to MCI (Supplemental Digital Content 1, http://links.lww.com/WAD/A94). Thirteen subjects who progressed from a more impaired diagnosis to a less impaired diagnosis (MCI to NC) were excluded from the analyses. Subjects who remained stable at the specified baseline diagnosis were treated in the analyses as \"censored\" observations and the partial information they provided on time to change in diagnosis was used. Predictors were tested in a backward elimination algorithm (P < 0.05 cut-off). Predictors included vascular disease and risk factors, age, sex, AMNART IQ, use of aspirin, antihypertensive drugs, and lipid-lowering drugs. Hazard ratios (HRs) were reported. The assumption of proportional hazards was tested, and if it appeared questionable, results were confirmed with nonparametric survival analyses. \nOne hundred and fifty-six of 365 (42.7%) subjects with a baseline diagnosis of MCI progressed to AD dementia over the 3-year follow-up period, whereas 11 of 223 (4.9%) subjects progressed from NC to MCI."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Digit Symbol Score", "text": "Greater homocysteine level was marginally associated with lower Digit Symbol score, representing greater processing speed impairment (b = À 0.33, %Variance Total = 0.4, P = 0.02). In a second model including WMH volume, greater WMH volume was also associated with lower Digit Symbol score (b = À 0.71, %Variance Total = 2.4, P < 0.0001) ( Fig. 1) . Covariates that were significantly associated with Digit Symbol score were diagnostic group (NC subjects had greater Digit Symbol score than MCI and MCI greater than AD dementia) and AMNART IQ (greater AMNART IQ score was associated with greater Digit Symbol score) (R 2 = 0.29, P < 0.0001 for model), see \nGreater number of APOE4 alleles was significantly associated and greater WMH volume was marginally associated (at a trend-level) with a decrease in Digit Symbol score over time (b = À 0.84, P = 0.001 for interaction of APOE4 with time in the study; b = À 0.10, P = 0.06 for interaction of WMH with time). Additional significant fixed effect predictors of secondary interest were interaction of baseline diagnostic group with time (AD dementia subjects compared with MCI and MCI compared with NC were associated with a decrease in Digit Symbol score over time) and a linear effect of baseline Digit Symbol score (greater baseline Digit Symbol score was associated with higher Digit Symbol score over time) (R 2 = 0.76, P < 0.0001 for fixed-effects model; R 2 = 0.92 including random terms), see "}, {"section_title": "RAVLT Total Learning", "text": "Greater Vascular Index score was significantly associated with lower RAVLT Total Learning, representing greater memory impairment (b = À 0.86, %Variance Total = 0.4, P = 0.007) (Fig. 2) . Covariates that were significantly associated with RAVLT Total Learning were diagnostic group (NC subjects had greater RAVLT Total Learning than MCI and MCI greater than AD dementia), sex (females higher), age (greater age was associated with lower RAVLT Total Learning), and AMNART IQ (greater AMNART IQ score was associated with greater RAVLT Total Learning) (R 2 = 0.45, P < 0.0001 for model), see \nHigher serum total cholesterol was marginally associated (at a trend-level) with a decrease in RAVLT Total Learning over time (b = À0.006, P = 0.06), see "}, {"section_title": "ADAS-Cog Score", "text": "Greater number of APOE4 alleles was significantly associated with greater ADAS-Cog score, representing greater global cognitive impairment (b = 0.89, %Variance Total = 0.3, P < 0.007) ( Fig. 3) . Covariates that were significantly associated with ADAS-Cog score were diagnostic group (NC subjects had lower ADAS-Cog score than MCI and MCI lower than AD dementia), duration of AD dementia symptoms (greater duration was associated with greater ADAS-Cog score), and AMNART IQ (lower AMNART IQ score was associated with greater ADAS-Cog score) (R 2 = 0.59, P < 0.0001 for overall model), see www.alzheimerjournal.com | 21\nLongitudinal Analyses: Mixed-Effects Models\nGreater number of APOE4 alleles and higher serum total cholesterol were significantly associated with greater rate of increase in ADAS-Cog score over time (b = 0.65, P = 0.002 for interaction of APOE4 with time; b = 0.007, P = 0.02 for interaction of total cholesterol with time) (Fig. 4) . Additional significant fixed-effect predictors of secondary interest were interaction of baseline ADAS-Cog score with time (greater baseline ADAS-Cog score was associated with greater rate of increase in ADAS-Cog score over time), interaction of baseline diagnostic group with time (AD dementia subjects compared with MCI and MCI compared with NC were associated with greater rate of increase in ADAS-Cog score over time), and a linear effect of WMH volume (greater WMH volume was associated with an increase in ADAS-Cog score), serum glucose (lower glucose was associated with an increase in ADAS-Cog score), and age (greater age was associated with an increase in ADAS-Cog score) (R 2 = 0.75, P < 0.0001 for overall model fixed effects; R 2 = 0.95 including random terms), see "}, {"section_title": "MCI to AD Dementia Progression", "text": "Greater number of APOE4 alleles indicated significantly greater hazard to change from MCI to AD dementia (HR = 1.60, P < 0.0001, 95% CI for HR = 1.29, 1.98). There were no other significant predictors (Supplemental Digital Content 1, http://links.lww.com/WAD/A94)."}, {"section_title": "NC to MCI Progression", "text": "Greater homocysteine level, greater number of APOE4 alleles, and higher serum glucose indicated significantly greater hazard to change from NC to MCI (homocysteine: HR = 1.22, P = 0.02, 95% CI for HR = 1.01, 1.41; APOE4: HR = 3.07, P = 0.04, 95% CI for HR = 1.02, 8.67; glucose: HR = 1.03, P = 0.01, 95% CI for HR = 1.00, 1.05). There were no other significant predictors."}, {"section_title": "DISCUSSION", "text": "In a cross-sectional and longitudinal analysis of 812 well-characterized subjects, we found a significant association between increased vascular disease and risk factors (including APOE4 carrier status, homocysteine level, WMH volume, serum total cholesterol and glucose, and Vascular Index score) and cognitive impairment at baseline and over time in the AD spectrum after adjusting for diagnostic group, demographics, and medication use in a sample that was selected to have low vascular burden at baseline.\nIn the cross-sectional analyses, several types of vascular disease and risk factors were related to cognitive impairment. However, longitudinally, APOE4 carrier status appeared to be the main predictor of cognitive impairment and progression to a more impaired diagnostic group. APOE4 carriers are a particularly vulnerable group because of their high risk of development of AD dementia and the younger age at which AD manifests. 6 APOE4 has been shown to biologically relate to AD through its association with the metabolism of amyloid-b, as well as being a risk factor for small vessel ischemic disease, microinfarcts, and cerebral amyloid angiopathy. [5] [6] [7] 25 As such, APOE4 appears to contribute to cognitive decline and AD dementia through multiple mechanisms. 26 As said, we found an association between other aspects of vascular disease and risk factors and cognitive decline after adjusting for APOE4, especially cross-sectionally.\nOur cross-sectional analyses demonstrated an association between greater WMH volume, greater homocysteine level, and slower processing speed; greater Vascular Index score, representing a sum of 7 common vascular disease and risk factor elements obtained by history, and greater memory impairment; and APOE4 carrier status and greater global cognitive impairment. These results are in line with prior studies across the AD spectrum, including the 2 ADNI studies, demonstrating an association between WMH volume, poor executive function, and global cognitive impairment at baseline and over time. 14, 15, 27, 28 Those studies did not show an association between a combination of cardiovascular risk factors (similar to the Vascular Index score) and cognitive impairment at baseline or over time except for with poor executive function in MCI subjects only, but those studies did not look specifically at memory (separate from global cognition) as we did in the current study. The Rotterdam Scan Study, which is a populationbased study, showed an association between WMH and poor memory performance, in addition to poor processing speed, executive function, and global cognition. 29 It is possible that we were unable to see an association between WMH, memory, and global cognition due to the ADNI sample having low vascular burden at baseline and being enriched for AD pathology. Another recent populationbased study showed that regional (parietal) WMH was strongly associated with incidence of AD dementia. 30 A meta-analysis similarly indicated that greater baseline WMH were associated with increased risk of dementia; however, when looking at a subset of high-risk population studies focused on MCI, there was no increased risk of dementia. 27 The latter is in line with our results and other recent analyses of the ADNI data, which did not show an association between greater WMH and disease progression. 15 A recent longitudinal study with over 20,000 participants free of stroke and significant cognitive impairment at baseline showed that the Framingham Stroke Risk Profile (similar to the Vascular Index score we used), hypertension, and left ventricular hypertrophy predicted future cognitive decline using a screening cognitive test. 31 We had the advantage of more sensitive cognitive assessments and more carefully characterized subjects but had significantly fewer subjects. Elevated homocysteine level has been previously shown to be a risk factor for cerebrovascular disease, AD dementia, and cognitive impairment. [32] [33] [34] However, treatment with vitamin B 12 , B 6 , and folic acid, which successfully reduced homocysteine levels in subjects with already mild-moderate AD dementia, did not improve their global cognition. 35 In the current study, elevated homocysteine level was associated with slower baseline processing speed and risk of progression from NC to MCI.\nWe also found an association between higher baseline total cholesterol and greater memory and global cognitive impairment over time after adjusting for baseline use of lipid-lowering drug use. These results are in agreement with recent studies demonstrating an association between hypercholesterolemia and worsening global cognition and disease progression in MCI and AD dementia. 13, 36, 37 Within our own set of analyses, we also showed an association between baseline memory performance and prior history of vascular disease and risk factors captured by the Vascular Index score, which included a history of hyperlipidemia, suggesting a similar longitudinal association to the one found with the baseline measurement of serum total cholesterol and memory performance over time. Two potential explanations for the association between cholesterol, memory, and global cognition in the AD spectrum are the link between elevated cholesterol, specifically triglycerides, and microvascular disease in the brain, 37 and the link between elevated cholesterol, specifically low-density lipoprotein, and cortical amyloid deposition. 38 The 2 vascular risk factors in our study that were not associated with any cognitive measures at baseline or over time were BMI and systolic blood pressure. This is consistent with studies showing a lack of association between increased late-life BMI and cognitive decline, in contrast to increased mid-life BMI being a significant risk factor for AD and vascular dementia. 39, 40 Furthermore, increased late-life BMI has been associated with reduced risk of AD dementia. 41 In our study, we did not find an association between systolic blood pressure and cognitive function or disease progression. However, a prior large population study of community-dwelling individuals did show an association between elevated baseline systolic blood pressure and incident cognitive impairment. 31, 42 Similarly, a smaller study of individuals residing in assisted living facilities showed that a diagnosis of hypertension in those with a global Clinical Dementia Rating of 0.5 (similar to MCI) was associated with faster cognitive decline. 42 Different associations between vascular disease and risk factors and cognitive measures were obtained. These varied with regard to the cognitive measure assessed and the type of analysis (cross-sectional general linear model, longitudinal mixed-effects model, or longitudinal Cox proportional hazards model). This could be in part due to the sample available for each type of analysis. The crosssectional analyses had the largest sample size and all 3 diagnostic groups were represented and their effect was examined closely by including interaction terms between vascular variables and diagnosis. In the longitudinal mixedeffects analyses, those interactions were not included because interactions between vascular variables and time were more important. As such, the overrepresented MCI group could have driven the results of the longitudinal mixed-effects analyses, leading to similar results as those obtained from the Cox regression model assessing progression from MCI to AD dementia, where APOE4 carrier status showed a significant influence on progression. In contrast, processing speed was associated with WMH volume both cross-sectionally and longitudinally.\nThere were a few limitations of our study. Subjects participating in ADNI were very carefully selected to fit into the diagnostic groups of normal cognition for age, amnestic MCI, and mild AD dementia. Subjects with significant cerebrovascular disease, psychiatric disorders, or major health issues were excluded. NC subjects had a higher than usual proportion of APOE4 carriers. Thus, this sample was not representative of the general population. Furthermore, as ADNI was not designed to investigate the relationship between vascular disease and risk factors and cognitive decline, the variables making up the Vascular Index score were recorded as dichotomous values (present/ absent) and severity, duration, and timing of vascular risk factors were not accounted for. Therefore, there may have been underreporting or nonspecific reporting of vascular risk factors, which may have led to an underestimation of the effects of vascular risk factors on cognitive decline. The sample predominantly consisted of subjects with MCI, and therefore it is possible that this diagnostic group drove the results. However, the various models included interaction terms of vascular disease and risk factors with diagnostic group and those were not significant suggesting that diagnostic group did not modify the relationship between vascular disease and risk factors and cognitive impairment. Finally, due to our large sample, certain statistically significant results were not necessarily clinically relevant. Therefore, various designations of effect size were provided to better interpret the results.\nIn conclusion, these results suggest that there is a significant association between increased vascular disease and risk factors and cognitive impairment in the AD spectrum in the absence of significant baseline cerebrovascular disease. Future longitudinal observational biomarker studies, including the various extensions of ADNI, and clinical trials will help determine whether treatment of vascular disease and risk factors can prevent AD or slow down its progression. This will also help disentangle the vascular versus nonvascular effects of APOE4."}]