[{"section_title": "Introduction", "text": "The Federal government has recently emphasized conservation programs that reward environmentally-friendly practices on working farmland. For example, USDA's Environmental Quality Incentives Program (EQIP) is designed to help farmers institute conservation practices and integrate conservation structures into their farming operations. Initial funding for EQIP (1997 to 2001) was roughly $200 million annually. With the Farm Security and Rural Investment Act (FSRI) of 2002 funding for EQIP increased substantially ─ $5.8 billion over 6 years (2002)(2003)(2004)(2005)(2006)(2007), with annual funding levels increasing from $400 million in 2002 to $1.3 billion in 2007. In addition, FSRI also created the Conservation Security Program (CSP), which provides incentive payments to assist farmers in implementing and maintaining land-management practices on working lands, such as nutrient and manure management, integrated pest management, crop rotations, irrigation water management, and tillage/residue management. There are 151 practices recognized by the Natural Resources Conservation Service (NRCS) as reimbursable conservation activities. Many of these practices target soil erosion and water quality. A subset of these includes the installation of vegetative conservation structures compatible with working farmland: terraces, grassed waterways, riparian or herbaceous buffers, hedgerows, filter strips, and windbreaks (Aillery). These structures are usually compatible with crop operations associated with grain production, and have relatively large environmental payoffs, such as enhancing soil productivity or improving water quality (Smith). Given the panoply of reimbursable practices available to producers, increasing Federal budgetary constraints, and a growing need to demonstrate the environmental benefits of conservation programs, USDA initiated a pilot national survey in 2004, the Conservation Effects Assessment Project ─ Agricultural Resource Management Survey (CEAP-ARMS) to extend and enhance USDA's ability to assess the economic and environmental benefits of it's conservation programs. CEAP-ARMS was designed to address such critical policy questions as: what factors are associated with the decision to participate in working-land conservation programs? And, given successful enrollment into a working-land conservation program, what factors are associated with different levels of participation? Are financial incentives alone enough to increase participation effort, or are there other factors ─ such as personal goals or farm business reasons ─ important factors in the producer's decision to adopt conservation practices or participate in conservation programs? Using the 2004 CEAP-ARMS survey, which focused on wheat farmers, the objective of this paper is to address some of these questions by evaluating differences in producer/farm/environmental characteristics across the quantity of acres allocated to conservation vegetative structures by program and non-program participants. Identifying the relative importance of factors affecting producer conservation practice decisions may provide a better understanding of how farmers are likely to respond to alternative program designs and market incentives. The null hypothesis is that the average acres of conservation structures supplied by growers participating in a conservation program are not different from non-participants. Rejection of this hypothesis might imply that program incentives increase conservation effort using this metric. However, factors other than receiving incentive payments alone may be important with respect to the decision to participate in a conservation program, and subsequent levels of participation. We use a treatment effects, or \"impact\" model (Fernandez-Cornejo, Koltz-Ingram, and Jans) to correlate, holding other factors constant, farm structure, household characteristics and environmental factors on the amount of acres supplied by producers towards in-field conservation structures. This two-step procedure uses a probit regression in the first stage to estimate predicted values for the conservation program participation decision, and whether respondents consulted with an extension agent in the installation of a conservation structure. The second stage uses a tobit regression to estimate an acreage supply equation, censoring all other farms in the survey that did not have any acres allocated to in-field or perimeter conservation structures."}, {"section_title": "Factors hypothesized to influence the participation-acreage supply decision", "text": "Economists typically assume that the decision to adopt a specific farming practice is based on profit maximizing behavior given resource constraints. But the decision to practice good stewardship is not driven by profit alone. Roughly sixty-three percent of farm operators in the U.S. are classified as \"residential\" or \"lifestyle\" farmers, or are retired (USDA-ERS), suggesting that the decision to pursue farming is based on quality-of-life factors as well as the farm's ability to generate profits. Concerns over succession (Wilson; Battershill and Gilg), the desire to limit the time and energy spent farming (Lobley and Potter; Loftus and Kraft), and the need for income stability (Loftus and Kraft) can also affect decisions about farming practices and conservation program participation. Studies of farmer adoption of conservation practices and participation in conservation programs in the European Union and the U.S. have found that quality-of-life factors and personal attributes of farm operators also influence the decision. Caswell et al. found that farmer education and the operator's willingness to pursue offsite expert advice had a positive influence on the decision to adopt \"management-intensive\" conservation technologies in the U.S. Loftus and Kraft found that farmers who more frequently consulted extension agents were more likely to enroll land into conservation programs. Length of residency in a given location has also been found to be positively related with participation in the Environmentally Sensitive Areas Scheme in the European Union (Wilson, 1997). When adoption of a conservation practice implies a decreased revenue or increased input cost and management skills to maintain production levels, what would motivate such a change? The level of adoption costs may be one reason. Operators participating in conservation programs may find the out-of-pocket expenses of conservation practices much reduced through costsharing. But farm operators can also value land stewardship and the environment apart from any profit motive. Environmentalist sentiments may not be the exclusive province of any particular type of farm, but adoption of conservation practices may be more likely in environmentally sensitive areas and when the cost is relatively low. We develop a behavioral model to test the broad range of hypotheses related to why an operator might adopt a conservation practice. We assume that operators are rational agents who choose from a discrete set of management alternatives to maximize expected benefits from crop and/or livestock production over a time horizon. The operator must weigh the costs of foregoing potential returns from cropland in return for a guaranteed payment over a contractual period, and/or compensation for installation of in-field or perimeter conservation structures. The operator may (1) choose to participate in the conservation program and install conservation structures as evidenced by a contractual agreement covering a portion of the installation costs or other annual payments, (2) not participate in a conservation program but choose to install in-field or perimeter vegetative structures on a field, or (3) none of these. In the first two cases, producers may opt to seek technical assistance regarding the installation and/or management of a conservation structure. Characteristics hypothesized to influence the adoption of conservation practices include those that pertain to the farm, the farmer, the farm household, and the environment. Farm business and structure characteristics influencing adoption may include scope and diversification of production, tenancy, participation in commodity programs, and farm size. Important operator characteristics are likely age, education, and farming experience. Important household attributes include household size and off-farm income sources. Other relevant variables include sitespecific physical factors, farm location, and regional attributes. Participants are defined as respondents who indicated they had a written conservation plan for the field (or conservation tract), and who also identified either conservation financial assistance programs in the plan for the field or that conservation compliance applies to the field [i.e., the field is registered as meeting the requirements for \"Highly Erodible Land Conservation Compliance (HELCC)\"]. 1,2 Farm structure variables Total cropland acres operated was used to measure the influence of farm size on the decision to install working-land conservation structures (Kay and Edwards; Lynch, Hardie, and Parker). Cropland acres operated are hypothesized to be positively correlated with the acres supplied to 1 In addition to HELCC, conservation financial assistance programs included in the definition for \"participants\" involved the following programs: into their crop production operations. Educational attainment-measured as whether the operator had attended at least some college-was used to measure the relationship between human capital and decisions to install conservation structures (Lynch, Hardie, and Parker). Previous studies found that education is positively associated with participation in come conservation programs (Soule, Tegene, and Wiebe). It is expected that educational attainment will have a positive effect on the acres allocated to in-field or perimeter conservation structures. Household structure may be an indicator of the life stage of a farm household or operation, or a measure of the human resources available to the farm operation. The expected sign of this variable is ambiguous."}, {"section_title": "Environmental characteristics", "text": "Holding other factors constant, operations with fields that are located on fragile soils, susceptible to gully or wind erosion, or near streams or other water sources may be more likely to have preventative or corrective conservation structures in place to maintain or improve soil quality. On the other hand, operations that continue to farm fragile or highly erodible soils would be those most likely to be targeted by conservation policy. Field-specific soil fragility is measured using the 2003 Universal Soil Loss Equation (tons/acre/year) collected by the NRI. The presence of a gully and the proximity of the field to a stream or other water sources are measured using dummy variables. A proxy for field soil productivity is included using the 2003 per acre revenue from the previous crop grown."}, {"section_title": "Regional variables", "text": "The effects of farm location are measured using a set of dummy variables associated with the Economic Research Service's production regions. Regions include the Northern Plains, Southern Plains, Midwest, and Pacific regions. The Pacific region is the reference group. The regional variables control for differences in land prices, access to farm services, and differences in climate and growing seasons (Khanna). Effects of proximity to metropolitan areas and potential access to off-farm employment opportunities are measured using a variable indicating whether the farm was located in a metropolitan county."}, {"section_title": "Policy variables", "text": "Technical assistance-whether the operator consulted an extension agent in the design, "}, {"section_title": "Additional instruments", "text": "Additional instruments used in the first-stage probit regression include whether the farmer managed the field using conservation tillage, crop rotation, and whether structures had been installed to facilitate drainage. County-level instruments included indicator variables identifying farms located in counties that had experienced a decline in population between 1990 and 2000, whether the county was classified as being economically dependent on the service or manufacturing sector, and if the county was classified as a housing distressed county."}, {"section_title": "Empirical model and methodology", "text": "We use a treatment effects model to evaluate the impact of incentive payments and extension on the decision to install in-field or perimeter conservation structures, and the number of acres allocated to those structures. In doing so, we account for two sources of endogeneity. The first source is the simultaneity associated with the decision to participate in a conservation program that supports installation of vegetative, or other conservation structures; namely, the decision to adopt the practice, and the extent to which (or magnitude of) the adoption (i.e. acres allocated to the structure). The other source of endogeneity arises from self-selectivity. The procedure we use to attend to these issues follows Fernandez-Cornejo, Koltz-Ingram, and Jans. In the first stage, the decision to participate in the conservation program or to seek technical assistance is modeled using probit regressions. In the second stage, the acres supplied by all farms (program and non-program participants) are estimated using a tobit regression. Farms that had not installed any vegetative structures were the censored group: (1) Participation: P* i = γ′z i + v i , P i = 1 if P* i > 0, and Extension: Acres supplied: y* i = β′x i + δP* i + θE* i + e i ; y i = 0 if y i < 0, and It is expected that program participation will be highly correlated with technical assistance. But there are cases when producers who install conservation structures may seek outside, expert advice about installation and management of in-field or perimeter conservation structures, but choose not to participate in a conservation program. In the first case, the disturbance terms the first stage participation and extension equations would be correlated as in equation 4. It is also assumed that the covariance between the extension and participation equations and the acreage supply equations is zero (Cameron and Trivedi, 2005). Therefore, if the decisions are not independent, then the predicted values for the participation and extension decisions would be estimated using the bivariate cumulative density function: "}, {"section_title": "Results", "text": "The first section highlights the farm structure, household, and operator characteristics of participants and nonparticipants. The second part of this section presents the results of the regression an analysis. The system of equations was estimated twice. The first set of estimates is based on a combined portion of CEAP-ARMS that links field-level production data to household data (i.e. phase II and phase III, merged). Typically, there is about a 40% attrition rate for ARMS respondents between phase II and III. That is, for a variety of reasons, a phase II respondent cannot or may not want to participate in the phase III part of the survey, which covers wholefarm costs and returns, and household and operator characteristics. After eliminating nonresponses, the integrated sample size was 461 (expanded, 186, 729 farms, adjusting for nonresponse of some variables). In the second regression analysis, the phase II CEAP-ARMS data was used (N = 686 respondents, adjusting for non-response of some variables; expanded, 1,010,908 farms)."}, {"section_title": "Descriptive comparison of participants and non-participants", "text": "We identified significant characteristic differences between conservation program participants and non-participants, and also across farm-size classes. The definition of farm-size class makes use of the associated Phase III ARMS follow-on data. However, because of the relatively small Phase III sample size, we aggregated the ERS typology into three farm-size classes: (1) retired/residential/lifestyle farms; (2) farming-occupation farms with total sales < $100,000; and (3) farming-occupation farms with total sales ≥ $100,000. 3 The 2004 CEAP-ARMS (for wheat) indicated that only about 17 percent of the field/farms surveyed were associated with conservation program participants, i.e., that most wheat producers (83 percent) did not enroll wheat acreage in USDA conservation programs (Figure 1). However, among the program participants, a slightly larger share were from retired/residential/lifestyle and low-sales farms. The average conservation program participation rate ranged from 15.3 percent for highersales farms to 19.1 percent for retired/residential/lifestyle wheat farms. These relatively low participation rates clearly indicate the importance of understanding more about the characteristic differences between program participants and non-participants. While nearly 80 percent of wheat acres for 2004 were associated with farms that did not participate in conservation programs, wheat farms that did participate in such programs differed in a number of significant ways from non-participant farms. In addition, differences in characteristic values are generally statistically-significant across farm-size classes (Table 1). While higher-sales farms among program participants on average operated about 3,335 acres, similar type farms among non-participants operated approximately 2,155 acres. The opposite is true for both small farm-size classes; that is, acres operated were less for participants than for non-participants. However, participant wheat farms generally owned a larger share of the farm's operated acres (a higher tenure rate; owned acres/operated acres), with retired/residential/lifestyle and low-sales farms among participants with the highest tenure rates (ranging from 85 to 93 percent). From a farm financial perspective, non-participant wheat farms were generally less dependent on farm revenue from wheat production across all farm types, than were participants. Even so, these non-participant farms produced higher 2004 farm production value, both indicators of greater farm diversification. Non-participants also generally had larger farm equity (net farm worth) than participants. However, both the retired/residential/lifestyle and the farming-occupation low-sales farms among non-participants had higher net farm incomes than did participant farms, while participating higher-sales farms exceeded the net farm income of similar non-participating farm types by nearly 52 percent. For conservation program participants and non-participants, farm operators for highersales farms were generally found to be younger than operators for other farm types. Operator age ranged from 50 -53 years for higher-sales farms, to 54 -57 years for retired/residential/lifestyle farms, and from 55 -60 years for farming-occupation, lower-sales farms. However, the distributional effect shifted slightly for college education and off-farm work. While for non-participants the percent of 2004 wheat farm operators with some college education was highest for higher-sales farms (at 27 percent), it was highest among program participants (at 72 percent) for retired/residential/lifestyle farm operators. On the other hand, retired/residential/lifestyle farms had the highest percent of primary operators who earned offfarm income, ranging from 67 to 85 percent, for non-participants and participants, respectively. Farming-occupation, higher-sales farms among participant farms were the least associated with the primary operator working off-farm. Higher-sales, 2004 wheat farms participating in commodity programs, for both participants and non-participants, received the largest total government payments (ranging from $32,276 to $42,171 per farm). However, these payments were heavily influenced by the average size of their direct government (AMTA) payments. Even so, for 2004, larger farms participating in conservation programs received higher government conservation payments ($16,623 per farm) than did other program participating farms (ranging from $6,576 for retired/residential/lifestyle farms to $5,829 for farming-occupation, low-sales farms). From an agri-environmental perspective, larger non-participating farms produced the highest 2004 wheat yields (54 bu./acre), but they also applied the highest amount of nitrogen (77.3 lbs./acre). We found that these farms accounted for the largest number of wheat acres planted (47.2 percent) in 2004. In addition, the average USLE soil loss for these acres was 2.5 tons/acre/year, while soil loss for wheat acres for similar participating farms was at 4.3 tons/acre/year. The soil loss rate was highest for retired/residential/lifestyle farms participating in conservation programs, but these farms accounted for only 4.3 percent of 2004 wheat acres planted. The percent of farms with gully erosion occurring in wheat fields was evenly distributed across most 2004 wheat farm types (ranging from 6.5 to 9.5 percent), except for non-participant lower-sales farms, where gully erosion was present for 16.5 percent of these farms. Additionally, where the 2004 wheat field was adjacent to a water body, intermittent stream, or wetlands, most of these fields were associated with non-participant farms. This critical environmental linkage was associated with approximately 45 percent of low-sales and 34 percent of higher-sales non-participant farms (which accounted for 58 percent of all wheat farms). However, this distributional effect again shifted for the percent of wheat field acres where Highly Erodible Lands (HEL acres) were present. The presence of HEL acres associated with 2004 wheat fields was more dominant among participating farms, specifically accounting for 33 and 68 percent of wheat acres from participating retired/residential/lifestyle and farming-occupation higher-sales farms, respectively. On the other hand, the percent of wheat acres with wetlands in or around the field was highest for lower-sales farms, ranging from 13 to 18 percent for nonparticipants and participants, respectively. For other farm types, the percent of 2004 wheat acres with wetlands in the field were either relatively small or there was insufficient survey information to make an estimate."}, {"section_title": "Conservation Practices Applied to U.S. Wheat Production", "text": "For economic, conservation, and environmental reasons, producers had adopted a variety of land-management and structural conservation practices on wheat producing acres: crop rotation, conservation tillage, scouting for pests, applying nutrient tests, use of variable rate technology (VRT) for seed and/or fertilizer application, use of GPS-based soil map information, installation of one or more conservation structural practices, and intensive use of alternative pest management practices. 4 In 2004, farming-occupation higher-sales wheat farms not participating in conservation programs were by far the dominant users of all eight land-management practices (fig. 2). These farms accounted for 47 percent of wheat acres (within the 16 CEAP-ARMS surveyed States) and for 46 -52 percent of wheat acres that applied crop rotations, were scouted for pests, used nutrient tests, applied 1 or more structural practices in the field, or intensively applied pest-management practices. These farms also accounted for 60 -70 percent of wheat acres that used conservation tillage, variable rate technology for seed and/or fertilizer application, and use of a Global Positioning System (GPS) to geo-reference (map) the soil properties of the wheat field. Our analysis of the 2004 CEAP-ARMS data for wheat suggests that while conservation program participants likely make a significant positive contribution to reducing agricultural-induced environmental damages, the largest contribution to environmental benefits likely originate from higher-sales farms not participating in conservation programs. Wheat producers have installed a variety of structural practices in wheat fields designed to reduce wind and water-based soil erosion, protect surface-water sources, and enhance agricultural bio-diversity, including creating/enhancing natural habitat pathways across the 4 \"Pest-management intensity\" is defined as when a producer applies five or more pest-management practices to a selected field .Alternative pest-management practices for a selected field may include such direct activities as scouting for pests (at various levels of intensity), keeping detailed written or electronic records, making use of published threshold information, using field mapping data, use of diagnostic laboratory analysis for pest identification, use of soil/plant tissue testing, use of beneficial organisms in the field, use of a trap crop, as well as other indirect activities designed to manage or reduce the spread of pests such as plowing down of crop residue, rotating crops, use of ground cover or mulches, use of no-till or minimum till, adjusting row spacing, plant density, or row direction, cleaning field equipment after completing a field operation, removal of crop residue from the field, use of cultivation for weed control, and/or chopping, spraying, mowing, plowing or burning field edges, ditches, roadways, or fence lines. agricultural landscape ( fig. 3). 5 However, in 2004, acres devoted to terraces were the dominant structural practice installed across wheat acreage, accounting for 82 and 67 percent of structural practice acres for conservation program non-participants and participants, respectively. Again, program non-participants play a dominate role in the use of these practices, as evidenced by the fact that these farms account for 76 percent of wheat acres."}, {"section_title": "Regression results", "text": "The first stage, bivariate probit results of the impact model using the merged phase II/III integrated data indicate that the decision to participate and to seek technical assistance were highly correlated at the 1% level (ρ = 0.90) (table 2). For the program participation equation, tenure (owned/operated land ratio) and the previous year's revenue from crop production on the field were positively and negatively correlated with the participation choice, respectively, at the The first stage probit estimates estimated using the full phase II CEAP-ARMS produced relatively more significant results in term of explaining participation and use of technical assistance (table 3). Program participation and the decision to seek technical assistance were highly correlated (ρ = 0.84). Sentiments for wildlife were positively associated with the program participation decision, but the location of the field next to a stream or water source was negatively associated with participation. Sentiments for wildlife were also positively associated with the decision to seek technical assistance. Larger farms were found to be more likely to seek some sort of technical assistance, holding other factors constant. The variables indicating whether a respondent participated in a conservation program or had sought technical assistance were replaced by their predicted values in the acreage supply equation (table 4). Based on the integrated phase II and phase III data, farms more focused on corn, soybean, and wheat production allocated about 2 more acres to in-field or perimeter conservation structures than other operations, all lese equal. Sentiments for wildlife were also positively associated with the acres supplied to riparian buffers, contour strips, grass waterways, wind breaks, etc. On average, operators who had attended at least some college supplied about 3 more acres to conservation structures, but larger households appear to supply less. Use of technical assistance and program participation did not appear to be related with the acreage supply decision using the integrated data. However, based on the complete phase II data alone, farmers participating in a conservation program tended to supply more acres to in-field or perimeter conservation structures, holding other factors constant. Operators who were considered participants had about 0.5 more acres of in-field conservation structures compared to nonparticipants at the 10% confidence level. Operators farming fields with fragile soils were also more likely to allocate about 0.35 more acres to in-field or perimeter conservation structures. Proximity of the field to a stream or other water source was also positively associated with conservation structure acres."}, {"section_title": "Conclusions", "text": "The paradigm of modern farmland conservation policy shifted with debut of EQIP and the introduction of the continuous signup provision of the Conservation Reserve Program in 1996. For nearly a decade, farmers that continue to rely on revenue from agricultural production have had a wide array of alternatives from which to choose regarding adoption of environmentalfriendly conservation practices in particular and participation in conservation programs in general. Today, EQIP, some components of the CRP, and the CSP continue to reimburse farmers for adopting 'working-land' conservation practices. In many instances, farmers volunteering to participate in one or more of these programs are motivated to maintain soil productivity, protect water sources, or enhance rare and endangered habitats, and remain competitive in agricultural markets. To better understand the impacts these programs might have on farmer well-being and the environment, the USDA launched a pilot survey, the CEAP-ARMS, in 2004. This integrated survey was designed to give researchers and policy analysts a more composite picture of the interplay between conservation programs, other commodity programs, farm household wellbeing, and environmental outcomes. We used the CEAP-ARMS to profile the characteristics of farms participating and not participating in these programs. We also developed an impact model to estimate, holding other factors constant, the effects of program participation on a subset of conservation decisions -namely the installation of in-field or perimeter conservation structures -and the factors associated with the participation decision. Conservation practices differ by farm type and participation. For example, sixty-four percent of wheat acres under conservation tillage are operated by high-sales farms not participating in conservation programs. But program participants across all farm-sizes accounted for only twenty-two percent of conservation tillage acres for wheat. Further, one-third of nonparticipating farms did use conservation tillage, whereas about half of the program participant farms did use conservation tillage. Lack of equipment was the dominant reason for not adopting conservation tillage for both program participants and non-participants. And, consistent with other research, it appears that larger operations appear to adopt some conservation practices for the simple reason that it is good business to do so. Contrary to some other studies, it appears that household and operator characteristics are not a primary motivating factor behind the decision to participate in conservation programs (as defined in this analysis). However, higher educational attainment and smaller household size appear to be associated with higher participation levels. Omitting some key household and farm structural variables (because they are not available in the phase II survey), it does appear that program participation is positively associated with levels of conservation practices. While we cannot establish causality in our models, we did find some evidence that farmers participating in a conservation program tend to have more acres allocated to in-field or perimeter conservation structures than farms not participating in these programs. Some key questions remain for future studies. For example, what is the 'reservation price' for producers not participating in conservation programs, but who still operate fragile or environmentally sensitive land? How can the 'marginal participant' be identified, and what would they be willing to accept in terms of cost-sharing adoption of conservation practices or technologies? The CEAP-ARMS may have the detail to sort through these difficult questions Answers to these questions are important for conservation program design, delivery, and implementation. "}]