[{"section_title": "Abstract", "text": "This study aims to describe the increasement differences of mathematical connection ability (MCA) and differences in self-efficacy (SE) of students in both classes, and the relation of SE and MCA. The method of this research use quasi-experimental with pretest-posttest control group design. The subjects of the study were 50 students from two classes in the seventh grade determined purposively from one of the schools in Cimahi City. The research instrument consisted of MCA tests and SE scales. Data analysis carried out was percentage calculation, mean difference test, and Pearson correlation test at 5% significance level. The conclusion of the results of this study states that there was a difference in the increasement in MCA between students in both classes in the medium category, where the increasement in MCA of students learning using the PBL approach with multimedia (PBLM) was better than students who used the PBL approach only. There were no differences in SE of students in both of research classes and were in a low category. There is a positive relation between SE and MCA in the medium category.\nMathematical Connection Ability (MCA), Self-Efficacy (SE), Problem Based Learning Approach with Multimedia (PBLM)\nPenelitian ini bertujuan untuk mendeskripsikan perbedaan peningkatan kemampuan koneksi matematik (KKM) dan perbedaan self-efficacy (SE) siswa di kedua kelas, dan hubungan SE dan KKM. Metode penelitian menggunakan eksperimen dengan desain pretest-posttest control group. Subjek penelitian adalah 50 siswa dari dua kelas di kelas tujuh ditentukan secara sengaja dari salah satu sekolah di Kota Cimahi. Instrumen penelitian terdiri dari tes uraian KKM dan skala SE. Analisis data yang dilakukan berupa perhitungan persentase, uji perbedaan rerata, dan uji korelasi Pearson pada tingkat signifikansi 5%. Kesimpulan dari hasil penelitian ini menyatakan bahwa ada perbedaan peningkatan KKM antara siswa di kedua kelas dalam kategori sedang, di mana peningkatan KKM siswa yang pembelajarannya melalui pendekatan PBL dengan multimedia (PBLM) lebih baik daripada siswa yang menggunakan pendekatan PBL saja. Tidak ada perbedaan SE siswa di kedua kelas dan berada pada kategori rendah. Ada hubungan positif antara SE dan KKM siswa pada kategori sedang."}, {"section_title": "INTRODUCTION", "text": "21st-century challenges encourage students to improve high order thinking skills because with this it is expected that students are able to understand what they have to do in all situations. One effort that can be done is through mathematics given at school. Mathematics Hard skills trained in school has a strategic role in improving developing students' thinking skills. in addition, soft skills are very necessary and need to develop in students as an effort to face challenges in the future. Mathematical connection ability is one of the important mathematical hard skills developed by students. One of the soft skills students must have is self-efficacy.\nThe mathematical connection ability (MCA) in this study is sumarized from (Hendriana, Slamet, & Sumarmo, 2014; Irjayanti & Heri, 2015; and Rismawati, Irawan, & Susanto, 2017) interpreted as students' ability to connect various mathematical concepts and procedures that have been owned , and link it with everyday problems and other scientific fields. The MCA indicators include: (a) Understanding the same concepts of mathematical procedures faced; (b) Applying mathematics to everyday problems; (c) Integrate mathematics with other fields of science; and (d) Connecting between mathematical concepts. Regarding the importance of MCAs developed by students, summarized from (Anita, 2014 and Sumarmo, 2017 : 83) , that students are able to control higher mathematical concepts, expand students' insights, open mindset that mathematics is a connected process with other fields of science.\nOne of the important soft skills students have is self-efficacy (SE). The SE in this study is summarized from (Pajares & Miller, 1994; Bandura, 2009; Cahyono & Budiartono, 2016; and Rahmi, Nadia, Hasibah, & Hidayat, 2017) interpreted as students' self-confidence in understanding and solving mathematical problems. SE indicators include: (a) Overcoming difficulties in solving mathematical problems; (b) realize the strengths and weaknesses in solving mathematical problems; (c) Having resilience in facing mathematical problems; (d) able to make decisions at all risks; (e) understand the responsibility for tasks to be completed; (f) Interacting positively with others; and (g) Not giving up easily. Summarized from (Bandura, 2000; Cahyono & Budiartono, 2016; and Subaidi, 2016) about the importance of SE, that SE can influence students' thinking, intellectual development, and how students make the right decisions with various risks faced.\nThe reality in the field as stated (Mandur, Sadra, & Nengah, 2013; Lestari, 2014; and Tresnawati, Hidayat, & Rohaeti, 2017) that, MCA of students are still low or not optimal. The experience of researchers when in class, some students seem unable to solve mathematical problems until they were finished. Students look not optimal in connecting the appropriate concepts in solving mathematical problems. Students feel unsure of their ability to give opinions and answers, give up and are not enthusiastic when given high-level math problems. Some of these things are suspected that MCA and SE of students are not optimal, and are likely to hinder students in facing the challenges of the 21st century.\nAfter describing the importance of MCA and SE and looking at the reality in the field, the researchers suspect that there is a link between SE and MCA, this is in line with the opinion of (Adni, Nurfauziah, & Rohaeti, 2018) , which states there is a relationship between MCA and SE, where SE serves to train student MCAs. It is necessary to find alternative learning solutions in improving the reality in the field. The researcher proposed the use of a learning approach to problem based learning with multimedia (PBLM). The learning approach has characteristics that match the existing problems, this is in line with the results of the opinion (Rohaeti, Hendriana, & Sumarmo, 2019) , that the characteristics of the PBL approach make students shape new knowledge by linking previously owned knowledge.\nThe approach to problem-based learning with multimedia (PBLM) in this study is a modification of the PBL approach by utilizing multimedia as a learning support media. The PBL approach is summarized from (Permana & Sumarmo, 2007; Nugraha & Mahmudi, 2015; Yusmanto & Herman, 2016; and Rohaeti et al., 2019) , that the PBL is an approach or learning model by giving high-level mathematical problems during the learning process. Multimedia used in the PBL approach is in the form of short video shows on daily problems, animation videos, Microsoft PowerPoint, and short videos of student assignments. Using multimedia on PBL is expected to help students understand mathematical problems in everyday life and connect them with various mathematical concepts. Other expectations can help teachers more easily convey abstract material. This is in line with the the results of study by (Hartanto, 2013) who reported that by using interactive multimedia learning media, teachers felt easier in delivering lesson material of mathematics.\nPBLM in this study is interpreted as a learning approach by giving mathematical problems to students with the help of multimedia shows during the learning process. The learning steps consist of 5 phases as follows: (a) Phase 1, activities focus students on a given problem; (b) Phase 2, activities focus on students to explore learning activities; (c) Phase 3, focusing activities to discuss resolving mathematical problems given; (d) Phase 4, presenting the results of the discussion and answers to the problems given; and (e) Phase 5, analyze and respond to the problem solving process. By using PBLM in mathematics learning, it is expected to grow student SE, this is in line with research (Dunlap, 2005) which states that SE changes occur when involved in a problem-based environment.\nFrom the explanation described, the researchers suspect that PBLM can increasement of student MCA. So the purpose of this study was to describe the differences in the increasement in MCA and SE through the PBLM approach. The formulation of the problem in this study is as follows: (a) Is there a difference in the increase in MCA between students whose learning uses the PBLM approach and whose learning uses PBL only ?; (b) Are there differences in SE students in both classes ?; (c) Is there a relations between SE and MCA?."}, {"section_title": "METHOD", "text": "This research used a quasi-experimental method with the pretest-posttest control group design. 50 students comes from two classes seventh grade who were selected purposively from one of the schools in Cimahi. PBLM approach was used in the experimental class and the PBL approach was used in the control class. The data analysis technique used the percentage calculation, mean difference test, and Pearson correlation analysis at the 5% significance level. The research instruments used, MCA tests as many as 4 items for the description of social arithmetic with the decision of the validity of the test and the reliability of the tests categorized as high, the distinguishing tests were categorized as enough, and the index of difficulty was categorized as medium. The SE scale consisting of 28 items, consisting of 14 negative and positive statements from 7 SE indicators. Each statement on the SE scale has 4 alternative answers with the lowest score of 1 and the highest 4. Items of the MCA essay test sample and SE scale are presented as follows."}, {"section_title": "Example MCA Question Item Volume 2, No. 2, June 2019 pp 74-81", "text": ""}, {"section_title": "77", "text": ""}, {"section_title": "Indicator", "text": ": Understanding the same concepts of mathematical procedures faced Question Item : At the time of the big harvest, a trader buys 7 baskets of mangosteen with a total price of IDR 650,000. Each basket contains 20 kg of the mangosteen fruit. The transportation costs incurred are IDR 50,000. All of the mangosteens was sold out and the trader made a profit of IDR 630,000. a) Make a mathematical model of the information! b) Determine the average selling price of mangosteen each kg, explain the steps that are used correctly!"}, {"section_title": "Example SE Scale Item", "text": "One of the indicators of the SE scale item is presented, is able to make decisions at all risks. Students give a sign (v) in the response box, for SA = Strongly Agree, A = Agree, D = Disagree, SD = Strongly Disagree. Sample item of SE scale as in Table 1 . Tabel 1. Self-Efficacy Scale Statement Response SA A D SD I dare to try new ways even though there is a risk of failure I avoid trying different ways than the teacher exemplifies I am willing to be appointed as a leader of the mathematics group I am afraid to represent the group for presentations in front of the class\nThe response chosen by students in each statement given must be in accordance with their feelings."}, {"section_title": "RESULTS AND DISCUSSION", "text": ""}, {"section_title": "Comparison of Increasement Student MCA", "text": "A statistical description of the results of the MCA scores of students in both classes is presented in Table 2 below. Table 2 shows that the mean of MCA pretest score in the experimental class was 6.96, the posttest average the score was 28.36, and N-Gain was .65. For the control class, the mean of the MCA pretest score was 7.04, the posttest average score was 23.96, and N-Gain was .51. The N-Gain difference between the two classes is .14. This interprets that the increasement in the MCA of the experimental class students is higher than the control class, and both are in the medium category.\nTo strengthen these interpretations, it is necessary to know the significance of the difference in N-Gain of MCA in the two classes. Analysis of relevant statistical tests is using the mean difference test. The average of N-Gain data is known to be normally distributed and homogeneous, and then the test analysis of the N-Gain average difference with the t-test at a significance level of 5%. The results of the analysis are presented in Table 3 below. Table 3 shows the sig value. (2-tailed) of .015 which means that there is a significant difference in the increasement in MCA of students in both classes. To find out which classes have better improvement, we can look back at the descriptive N-Gain statistics in Table 2 which shows that the increasement in MCA of students whose learning through the PBLM approach is better than students who learn through the PBL approach only. This finding is in line with the results of the study (Permana & Sumarmo, 2007) which reported that MCA students through PBL were better than students through conventional learning."}, {"section_title": "Differences in Student SE Mean Scores", "text": "The statistical description of the average SE score of students in both classes is presented in Table 4 below. From Table 4 , the mean SE score of the experimental class is 10.82 or 67.65% and the SE score of the control class is 10.49 or 65.54%. The difference in the average score of both is .33 or 2.1%. This shows that the SE scores of students in both classes are not very different.\nTo strengthen these interpretations, it is necessary to know the significance of the difference in mean SE scores in both classes. Analysis of relevant statistical tests, is using the mean difference test. The mean SE data score is known to be normally distributed and homogeneous, and then the test analysis of the mean difference in SE scores with t-test at a significance level of 5%. The results of the analysis are presented in Table 5 below. Table 5 shows the value of sig. (2-tailed) is .284, which means there is no difference in SE students in both classes significantly and in a low category"}, {"section_title": "Relation of SE and MCA", "text": "To find out whether or not there is a relation, the direction of the relation, and how strong the relation between SE and MCA is in the experimental class, in this study using Pearson correlation analysis with a significance level of 5%, this is in line with (Priyanto, 2016 : 35) .\nThe results of the analysis test are shown in Table 6 below. From Table 6 it can be seen that the correlation coefficient value is .470. This value is positive, this shows the relation between SE and MCA is positive and can be interpreted that, the higher SE, the higher student's MCA. And the correlation coefficient shows the relation between SE and MCA in the medium category. The sig value. obtained by .018, this can be interpreted that there is a significant relation between SE and MCA students. This finding is in line with the results of the study (Nurfauziah, 2012) reporting that there is a relationship between MCA and SE students. The findings in this study are similar to the results of the study (Rahmi et. al., 2017) which reported that SE affects students' mathematical communication skills. Research results (Jatisunda, 2017) report that there is a positive relationship between mathematical problem-solving abilities and student self-efficacy."}, {"section_title": "CONCLUSION", "text": "Based on the findings and discussion it can be concluded, that there is a difference in the increasement in MCA of students in both classes in a significant and medium category, where the increasement in MCA of students in the classroom through PBLM learning is better than students in the classroom learning through PBL only. There is no difference in SE between students in the experimental class and the control class as a significant and low category. There is a positive relation between SE and MCA students in the experimental class and in the medium category."}]