[{"section_title": "Abstract", "text": "Area Sampling Frames (ASFs) are the basis of many statistical programs around the world. To improve the accuracy, objectivity and efficiency of crop survey estimates, an automated stratification method based on geospatial crop planting frequency and cultivation data is proposed. This paper investigates using 2008-2013 geospatial corn, soybean and wheat planting frequency data layers to create three corresponding single crop specific and one multi-crop specific South Dakota (SD) U.S. ASF stratifications. Corn, soybeans and wheat are three major crops in South Dakota. The crop specific ASF stratifications are developed based on crop frequency statistics derived at the primary sampling unit (PSU) level based on the Crop Frequency Data Layers. The SD corn, soybean and wheat mean planting frequency strata of the single crop stratifications are substratified by percent cultivation based on the 2013 Cultivation Layer. The three newly derived ASF stratifications provide more crop specific information when compared to the current National Agricultural Statistics Service (NASS) ASF based on percent cultivation alone. Further, a multi-crop stratification is developed based on the individual corn, soybean and wheat planting frequency data layers. It is observed that all four crop frequency based ASF stratifications consistently predict corn, soybean and wheat planting patterns well as verified by the 2014 Farm Service Agency (FSA) Common Land Unit (CLU) and 578 administrative data. This demonstrates that the new stratifications based on crop planting frequency and cultivation are crop type independent and applicable to all major crops. Further, these results indicate that the new crop specific ASF stratifications have great potential to improve ASF accuracy, efficiency and crop estimates."}, {"section_title": "Introduction", "text": "It is well known that the purpose of stratification is to increase the efficiency of estimators by grouping sampling units into relatively homogeneous strata. Area Sampling Frames (ASFs) have been used by the National Agricultural Statistics Service (NASS) since 1954 as a primary tool for conducting surveys to gather information on crop acreage and other agricultural information. They are considered \"the backbone to the agricultural statistics program of the National Agricultural Statistics Service\" (Ford et al. 1986; Vogel 1995; Nusser and House 2009; Arroway et al. 2010; Cotter et al. 2010 ). NASS's primary area frame based survey is the June Area Survey (JAS) in which approximately 11 000 one square mile sample segments are visited by enumerators each year at the beginning of the growing season to collect crop type and acreage information. Estimates of crop acreage and livestock inventories are based on the data collected during the JAS. The NASS stratification is based on a categorization of the land into agricultural intensity groups based on percent cultivation. This traditional stratification of land cover has been conducted using visual interpretation of aerial or satellite data, or topographic maps since the 1950s. This traditional state area frame stratification method has been widely used around the world (Cotter and Tomczac 1994; Hanuschak and Morrisey 1978; Villalabos and Wallace 1998; Cotter et al. 2010) .\nThere are different varieties of the area frame stratification method and its applications. The European Union (EU) Monitoring Agricultural Resources (MARS) remote sensing project used the NASS traditional ASF construction method to conduct the Land Use/Land Cover Area Frame Survey (LUCAS) in 1988. They proposed using a regular grid of square segments instead of physical boundaries (roads, railroads and rivers) for segment delineation to reduce cost (Gallego et al. 1994) . The LUCAS sample units are points defined as 3 m diameter circles (Gallego and Delincè 2010) . The original objective of the LUCAS was to provide annual European crop estimates. These objectives were expanded to include the collection of land use and environmental monitoring data (Gallego and Delincè 2010) . The Italian Agricultural Survey (AGRIT) program uses an area frame created from a regular grid of points with a resolution of 500 m. Point sampling is used for data collection for the multi-purpose survey to derive combined estimates of crop acreage, yields and land use (Carfagna and Gallego 2005; Benedetti et al. 2015) . The Utilization du territoire (TER-UTI) is an annual survey conducted by the French Ministry of Agriculture, in which a grid area frame and sample points are used to collect land use and land cover information as well as to derive an estimate of land cover change. In 2005, the survey was redesigned to provide consistency with the TER-UTI. The survey is now known as the TER-UTI LUCAS (Benedetti et al. 2015) . A combination of area sampling frames and list sampling frames are used for agricultural surveys in Brazil, Canada, Honduras, the U.S. and Albania, while an ASF alone is used in Argentina, Morocco, Nicaragua, Pakistan, Columbia, Costa Rica, Dominican Republic, El Salvador and Guatemala, France, Italy and Spain (Villalabos and Wallace 1998) . In addition, ASFs were used in a variety of agricultural research studies such as: 1) evaluation of the prevalence of brown stem rot in the north central U.S. (Workneh et al. 1999) , 2) improvement of agricultural ground survey estimates as part of the MARS project launched by the European Union in 1989 (Tsiligirides 1998) , 3) comparing the utility of frequently used estimators based on an ASF utilized in agricultural surveys (Faulkenberry and Garoui 1991) and 4) development of crop area estimation at a regional level in the Islamic Republic of Iran (Pradhan 2001) .\nThe majority of area sampling frames are developed using visual interpretation of aerial photography or satellite data for stratification. Geospatial data are not used in a fully automated manner in any of these applications. Boryan et al. (2015) recently developed a new automated stratification method that utilized available NASS geospatial data Cropland Data Layers (CDLs) (Boryan et al. 2011) , rather than using visual interpretation of satellite imagery and aerial photography (traditional method) to define percent cultivation of land areas. The new method resulted in ASFs with significantly improved accuracy, in strata with greater than 15% cultivation, as well as, improved objectivity and efficiency at reduced cost (Boryan et al. 2014a ). This automated stratification method was integrated into NASS Area Frame construction operations and evolved into a hybrid process which combines automated geospatial stratification with manual editing and review (Boryan et al. 2014a; .\nInformation on the geospatial distribution of future crop specific planting is critical for improving agricultural survey estimates (increasing the efficiency), and other agricultural business related decision making, such as agricultural production planning and agricultural product commodity inventory control. The NASS's traditional area sampling frame stratification and the CDL based automated stratification method (Boryan et al. 2014a) , are based on spatial percent cultivation data, which have very limited predictability of future crop planting. To improve geospatial predicative information regarding future crop planting, Boryan et al. (2015) developed US national 30 m resolution crop specific planting frequency data layers using multi-year CDL data (Boryan et al. 2014b) . These data sets provide crop specific planting frequency information for major crops such as corn, soybean, wheat and cotton. The Crop Planting Frequency Data Layers and Cultivation Layers are highly accurate (USDA, NASS 2016). Using Crop Planting Frequency Data Layers for crop specific area frame stratification is therefore proposed in this paper to improve the predictive capability of the developed area frame so that ultimately the obtained estimates will be more accurate and with smaller coefficients of variation.\nIn this paper, three single crop (corn, soybean and wheat) specific stratifications are developed individually using the specific Crop Frequency Data Layers of interest. The corn, soybean or wheat specific planting frequency strata are substratified based on percent cultivation resulting in 32 unique strata (per frame). The substratification was conducted to determine if it was possible to identify where \"other\" crops (other than targeted crops), would be planted. The single crop specific stratifications are not intended for direct use to stratify the NASS ASFs for use in the JAS, in which multiple crops are estimated. However, by conducting substratification of the crop planting frequency based stratifications, with the cultivation data, the single crop specific stratifications are potentially applicable to multi-crop surveys and estimation. In addition, a multi-crop specific stratification is also developed to illustrate how these single Crop Frequency Layers can be used together to create one unified multi-crop specific stratification. This paper presents the following results: 1) an evaluation of the percent cultivation accuracy of the three single crop ASF stratifications in comparison to the current NASS South Dakota ASF, 2) a determination whether the primary sampling unit (PSU) distributions in the three single crop stratifications are consistent with the current NASS ASF based on percent cultivation alone and, most importantly, 3) a determination whether the crop specific stratifications based on 2008-2013 data can predict patterns of future crop specific planting at the PSU level as verified by 2014 Farm Service Agency (FSA) Common Land Unit (CLU) Data (Heard 2002; FSA 2014) ."}, {"section_title": "Materials and methods", "text": ""}, {"section_title": "Study site and experimental data", "text": "South Dakota (SD) U.S. is selected as the study area for this investigation because 1) it is a major corn, soybean and wheat producing state and serves as a good example of the range of agriculture grown in the U.S. and 2) the USDA FSA has digitized the SD field boundaries and attributes them annually with crop and non-crop information, known as FSA CLU data, for approximately 98% of SD's land cover. The FSA CLU data are utilized for validation of the crop specific stratifications. The geospatial data used in this research include: the NASS SD 2008-2013 CDLs; the NASS SD 2013 Cultivation Layer, the SD Corn, Soybean and Wheat-Crop Planting Frequency Data Layers; the NASS SD Area Sampling Frame; and 2014 SD Farm Service Agency Common Land Unit data. The Cropland Data Layers are annually updated, georeferenced crop specific land cover classifications with a 30-56 m resolution. The CDLs are 85-95% accurate for major crops in large agricultural states (Boryan et al. 2011) . The NASS 2013 Cultivation Layer is created using 2009-2013 CDL data and identifies land as cultivated or non-cultivated at a 30-m resolution (Boryan et al. 2012) . The NASS 2013 national scale Cultivated Layer has a producer accuracy of 97.3% (non-cultivation) and 98.5% (cultivation) and a user accuracy of 97.8% (non-cultivation) and 97.5% (cultivation) (Boryan et al. 2012) . The 2008-2013 SD Crop Planting Frequency Data Layers identify the number of years that a 30-m pixel is classified as planted to a specific crop over a defined time period in the CDL input data. The accuracies of the national scale Crop Planting Frequency Data Layers are 91.00, 90.13, 87.67 and 85.96% for corn, cotton, soybeans and wheat, respectively (Boryan et al. 2014b) . Fig. 1-A illustrates the U.S. NASS 2013 Cultivated Layer. The black box identifies the state of SD. The dark pixels identify cultivation and the light pixels identify non-cultivation. Fig. 1 In SD, a relatively small amount of acreage is planted to multiple crops in the same year, due to the short growing season. For example, approximately 11 054 acres of double crop winter wheat and corn, 406.0 acres of double crop corn and soybeans, and 3 658 acres of double crop winter wheat and soybeans were grown in 2014 out of a total of 43 257 079 million acres of farmland in SD (Census of Agriculture 2012). As shown in Table 1 , crops planted more than once during a growing season are defined in one single category such as CDL code 225 and 226. For this assessment, 30 m pixels (0.22 acre) that are identified as planted to two crops in the same year are included in both Crop Planting Frequency Data Layers. Table 1 illustrates the CDL categories that are recoded to create the Corn, Soybean and Wheat Planting Frequency Data Layers (Boryan et al. 2014b) .\nThe state level ASFs, as illustrated in Fig. 2 -A, in shape file format, are constructed with PSUs defined by physical features on the ground (roads, railroads and rivers) and stratified based on percent cultivation (all crop types included). The new crop specific frequency data layer based area frames are constructed based on the existing PSUs. As illustrated in Fig. 2 -B, the FSA CLU data are standardized geographic information system (GIS) data layers which are updated annually with farmer reports that provide crop type and acreage information of the nation's farms and fields that were established to support farm commodity, conservation and disaster response (Heard 2002; FSA 2014) . The NASS CDLs, the Crop Planting Frequency and Cultivated Layer, with metadata, are publically available on the NASS web GIS application CropScape (Han et al. 2012) ."}, {"section_title": "Methodology", "text": "In this study, 2008-2013 Crop Frequency Data Layers are used to derive single and multiple crop-specific stratifications based on ASF PSUs rather than using Cultivation Data Layers. Crop Frequency Data Layers are used to automatically calculate crop specific planting frequency means at the PSU level for stratification because the Crop Planting Frequency Data Layers provide improved predictive information of future crop specific planting. In this study, the K-means clustering method was selected to group the ASF primary sampling units into eight primary strata based on corn, soybean or wheat planting frequency means (depending on crop targeted) where PSUs are grouped into strata with the nearest crop specific planting frequency mean. The K-means clustering method was selected because it is a robust algorithm, which has been used for many decades and is well documented (Forgy 1965; MacQueen 1967; Hartigan and Wong 1979) . Further, the K-means clustering algorithm is readily available in ESRI's ArcGIS software which is used within NASS for Area Frame construction.\nCrop specific planting frequencies were clustered to define strata that are more homogeneous within strata and heterogeneous among strata (based on the crop specific planting frequency mean values calculated at the PSU level). The detailed procedures to construct the single and multi-crop stratification using the Crop Frequency Data Layers are provided in the following subsections."}, {"section_title": "Single crop specific stratifications", "text": "The proposed crop specific stratifications are based on the individual Crop Frequency Data Layers. The Cultivation Layer is used for sub-stratification only. Three single crop specific stratifications are derived independently with the same procedure including 1) a corn frequency stratification, 2) a soybean frequency stratification and 3) a wheat frequency stratification. The detailed steps of the procedure to conduct single crop stratification based on crop specific planting frequency and cultivation, are given as follows: 1) Load a SD Crop Specific (corn, soybeans or wheat) Planting Frequency Layer.\n2) Load a SD ASF PSU boundary layer and the 2013 Cultivation Layer individually.\n3) Overlay ASF PSU boundary on the Crop Planting Frequency Layer and on the 2013 Cultivation layer. 4) Compute the crop (corn, soybeans or wheat) planting frequency mean and percent cultivation of each ASF PSU within the PSU boundary.\n5) Add values of the computed PSU level crop specific frequency mean and the percent cultivation as new attributes to the SD ASF PSU boundary layer for all PSUs.\n6) Conduct a K-means clustering based on the crop specific frequency mean variable (no spatial constraint) to create eight primary strata.\n7) Sub-stratify the eight primary crop specific strata, based on crop planting mean frequency ranges, by percent cultivation into four substrata including: 1) >75% cultivation, 2) >50-≤75%), 3) >15-≤50%, 4) ≥0.0-≤15%.\nFor this assessment, all SD ASF PSUs are grouped into eight strata because this is the same number of strata in the current NASS SD Area Frame. Eight strata were determined to provide a sufficient number of homogeneous groups to improve efficiency while maintaining a sufficiently large sample size within strata. Utilizing the same number of strata, as the current SD ASF, will facilitate the comparison of the new crop frequency stratification method, with traditional stratification, based on percent cultivation, in the future. Finally, the corn, soybean or wheat planting frequency strata are substratified, based on percent cultivation, resulting in 32 unique strata (per frame). The substratification based on cultivation was conducted to identify where crops, other than those targeted with the specific Crop Frequency Data Layer, were located. The single crop specific stratifications are potentially applicable to multi-crop surveys and estimation due to the substratification based on percent cultivation.\nIn the three single crop specific stratifications, strata are defined by crop specific planting frequency ranges as illustrated in Tables 2-4 . For example, in the corn specific stratification as shown in Table 2 , stratum 8, the highest frequency range, includes PSUs with a mean corn frequency between 2.85-4.86 years out of 6 (2008-2013) years. Table 2 summarizes the SD eight corn planting frequency strata, PSU distribution, and corn planting frequency ranges that define each stratum, as well as, mean corn acres and percent corn cover reported in the 2014 FSA CLU data by stratum. Results indicate that mean corn planting frequency calculated at the PSU level is a reliable predictor of corn planting with increasing quantities of mean corn acreage reported from strata 1 to 8 in 2014. Further, the number of PSUs, per stratum, decreases from strata 1 to 8 as the corn planting frequency stratum increases. This means that higher corn planting frequency is a strong indication of higher corn acreage. Moreover, the percent corn planting coverage increases from strata 1 to 8 as corn planting frequency increases. These results show the strong predictive power of the newly developed corn specific area frame stratification. Fig. 3 illustrates the spatial distribution of the strata derived from planting frequency and percent cultivation for three crops in SD U.S. Fig. 3 -A illustrates the corn strata distribution. The dark green colors identify PSUs, grouped into strata with high corn planting frequency (strata 7 and 8) located predominantly in south eastern SD. The light green, yellow and orange illustrate the mid corn planting frequency (strata 3-5) located in central SD and the brown colors identify low levels (strata 1-2) of corn planting frequency. Color saturation is used for the three crop specific stratifications to illustrate stratum percent cultivation. The dark shades identify PSUs with the highest percent cultivation and the light shades represent low levels of cultivation. Specifically, the darkest shade identifies PSUs which are greater than 75% cultivation, while the lightest shade identifies PSUs with 15% or less cultivation. Table 3 summarizes the soybean planting frequency strata, PSU distribution, the soybean planting frequency ranges by stratum, 2014 FSA CLU reported mean soybean acres and mean percent soybean coverage by stratum. As shown in Table 3 , the soybean planting frequency statistics are also a reliable predictor of soybean planting with increasing quantities of mean soybean acreage reported from strata 1 to 8.\nMean percent soybean coverage by stratum also increases from strata 1 to 8. Fig. 3 -B illustrates the distribution of SD soybean planting and percent cultivation. Dark blue colors identify strata with high soybean planting frequency (strata 7 and 8). The spatial distribution of soybean planting in SD closely mirrors corn's spatial distribution but soybeans are not planted as intensely in Central SD. The light blue and green color ranges indicate mid and low levels of soybean planting frequency. In Western SD, very little soybeans are planted as evidenced by Fig. 3-B . Table 4 summarizes similar results for the eight wheat frequency strata. Similar to the Corn and Soybean Planting Frequency Data Layers, the Wheat Planting Frequency Data Layer is a reliable predictor of wheat planting in 2014 with reported acreage increasing from strata 1 to 8. The percent of land planted to wheat in 2014 increases predictably from strata 1 to 8, as the wheat planting frequency ranges increase. Fig. 3 -C illustrates the spatial distribution of the SD wheat crop and percent cultivation. Wheat is planted with high frequency in Central SD (strata 7 and 8) and in Western SD and at a low frequency in the far West and East of SD (strata 1 and 2). As shown in Fig. 3 , the derived single crop specific stratifications provide more detailed geospatial distribution information of crop specific planting frequency and cultivation for sample selection when compared with an ASF stratification based on percent cultivation alone.\nMore detailed analysis of the soybean frequency and cultivation stratification results are summarized in Table 5 as an example. The detailed results of the corn frequency/ cultivation (Boryan et al. 2015) and wheat frequency/cultivation stratifications are very similar to the soybean results. Therefore, the detailed analysis results of the corn and wheat stratification will not be included in this paper. Table 5 illustrates the eight primary soybean frequency strata with substrata based on percent cultivation (a-d) with accuracies determined using the 2014 FSA CLU data. Table 5 further identifies by strata the soybean planting frequency range, number of PSUs, mean percent cultivation, percent cultivation accuracy (based on whether PSU percent cultivation matches the 2014 FSA CLU data summarized at the PSU level), mean values for corn acres, percent corn, soybean acres, percent soybean, wheat acres and percent wheat reported in the 2014 FSA CLU data.\nThe percent cultivation substrata of the new SD ASF design has an overall accuracy of 72.365% (validated using the 2014 FSA CLU data), which is consistent with the accuracy of the current NASS ASF of 74% based on percent cultivation, which is validated using the JAS data (Cotter et al. 2010) . It should be noted that accuracy of cultivation is usually higher than the accuracy of an individual crop classification due to the error cancellation of the cultivation calculation.\nThe new crop specific stratification's PSU distribution is consistent with the PSU distribution of the current NASS ASF. As shown in Table 5 , in stratum 1, which has the lowest soybean frequency range, the majority of PSUs are 0.0-15% cultivation. In strata 2 and 3, which also have low soybean frequency, the majority of the PSUs are 15-50% cultivation. In strata 4 and 5 which are the mid soybean intensity strata, the majority of PSUs are 50-75% cultivation. Further, virtually all PSUs in the highest soybean intensity strata are greater than 75% cultivation.\nThe soybean frequency/percent cultivation stratification indicates that soybean and corn are rotated closely, but they are not always grown together. As soybean planting increases by strata, corn planting also increases in parallel. In stratum 1, soybean planting is low and corn planting is higher but in strata 3-8 the acreage and percentages are comparable. Further, wheat planting is almost a compliment of soybean planting in SD with the highest levels of wheat planting in strata 1 and 2 of the soybean frequency/percent cultivation stratification and the lowest levels of wheat in stratum 8.\nThe substratification of eight primary soybean frequency strata into 32 total strata provides more PSU level crop specific information than the current NASS ASF based on percent cultivation alone. The novel ASF stratification creates strata where high concentrations of soybeans are likely planted (strata 7 and 8) and particularly in the PSUs in strata with greater than 75% cultivation (strata 7a and 8a). The crop specific stratification also identifies where wheat is grown in higher concentrations (strata 1a and 2a). Soybeans and corn are planted in equivalent quantities, in strata 4a, 5a, 6a. Furthermore, additional corn and wheat planting land cover statistics calculated at the PSU level and summed at the stratum level, as shown in Table 5 , provide additional information regarding the corn and soybean rotation pattern and the distribution of wheat planting in these strata.\nThe single crop planting frequency stratifications are developed for individual crop surveys that are of great interest to commodity trading groups or researchers evaluating individual crops. However, the substratification of the crop planting frequency strata, by percent cultivation, can provide spatial distribution information of other crops. Therefore, the crop specific stratification results can also be used for multivariate sampling for other crops with appropriate sample allocation. A set of weights can be assigned for different strata. Of course, the appropriate sample allocation schema has to be developed."}, {"section_title": "Multi-crop specific stratification", "text": "In reality, single crop surveys are not common. Most agricultural surveys target multiple crops in a single survey. The single Crop Frequency Layers are naturally for single crop stratification. However, they can be easily used for multi-crop specific stratification. The procedure to create the multiple crop specific stratification based on the crop planting frequency and cultivation are similar to that of single crop stratification. There are three changes in the multi-crop stratification procedure: 1) in the first step, all targeted Crops' (in this study, SD corn, soybean and wheat) Frequency Layers are loaded (no Cultivation Layer); 2) in step 6, the K-means clustering is based on multivariable corn, soybean and wheat planting frequency means which are calculated at the PSU level (no spatial constraint) to create eight primary strata; and 3) there is no sub-stratification step. Every created stratum has three variables: corn, soybean and wheat frequencies. The proportions of crops are different within stratum and among strata. This information will help multivariate sample allocation (Bethel 1989 )."}, {"section_title": "Crop specific stratification assessment", "text": "For this research, three single crop specific stratifications and one multi-crop specific stratification were created. The 2014 FSA CLU data were used to assess their predictive capabilities. The 2014 FSA CLU/ 578 data are a comprehensive source of in situ data reported in 2014. The three single crop specific stratifications are evaluated based on: 1) mean corn, soybean or wheat acreage increasing from strata 1-8 in 2014, 2) how accurately the new frame's PSU percent cultivation matches the percent cultivation reported in the 2014 FSA CLU data, 3) if the PSU distribution of the three stratifications are similar to the PSU distribution of the current NASS ASFs and 4) if the corn, soybean and wheat frequency and cultivation stratifications accurately predict crop specific planting patterns in 2014. The multicrop (corn, soybean and wheat) frequency stratification is evaluated primarily based on how reliably it predicts crop specific planting patterns as well."}, {"section_title": "Results and discussion", "text": ""}, {"section_title": "Multi-crop specific stratifications", "text": "A multi crop specific (corn, soybeans, and wheat) stratification is also created by running the multivariate K-means clustering algorithm based on the corn, soybean and wheat frequency mean values together calculated at the PSU level. Table 6 illustrates the resulting stratum definitions (including no. of PSUs per stratum) for the eight strata in the multi-crop stratification, which include a combination of characteristics including soybean planting frequency means, corn planting frequency means and wheat planting frequency means calculated at the PSU level. Further, soybean, corn and wheat acreage, reported in the SD FSA CLU data, are calculated at the stratum level to evaluate the predictability of the multiple crop specific stratification. Fig. 3 -D illustrates the spatial distribution of the multi-crop stratification. Table 6 includes the eight multi-crop strata definitions, which include the stratification variables and mean stratum values for each variable, as well as mean corn, soybeans and wheat acres reported in the FSA CLU data in 2014 for each stratum. General observations of the multi-crop stratification are that stratum 1 (light tan) in Fig. 3 -D would be expected, based on crop planting frequency mean values, listed in Table 6 , to include the least amount of crop acreage. Stratum 2 illustrated in the tan color in Fig. 3 would be expected to include moderately low levels of crop acreage for all three crops (Table 6 ). Stratum 3 (dark red/brown) would have the largest quantities of wheat planting based on the high wheat frequency mean values. Stratum 4 (lighter red/brown) would be anticipated to include large amounts of wheat planting but not as much as stratum 3. From stratum 5 to 8 (blues to dark green) progressively larger amounts of corn and soybeans are anticipated to be reported in these strata based on the corresponding higher corn and soybean planting frequency ranges in Table 6 . Stratum 8 (darkest green) would be expected to have the largest amounts of corn and soybean acreage based on the high soybean and corn planting frequency mean values. The FSA CLU data, reported in 2014 and listed in Table 6 , confirm these general predications. Fig. 4 -A illustrates the current NASS SD traditional ASF based on percent cultivation. Fig. 4 -B illustrates the new multi-crop stratification based on the Crop Planting Frequency Layers. The spatial distribution of crop planting is consistent between these two stratifications. However, the multi-crop specific stratification provides more targeted crop specific distribution information with the homogeneous strata based on crop specific planting frequency statistics while the traditional ASF has no crop specific planting information. As shown in Fig. 4 -B, the corn, soybeans and wheat planting areas are clearly identified within strata.\nCrop specific ASF stratifications, such as those presented in this paper, can be useful in targeting individual crops for sampling and estimation. Future research will include continued assessments of the multi-crop stratification that can be used to select samples and conduct estimation using the 2014 FSA CLU and 578 administrative data as proxy survey data which can be compared with the 2014 JAS estimates."}, {"section_title": "Conclusion", "text": "This paper proposed using a novel method for land cover ASF stratification based on crop specific planting frequency and percent cultivation to build four new crop specific ASF stratification designs. In this paper, new SD corn, soybean and wheat stratifications were derived based on crop planting frequency and cultivation. Three single crop specific stratifications and a multi-crop specific stratification produced strata where reliably predicted quantities of target crops were reported grown in 2014. The four novel ASF stratifications provided additional crop specific information when compared to traditional stratification based on percent cultivation alone. The additional mean corn, soybean and wheat frequency data provided strong indications about where these crops are planted in large quantities, which was confirmed using the 2014 FSA CLU and administrative data 578 as in situ validation. In SD, soybeans and corn are grown in similar areas and rotated. Consequently, strata 3-8 in the soybean frequency/percent cultivation stratification identifies the areas where equivalent quantities of soybeans and corn are grown. It is observed that all four ASF stratifications predict corn, soybean and wheat planting patterns well as verified by the 2014 FSA and 578 administrative data. This demonstrates that the new stratifications based on geospatial crop planting frequency (2008) (2009) (2010) (2011) (2012) (2013) and cultivation are crop type independent and applicable to all major crops in addition to the specified crops. These results indicate that new SD crop specific stratifications based on the Corn, Soybean and Wheat Planting Frequency (2008-2013) and Cultivation Data Layers have great potential to improve ASF accuracy, efficiency and crop estimates. "}]