[{"section_title": "Abstract", "text": "Arterial spin labeling (ASL) magnetic resonance imaging uses arterial blood water as an endogenous tracer to measure cerebral blood flow (CBF). In this review, based on ASL studies in the resting state, we discuss state-of-the-art technical and data processing improvements in ASL, and ASL CBF changes in normal aging, mild cognitive impairment (MCI), Alzheimer's disease (AD), and other types of dementia. We propose that vascular and AD risk factors should be considered when evaluating CBF changes in aging, and that other validated biomarkers should be used as inclusion criteria or covariates when evaluating CBF changes in MCI and AD. With improvements in hardware and experimental design, ASL is proving to be an increasingly promising tool for exploring pathogenetic mechanisms, early detection, monitoring disease progression and pharmacological response, and differential diagnosis of AD."}, {"section_title": "Introduction", "text": "Cerebral blood flow (CBF) refers to the rate of delivery of arterial blood to the capillary bed in brain tissue and is quantified in milliliters of blood per 100 g of brain tissue per minute. The cor-relation between CBF and local neuronal activity and metabolism, known as neurovascular coupling, is a surrogate marker of brain function (Vestergaard et al., 2016) . Detecting CBF at resting state without complex cognitive tasks is easier to conduct in clinical practice, especially in older subjects and patients with cognitive impairment. The relatively new technique of arterial spin labeling (ASL) MRI for CBF measurement, which uses arterial blood water as an endogenous tracer (Grade et al., 2015) , has been validated against other perfusion methods in both younger and older adults (Xu et al., 2010; Zhang et al., 2014) . It has also been demonstrated that using ASL to measure CBF had good inter-rater reliability and reproducibility in normal subjects, even in the geriatric population (Jiang et al., 2010; Petersen et al., 2010; Sigurdsson et al., 2015) . Unlike other techniques, ASL does not require any expensive or radioactive tracers. Compared with 15 O-water PET, ASL does not require long preparation times and scan times, or arterial blood sampling to achieve CBF quantification. Furthermore, ASL is stable for tracking CBF changes over time due to recovery and therapy (Wintermark et al., 2005) . In addition, it has been demonstrated that CBF measured with ASL correlated with functional connectivity measured with blood oxygen level dependent (BOLD) imaging in several brain networks (Liang et al., 2013) . However, compared to BOLD, ASL has lower inter-subject variability and can provide an absolutely quantitative measure of CBF which directly reflects brain physiology and neural activity (Buxton et al., 2004; Wolk and Detre, 2012) .\nIn this review, we describe the current technical limitations of ASL and efforts to resolve them. Given that reported changes in resting CBF measured by ASL in aging and in patients with mild cognitive impairment (MCI) and Alzheimer's disease (AD) have been inconsistent and sometimes contradictory, we will critically review the literature, and try to understand these discrepancies. We also aim to provide perspective on the current findings and pending questions, in order to better appreciate the potential utility of ASL in studying AD."}, {"section_title": "Technology of ASL MRI", "text": "In ASL, arterial blood water molecules are magnetically labeled proximal to the area of interest. Then blood flow can be measured with a standard MRI imaging sequence and compared to an unlabeled image as control. Based on different ways of arterial water labeling, ASL methods are classified as continuous ASL (CASL), pulsed ASL (PASL) and pseudo-continuous ASL (pCASL). CASL uses a single long pulse, PASL uses one or several short pulses, while pCASL applies a train of radiofrequency pulses at around one per millisecond. pCASL has the highest signal-to-noise ratio (SNR) and superior labeling efficiency among the three types, and is recommended for present and future clinical applications (Alsop et al., 2015) .\nThe arterial transit time (ATT), which means the time it takes for labeled water to reach the tissue in a given voxel, needs to be considered in the calculation of CBF measured by ASL. Because ATT may be variable, depending on differences in the hemodynamic status of each individual, this may cause inaccuracy in CBF quantification. To make ASL less sensitive to ATT, Alsop et al. introduced the inversion time or so-called post-labeling delay (PLD) between the end of the labeling pulse and start of the image acquisition (Alsop and Detre, 1996) . This delay allows more time for blood to arrive and exchange with tissue. Other methods to correct for ATT have also been investigated, such as using a transit time map (Sugimori et al., 2015) . ASL also requires attention to partial volume effects (PVE), especially in older populations due to brain atrophy. Although PVE correction methods can mitigate the effect on CBF calculation, the smoothing effect intrinsic to these methods may reduce the sensitivity to detection of local CBF changes (Bruening et al., 2015) . It was found that correction of PVE by a protocol involving a cortical surface projection of the native perfusion data on a 3D T1 sequence could achieve high quality cortical segmentation and perfusion cortical display as assessed by double-blinded neuroradiologists (Verclytte et al., 2015) . Moreover, in a pilot study, Bruening et al. also improved their previous PVE correction method by operating the correction algorithm in the structural space instead of functional space, which exhibited at least 1.5 times greater sensitivity compared to the original method (Bruening et al., 2015) .\nCurrently, 2D gradient-echo planar imaging (EPI) is the most common readout technique for ASL images due to its high sensitivity and rapid acquisition of volumetric data. However, there is a trend for use of fast 3D sequences, such as 3D-gradient and spin echo (GRASE) or 3D rapid acquisition relaxation enhanced (RARE), to improve SNR by reducing the slice-dependent variation in perfusion signal. 3D readouts were demonstrated to have better test-retest repeatability and higher sensitivity compared with 2D EPI (Kilroy et al., 2014; Vidorreta et al., 2013) .\nMost previous studies of ASL used univariate analysis which is based on a region-by-region (regions-of-interest) or voxel-byvoxel comparison. Based on the notion that small but biologically relevant signals can be detected in functional brain images after minimizing the substantive variability that exists across subjects and regions, a multivariate analysis termed scaled subprofile model (SSM) has been introduced and used in ASL data analysis. SSM is a spatial covariance method based on principal component analysis (PCA), which is a data-driven technique that enables the unbiased detection of spatial covariance patterns, in order to assess subject-by-region effects in functional brain images. In SSM/PCA, data are modeled as spatially distributed networks (Eidelberg, 2009 (Asllani et al., 2008) , this multivariate model has not been commonly used in other ASL studies of AD patients. There are still some drawbacks of multivariate analysis, including higher computational and conceptual complexity, and the absence of an easy-to-use software package.\nBesides 3D readout and SSM/PCA, other novel methods of denoising and improving the data processing of ASL have also been investigated, such as dual-tree complex wavelet transform combined with the nonlocal means algorithm , multiphase acquisition (Fazlollahi et al., 2015) , user-friendly automatic software for ASL image processing (Abad et al., 2015) , multivariate machine learning-based ASL image classification (Wang, 2014) , and quantitative measures of network fluctuation (Dai et al., 2016) . Taken together, although the weak SNR and relatively low spatial resolution limit the worldwide or multicenter assessment and analysis of ASL , technical advances in MRI combined with the application of more powerful statistical analysis tools will most likely increase the sensitivity of ASL in detecting CBF changes in central nervous system conditions."}, {"section_title": "ASL in normal aging", "text": "Aging is the main risk factor for sporadic AD. It is critical to know the patterns and degrees of age-related CBF reduction for distinguishing disease-related changes from normal degeneration. The decrease in parenchymal CBF of the whole brain in older individuals in comparison to younger individuals has been demonstrated in several ASL studies (Ambarki et al., 2015; Amiri et al., 2014; Wagner et al., 2012) . Fig. 1 shows representative CBF images measured with ASL of a young and an old healthy subject from our database. Aging may account for an approximately 0.38%-0.45% reduction in CBF measured by ASL per year, especially in the frontal, temporal and parietal lobes (Chen et al., 2011; Parkes et al., 2004) . It was demonstrated that regional CBF reduction was widely associated with age throughout the cortex, such as bilateral medial temporal lobes (MTL), and subcortical regions, even after adjusting for brain atrophy with PVE-correction or by using tissue volume as a co-variate (Asllani et al., 2009; Bangen et al., 2009; Chen et al., 2011) . Compared to the averaged regional CBF, precuneus, superior temporal and orbitofrontal regions showed decreased perfusion, and caudate, posterior cingulate, anterior cingulate and amygdala showed increased perfusion in the elderly (Lee et al., 2009 ). It has also been observed that regional CBF measured with ASL in left superior temporal gyrus correlated with global cognitive function in normal elderly subjects (Mak et al., 2012) . Furthermore, global and regional CBF could be increased by either aerobic exercise or cognitive training and the increased CBF was associated with cognitive improvement in cognitively normal adults (Chapman et al., 2013; Chapman et al., 2015) .\nThe cause of age-related reduction of CBF is still unclear. It may result from reduction in neuronal number, neuronal size, synaptic density, and/or neuronal activity. CBF changes with age are also associated with physiological variations in arterial carbon dioxide tension (De Vis et al., 2015) . As mentioned above, PVE are increased by brain atrophy and cortical thinning, and ATT is increased during aging. Therefore, apparent age-related reduction of CBF might partly be due to factors confounding the measurement of ASL per se, although these could be remedied to some extent by increasing the PLD for elderly participants and correcting for PVE.\nThe observations of CBF change by age are not totally consistent in ASL studies. First, during development, CBF undergoes a rapid drop in the second decade, then stays at a plateau for a long time in adulthood (Biagi et al., 2007) . Thus, the age-related changes in CBF are not linear across the whole lifespan. This might be the main reason that no significant correlation between age and CBF was found in some studies (Xu et al., 2010) . Moreover, besides decreased global and regional CBF, increases in regional CBF, such as lateral and medial temporal lobe, have also been observed in elderly compared to young subjects (Lee et al., 2009; Preibisch et al., 2011) . The regional increases in CBF were speculated to be a compensatory response in aging.\nIn ASL studies, the differences in CBF change in the aging population were mainly thought to be associated with distinct degrees of vascular risk factors and AD risk factors. First, it was observed that advancing age was correlated with the reduction of CBF in several cortical regions in older individuals with high vascular risk burdens, but not in those with low risk . In late middle-aged subjects (mean age 60.4 years) with normal cognition, global CBF was 15% lower in subjects with high metabolic syndrome factors compared to subjects with low factors (Birdsill et al., 2013) . It was also found that the reduced CBF correlated with evidence of cerebrovascular disease on structural MRI in the elderly, such as the volume of white matter hyperintensities (Crane et al., 2015) and cortical microbleeds (Gregg et al., 2015) . Moreover, a single nucleotide polymorphism located in ATP-binding cassette sub-family C member 9 (ABCC9), which is associated with hippocampal sclerosis of aging, has been observed to be related to brain arteriolosclerosis and global CBF in elderly individuals (Ighodaro et al., 2016) .\nFinally, there is extensive evidence of apolipoprotein E (APOE) genotype and AD family history contributing to age-related changes in CBF measured with ASL. Wierenga et al. observed that although global CBF was decreased by aging, CBF in anterior cingulate cortex was increased in young APOE 4 healthy carriers, and decreased in older APOE 4 healthy carriers (Wierenga et al., 2013) . They also found that increased hippocampal blood flow was associated with more sedentary behavior in APOE 4 carrier older adults . Similarly, in another study, hyperperfusion of right hippocampus, which was associated with poor performance in verbal memory, was observed in APOE 4 carrier older adults (Rane et al., 2013) . However, the differences in global and regional CBF were not demonstrated in another study focusing on cognitively intact young people (ages 18-35 years) with different APOE genotypes (Su et al., 2015) . APOE is the most important susceptibility gene for sporadic AD, which is associated with parenchymal amyloid-␤ accumulation (Corder et al., 1993) . Therefore, these findings of no CBF changes before middle age, early increased CBF and later decreased CBF after middle age in APOE 4 carriers, have been postulated to represent compensatory responses to APOE 4 related brain injury starting from middle age until decompensation. A schematic of CBF changes during aging in different population is presented in Fig. 2 .\nOne study focused on the combined effect of APOE and AD family history found that CBF in MTL was increased in cognitively normal, middle-aged subjects with both a family history of AD and at least one copy of the APOE 4 allele (Fleisher et al., 2009 ). However, a large sample study found normal middle-aged adults with maternal history of AD had a similar pattern of hypoperfusion in MTL as patients with AD, and failed to demonstrate an independent relationship between APOE 4 and regional CBF reduction, although subjects with both family history and APOE 4 showed hypoperfusion in some regions compared with subjects with neither risk factor (Okonkwo et al., 2014) .\nA limitation of studies in normal aging is that it is impossible to recruit definitively healthy participants, since it is not clear if those subjects might already have preclinical AD, cerebrovascular disease or other neurodegenerative diseases. Risk factors for cerebrovascular and neurodegenerative diseases should be considered as potential confounders in studies focusing on CBF changes in aging. Moreover, a longitudinal study design is helpful to exclude some confounders, because conversion to clinical condition occurs in a sufficiently long time period."}, {"section_title": "ASL in AD spectrum", "text": "AD is the most common cause of dementia in the elderly. Hypoperfusion and neurovascular uncoupling have been demonstrated to contribute to the pathogenesis of AD. The key pathways of vascular dysfunction that are linked to AD include blood-brain barrier (BBB) breakdown, hypoperfusion-hypoxia and endothelial metabolic dysfunction. CBF reduction can lead to the accumulation of proteinaceous toxins in the brain, including amyloid-␤ and hyperphosphorylated tau, which are the major pathological substrates of AD (Moskowitz et al., 2010) . Conversely, amyloid-␤ could induce cerebrovascular dysfunction (Park et al., 2005) . However, it is still debatable whether reduced CBF is the cause or consequence of AD (Mazza et al., 2011) . Zlokovic suggested the two-hit vascular hypothesis of AD (Zlokovic, 2011) . According to this hypothesis, primary damage to brain microcirculation (hit one) initiates vascular-mediated neuronal dysfunction and injury, including BBB dysfunction, neurotoxic molecules leakage and secretion, and multiple focal ischemic or hypoxic micro-injuries. Then, accumulation of amyloid-␤ (hit two), due to impairment of clearance (BBB dysfunction) and increased generation (ischemia), further injures the brain. It was observed that CBF measured with ASL positively correlated with normalized brain volume and negatively correlated with white matter hyperintensity in patents with MCI and AD (Benedictus et al., 2014; Zhang et al., 2012) , which suggested that ASL might be useful as a measure of microvascular dysfunction and neuronal degeneration in AD."}, {"section_title": "ASL in MCI", "text": "MCI is thought to be a transitional stage between cognitively normal aging and dementia. The rate of conversion from MCI to AD may range from 10% to 20% per year (Aisen et al., 2011; Landau et al., 2010) . Johnson et al. first observed reduced CBF measured with ASL in inferior right parietal lobe in patients with MCI, although the extent and degree were not as striking as those in patients with AD (Johnson et al., 2005) . Several further ASL studies compared CBF directly between patients with MCI and AD, and healthy subjects. It was found that individuals with MCI exhibited hypoperfusion in parietal cortex, precuneus, posterior cingulate cortex (PCC) and MTL, compared with adults with normal cognition or subjective complaints (Alexopoulos et al., 2012; Bangen et al., 2012; Binnewijzend et al., 2013; Okonkwo et al., 2014) . In a multisite analysis from ADNI-2, CBF of patients with late MCI and AD was reduced compared with normal subjects, and lower CBF was associated with disease severity in these patients . Besides decreased CBF, regional variations in CBF were also observed between MCI and healthy subjects Ding et al., 2014) .\nIn addition, the relationship between CBF measured with ASL and cognition has been examined in MCI individuals. It was observed that global CBF and hippocampal perfusion positively correlated with performance in recall and recognition of episodic memory in MCI Westerberg et al., 2013) . Regional CBF in PCC and frontal cortex correlated with recognition and executive function respectively, in healthy subjects and MCI patients (Chao et al., 2009) . Furthermore, regional CBF in precuneus, parietal and temporal lobes correlated with disease severity measured by Clinical Dementia Rating scale (CDR) and memory performance in MCI and early AD patients, independent of hippocampal atrophy .\nHowever, regardless of brain amyloid-␤ deposition, no significant changes were found in early and late MCI patients compared to normal controls in a recent study. Interestingly, when compared with amyloid-␤ negative normal adults, amyloid-␤ positive patients with MCI and AD showed decreased CBF in several regions, and the reduction of CBF in temporo-parietal regions was associated with whole brain amyloid-␤ load, which suggests a tight relationship between amyloid-␤ and vascular dysfunction in the pathogenesis of AD (Mattsson et al., 2014) .\nMoreover, the effect of APOE 4 on CBF has been demonstrated to be greater than that of amyloid-␤ and independent of amyloid-␤ in normal elderly and amnestic MCI (aMCI) patients (Michels et al., 2016) . It was found that CBF in posterior regions was decreased and in frontal regions was increased in APOE 4 carriers with MCI, which was opposite to cognitively normal APOE 4 carriers . Another study found that although CBF was reduced in several regions in normal elderly and AD APOE 4 allele carriers, CBF in right parahippocampal gyrus, bilateral cingulate gyri and right PCC was increased in APOE 4 carriers with aMCI (Kim et al., 2013) . It was also observed that CBF in MTL was increased in APOE 4 carriers including both normal controls and MCI patients Fleisher et al., 2009 )."}, {"section_title": "ASL in AD", "text": "Since Alsop et al. observed decreased CBF in widespread brain areas in AD patients using multi-slice ASL technique (Alsop et al., 2000) , subsequent studies have focused on this measure in exploring the pathogenesis and early diagnosis of AD. Declines in global and regional CBF, mainly including cingulate, precuneus, parietal lobes and inferior frontal regions among others, in patients with AD were demonstrated in several studies (Asllani et al., 2008; Mak et al., 2012; Okonkwo et al., 2014; Yoshiura et al., 2009b) , and were found to be related to global cognition measured with Mini-Mental Status Examination (MMSE) and Alzheimer's disease Assessment Scale-Cognitive subscale (ADAS-cog) in AD (Binnewijzend et al., 2013; Mak et al., 2012) . Moreover, the decreases in some areas could be increased by treatment with cholinesterase inhibitors (Chaudhary et al., 2013; Li et al., 2012) , and increased CBF in the middle and posterior cingulate cortex was associated with improvement in ADAS-cog scores after treatment in mild AD (Li et al., 2012) . The cortical hypoperfusion detected by ASL was also verified in an amyloid precursor protein transgenic mouse model of AD, and regional CBF could be variably decreased or increased by aging in this model (Hebert et al., 2013) . However, other studies observed increases of CBF in some regions, especially in the hippocampus in patients with mild AD (Alsop et al., 2008) .\nIt was found that ASL had similar sensitivity and specificity as 18F-fluorodeoxyglucose (FDG) PET in distinguishing AD patients from healthy controls (Musiek et al., 2012; Tosun et al., 2016) . Both sensitivity and specificity for detecting AD were 80%-90%, based on the CBF in PCC and precuneus (Yoshiura et al., 2009a) . Another study found the sensitivity, specificity and accuracy could be further increased to 88%, 68% and 79%, respectively, when focusing on the reduced CBF in frontal lobes (Raji et al., 2010) . One study observed that adding CBF measured by ASL to a structural MRI assessment improved the diagnostic accuracy of discriminating patients with AD from normal elderly (Mak et al., 2014) , although another study did not find a significant added value of the combination over single structural MRI markers (Bron et al., 2014) .\nMoreover, it was also found that the changes in CBF and functional connectivity in elderly subjects at high risk for AD occurred even before cognitive decline, brain atrophy and amyloid-␤ accumulation (Ruitenberg et al., 2005; Sheline et al., 2010) . In longitudinal ASL studies, CBF changes were able to predict cognitive decline and conversion to dementia. It was observed that reduced CBF in PCC was associated with the deterioration of cognition in healthy elderly, and might predict the development of MCI or dementia (Xekardaki et al., 2015) . In another study, not only did reduced CBF in the right middle frontal cortex correlate with memory decline, and in the right precuneus and inferior parietal region with executive function decline, respectively, but also hypoperfusion in some regions was found to be a predictor of conversion to dementia in MCI patients (Chao et al., 2010) . These studies suggest that abnormal resting state CBF measured with ASL may be an early indicator of brain dysfunction in individuals at risk for developing AD. Since CBF changes measured with ASL occur at very early stages of AD, are correlated with disease conversion and progression, and are sensitive to pharmacological intervention, ASL may be a valuable tool for identifying at risk individuals, monitoring changes in neural activity due to developing neuropathology, tracking disease progression and assessing effectiveness of disease-modifying treatments in AD.\nDiscrepancies in regional CBF changes described in previous MCI and AD studies may be related to relatively small sample sizes and heterogeneity of the participants. Most studies did not mention pharmacological treatment of subjects. As CBF may be affected by several medications, including cholinesterase inhibitors (Chaudhary et al., 2013; Li et al., 2012) , therapeutic interventions should be recorded in detail and analyzed as a covariate in future studies. Moreover, patients were in different stages of disease in previous studies. Even in MCI individuals, CBF variation has been supported by the observation of early MCI and late MCI from the ADNI database . Finally, differences in the underlying pathology of the participants may be an important source of variance. Except for specific biomarkers utilized in a few studies (Hu et al., 2010; Mattsson et al., 2014; Michels et al., 2016) , most studies utilized clinical criteria for inclusion of AD patients, which might lead to a certain proportion of patients with non-AD dementia among the participants (Cummings, 2012) . In terms of MCI, the heterogeneity in etiology is more prominent than that in AD studies. It is conceivable that different patterns of hypoperfusion between aMCI patients and dysexecutive MCI patients may have been found in an ASL study (Chao et al., 2009 ). Taken together, future studies should incorporate large sample sizes with careful attention to potential confounding factors, and should use current gold standard biomarkers (amyloid-␤ and/or tau in cerebrospinal fluid (CSF) or PET) as inclusion criteria or covariates."}, {"section_title": "ASL in other types of dementia", "text": "It was observed that patients with frontotemporal dementia (FTD) exhibited changes in CBF, including decreased CBF in bilateral frontal lobes and increased CBF in PCC, precuneus and parietal compared to normal subjects (Hu et al., 2010) , and hypoperfusion in frontal lobes correlated with impairment in judgment and problem solving as scored by CDR (Du et al., 2006) . These CBF changes were different from those observed in AD patients who were diagnosed with histopathology or validated CSF biomarkers (Hu et al., 2010) . In another study, it was suggested that the combination of structural and functional MRI (including ASL) was helpful for the differential diagnosis between FTD and AD, although differences in CBF were not obvious between patients with these two neurodegenerative diseases (Zhang et al., 2011) . Compared with FTD patients, AD patients showed obvious hypoperfusion in the PCC, and both sensitivity and specificity in differentiating presenile AD from FTD based on CBF in PCC approached 70% (Steketee et al., 2016) . Adding frontal and parietal lobe perfusion to structural markers further improved sensitivity and specificity to 87% and 83% for the classification of FTD versus AD (Du et al., 2006) .\nThe hypoperfusion regions of patients with Parkinson's disease dementia (PDD) were quite similar as those of AD patients, including PCC, precuneus and occipital. Although no significant differences in regional CBF were observed between PDD and AD using univariate analysis, a perfusion network established with PCA might facilitate identification of these two diseases (Le Heron et al., 2014) . Decreased CBF in occipital and parietal regions correlated with worse performance on visuospatial and attention tests in patients with Lewy body associated cognitive impairment, including dementia with Lewy bodies, PDD and Parkinson's disease-MCI (Robertson et al., 2016) .\nPatients with subcortical ischemic vascular dementia (SIVD) exhibited obvious CBF decreases in frontal and parietal cortex, which was associated with white matter lesions. However, global CBF in patients with SIVD and AD was similar ). In patients with post-stroke dementia, global CBF and regional parietal CBF were reduced compared with healthy controls, and central gyrus perfusion was decreased compared with AD patients. Moreover, CBF not only correlated with global cognition, but also predicted dementia in patients with stroke (Firbank et al., 2011) . Taken together, increasing evidence indicates that using ASL to distinguish AD from other types of dementia, particularly FTD, is promising, although differences may not be restricted to prefrontal cortex. In addition, ASL is useful to explore overlapping pathogenetic mechanisms in AD, vascular dementia and other neurodegenerative diseases, such as Lewy body associated dementia. A schematic of the pathologic overlapping in four major types of dementia is presented in Fig. 3. "}, {"section_title": "Conclusion", "text": "In conclusion, although some limitations such as sensitivity to ATT and head motion delayed the clinical application of ASL, growing evidence supports the utility of this non-invasive technique to measure CBF in aging and in patients with neurodegenerative diseases, such as AD. Multi-center and longitudinal studies are worth conducting with optimized and standardized ASL to elucidate the pathogenesis, and facilitate the early diagnosis of AD."}, {"section_title": "Conflict of interest", "text": "The authors have no conflicts of interest to disclose."}]