[{"section_title": "", "text": "skills such as attentional control, cognitive flexibility, self-regulation, inhibition, strategic planning, and impulse control (Reader, Harris, Schuerholz, & Denckla, 1994), which support learning, academic achievement, and behavioral competence. EF skills have also been characterized as falling into a hot-cool continuum, relative to the setting and level of affective demand in which the specific skills are operating, with potentially differing neural substrates for hot versus cool EF (e.g., Zelazo & Müller, 2002). EF skills develop throughout childhood and into young adulthood, concurrent with development of neural synapses, myelination of brain regions, and recruitment and consolidation of neural networks (e.g., Stevens, Skudlarski, Pearlson, & Calhoun, 2009;Tau & Peterson, 2010). Poor EF skills put children at risk for ineffective interactions with the environment, leading to significant and lasting cognitive, academic, and social difficulties (Biederman et al., 2004;Clark, Prior, & Kinsella, 2002;Ellis, Rothbart, & Posner, 2004;Pascualvaca et al., 1997;Tapert, Baratta, Abrantes, & Brown, 2002). Early executive control predicts children's level of social problems, with later EF predictive of a variety of psychosocial outcomes in adolescents (Ellis et al., 2004;Galambos, MacDonald, Naphtali, Cohen, & de Frias, 2005;Giancola & Mezzich, 2000;Santor, Ingram, & Kusumakar, 2003). Although the components of EF appear to play an important role in children's academic and social functioning across childhood, there is little work investigating the role of specific aspects of the developmental context on children's EF skills. Early and continuing experiences shape brain development (e.g., Huttenlocher, 1990) and childhood experiences such as classroom interactions moderate the relation between demographic or cognitive risk and academic and social outcomes (Borman & Kimble, 2005;Hamre & Pianta, 2005). Both maternal scaffolding and effective classroom teaching have been shown to support children's developmental regulation of behavior and affect (e.g., Hughes & Ensor, 2009;Rimm-Kaufman et al., 2005). However, there are few studies specifically examining contextual influences on EF beyond early childhood and none which examine the relation of competent EF to children's ability to successfully navigate the middle school transition or related influences such as school type. EF skills play an important role in successful cognitive and social functioning (e.g., Hughes, White, Sharpen, & Dunn, 2000;Murphy, Shepard, Eisenberg, & Fabes, 2004) and likely become critically important during early adolescence when children experience a number of simultaneous transitions and challenges before their EF has reached the level of adult competence (Luna & Sweeney, 2004;Riggs & Greenberg, 2009). One such challenging transition involves the change in school setting from elementary into middle/junior high school, often at sixth grade, which occurs for many children in the midst of the significant cognitive and physiological changes of puberty (Simmons, Burgeson, Carlton-Ford, & Blyth, 1987). This school transition requires significant cognitive and behavioral adjustment as it often involves not only a physical change of location, but changes in school perspective and instructional formats, increases in the number of teachers, decreases in perceived teacher support, increases in class size, changes in peer networks, and increased expectations for individual responsibility, and often increased exposure to the potential for delinquent behavior (Akos, Queen, & Lineberry, 2005;Eccles, 2004;Rudolph, Lambert, Clark, & Kurlakowsky, 2001;Steinberg, 2005). Each of these new challenges places increasing demands on the child's developing EF skills, as the increased workload, class changes, and larger peer groups require greater self-regulation and working memory than were required in an elementary school setting (e.g., Harter, Whitesell, & Kowalski, 1992). The changes in expectations and responsibilities at sixth grade are more apparent for those students who make a school transition than for those who remain in an extended elementary school; thus, self-regulation and EF skills may play more of a role in their academic and social competence (Rudolph et al., 2001). Although many students navigate this transition successfully (e.g., Chung, Elias, & Schneider, 1998;Parker, 2009;Proctor & Choi, 1994), the challenges of this transition have negative consequences for others, undermining their sense of self-worth, increasing feelings of psychological distress, disengaging them from school, and increasing their involvement in potentially risky behavior (Carnegie Council on Adolescent Development, 1995;Eccles, Lord, Roeser, Barber, & Jozefowicz, 1997;. For some students, this transition has long-term effects on development, with more negative effects on children who evidence low achievement or children already at risk due to social factors (Barber & Olsen, 2004;Burchinal, Roberts, Zeisel, & Rowley, 2008;Duchesne, Ratelle, Poitras, & Drouin, 2009;Eccles et al., 1997). For these children, this transition can produce significant reductions in achievement and academic effort and increases in behavioral and social-emotional problems (Alspaugh, 1998;Barber & Olsen, 2004;Burchinal et al., 2008;Chung, Elias, & Schneider, 1998;Poncelet, 2004). In examining outcomes for poor, urban youth in particular, Seidman, Allen, Aber, Mitchell, & Feinman (1994) found that after transition to large junior high schools, students reported declines in self-esteem, class preparation, social support and involvement with school, and GPA, as well as increased daily school hassles. The more intense the students' sense of daily school hassles, the lower their expectations for academic efficacy, the less academic preparation they engaged in, and the lower their grades. African-American students in particular tend to experience significantly greater decreases in grades following this transition than other ethnic groups (Gutman & Midgley, 2000;Petersen & Crockett, 1985;Simmons, Black & Zhou, 1991), and lower achieving students and those with identified learning disabilities tend to show more negative effects of transition to middle schools than higher achieving students (Anderman, 1998;Midgley, Feldlaufer, & Eccles, 1988). Thus, navigating a school transition at sixth grade significantly impacts children's adjustment and academic outcomes, with this transition posing even greater challenge to children already at risk for poor outcomes. How well children cope with and adjust to these new challenges can significantly affect their developmental trajectories (Barber & Olsen, 2004;Carnegie Council on Adolescent Development, 1995;Eccles et al., 1997). The ability to manage this transition successfully depends on multiple factors, including personal maturity and coping skills, the characteristics of the new school environment, and the level of preparation and social support available to the student both before and after the transition (Crockett, Petersen, Graber, Schulenberg, & Ebata, 1989). Others suggest that navigating this transition successfully also depends on children's perceptions of the changes (e.g., McDougall & Hymel, 1998) as well as the \"match\" between the characteristics of the new school environment and their own developmental needs (Eccles et al. 1993;Eccles & Midgely, 1989), with children's perceptions of school climate associated with adjustment during middle school (Way, Reddy, & Rhodes, 2007). Individual \"coping skills\" include the ability to problem-solve effectively and demonstrate self-control within a variety of classroom and social situations: in other words, intact EF. As an example of the potentially negative impact of executive dysfunction on adjustment during this transition, children with ADHD -a disorder characterized by deficits in inhibitory control (Barkley, 1994;Pennington & Ozonoff, 1996;Doyle, 2006) show an increase in parent reports of problem behaviors (Langberg et al., 2008) following their transition into middle school. While the literature is clear that early deficits in certain core EF skills have significant predictive value, and that the middle school transition can result in decreases in student achievement and behavioral competence, no published studies were found that have specifically examined the relation of EF skills to students' success in transitioning from elementary school to sixth grade and the middle school environment."}, {"section_title": "The present study", "text": "This study investigates several unanswered questions in the literature that has examined risk and protective factors during the middle school transition. First, are individual differences in children's early EF, assessed during both preschool and elementary school, predictive of academic and social outcomes as late as sixth grade, after controlling for those background characteristics which have been shown to relate to academic and social development? Children with better EF were hypothesized to show more positive adjustment to sixth grade, as evidenced by better academic and social skills and higher emotional and behavioral regulation. Second, is this association between EF and sixth grade adjustment moderated by the type of school setting the student is attending in sixth grade? Children with EF deficits were hypothesized to show poorer academic and social competence following a transition into middle school as compared with their peers who remain in a familiar, elementary school environment. In this study, we have conceptualized EF broadly as those skills which contribute to independent regulation of action and affect, including the ability to inhibit inappropriate responding, initiate appropriate responses, sustain attention, plan and sustain a course of action, and flexibly shift cognitive set. Our battery, therefore, intentionally samples multiple components of this broad domain, including both \"hot\" (e.g., Delay of Gratification) and \"cool\" (e.g., Tower) EF tasks. Additionally, although these skills develop across childhood and adolescence, prediction from early developmental measures suggests both continuity and discontinuity of cognitive processes over time. Early skills remain malleable, susceptible to developmental and contextual factors, with the level of skill evident in the preschool years not necessarily predictive of later levels of specific skills or of specific outcomes. Therefore, it is important to examine contributions of both early and later EF skills to children's outcomes, as well as specific contributions of individual EF skills to children's sixth grade adjustment. It is also useful to examine predictions from measures at multiple time points to determine which aspects of EF seem to make the most significant contributions to predictions of children's later outcomes."}, {"section_title": "Method Participants", "text": "Participants in this study were selected from a larger sample of children taking part in the NICHD Study of Early Child Care and Youth Development (SECCYD). The SECCYD is a prospective, longitudinal cohort study of children born in 1991 and followed from birth. Data collected for the SECCYD include multiple measures of child and family characteristics, child care and school context, and child psychological, social, and academic outcomes (NICHD Early Child Care Research Network [ECCRN], 2001 and http:// secc.rti.org). Families were recruited from hospitals at 10 sites across the United States and were geographically, ethnically, and economically diverse. Of the 8,986 mothers who gave birth during the sampling window, 5,416 (60%) met sampling criteria. A conditionally random sample was selected and enrolled in the study to ensure adequate representation of the range of demographic characteristics. The total enrolled sample consisted of 1,364 families with healthy newborns. Further details regarding the selection procedures are published in the NICHD Study of Early Child Care manuals (ECCRN, 1993). Children in the present study were followed from birth through sixth grade. At the 54 month lab visit, children completed a screening battery assessing EF skills, with one additional measure (Tower of Hanoi) completed at first grade. Two measures of EF skills were repeated at the fourth (Continuous Performance Test) and fifth grade (Tower) lab visits. For the purposes of the current study, children were excluded from the sample if they did not complete at least four of the preschool EF screening measures and one later measure. Of the 1,364 children enrolled in the SECCYD, 925 children met criteria for inclusion. Comparison of the present sample with the original participants (e.g., with regard to maternal education, SES, gender, ethnic background) indicated that children remaining in the study tended to be from families with a higher SES (Mother's level of education t (1361) = 4.45, p <.001; Income to Needs t (1350) = 3.82, p <.001). Within the current sample (N=925), boys and girls were equally represented (48.5 % boys). The sample consisted of 726 (78.5%) Caucasian children, 108 (11.7%) African-American children, 53 (5.7%) Hispanic children, and 38 (4.1%) children from other ethnic backgrounds. On average, mothers had 14.44 years (range: 7-21) of education; 8% of the mothers did not finish high school. The average family income-to-needs ratio for this sample was 3.45 (range: 0.02 -23.68), with 17.8% of families residing below the poverty level."}, {"section_title": "Procedures", "text": "Participating children completed a comprehensive battery of EF measures at the 54 month lab visit, with two measures repeated at the fourth and fifth grade lab visits. At sixth grade, children completed questionnaires describing their perceptions of their school and primary teacher. Parents of participating children completed questionnaires assessing children's social and behavioral functioning during November of the sixth grade school year. Sixth grade teachers of study children also completed questionnaires providing information regarding each child's academic, social, and behavioral functioning and school type. The teacher completing the questionnaires was either the primary teacher or the teacher who taught the majority of classes to the study child (e.g., for children in elementary settings). For children in schools with team-teaching models or a different teacher for each subject (e.g., middle school settings), the teacher who completed the questionnaires was either identified by the study child's parent as the teacher who knows the child best or was the child's English or Language Arts teacher. Demographic variables and an estimate of children's early cognitive ability served as covariates in the analyses for the current study, as each showed significant associations with outcome and EF measures. Demographic data on ethnicity and maternal education were obtained through parent report at the one-month visit. Family income information was obtained at each wave through 54 months. An estimate of early verbal cognitive ability was obtained at the 54 month lab visit."}, {"section_title": "Measures", "text": "The measures selected for inclusion into the SECCYD have been widely used within the child psychology and developmental research literature and evidence strong psychometric properties. Psychometric data is provided for measures less commonly used. Extensive documentation regarding all measures is available at the study website (http://secc.rti.org). Family Characteristics-Mothers reported their educational attainment and their child's gender and ethnicity. An estimate of each family's average income-to-needs ratio across early childhood, using the family income divided by the appropriate poverty threshold (US Department of Labor, 1994), was obtained by averaging the estimates obtained at the 1, 15, 24, 36, and 54 month visits. Family income was highly stable over time (the average income-to-needs ratio correlated very strongly with individual estimates at each time point: r = .919 -.833)."}, {"section_title": "Early verbal ability", "text": ""}, {"section_title": "Woodcock-Johnson Psychoeducational Battery, Revised: Picture Vocabulary (WJ-R; Woodcock & Johnson 1989, 1990):", "text": "The Picture Vocabulary subtest of the WJ-R was administered during the 54 month lab visit and served as an early estimate of children's verbal cognitive ability (expressive vocabulary). This subtest requires children to recognize and name pictured objects. Higher scores indicate better verbal ability. Executive Function-Children's EF was examined at age 54 months in the areas of inattention and impulsive responding, mental flexibility or inhibition of automatic responses, delay aversion, and verbal attention, with planning efficiency assessed at first grade. Reassessments of sustained attention and impulsivity took place at fourth grade and of planning efficiency at fifth grade."}, {"section_title": "Continuous Performance Test (CPT; Rosvold, Mirsky, Sarason, Bransome, & Beck, 1956):", "text": "Attentional and behavioral regulation (impulsivity) were assessed at 54 months and fourth grade using the CPT, an accepted instrument for assessing both attentional regulation and impulsivity (Mirsky et al., 1991;Barkley, 1994) with good reliability (Halperin, Sharma, Greenblatt, & Schwartz, 1991) and construct and predictive validity (Barkley, 1994;Epstein, Erkanli, & Conners, 2003;Seidel & Joschko, 1991). CPTs have long been regarded as a paradigm which specifically assesses attention and inhibitory control (e.g., Barkley, 1994Barkley, , 1998DuPaul et al., 1992;Mirsky et al., 1991;Pennington & Ozonoff, 1996). The ability to sustain attention over time, for a relatively tedious task such as a CPT, involves ongoing regulation of attention to avoid distractions and sustain the appropriate response. Impulsivity, especially as measured by commission errors on a CPT-type test, is essentially the failure of inhibition, a hallmark of executive dysfunction. A recent analysis of the factor structure of the CCPT (Egeland & Kovalik-Gran, 2010) found several factors, with commission errors and omission errors loading strongly on separate factors: omission errors on the focus, or attentional control, factor, and commission error on the impulsivity factor. CPT variables, especially commission errors and variability in responding, have been shown to differentiate between children with deficits in inhibitory control and controls (e.g., Barkley, 1994). Inattention was assessed by the number of omission errors and behavioral regulation/impulsivity was assessed by the number of commission errors; higher scores indicated greater difficulty with attentional and behavioral regulation. (Gerstadt, Hong & Diamond, 1994): The ability to inhibit automatic responses was assessed using an adapted version of the Stroop Color-Word Test (Stroop, 1935). The Day-Night Stroop was designed to be used with young children and uses cards with familiar pictures (sun and moon) rather than word lists. Initial data indicated that young children's performance on this measure improves with age and time to respond, and does not show associations with demographic variables (Gerstadt et al., 1994). Half of the cards were white with a sun picture and half were black with a moon; children were instructed to respond by saying \"night\" to the white/sun cards and \"day\" to the black/moon cards. Similar to the original Stroop, this task assesses children's ability to inhibit the more automatic response. Children's ability to inhibit their responses was measured by the percentage of correct responses, with higher scores indicating better response inhibition. (Mischel, 1974(Mischel, , 1981: Delay aversion was assessed using a 7minute self-imposed delay of gratification task completed during the laboratory visit at 54 months. The Delay of Gratification task was consistent with Mischel's (1974Mischel's ( , 1981 paradigm; after determining the preferred food choice, each child was presented with a choice between waiting until the examiner returned to the room (a 7-minute wait) and earning a larger quantity of the preferred food or ringing a bell to summon the examiner and receiving the smaller portion of the preferred food. Of note, both quantities of food were placed in front of the child during the wait. The length of time each child was able to wait was recorded. Delay aversion has been shown to be associated with ADHD in preschoolers (Sonuga- Barke, Dalen, & Remington, 2003), and predictive of later academic and behavioral outcomes (Houck & Lecuyer-Maus, 2004;Mischel, Shoda, & Rodriguez, 1989;Shoda, Mischel, & Peake, 1990). Children who were not able to wait during the task showed poor ability to delay gratification, or delay aversion."}, {"section_title": "Day-Night Stroop", "text": ""}, {"section_title": "Delay of Gratification", "text": "Woodcock-Johnson, Revised: Memory for Sentences: Children's brief verbal attention was assessed with the Memory for Sentences subtest of the WJ-R during the 54 month visit. This subtest assesses the child's ability to repeat simple words and sentences heard on audiotape. The standard score was used with higher scores indicating better verbal attention. (Welsh, 1991;Welsh, Pennington, & Groisser, 1991): This task was administered during the first and fifth grade visits and assesses children's planning and problem-solving ability. The Tower task requires the child to think ahead to develop a sequence of moves to transform an initial configuration of rings on the child's set of pegs into the pattern shown on the experimenter's set, while following procedural rules. Tower tasks are developmentally sensitive (Denckla, 1994;Gnys & Willis, 1991;Klahr & Robinson, 1981) and discriminate between children with cognitive disabilities and controls (Welsh, Pennington, Ozonoff, Rouse, & McCabe, 1990). Correct scores for each Tower item were summed to provide a total planning efficiency score, with higher scores indicating better planning ability."}, {"section_title": "Tower of Hanoi", "text": "School setting type-Sixth grade teachers completed a questionnaire indicating which grades were taught at their school. From this measure, data on school type were obtained for a subsample. Study children attended sixth grade in schools with a variety of configurations, but close to half (43%; N=321) were attending sixth grade in a K-6, K-8, or K-12 school. Approximately 41% (N= 307) children were attending a school where they had recently undergone a school transition, such as a 6-8, 6-12, or 6-7 junior high. The remaining children were attending either an upper elementary school (e.g., grades 4-6 or 4-9; N=13) or a school where they had experienced a school transition the previous year (e.g., grades 5-6, 5-7, 5-9; N=62). Children falling into the latter two groups were excluded from the school setting analyses as these analyses specifically examined the effect of school transition at sixth grade."}, {"section_title": "Outcome measures of sixth grade adjustment", "text": "Mock Report Card (Pierce, Hamm, & Vandell, 1999): The Mock Report Card, initially created for the Study of After-School Care, was completed by each child's sixth grade teacher and provided information about the child's academic grades, classroom work habits, and social skills with peers. This measure has three subscales, each consisting of items rated from 1, \"below grade level\" to 5, \"excellent.\" The Current School Performance subscale includes teacher ratings corresponding to academic grades in six academic subjects: reading, oral language, written language, math, social studies, and science. The Work Habits subscale consists of 6 items which correlate with parent reports of children's work habits and children's self-reports of academic competence. The Social Skills With Peers subscale includes teacher ratings of the child's social interaction skills, and consists of items from the Teacher Checklist of Peer Relations (Coie & Dodge, 1988). Internal reliabilities (Cronbach's alpha) for the three scales were high, ranging from .92 -.95. Higher scores indicate better academic and social functioning. Teacher Reported Child Academic Skills: This measure was adapted from the Academic Skills measure used in the Early Childhood Longitudinal Study of the National Center for Educational Statistics (NCES; http://nces.ed.gov/pubs2001/2001029_1_4.pdf.).The sixth grade teacher rating includes only the 10 Language and Literacy items from the larger measure, related to listening, speaking, reading, and writing skills. Items include both skillbased ratings and items relating to how well the child uses knowledge or skills to complete his or her work (e.g., \"Uses various strategies to gain information\" or \"Re-reads/ reflects on writing and makes changes\"). The child's performance is rated on a 5-point scale, relative to other children the same age. The Language and Literacy composite score is the mean score across items, with higher scores indicating better skills. Internal reliability was high (Cronbach's alpha = .94). Teacher and Parent Reported Child Behavior (Achenbach, 1991): The Teacher Report Form (TRF) and parent rating forms (CBCL) of the Child Behavior Checklist were administered to obtain teacher and parent reports of children's typical levels of adaptive skills and problem behavior within the classroom and home settings. The CBCL is the most widely used rating scale of children's behavior used to identify the emergence of behavior problems across childhood. Measures of interest included the Social Problems, Attention Problems, and Delinquent Behavior subscales. These scales show adequate to excellent internal reliability (Cronbach's alpha) ranging from .78 and .94 (parent and teacher forms, respectively) for the Attention Problems subscale, .67 and .81 for the Social Problems subscale, to .62 and .73 for the Delinquent Behavior subscale."}, {"section_title": "Teacher and Parent Reported Social Skills (SSRS; Gresham & Elliott, 1990):", "text": "The Social Skills Rating System was completed by each study child's parent and sixth grade teacher to provide a broad assessment of the child's social competence and adaptive skills. Measures of interest included the teacher reported Self-control and Cooperation scales and parent reported Self-control and Peer Competence scales. The teacher reported Self-control and Cooperation scales were used to provide an estimate of the child's ability to demonstrate self-regulated behavior in classroom and peer interaction situations and respond to teacher directives and manage classroom materials appropriately. Both scales show high internal reliability (Cronbach's alpha = .88 for the self-control scale, .92 for the cooperation scale). The parent reported Self-control and Peer Competence scales were used to provide an estimate of the child's ability to demonstrate self-regulated behavior at home and manage peer interactions appropriately. Both scales show moderate to high internal reliability (Cronbach's alpha = .83, Self-control scale; .78 Peer Competence scale). Teacher and Parent Report of Children's Reactions: Each child's teacher and parent completed questionnaires assessing their perceptions of the frequency and manner in which the child typically expressed his or her emotions. This questionnaire was based upon measures of emotionality used by Eisenberg and colleagues (Eisenberg et al., 1995), with 10 items rated on a 5-point scale from \"never\" (1) to \"always\" (5). Items included the degree to which the child typically responds to successfully completing difficult tasks; reading or watching stories or movies; and the child's general emotional state. Higher scores indicate greater perceived negative emotional reactions. Scores on teacher and parent ratings showed adequate internal reliability (Cronbach's alpha = .84 and .78, respectively). Preliminary data reduction: Principal components analysis of sixth grade outcomes-Parent and teacher ratings of children's functioning on the selected scales of the CBCL and SSRS, the emotional reaction scales, and Mock Report Card were factor analyzed to reduce the number of outcome measures. Principal components analysis, using Varimax rotation, yielded four factors when teacher and parent measures were factored together, with the four factors explaining 69% of the variance in the outcome measures. The first two factors were teacher factors, and the third and fourth factors were driven by parent ratings. Results were similar when parent and teacher measures were factored separately. Based on the principal components analysis, four factors were created and used as the primary outcome measures in subsequent regression analyses. Items were reversed for scales which loaded negatively onto their respective factor, outcome scales were standardized, and then combined (unit-weighted) to create the factors. Scales loading on the first factor (teacher rated academic behavior; Teacher reported Academic Skills; Mock Report Card: Current School Performance, Work Habits, and Social/Emotional Development; SSRS Cooperation; TRF Attention Problems) represented both academic skills and behaviors which support academic achievement such as sustaining attention to tasks, productive work habits, and appropriate classroom behavior. Factor loadings for individual scales on the first factor ranged from .627 for the TRF Attention Problems scale to .878 for the teacher reported Academic Skills rating of language and literacy skills. The second factor (teacher rated problem behavior) represented problematic interpersonal behaviors detrimental to learning and social interactions, including poor emotional and behavioral regulation in social situations. Scales loading on this factor included the Teacher Report of Children's Reactions, TRF Delinquent Behavior and Social Problem scales, and SSRS Self-control scale. Factor loadings for individual scales on the second factor ranged from .647 for the TRF Social Problems scale to .757 for the Teacher Report of Child Reactions. The third factor (parent rated behavioral control; parent reported SSRS Self-control and Peer Competence ratings, Parent Report of Children's Reactions) represented parent ratings of children's positive behavioral regulation and competence in social interactions. Factor loadings for individual scales ranged from .571 for the Parent Report of Children's Reactions to .907 for the parent reported SSRS Self Control scale. The fourth factor (parent rated problem behavior; CBCL Attention Problems, Social Problems, and Delinquent Behavior scales) represented parent ratings of problematic behaviors, such as distractibility, poor social interactions, and delinquent or negative behaviors. Factor loadings for individual scales on this factor ranged from .410 for the CBCL Delinquent Behavior scale to .832 for the CBCL Attention Problems scale."}, {"section_title": "Results", "text": ""}, {"section_title": "Associations among the EF measures", "text": "In addition, correlations among EF measures, both at the same time point and across time (for those measures administered twice), were low to modest (see Table 1). Correlations among individual EF measures ranged from .000 to .356. Correlations between the individual EF measures and the sixth grade outcome factors were also low overall, with somewhat stronger correlations between more proximal measures (e.g., Tower at fifth grade, CPT at fourth grade) and sixth grade academic behavior."}, {"section_title": "Associations with child background characteristics", "text": "Examination of correlations between demographic variables and the EF measures indicated that children with lower socio-economic status (SES) were significantly more likely to have poorer EF skills (correlations with the composite Income to Needs score ranged from r = . 107, p =.002, to .274, p <.001; correlations with level of maternal education ranged from r = .120, p <.001, to .284, p < .001). Additionally, boys were more likely to demonstrate poorer EF skills, although the difference was not consistently significant across EF measures (CPT-Commission errors at 54 months, p <.001; CPT-Omission errors at 54 months, p =. 033; Tower at first grade, p=.002; CPT-Commission errors at fourth grade, p <.001). Early verbal ability was positively associated with performance on the EF measures (correlations with individual EF measures ranged from r=.071, p = .042, for the Day-Night Stroop to r =. 282, p<.001 for the Delay of Gratification and r = .458, p < .001 for the WJ-Memory for Sentences), and negatively associated with levels of problem behavior, both in and out of school (correlations of early verbal ability across outcome factors ranged from -.14 to .33, strongest association with teacher reported academic behavior). Thus, SES, gender, and early cognitive ability were included in subsequent analyses as covariates. Families of children remaining in an elementary setting for sixth grade tended to have a higher income during the developmental period [F(1,709) = 3.92, p = .048]. To correct for multiple comparisons, p was set at .01 rather than .05."}, {"section_title": "Prediction of sixth grade adjustment by measured EF", "text": "Hierarchical regression analyses were used to examine each of the questions. For each analysis, a consistent model was used: family characteristics were entered in the first block (the composite income-to-needs ratio and maternal education level), followed by child background characteristics (ethnicity, gender) and then early verbal ability, with the standardized EF measures entered in the final block. The first question examined whether children's measured EF skills, assessed during the preschool period and again in elementary school, predicted sixth grade academic and behavioral competence. Results are reported in Table 2 and described below. Teacher Rated Academic Behavior-Children's EF skills (assessed at 54 months and during late elementary school) significantly predicted teacher ratings of sixth grade academic behavior such as grades, work habits, cooperation with teacher directives and classroom expectations, and maintaining attention to task. The total model explained 39.8% of the variance in children's academic behavior (see Table 2). EF skills accounted for a unique 13.5% of the variance, over and above the contributions of family SES, ethnicity, gender, and early cognitive ability. Examining prediction by the individual EF measures, an increase of one standard deviation in the child's early behavioral regulation (CPT -Commission error score at 54 months) was associated with an increase of .121 SD (standardized beta weight) in the child's standardized academic behavior score at sixth grade, after controlling for background characteristics. Later behavioral regulation (fourth grade CPT -Commission error score), later attentional control (fourth grade CPT -Omission error score) and planning ability (fifth grade Tower score) were associated with increased academic competence. Teacher Rated Problem Behavior-EF skills significantly predicted teacher reports of children's problem behavior, such as emotional reactivity, poor self-control, delinquent behavior, and social problems. The total model explained 21.7% of the variance in problematic school behavior, with executive skills explaining a unique 9.1% of the variance beyond the contributions of background characteristics. With regard to EF, the strongest predictors were measures of behavioral regulation (CPT-Commission scores at 54 months and fourth grade). Better performance on both preschool and fourth grade CPT Commission scores was associated with a decrease in teacher reported sixth grade behavioral problems. Parent Rated Behavioral Control-In examining contributions of EF to parent reports of behavioral control/ reactivity, results indicated that although the overall model accounted for a small proportion of the variance (just under 10%) in parent ratings, EF skills were significantly predictive of parent ratings. Measured EF accounted for a unique 3% of the variance in parent reports of children's behavioral control. This variance was primarily accounted for by performance on the Tower of Hanoi in fifth grade, where increases in demonstrated planning ability were associated with increased parent reported behavioral control. Parent Rated Problem Behavior-A similar pattern was evident for parent reports of problem behavior, where the overall model explained 9.4%, with EF explaining a unique 3.7%, of variance in parent reported behavior problems. Higher scores on this factor indicated greater difficulty with attentional regulation and appropriate peer interactions, with increased in planning ability (fifth grade Tower score) associated with lower parent rated problem behavior scores."}, {"section_title": "Influence of school setting on sixth grade adjustment", "text": "To examine the additional influence of the type of sixth grade school setting (e.g., elementary or middle school) on children's academic and behavioral functioning, multiple hierarchical regressions were conducted with the school setting terms added to the final step, after controlling for the base model. Subsequently, interactions between individual EF measures and school setting type were tested, with the alpha level set at p ≤.01 in acknowledgement of the number of analyses to be run. Results (see Table 3) indicated that sixth grade school setting is a small but significant predictor of children's problematic behavior in school (teacher ratings). For teacher reports of problem behavior, the sixth grade school setting explained 1% of the variance (R 2 change = .010, p = .010), over and above prediction by background characteristics and measured EF. After controlling for background characteristics and EF skills, children attending sixth grade in an elementary school setting were rated by teachers as showing higher levels of problem behaviors than children in a middle school setting. School setting type did not add significantly to prediction of children's academic functioning or parent ratings of behavioral competence. In order to determine whether the type of school setting attended in sixth grade moderated the association between measured EF skills and academic and behavioral outcomes, interactions between individual EF measures and school setting were computed and tested. Each individual EF by school setting variable was added separately in a series of step-wise regressions in the final step, after adjusting for prediction by the initial model. Those individual EF measure by school setting interactions which predicted a significant proportion of variance in children's sixth grade academic and behavioral adjustment are presented in Table 3. On average, the individual school setting by EF interactions accounted for between 1 to 2% of the variance in teacher ratings of children's functioning, and from 1 to 6% of the variance in parent ratings of children's behavior. Teacher Rated Academic Behavior-Examining the school setting by specific EF skill interactions on children's academic competence indicated that the association between EF and teacher reported academic functioning was greater for children attending sixth grade in an elementary setting than for those in a middle school setting. This association differed by school setting for children's immediate verbal span, ability to delay gratification, behavioral regulation or impulsivity, and regulation of attention. For example, children attending sixth grade in middle school showed a generally consistent level of academic competence regardless of their level of measured EF, while those children with poorer behavioral regulation (as measured by more CPT commission errors at fourth grade) showed significantly worse academic functioning when they attended sixth grade in an elementary setting (see Figure 1). Children with poorer measured EF in their ability to delay gratification and regulate their attention also showed significantly less competent classroom academic behavior when they were attending sixth grade in an elementary school setting. The magnitude of this effect for these riskier children ranged from .636 SD (commission errors on the fourth grade CPT) to .275 SD (WJ-Memory for Sentences), a significant difference in children's demonstrated academic competence. Teacher Rated Problem Behavior-Similarly, for teacher ratings of children's problematic behavior, later behavioral regulation (commission errors on the CPT at fourth grade) showed a stronger association with classroom problematic behavior for children in an elementary school setting than for those in a middle school (see Figure 2). Children who demonstrated poorer behavioral regulation showed greater problematic behavior in elementary school than in middle school settings. The difference in problem behavior scores for the riskier children represented .624 SD. Parent Rated Behavioral Control-The pattern of the associations was reversed for those outcomes rated by parents. For parent ratings of behavioral control, both early and later measures of behavioral regulation were more strongly associated with behavioral control for children in a middle school setting than for those in elementary school settings (see Figure 3), although the direction of the effect was different for the early and later measures. Children with poorer behavioral regulation during later elementary school (more commission errors on the fourth grade CPT) were rated by their parents as showing better behavioral control when attending sixth grade in an elementary school setting, with a large effect size representing more than a one SD difference between school settings. However, children with poorer behavioral regulation prior to starting school (more CPT commission errors at 54 months) showed better behavioral control when attending sixth grade in a middle school. The difference between settings was smaller for the preschool CPT measure, representing .555 SD in children's behavioral control. Parent Rated Problem Behavior-For parent ratings of children's behavioral problems, better performance on the later EF measures was associated with fewer behavioral problems for children in an elementary school setting. Children with poor behavioral regulation, poor planning, and greater inattention showed fewer behavioral problems in sixth grade when they were in an elementary school (see Figure 4). The magnitude of the difference associated with school setting type ranged from .387 to .750 SD in problem behavior scores. The early measure of behavioral regulation (CPT commission score at 54 months) showed a different association with school setting than the later measures: children with poorer behavioral regulation at 54 months showed more behavior problems when they attended in sixth grade in an elementary setting."}, {"section_title": "Discussion", "text": "This study examined the associations between children's EF and their sixth grade academic and social adjustment in a national sample. The first goal of the study was to determine whether performance-based EF skills, assessed prior to the start of school and during elementary school, predicted sixth grade academic and social adjustment, as rated by teachers and parents. The second goal of the study was to explore the additional influence of school setting on children's adjustment and on the relation between EF and sixth grade competence."}, {"section_title": "Association between EF measures and sixth grade adjustment", "text": "Children's measured EF, assessed both prior to starting school and during late elementary school, predicted sixth grade adjustment, as assessed by teacher and parent ratings. EF measures, including preschool and elementary measures of attentional and behavioral regulation, planning and working memory, and preschool measures of delay aversion, inhibition, and auditory attention, predicted between 3 and 13.5% of the variance in children's sixth grade academic and behavioral functioning, above and beyond prediction by known correlates of school performance (e.g., family SES, children's gender and ethnic background, and early verbal ability). Prediction was stronger for those behavioral and academic outcomes assessed by teacher rather than parent report. The EF measures accounted for a larger proportion of variance in children's behavior at school (teacher ratings) than their behavior at home or in the community (parent ratings). This difference in predictive value for EF measures across settings may suggest that EF skills, as demonstrated by self-regulated academic and social behavior, are more salient within the classroom context. The preschool and elementary measures of behavioral regulation/impulsivity and the elementary measure of attentional regulation were predictive only of children's school functioning and not of their functioning at home. The classroom setting likely requires a higher level of independent behavioral regulation from children, where there are multiple students, curricular pressures, and specific behavioral expectations. By sixth grade, children are expected independently manage multiple classes, assignments, and multiple peer interactions (Eccles & Midgley, 1989;Rudolph et al., 2001;, which require significant behavioral self-regulation. Impulsivity, or poor behavioral regulation, limits a child's ability to consider multiple aspects of an academic or social situation and respond thoughtfully, putting the child at risk for mismanaging aspects of the classroom or social interactions (Anderson & Moore, 1995;Barkley et al., 1992;Pascualvaca, et al., 1997). Given multiple individuals within the classroom, differing expectations, and the level of independent behavioral regulation required, performing competently within the school setting may place higher demands on children's developing self-regulatory skills than does the home setting. For children's academic competence, measured EF skills accounted for almost as much variance as family characteristics, which are known correlates of academic success. Importantly, EF skills have been shown to be malleable and strategies exist for scaffolding children's executive skills (e.g., Campbell, Duffy, & Salloway, 1994;Dawson & Guare, 2005). These results also suggest that measures of EF and cognitive ability likely assess different aspects of cognition (e.g., Ardila, Pineda, & Rosselli, 2000;Friedman et al., 2006;Willcutt, Doyle, Nigg, Faraone, & Pennington, 2005). Even among those measures administered prior to school entry, EF measures accounted for more variance in children's later academic behavior than did early cognitive ability. The fact that children's impulsivity during the preschool years (as measured using the CPT-Commission errors at 54 months) significantly predicted teacher reported academic and problem behavior is consistent with prior work indicating the importance of well developed EF processes in the early years for later academic and social success (Hughes, Ensor, Wilson, & Graham, 2010;Welsh, Nix, Blair, Bierman, & Nelson, 2010). In addition, this study suggests that EF is associated with more than simply academic competence; the EF measures were associated with a significant proportion of the variance in children's social and behavioral competence across settings. There is a growing body of work which suggests that EF is a product of a complex orchestration of regions in the brain which also process emotion and affective responses to social cues (e.g., Anderson, 2002;Bush, Luu, & Posner, 2000;Paus, 2005;Rueda, Posner, & Rothbart, 2004). Results of this study provide additional support for the interdependence of EF and successful social interactions, especially in situations of environmental challenge (e.g., peer conflict or academic expectations). Some work has suggested that puberty, and the concomitant neural-endocrine-behavioral changes (e.g., Bush et al., 2000;Paus, 2005), may also be a factor involved in children's ability to manage this transition, falling as it does in the midst of this physiological period for many children. However, in the initial draft of this work, analyses examining the association of the sixth grade outcomes with objective measures of pubertal status at sixth grade (i.e., Tanner staging) suggested that in this sample, pubertal status was not significantly associated with the outcome factors as described in this study. It may be, as suggested by some of the prior literature on this topic, that subjective measures of pubertal status and/or perceived timing have a greater impact on social-behavioral functioning than actual biological measures of pubertal status (e.g., Silbereisen & Kracke, 1997)."}, {"section_title": "Influence of school setting on children's sixth grade outcomes", "text": "The second research question explored the additional influence of the type of school setting attended in sixth grade on children's academic and behavioral outcomes. Although prior work suggests that making a transition to middle school at sixth grade is generally associated with poorer academic and behavioral adjustment (e.g., Barber & Olsen, 2004;Gutman & Midgley, 2000;Poncelet, 2004), in this sample, attending sixth grade in a middle school was not associated with poorer academic and behavioral functioning. Counter to predictions, these results indicated that attending sixth grade in an elementary rather than a middle school setting was associated with more teacher reported problem behavior, but not with changes in academic competence or parent reports of children's behavior. However, these associations were moderated by interactions between specific EF skills and the type of school setting children were attending. Children with poorer EF skills tended to show less competent academic and behavioral functioning (teacher ratings) when they were attending sixth grade in an elementary school rather than middle school. Findings were reversed, but consistent with apriori hypotheses, for the EF-school setting interactions on parent ratings of behavioral control and problem behavior. While the reason for this difference is not clear, it may be due in part to the comparisons being made by different raters. The differences found between parent and teacher report were not surprising given that the concordance rates between caregiver and teacher report are often low and, that children's behavior is often contingent upon context (Winsler & Wallace, 2002). We provide possible explanations for these findings below while acknowledging the possibility of rater bias which may indicate that teachers tend to be more accurate judges of children's behavior (Hartman, Rhee, Willcutt, & Pennington, 2007). Although in this study, EF skills appeared most important for successful academic functioning, characteristics of the type of school setting may affect the way in which teachers in different school settings rate their students. Middle school teachers have multiple classes and interact with more children per day than do typical elementary school teachers, thus given their more limited contact with individual children, they may tend to rate individual children less thoroughly or knowledgeably than elementary teachers. In addition, given the literature suggesting that children overall tend to show more difficulty in middle schools (e.g., Seidman et al., 1994;Eccles & Midgley, 1989), the overall level of children's behavioral regulation may tend to be lower for children attending middle school. If the majority of children are experiencing some level of behavioral difficulty, then those with specific executive dysfunction may \"blend in\" and be less apparent to teachers of larger groups of children. Elementary teachers may thus be more likely to identify children who are having specific difficulties. However, parents did identify differences in children's functioning based upon the setting in which they were attending school, which may suggest that parents are making more specific, individualized ratings and are better able to identify children's difficulties. These results suggest that a finer-grained examination of school setting characteristics is necessary, as the support available to children may vary even within elementary or middle school settings. Such characteristics may include the child's perception of contextual demands relative to his or her capabilities, as well as other characteristics of the school setting. Consistent with Eccles and Midgley's (1989) concept of \"stage-environment fit,\" children may require a certain level of congruence between their capabilities and the classroom demands for optimal functioning."}, {"section_title": "Limitations", "text": "Children in this study were typically average to high functioning, with generally high family SES. Children with developmental disorders or health complications identified at birth were excluded from the SECCYD, so this sample does not represent a neurologically or developmentally at-risk population and results may represent low estimates for the effects of EF in a riskier population. A corresponding limitation is that some selected attrition of the SECCYD sample did occur over time, with riskier children (e.g., those from families with lower SES) less likely to remain in the study through sixth grade. Loss of children at greater risk for both executive dysfunction and academic or behavioral difficulty may have attenuated the associations studied. Children do not randomly select into schools, they are typically assigned to schools on the basis of the neighborhood or setting in which they live or the family's financial ability to afford private school. As such, children attending sixth grade in elementary settings may differ systematically from those attending middle school settings, if school type is confounded with neighborhood or geographic location. Data collected in this study did not include a measure of school location (e.g., rural or urban setting); however, there was a significant association between type of sixth grade school setting and family income during the developmental period. The observed differences may be confounded by the tendency for children from families with lower SES to be more likely to make a transition to a middle school setting at sixth grade, which makes it difficult to disentangle effects of SES from effects of the specific transition or school type. Further research is needed to clarify the contributions of SES, school location, and school type. Similarly, data describing certain characteristics of the school structure, such as school size, heterogeneity, amount of individual teacher-student contacts, or grading standards were not available. These characteristics have been shown affect children's transition into middle schools (Alspaugh, 1998;Eccles & Midgley, 1989;. Additional information describing such characteristics of the school settings might help to further examine the school setting-EF interactions found. Furthermore, given the number of interaction analyses run in examining these influences, the risk for finding significant results by chance is elevated and results should be replicated on an independent sample,"}, {"section_title": "Conclusions and Future Directions", "text": "Nevertheless, results of this study indicate that EF is an important contributor to ratings of children's academic and behavioral competence during their adjustment to sixth grade. School context was considered to moderate the association between EF skills and sixth grade behavior, although another perspective might suggest that EF skills themselves may be a moderator of the association between school setting/transition and academic and social functioning. Future work may help to further elucidate these relationships. Additionally, as children's ability to negotiate this transition can significantly alter their developmental trajectories, it is critically important to identify those individual differences which place children at risk for future difficulty. These results also suggest a role for incorporating curricula that have been shown to promote developing EF skills during early childhood, to support development of these critical skills in all children (e.g., Tools of the Mind, Barnett et al., 2008;Diamond, Barnett, Thomas, & Munro, 2007). Furthermore, these results suggest that providing targeted support to children with executive dysfunction, whether through specific remediation of executive deficits or increased support within the classroom setting, has the potential to significantly improve children's academic and social functioning. Future work should investigate the effects of such targeted interventions.     Correlations between individual EF measures and sixth grade outcome factors CPT-O: CPT omission errors at 54 mo., CPT-C: CPT Commission errors at 54 mo., DNS: Day-Night Stroop impulsivity score at 54 mo., WJ-MS: Woodcock-Johnson Memory for Sentences score at 54 mo., DOG: Delay of Gratification wait score at 54 mo., TOH1: Tower of Hanoi total score at grade 1, CPT-O4: CPT omission errors at grade 4, CPT-C4: CPT commission errors at grade 4, TOH5: Tower of Hanoi total score at grade 5, F1: grade 6 outcome factor 1(Teacher rated academic behavior), F2: grade 6 outcome factor 2 (Teacher rated problem behavior), F3: grade 6 outcome factor 3 (Parent rated behavioral control), F4: grade 6 outcome factor 4 (Parent rated problem behavior). Child Neuropsychol. Author manuscript; available in PMC 2014 June 30.   Child Neuropsychol. Author manuscript; available in PMC 2014 June 30."}]