[{"section_title": "Abstract", "text": "Ageism has many cumulative negative health effects, so reducing ageism in collegeage youths can have a significant, long-term impact on public health. Reduced ageism decreases the prevalence and severity of many negative health events, such as myocardial infarctions, and can add an average of 7.5 years to the life span. One of the few proven methods for reducing ageist ideation is through participation in a video screening and a pair of follow-up conversations. This intervention is similar to the regular activities of many faculty members in the humanities. Gerontologists' expertise with quantitative studies, qualitative studies, and data analysis is needed to determine what factors can improve the efficacy of the intervention and to demonstrate the long-term health impact of specific interventions. Humanities research also will benefit from expanded understandings of aging and old age. Organizations such as the Gerontological Society of America, the European Network in Aging Studies, and the North American Network in Aging Studies can facilitate interdisciplinary collaboration."}, {"section_title": "", "text": "2006; Levy, Zonderman, Slade, & Ferrucci, 2009 . See also Hess & Hinson, 2006; Hess, Hinson, & Statham, 2004; O'Brien & Hummert, 2006; Pinquart, 2002; Stein, Blanchard-Fields, & Hertzog, 2002; Wurm, Tesch-Römer, & Tomasik, 2007) . For example, consider the long-range impact of negative age stereotypes on cardiovascular events in later life, as well as on the recovery time.\nUsing a subset of data from the Baltimore Longitudinal Study of Aging, which included information about the participants' age stereotypes, Levy and her colleagues tracked the health events in people who, at the outset, were age 49 or younger and had not had any cardiovascular events (angina attacks, congestive heart failures, myocardial infarctions, strokes, or transient ischemic attacks). The study found that people who had more ageist ideations when they were under the age of 50 were more likely to have a cardiovascular event and more likely to have an event at a younger age. For instance, in the 30 years following the baseline measurement, 25% of people who believed in negative age stereotypes had a cardiovascular event, compared with 13% of people who had more positive age stereotypes. Participants whose scores on the Attitudes Toward Old People scale were just two standard deviations (SDs) more positive had an 80% reduction in their risk of having a cardiovascular event . In another study of people who had acute myocardial infarctions, that event had less of an impact on people who held more positive age ideations, and seven months after the event, those people who had positive age stereotypes had more than twice the rate of improvement in their physical performance, measured using the Short Physical Performance Battery (Levy, Slade, May, et al., 2006) . The information from that study suggests not only that less-ageist people are less likely to have an acute myocardial infarction, but that less-ageist individuals who do have such an event will have a lower level of damage and a faster time to healing. These data highlight just one small part of the health impact of ageist beliefs. Fortunately, the evidence also points to a potential positive, long-term impact on public health and longevity. The cumulative benefit of having more positive perceptions of aging is a life span that averages 7.5 years longer than people with less positive perceptions of aging (Levy, Slade, Krunkel, et al., 2002) . For most North Americans, 7.5 years is a longevity increase of approximately 10%. The data also suggest that those added years include lower levels of need for medical intervention . Gerontologists are aware that an individual's economic, social, cultural, and emotional environment contribute to mental and physical well-being. With evidence that beliefs about aging and old age affect health and life span, a key question for the longevity dividend becomes this: how can people of all ages reduce their negative conceptions about aging and old age?"}, {"section_title": "Changing Attitudes Toward Older People", "text": "Humans internalize age stereotypes about the same time as they do race and gender stereotypes, around 4-6 years of age, and their prejudices strengthen with age (Anderson, 1999; Blunk & Williams, 1997; Isaacs & Bearison, 1986; McGuire, Klein, & Couper, 2005) . Ageist assumptions about old people are enacted across the life span. Some quantity of positive change is fairly easy to effect because \"the average person has about as many misconceptions about aging as correct conceptions\" (Palmore, 2005) . Although dozens of articles suggest seemingly logical methods, relatively few provide statistical support showing that the recommended intervention changes people's perceptions about aging and old age. Conditions proven to create change include extended contact with elder coworkers (Allan & Johnson, 2009) , increased understanding of aging as a life-long process (Cottle & Glover, 2007) , and an influx of information followed by a discussion about ageism (Ragan & Bowen, 2001 ). The first two of those conditions are less conducive to isolated intervention, so this article focuses on the third method.\nIn their study, Ragan and Bowen showed 112 participants a 30-min video, \"The Myths and Realities of Aging,\" an episode of the PBS series Growing Old in a New Age. All participants received a pre-test assessment using the Aging Semantic Differential and watched the video. One third of the participants then completed the post-video assessment and left the testing facility (Group A). One third had a 25-min discussion about an unrelated subject (campus life), returned a week later for a similar discussion, and then completed the post-video survey (Group B). One third had a 25-min discussion about the stereotypes and realities of aging, returned a week later for another discussion, and then completed the post-video survey (Group C). In Group C's initial discussion, participants were encouraged to talk about the material in the video that challenged the things they believed about aging and old age. They received verbal reinforcement for appropriate remarks; off-task comments were ignored. In the 1-week follow-up conversation, they were asked to discuss the information they recalled from the video and the previous conversation, and how the things that they remembered altered their ideas about aging and old age. All participants received follow-up surveys one month after their last contact with the researchers.\nFor the pre-test, Group A's mean score was 96.55, Group B's was 101.15, and Group C's was 100.73, with SDs of approximately 20. In the first post-test, Group A's score was 172.64 (SD 7.25), Group B's was 170.32 (SD 6.58) , and Group C's was 167.37 (SD 4.98). The followup post-test score means were 116.27 for Group A (SD 22.38), 120.42 for Group B (SD 18.72), and 171.52 (SD 19.91) for Group C. The post-video discussion about age stereotypes had a long-term, positive impact; members of Group C retained their new understanding and may have added to it slightly. As this study suggests, the factor that makes a statistically significant difference in people's ideas about aging and old age is not just learning accurate information, but discussing that information. It is worth noting that Allan and Johnson's (2009) research suggests that the path to change might not be direct, but that increased information affects people's anxieties about aging, and the reduced level of anxiety influences their attitudes about aging. Whether the effect is direct or indirect, as the research of Levy and her colleagues demonstrates, interventions that reduce ageist ideations have tremendous potential. Unfortunately, not only do some gerontology classes not include the kinds of videos and discussions that can have an impact on ageist ideas, but relatively few students take gerontology classes."}, {"section_title": "The Reach of Humanities Courses", "text": "Ragan and Bowen's research suggests that the humanities can make a significant contribution to improving the longevity dividend. Improving gerontological literacy through the content of general education courses in the humanities can expand the reach of gerontological interventions exponentially, may add healthy years to people's life spans, and perhaps can even improve the availability of trained gerontological medical personnel and caregivers (cf. Funderburk, Damron-Rodriguez, Levy-Storms, & Solomon, 2006) . In humanities courses, including literature, history, philosophy, and composition classes, showing videos and having discussions is a familiar activity (similar interventions could fit into the offerings at public libraries and in K12 schools). Many general education courses are designed to encourage engagement, reflection, and critical thinking. Part of the training that most humanities faculty members receive, and very often part of their charge as instructors, focuses on familiarizing students with forms of diversity-race, class, gender, sexual orientation, bodily ability . . . , and age. Moreover, instructors in the humanities teach, to first order, every undergraduate student, so the content in general education humanities classes has tremendous reach.\nAlso, changing attitudes about aging affects career choices as well as individual health and longevity. The 21st-century workforce is age diverse, and there is evidence that people who have exposure to critical gerontology ideas are better prepared to interact with people across the age spectrum more thoughtfully and respectfully (Chowdhary, 2002; Chowdhary et al., 2000; Harris & Dollinger, 2001 ). Efforts to improve students' gerontological literacy provide value-added contributions to a university education. The goal is to inform and prepare students for their roles as citizens and workers in a diverse society.\nFurthermore, beliefs about aging and old age correlate with students' work preferences (cf. Funderburk et al., 2006) , so students with more positive ideas about aging and old age are more likely to consider careers that involve older people. Thus, general education classes that have students critically revisiting ideas and stereotypes about aging and old age also have the potential to boost the number of students who major or minor in gerontology, gerontological nursing, gerontological social work, geropsychology, care home management, and so on."}, {"section_title": "Resistance to Age Studies: From the Humanities", "text": "Most humanities scholars are not trained to analyze statistical data, determine the practical value of interventions, and develop additional quantitative trials to strengthen experimental outcomes. Additionally, much like some gerontologists, many scholars in the humanities are skeptical about the use-value of age studies, which is the humanities equivalent of critical or cultural gerontology. Indeed, the level of skepticism in the humanities may be even higher than it is in gerontology, because the benefits to humanities scholarship are more difficult to measure. Nonetheless, researchers can add depth to their analyses by considering age relations even when their research may seem far from gerontology. For instance, how many cultural studies, film studies, and race studies scholars noticed that Katniss and Peeta's physical and intellectual triumph in Catching Fire (2013) reinforces ageist stereotypes, as the actors playing those roles were the youngest of the named competitors in the arena; that Kung Fu Panda (2010) bolsters stereotypes connecting wisdom and old age; and that the treatment of age emphasizes racial and cultural difference in The Help (2011), Argo (2012), and Captain Phillips (2013) in ways that reinforce Caucasian Americans' belief in their own cultural superiority. Age studies scholars are working to improve their colleagues' understandings of the positive impact that such concepts can deliver."}, {"section_title": "Appreciation for Age Studies: From Gerontology", "text": "The work of age studies scholars in the humanities continues a host of ongoing efforts. Many humanities-based age studies scholars reference Kathleen Woodward's Aging and Its Discontents (1991) as their introductory text to this area of study. In the field of gerontology, a recognition of the humanities' value can be traced to many sources, of which one of best known is the first Handbook of the Humanities and Aging (Cole, Van Tassel, & Kastenbaum, 1992) , which in turn references a growing awareness and publication in the 1970s as evidence for the creation of humanistic gerontology. Publications such as the Journal of Aging and Identity (1998-2002) and the Journal of the Humanities and Arts in Aging, last published in 2010, served as communication vehicles for scholars working in this area. The Gerontologist published many of the pioneers in humanistic gerontology and age studies (cf. Cohen, 1979; Cole, 1984; Moody, 1988; Perlstein, 1987; Van Tassel, 1978; Wyatt-Brown, 1986 ) into the 21st century. In just the last year, one could point to several such Gerontologist articles (e.g., Fung, 2013; Jönson, 2013; Katz & Calasanti, 2014; Oró-Piqueras, 2014; Swinnen, 2013; Zelig, 2014) , as well as to the inception of a new academic journal, Age, Culture, Humanities. Among scholars in humanistic, cultural, and critical gerontology is a consensus of concern about \"the problem of emancipation of older people from all forms of domination\" (Moody, 1993, p. xv) . Similarly, there is a general agreement that the humanities are well positioned to advance this work because the stock-in-trade of the humanities-self-knowledge, historical understanding, imaginative communication, and critical appraisal of assumptions and values-can promote a more intellectually rigorous gerontology in several ways: heuristically, by offering new hypotheses for empirical inquiry; critically, by revealing values and power relations often concealed in existing methods and findings of empirical research; and practically, by offering reflection on the intentions and values realized by human actors in particular cultural settings. (Cole, 1993, pp. vii-viii, emphasis in the original) Even gerontologists who remain focused on empirical research are likely to be familiar with the efficacy of humanities-based interventions-the work of people such as Anne Basting, Gary Glasner, and Joan Jeffri, and programs and organizations such as the Penelope Project, the Memory and Music project, and the National Council on Creative Aging. Improving cross-generational engagement, this work decreases the use of medication and rates of depression and improves the quality of life and quality of care for thousands of elders. A review of the conference program for the Association for Gerontology in Higher Education suggests that the teaching faculty in that area is engaged with the ways in which they can use the humanities to teach students about gerontology, as stories and films lead gerontology students into deeper considerations of challenging subjects."}, {"section_title": "Resistance to Age Studies: From Gerontology", "text": "Arts intervention programs have gained traction in the popular imagination and in gerontologists' research and treatment repertoires. Nonetheless, in the field of gerontology in general, there remains a devaluation of humanities-based enquiry, of age studies as a rigorous critical framework for scholarly research, and of interdisciplinarity including fields beyond the biological, health, and social sciences. For example, articles in the 2013 Public Policy and Aging Report (PPAR), on \"The Longevity Dividend: Geroscience Meets Geropolitics,\" mention humanity, but not the humanities or the arts. In The Gerontologist's 2014 special issue on \"Remembering Our Roots,\" every article discusses interdisciplinarity or multidisciplinarity, but only three mention the humanities, and then only in passing (Achenbaum, 2014, p. 8; Ferraro, 2014, p. 129; and Kivnick & Wells, 2014, p. 49) . Each of those publications is widely read and endeavors to provide an overview of past and future ideas in gerontology. Their goals are similar: to \"maximize human potential in later life\" (Pruchno, 2014, p. 3) by improving longevity and the treatment and environment of people as they age. According to Robert B. Hudson (2013, p. 2) , the editor of the PPAR, the challenge is to persuade skeptical researchers, funders, and members of the public to accept that \"attacking aging is a viable and more efficient approach to reducing the risk of all fatal and disabling diseases and improving well-being across the life cycle.\" The absence of the humanities from these texts disregards the many ways in which aspects of the humanities, such as music, theatre, literature, and the visual arts, improve the quality of life for millions of people and serve as effective interventions and teaching tools. Such a lacuna is particularly regrettable given that the humanities have the potential to improve gerontological literacy for the vast majority of undergraduate students and to increase the average life span by 10%. Those claims might appear to be more suited for the National Enquirer than for The Gerontologist, but the Enquirer rarely has such persuasive supporting data.\nThe GSA's expanding outreach efforts encourage participation from scholars working in disciplines not traditionally associated with the organization. However, as age studies scholar Roberta Maierhofer discussed in her 2013 GSA presentation, the GSA's description of the conference does not yet reflect that spirit of inclusion:\nGSA's Annual Scientific Meeting brings together more than 4,000 of the brightest minds in the field of aging.\n[…]The meeting theme, \"Optimal Aging Through Research,\" embodies GSA's interdisciplinary core values. While attendees have differing perspectives based on their areas of research -be they in basic sciences, clinical sciences, behavioral sciences, or social sciences -these perspectives provide complementary insights on how aging can be optimized.\nThe conference program foregrounds the organization's \"interdisciplinary core values,\" but its call for insight from \"the brightest minds in the field of aging\" excludes GSA members whose insights stem from the humanities.\nIncluding the humanities in the intellectual cache of gerontology can advance research at the federal as well as the organizational level. For example, consider the Interagency Task Force on the Arts and Human Development. In 2011, the federal government convened this group \"to encourage more and better research on how the arts can help people reach their full potential at all stages of life\" (National Endowment for the Arts, 2011), but the otherwise stellar list of Task Force members-people from the National Endowment for the Humanities, the National Endowment for the Arts, and six branches of the National Institute of Health, including the National Institute on Aging-does not include any humanities-based age studies experts. The Senate Special Committee on Aging held a roundtable on \"Tackling Diseases of Aging: Why Research Collaboration Matters\" with a similar dearth of input from critical gerontology and the humanities. Consider how much more of an impact these groups could have with that additional input and with expanded dissemination opportunities."}, {"section_title": "Collaboration", "text": "The fertile ground where gerontology and age studies overlap is ripe with the potential for scholarship and impact, but in order to yield dividends, this area requires an investment. The GSA has begun to make such an investment, with almost immediate results. In the last six years, humanities-based age studies scholars have formed two separate but interconnected international professional academic organizations: the European Network in Aging Studies (ENAS) and the North American Network in Aging Studies (NANAS). In response to GSA's inclusive welcome, both groups have sent representatives to GSA's conferences, and GSA members have guaranteed panels at ENAS and NANAS conferences.\nNANAS and ENAS give gerontologists the ability to connect with humanities scholars who already are convinced of the benefit of such cross-disciplinary partnerships. In a collaborative relationship, gerontologists and age studies scholars can recruit additional participants by copresenting at humanities conferences and public health conferences, coauthoring articles for humanities, gerontological, and public health journals, and codesigning research experiments. Such collaborations can help inform research and research funding.\nFor example, quantitative gerontological researchers can improve the impact of the humanities on the longevity dividend. Ragan and Bowen's research data show that the videoplus-discussion has an intellectual impact, but how much of a health impact is there? What parts of the video and discussion could be restructured to have even greater effect? Does a video-plus-discussion improve the recovery process for older people who have had a negative health event, such as a myocardial infarction? Do people who come to a new understanding about aging and old age enter elderhood with a gerontological-literacy deficit, much like preschool children whose parents have lower levels of education and income begin school with a word deficit? How could the effects of a video and discussion be reinforced by \"teaching the teachers\" in disciplines as diverse as history, business, design, and information technology? These studies and many others need to be developed. The timeframe will be extensive. Even more far reaching, however, are the potential benefits of including the humanities when considering the longevity dividend and other gerontological research questions.\nInterdisciplinary collaboration to further realize the potential of the humanities is essential for the benefit of our own aging bodies as well as those of our family members, students, patients, and research subjects. Similarly, scholars in humanities disciplines need to understand the benefits of recognizing the full life course, with diverse understandings of what it means to age and to be old. Putting our collective heads together, for all of the disciplines we encompass, we can improve research, critical theories, pedagogy, health, and understanding-truly an optimal outcome."}]