[{"section_title": "Introduction", "text": "As most immigrants are not native speakers of the dominant language of their host society, there is an established body of research on the economic adaptation of immigrants which focuses on language issues. Starting from the early 1980s, scholars have studied intensively the impact of host-country language skills on economic success (for the USA: McManus, Gould, and Welch 1983;Kossoudji 1988;Chiswick 1991;Chiswick and Miller 2002;for Germany: Dustmann 1994;Dustmann and Van Soest 2002; for Belgium: H'madoun and Nonneman 2012; for Canada: Chiswick and Miller 2003; for the UK: Leslie and Lindley 2001;Dustmann and Fabbri 2003; for international comparisons: Chiswick and Miller 1995). These studies univocally conclude that immigrants who are more proficient in the dominant language of the host country earn higher wages (for a review of these studies, see Grin 2003). However, this literature is dominated by a deficit perspective, as the emphasis is placed on what immigrants may not have (i.e. host-country language skills). What is generally missing in this literature is a strengths perspective, that is, an investigation of the effects of what immigrants might have (i.e. being proficient in an immigrant language). Therefore, in this study, we will focus on the effects of bilingualism on the economic adaptation of immigrants. The lack of research on the effects of bilingualism on earnings is surprising because for half a century sociologists and sociolinguists have shown the benefits of bilingualism with respect to various cognitive, educational and socio-emotional outcomes (Peal and Lambert 1962;Rumbaut and Cornelius 1995;Bankston and Zhou 1995;Portes and Hao 2002;Bialystok 2007;Farrell 2010). These studies on student bilingualism are mostly limited to short-term outcomes. However, as we will theorise and examine in this article, linguistic repertoires of students might equally play a role over the long term. Research on the relation between economy and bilingualism is virtually non-existent because labour market outcomes such as income differences are mostly studied by economists who typically use standardised 'human capital theory' models in which skills in a minority language are rarely considered as a form of human capital, i.e. a source of economic advantage (but: Chiswick 2009). In various countries with high numbers of immigrants, fluency in another language is generally treated as a problem, rather than as an asset (see Palmer 2007;Agirdag 2009Agirdag , 2010Rios-Aguilar and Gándara 2012;Agirdag, Van Avermaet, and Van Houtte 2013). The main objective of this paper is to fill this research lacuna. Adopting an interdisciplinary approach, we will bring sociological/sociolinguistic perspectives regarding the benefits of student bilingualism to an economic analysis of immigrants' integration in the labour market. More specifically, we will examine whether student bilingualism is in the long term related to early career earnings. It should be noted that most of the economics studies cited above limit their analyses strictly to the foreign-born population; however, regarding the impact of immigrant languages, the assessment of the children of immigrants might be even more relevant because language assimilation plays an important role in their lives (see Portes and Rumbaut 2001). Therefore, we will not limit our analysis to foreign-born individuals, but will use data on young adults with immigrant roots who have lived in the USA since at least middle-school age and who have grown up with a language other than English."}, {"section_title": "Literature and theory Immigrants in the economy", "text": "Regarding the literature on the economic situation of the immigrants in the USA, we may distinguish between an 'optimistic' perspective, which focuses on the successful adaptation of immigrants, and a 'pessimistic' perspective, which emphasises their failures (for reviews, see Alba and Nee 1997;Portes and Rumbaut 2001). Works by Barry Chiswick (1977, 1978 are widely cited as pioneering studies which yielded very optimistic results. Chiswick (1978) showed that after 10Á15 years, immigrants achieved the same levels Á and eventually exceeded Á the earnings of the native-born. He attributed this quick and successful adaptation process to the positive selfselection of immigrant workers in terms of motivation and abilities (Chiswick 1977(Chiswick , 1978. A second 'optimistic' research tradition points to the success stories of immigrant workers in ethnic sub-economies (enclaves) and the achievements of those engaged in self-employment (Light 1984;Waldinger 1986;Portes and Jensen 1989;Portes and Zhou 1996). These researchers found that ethnic sub-economies provide stable working conditions and higher earnings for immigrant workers and that self-employment plays an important positive role regarding the economic adaptation of immigrant families. The optimistic perspective is challenged by a more pessimistic one. For instance Á contradicting Chiswick's findings Á Borjas (1985) argued that the earnings of more recent cohorts of immigrants did not gain parity with those of the native-born, which he attributed to the decline in 'immigrant quality' because of the third-world origin of immigrants (Borjas 1985). Other studies have also questioned the advantageous effects of ethnic sub-economies. This view holds that immigrants are instead 'trapped' in an ethnic enclave economy where earnings are lower than the broader competitive sector (Mar 1991;Nee, Sanders, and Sernau 1994) and that there is no evidence that immigrant entrepreneurs are particularly successful (Borjas 1990). Apart from the optimistic or the pessimistic perspectives, a constant finding is that there is an enormous diversity among immigrant groups with respect to their adaptation to the US economy (see Portes and Rumbaut 2001)."}, {"section_title": "Language as a determinant of earnings", "text": "The significance of language for the economic adaptation of immigrants derives from the fact that language is assumed to be more easily alterable than other aspects of human capital such as educational attainment. According to Grin (2003), there are four types of empirical studies that examine the relationship between language and earnings. The first focuses on labour market discrimination against language groups. These studies investigate whether membership in a language group results in earning differences. Because of the strong intersections between ethnic and language groups, there are few studies that focus explicitly on the latter. However, studies that do so have found differences among language groups even after controlling for their skills in the dominant language of the host country (see Grin and Sfreddo 1998). A second group of studies has focused on the value of skills in the dominant language of a country, for instance, the impact of English fluency on earnings of immigrants in the USA. This type of research has emerged from various parts of the world (for the USA: McManus, Gould, and Welch 1983;Kossoudji 1988;Chiswick 1991;Chiswick and Miller 2002;for Germany: Dustmann 1994;Dustmann and Van Soest 2002;for Canada: Chiswick and Miller 2003; for the UK: Leslie and Lindley 2001;Dustmann and Fabbri 2003; for an international comparison: Chiswick and Miller 1995). Unsurprisingly, these studies conclude that proficiency in the dominant host-country language is related to higher wages. Grin (2003) argues that a third type of study has investigated the value of skills in a non-dominant language in a region. Typical examples are native French-speaking Canadians who have learned English or native French-speaking Belgians who have learned Dutch. Although there are variations across regions and gender, this type of research generally points to wage benefits for bilinguals (see Vaillancourt 1996;Grin 1999). Fourth, there is a category of investigations that focuses on the value of skills in an immigrant language. However, Grin (2003) states that these 'exceedingly rare' studies have found that the economic value of being proficient in an immigrant language is very low. Nevertheless, he argues that immigrant language skills might be an asset instead of a hindrance, 'contrary to what seems assumed a priori by much of the research in group B [the second research type]' (Grin 2003, 20). We are aware of only one study of this type of research conducted in the USA: Fry and Lowell (2003) have found that being bilingual has a positive impact on the earnings of foreign-born men, with this positive impact mostly explained by the educational background of these immigrants. It should be noted that the effects on women are not examined in this study. In a more recent publication, Grin, Sfreddo, and Vaillancourt (2010) argued that multilingualism has positive consequences on micro, meso and macro levels. More specifically, Grin, Sfreddo, and Vaillancourt (2010) have found that in Switzerland, multilingualism is not only positively related to individuals' salary (micro-level) and to productivity of firms (meso-level) but also to the gross domestic production (GDP) on macro-level: the authors state that Switzerland's GDP is augmented 10% by multilingualism. While Grin's typology is very useful, it is still possible to distinguish a fifth type of research, where scholars might investigate the long-term effects of bilingualism and/ or language assimilation on incomes for children of immigration. While this type of research might be considered a specific form of the fourth type described above, it is distinct as the focus shifts from immigrants and immigration policy towards linguistic diversity and educational policy. The core question here is whether students' bilingualism should be valued in the educational system for the sake of economic benefits for individuals and the society. Indeed, previous studies on immigrant students have found that there are several metaphorical costs associated with linguistic assimilation such as a more problematic family and personality adjustment (e.g. Portes and Hao 2002) and decreasing educational success (e.g. Feliciano 2001). However, these outcomes are only for the short term, while language assimilation might also have literal costs for the long term. That is, student bilingualism might also have an impact on future earnings. Needless to say, the main goal of this study is to provide the first example of this type of research."}, {"section_title": "The value of linguistic skills: a Bourdieusian framework", "text": "Why do we expect skills in a minority language to be positively associated with the earnings of immigrants and their children? To answer this question, we will draw on the writings of Pierre Bourdieu, briefly sketching his theories about linguistic domination (Bourdieu 1977b), using the concepts of field, doxa, heterodoxy and orthodoxy (Bourdieu 1977a) and applying his notions of capital (Bourdieu 1986). In 'The economics of linguistic exchanges', Bourdieu (1977b) states that the value of being competent in a certain language Á which he calls linguistic capital Á is highly dependent on the social contexts in which these linguistic competences are used. Bourdieu called these social contexts 'linguistic markets' or 'fields': 'Linguistic competence functions as linguistic capital in relationship to a certain market' (Bourdieu 1977b, 651). Any field or market primarily involves power relations between the dominant and the dominated groups, and, therefore, between the dominant and dominated languages. Bourdieu asserts that in a situation of bilingualism, a dominant and dominated language will emerge along social class lines: A language is worth what those who speak it are worth, i.e. the powers and authority in the economic and cultural power relations . . . the dominant language is the language of the dominant class. (Bourdieu 1977b, 652) As the dominant class has control over the educational system, it has the power to impose the rules that are followed within the field of economics, including those regarding the legitimacy and/or the value of a language. Even if the rules imposed on languages overtly favour the dominant group, linguistic dominance will persist as long as the linguistically dominated group does not recognise it as a form of domination. Rather, the dominant and dominated groups are inclined to perceive this linguistic domination as something natural and obvious. Such collectively shared, taken-for-granted beliefs/opinions are called doxa (Bourdieu 1977a). However, Bourdieu argues that each doxa might be challenged by competing actions. The dominated linguistic groups are more likely to behave in a heterodox way, meaning they will resist the doxa. This resistance involves, among other things, to move their (linguistic) competences to sub-fields in which they might function as (linguistic) capital. The dominant group, on the other hand, is more likely to behave in an orthodox manner, meaning they are more likely to re-establish the doxic tradition (Bourdieu 1977a). The application of this theory to the linguistic situation in the USA is straightforward. It is clear that English monolingualism is a dominant ideology that favours the dominant monolingual class (Portes and Rumbaut 2001). As English monolingualism constitutes a quasi-doxa within the field of education, it is also a rule that is tacitly imposed in other fields such as the economy. Because this monolingual doxa is threatened by growing linguistic diversity, an orthodox position is taken by the English-only movement (e.g. ProEnglish or English First). The Bourdieusian framework also makes clear why the English-only movement opposes above all bilingualism in the field of education. On the other hand, the heterodox position is taken by the English Plus movement, which supports the preservation of bilingual education. Moreover, the linguistically dominated groups move to take up positions within sub-fields of the economy (sub-markets) where their minority linguistic skills might function as linguistic capital. Some well-known examples of such sub-fields or sub-markets are ethnic enclaves such as the many Chinatowns or the Cuban enclave in Miami. How then is immigrants' linguistic capital converted to higher earnings? Let us conceptualise earnings as a form of economic capital and consider the theoretical conversion process between the notions of cultural, social and economic capital (see Bourdieu 1986). Bourdieu states that cultural capital exists in three different states. First, it can exist in embodied form, i.e. knowledge and skill that are incorporated by a social actor. Bourdieu (1986) states that linguistic capital is an example of embodied cultural capital. Second, it exists in objectified form, i.e. cultural objects which can be owned, such as books. Third, it can be institutionalised when it is officially recognised, mostly in the form of academic credentials. Finally, Bourdieu (1986) also distinguishes social capital, defined as 'resources which are linked to possession of a durable network' (248). All three forms of cultural and social capital can be converted to economic capital. Minority linguistic capital (as embodied cultural capital) can be converted to higher earnings (economic capital) both directly and indirectly. Direct effects should be understood as bilinguals' ability to carry out duties that monolinguals cannot such as interacting with customers who only speak the minority language. Bilingual persons might, therefore, be qualified for jobs with higher wages. Minority linguistic capital can also have an indirect effect, that is, through conversion to other forms of capital. First, if bilingualism is positively related to educational outcomes (see Feliciano 2001), minority linguistic capital might first be converted to institutionalised cultural capital (academic qualifications), which in turn, results in higher earnings. Second, minority linguistic capital might also give a person access to specific objectified cultural capital such as books or advertisements published in a minority language. To have access to such objects might give a boost to an entrepreneur's business. Third, minority linguistic capital can be converted to social capital, that is, it might give an entrance to a social network in which the minority language prevails, access to which might result in higher earnings. Nevertheless, it might be the case that the value of cultural and social capital that is specific to linguistic minorities is lower than the value of cultural and social capital within the English monolingual market because of linguistic racism. However, net of linguistic racism, bilinguals have access to both the English monolingual market and specific minority language sub-fields. In other words, all else being equal, we expect that the earnings of bilinguals will be higher because they can take positions in specific linguistic minority sub-fields in addition to the regular market."}, {"section_title": "Methodology", "text": ""}, {"section_title": "Sample and design", "text": "Data for this study came from two different data-sets: the National Education Longitudinal Study of 1988/2000 (NELS), which is administered by the National Center for Educational Statistics, and the Children of Immigrants Longitudinal Study of 1991/2003 (CILS) administered under supervision of Alejandro Portes and Rubén Rumbaut (see Portes and Rumbaut 2005). For both data-sets, the selection of participants was based on a two-stage stratified sample with schools as the first-stage unit and a sample of students within each selected school as the second-stage unit. The NELS survey was initiated in 1988 and included over 24,000 eighth-grade students across the USA. The final follow-up with information about the employment status and income of the respondents was conducted in 2000, when most respondents turned 26. In contrast to NELS, the CILS is not a nationally representative study, but it is specifically intended to investigate the adaptation process of the immigrant second generation. The second generation is broadly defined as children with at least one foreign-born parent or children born abroad but brought to the USA at an early age. The original CILS survey was conducted in 1992 with 5000 children attending the eighth and ninth grades in schools in Miami/Ft. Lauderdale and San Diego. In 2002, when most respondents turned 24, a final follow-up was conducted which included information about their employment status and income. For methodological reasons, the data are limited in three ways. First, to exclude a potential interfering effect of discrimination of linguistic minorities, we only selected respondents who initially stated that another language other than English is spoken at home (hereafter, the native language). Second, we only selected respondents who worked full-time during the last follow-up. Third, for the sake of comparability between both data-sets, the NELS data were additionally limited to respondents with immigrant roots, i.e. students with at least one foreign-born parent. As such, the total number of respondents included in the analysis was 1656 for NELS and 1897 for CILS. Two types of analyses are conducted. First, Latent Class Analysis (LCA) is conducted to cluster the respondents in various linguistic groups, i.e. limited bilinguals, balanced bilinguals and English dominant (see section Explanatory Variable). Second, regression analysis is conducted to investigate the net effects of being balanced bilingual versus English dominant. Additionally, using only the CILS data, we will examine whether non-cognitive factors (self-esteem and family cohesion) account for the impact of bilingualism or earnings. The LCA is conducted with MPlus version 5, and the regression analysis is conducted with SPSS version 20. Missing data are handled with the multiple imputation procedure: five imputations are requested, and the pooled results are shown (Allison 2002)."}, {"section_title": "Outcome: annual income", "text": "The main dependent variable in this study is the annual earning of the respondents. These were collected during the last follow-up of both NELS and CILS. For CILS, respondents were asked to state their monthly earnings from all sources. NELS respondents were asked to state how much they earn before taxes and other deductions. They could report their earnings hourly, weekly, bimonthly, monthly or annually. We converted all earnings responses for both NELS and CILS to annual earnings by multiplying by common full-time factors: hourly earnings by 2100, weekly by 52, bi-monthly by 24 and monthly by 12 (see Table 1 for descriptive statistics on NELS and CILS). Most economists prefer to take the natural logarithm of earnings, i.e. loglinear form, for theoretical reasons regarding the statistical distribution of earnings. However, there are theoretical, practical and methodological reasons to avoid this practice and stay with the linear form (for an elaborated discussion, see Portes and Zhou 1996). Practically seen, the linear form yields coefficients that are directly interpretable as dollar gains per unit change in the independent variable, while the loglinear form is harder to interpret (i.e. as average percentage change in earnings). Theoretically, the loglinear form yields the relative impact of the independent variables, whereas the linear form gives us information about absolute earnings. Therefore, the loglinear form can obscure real differences between groups and as such is less preferable when the focus is on actual differences in earnings (see Portes and Zhou 1996). Finally, methodologically, Blackburn (2007) demonstrates that converting wages to the natural logarithm produces more bias than it reduces. He concludes: 'While there is little to gain statistically from log-wage regression analysis, there is much to lose' (Blackburn, 2007, 95). We find these arguments convincing and therefore stay with the absolute (linear) levels of earnings."}, {"section_title": "Explanatory variable: multilingual proficiencies", "text": "In both data-sets, respondents were asked to self-assess their proficiencies in their native language and English in exactly the same way: they were asked about their ability to speak, understand, read and write. There were four response categories for all items: 'very well', 'well', 'not well' and 'not at all'. It should be noted that for CILS, this information was collected during the base-line, whereas for NELS the most recent data on language proficiency was collected in 1990 during the first follow-up. The eight categorical items of language proficiency are entered as indicators of potential clusters (latent classes), that is, distinct linguistic groups. For both datasets, the results of the LCA show that there are three clusters that make empirical sense. 1 The interpretation of these three latent classes was in line with previous studies of bilingualism. More specifically, we were able to distinguish between (1) limited bilinguals, (2) balanced bilinguals and (3) an English-dominant group. For the NELS 17.22% of the sample is categorised as balanced bilinguals; for the CILS 25.62% is categorised as balanced bilinguals (see Table 1 for descriptive statistics). Figure 1 depicts probability scales of these three clusters for the CILS data. It shows that individuals belonging to the cluster of limited bilinguals have lower overall proficiency than the other two groups. Individuals belonging to both the Englishdominant group and balanced bilinguals have a high English proficiency, but balanced bilinguals have additionally high scores on the native language indicators. Balanced bilinguals score especially high in writing and reading skills in native language, while both groups have similar English proficiency. Hence, it should be Note: Number of observations (N), minimum, maximum, mean with standard deviations in parenthesis (for continuous variables) and proportion (for categorical variables). emphasised that the only difference between balanced bilinguals and Englishdominant group is their native language skills."}, {"section_title": "Control variables", "text": "To rule out selection effects, we will control for respondents' gender, educational attainment, cognitive ability, parental socio-economic status (SES), national origin and their regional location (see Table 1 for descriptive statistics for NELS and CILS). In both data-sets, the educational attainment of the respondents is measured by their highest educational degree. To make the analysis more straightforward, we will use this ordinal variable as if it was a metric variable in the analyses. As an indicator of respondents' cognitive ability, we used their scores on a standardised maths achievement test. For the NELS, this test was conducted in the spring of 1988; for the CILS data, the scores on the Stanford maths achievement test were administered by the schools and provided to the researchers in 1991. As a measure of parental SES, we use the composite SES scores calculated by both the NELS and the CILS administrators: the SES composite for NELS is composed of five variables, including family income, parents' education levels and parents' occupations; the SES composite for CILS is computed using father's and mother's education, occupations and family home ownership. We were able to distinguish between seven categories of national origin with frequencies larger than 100: (1) Mexico, (2) Cuba (only in CILS), (3) other Latin America, (4) Philippines (only in CILS), (5) China (only in NELS), (6) Other Asian and (7) Others. Finally, we controlled for the location of the respondents, using a proxy variable taken from information about the location of the schools in the baseline data. For NELS, four census regions were distinguished, and for the CILS, we distinguish between Miami/Ft. Lauderdale in Florida and San Diego in California."}, {"section_title": "Non-cognitive variables", "text": "To assess whether the impact of bilingualism can be explained by non-cognitive characteristics, we will examine the mediating role of self-esteem and family cohesion. Both variables come from the first follow-up of the CILS data. Selfesteem is assessed with 10 items of the Rosenberg's Self-Esteem scale (Rosenberg and Simmons 1972). Family cohesion is measured with three items from the Family Cohesion scale (Portes and Rumbaut 2001). See Table 1 for descriptive statistics."}, {"section_title": "Results", "text": "We begin our analysis with the effect of being balanced bilingual versus English dominant. Table 2 makes clear that, for the NELS data, respondents who were categorised as balanced bilinguals during high school have $3292 more income at the beginning of their career than their English-dominant counterparts (p 00.03). Similarly, the results for the CILS data show that balanced bilinguals earn $2096 more than the English-dominant group (p00.04). Thus, the difference in the effect size in both data-sets might be explained by the fact that NELS asked for income before tax reduction while the CILS asked for net income. Remarkably, there are no significant differences between the earnings of limited bilinguals and the Englishdominant group, while the English proficiency level of the English-dominant group is much higher than those of limited bilinguals. In the second CILS model, we include self-esteem and family cohesion as covariates. While self-esteem is significantly related to earnings, the significant positive impact of balanced bilingualism does not change after including these noncognitive factors. Hence, we cannot argue that the effect of bilingualism is mediated by these non-cognitive factors. While the control variables in the models that are shown in Table 2 are not the primary concern of this study, we note that women earn significantly less than men, and that higher parental SES, higher cognitive ability and higher educational attainment are all related to higher annual earnings. The only category of national effect and no indirect effect: bilinguals earn more than English-dominant respondents, even when educational attainment is taken into account. 2 Having established that balanced bilingualism is generally related to higher earnings, we might wonder whether this holds true for different groups. For this purpose, we calculated interaction terms between balanced bilingualism and gender and between balanced bilingualism and national origin. While, in general, our results point out that the positive impact of balanced bilingualism is even higher for females and Mexican-Americans, these differences were not statistically significant, potentially due to small sample sizes."}, {"section_title": "Conclusion and discussion", "text": "Regarding the economic adaptation of immigrants in the USA, there are few topics that are more studied than the effects of immigrants' linguistic competencies on their earnings. However, this topic is primarily studied from a deficit perspective, that is, the emphasis of economists has almost exclusively been on what language skills immigrants do not have (i.e. proficiency in English). In strong contrast, only rarely have scholars investigated the potential positive effects of what immigrants do have (their native language skills). In spite of the strong societal pursuit of English only, an important component of sociological and/or sociolinguistic research has been the study of the beneficial outcomes of bilingualism and the related study of the metaphorical costs of complete language assimilation. Inspired by this research tradition, in this paper, we argued for a study of the literal costs of complete language assimilation for non-native-language speaking children of immigrants. The results of regression analysis on two completely independently collected data-sets (NELS and CILS) show that there is a substantial cost associated with complete language assimilation. This finding holds true even after controlling for cognitive ability, parental SES and educational attainment. More specifically, when compared with the English-dominant group, we found that balanced bilingual students (who differ from the 'English-dominant' group only regarding their native language proficiency) earn between $2000 and $3200 annually more. While this is the 'all else being equal' effect, the total impact of balanced bilingualism might be higher as the NELS data suggest that there is an additional indirect effect via educational achievement. Additional analyses with the CILS data suggest that non-cognitive factors (self-esteem and family cohesion of students) do not account for the positive impact of balanced bilingualism. Before we discuss the implication of our results, it is important to mention two limitations of this study. First, given the nature of our data, we could only study the earnings of young adults in their mid-twenties. It might therefore be the case that the positive effects of bilingualism only apply to people at the beginning of their careers. A second limitation is that we could not examine whether attending bilingual education programmes has an effect on future earnings or whether bilingual schooling might mediate the positive effects of bilingualism. We suggest that future research should study the impacts of bilingualism for the whole population and examine whether attending bilingual schooling has an effect on labour market outcomes. Our findings have implications for the use of the Bourdieusian theory. More specifically, previous studies mainly used the notions of cultural capital and linguistic capital to denote competencies in dominant cultural forms and in the dominant language (in casu English proficiency). However, our findings clearly indicate that competencies in a minority language might function as cultural capital as well. We might call this multicultural capital, a distinct type of cultural capital that results from the retention of ethnic and linguistic cultural forms. Like cultural capital, multicultural capital has the potential to be converted into economic capital. Given the increasing importance of transnational economies, we expect that the value of multicultural capital will increase in the future. There are several important political implications of our findings. First, student bilingualism is not only important with respect to socio-emotional and educational outcomes (as previous studies have shown, e.g. Feliciano 2001;Portes and Hao 2002), but imposing complete language assimilation is also detrimental for the economy. For instance, decreasing earnings will lower tax revenues and increase demands on social services. This is even more important given the labour market situation of some immigrant groups such as Mexican-Americans. To put it differently, linguistic assimilation policies are not only just harmful, they might hurt those who already have less. As such, the results of this study pose fundamental questions about the long-term consequences of the English only policies imposed in the field of education. Research has already shown that English learners do not benefit from the restriction of bilingual education in terms of educational outcomes (Gándara and Hopkins 2010). This study adds that these learners are put at even more of a disadvantage, given the long-term harm of monolingualism to their earnings. As such, our results provide support for English language programmes that develop native language proficiency, which not only helps students learn English because of transfer but also has tangible labour market benefits."}]