[{"section_title": "Abstract", "text": "Abstract. We tackle biomedical image segmentation in the scenario of only a few labeled brain MR images. This is an important and challenging task in medical applications, where manual annotations are timeconsuming. Classical multi-atlas based anatomical segmentation methods use image registration to warp segments from labeled images onto a new scan. These approaches have traditionally required significant runtime, but recent learning-based registration methods promise substantial runtime improvement. In a different paradigm, supervised learningbased segmentation strategies have gained popularity. These methods have consistently used relatively large sets of labeled training data, and their behavior in the regime of a few labeled images has not been thoroughly evaluated. In this work, we provide two important results for anatomical segmentation in the scenario where few labeled images are available. First, we propose a straightforward implementation of efficient semi-supervised learning-based registration method, which we showcase in a multi-atlas segmentation framework. Second, through a thorough empirical study, we evaluate the performance of a supervised segmentation approach, where the training images are augmented via random deformations. Surprisingly, we find that in both paradigms, accurate segmentation is generally possible even in the context of few labeled images."}, {"section_title": "Introduction", "text": "Biomedical image anatomical segmentation is a fundamental problem in medical image analysis. Recent state-of-the-art methods have focused on deep learning based supervised methods, which typically use large labeled datasets. However, acquiring a large set of paired manual segmentation maps is challenging and time consuming, leading to many datasets with few labeled examples in practice. In this work, we investigate this scenario for brain MRI in common segmentation strategies. We show how different state of the art learning methods can yield impressive results with different properties in this setting, and analyze how the number of labeled atlases affect this result. We also propose a straightforward improvement that builds on these methods.\nMulti-atlas segmentation (MAS) has been widely studied, especially in the context of only a few labeled images, or atlases [3, 23, 28, 37] . To segment a new scan, each atlas is first registered to the desired scan, the atlas label map is then propagated using the resulting deformation maps, and the warped labels from multiple atlases are fused to yield a final segmentation [17, 23, 28, 37] . For the first step, registration methods have traditionally solved an optimization problem for each image pair, and therefore exhibited long runtimes [4, 5, 6, 8, 12, 27, 29] . In contrast, recent learning-based registration approaches learn a function, usually a neural network, to take in two images and rapidly compute the deformation field. While some methods require many example (ground truth) deformations or segmentation maps [21, 38] , others are unsupervised, requiring only a dataset of images [11] . Importantly, learning-based registration methods have fast runtimes, usually requiring only seconds for a registration at test time, even on a CPU [7, 11, 11, 36] . Learning-based registration methods have been further extended to also leverage large labeled datasets at training to yield models that better align segmentation labels [7, 21] . In this paper, we build on this prior work in learning-based registration and propose a semi-supervised registration strategy that improves multi-atlas segmentation in this scenario of few available atlases.\nSupervised learning based segmentation, especially using convolutional neural networks (CNNs), has recently seen tremendous success in segmentation [2, 25, 26, 34, 35] . By seeing many examples, these methods learn the parameters of a CNN that takes an image as input and outputs a segmentation prediction. While these methods provide state-of-the-art results, they have generally been demonstrated in the context of large labeled datasets [2, 25] . Data augmentation strategies, such as random rotation, scaling, and smooth 3D deformations, are often performed to encourage robustness to image variations [2, 22, 32, 35] . We build on these methods and find that with careful data augmentation, good segmentations can be achieved even in our scenario of very few labeled training images.\nThere are several contemporaneous papers that are closely related to this paper. Some of these focus on some small (e.g. one) number of manually segmented images and leverage sophisticated data augmentations techniques or priors to facilitate supervised segmentation methods [9, 39] . Others require no labeled examples of the desired modality, but exploit segmentation maps from other datasets [13, 24] . In this paper, we focus a comparative analysis of how different numbers of labeled data affect MAS and supervised approaches to understand when the use of each method is plausible or desired. Based on the insights we gain from our experiments, we propose a new semi-supervised method."}, {"section_title": "Method", "text": "Our goal is to segment a dataset of medical images, and we focus on brain MRI in our experiments. Let {I i , S i } N i=1 represent a small dataset of labeled atlases, each consisting of the grayscale image I and discrete segmentation map S, such that each voxel of S corresponds to one of L anatomical labels."}, {"section_title": "Background", "text": "Image-Based Registration. Let I, I\n* be an atlas and testing image, respectively. We build on learning-based registration methods that learn a model g θ (I, I * ) = φ, where φ is a registration field and θ are parameters of the function, usually a convolutional neural network (CNN). The goal is for the network to yield deformations φ such that for each voxel p ∈ Ω, I\n* (p) and [I • φ](p) correspond to the same anatomical location, where I • φ represents I warped by φ. To optimize the parameters θ, supervised registration methods employ \"ground truth\" deformations that are either simulated or obtained using an external registration tool. To avoid the requirement of ground truth, we follow recent unsupervised methods [11] . Specifically, we optimize network parameters θ using the loss\nusing stochastic gradient descent where λ is a regularization parameter, I i is a labeled atlas and I * j is an image from a dataset of unlabeled images, {I * j }. I i and I * j are selected randomly. The first term L image penalizes the dissimilarity between the image I * j and the warped atlas I i • φ, and the second encourages a smooth deformation. We use normalized cross correlation (NCC) for L image , which has been shown to be robust to intensity heterogeneity, yielding better registration results than a simple loss such as mean square error [5, 7] ."}, {"section_title": "Semi-Supervised Registration", "text": "To leverage the few existing atlas segmentation maps in a learning-based registration framework, we build upon the setup above and design a semi-supervised registration method. Specifically, during training with stochastic gradient descent, instead of always providing the network with a random atlas and an unlabeled image, we occasionally provide two atlases as input. In these instances, the network can be encouraged to also optimize the accuracy of the segmentation overlap resulting from warping one atlas' label map to the other using the resulting deformation φ, building on recent label-supervised methods [7, 21] .\nSpecifically, we add an additional segmentation term to the loss function:\nwhere γ is a regularization parameter for the supervised loss, and L seg captures the agreement of segmentation maps. Specifically, we employ the Dice score, which has also been employed in recent label-supervised registration methods, in the context of large labeled datasets [7, 21] . The Dice overlap of two atlases is then:\nfor anatomical structure l ∈ L. This strategy leverages unlabeled images using equation (1), and the few labeled images using equation (2), thus exploiting the topological consistency offered by registration-based methods."}, {"section_title": "Spatial Data Augmentation", "text": "To train the network, at each iteration we randomly deform an atlas and its corresponding segmentation map {I, S I } with a smooth random deformation field φ r :{Î = I • φ r ,Ŝ I = S I • φ r } as has been done in segmentation methods [35, 39] . The warped segmentationŜ I is only used in the semi-supervised loss (2). As we demonstrate in our experiments, providing a synthesized atlas and segmentation map improves robustness of the learning based registration model, especially through iterations at which we register atlas to atlas during training."}, {"section_title": "Multi-Atlas Segmentation", "text": "Given a trained network, we warp labeled atlases and N I augmented atlases to each test subject. Specifically, rather than using nearest neighborhood interpolation, we propagate the segmentation probabilities encoded as one-hot matrix.\nThe label for an individual voxel is determined by averaging labels from the N I + N warped segmentations. The label with maximum probability is assigned at each voxel."}, {"section_title": "Implementation", "text": "We implement the registration function g θ (·, ·) as a CNN network with a UNetstyle architecture following recent literature [7, 19, 26] . Figure 2 depicts the network used in registration. The network takes the 2-channel 3D image composed by concatenating the two inputs. We use 3D convolutions with kernel size 3x3x3 and stride of 2, followed by Leaky ReLU activations. We warp each atlas to the subject using a spatial transformation function with linear interpolation. Figure 1 represents the overall pipeline of proposed method."}, {"section_title": "Experiments", "text": "We provide two main experiments with the goal of understanding the performance of models when few labeled atlases are available. First, we analyze the effect of our semi-supervised learning-based registration strategy on the performance of multi-atlas segmentation. Second, we analyze more broadly how MAS strategy compares to supervised learning methods in the setting of few labeled examples. "}, {"section_title": "Setup", "text": "Methods. We explore three variants of MAS with learning-based registration. MAS, MAS-DA, and MAS-SS refer to multi-atlas segmentation, multi-atlas segmentation with our proposed data augmentation (DA), and MAS with semisupervised (SS) learning and DA, respectively.\nWe also analyze supervised segmentation strategies. Recent supervised learningbased segmentation methods use a discriminative CNN model f θ (I) = S that maps images I to their segmentation maps S and is parametrized by θ. We learn such a model using the labeled atlases, minimizing the categorical cross-entropy loss using stochastic gradient descent. Our focus is not to explore architecture variants but to compare this approach with MAS strategies. To preserve model capacity, we use the same UNet-style architecture as in the registration task. We use softmax activation for the final layer to output the segmentation probabilities. For computational efficiency, we divide each image into 120 3D smaller patches of size 64x64x64. We train variants of supervised learning-based segmentation (which we call SegNet) with limited labeled data. SegNet-DA refers to a supervised method with data augmentation, implemented similar to 2.3. Finally, as an upper bound, we train a fully supervised model, SegNet-Full, using the labels of all images (not just atlases) in the training set. We use this model simply to illustrate the optimal performance and enable a measure of the gap in performance compared to the rest of the tested models.\nDataset. We use two datasets. First, we use preprocessed 7829 T1 weighted brain MRI scans from eight public data sets: ADNI [33] , OASIS [30] , ABIDE [14] , ADHD200 [1] , MCIC [18] , PPMI [31] , HABS [10] , and Harvard GSP [20] . All scans are preprocessed using FreeSurfer tools, including affine registration, brain extraction, and segmentation, only used for evaluation [16] . We use 7329 random images from this dataset as unlabeled data for registration, and we emphasizes that these labels are not used during training. We similarly use a second dataset of 38 pairs of brain MRI scans and hand annotated segmentation maps from the Buckner40 dataset [16] . We split this dataset into 18, 10, and 10 images for train, validation, and test sets, respectively. We train MAS models using atlases from Buckner40 training subset as input, and we use the eight public data sets as unlabeled data. For training SegNet, we use atlases and corresponding segmentation maps from the Buckner40 train set. SegNet-Full refers to a SegNet-DA that used all of the labeled data from Buckner40 and eight public dataset as training.\nExperimental Setup. Our goal is to understand the behavior of MAS and supervised learning methods in the context of few labeled examples. We use N = 1..7 labeled scans. Specifically, for each of N = 1...7, N atlases are randomly chosen from the Bucker40 training dataset. We repeat this process n times to construct n different random \"atlas sets\". For each MAS and supervised learning segmentation, n models are trained and used to perform the segmentation on the test dataset. Evaluation of the performance for each paradigm is measured by averaging each evaluation metric (described in text) over n permutations.\nParameters. We set network architecture and parameters based on results in previous literature [7] . Specifically, we set regularization parameters λ to 1.5 and γ to 1.0. During training, we use the supervised atlas-to-atlas registration 10 percent of the time. On a small single scenario, we experimented with 50 percent and 10 percent and found that 10 percent produced optimal results.\nEvaluation Metric. We first evaluate our models with anatomical segmentation overlap using Dice score [15] . We focus on 29 anatomical structures that have significant volume in all images. The predicted segmentations are evaluated relative to manual anatomical segmentations from the Buckner40 dataset. Second, we evaluate surface distance (SD) of all structures. For each pre-defined anatomical region, we compute the distance between the predicted and manual segmentation surfaces in mm. SD is likely to highlight spurious segmentations which are further from correct edges. We average the metrics over structures and test subjects. Figure 3 presents the performance of each strategy on the test dataset. Surprisingly, we find that all methods, when used in their best variant, can achieve reasonable segmentation results that approach the upper bound demonstrated by the fully supervised SegNet model. For example, we find that with just three atlases, the best MAS and SegNet methods can be within four Dice points. Furthermore, our proposed method, MAS-SS, can have a maximum surface distance across all structures of less than 7 mm, and a mean surface distance less than 0.4 mm."}, {"section_title": "Results", "text": "We find that the data augmentation in registration strategy improves the performance of MAS in the few labeled atlases (less than 3) setting in terms of Dice score. Importantly, our proposed model, MAS-SS, consistently improves on the performance of MAS and MAS-DA methods in terms of Dice score in all cases. All of the MAS models show consistently very small mean and max surface distance (not shown). Figure 3 also illustrates segmentation performance of supervised learningbased strategies. Data augmentation significantly improves SegNet segmentation performance in terms of both Dice and surface distance. Interestingly, MAS-SS yields higher Dice score for few atlases (less than 3) and equivalent Dice performance on 3 atlases. Importantly, the proposed method performs significantly better in terms of both mean and maximum surface distance given one to five atlases, highlighting the advantage of combining supervision with a registrationguided method that preserves anatomical topology. SegNet-DA performs slightly better in terms of Dice score with more atlases, but maintains high surface distance. Figure 4 shows segmentation results from top performing strategies."}, {"section_title": "Conclusion", "text": "We focus on segmentation in the regime of few labeled data. Through a detailed comparison, we show the surprising result that even with few labeled images, two separate deep learning based approaches can achieve reasonable results, contrasting conventional wisdom that deep learning approaches require large amounts of data. After investigating various state-of-art segmentation strategies with few labeled data, we also propose a semi-supervised, learning-based multi-atlas segmentation, which improves on existing methods. The proposed method achieves both high Dice improvement, but also low surface distance, highlighting the advantage of a semi-supervised framework within the topologically-constrained registration setting. These findings suggest two important contributions: first, the conclusion that deep learning segmentation strategies do not always require large amounts of labeled training data, and second, the semi-supervised learning method provides a new approach to multi-atlas segmentation."}]