[{"section_title": "LIST OF FIGURES", "text": "But as I was looking over the surface, I saw here and there at a distance a faint glimmer, as if some skater insects which had escaped the frosts might be collected there, or, perchance the surface being so smooth, betrayed where a spring welled up from the bottom. -Henry David Thereau, Walden Gravity waves on the ocean's interior are as common as waves at the sea surfaceperhaps even more so, for no one has ever reported an interior calm."}, {"section_title": "-Walter Munk, Evolution of Physical Oceanography", "text": "Tidal-Band and High-Frequency Internal Variability on the Central Oregon Inner Shelf"}, {"section_title": "Introduction", "text": "Understanding the physical processes that can drive cross-shelf exchange is a fundamental goal of physical oceanography. It is also implicated in many interdisciplinary environmental problems of societal concern including the health of ecosystems, the transport of sediment, and the water quality of coastal and estuarine regions. The processes on the inner continental shelf (10 -50-m water depth) are particularly important because these waters end up on adjacent beaches, rocky intertidal zones, and become available for exchange with estuaries. Yet, a complete characterization of these processes is difficult because of the variety of time and space scales that operate on this last stretch of stratified coastal ocean.\nInternal waves of tidal frequency (internal tides) are an important component of oceanic motions. Generated near regions with variable topography, waves can traverse ocean basins and effect processes far from their source regions (Alford, 2003). Much of this energy is dissipated on continental slopes, but ∼20% of this energy has been estimated to propagate onto continental shelves (Kelly et al., 2013). Near regions of wave generation, such as continental slopes, mid-ocean ridges, and enclosed coastlines there is some evidence of spring-neap forcing and coherence over short timescales with the barotropic tides (e.g. Rayson et al., 2012;Zhao et al., 2010;Scotti et al., 2008). At far away locations this might not be the case. Continental shelves that are open to ocean basins are susceptible to remotely generated as well as local wave sources. The interaction of these two internal wave sources causes difficulty in long-term predictability of internal tidal strength (Nash et al., 2012b,a). The inner shelf (the last few kms from the coastline in 10 -50 m water depths) is perhaps the furthest region from internal tidal generation sources. Yet periods of internal wave activity remain important and have been shown to coincide with the transport and mixing of heat, nutrients, and invertebrate larvae on the inner shelf (Pineda, 1991;Leichter et al., 1996;Lucas et al., 2011). The Oregon inner shelf is no different, with moored measurements of water density and velocity capturing the large magnitude and the temporal variability of this internal tidal-band process (Fig. 2.1). Many previous continental shelf observations of internal waves have concentrated on the mid and outer shelf with some general findings: horizontal currents are clockwise rotating in the northern hemisphere (Rosenfeld, 1990;Lerczak et al., 2003;Noble et al., 2009); energy density and flux is higher in deeper water and concentrated in low-modes (Pringle, 1999;Shearman and Lentz, 2004); wave kinematics cannot be described as purely progressive as some portion of the energy is reflected from the coast (Rosenfeld, 1990;Lerczak et al., 2003); in shallow-water, wave propagation tends to be mostly oriented shore-normal with a few exceptions (Cudaback and McPhee-Shaw, 2009); and overall, there is little correlation between local sea level and baroclinic tides. In addition to its susceptibility to remote sources of internal tidal energy, the central Oregon shelf is an example of how purely local dynamics including influences of varying bathymetry, time-varying stratification, and strong mesoscale currents can all interact to create a complicated wavefield. As wave speeds decrease over the continental shelf and become comparable to the mesoscale field, we expect the interaction between these to create large temporal-variability and different interference patterns of internal wave energy (Nash et al., 2012b). Summer-time circulation on the central Oregon continental shelf is dominated in the low-frequencies by wind-driven processes interacting with a region of along-shelf varying bathymetry. The three-dimensionality of Heceta-Stonewall Bank influences the lowfrequency wind-, and pressure-gradient-driven circulation over the inner shelf (Kirincich and Barth, 2009a). Because of a slope that is subcritical to internal tidal generation, these waves are not generated on the inner shelf. Regions of the shelf which produce onshore internal tidal energy fluxes have been identified in regional models (Kurapov et al., 2003;Osborne et al., 2011). Initial observations showed internal tides emanating as beams from the shelf-break (Torgrimson and Hickey, 1979), however recently the local generation of internal tides appears to occur over the Oregon continental slope (Kelly et al., 2012;Martini et al., 2011). Semidiurnal internal tides are weaker on the continental shelf during the weakly-stratified winter months (Erofeeva et al., 2003), and realistic simulations to isolate locations of barotropic-to-baroclinic semidiurnal energy conversion found that these locations on the Oregon slope showed little inter-seasonal variation (Osborne et al., 2011). The relationship of internal tides to background regional oceanographic conditions such as coastal upwelling has been modeled in a two-dimensional configuration (Kurapov et al., 2010), but has been difficult to observe except for anecdotal evidence due to short duration time series. The classic response, observed over two-dimensional topography was a decrease in stratification and semidiurnal energy in response to coastal upwelling and an increase in semidiurnal kinetic energy in the near-surface (<40-m) following a wind relaxation (Hayes and Halpern, 1976). A similar response was also observed on the Northern California shelf (Rosenfeld, 1990). In this work, moored velocity and density observations at mid-and inner-shelf locations are used to provide insight to internal tidal variability over Heceta-Stonewall Bank, a region of complex, three-dimensional topography. The continental shelf over the bank is susceptible to multiple internal wave sources as well as spatio-temporal variability including tidal spring-neap cycles and background stratification variations due to wind-driven upwelling/downwelling. To characterize and quantify the relationship between internal tides and these background conditions, data from multiple mooring locations over six years are analyzed to fully capture the range of summertime variability over the continental shelf. First the different moored datasets are described and processing to extract timevarying semidiurnal components from the data is presented (2.2). The primary results of the paper are then examined in three separate sections. First, multiple mooring datasets from 2011, a year with expanded mooring coverage are presented (2.4). Here, semidiurnal barotropic and baroclinic variability is quantified and differences between moorings identified. Next, the temporal variability in observed wave parameters is described and compared to a simple model which consists of the linear superposition of multiple waves (2.5.1). Then, a period of increased baroclinic velocities at all mooring locations is compared with a 1-km Regional Ocean Modeling System (ROMS) simulation, showing that the interpretation of onshore propagating internal tides is reasonable for a portion of the mooring locations (2.5.2). Finally, internal tidal events are identified from moored datasets that span multiple years and their occurrences are compared to background oceanographic conditions (2.6). We follow these results with a discussion and end with a summary and conclusions from this work.\nThe inner shelf occupies water depths between 10 -50 m and is the transition between the typically unstratified surf zone and the deeper, stratified regions characteristic of the continental shelf. Intermittent, nonlinear, high-frequency internal waves and bores are frequently observed at these depths at many different coastal locations (e.g., Pineda, 1999;Leichter et al., 1996;Scotti and Pineda, 2004;Walter et al., 2012). The high level of interest in these features and their impact on the circulation in this region is due to the potential contribution of these waves to the mixing and transport of pollutants and nutrients (e.g., Wong et al., 2012), plankton (e.g., Leichter et al., 1996) and invertebrate larvae (e.g., Pineda, 1999). As internal waves propagate into shallow water, observational, laboratory and modeling studies all show that nonlinear effects become important as the waves steepen and potentially disperse during the shoaling and breaking process (e.g., Helfrich, 1992;Venayagamoorthy and Fringer, 2007). Thus in this paper, the definition of an internal wave is quite broad and encompasses many forms of stratified shallow-water internal activity including nonlinear soliton-type features as well as internal bore-like features. The combination of these forms is sometimes referred to in the literature as solibores (Henyey and Hoering, 1997). On the Oregon shelf, moored, shipboard, and drifter observations of internal waves have concentrated on deeper parts of the continental shelf, providing excellent detail on their physical properties, such as frequency distribution and energy transformation (Stanton and Ostrovsky, 1998;D'Asaro et al., 2007;Moum et al., 2007b). Over the shallow inner shelf, however, not as much information is available. Furthermore, the arrival timing of internal waves to continental shelves with open coastlines is hard to predict due to timevarying background conditions and multiple potential sources of internal wave generation (Nash et al., 2012b), and thus long-term monitoring is needed. Though the inner shelf is relatively close to shore and potentially accessible to smaller research vessels, it is difficult to maintain long-term in situ instrumentation in shallow wa-ter. The shoaling and breaking of incoming surface gravity waves may cause damage and loss of equipment by physically transporting or burying them under sand and sediment. The heave of surface waves can also break moored surface lines leaving bottom-mounted instruments stranded on the ocean floor. A cost-effective alternative to in situ measurement, especially for physical processes with a clear surface expression, is remote sensing. Remote sensing of internal waves has been explored by both satellite and X-band radar. The convergent and divergent surface currents associated with internal waves modulate the intensity of Bragg scattering on the ocean's surface which is visible to radar as alternating bright and dark bands (e.g., Apel et al., 1985;Kropfli et al., 1999). Satellite observations from Synthetic Aperture Radar (SAR) have sampled coastlines around the globe and maps of internal wave signatures from many regions have been made available (Jackson and Apel, 2004). However, the infrequent passes of an earth-orbiting satellite have prohibited the use of SAR as a consistent monitoring method. X-band radar observations have been most useful as a shipboard instrument to complement mooring measurements (Kropfli et al., 1999;Ramos et al., 2009;Shroyer et al., 2011). Unfortunately, most large ocean-class research vessels cannot sail into shallow shelf waters and nonlinear transformations cause internal wave surface signatures to become difficult to distinguish in X-band radar imagery. Our attempts to observe inner-shelf internal waves by shore-based X-band radar during summer of 2010, were unsuccessful. Optical measurements through video or still photo observations of the sea surface offer another remote sensing possibility. The convergent surface flows are visible to cameras as regions of elevated pixel intensity (e.g., Chang et al., 2008). With a smaller measurement footprint than satellite, and based on land or taken from aircraft (Wang and Pawlowicz, 2011), the use of commercial digital cameras is a potential low-cost observational method. The first purpose of this paper is to show that the surface signature of shallow- Wave direction and phase speed from the in situ moorings are determined by treating the four beams of each ADCP as a 4-element wave detection array following previous methods (Scotti et al., 2005;Mirshak and Kelley, 2009). As internal waves depress or elevate scattering layers within the water column, variations in echo intensity are measured by each ADCP transducer (see  The inner summation represents the six possible beam lag pairs at a given depth. The second summation (k), is over five independent bin depths. As speed and direction are calculated for both waves of depression and elevation and the depth of the greatest vertical gradient in echo intensity is not known a-priori, information from multiple depths are used simultaneously in the minimization. Lower in the water column, the distance between beam centers is small, providing less accurate measurements of the travel speed across transducers. The estimates of speed and direction in this work include measurements from ADCP bins centered between 8 -13 meters above the bottom.\nIn the coastal ocean, high-frequency internal waves (HFIWs) are formed by a variety of mechanisms including flow-topography interaction (Apel et al., 1985), river plumes (Nash and Moum, 2005), or motions of a relaxing upwelling front (Dale et al., 2008). While many of these scenarios somehow involve tidal fluctuations, a shoaling internal tide is directly driven by the interaction of periodic barotropic tides with topography. Intermittent, nonlinear, high-frequency internal waves and bores have long been observed over the inner shelf, water depths between 10 -50 m, at many different coastal locations. The high level of interest in these features and their impact on the circulation in these shallow regions is due to the potential contribution of these waves to the mixing and transport of important environmental variables such as pollutants and nutrients (e.g. Boehm et al. (2002)), plankton (e.g. Leichter et al. (1998)) and invertebrate larvae (e.g. Pineda (1999)). As internal waves propagate into shallow water, observational, laboratory and modeling studies all show that nonlinear effects become important as the waves steepen and potentially disperse during the shoaling and breaking process (e.g. Helfrich, 1992;Venayagamoorthy and Fringer, 2007). Because a variety of velocity, topography, and stratification scales influence the generation and evolution of internal tides, there are many possible forms that tidally-formed HFIWs can have when they arrive on the inner shelf (e.g. Helfrich and Grimshaw (2008); Scotti et al. (2008)). This yields a rich field of study that continues to document and quantify this variability towards understanding the final fate of internal tides on continental shelves (Grimshaw et al., 2011). A common tool in analysis of wave propagation and evolution under varying background conditions, influenced by velocity shear, stratification, or topography is the use of weakly nonlinear theory which results in the Korteweg-de Vries equation KdV: Written with the displacement of an isopycnal (ζ) as the dependent variable, C 0 is the linear phase speed and the influence of weak nonlinearity (α) and dispersion (β) are included in the final two terms. Solutions to this equation with or without extensions including higherorder nonlinearity and the earth's rotation provide predictions on the evolution of a variety of internal waves. Particularly relevant to our work is the coefficient of nonlinearity (α) which has important consequences for wave polarity (Holloway et al., 1997), as well as the degree of nonlinearity and the horizontal transports associated with waves. We expand on this further in section 4.2.3 below, but note that the degree of nonlinearity is measured as the ratio of wave amplitude to water column depth (ζ/H) and the process of wave polarity switching (at critical points) will tend to be highly nonlinear (Scotti et al., 2008). On the Oregon shelf, there is a seasonality to α, as depression waves have been observed during spring-time conditions near the Columbia river plume with a shallow surface layer (Stanton and Ostrovsky, 1998). While during winter, the shallow-layer is observed near the bottom of the shelf and shoreward-propagating elevation waves have been observed (Klymak and Moum, 2003). Generally, however, α can have significant cross-shelf variations and the location of the critical point can move with time-varying background conditions (Shroyer et al., 2009). The amount of horizontal transport within a shoaling internal wave has been quantified in a number of ways from the KdV model (Inall et al., 2001), fully nonlinear models (Lamb, 1997), as well as observations (Shroyer, 2010). Recent measurements have also pointed to unresolved questions with regards to the efficiency with which inner-shelf waves mix the water column. While bottom-trapped waves can deliver or generate bottom turbulence in the nearshore (Richards et al., 2013), surface-trapped waves appear more efficient at generating interior mixing (Walter et al., 2012). In this work, observations of waves across the Oregon shelf are presented beginning at a mid-shelf location and onto two inner-shelf moorings directly onshore. We attribute the observed transformation of high-frequency internal waves during this shoaling and run-up process to a combination of shelf slope, time-varying low-frequency background stratification, and internal tidal strength. We first present data sets and processing used to derive general background variables. As high-frequency, first-mode baroclinic waves are easily observed in the vertical velocity field from Acoustic Doppler Current Profilers "}, {"section_title": "The Low-Frequency Inner Shelf", "text": "Situated immediately outside the surfzone, where surface gravity waves break, the inner shelf is the shallow region where shelf circulation adjusts to the presence of a coastal boundary (Lentz, 1994). Observational evidence has shown that the momentum balance on the inner shelf involves frictional forces throughout the water column, buoyancy and the Coriolis force, as well as the effects of shoaling surface gravity waves (e.g., Lentz et al., 1999;Lentz and Fewings, 2012). A well-documented mechanism for cross-shelf transport on the inner shelf is due to sub-tidal wind-driven processes (e.g., Lentz, 2001;Kirincich et al., 2005;Fewings et al., 2008). Here the inner shelf is defined to be the region where turbulent surface and bottom Ekman boundary layers overlap causing a divergence in Ekman transport (e.g., Lentz, 1994). Observations have documented the extent of this divergence from its shutdown in shallow inshore waters to deeper offshore regions where full transport is realized (∼ 50 m water depth) (e.g., Lentz, 2001;Kirincich et al., 2005). Wind-driven process have been shown to be sensitive to the degree of stratification on the inner shelf (e.g., Lentz, 1995;Austin and Lentz, 2002;Kirincich and Barth, 2009b). On the Oregon shelf, sources of stratification can vary seasonally from the Columbia river plume, to coastal upwelling and the effects of the cumulative discharge of small coastal rivers. Aside from the effect on wind-driven processes, stratification and low-frequency background currents also define the medium, or oceanic wave guide, which internal waves are generated and propagate through."}, {"section_title": "Internal Waves in the Coastal Ocean", "text": "Internal waves are most easily visualized as waves that propagate along the density layers of a layered ocean. In a continuously stratified fluid, waves can also propagate vertically and can produce a variety of nonintuitive behavior. In early oceanography, they were often considered noise and were removed from data records as they obscured lowerfrequency processes of interest. Observations of internal waves have been documented across many continental shelf regions of the world. One of the major sources of these waves is the barotropic tide, producing waves of tidal frequency commonly referred to as internal tides. Along the west coast of the United States, the major tidal component is the principal lunar semidiurnal (M 2 -12.42 hour) tide (Munk et al., 1970). The tides propagate like a Kelvin wave with small cross-shelf velocities, resulting in little cross-shelf transport (e.g, Rosenfeld and Beardsley, 1987;Erofeeva et al., 2003). Unlike barotropic tidal currents which are driven by the rise and fall of sea level due to astronomical forces, internal tides are created when tidal currents force a stratified fluid over topography, such as sea mounts or the continental slope (Baines, 1982). This interaction transfers energy to internal motions of tidal frequency that propagate away from local generation sites. Finally, dispersive and rotational effects can influence the evolution of internal tides such that energy arrives as packets of higher-frequency internal motions as opposed to the original motions of tidal frequency (Holloway et al., 1999). The fate of this energy and the location of its dissipation remain open questions and have captured the attention of many a physical oceanographer. Though purely linear internal waves are periodic and theoretically result in no net transport, as internal waves interact with topography and become nonlinear, they have the potential to deliver water parcels, and the materials they contain, to shore (Lamb, 1997). Observations of internal waves have come from many continental shelf regions (e.g., Inall et al., 2001;Lerczak et al., 2003;MacKinnon and Gregg, 2003a;Shroyer et al., 2011). These describe a variety of features including the details of wave energetics, momentum and heat fluxes, internal wave contributions to mixing in the coastal zone, and their effects on acoustic and optical transmission. Observations show internal motions transporting water to the shallow regions of the continental shelf and estuaries (e.g., Pineda, 1999;Leichter et al., 1996;Noble et al., 2009;Nam and Send, 2011;Walter et al., 2012;Richards et al., 2013). These studies have found considerable complexity and variability in the effectiveness of this internal energy to reach the inner shelf. Many observational studies of internal waves have been conducted on the Oregon shelf (e.g., Hayes and Halpern, 1976;Torgrimson and Hickey, 1979). In recent years, the increased capability of instruments has enabled further study with more advanced tools (e.g., Moum et al., 2007a;D'Asaro et al., 2007). These studies have exclusively focused on the deeper parts of the Oregon continental slope/shelf (200 -50 m), and have been concentrated experiments over periods of two -three weeks. Regions of the shelf which produce onshore internal tidal energy fluxes have been identified in regional models (Kurapov et al., 2003;Osborne et al., 2011). While initial observations showed internal tides emanating as beams from the shelf-break (Torgrimson and Hickey, 1979), recently the local generation of internal tides appears to occur over the Oregon continental slope (Kelly et al., 2012;Martini et al., 2011). Semidiurnal internal tides are weaker on the continental shelf during the weakly-stratified winter months (Erofeeva et al., 2003), and realistic simulations to isolate locations of barotropicto-baroclinic semidiurnal energy conversion found that these locations on the Oregon slope showed little inter-seasonal variation (Osborne et al., 2011). The signal of internal tides as they propagate to the inner shelf is the focus of my work."}, {"section_title": "Environmental Importance", "text": "The transport of water across the continental shelf by internal waves has many potential consequences. The nutrient content of upwelled waters is important as the availability of these nutrients fuels seasonal primary production contributing to the healthy fisheries of the Pacific Northwest. Water properties of estuaries can also be dominated by oceanic water (e.g., Hickey et al., 2002). During the low-river flow, dry summer season, the ocean provides the source of nutrients to many small estuaries on the Oregon coast (Brown and Ozretich, 2009). A recent finding from the Oregon shelf waters has been low oxygen levels (e.g., Chan et al., 2008;Adams et al., 2013). These can impact the fishing industry and broader ecosystem consequences are unknown. Understanding the processes that transport this water across the shelf has important management implications. In other regions, propagating nonlinear bores from the internal tide have been connected to shoreward transport of intertidal invertebrate larvae and coral reef organisms (e.g., Shanks and Wright, 1987;Pineda, 1994;Leichter et al., 1996). A study that looked at the cross-shelf distribution of invertebrate larvae in relation to upwelling/downwelling in Oregon found no statistically significant difference between the two wind-driven circulation regimes (Shanks and Shearman, 2009). This result points to a lack of understanding in how larvae move between offshore larval pools and onshore communities, and the importance of considering how internal waves might relate to observed recruitment in Oregon. With an increased understanding of internal waves on the inner shelf, the ability to predict these events can be improved, potentially benefiting other fields of ocean science and society."}, {"section_title": "Internal Waves on the Inner Shelf", "text": "The focus of this thesis is to understand the dynamics of internal waves on the inner shelf, the last stretch of stratified coastal ocean and potentially the termination point for these waves. The appearance and kinematics of the internal surfzone are not nearly as well observed or understood compared to the surface one. The contribution here is to extend prior wave observations and models to the inner shelf by quantifying the role of tidal-band and higher-frequency internal waves on fluid motion and composition on the inner-shelf. We use a variety of long-term moored observations, an optical remote sensing platform and numerical models to investigate how various oceanic background conditions and external forcing induce temporal and spatial variability in internal wave evolution. A main theme throughout this work is to try and uncover the relationship between internal wave variability and relevant background oceanography. The central part of this thesis is partitioned into three components: • Chapter 2 focuses on the variability of the semidiurnal baroclinic tidal-band. In this chapter we take six years worth of observational data, and examine patterns of semidiurnal baroclinic variability at multiple sites, comparing locations both on and off of a large submarine bank. • Chapter 3 provides details about a combined in-situ and remote sensing experiment that documented high-frequency internal waves propagating across the inner shelf. • Chapter 4 examines the arrival timing and transport associated with these highfrequency internal waves. High-frequency components are found at the leading edge of the baroclinic tidal oscillation, an expression of the transformation of these features as they propagate onshore. An idealized model of two internal waves propagating from different directions reproduces some of the observed variability in semidiurnal ellipse parameters. At times, the phasing between moorings along a cross-shelf transect are consistent with onshelf wave propagation, a characteristic also present in the output of a three-dimensional regional circulation model. Regional wind-driven upwelling/downwelling effects stratification at all shelf moorings. At locations to the north of the bank, stronger baroclinic velocities were found during periods of higher background stratification. This correlation was revealed once periods of consistently significant harmonic regression skill were grouped into semidiurnal baroclinic events which occupy about 50% of the total observation record."}, {"section_title": "Data", "text": "Data for this project comes from a variety of observational programs spanning the central Oregon mid and inner shelf (Fig 2.2) an observational presence on the Oregon shelf since 1998 (Kirincich et al., 2005). Mid-shelf measurements are from a mooring on the Newport-hydrographic line, an historic location of oceanographic sampling (Huyer et al., 2007). This location, NH-10 (83-m water depth) is 10 nautical miles from Newport, Oregon (National Data Buoy Center station 46094) with near-continuous sampling since 1999. Two other datasets are used to complement these observations from the 2011 upwelling season. A month-long observational study to detect high-frequency internal waves on the inner shelf (YAQINWAVES) deployed two inner-shelf moorings near Newport (YH-20, 20-m water depth), and a multi-year study of the physical and biological process driving oxygen dynamics on the shelf (MILOCO), which deployed a mid-shelf mooring at the southern on-bank location, SH-70 (Adams et al., 2013). Wind measurements are taken from the south Newport jetty, NOAA weather station NWP03, and local sea-level measurements are from NOAA tide gauge SBE03, located in Newport harbor. Wind measurements from this station have been shown to be representative of wind conditions at these mid-and inner-shelf locations (Kirincich et al., 2005). Hourly measurements of sea level measured at this location are used for barotropic tidal reference at all locations as they differ in phase by only about 2 degrees (<4 minutes) for the M 2 tides compared to the SH and LB inner-shelf locations. To define low-frequency background velocity and stratification, all measurements of density and velocity are hourly averaged and low-pass filtered (loess filter, Schlax and Chelton (1992)) to retain periods > 40-hours (ρ bg , u bg , v bg ). Velocity measurements are rotated into their principal axes as defined by their low-frequency depth-averaged flow for each deployment (Table 2.1). These values all roughly correspond to local isobath orientations. Once rotated, velocity measurements are assumed to be along-shelf in the direction of the major axis and cross-shelf in the direction of the minor axis. Each year, most locations have multiple deployments, but in general these principal axis differ by < 5 o within each location. For internal wave oscillations, isopycnal displacement (ζ) is a more useful measure than density variations. Temperature and salinity measurements are transformed to density and then interpolated to a uniformly spaced grid. NH-10 and YH-20 both have multiple measurements of temperature and salinity on the mooring line; at instrument locations where only temperature measurements were available, a linear temperature-salinity relationship is defined at each time step from the co-located temperature-salinity measurements. At locations with only one salinity measurement, density is derived at a constant salinity value. Density is then transformed to displacement by the relation: where ρ hp is the high-pass filtered density, ρ hp = ρ − ρ bg . One of the assumptions with this formulation is that displacements are due to vertical density gradient advection alone, which would not be true in regions with significant horizontal gradients.\nMid-shelf measurements (83-m water depth) are from a mooring on the Newport Hydrographic (NH) line, a historic location of oceanographic sampling (Huyer et al., 2007). This location is 10 nautical miles offshore of Newport, Oregon with near-continuous sampling since 1999, referred to as NH-10 (National Data Buoy Center station 46094) ( Figure   4.1). On the inner shelf directly onshore of NH-10, two moorings were deployed on the 10and 20-m isobaths, 2 km south of Yaquina Head. This month-long observational study to detect high-frequency internal waves on the inner shelf (YAQINWAVES) combined in situ and remote sensing of inner-shelf internal waves. As part of this study, 11 internal waves had strong surface convergences which allowed optical remote sensing to track these waves as they propagated across the inner shelf at this location . The average behavior of these depression wave-like events, discussed in detail here, showed bathymetric refraction and propagated with speeds near or higher than linear phase speeds. Wind measurements are taken from the Newport NOAA weather station NWP03, and local sea-level measurements are from NOAA tide gauge SBE03, both located within Newport harbor. The YAQINWAVES moorings had a bottom-mounted Acoustic Doppler Current Profiler (ADCP) to record water column velocity (Teledyne RDI Workhorse), connected to a string of thermistors to capture the thermal stratification (RBR TR-1060), and top-bottom (20-m location only) salinity measurements (SBE-37 and SBE-16plus) (Table 4.1). The 10-m (20-m) ADCPs were set to sample in current-profile mode creating ensembles of 10 profiles every 10 s in 0.5-m (1-m) bins. In post-deployment processing, all temperature, salinity and velocity data are averaged into 30-s intervals. Data from these moorings show time-varying internal tidal oscillations in temperature and cross-shelf velocity (Figure 4.2). Additionally, large high-frequency oscillations can also be observed. As we will show, these oscillations take the form of downward-displacing bores that depress the isopycnals with large onshore surface currents as well as upward-displacing bores of elevation with large onshore near-bottom flows. High-pass filtered current (<33 hour period) ellipses display a difference between barotropic and baroclinic modes at all moorings (Figure 4.3). Standard-deviation ellipse of the first-mode currents (barotropic), are mostly aligned with topography. At the midshelf mooring, the second-mode (first baroclinic mode) is almost twice as large as the barotropic mode, and near-circular with a slight onshore orientation. At the two inner-shelf sites, baroclinic currents are more polarized in the cross-shelf direction with comparable amplitudes to the barotropic mode. At the shallowest site, the baroclinic ellipse is oriented almost completely in the onshore direction."}, {"section_title": "Normal-modes", "text": "To isolate baroclinic semidiurnal variability, a modal-harmonic decomposition is performed on velocity and displacement. First, data is projected onto dynamical vertical internal wave modes as defined by solution to the vertical structure function equation for linear, hydrostatic, flat-bottom modes ( n ) at each mooring location: with the boundary conditions Ψ = 0 at z = (0, −D). D is the water column depth and background stratification N 2 is given by the vertical density gradient, 3) The vertical functions, Ψ n (z), describe the structure of both the vertical velocity and displacement for each vertical mode. The polarization relation for internal waves provides a connection between these displacement modal structures and the structure of horizontal velocity in the direction of wave propagation: At locations with many vertical density measurements, low-pass filtered density values, ρ bg (z), at each mooring are used to determine N 2 and to solve for vertical modes at each time step (Fig. 2.3). Meanwhile, most of the 15-m PISCO sites have only four measurements in the vertical. At these locations, analytical functions are used for the vertical modes. A depth-uniform N 2 taken from the top-bottom density gradient yields symmetric structure functions ( cos nz/π). As no vertical density gradients could be estimated at SH-70, analytical modes were used to define the horizontal velocity modes there as well. The difference between the modally-decomposed and original data is quantified by an RMS error which is small (< 0.02 ms −1 ) but can be large near the sea surface and sea floor (Fig."}, {"section_title": "2.4).", "text": "Though polarization relations also express the velocity mode perpendicular to U n , the orientation of internal wave propagation is not known a priori, and thus we use the same vertical structure functions to project the hourly, high-pass filtered velocity profiles, , onto vertical modes: (2.5) Here, the vertical modes are slowly varying in time (t ), as low-pass filtered density is used to solve 2.2. Decomposition into vertical modes is important because though the mode-1 baroclinic mode often dominates and its behavior is used as a template to understand internal wave kinematics such as the phasing between surface and bottom velocities or between currents and mid-water column displacement, these kinematics would be misleading if other modes were also important. Horizontal velocities are projected onto 4 dynamical modes (n = 3), with a zero mode being barotropic (U 0 = 1) and the first three baroclinic modes. As the PISCO inner-shelf sites have only 4 discrete measurements of density in 15m of water, 3 modes are the most that can be resolved for displacement. While unresolved higher modes would alias into lower ones, we assume this effect is small because most of the energy is contained in the lower modes. The largest tidal constituent on the west coast of North America is the principal lunar tide, or M 2 , with 12.42 hour period (Munk et al., 1970). Temporal variability centered around this constituent is isolated for each of the above displacement (ζ n (t)) and velocity modes (û n (t),v n (t)) by partially overlapped short-window harmonic regression: This yields an amplitude and phase for each modal harmonic constituent centered in time on the middle of the demodulation window (t c ). For example, amplitude and phase of the displacement modes are given by with similar expressions for the horizontal velocity components. For each mode, a goodnessof-fit is defined by the fraction of variance within each window that is explained by the semidiurnal fit to the velocity and density fluctuations, where σ 2 (t c ) is the total variance within the demodulation window and σ 2 n M 2 (t c ) is the variance from the semidiurnal harmonic. Depending on window duration, a number of semidiurnal frequencies besides M 2 are contained within the demodulated velocity and density fields. One-, two-, and four-day windows are all attempted, with slightly different characteristics (Section 6.2.1). The four-day demodulated normal-mode semidiurnal fields form the base from which internal wave quantities are derived and analyzed in the remainder of this paper."}, {"section_title": "Baroclinic ellipse parameters and linear internal waves", "text": "The use of rotary current analysis from harmonic constituents follows Foreman (1978). Harmonic currents of period 1/ω, with both horizontal velocity components, trace an elliptical hodograph which is decomposed into two counter-rotating circles. For clarity, without modal subscripts, semidiurnal-baroclinic fits are used in this decomposition: where a +,− and +,− are the radius and angle to the positive x axis for the counter-clockwise (clockwise) rotating circle with period 1/ω. The ellipse properties of major (u maj ) and minor (u min ) axis length, ellipticity, inclination (β) from the x-axis and phase (φ u ) are derived: The sense of rotation of the ellipse can also be found. If the clockwise circle is larger than the counter-clockwise component, a − > a + , ellipticity is negative, and the ellipse rotates clockwise through time (Fig. 2.5). The reverse is true for counter-clockwise ellipse rotation. The horizontal velocity components of a single, freely-propagating, linear internal wave in the northern hemisphere trace a clockwise-rotating ellipse with ellipticity u maj /u min = ω/f , and a 180 o phase difference between the horizontal velocity and vertical displacement modes (Gill, 1982). Because of these well-defined relationships, Levine and Richman (1989) introduce a decomposition into counter-rotating ellipses instead of circles. However, the elliptical properties of a wave-field consisting of multiple waves do not necessarily match these theoretical values (see Results). Specifically, wave combinations create interference patterns that add spatial variability to these wave parameters (Rainville et al., 2010;Zhao et al., 2010;Martini et al., 2011). Thus, we apply the circular decomposition on the ADCP data as well as ROMS output to provide estimates of internal wave properties. The major ellipse axis, u maj , will be interpreted as the current in the direction of wave propagation; u min , the current perpendicular to wave propagation; β, the direction of propagation; and φ u , the phase of the current in the direction of wave propagation relative to the onshore component of the current. With multiple waves propagating over variable continental shelf topography, we expect deviations from the single progressive internal waves and take these kinematic variables as a starting point to compare with observations. The deviations from these above relationships and how they vary from mid to inner shelf and between inner-shelf sites are explored below. 2.4 The 2011 summer upwelling season"}, {"section_title": "Barotropic Tides", "text": "The zero mode in modal-harmonic-decomposition retrieves an estimate of the barotropic semidiurnal tide (Martini et al., 2011;Rayson et al., 2012). A clear springneap cycle in the zeroth mode is observed at all moorings (Fig. 2.7) as is the expected spatial variation in barotropic-tidal amplitudes in the region as predicted by the regional TOPEX/Poseidon Global Inverse Solution tidal model (TPXO) (Erofeeva et al., 2003). Note that only the along-shelf component of the barotropic flow is presented as cross-shelf, zero-mode flows are small once they have been rotated into their principal axes. Though the focus here is on the combined effect a semidiurnal band instead of each individual tidal constituent, the individual contributions also match TPXO, as recently identified in Adams et al. (2013). Mid-and inner-shelf on-bank sites have higher amounts of barotropic semidiurnal energy consistent with intensification of the tides over the submarine bank (Erofeeva et al., 2003). The spring-neap cycle is not as pronounced at the LB-15 mooring. We attribute this to the mooring location to the north of the bank, a region of small barotropic semidiurnal velocity. Lastly, there is some unexplained low-frequency variations in these barotropic fields perhaps related to variations in the coastally-trapped-wave modes that propagate along the shelf."}, {"section_title": "Baroclinic Variability", "text": "Looking across the entire season, there is large temporal variability in baroclinic velocity with little overall correlation between locations (Fig. 2.8). In general, the first baroclinic mode dominates, with larger total baroclinic velocity at mid-shelf (NH-10 and SH-70) compared to inner-shelf locations. The partition between semidiurnal baroclinic velocity modes also varies between moorings. Similar to findings from the New England shelf, these data portray a temporally varying modal-partition of baroclinic semidiurnal velocity (MacKinnon and Gregg, 2003b). Additionally, the modal partition also varies in space between moorings. With the caveat that the YH deployment was of shorter duration compared to the other locations (≈ 1 month), these data suggest that the 1st mode is dominant across the shelf at the northern end of Heceta Bank (YH-20; NH-10), while locations to the north   Next we examine the kinematic internal wave parameters given by the first baroclinic mode fits. The horizontal velocity modal fits create time-dependent elliptical hodographs whose inverse ellipticity (ratio of minor to major axis), sense of rotation, and ellipse orientation are compared to theoretical progressive internal wave values of these parameters. Histograms of these properties over the entire 2011 season show their mean characteristics (Fig. 2.10). At all locations, the dominant sense of rotation of the horizontal currents is clockwise, consistent with northern hemisphere internal waves. A semi-diurnal freelypropagating internal wave at the Heceta Bank latitude has inverse ellipticity, f /ω = 0.73. About 20% of mid-shelf (NH-10 and SH-70) current observations have an inverse ellipticity close to this ratio. These distributions shift towards smaller values at the inner-shelf sites.  (Lerczak et al., 2003), or behaviors indicative of multi-wave combinations (Martini et al., 2011). Though there are difficulties in retrieving internal wave parameters from a single mooring when multiple waves are present (Martini et al., 2011), the next section finds support of our interpretation of these baroclinic motions as shoaling internal tides across the NH-line through analysis of a high-resolution numerical model. Consideration of these fluctuations as a result of other processes follows in the discussion."}, {"section_title": "Variability within a wave event", "text": "We take a closer look at the period of August, 2011 to examine the temporal variations in the first-mode baroclinic variability (Figure 2.11). Both horizontal components of semidiurnal baroclinic velocity are apparent at most moorings (panels A -D), indicating wave-propagation in both along-and cross-shelf directions. During this period, at each mooring, the variability of the first mode displacement correlates well with the horizontal velocities, consistent with a progressive first mode internal wave. While the average velocity decreases in shallower water, the average ratio of displacement to total water column depth increases dramatically between the mid-(∼ 5%) and inner-shelf sites (∼ 40%) indicating the increase in non-linearity of the baroclinic tides as they transit the shelf. The mooring records exhibit differing amounts of temporal variability. The mid-shelf mooring, NH-10 shows consistently high-skill values (E -H) in either velocity (red, blue) or displacement (black) with ellipticity hovering around the internal tide value (green). Phasing between first-mode displacement and velocity are near 180 degrees (I -L), the theoretical value for a freely-propagating internal wave. Another important phase measure is the difference between the phase of maximum internal wave currents and semidiurnal sea level (φ u − φ η ). The degree to which this difference varies over time indicates the degree of coherence between the baroclinic and barotropic tides. While wave parameters, particularly phase difference and inclination, stay fairly constant at LB from 08/05 -08/17, the other locations show more variability. Particularly striking are the extended deviations from the theoretical ellipticity ratio at SH-15, the shorter periods of high-skill events at both SH-70, and SH-15, as well as the apparent inclination veering seen in the records. For example, the a 100 degree veering can be seen in the SH-15 record between 08/01 -08/05. This behavior is also seen at the SH-70 location between 08/10 -08/16. Below, some of these behaviors are explained by an idealized model consisting of the superposition of 2 temporally-varying obliquely incident waves."}, {"section_title": "An idealized model of a combination of two waves", "text": "The use of windowed-harmonic decomposition is a common time-series analysis tool to identify and describe internal wave kinematics from observations. In this section we examine how the wave parameters extracted from windowed-harmonics respond to a wavefield consisting of multiple waves with low-frequency temporal variability. We are most interested in the observations presented above of deviations from simple, single wave behavior such as the time-varying wave ellipticities and the apparent veering in derived wave inclination. A temporally varying first mode internal wave is written similar to an AM radio signal: whereî andĵ are unit vectors in the along-beam and transverse-beam direction, respectively and M (t) is the slowly-varying modulating factor. Two waves of the same carrier frequency, ω, are superposed propagating in different directions. A non-modulated wave (M (t) = 1) propagating from the northwest at 135 o from the positive x-axis (W 1), and a temporally modulated wave (W 2) propagating from -135 o to the x-axis. For the second wave, the modulating factor is: with a modulating frequency ω M = ω/12.5. The resultant wave field (Fig. 2.12, A) oscillates between a pure standing wave in the along-shelf direction -a combination of two equal waves at T = 0, 6.25, 12.5, to being dominated by W 1 (T ≈ 3, 15.5), and finally to a partially standing wave when W 2 > W 1 (T = 10). With a multi-directional, amplitude-modulated wave field, a complicated interference pattern arises, causing significant spatio-temporal dependence to the results of windoweddemodulation. A number of behaviors are similar to observed real-world counterparts such as varying ellipticity, decreases in the skill of harmonic fit, and smooth veering in the identified directionality from one dominant wave to the next. For example, between 08/01 -08/25, the NH-10 mooring has consistently high S k with an approximately constant inverse ellipticity, but slowly varying inclination (Fig. 2.11). This is similar to the quarterwavelength time series in Figure 2.12 (red). A different example is from the SH-15 mooring. The period between 08/05 -08/15 sees skill fluctuations, changes in the inverse ellipticity, as well as veering similar to the time series from the idealized wave at the velocity node in Figure 2.12 (blue). While high-skill values on the Oregon shelf were ≈ 0.3, a high-skill value for the idealized wave field was set at 0.75 to illustrate deviations from a high harmonic fit. In either case, slight decreases in harmonic skill do not necessarily preclude large changes to the other wave properties. For example, the NH-10 period pointed to above. Imagining these processes taking form in the real ocean, a potentially overwhelming variety of possibilities exist. However, the geometry of Heceta Bank provides some useful constraints, such as the potential for different, non-shore-normal internal wave propagation directions. Besides the observational evidence for a multi-directional wave field over Heceta Bank, some of this variability is also present within solutions to a high-resolution numerical model."}, {"section_title": "A comparison to ROMS", "text": "Internal wave parameters and energetics are compared to output from a ROMS 1-km hydrostatic model with 40-sigma levels and M 2 tidal forcing. The model has been validated to data with harmonic analysis over long temporal windows (16-days) and has reproduced internal tide dynamics at mid-and outer-shelf moorings (Osborne et al., 2011). In this work, the focus is on whether the observed inner-shelf transformations, specifically the phasing between moorings, as well as along-shelf differences due to the three-dimensionality of Heceta Bank, are also reproduced in this model. As field measurements are spatially sparse compared to the numerical model, if these observed dynamics are adequately reproduced, then modeled fields can greatly assist the interpretation of measurements and provide guidance in directing future observational efforts. The internal tide within this model is driven purely by local dynamics and will not reproduce any of the features of shoaling remotely-generated internal tidal energy (Nash et al., 2012a). For comparison purposes, 4-days of the year-long model run have been taken to be typical of internal tide propagation within the model. The modeled time period is from August, with fully-developed upwelling and a strong equatorward coastal jet to the north of Heceta Bank that has separated from the coast (Castelao and Barth, 2005). Semidiurnal baroclinic ellipse parameters, energy, and energy flux are computed from the modeled fields to visualize locations of the offshore energy sources, propagation onto the Bank and towards shore, and to facilitate comparison with the data. A rough estimate for the theoretical wave-length of a semi-diurnal, mode-1 wave is about 10 km (c ph = λ/T = N H/π, with average values of N = .0002 s −1 and H = 50 m), comparable to the cross-shelf distance between moorings and width of the shelf (Fig 2.13. The contour map of internal tidal phase difference, computed at each grid point from the mode-1 displacement and referenced to the NH-10 location, shows the difficulty in using an individual wave to describe the measured baroclinic variability. A comparison of these modeled phase differences to data from the same locations for the August, 2011 period show similar phase propagation between the NH-10 and YH-20 mooring, but not between NH-10 and either the southern or northern sites. We interpret this that the model reproduces the dynamics of wave propagation between NH-10 and YH-20. The discrepancy with the other locations is due to either the other mooring locations not displaying especially strong mode-1 energy at this time (this period is not a good example of waves at these other locations), or because the wave field in the model is over-simplified and that the real-world fields are not as well behaved as the nice along-shelf coherence seen in the phase-difference contours (Fig. 2.13). Modeled energy flux vectors from water depths less than 200-m are all directed onshore and show two continental-slope sources of internal tidal energy, to the north-and south-of Heceta Bank that impinge on the shelf from these directions (Osborne et al., 2011). Previously, moored baroclinic ellipse orientation at the northern sites  suggested wave propagation from the northwest (Figure 2.10), consistent with the modeled results shown here and with previous modeling studies in this location (Kurapov et al., 2003). The southern, SH, mooring ellipses suggested incoming wave propagation from the southwest, also comparable to the ROMS model output here (Osborne et al., 2011). In addition to ellipse orientation, all modeled baroclinic velocities rotated clockwise with inverse ellipticity, u min /u maj , decreasing towards shore at all mooring lines (not shown). The observed and modeled north and south sources impinging on the Bank motivate the incoming wave directions from the idealized model (Section 2.5.1). The simple model shows that the combination of two waves with low-frequency variability can create a complicated, spatially-dependent pattern at the on-bank locations."}, {"section_title": "Multi-year comparison", "text": "The on-and off-bank inner-shelf moorings and the mid-shelf NH-10 mooring are rich sources of historical data with continuous deployments through most of the Oregon upwelling season. Here, we compare six summers of data to summarize the character of the internal wave field at these three locations and look for patterns of co-occurrence between high-energy internal tides and other background oceanographic states. To do this, we make use of internal tide events as described below."}, {"section_title": "Defining an event", "text": "To identify strong internal tides, data from the three historical mooring locations are vertically-decomposed and the 4-day harmonic analysis is applied as above. These records are then subsampled to include only demodulated windows where the semidiurnal fit represents a statistically significant portion of the variance contained in the first vertical mode. Following Chelton (1983, eq. 18), the (1 -α) critical value for the hindcast skill of a regression can be estimated by a null hypothesis test (Sk = 0). For a large number of independent samples (N or N * ), the test is: Where A is the average of many hindcasts conducted at long lags where the true skill is assumed to vanish and there are two degrees of freedom in the single-frequency regression model, (M = 2), and χ M (α) is the 100α percentage point of the χ 2 distribution with M degrees of freedom. If a value of Sk exceeds the critical value given here in equation 11, then the regression is statistically significant with 100(1-α) percent confidence. The effective number of independent observations, N * ≈ 20, and critical regression skills for each demodulation window (Sk crit ) are given in Table 4. As seen here, the number of independent observations is much smaller than the total number of hourly measurements in each window because of auto-correlation within the time series. Time series from each location also have slightly different statistics, and different Sk crit depending on the amount of auto-correlation at each location. This also illustrates the difficulty in using windows much shorter than 4 days for an M 2 harmonic demodulation. With shorter window lengths, a higher amount of regression skill is required to significantly differentiate the regression from noise. half as long at inner-shelf locations, the total amount of time covered by these events is given in Table 2.5. Over all summers, on average, internal tidal events occupy more of the mid-shelf time series compared to either inner-shelf site."}, {"section_title": "Consecutive", "text": "Comparing the average wave parameters at each location (Fig. 2.15), though the ellipticity of the NH-10 wave events are consistently near the theoretical free-wave value, they appear to arrive from a variety of directions, with large variation within each event. We interpret this as a manifestation of the combination of multiple waves as presented in section 2.5.1. Turning to the inner shelf, on average the LB-15 site also has ellipticity close to the theoretical value with most waves arriving from the northwest. Looking at the phase differences between currents and semidiurnal sea level for all events, it appears that this site has no preferred phasing with sea level, indicative of the incoherence between the northwesterly internal tide and the surface tide. Interestingly, events at the SH-15 location show consistent phase differences between internal currents and sea level (∼ 150 o ) suggesting internal tides at this location have a preferred arrival time compared to local sea level and perhaps the southwesterly internal tide has some coherence with the surface tide."}, {"section_title": "Events compared to background", "text": "To quantify the relationship between internal tides and the spring neap cycle, we correlate individual time series of baroclinic velocity with the lunar fortnightly cycle (Table   2.5). Each location and year has varying record lengths, and the number of degrees of freedom for the spring-neap correlation are estimated as the total number of observed spring-neap cycles. Correlations between semidiurnal baroclinic velocity fluctuations and the spring-neap cycle were not significant at all mooring locations. The August, 2011 event occurred during a prolonged upwelling event. Is this a repeatable observation? Here we take data from six upwelling seasons (2006 -2011), identify internal tide events and compare them to wind-driven currents, background stratification, and upwelling/downwelling. The strength of coastal upwelling is often quantified by the relation to along-shelf wind stress. An alternate characterization is through an exponentially-weighted accumulation of along-shelf wind stress, a measure that correlates with the position of the main upwelling front (Austin and Barth, 2002), Wind stress is calculated following (Large and Pond, 1981) and we find this weighted function to be correlated with background stratification at all mooring locations. The relationship between W 5d and shelf stratification distributions is shown in Figure 2.16. The notable features are that average W 5d is negative, consistent with the predominant upwelling-favorable winds. Mid-shelf stratification is higher on average during the summer and that the inner shelf is never fully unstratified even during periods of extended upwelling. The strongest stratification values occur during wind relaxations (W 5d ≈ 0 m 2 s −1 ) and during weak upwelling or weak downwelling. The lowest inner-shelf stratification values are seen during strong wind-reversals (W 5d > 2 m 2 s −1 ), a feature that is not prominent at the mid-shelf mooring (Barth et al., 2005). Now considering the occurrence of internal tide events in relation to these background variables ( Figure 2.17), events with higher baroclinic velocities, coincide with periods of stronger average stratification. Here, all values of R 2 are significant at the 95% confidence level for the number of individual events at each location. These stronger stratification periods should also correlate with weak upwelling, wind relaxations, or short wind reversals (W 5d < 1 m 2 s −1 ). Note, we focus on baroclinic velocity and do not show the relationship between baroclinic displacement, because the displacement itself is calculated as function of stratification. Instead of standard linear least squares regression, which minimizes errors only in the dependent variable (y), we use a nonlinear regression to fit the data points as both variables are derived from data with some uncertainty. The technique follows Fewings and Lentz (2010), and calculates a best-fit line with the standard deviations during the wave event as a measure of uncertainty. Significant relationships are found between the average first-mode baroclinic velocity and local background stratification and weighted wind at both the northern mid-and inner-shelf sites. At the southern site, SH-15, while the correlation to the wind-driven background is significant, the magnitude of the baroclinic currents are not as strong."}, {"section_title": "Discussion", "text": "There is substantial year-to-year variability in the fraction of time occupied by wave events (Table 2.6), a potential indication of differing amounts of incoming remotelygenerated semidiurnal internal wave energy (Nash et al., 2012b). The manifestation of remotely-generated internal tides over the Oregon shelf will need future considerationa ripe question for numerical modeling. The Oregon ROMS models with local dynamics appear to simulate the upper slope wave sources and their shoreward propagation well, but not the extent of coherence between sites along the bank or the timing of low-frequency variability (Osborne et al., 2011). The addition of a remote wave field may improve our understanding of baroclinic tides on the Oregon shelf. Other authors have separated internal tidal energy density and flux into signals that are coherent and incoherent with the local barotropic tides (Colosi and Munk, 2006;Zhao et al., 2010;Nash et al., 2012b). This is sensible near regions of topographic energy conversion, where the internal tide is being generated and where changes in near-bottom stratification are not pronounced. On the shelf, far from generation regions, we initially assumed that there was little reason to do this decomposition. However, as seen in the events here, there are periods -up to 40 days -where there might be significant semidiurnal coherence between internal and surface tides. Overall, temporal variability in the baroclinic fields was challenging to explain. Except in some locations, it does not seem related to barotropic tides, with no spring-neap cycle and no consistent phasing to sea level fluctuations. Though semidiurnal baroclinic velocity fluctuations were higher during periods of high stratification, the overall correla-tion was low, suggesting a complicated relationship to upwelling/downwelling. In a region of relatively simple topography, Hayes and Halpern (1976) suggest that the modification to background stratification during the transition from upwelling to downwelling shifts internal wave characteristics, changing the path of wave energy from the shelf-break onto the shelf and altering the amount of reflection to the deep ocean. This type of regional control resembles similar mechanisms in other locations where a shoaled thermocline modifies the access of waves to the shelf (Petruncio et al., 1998;Noble et al., 2009). Unlike locations with little summertime freshwater input, such as southern California, early in the summer season the Columbia plume remnants alter near-surface stratification, but is potentially inconsequential for internal waves propagating on a deeper pycnocline. This might contribute to the lack of general intra-seasonal patterns in internal tidal energy over the inner shelf. Monthly averages from the six years analyzed show shelf stratification to be at its highest around June, while internal tidal energy does not exhibit a peak. There are no internal waves on the unstratified portion of the continental shelf during winter. The existence of even small amounts of stratification throughout the summer, even when the inner shelf is onshore of an upwelling front, is apparently enough to support internal wave propagation throughout the shelf. Low-frequency currents can effect the propagation of internal waves in a variety of ways, such as to increase the allowable frequency band of internal waves (Mooers, 1975) or to provide a source of energy to the semidiurnal band (Davis et al., 2008). In Southern California, internal tides were found to be coherent across the entire shelf only during periods of sustained equatorward flow, whose geostrophically-balanced density field created a favorable waveguide (Noble et al., 2009). Aside from the modification to stratification, regional-scale upwelling/downwelling on the Oregon shelf creates strong along-shelf jets. The relationship between semidiurnal baroclinic velocity to background stratification and the lack of a relation to low-frequency along-shelf flow (not shown) suggests that the source of semidiurnal energy is not from the low-frequency current. Instead, the primary effect of upwelling/downwelling over the mid-and inner-shelf of the Heceta Bank region is to increase semidiurnal energy through potential energy, which scales as N , consistent with spectral models of kinetic energy (Levine, 2002). How energy is related and transferred between the low frequency and tidal band is not well-understood. One of the more surprising results is that semidiurnal baroclinic velocities still have ellipticity on the inner shelf. Most theory and observations show that internal waves refract and eventually propagate directly onshore. There are a few possible explanations that could influence the harmonic ellipses; combination of multiple wave sources (discussed here), doppler-shifted upstream lower-frequency variability (Pringle, 1999), and advection of a horizontal-sheared background along-shelf flow by the shoreward-propagating internal tide. Though barotropic tides are strong at some locations on Heceta Bank, contamination into baroclinic currents is not likely because the modal decomposition isolates baroclinic motions. Furthermore, there is little evidence of a spring-neap cycle to the baroclinic tides at these locations. For the advection of background horizontal density and velocity gradients, we consider the respective advection equations for wave-induced density and along-shelf velocity fluctuations: (2.14) Here, we consider the magnitude of density, ρ, and along-shelf velocity, v, fluctuations due to advection of mean gradients oriented in the cross-shelf direction by a cross-shelf semidiurnal baroclinic current, u. Mean cross-shelf gradients are estimated by differencing the low-frequency density and depth-averaged along-shelf flow between the YH-20 and NH-10 moorings, and a typical semidiurnal baroclinic current of 0.1 m s −1 is used. From these equations, approximate magnitudes for the rate-of-change of ρ and v due to this process can be estimated. Given the small magnitude of the observed background alongshelf velocity gradient (see Fig. 2.6), this advection term is small compared to the observed semidiurnal values. Comparing this estimate to one derived from a well-resolved horizontal transect of the along-shelf flow (Castelao and Barth, 2005) also yields small values of v. Instead, inner-shelf moorings would have to be fortuitously located in regions of unresolved high-horizontal shear in order to account for the observed baroclinic along-shelf velocity. Density fluctuations due to horizontal density gradient advection on the other hand, are as strong as the observed density fluctuations on the inner shelf. This might explain some of the extremely large displacement measurements and the need to reconsider the use of equation 2.1 to determine displacement over the inner shelf. These results are consistent with the background consisting of a geostrophically-balanced coastal jet with no horizontal along-shelf velocity shear. Additionally, the 83-m NH-10 mooring is located within the range of isobaths followed by this coastal jet as it deflects around the bank complex in the summer (Barth et al., 2005). In general, inverse ellipticies are smaller on the inner shelf compared to the mid shelf. One way to interpret this decreasefrom the theoretical f /ω ratio, is that there is a decreasing role of the earth's rotation over the inner shelf. For low-frequency wind-driven flows, the transition from mid-shelf full Ekman transport (rotation important) to complete along-wind driven flow (no rotation) also occurs over the inner shelf (Lentz, 2001). Is there a similar definition for internal waves as the coastline is approached? An importance of the decrease in rotational effects is that even simple models show it to play a role in determining how long-waves deteriorate into higher-frequency components (e.g. (Gerkema, 1996); (Holloway et al., 1999)). The form of high-frequency waves observed over the inner shelf is influenced by this transformation (Suanda and Barth, in prep). Over the Oregon slope Martini et al. (2011), also found that much of the variability was explained by a sum of multiple internal waves. Due to the smaller continental shelf spatial scales and the multiple wave sources observed over Heceta Bank, rapid evolution in spatial interference patterns was expected (Nash et al., 2012b). In this work, we have shown how the observed wave-field in a region susceptible to two amplitude-modulated incoming wave sources will have spatial dependence. The motivation for including low-frequency amplitude-modulation to the two-wave model (Section 2.5.1), was to reproduce observed temporal variability in internal tide signals, such as an internal tide that is locked to and modulated by a spring-neap, a seasonal cycle, or other narrow-band low-frequency process. While we showed the general behavior of the signal extraction tools to a modulation, the use here was highly idealized, and could only reproduce some features of the observations. If this kind of simple modeling is to be used to make accurate predictions of wave parameters over Heceta Bank, future steps will need to include the realistic effects of topography, background stratification, wave sources, and the appropriate temporal window that modulates the baroclinic tidal cycle. Another simple modeling approach is to use a phase-modulated wavefield (e.g. Colosi and Munk, 2006). With the goal to resolve eventscale variability, amplitude-modulation was chosen in favor of phase-modulation because of the poor frequency resolution of short window harmonic analysis.\nEstimates of propagation speed and convergence width are comparable for the individual cases captured here, however there is considerable range in the comparison of Argusand mooring-derived wave propagation direction (Fig. 3.8, A -C). We attribute the scatter in propagation direction to the large difference in footprint size between the mooring and Argus estimates. In the image data, the convergence region associated with the internal wave is elongated over many kilometers in the along-shelf direction and a 1.5 km region is used to determine the propagation direction. The spread between ADCP beams in 20-m of water results in a much smaller 200-m 2 footprint. The discrepancy between the mooring and Argus footprints is even larger in shallower water. There are many processes within an internal wave and in the medium through which it is propagating that can cause variations, especially in propagation direction, on scales shorter than these footprint sizes such as refraction or along-wave front instabilities. Furthermore, the bore-like internal wave shape found on the inner shelf creates ambiguity in separating wave velocities from the background velocity field, an important distinction before accurately deriving wave propagation speed and direction (e.g., Mirshak and Kelley, 2009;Chang et al., 2011). One example of a future research question that this data evoked is to consider the effect of bottom bathymetry. The waves at Yaquina Head traverse a shallow reef whose effects on the internal wave dynamics in this area are yet to be studied. Future work can also include such processes as wave-wave interaction at this location (e.g., Wang and Pawlowicz, 2011). Some of the internal wave surface signatures also remain visible to the edge of the surf zone, where the interaction of these features with surf-zone processes can be investigated. In addition to internal wave surface signatures, Pawlowicz (2003)  The research here expands the work of Pawlowicz, [2003] towards a methodology for continuous monitoring of internal waves with video observations by demonstrating the feasibility of observing these features using a shore-based permanent installation of video cameras (e.g., Argus). Consistent monitoring is motivated by attempts to identify the source of internal waves and understand the timing of their arrival to the nearshore . While the use of only video cameras to monitor internal features would be a cost-effective solution, the current impediments to video observations such as image clarity and wind speed requirements indicate that more work is needed to demonstrate their utility. Once a robust probability estimate of streak arrival is achieved, such information can be used to plan future field experiments.\nPeriods of low and high HFIW activity on the inner shelf can be attributed to both tidal and non-tidal processes. Here we continue to discuss those which are tidalrelated, but briefly mention the wind reversal period around August 22 as a non-tidal modulation of HFIWs (Figure 4.6). With the switch in wind direction there was a 1 -2-day lagged increase in stratification at all moorings as a result of the regional upwelling front relaxing towards shore. The relaxing upwelling front has been shown itself to produce high-frequency features at its front end (Dale et al., 2008). As these gravity currents and waves arrive on the inner shelf accompanying warmer offshore waters, they have many similar features to internal tidal-related HFIWs, and increase the HFIW wave counts at all moorings (Figure 4.6 E)."}, {"section_title": "Conclusions", "text": "In this work we have combined observations from numerous moorings spanning the mid and inner shelf over Heceta Bank to provide a picture of baroclinic variability. Barotropic currents on the Oregon inner shelf are consistent with the TPXO shallow-water tidal model in both magnitude and spatial variation (Erofeeva et al., 2003). Semidiurnal baroclinic current variability does not have a spring-neap relation nor is it overall correlated between the sites. At times, variability is well correlated along a single latitudinal line consistent with onshelf propagation. This was seen in the relative phasing between observations as well as output from a 3-D regional numerical model. Baroclinic velocities and displacement are both dominated by the first mode, with larger velocities on the mid shelf and on the northern sites. Mid-shelf sites also have ellipticities that are more consistent with single, progressive internal waves compared to the inner-shelf sites. Displacements were similar at all locations, regardless of depth, indicating the potential importance of gradient advection on the inner shelf. In contrast to unidirectional wavefields, continental shelf internal tides are highly variable including time-and space-differences in ellipticity, inclination, and sense of rotation. Some of these features can be reproduced by an idealized linear model superposing two incoming amplitude-modulated waves. The spatial variability of velocity and density observations within a multi-directional wavefield limit the use of density or velocity measurements alone. Significant baroclinic periods, termed events, can last days to weeks with consistent wave behavior such as elevated velocities and phase relations between internal and surface tides. To fully understand the propagation of internal tides to shallow coastal areas with smaller scales, 3-D fields need to be better simulated. This is especially true as the coastline is approached and shallow water depths limit the resolution of σ-level models. Fully non-hydrostatic dynamics will be needed to capture the observed higher-frequency waves with large vertical velocities at the front of the internal tides at these locations (e.g. Arthur and Fringer in prep; Suanda and Barth in prep). At all moorings, variability in local stratification is related to wind-driven upwelling/downwelling, the dominant forcing mechanism at subtidal timescales. At locations to the north of Heceta Bank, stronger baroclinic velocities were found during periods of higher background stratification. A correlation revealed once persistently significant portions of the data records were isolated into events lasting many tidal cycles. Sustained observations over long periods were essential to this analysis. Finally, internal waves have important implications for environmental questions on the Oregon shelf with regards to intertidal invertebrate recruitment or coastal hypoxia. Both of these processes have been linked to low-frequency upwelling/downwelling as a physical driver. However, there are examples within these studies where the upwelling/downwelling hypothesis proved non-conclusive (e.g. Shanks and Shearman, 2009). Internal tides are an alternate physical driver of cross-shelf material transport and their connection to upwelling/downwelling is indicative of the complexity of these processes and the work left to disentangle their effects.\nIn this work, we have shown how shore-based video remote sensing can be used There is a large archive of historical Argus data collection, including those from other Argus stations around the world that could be analyzed for internal wave occurrences. While the Argus program is a well-developed system with invaluable data collection and management protocols, opportunities exist for using other camera platforms such as beach webcams to observe these features.   Table 1.       Figure 3.5. The same front propagates from x-shelf distance ∼2000 -1800 in the 17-min sampling period. B. Twodimensional spectrum from the Fourier transform of the field shown in part A. C. Contour plot of lag correlation between pixel time series from x-shelf distance 1900 to successive offshore pixels in A. The dashed white line follows the maximum in lagged-correlation. In all plots, the dashed black line corresponds to a feature propagating onshore at 0.15 m s −1 .      3.9: Summary of observations from Argus-tracked waves, with average values from in situ estimates noted in grey circles. Error bars represent one standard deviation from this mean. A. Angle to shore normal versus distance from shore. Thick line denotes average of all tracked streaks plus/minus standard deviation in gray. Vertical lines denote mooring positions. B. Propagation speed versus distance from shore. Thick lines are the same as A. Dark gray boxes are the theoretical linear phase speed estimates described in the text.    \nWe have observed high-frequency internal waves shoaling over an inner shelf. Both surface-and bottom-trapped high-frequency oscillations are present on the inner shelf, they are highly-nonlinear, and in many ways exhibit more bore-like as opposed to wave-like characteristics. Arrival and polarity of waves to the inner shelf is intimately connected to the internal tidal cycle. The nonlinearity coefficient of the KdV equation, α provides reliable prediction of the inner shelf waves even though they are highly nonlinear and the pycnocline is near mid-depth (Grimshaw et al., 2004). At 10-m depth however, α estimates don't seem as reliable perhaps indicative of the depth limit of using weakly nonlinear estimates of α in the coastal zone, or the necessity for including higher-order nonlinear coefficients (Grimshaw et al., 2004). This type of modeling modeling with extended KdV coefficients also show the evolution of two internal solitary waves as the first wave experiences deformation and produces a slowly-propagating tail, a second wave that follows behind it can be impacted by those transformations (Grimshaw et al., 2004). It is evident that continued high-resolution, fully nonlinear, nonhydrostatic modeling efforts can contribute to our understanding of these processes. As all parameters in both nondimensional internal wave evolution numbers, Ib, and B c , are similar, future work should include an effort to reconcile these for general use. Throughout much of the time series, inner shelf HFIW oscillations are indicative of a shoaling internal tide whose run-up phase form and extent is temporally modified by regional-scale upwelling and downwelling processes. Internal tide-driven bottom transports appear to vary over a 3 to 5-day period, much faster than a spring-neap tidal cycle and instead more in line with the weather band, controlling the wind-driven upwelling and downwelling cycle. Efficient transport run up with subthermocline water arriving at the 10m mooring was only strongly observed once, coincident with a shallow offshore pycnocline and larger internal tide amplitudes. Finally, the transformation of an offshore internal tide into high-frequency features with the potential to mix and transport material across the shelf has important environmental and coastal ecosystem implications. Future work will continue to investigate the relationship between these physical and biogeochemical processes.    b) a) FIGURE 4.5: A) Along-shelf, first-mode, wave velocity structure function,V , versus crossshelf function,Û , used to estimate HFIW propagation direction. (B) Estimate of HFIW propagation speed by regression of ∂ t u on ∂ z w from August 25, 2011. Colors represent measurements at different water depths. Line slope provides estimate of bore propagation speed. FIGURE 4.6: A. Low-pass filtered wind vector from NWP03 (blue). Low-pass filtered north-south wind (thin black). B. Newport sea level. C. Low-pass filtered vertical stratification. D. Semidiurnal baroclinic mode-1 velocity at NH-10 (green). Orientation of NH-10 mode-1 semidiurnal baroclinic ellipse (blue). 0 and 180 o are oriented onshore. E. Number of identified high-frequency waves in 12-hour increments at three mooring locations. FIGURE 4.7: Hovmöller plot of baroclinic semidiurnal sea surface anomaly calculated from four days of ROMS modeled output at the latitude of the NH-line (Osborne et al., 2011). Locations of NH-10 and YH-20 are noted with dotted black lines. At ≈ hour 40, two sloped lines represent the average propagation speed of a first-mode semidiurnal wave estimated from stratification at NH-10 and YH-20, respectively.          ,4,6,8,10,12,15,20,25,30,40,50,60 "}, {"section_title": "Acknowledgments", "text": "This paper is dedicated to the memory of Murray Levine, a one-of-a-kind oceanographer and mentor who contributed instruments, invaluable expertise, many helpful discussions, and much wit and charm.    FIGURE 2.10: Semidiurnal ellipse parameters for the 1st baroclinic mode for all windowed fits from 2011 mooring deployments. Histograms at each location are: inverse ellipticity (u min /u maj ), with values < 1 indicating clockwise rotation(left); phase difference between velocity in the direction of wave propagation and displacement(middle); and rose-histogram of ellipse inclination to indicate propagation direction (right). Vertical lines in the inverse ellipticity histograms are the theoretical ratio for a freely-propagating, planar, mode-1 wave affected by rotation (-0.72) and a non-rotating wave (0). Vertical lines in the phase difference histograms are differences for pure standing (90 o ) and freely-propagating (180 o ) waves. As there is 180 o ambiguity in ellipse orientation, both inclinations within the ranges (0 -180) and (180 -360) are plotted. For all moorings, positive x-axis is directed onshore.        "}, {"section_title": "Optical remote sensing collection and processing", "text": "One of the programs to advance the use of optical remote sensing of coastal processes is the Argus program developed at Oregon State University (OSU). An Argus system consists of a suite of cameras rigidly mounted to a tower with synchronized image sampling via a computer-controlled data acquisition and transmission system. The Argus program currently comprises about 10 such installations around the world [Holman and Stanley, 2007]. Some of the Argus program's capabilities and sampling strategies are discussed below in the context of internal wave observing, however the reader is referred to that text for a detailed review of these topics and a comprehensive list of references. Video remote sensing for this study is from three cameras mounted 125 m above sea level which provide an approximately 70 o field of view to the south of Yaquina Head. The oblique camera images (Figure 3.3) are merged into a 2-D plan-view in earth coordinates that spans 5 km in the alongshore and up to 3 km offshore Optical remote sensing with digital cameras has the capability to collect and record images at the frequency of the shutter speed (30-Hz for Argus cameras). The Argus program has resulted in a variety of sampling schemes adapted to the study of different near-shore processes including longshore currents, beach profiles, rip currents, and sand bar migration (Holman and Stanley, 2007). In this work we use two products; single images consisting of 2-minute time exposures (timex) during the combined experiment to track the cross-shelf propagation of internal waves and pixel time series for the 5-month monitoring study to determine internal wave occurrence. In the near-shore, the optical expression of internal waves is not as strong as other signals (for example breaking surface waves). To take advantage of the slower propagation speed of internal oscillations and to average out optical noise due to surface waves, 2-minute time exposure images are used instead of instantaneous snap-shots. Time exposures were taken every two minutes during daylight hours for the duration of the combined experiment. This sampling strategy produced a large amount of image data ( 10 GB) that were stored at an on-site computer and then downloaded after recovery of the in situ moorings. The second goal of this work was to assess the utility of the Argus installation to continuously monitor the sea-surface for the signature of internal waves in the absence of The following procedure was used to determine wave properties from Argus timex images during the August, 2011 experiment (Figure 3.4). Sequences of georectified 2-min timex images were inspected for possible surface features such as dark/bright bands, streaks or slicks that surrounded the time of internal wave arrival at in situ moorings from the detection method described in section 3.2.1. Once a coincident occurrence was identified, the timex image corresponding to when the surface feature first enters the Argus field of view is run through a 2-D spatial high-pass filter to accentuate the streak representing the wave front. A 1.5 km best fit line is found through the high-passed points near the wave front centered on the mooring line (y = 915 m). While the propagation direction of a highly-curved front, such as a river plume, might not be perpendicular to its orientation everywhere, in our study fronts were mostly oriented in the along-shelf direction and propagation direction is assumed to be perpendicular to front orientation. The procedure was repeated every three image frames for as long as successive images contained the streak. The change in position of the front through time provides an estimate of the propagation speed of the feature as it travels across the inner shelf. Within each frame, the thickness of the front is also estimated by retrieving image intensity values 250 m in front of and behind the tracked feature to identify the area of increased pixel intensity (Figure 3.5, B). These results are presented in the following section and summarized in Table 3.2 for all waves tracked in this study. As an example, the multi-platform observations of the August 15th internal wave are presented in Figure 3.5. A cross-shelf transect of image intensity through time is shown as a Hovmöller plot (panel A). A region of increased pixel intensity enters the camera field of view (10:45 am, x = 2600) and propagates onshore, coincident with large isotherm displacements as the front crosses the moorings. These images taken over 5 hours provide a clear example of a shore-ward propagating streak, however the same feature is also seen in a Hovmöller plot created from a 17-min pixel time series collection taken at 12:00 noon on that day (Fig. 3.6 A). An internal wave travels 150 meters during this time, a small portion of the inner-shelf width (2 km) and not useful for wave-tracking purposes, but a distance easily greater than the measurement error of the cameras and potentially useful for wave detection. To explore wave detection, two internal wave-finding algorithms were applied to five months of the pixel time series data record (June -October, 2011). The first algorithm performs an analysis in the frequency-wave number domain utilizing Fast-Fourier Transforms (FFT). A similar method has been applied to Argus images to measure surfzone long-shore currents (Chickadel et al., 2003). In this method, pixel time series from each 17-min sampling period are sampled along nine, 350-m cross-shore transects within the Argus field of view (Figure 3.4). A two-dimensional Fourier transform is applied to the pixel intensity data, I(x, t), at each transect, whereÎ(k x , f ), is the Fourier transform as a function of frequency (f ) and cross-shelf wave number (k x ). The two-dimensional spectrum, S(k x , f ), is computed as where the asterisk ( * ) denotes the complex conjugate. By identifying the location of the peak in spectral energy within frequency-wavenumber space (k x , f ), a cross-shelf propagation speed was calculated (V = f /k x ). As discussed below, the average internal wave speed in this study was 0.15 ± 0.10 m s −1 . Transects from pixel time series whose 2D FFT-derived propagation speed fell in this range were determined to contain an internal wave. The second algorithm, a counterpart to the above method, used time-space lagged cross-correlations where contours of maximum correlation were compared to the average wave speed. This method is discussed in the Appendix, and yields similar results though it was not found to be as effective in discerning waves from other features. The frequency-wavenumber (FFT) and time-space (XCor) wave detection algorithms applied to intensity data from the August 15th pixel time series example are presented in Figure 3.6, B and C. With both methods, the feature's speed falls within the range 0.15 ± 0.10 m s −1 (the average propagation speed of tracked waves), and would be identified as containing an internal wave."}, {"section_title": "Results", "text": ""}, {"section_title": "Results from combined in situ and remote sensing experiment", "text": "Background conditions during the experiment were typical of the Oregon summer upwelling season (Figure 3.7). Coastal winds measured at the Newport NDBC C-MAN station were predominantly from the north reaching 10 m s −1 with a notable period where winds reversed direction (8/20 -8/25). Surface gravity wave forcing was low with offshore significant wave heights rarely reaching above 2 m. The amount of available light and the moisture content of the atmosphere between the camera and the ocean surface both have an impact on the quality of images gathered and the success of optical remote sensing. Though there were no external measurements of these parameters, the Argus images themselves were used to create an image clarity index by comparing contrast levels within the image. Two pixels were chosen, above and below the horizon, representative of an atmospheric and a sea-surface measurement respectively. The clarity index for a clear (unclear) image is assigned a value of 1 (0) if the contrast between the pixels is above (below) a threshold of 0.9 (Figure 3.3). Successive clarity indexes are averaged into hourly intervals, yielding the percent of good images within each viewing hour. Near the beginning of the combined study period (early August) there were predominantly clear days with good viewing conditions ( Figure 3.7, D). Towards the end of the experiment (after August 20) and coincident with the wind relaxation, there was a large increase in hours where images retrieved were unclear and not useful for this work. Over the month-long experiment, 11 wave events were tracked as they propagated across the inner shelf (Table 3.2). With one exception, all tracked waves were depression waves. The observation of an elevation wave with a visible surface signature is perhaps unusual and more work will be needed to understand the surface visibility of elevation waves. All waves were tracked for a period of 1 -4 hours resulting in 20 -120 Argus images containing the feature. For each wave, between 10 and 40 frames were analyzed for the internal wave characteristics of propagation speed, direction, and region of increased intensity. The variability in distance and time of wave tracking mainly reflected changes in image clarity due to low-lying clouds or fog that entered the camera field of view or changes in the overlying wind speed. The effect of wind speed magnitude will be discussed in Section 3.3.2, below. A comparison of the individual Argus-to mooring-derived wave properties for the waves tracked during the combined experiment are shown as a series of scatter-plots in Figure 3.8, A-C. In each panel, a dotted diamond symbol represents waves whose ADCPbased propagation speed is greater than the error estimate; a value significantly different from zero within our confidence estimates. The estimates of propagation speed compare favorably, however Argus estimates are biased higher than in situ estimates, perhaps due to near-surface processes not adequately captured by an ADCP. There is scatter in the individual estimates of wave direction. We also attempted to derive propagation speed and direction from ADCP velocities following the method described by Mirshak and Kelley (2009) and Chang et al. (2011). Results from these methods (not shown) showed comparable estimates of propagation speed, but an equal amount of scatter in the estimate of wave direction. We expand on this result in the Discussion. The cross-shelf variations of wave direction and propagation speed are examined by taking the average of all wave characteristics tracked by Argus (Figure 3  is a function of the vertical density gradient, itself a function of salinity, temperature, and pressure (ρ(z) = ρ(S, T, p)). As salinity was only measured at the surface and bottom of the water column, a linear relationship between temperature and salinity was assumed to obtain density estimates from discrete temperature-only measurements. The relationship (S = 34.54−0.09T ), was determined by linear regression of the concurrent temperature and salinity measurements similar to previous studies from other Oregon inner-shelf locations (Kirincich and Barth, 2009b). For each of the Argus-tracked waves, all mooring-recorded temperature measurements from the preceding hour are converted to density. These values are then sorted and interpolated to give a single surface-to-bottom density profile which is used to calculate the background stratification and solve for the theoretical wave phase speed. Practically all Argus-measured features propagated faster than these linear phase speeds. This is a frequently observed behavior of shoreward-propagating, nonlinear internal waves in coastal areas because of the amplitude-dependent phase speed correction (e.g., Apel et al., 1985;Stanton and Ostrovsky, 1998;Shroyer et al., 2011).The largest signature of an internal wave is seen from interior measurements of vertical velocity and stratification. The automated algorithm described in 3.2.1 detected a large number of internal waves from the moorings. In comparing the number of wave events captured by the in situ measurements ( 200) with the number of waves observed by remote sensing during the study (11), it is apparent that there are many more internal events than those captured by the video observations. Measurements from video remote sensing are confined to daylight hours that are free of rain and fog, limitations not experienced by the in situ measurements. These limitations are summarized in Table 3.3 by comparing the number of hours containing internal waves from the mooring record with those from Argus. Excluding the evening hours and unclear conditions, the number of potentially observed waves is 105. With Argus only 23 hours of wave observations were made (22% success rate). This success rate has yet to account for the variable state of the sea surface, primarily a function of overlying wind speed, which also affects the success of optical measurement. This effect is quantified in the next section by using a longer set of pixel time series video data."}, {"section_title": "Results from pixel time series collections", "text": "During the 5-month period analyzed for internal waves, about 80 wave events were identified through the wave-detection algorithm. Those identified wave events which oc- of the tracked waves). In general, the XCor method was not as restrictive, and identified many more internal wave features than the FFT method. For direct comparison of the pixel time series detections to the tracked waves during the combined experiment, we focus attention on the FFT detections with at least two transects containing an internal wave (periods marked by black filled-symbols on Fig.   3.10). The first 2 waves (August 5 -August 9) occurred during a period when the hourly pixel time series collections were not being conducted. Of the remaining 9 waves, all but 1 were successfully detected by the FFT detection. One event (August 24) also resulted in a false positive. This occurred on a day with many hours of unclear images interspersed with periods of clarity ( Figure 3.5, E). Upon returning to the 2-min images for that day, around 10 AM the sea surface did exhibit multiple clear streaks near the in situ moorings. Additionally, multiple sharp thermal oscillations were also visible in the in situ data at that time. However, these measurements were not included in the tracked waves because there was no direct mooring crossing visible within the imagery and it was unclear which streak was associated with the signal seen in the moored data. Two of the August days are shown in the panels of Figure 3.10, B, where in addition to the symbols in (A), the sea level record from Newport is also plotted. The internal waves arrived at different phases of the tide on these two days, demonstrating a lack of consistent phase relation between the internal and surface tides. This highlights the difficulty in predicting wave arrival and further emphasizes the need for consistent monitoring of these features (Nash et al., 2012b). Expanding the identification of waves by FFT detection to the full five month data record resulted in 1159 pixel time series collections, 84 of which contained internal waves. Though without an in situ presence it was impossible to determine with full certainty that the measured feature was indeed an internal wave, this suggests that 7% of archived video observations contain an internal wave streak. This is comparable to the percentage of time that internal waves were tracked in the combined experiment (5%). A histogram of wind speeds during which these waves were successfully observed by remote sensing (light bars, right-axis, Fig. 3.11) shows that the majority of the waves are visible during weak to moderate winds (wind speeds between 2 -5 m s −1 ). When compared to the wind speed distribution during hours without waves (dark bars, left-axis), not only is there a difference in the shape of the distribution, with higher wind-speeds absent in the former, but the mean wind speed is also shifted towards lower values (3.6 m s-1 in collections with waves, and 4.7 m s-1 in collections without). This reflects one reason why many waves reported in Table 3 were not observable by video. A light wind does not affect the successful observation of internal wave surface signatures, but strong winds create a noisy sea state that erases the surface variability associated with internal waves. While some wind might be needed for radar observations, we know of no similar minimum for optical measurements. There are other factors which also could influence the wave surface signature. These will likely be associated with variable internal dynamics within individual waves and will be explored in future work."}, {"section_title": "Acknowledgements", "text": "\n"}, {"section_title": "Methods", "text": ""}, {"section_title": "The background wave guide", "text": "The oceanic waveguide through which internal waves propagate is characterized by the nonlinear coefficient of the KdV equation (Eq 4.1). First, we determine the linear phase speed and the modal structure function Ψ for internal wave modes as defined by solution to the vertical structure function equation for hydrostatic, flat-bottom modes for each mooring location: with the following boundary conditions (Ψ = 0 at z = (0, −D)). Where D is the water column depth, U (z) is the velocity shear, and background stratification, N 2 (z), is given by the vertical density gradient, As we are interested in a lower-frequency background with respect to high-frequency waves (periods < 15 min), we construct an hourly background field. Mooring-recorded temperature measurements for each hour are converted to density with a time-dependent linear temperature-salinity relationship. At NH-10 and YH-20, temperature and salinity measurements are made at multiple levels in the water column (Table 4.1). A temperature-salinity relationship derived at each time step is used to transform the locations of temperature measurement to density. At YH-10 with salinity only measured at the surface, the same TS relationship was used as found at YH-20. The hourly density values are then sorted and interpolated to give a single surface-to-bottom density profile which is taken as the background stratification and used in conjunction with hourly currents to solve for the theoretical wave phase speed. The eigenvector solutions (Ψ) also give the vertical structure of baroclinic vertical and horizontal velocity modes (Ŵ ,Û ,V ) which are used in calculations of high-frequency wave direction below. Furthermore, the low-pass filtered (> 33 hour) location of the zero crossing in the first baroclinic mode at NH-10 is taken as indicative of the regional thermocline to determine the time-varying sub-thermocline water in the transport calculation."}, {"section_title": "The KdV nonlinearity parameter", "text": "For a continuously stratified ocean, the coefficient of nonlinearity in the KdV equation, α, is a function of the background shear and the vertical structure funtion, Ψ: where C 0 is the linear phase speed. This parameter has been shown to capture the seasonal background on continental shelves (e.g. Holloway et al. (1997)) and to successfully predict the location of critical point (α = 0) from observations off the New Jersey continental shelf (Shroyer et al., 2009). A two-layer approximation is often useful and helps to visualize the effect of α. Without shear, this formulation is: where H 1 and H 2 are the upper and lower layer depths, respectively. In this formulation the magnitude of α determines the magnitude and importance of nonlinearity in wave propagation, but additionally the sign of α also determines whether or not elevation or depression waves can be expected. For values of H 1 < H 2 , the upper layer is thinner than the lower layer, α < 0, and depression waves are expected. For H 1 > H 2 , the lower layer is thinner, α > 0, and elevation waves are expected. The addition of a background shear flow can also alter the magnitude of α and modify the cross-shelf location of the critical point (Shroyer et al., 2009). Though we do not expect the weakly nonlinear theory to provide an exact replica of observations from the shallow inner shelf as it is a highly nonlinear environment (ζ/H ≈ 1), we show below that the basic effect of nonlinearity, as represented in KdV by the parameter α, is still a good predictor of the polarity of inner-shelf waves that we see, at least at the 20-m mooring."}, {"section_title": "High-frequency wave detection", "text": "High-frequency, nonlinear, first-mode internal waves are a strong source of mid-watercolumn vertical velocity and temperature fluctuations in a stratified fluid, including the shallow inner shelf. However, unlike solitary wave measurements from deeper parts of the ocean with clearly defined leading and trailing edges, the strongest, sharp isotherm displacements on the inner shelf resemble bores and gravity currents without a corresponding trailing edge. For low-frequency flows, vertical velocity from a bottom-mounted ADCP is usually too close to noise levels such that they are precluded from use in results. However, these measurements have been useful in identifying periods of nonlinear internal wave activity ((Nash et al., 2012b), (Richards et al., 2013)). Here, we use a similar metric to look for periods of large mid-water column vertical velocity and temperature change in the mooring record. A detection algorithm was developed to analyze both time series of mid-water column vertical velocity and temperature to isolate the occurrence of high-frequency internal waves. A first-difference filter is applied to the temperature records from the 7-, 10-, and 13-m (4-, 7-m) thermistors at the 20-m (10-m) site, and the largest values (> 3 standard deviations) are identified as potential internal wave events. This is done in 24-hour increments as a range of temperature standard deviations was observed. Vertical velocity time series from three mid-water column ADCP bins (25%, 50% and 75% of water depth) are also analyzed to identify their largest fluctuations (> 3 standard deviations and > 0.02 m s −1 ). This algorithm can be thought of as an expression of the assumed temperature relation: "}, {"section_title": "Wave speed from ADCP", "text": "Much work has been done to decipher the speed and propagation direction of nonlinear internal waves because these properties have important consequences for identifying wave energy sources, fluxes, and dissipative regions. As some observational programs consist of a single mooring, deriving speed and propagation from a single ADCP is desirable and there are a number of methods that have been used in a variety of deployment locations (e.g. Scotti et al., 2005;Moum and Smyth, 2006;Mirshak and Kelley, 2009;Chang et al., 2011). These methods have been most successful with large-amplitude internal solitary waves in a variety of coastal and estuarine settings. Here, we attempted two of the primary methods which will be briefly described here. The first method treats the four ADCP beams as a phase-lagged array (Scotti et al., 2005). As internal waves oscillate scattering layers within the water column, variations in echo intensity are measured by each ADCP transducer at a variety of depths. With the known angle between beams and and measured distances between the unit and beam centers (bin depths), a least-squares minimization of maximum lagged cross-corrrelation between beam pairs can be used to estimate the wave propagation speed (c ph ) and angle of propagation (θ). Numerous issues arrive with this method for shallow-water bores as both surface-trapped and bottom-trapped internal bores exist, the depth of the greatest vertical gradient in echo intensity is not known a-priori, and lower in the water column, the distance between beam centers is small providing less accurate measurements of the travel speed across transducers. The other method, which is adopted here, employs an assumption of wave twodimensionality and derives phase speed from a fit as outlined in (Chang et al., 2011). First, the horizontal currents prior to the arrival of an HFIW as identified by the detection algorithm are removed from each level within the water column and used as background shear in eqn 4.2. Then, the horizontal first-mode velocity mode supported by the stratification at that period (Û ) is used to decompose the remaining currents: (4.7) The first mode velocities (n = 1) are then used to determine the propagation direction of the wave by least-squares regression (Figure 4.5 A) such that: (4.8) Measured velocities are then oriented such that they are aligned in the direction of wave propagation, θ. Next, the high-frequency waves are assumed to satisfy the two-dimensional continuity equation in the direction of wave propagation such that: by neglecting variations in the along-wave front direction (∂ y = 0). By employing the frozen flow assumption, the spatial derivative can be turned into a temporal derivative and wave speed can be derived by least squares minimization ( 4.3 Results"}, {"section_title": "Background conditions and wave counts", "text": "The Oregon upwelling season is characterized by predominantly equator-ward winds that drive coastal upwelling (Huyer, 1983). Low-frequency variability in the winds cause periods of relaxation and reversal which directly drive shelf currents and alter shelf stratification ( Figure 4.6) (Barth et al., 2005). While the winds were mostly upwelling favorable, brief wind relaxations were also captured, including one significant reversal event (08/21 -08/23) with northerly winds. The strength of stratification at all mooring locations is correlated and exhibits a 1-2 day lag to the winds. During these August, 2011 observations, almost two spring-neap cycles were captured. In general, the largest internal tides do not coincide with spring tide period at this location . However, the magnitude of the internal tide is an important contributor to the eventual forms and numbers of high-frequency waves we observe on the inner shelf. There is variability in the number of wave counts at all three moorings, but in general these methods yield greater numbers of individual waves at NH-10, decreasing to the 20-m mooring and further decreasing to the 10-m mooring. There is a marked period of reduced numbers of HFIWs at all locations from 12 -15 August, as well as a period of increased waves around 10 August. These periods will be discussed in more detail below. The incoming semidiurnal internal tide at NH-10 also changes character throughout the observation period (Figure 4.6 D). The mooring is located in a region near a wave source from the northwest (Kurapov et al., 2003), a shoreward propagating tide from this location has recently been identified in inner-shelf observations  as well as a regional numerical model (Osborne et al., 2011) (Figure 4.7). Here we show the cross-shelf propagation of a baroclinic sea surface anomaly, indicative of the perturbed mean density field by an internal tide. It is calculated from the modeled density field following  where the pressure perturbation is, Pressure at the surface is inferred from the condition that the baroclinic pressure perturbation has zero depth-average, and the sea surface height anomaly can be calculated: Measured stratification and shear at NH-10 and YH-20 allow for an estimate of the theoretical speed of an internal wave from (2). The August-mean of these values are added to the Hovmöller plot ( Figure 7) and are comparable to the cross-shelf speed of the SSHA features seen in the ROMS model."}, {"section_title": "Tidal timing", "text": "The transformation of the internal tide is important to the timing of waves of different polarity at the 20-m mooring. Here, we summarize the arrival timing and polarity of identified HFIWs with respect to an average internal tidal cycle. As the phase of the internal tide is not necessarily stationary, constructing the average cycle is not trivial. Here we identify the cycle by a complex-demodulation of an M2-period to the mid-water column displacement. The demodulation involves short window (4-day) overlapping leastsquare regression fits to the displacement time series which determines the amplitude, but more importantly, the phase of the internal tidal cycle . HFIW occurrences are then placed within the time frame of the semidiurnal phase (-180 to 180 o ) and overlapping windows are then averaged together (Figure 4.8 A, B). Perhaps a more surprising result is the well-correlated HFIW occurrence with the surface tide at the 20-m mooring, indicating that they are phase-locked during this period. Elevation waves appear frequently during the falling tide, while depression waves occur during the rising tide (Figure 4.8 C, D). The apparent phase-locking between the surface and internal tide can last for many days on the Oregon shelf, but is, in general, not the typical case ."}, {"section_title": "Sub-thermocline water transport", "text": "To quantify the high-frequency (< 33-hour period) transport of sub-thermocline water to the 20-and 10-m moorings, we calculate the rate of temperature flux following Bourgault et al. (2008) as The integral in (11) is evaluated from the bottom to the deepest zero-crossing in the highpass filtered cross-shelf velocity profile (u ) (Kirincich et al., 2005). T is the water temperature at the inner shelf, T t is a time-varying temperature at the base of the thermocline as determined from the vertical structure function fits at NH-10 above. These results show alternating on-and offshore bottom transport at the 20-m mooring ( Figure 4.9 A). Onshore transport occurs during the bottom-bore phase of the internal tide, offshore transports are indicative of the swash-back that occurs with onshore moving surface warm fronts. The low-pass filtered sub-thermocline transport shows net onshore flow over the study period and oscillations of its intensity at 3-to 5-day cycles. The August-mean value of the sub-thermocline transport here is 0.21 o C m 2 s −1 . Previous studies with similar calculations conducted in Southern California reported monthly-mean values of 0.18 and 0.12 o C m 2 s −1 from two separate 15-m mooring depths (Nam and Send, 2011), while in the St. Lawrence estuary the mean value was practically 0, suggesting that onshore transported cold water was equally transported offshore (Bourgault et al., 2008). The cross-shelf transport of sub-thermocline water is due to a number of processes occurring at tidal-frequencies or higher. Depending on instrument sampling interval, some of these processes might not be resolved. We compare transport results using the fullresolution 30-s sampling data with subsampled data at 2-min, hourly-averaged data, and M 2 harmonically analyzed velocity data. While the monthly-mean values from these various methods do not substantially differ (within a standard deviation), instantaneous values can differ by 50%. At the 10-m mooring, the sub-thermocline transport is vastly reduced. However, there is a noteworthy period of significant transport onshore of 10 m from 12 -15 August. We also note that the amount of backwash (F t < 0) at the 10-m site, is also particularly small during this period. We examine the time period between 11 -15 August in more detail. During this time, there was fairly high energy, onshore-directed baroclinic tide at NH-10 ( Figure 4.6 D). Evidence of the semidiurnal mode-1 internal tide propagating from NH-10 to the YH moorings from a numerical model was presented earlier, but there is also evidence from the moorings in that they show the correct phasing between semidiurnal mooring-derived phase propagation during this period . The contours of temperature from the three moorings (Figure 4.6), clearly show semidiurnal oscillations at all locations, with high-frequency waves identified at each location. At NH-10, high-frequency oscillations occur in packets, primarily as parts of the depression of the 8.5 degree isotherm. Meanwhile at YH-20, HFIWs of elevation consistently mark the front ends of the semidiurnal tidal oscillation, with an occasional wave of depression on the semidiurnal trailing edge (e.g., 7:00AM, 15 August). The nonlinearity parameter, α, evaluated at the three locations also supports the polarity predictions above (Fig. 4.12). At NH-10, its value is consistently negative, corresponding to depression waves, and though there is a semidiurnal oscillation, its polarity rarely switches sign. Over the inner shelf, at 20-m depth, the semidiurnal internal tidal density oscillation is comparable to the total water column depth. This causes α to al- At the 10-m mooring, both the timing of identified high-frequency waves and the fluctuations of the nonlinearity parameter do not display consistent results. We think that the location of this mooring partly explains this. A shallow reef separates the 20-and 10-m isobath at this location and the effect of bores propagating over this feature is poorly understood. Additionally, the 10-m site is located in the lee of the Yaquina Headland, potentially separating its dynamics from the regional forcing."}, {"section_title": "Transport by bores", "text": "At YH-20, both waves of depression and elevation appear to arrive from the west or northwest with speeds that often exceed those predicted from stratification (Fig 4.12). Only values whose ADCP-based speed estimates exceeded a minimum r 2 (0.25) are included here. Bore speeds are compared with a theoretical phase speed that includes an amplitudedependent nonlinear correction given by, where C 0 is the linear phase speed prior to wave arrival and ζ is the wave-induced displacement (Holloway et al., 1999). Here, displacement is calculated as the vertical distance that an isotherm undergoes during the passage of an internal bore. The isotherm is chosen as the one that experiences the largest displacement during this passage (mean ≈ 8 m). On average, the magnitude of the nonlinear, amplitude-correction term is ∼20% of the linear phase speed at the 20-m mooring. While in (Section 4.3.3), subthermocline transport was calculated for all processes at greater than tidal frequencies, how much transport can be attributed to the HFIW component of the flow? With estimates of the propagation speed of these bore-like features, a measure of the transport within both depression and elevation bores can be estimated by a Froude number criteria: where u is the current associated with the wave and C ph is the propagation speed. For values of F r > 1, the bore-like wave is likely to trap and transport fluid. For each wave, we estimate the fraction of wave currents that exceed both measured and theoretical phase speed at each level in the water column (Figure 4.13). As expected, depression waves have a surface intensified transport potential, while elevation waves have bottom intensified transports. Note that overall, depression bores have a greater fraction of currents which exceed both theoretical and measured phase speeds, covering a greater percentage of the water column than the elevation bores. While we expected to compare these estimates with those from the YH-10 mooring, the algorithm-identified HFIWs at YH-10 tended to produce small propagation speed. Though this is expected for the shallow water depth, it also resulted in no waves satisfying the above criteria for a minimum r 2 . Other methods of phase speed estimation (e.g., Scotti et al., 2005) similarly did not yield consistent results. We attribute this to a lower signalto-noise ratio as water column velocities were reduced at the 10-m mooring compared to those offshore."}, {"section_title": "Internal wave transformations over the Oregon shelf", "text": "The period of August 12 -15 was notable for its increased shoreward transport of sub-thermocline water, the reduced numbers of internal waves on the inner shelf, and a lack of high-frequency depression waves. These features are consistent with a variety of specific background conditions that combined to create this scenario. Nonlinear numerical modeling of shoaling internal tides show that the transformation, polarity switch, and breaking process of an offshore semidiurnal oscillation is influenced by a number of factors including topographic slope, incoming wave amplitude, and pycnocline location (e.g., Vlasenko, 2005). Because of the NH-line location on Heceta Bank, the slope between NH-10 and YH moorings is mild compared to other locations on the Oregon coast (about 0.3 o or 0.005). This allows waves to propagate onshore and exhibit shoaling behavior as opposed to quickly collapsing if the slope was steeper (Scotti et al., 2008). Indeed the shape of internal tides at NH-10 are indicative of HFIWs that are consistent with a steepened and dispersed internal tidal signal. During the summer at NH-10, these are mostly depression waves. These waves propagate onshore, continue to transform, pass a critical point (α = 0), and result in a signal measured at YH-20 which can then be transmitted further onshore. The factors controlling wave transformation can be combined to a breaking parameter (Vlasenko, 2005): where a is the amplitude, H, the local water column depth, and h p , the depth of the  (Figure 4.15). These are characterized to lie on a spectrum between a triangle shape, where only elevation waves occur if the nearshore region is close to the breaking point, or a square shape where both depression and elevation waves are observed as both the leading and trailing edges of the tide experience steepening (see Figure   18, (Scotti et al., 2008)). Changes between the expected signals can occur within a number of days depending on changes to the background conditions and incoming tidal signal. For our measurements of HFIWs this equates to a reduced number of waves, and only those of elevation during a triangle-shaped internal tide, and an increase in the number of high-frequency waves of both polarities during a square-shaped internal tide. The conditions between August 12 and 15 are such that the pycnocline shoals to be quite shallow (about 30 m depth), while the offshore internal tide amplitude increases to about 8 m, creating large internal wave breaking closer to the YH-20 mooring (Figure 4.14). Recently, Walter et al. (2012) use an alternate non-dimensional number to determine whether the form of the inner-shelf internal tide consists of a bottom bore (triangle tide) or both elevation and depression bores (square tide). The number used in that study was an internal Irribarren number, a function of bathymetric slope and offshore wave amplitude and wavelength. Using the slope of the Oregon shelf between NH-10 and the YH moorings (0.005), the range of amplitudes from complex demodulation of the first displacement mode, and wavelength from solution to the linear, flat-bottom modes above (about 15 km), gives very small values of the Irribarren number which would be consistent with the canonical bore form predicted in Walter et al. (2012), or the triangle form predicted by (Scotti et al., 2008). The nonlinearity parameter, α, and estimated phase speeds, can all be evaluated with or without vertical velocity shear. The inclusion of shear can modulate α by about 20% at both mid-and inner-shelf locations enough to switch its sign in some instances. Note that though the nonlinearity parameter predicts which polarity of wave can be transmitted as a function of the background, it does not predict whether or not that wave would arrive at a specific time."}, {"section_title": "Relation to the extent of internal wave run-up", "text": "The run-up of waves to the 10-m mooring (the inner, inner shelf) was most successful during a period without waves of depression at the 20-m mooring (see Figure 4.11 B). Since depression bores have large offshore velocities in the lower water column, these features potentially inhibit the transport of subthermocline water to the nearshore. While the shallow pycnocline depth has been previously identified as a conducive condition for transporting sub-thermocline water to the nearshore (Noble et al., 2009), the additional implication here is that internal tidal driven subthermocline exchange depends on the suppression of depression bores which can be controlled by offshore background conditions of both pycnocline depth and internal tidal amplitude."}, {"section_title": "Structure of the elevation bores", "text": "The front of elevation bores observed on the Oregon inner shelf has a lifted nose (Figure 4.16), typical of gravity currents with the inclusion of friction (Simpson, 1999). Models, laboratory studies, and observations have described the elevation phase of internal tide run up as taking the form of bottom-trapped boluses (e.g., Helfrich, 1992;Venayagamoorthy and Fringer, 2007;Bourgault et al., 2008). In general, our observations do show a smaller bottom-trapped solitary wave in front of the elevation bore (Figure 4.16). The appearance of warmer water underneath this feature shows a region of trapped cold fluid being transported within it. Bolus shapes are quantified by their aspect ratio (Bourgault et al., 2008) but the features observed here have smaller aspect ratios compared to those observed in estuaries or the laboratory. From our mooring array, it is an open question whether or not these solitary features are the last of a train of elevation waves to be engulfed by the larger gravity current or if they are being generated from the gravity current itself as it undergoes criticality adjustments (analogous to the adjustment of a river plume to the tides, generating internal waves (Nash and Moum, 2005)). The lifted nose indicative of the effect of bottom friction on elevation bores, has important consequences for the transport of nearshore material as evaluated by the Froude number ( Figure 13). While in general surface bores transport near-surface water and bottom-bores transport near-bottom material, they appear to have an imbalanced transport efficiency, perhaps because the surface gravity current flows are not reduced by friction in the same way that bottom bores are. In other locations, these surface bores were also noted for the stronger vertical shear and mixing potential that they produce (Walter et al., 2012)."}, {"section_title": "Figures and tables", "text": ""}, {"section_title": "Summary of Results", "text": "This work documents summertime tidal-band and high-frequency internal wave variability on the Oregon inner shelf. Throughout this region of varying background stratification and complex along-shelf topography, internal wave events were found to be present throughout the summer as the inner shelf remains stratified to support them. Semidiurnal baroclinic variability is dominated by the lowest modes at both mid-and inner-shelf moorings and is not correlated between mooring locations or with the spring-neap cycle. However, there are periods lasting many days where internal oscillations remain coherent with the surface tide. The magnitude of an internal tidal wave event is related to the strength of stratification, with stronger events during upwelling relaxation periods with increased stratification. On the mid-shelf sites, baroclinic currents are larger than the inner shelf and more consistent with progressive rotational waves. The three-dimensionality of Heceta-Stonewall Bank creates wave sources from both the north and southwest, and patterns of spatial-temporal variability of baroclinic fields can be explained by a simple, amplitude-modulated model of two incoming internal waves. The leading edges of an internal tide on the inner shelf are characterized by a region of high vertical velocity which is measureable by bottom-mounted Acoustic Doppler Current Profilers and mid-water column temperature measurements. These highly nonlinear, borelike features are also visible as a region of increased pixel intensity in optical remote sensing during wind speeds between 2 -5 m s −1 (Chapter 3). Average wave behavior shows these internal waves to be refracted by bathymetry with measured wave speeds higher than predicted by linear theory. We have also observed some general relationship between tidal-band and low frequency processes on the observed inner-shelf, high-frequency internal wave field. On the inner shelf, both bore-like waves of elevation and depression are observed. The coefficient of nonlinearity changes sign over an internal tidal cycle on the inner shelf, while on the mid-shelf it remains depression-wave favorable (α < 0). The cross-shelf transport of subthermocline water is most efficient during periods of elevation-wave dominated transports on the inner shelf because depression waves partly remove cold water from the inner shelf. The transition from periods with both depression and elevation waves, to periods with elevation waves only is initiated by a combination of mid-shelf controls on pycnocline depth and incoming internal tidal amplitude."}, {"section_title": "Implications for other fields", "text": "With this understanding of internal waves on the inner shelf, there are a variety of implications to fields outside of physical oceanography. Long-term oceanographic monitoring often requires lower-power, lower-resolution sensors to remain cost-effective. Though detailed physics of high-frequency internal bores are not captured, we find that lowerresolution sensors can capture much of the variability. Monitoring with only temperaturechains, a cheaper alternative than deploying ADCPs can potentially capture many aspects of internal tides in shallow water. Depending on the location of nodes and antinodes along the coast, oscillations in displacement and velocity might not align. However in simple locations and if a baseline characterization of the relation between the displacement and velocity oscillations can be deciphered and is deterministic, a simple and cost-effective design could provide long-term monitoring. As both periods of strong and weak internal activity can be present, these long-term measurements are necessary to accurately characterize these processes. Finally, we evaluated the capability of optical remote sensing to monitor for inner-shelf internal waves without an in situ presence. Though it potentially produces large volumes of data, we find observations with a subset of optical pixels (pixel time series) can effectively capture the surface signature of internal waves though more work will be needed to adequately derive individual wave properties from this method. Additionally, we estimate only 10% of observable waves (not cloudy, or night time) are observed by optical remote sensing. Shoaling internal waves have been implicated in the transport and dispersion of a variety of larvae of planktonic invertebrates and increasingly, hypoxic bottom water. These are critical to healthy coastal ecosystems. The observed high-nonlinearity of these physical processes further justifies their implication. However, not all internal waves, or internal tides for that matter are created equal. Arrival timing and magnitude of internal tides greatly depends on lower-frequency background variability and details of stratification in the regions of wave generation, propagation, and dissipation. Open coastline wave systems behave differently than closed embayments and the details of topography, regions of wave breaking, and wave polarity all play a role in determining the effectiveness of wave-driven transport. A main theme throughout this work has been to consider internal wave processes in relation to background variables. Though in some cases internal tides were reasonably modeled by a hydrostatic regional ROMS model, high-frequency waves are a sub-grid process that is necessarily parameterized within the model. Though in some ways this work has painted a complicated picture which includes many interactions among various frequency bands, I hope that it can inform some of the parameterization efforts for future numerical modeling as the successes of numerical models indicate the scientific community's state-ofthe-art understanding of physical processes and represent a way to make forecast/predictive estimates. Numerical models are also an essential method for understanding the ocean as observational data will never be able to compete with the full 4-dimensional, space-time resolution of a numerical model."}, {"section_title": "Future work", "text": "Additional observations would complement this work to further understand the dynamics of the internal surfzone. During the summer, it appears that the important polarity switch occurs onshore of 85-m, but offshore of 20-m. Future studies should consider a mooring deployment between these two water depths. With the additional capabilities of realtime ocean observing, and relatively slow internal wave propagation speeds, we envision an adaptive sampling study with devoted instrumentation. The registering of a significant wave event within data transmitted from an offshore mooring could signal the deployment of multiple research vessels to track wave packets across the shelf. Documentation of the seasonality of the nonlinearity parameter from repeat sections across the shelf collected by an autonomous underwater glider program would also increase our understanding of internal wave transformation. Locations to the north and south of Heceta Bank appear to have higher baroclinic energy and should be targeted for future study. While we have focused on measurements from the shelf where the slope is about 0.005, regions to the north and south are steeper and would provide a useful contrast. Additionally, there appears to be some analogy between the surface and internal Irribarren number determining the form of the breaking wave. These measurements, along with those from other regions that have a greater range of stratification and incoming internal tide energies would further validate the surfzone analogy. There is much room to include the use of optical remote sensing for stratified innershelf processes that have clear surface expressions. One of the Argus-tracked internal waves was a wave of elevation. In this case, the surface convergence leading to successful optical remote sensing is located on the trailing edge of the internal wave. Details of convergences due to currents directed away from shore, as opposed to the more common surface currents directed towards shore, in the direction of wave propagation, deserves further study. Some internal wave surface signatures also remain visible to the edge of the surf zone, where the interaction of these features with surf-zone processes can be investigated. In addition to internal wave surface signatures, freshwater intrusions or surface topographic fronts can also be studied with shore-based video remote sensing. The large archive of summertime inner-shelf data collected by the PISCO program (see Chapter 2) also contains information on the HFIW field at these locations. Efforts are underway to analyze these data with regards to the HFIW field as well as to construct indices of internal wave activity to compare to recruitment time series of intertidal invertebrates. Finally, the efforts to model these processes with nonlinear, non-hydrostatic models should continue to expand. Transformation processes need to be accurately reproduced including the transformation from wave packets to polarity switches, to bores and eventual shallow-water run up. The decreased role of Coriolis forcing also appears be an important transformation as tidal-band waves propagate across the shelf. High-resolution numerical modeling is well suited to study the full 3-dimensionality of internal waves and the instabilities that govern their eventual decay."}]