[{"section_title": "", "text": "Severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) was first discovered as etiologic 37 agent of Coronavirus Disease 2019 in the city of Wuhan, Hubei providence, China by the end 38 of December of 2020 (1) , and is the seventh coronavirus known to infect humans and also to be 39 transmitted from human to human. The four seasonal coronaviruses (HKU1, NL63, OC43 and 229E) are 40 associated with mild symptoms, whereas SARS-CoV, MERS-CoV and SARS-CoV-2 can cause severe acute 41 respiratory disease (2,3). SARS-CoV-2 belongs to the betacoronavirus genus and is an enveloped, single-42 4\nThe aim of our current study was to develop and then evaluate the analytical sensitivity and 58 clinical performance of an efficient and cost effective laboratory-developed test (LDT) on the 7500 Fast 59 Dx real time PCR instrument. To that end, we developed an LDT that targets the S gene of SARS-CoV-2 and 60 compared it's clinical performance to the modified CDC assay for the detection of SARS-CoV-2 in 61 nasopharyngeal (NP) specimens from individuals suspected of potentially having COVID-19. 62 6 volume was 110 µl. In order to monitor the extraction process, a Negative Extraction Control was included 87 in each extraction run. In the present study, a multiplex real time RT-PCR assay was developed and validated for SARS-167\nCoV-2 specific detection in NP specimens on the 7500 Fast Dx real time PCR instrument. 168\nThe findings demonstrate that our LDT design has comparable clinical performance for the specific 169 detection of SARS-CoV-2 RNA in NP specimens and is more efficient and cost effective in comparison to 170 the modified CDC assay. Our LDT also showed significant advantages over the modified CDC assay, since 171 only one set of primer and probe Master Mix is required to prepare and dispense per specimen, in contrast 172 to three sets of Master Mix preparation and the use of three wells for each patient specimen by the 173 modified CDC assay. Our multiplex design allows us to run 91 patients per plate, versus a maximum of 29 174 patients per plate on the modified CDC assay. Overall, this allows us to run more than 3 times as many 175 patients per run and also adds to the ease of setting up each run. Additionally, the saving of reagents and 176 consumables is another advantage at a stage where there are currently global shortages of reagents and 177 major assay supply chain issues. 178\nThe design of the primers and probe for our LDT is based on multiple sequence alignment of all 179 SARS-CoV-2 genome sequences that were available between January 11 and February 27 of 2020. Since 180 RNA viruses are well known for its high mutation and recombination rates (11), we wanted to confirm 181 that there were no significant new mutations of the region of S gene of SARS-CoV-2 that is the target in 182 our assay that could potentially affect assay performance. To this end, we analyzed an additional 140 183 SARS-CoV-2 genome sequences uploaded after February 27, 2020 to GenBank and the GISAID database 184 from different countries and performed an alignment with Clustal Omega. This alignment showed that 185 the forward primer and probe are conserved (with 100% homology) to the S gene target regions of the before and after late Febuary. This one mismatch is questionable, since it is not in keeping with the other 189 sequences available and the databases are not curated, and therefore occasionally contain errors. 190"}, {"section_title": "Limitations of our study include that our LDT is a single site evaluation at Northwell Health 191", "text": "Laboratories. In addition, we only use a single target gene for SARS-CoV-2 detection. While there has been 192 a trend toward dual-target design in commercial assay for the detection of pathogens (8, 12) "}]