[{"section_title": "Abstract", "text": "An early manifestation of atypical social-emotional development is the occurrence of challenging behaviors. While some challenging behaviors dissipate during and following the early years, others persist and even escalate, marking increasingly problematic developmental trajectories, school failure, and social maladjustment. Increasing attention has begun to focus on the early identification and prevention of challenging behaviors and on strategies for resolving such behaviors at their earliest appearance. In this article, the authors discuss what is known about challenging behaviors in the repertoires of toddlers and preschoolers, and present a model of prevention and intervention. Although research in this area is limited, there are encouraging signs that a coordinated adoption of validated practices could substantially reduce challenging behaviors and thereby enhance the social and emotional well-being of children in today's society. Key words: behavior problems, positive behavior support, social competence, social-emotional development F OR most young children, the developmental tasks of acquiring emotional and behavioral self-regulation and social competence proceed smoothly. However, significant numbers of toddlers and preschoolers exhibit behaviors severe enough to cause concern to parents, teachers, and other caregivers. These are children whose challenging behaviors jeopardize their care and preschool placements, disrupt family functioning, and affect their growth in social-emotional and other developmental domains. Recent research on the critical role of emotional and social well-being in school readiness and the negative trajec-"}, {"section_title": "", "text": "tories of early problem behavior has led to a national focus on the importance of providing prevention and intervention services to young children with challenging behavior and their families (New Freedom Commission on Mental Health, 2003; Shonkoff & Phillips, 2000) . One promising result of this concern has been the emergence of a number of new initiatives to enhance knowledge and practical competencies relevant to challenging behavior in young children. * The pace at which early social and emotional development proceeds can be highly individual and episodic and is influenced by both intrachild factors, such as temperament, and the physical and social environments surrounding the child. Many children pass through stages during which they exhibit fussiness, withdrawal, anxiety, overactivity, * Two national, federally funded initiatives are as follows:\n(1) Center for Evidence-based Practice: Young Children with Challenging Behavior, funded by the Office of Special Education Programs (OSEP), US Department of Education, www.challengingbehavior.org, and (2) the Center of the Social and Emotional Foundations of Early Learning, funded by the Administration for Children, Youth and Families, Head Start Bureau and Child Care Bureau, http://csefel.uiuc.edu. disobedience, tantrums, and even aggression, but for most children these difficulties are situation specific and transitory. It is the persistence, intensity, and pervasiveness of such behaviors that determine their seriousness and the need for intervention. Smith and Fox (2003) define challenging behavior in young children as \"any repeated pattern of behavior, or perception of behavior, that interferes with or is at risk of interfering with optimal learning or engagement in prosocial interactions with peers and adults.\" Such behavior most often takes the form of disrupted sleeping and eating routines, physical and verbal aggression, property destruction, severe tantrums, self-injury, noncompliance, and withdrawal. These authors note that, for young children, challenging behavior is always embedded in the context of child-caregiver relationships and interactions. Variations across families and cultures in perceptions of what constitutes appropriate and inappropriate behavior are also important considerations in defining challenging behavior (Division for Early Childhood, 1999 ).\nThe significant rates at which emotional and behavior problems occur in young children are now well documented, although specific estimates of prevalence rates vary depending on the sample and criteria used. In a review of prevalence studies, Campbell (1995) estimated that 10% to 15% of young children have mild to moderate behavior problems while, in a pediatric population, Lavigne et al. (1996) found that 21% of preschool children met the criteria for a diagnosable disorder, with 9% classified as severe. Data from the Early Childhood Longitudinal Study revealed that 10% of kindergarteners arrive at school with problematic behavior (West, Denton, & Germino-Hausken, 2000) . Children living in poverty appear to be especially vulnerable, exhibiting rates that are higher than that of the general population (Qi & Kaiser, 2003) .\nWhile some children who exhibit challenging behaviors at an early age \"out grow\" such behaviors before entering school, other children's problems continue and even intensify, leading to school failure and social maladjustment. For toddlers and preschoolers identified with clinical levels of disruptive disorders, 50% or more have been found to display problematical levels of challenging behaviors, both 4 years later and into the school years (Campbell, 1995; Lavigne et al., 1998; Shaw, Gilliom, & Giovannelli, 2000) . About 6% of all boys appear to follow an \"early starter\"or \"lifecourse-persistent\"developmental pathway for conduct problems characterized by violence and serious antisocial behavior in adolescence (Moffitt, Caspi, Dickson, Silva, & Stanton, 1996; Nagin & Tremblay, 1999) .\nIn addition to concerns regarding the enduring nature of young children's challenging behaviors, there has been an increased understanding of the interconnections between social-emotional development and children's cognitive development, acquisition of preacademic skills, and preparedness for school (Arnold et al., 1999; Espinosa, 2002; Peth-Pierce, 2000) . Self-confidence, relationship skills, self-management, and emotional and attentional self-regulation are among the social-emotional competencies necessary for successful participation in group learning situations (Thompson, 2002) . Moreover, preschool children with deficits in these critical social skills and those who exhibit challenging behavior are more likely to have language deficits than do their typically developing peers (Kaiser, Hancock, Cai, Foster, & Hester, 2000; Qi & Kaiser, 2003) .\nIn recognition of the need to intervene early to place young children back on the healthy developmental trajectories necessary for school success, a number of strategies and programs have been developed and demonstrated to prevent and ameliorate behavior challenges in young children. In this article, we present a model of prevention and intervention that focuses on supporting social competence and preventing challenging behavior through universal, targeted, and individualized interventions. Some key principles and considerations underlying services for young children with challenging behavior and their families are discussed, along with a range of intervention practices that have been demonstrated to be effective."}, {"section_title": "A MODEL OF PREVENTION AND INTERVENTION", "text": "The support triangle, presented in Figure 1 , builds upon a previously published graphic (Fox, Dunlap, Hemmeter, Joseph, & Strain, 2003) and provides a hierarchical framework encompassing 4 levels of prevention and intervention activities and practices that promote children's healthy social and emotional development within home and early education and care environments. This framework is based upon a public health model for prevention that includes 3 levels of intervention strategies, and that has been applied recently to the prevention of behavior problems in schools (Sugai et al., 2000; Walker et al., 1996) . In the public health model, universal or primary prevention strategies are applied to the general population in an effort to reduce the incidence of a problem before it occurs. Interventions at the secondary level target the population at risk for disease or harm, and tertiary interventions focus on individuals who have been affected by disease or harm. The support triangle presented in Figure 1 presents 4 levels of prevention and intervention services that address the needs of typically developing children, children at risk, and children with delays and behavior challenges.\nThe first 2 levels represent the supports needed by all young children to promote social and emotional competence and should be available universally, for all young children. At the most fundamental level, providing the base necessary for the strategies at the higher levels to be effective are positive relationships between children and their parents and teachers. It is within the context of these supportive relationships that the next level of preventive practices implemented in homes and classrooms serves to foster the development of social/emotional competencies. The third level denotes the broader and more specialized services and strategies targeted to young children who are at risk for challenging behavior. This top portion of the triangle represents the intensive services and supports needed by the small percentage of young children who display severe and persistent behavior challenges. This conceptualization echoes the work of others who have delineated the need for a continuum of interventions of differing intensities and focus to serve the needs of all young children (Forness, Kavale, MacMillan, Asarnow, & Duncan, 1996; Webster-Stratton & Taylor, 2001 )."}, {"section_title": "PREVENTION Positive relationships", "text": "Positive relationships form the foundation of the triangle. In their early years, children exist within a web of relationships among parents, teachers, other caring adults in their lives and, eventually, peers. This web supplies the context within which healthy social emotional growth and the capacity to form strong affirmative relationships with adults and peers develop. It nurtures resiliency variables that are demonstrated protective factors for young children (Huffman, Mehlinger, & Kerivan, 2000; Webster-Stratton & Taylor, 2001 ). Attachment; bonding; and trusting, affectionate relationships with caregivers during infancy and toddlerhood provide the basis for a healthy self-concept, confident exploration, and later positive relationships with peers and teachers (Thompson, 2001 )."}, {"section_title": "Home and family", "text": "Secure attachment is based on nurturing, emotionally sensitive interactions between children and their caregivers. Although such interactions occur naturally with most parents, there are some who do not display such responsiveness. Therefore, parenting information covering topics such as reading babies' emotional cues, realistic developmental expectations, and establishing consistent positive routines for feeding, sleeping, and soothing are increasingly being made available in settings designed to reach all parents, such as hospitals, pediatric offices, childcare, and other community settings. Parenting classes designed for parents of typically developing young children are another means of ensuring that parents have the knowledge and skills needed to provide the nurturing, positive care that promotes healthy development."}, {"section_title": "Child care settings", "text": "Within childcare settings, there are many practices that promote the formation of secure attachments and the development of strong positive relationships. Once again, adult-child interactions form the core of these strategies. Children in center-based care who receive more frequent sensitive interactions with adults have been shown to be both more securely attached to their caregivers and more competent in their interactions with peers (Kontos & Wilcox-Herzog, 1997) . Teachers who are warm and attentive, and who engage and encourage the children in their care, are both using and modeling qualities that build strong relationships (Edwards & Raikes, 2002) . Moreover, positive relationships between early educators and children provide a potent management tool for teachers. Children become eager to please, become eager for positive attention, and are more readily guided by teachers with whom they are emotionally invested."}, {"section_title": "Family-teacher relationships", "text": "Relationships between teachers and parents also play an important role in children's development. When staff in child care programs and parents form warm, respectful relationships, they are better able to communicate openly about children's behavior and experiences and to respond to children's individual needs. In the context of mutually supportive relationships, parents are more likely to share information about family and home situations and stressors, and about their child's development and behavior. They are also more likely to listen to and even seek the advice of child care staff regarding parenting, child management, and discipline issues when they feel connected to and supported by staff. In addition, child care staff will have greater opportunities to become familiar with and responsive to the culturally based values, beliefs, and child-rearing practices of families. The role of family involvement in defining high-quality child care is receiving increasing recognition along with efforts to articulate and explicate the concrete practices that contribute to relationship-building and family involvement. Staff practices include\n• spending time getting to know families,\n• welcoming parents to observe and participate in program activities,\n• consulting parents about their children's abilities, interests, and preferences, • routinely sharing information about children with parents, • valuing parent' sharing of concerns, • communicating in parents' home language, and • conducting home visits."}, {"section_title": "Prevention practices", "text": ""}, {"section_title": "Home prevention practices", "text": "In the home, the use of harsh, punitive discipline strategies is associated with the development of problem behaviors, and can lead to escalating cycles of coercive interaction between parents and children (Patterson, Reid, Jones, & Conger, 1975; Webster-Stratton & Taylor, 2001 ). Materials and instruction addressing the development of positive, consistent management strategies can assist parents in establishing routines that foster positive interactions and promote healthy social emotional development. Parents can encourage expression of positive emotions, empathy for others, emotional self-regulation, as well as friendship and social problem-solving skills in their young children through modeling and the ways they interact and discipline.\nFamilies may receive information on practices that will promote their child's healthy social-emotional development from healthcare professionals (eg, pediatrician, home healthcare visitor), other families or relatives, magazines, television, videotapes, parent manuals, and parent support groups. Topics that are included in anticipatory guidance range from understanding the child's development and changes in development to how to teach the child self-help skills (eg, eating, toileting) and supporting language development. In addition, healthcare professionals provide families with information (through consultation or literature) on parenting practices such as sleep routines, environmental safety, nutrition and feeding, toy selection, selecting quality early education and care providers, and other concerns of parents. All of these parenting topics have a relationship to supporting the development of children and minimizing the likelihood that the child will develop challenging behavior."}, {"section_title": "Classroom prevention practices", "text": "Within classrooms, early childhood teachers can make deliberate use of setting variables to prevent problem behavior and promote prosocial learning. Room arrangement, routines and schedules, and teacher-child interactions provide important opportunities for creating supportive environments and influencing the types of peer interactions that occur. The physical environment includes the layout and boundaries of learning centers, traffic patterns within the classroom, and the selection and display of materials and equipment. Well-designed classrooms should contain arrangements that both foster positive, creative interactions among children and provide comfortable, enclosed spaces for children to spend quiet time.\nClassroom schedules, routines, and activities also provide valuable tools for preventing the development and occurrence of problem behaviors. Schedules should include a balance of small and large group activities, child and teacher-directed activities, and structured and unstructured activities. Consistent schedules permit children to anticipate what will occur next and along with clear rules regarding classroom behavior and consistent consequences contribute to learning self-regulation skills. When transitions are clearly signaled and structured to minimize waiting time, opportunities for disruptive behavior are decreased. Children who are fully involved in classroom activities are less likely to engage in disruptive behavior. Activities that are varied, fun and creative, and planned to fit children's developmental levels and individual interests and needs contribute to children's positive engagement.\nTeachers can use their interactions with children in ways that promote positive behavior and prevent negative behavior. Contingent reactions such as ignoring minor inappropriate conduct and providing positive attention, encouragement, and praise for appropriate behavior are powerful tools for shaping behavior. Making sure directions are clear and understandable, as well as stated positively (inform the child what to do, rather than only what not to do), contribute to compliance. Finally, monitoring and redirecting children's behavior can often prevent problems from escalating."}, {"section_title": "INTERVENTION", "text": "The top 2 levels on the support triangle depict the more specialized and intensive interventions needed by children and families experiencing risk factors, children who are beginning to manifest problems, and children who have developed challenging behaviors.\nSocial and emotional learning strategies are specific tools that parents and teachers can use to teach prosocial skills and to intervene with incipient social-emotional problems with the goal of remediating problems before they escalate to more severe and intractable levels. These strategies are most often delivered through group approaches, applied to whole classrooms within preschool settings, and presented to parents in group formats. For the small percentage of young children with persistent delays and behaviors challenges, more intensive and individualized interventions are needed."}, {"section_title": "Parent-and family-focused interventions", "text": "Parenting education offered in group formats for families of young children has been shown to be effective in decreasing child behavior problems for children who are at risk of developing challenging behavior (WebsterStratton & Taylor, 2001 ). Parent training programs are based on cognitive social learning theory and share many commonalities in both content and methodology. They emphasize teaching skills to parents, such as giving effective instructions; contingent use of attention, praise, and rewards; setting reasonable and consistent limits; and use of logical and natural consequences and mild negative consequences such as time out. In addition, the curriculum may cover topics such as playing with young children and skills for encouraging and supporting children's acquisition and use of social skills. Typically, parents meet together in weekly sessions to view videotapes, roleplay, discuss the application of skills, problem solve, and receive assignments for practicing skills at home. The group format can also provide social support to help overcome the social isolation experienced by some high-risk families.\nA number of individualized parent and family intervention programs have been proven effective for families of young children who are already exhibiting more serious delays and disruptive behaviors (Raver, 2002; Reid, Webster-Stratton, & Baydar, 2004; WebsterStratton and Taylor, 2001 ). These programs teach many of the same content and skills that are taught in group parent training, but because the parents work one-on-one with an interventionist, often in the home rather than a clinic setting, the treatment is more individualized and intensive. Skills may be taught through modeling, role-play, and actual practice sessions in which parent and child interact while the interventionist observes and then provides feedback. The parent and interventionist typically spend time discussing, planning, and problem-solving ways of applying the skills that are individualized to the child's specific behaviors and the family's needs and situation. Because many of the participants in parent training programs are families experiencing multiple risks and stressors, the interventionist's role goes beyond that of teacher, to include coaching, mentoring, and motivating, and requires a high level of clinical skills as well as the ability to form supportive relationships with families on the basis of understanding and mutual respect. In the same vein, adjunctive components that address family issues and stressors have been found to add to the effectiveness of these models. These include interpersonal problem solving and communication training (Webster-Stratton, 1994) , addressing parental distress and depression (Wahler, Cartor, Gleischman, & Lambert, 1993) and teaching parents skills for playing with their child (Eyberg et al., 2001 )."}, {"section_title": "Social-emotional curricula", "text": "Social-emotional curricula for young children are designed to teach social skills and concomitantly to decrease children's problematic behaviors. While such curricula can be used as universal preventive measures for typically developing children, other curricula have been developed specifically for children at risk or for those who are exhibiting behavior challenges and have been implemented in Head Start classrooms and with small groups of identified children. Classroom teachers may be trained to implement the curriculum activities or therapists may administer the program. The content includes such topics as cooperative play and friendship skills, understanding and expressing emotions, empathy, self-calming and self-management skills, and problem solving in conflict situations. Teaching materials and techniques geared to engaging young children, such as stories, puppets, simple games, pictures and videotaped vignettes, role-play and dramatic play, and art activities, are used. Joseph and Strain (2003) evaluated efficacy data for a number of social-emotional curricular packages aimed at young children and, of the 8 curricula reviewed, found a high level of evidence for only 2 programs (Walker et al., 1998; WebsterStratton, 1990) , with lesser evidence supporting the effectiveness of the remaining programs."}, {"section_title": "Multicomponent interventions", "text": "Intervention packages utilizing combinations of parent-focused, teacher-focused, and child-focused components have also been developed and tested with young children. One of the most extensively researched is The Incredible Years Parent and Teachers Series developed by Carolyn Webster-Stratton. The group parenting component teaches positive parenting and discipline, methods for teaching and supporting children's prosocial skills, communicating with teachers, and stress coping skills. Similarly, the teacher training workshops focus on positive classroom management and discipline along with strategies for promoting children's social and problemsolving skills, and building relationships with parents. When used for children with oppositional defiant disorder, Head Start children, and toddlers in high-risk behavior problem groups, the program proved effective in reducing child conduct problems at home and school (Gross et al., 2003; Webster-Stratton, Reid, & Hammond, 2001 .\nWebster-Stratton has also developed a childfocused intervention, the Dina Dinosaur's Social Skills and Problem-Solving Curriculum, a social skills curriculum designed for use with small groups of young children identified with conduct problems (Webster-Stratton, 1990 ). The curriculum is delivered by trained therapists in a clinic setting and uses videotaped modeling, imaginary play with puppets, and other child-friendly methods to teach problem solving, friendship, anger control, and other skills. Combining the child curriculum with the Webster-Stratton parenting series was found to produce more significant improvements in home behavior than either component alone (Webster-Stratton & Hammond, 1997) . There also appeared to be added benefits to combining teacher training with child training (Webster-Stratton & Reid, 2003) ."}, {"section_title": "Children with persistent challenging behavior", "text": "When children have persistent challenging behavior that is not responsive to interventions at the previous levels (eg, preventive practices, social and emotional learning strategies), comprehensive interventions are developed to resolve the problem behavior and support the development of new skills. Positive Behavior Support (PBS) provides an approach to addressing problem behavior that is individually designed, can be applied within all natural environments, and is focused on supporting the child in developing new skills (Fox, Dunlap, Powell, 2002) .\nPBS offers a process for defining challenging behavior, understanding the factors that relate to the child's use of problem behavior, identifying the function or purpose of the behavior, and developing behavior support plans that result in an increase in the use of appropriate behavior and new skills (Fox, Dunlap, & Cushing, 2002; O'Neill et al., 1997) . A synthesis of the research on PBS applications with individuals with developmental disabilities provides important data on the efficacy and applicability of PBS (Carr et al., 1999) . In this review of 109 studies conducted from 1985-1996, the authors determined that 68% of the studies showed substantial reductions of problem behavior of 80% or more from baseline. Since that comprehensive literature review, there continues to be accumulating evidence on the effectiveness of PBS with a range of populations, including young children (Blair, Umbreit, & Bos, 1999; Dunlap & Fox, 1999; Frea & Hepburn, 1999; Galensky, Miltenberger, Stricker, & Garlinghouse, 2001; Moes & Frea, 2000; Reeve & Carr, 2000) .\nPBS is implemented by a team composed of the child's family, caregivers, and professionals who provide services to the child. The team is guided in the process by an early interventionist, mental health professional, behavior specialist, or other professional who is trained in the approach. Teaming is a fundamental component of PBS, as the behavior support plan that is developed will be used by all of the team members in all of the child's routines and activities. Each team member brings a unique perspective about the child and contributes knowledge to the development of a behavior support plan that can be implemented within the child's natural environments.\nThe team begins the PBS process by conducting a functional assessment. Functional assessment involves conducting observations and collecting information that lead to an understanding of the factors that relate to the child's engagement in challenging behavior. The functional assessment culminates in the development of hypotheses about the purpose or \"function\" of the child's problem behavior. Once the function of the behavior is identified, strategies can be developed to prevent the problem behavior from occurring and to teach the child new ways to communicate or get his or her needs met without using problem behavior. These strategies comprise the child's behavior support plan.\nA behavior support plan always includes the following components: hypotheses about the function of the problem behavior, prevention strategies to minimize the child's use of problem behavior, new skills that will be taught to the child to replace problem behavior, and responses to behavior that ensure that problem behavior will not be maintained. In addition, most behavior support plans will include long-term support strategies that will promote the child's social, emotional, and behavioral progress and access to a quality lifestyle. The final component that is essential for all behavior support plans is a process for measuring the outcomes of plan implementation. Outcome measurement may include changes in the problem behavior, changes in the use of appropriate communication or social skills, and/or changes in broader outcomes, such as family stress, child friendship development, or parenting satisfaction.\nOnce the behavior support plan is developed, the plan is implemented by the child's caregivers within the natural environment. In early education and care environments, the teaching staff implement the behavior support plan within the child's routine activities and play and the family implements the support plan at home. When the process is used within home intervention or home visiting programs, the behavior support plan is implemented by the family who may be taught or coached on how to implement the strategies (Dunlap & Fox, 1996) . Team members meet periodically to review the child's progress and to monitor plan implementation.\nAlthough the approach is still new, the use of PBS with young children and families is increasing rapidly. A number of resources are becoming available in print and via the Internet (eg, www.challengingbehavior.org), and data are accumulating that will help refine the approach and determine the parameters of its effectiveness. As knowledge is gained, it is likely that the development of increasing numbers of young children affected by challenging behavior can be rerouted toward a trajectory of social-emotional competence and readiness for school."}, {"section_title": "SUMMARY", "text": "The occurrence of challenging behaviors presents serious and deleterious implications for all aspects of young children's development. As awareness of these issues grows, it will be increasingly urgent that a systematic, evidence-based approach be promoted and adopted by teachers, care givers, and parents. In this article, we have described a framework that is designed as a strategic template for addressing challenging behaviors at primary, secondary, and tertiary levels of prevention. It is hoped that the framework serves as a functional heuristic for the further development of effective prevention and intervention strategies to address the challenging behaviors of young children."}]