[{"section_title": "", "text": "programs and/or community centers, which are facilitated by an adult, whereas the latter term refers to self-managed activities, which are determined by students. The current study focuses on the latter because these types of activities have greater variation in their potential effects on outcomes than do intended structured activities. In this study, we examine how self-managed activities are associated with academic achievement. Having knowledge of how students spend their after-school hours is also important for school practitioners and policymakers, as learning continues well after school hours (National Research Council, 2004). A recent report (Miller, Sen, & Malley, 2007) showed that U.S. schools spend a similar amount of time teaching mathematics to students as other G8 countries, but American students spend less time learning mathematics at home than their counterparts in those countries. However, the amount of time spent in at-home study is not necessarily related to higher achievement; time-efficiency is also important. The time devoted to studying is critical to improving achievement. Accepting the importance of out-of-school activities, the current study attempts to fill a research gap in several ways. First, many empirical studies provide useful information on adolescent out-of-school activities, yet there are very few comparative studies in the field. The current study selected South Korea for comparison with the United States for two reasons. The first of these is that both nations have recognized the importance of students' time use during after-school hours and have established governmental support for after-school programs. The U.S. government provides after-school programs to low-performing children in high poverty under the No Child Left Behind Act (NCLB) of 2001, a reauthorization of the Elementary and Secondary Education Act of 1965(U.S. Department of Education, 2009. South Korea also supports various after-school programs. In 2000, the Korean government initiated its 5 school days policy (i.e., no school on Saturday), giving rise to considerable conflicts among stakeholders, especially parents. To minimize such conflicts, the Korean government began more actively supporting after-school activities and eventually the 5 school days policy spread from the major cities to areas across the nation (Ministry of Education & Human Resources, 2006). The second reason for our comparison of out-of-school activities in the United States and South Korea is that in both countries student achievement and safety are important concerns (U.S. Department of Education, 2000). In this comparison, South Korea has advantages over the U.S. in terms of higher achievement and lower levels of problem student behaviors. South Korea has been one of the high-performing countries in multiple international assessments (Gonzales, Williams, Jocelyn, Roey, Kastberg, & Brenwald, 2008;Mullis, Martin, Gonzalez, & Chrostowski, 2004;OECD, 2004). In addition, Korea has lower levels of observed problem student behaviors than the U.S. (Akiba & Han, 2007;Akiba, LeTendre, Baker, & Goesling, 2002). The second way in which our study addresses a research gap is that, although past studies have focused mainly on structured activities, this study examines students' self-managed activities, whose potential effects vary by student characteristics such as gender and achievement level. In particular, we are concerned with students' home resources and parents' education level as strong predictors of involvement in specific out-of-school activities; we used these two factors as control variables. By doing so, we can assess how students' self-managed after-school hours are associated with achievement, without regard to their family background. Finally, very few studies have utilized large samples to compare out-of-school activities across nations. By analyzing nationally representative data in the U.S. and South Korea, this study yields compelling results for the two nations. The present study examined three major research questions: 1. How much time do American and South Korean students spend in out-of-school activities? 2. Are there differences in out-of-school activities by student characteristics (gender and achievement level) within and between the nations? 3. How are out-of-school activities related to achievement after controlling for student home resources and parent education level? Do the associations differ by gender and achievement level across nations?"}, {"section_title": "Literature Review", "text": "Empirical studies have shown that patterns of time use are significantly related to students' academic achievement and to their behavioral and cognitive development (Valentine, Cooper, Bettencourt, & DuBois, 2002). Appropriate time management for students is necessary to raise achievement and to help students become well-rounded individuals (Larson, 2001). To better understand previous research on out-of-school activities, this section addresses (a) measures of students' out-ofschool activities and (b) patterns of out-of-school activities and factors associated with time spent in specific out-of-school activities in the U.S. and South Korea."}, {"section_title": "Measures of Adolescents' A ctivities", "text": "Many researchers have measured student activities by conducting interviews and/or having the children complete time diaries (Larson & Verma, 1999;Meeks & Mauldin, 1990;Powell et al., 2002). When researchers use surveys, they usually ask students to indicate time spent on each given activity according to a Likert scale, with items such as less than 1 hour a day through more than 4 hours a day or ask students to fill in the amount of time spent on each activity (Anderson, Wilson, & Fielding, 1988;Gross, 2004;Warren, LePore, & Mare, 2000). Some researchers have used students' self-reports about their time use (Anderson et al., 1988;Lee & Larson, 2000); others have collected data from parents as well (Meeks & Mauldin, 1990;Powell et al., 2002). The classification of student activities is inconsistent by researchers. Some researchers have based their classification on the degree to which activities are systematic and structured. Some studies have designated watching television, doing household labor, doing paid jobs, doing school work (homework), and playing sports as structured activities (Larson & Verma, 1999); others have described sleeping, eating, washing, and dressing as unstructured activities (Anderson et al., 1988;Meeks & Mauldin, 1990). Dotterer, McHale, and Croutr (2007) defined structured activities as learning-oriented activities (e.g., doing homework and playing sports) and unstructured activities as other activities (e.g., watching television and playing with friends). Some researchers have classified activities as literacy-oriented (e.g., going to the library and reading books) and nonliteracy-oriented (e.g., shopping, playing, and religious activities; Powell et al., 2002). In addition, researchers have distinguished students' time devotion to activities by weekdays and weekends (Meeks & Mauldin, 1990)."}, {"section_title": "Empirical Studies of Out-of-School Activities in the United Sates", "text": "Researchers have examined how adolescents spend their time; how their time devotion differs by demographic characteristics; and how these differences affect various outcomes. Prior studies showed gender differences in students' patterns of out-of-school activities (Gross, 2004;Huston, Wright, Marquis, & Green, 1999;Meeks & Mauldin, 1990). Meeks and Mauldin (1990), using data from children ages 6 to 16, found that female children are more likely to spend their time in socializing activities, whereas male children are more likely to spend their time playing sports and games and watching television. Based on data from more than 200 young children ages 3 or 4 years, Huston et al. (1999) found that girls were more involved in art or music, whereas boys spent more time in watching television and playing PC games. Even when children devote similar amounts of time to the same activities, the specific patterns of involvement have been found to be different by gender. Gross (2004), using samples from 261 students in 7th and 10th grades, found no significant gender differences in time spent using the Internet, but did find differences in the types of Internet usage: Male students spent more time playing computer games than female students. In addition, such gender differences persisted as children aged. As they mature, female students spend more time reading and participating in clubs, whereas male students increase their time spent playing sports (Hofferth & Sandberg, 2001). Previous studies have shown that students of different socioeconomic status (SES) levels spend time in different ways (Crosnoe & Trinitapoli, 2008;Hofferth & Sandberg, 2001). Using longitudinal data from a representative sample to examine the effects of income on student activities, Crosnoe and Trinitapoli (2008) found that students in affluent families are more likely to spend time with their family in activities outside the home (e.g., playing sports, going to the theater and the zoo), whereas their counterparts in economically disadvantaged families are more likely to be involved in educational activities (e.g., reading, doing homework or school projects) at home. Hofferth and Sandberg (2001) used a sample of 3,563 American children ages birth to 12 to study the effects of parents' education levels on children's time use. They found that children who have more educated parents are more likely to spend time studying, reading, and doing housework, while spending less time watching television than do children of less-educated parents. In addition, children from high-income families also spend less time watching television, and no associations among parents' education level, income level, and children's involvement in playing sports were found (Hofferth & Sandberg, 2001). Literature has demonstrated that parents' education level and SES are strongly associated with students' choice of certain out-of-school activities. Previous studies have also explored how certain out-of-school activities are related to student academic achievement (Anderson et al., 1988;Cooper, Robinson, & Patall, 2006;Hofferth & Sandberg, 2001;Gross, 2004;Leone & Richards, 1989;Powell et al., 2002). It is well-established that reading books and doing homework have positive influences on achievement. In a survey of 401 adolescents in grades 5± 9, Leone and Richards (1989) found that the amount of time spent doing homework was positively correlated with the students' academic grade point average. Hofferth and Sandberg (2001) also found that reading for pleasure and having active leisure time have positive effects on achievement and cognitive tests. Powell et al. (2002) examined whether literacy-oriented activitiesÐ such as reading books and going to the libraryÐ have positive impacts on young children who are from low-income families and have less-educated mothers. They found that longer duration of time spent in such activities has a positive effect on school performance, but no such positive effect was found when students participate in multiple activities (Powell et al., 2002). Although positive relationships between reading and/or doing homework and achievement have been found, some studies have shown mixed results regarding this association. Anderson et al. (1988) reported that the amount of time spent reading books is the most strongly associated factor with reading achievement among fifth-grade students, whereas doing homework has no significant impact on reading proficiency (see also Cooper et al., 2006)."}, {"section_title": "Empirical Studies of Out-of-School Activities in South Korea", "text": "Korean researchers have examined the associations between students' time spent on out-of-school activities and academic achievement, social and psychological aspects, and various behavioral problems (Jung & Park, 2000;Kim, 2003;Kim & Jung, 2008;Lee, Kim, Hong, & Min, 2007;Yang, Oh, Kwon, Jun, & Cho, 2006). In Korea, particular interest in this field grew from increased rates of mothers' employment and active involvement in their own social activities, which affect the quality of adolescents' after-school activities (e.g., a lack of supervision; Kim, 2003). Interest also emerged because of the need for adolescents' selfmanagement of out-of-school hours as well as structured activities such as school or center-organized activities. Most Korean studies in the field have focused on after-school programs implemented by a school. Researchers define out-ofschool activities as all activities and/or programs not included in regular school curriculum or affiliated with other community centers (Jung & Park, 2000;Kim & Jung, 2008;Lee et al., 2007;Yang et al., 2006); this definition is differentiated from students' self-managed activities. One major recent reform in Korean education has been to provide various after-school programs to students by school teachers in school buildings or outside instructors from community facilities. The Korean government supports these programs by providing funds so that students can participate in after-school programs at relatively low costs. In response to such policy initiatives, empirical studies of students' time spent in after-school activities have also dramatically increased since 2000 (Lee, 2009). As a majority of the studies focusing on after-school activities in South Korea concentrate on activities held in schools or community centers, they should be differentiated from those in our study that focus on students' self-managed activities. We have selected the two most relevant empirical studies from the 2000s for review below. Although both studies were based on middle school students, Kim's (2003) study was conducted in Busan City (the second largest city in Korea) and Seo's (2007) study used national samples. Kim (2003) collected data from 454 students (and their mothers) in five middle schools in Busan City to examine the relationship between adolescents' after-school activities and problem behaviors (e.g., alcohol use, smoking, running away, sexual experience, physical fighting, theft, lack of attention in class, and disobedience to teachers), self-esteem, self-control, and mother monitoring. Categorizing 10 activities (studying, attending cram school, watching TV, reading, playing sports, playing PC games, electronic chatting, singing Karaoke, volunteering, and attending the theater), the researcher found that more than 40% of participating students spent less than 2 hours studying every day, about 70% of students attended a cram school every day, and more than 60% of students spent at least 2 hours in the cram school. In addition, the researcher found that about a quarter of participating students (24.9%) spent 1± 2 hours every day playing PC games and chatting. Around 21% of students responded that they spent less than 1 hour per day playing sports and reading (21.8% and 21.0%, respectively). Playing sports is not a common out-of-school activity for Korean students. Similar findings were found in a prior study; Jeon and Lees (2006) also found, based on data from 504 students at one middle school in Kyonggi province, that the majority of students (66.7%) did not participate in playing sports after school. Different patterns of students' activities were also observed across the range of students' family background. Kim (2003) observed different patterns of students' activities by their mothers' employment status and education level. Students with unemployed mothers tended to spend more time reading and less time PC gaming and chatting than their counterparts with employed mothers. Students with college-educated mothers tended to spend more time studying and attending cram schools than their counterparts whose mothers have a middle school (or below) education, and students in wealthy families (of greater than $1,500 income per month) were more likely to attend cram schools than their counterparts in families with less than $1,500 income per month. Regarding factors associated with students' after-school activities, Kim (2003) found that reading was a positive predictor and PC gaming/chatting was a negative predictor of academic self-esteem. Studying was a negative predictor and PC gaming/ chatting was a positive predictor of problem behavior among both boys and girls, and volunteering was a negative predictor of problem behaviors among boys. Seo (2007) analyzed data from 3,449 students in 104 middle schools from a national sample to examine the association between adolescents' leisure activities and their parents' income and education levels. The researcher categorized 14 activities (e.g., watching TV, listening to the radio, reading, using the Internet, playing PC games, participating in sports, participating in religious activities, pursuing hobbies) and assessed students' weekday and holiday time use separately. More than 50% of students responded that they watched TV, listened to the radio, and played PC games as leisure activities, whereas less than 10% of students responded that they spent time in outside hobby activities, chatting, or religious activities. In addition, students spent time playing PC games both on weekdays and holidays, whereas their choice of some activities differed by weekdays and holidays: Students spent more time watching TV, reading books (including magazines, newspapers, and comic books), and using cell phones on weekdays, while they devoted more time to hobbies, religious activities, and cultural activities (e.g., attending art museums and theaters) on holidays. Regarding the associations between students' activities and characteristics (e.g., gender, parents' years of education, income, and achievement measured as rank in classroom), the researcher found a positive correlation among reading, sleeping/rest, and parents' years of education as well as a positive correlation among cultural activities (e.g., art and music), hobbies, and parents' income level. In contrast, there is a negative correlation among watching TV/listening to the radio, PC gaming, and parents' years of education."}, {"section_title": "Rationale of the Study", "text": "According to the literature review, very few comparative studies have been conducted focusing on students' out-of-school activities and achievement using nationally representative data. Comparing the U.S. and South Korea, this study will offer new insights to educational practitioners in the two nations and help them advise students about desirable time use during after-school hours. The current study is distinguished from the previous studies in several respects. First, as researchers have indicated (Cooper et al., 2006), studies about time spent in specific activities should be conducted while controlling for potential influencing factors such as the economic or home resources of the family and parent education level. By holding the SES level and parent education level constant, the association between out-of-school activities and achievement can be explored in a more accurate way. Second, age is one of the stronger determinants of involvement in certain activities (Hofferth & Sandberg, 2001), but past studies have often combined data from different age groups such as: 15-through 18-year-olds in Barnes, Hoffman, Welte, Farrell, & Dintcheff's (2007) study; seventh-and ninth-grade students in Gross's (2004) study; 6-through 17-year-olds in Meeks and Mauldin's (1990) study; and birth to 12-year-olds in Hofferth and Sandberg's (2001) study. The present study uses national samples from the same age group (eighth-grade students) in the U.S. and Korea, providing more comparable results about the relationship between out-of-school activities and achievement. Third, this study classifies students as high and low achievers, allowing us to see whether these two groups have different patterns and relationships between achievement and involvement in specific out-of-school activities. Finally, using national samples, this study provides generalizable results that explain how student characteristics (e.g., high vs. low achievers and female vs. male students) shape patterns of involvement in out-of-school activities in the U.S. and South Korea. The current study will expand our knowledge in the field, and also help close a research gap in the literature by accounting more carefully for students' backgrounds."}, {"section_title": "Method Data", "text": "The current study used the Trends in International Mathematics and Science Study (TIMSS) 2003 data. The TIMSS data were collected by the International Association for the Evaluation of Educational Achievement (IEA) to assess students' mathematics and science achievement in the fourth and eighth grades in 47 nations. In addition to achievement scores, the TIMSS data also contain rich information about teaching and learning contexts, school life, and background information from school principals, teachers, and students. The TIMSS data employed a two-stage stratified cluster sample design: From a nationally representative school list, at least 150 schools were selected from each country, and two classes from each of the selected schools were chosen for the survey. The TIMSS 2003 data set, containing a variety of students' out-of-school activities based on national samples, is appropriate to our comparative study. In the present study, data from 8,912 American students and 5,309 Korean students were analyzed."}, {"section_title": "Variables", "text": "Students' Out-of-School Activities. In this study, we used nine primary out-of-school activities. Students were asked \"On a normal school day, how much time do you spend before or after school doing each of these things?\" The following activities were given: (a) watch television and videos, (b) play computer games, (c) play or talk with friends, (d) do jobs at home, (e) work at a paid job, (f) play sports, (g) read a book for enjoyment, (h) use the Internet, and (i) do homework. Students selected the amount of time for each of the activities from five choices: 1 = no time, 2 = less than 1 hour, 3 = 1± 2 hours, 4 = more than 2 but less than 4 hours, and 5 = 4 or more hours. In the analysis, the variables were recoded as 1 = 0, 2 = 0.5 hour, 3 = 1.5 hours, 4 = 3 hours, and 5 = 4 hours. We used all nine primary out-of-school activities that were provided by the TIMSS 2003 because, according to the literature (Kim, 2003;Paik, 2001;Seo, 2007;Stattin et al., 2005), those activities were the most common self-managed activities (as opposed to structured or organization-initiated activities) among adolescents. Home Resources. The home resources variable was created using total number of books (excluding magazines, newspapers, and school books) in the students' home. Students were asked to select one of five choices; 1 = 0± 10 books, 2 = 11± 25 books, 3 = 26± 100 books, 4 = 101± 200 books, and 5 = more than 200 books. Parent Education Level. Parent education level was assessed as the highest level of education of mother and father. This variable was categorized into one of five levels, ranging from (a) finished university or higher, (b) finished postsecondary vocational/technical education but not university, (c) finished upper secondary schooling, (d) finished lower secondary schooling, and (e) finished some primary or lower secondary or did not go to school. This variable was reverse-coded for the analyses. Achievement. Achievement was measured by obtaining the mean of five plausible mathematics test scores provided in the TIMSS data. To compare the pattern of activities between low and high achievers, we selected students who were within 10% of the top and bottom of the mathematics scores in each nation. High achievers were defined as the 891 American students who scored greater than 583.43 and the 531 Korean students who scored greater than 657.97. Low achievers were defined as the 891 American students who scored lower than 367.59 and the 530 Korean students who scored lower than 452.36."}, {"section_title": "Statistical Analysis", "text": "Descriptive statistics were performed to describe the various ways in which students spent their out-of-school time. To compare students' out-of-school activities by their background (e.g., gender and achievement), a one-way analysis of variance (ANOVA) was conducted. Effect sizes for the ANOVA were also calculated by using the equation (SSM/SST) .5 . To examine the relationships between adolescents' time devoted to out-of-school activities and mathematics achievement (controlling for the level of home resources and parent education level), multiple regressions were employed. Multiple regression allows us to explore the linear relationship between achievement and time devotion in out-of-school activities, and all variables in the models meet requirements for performing multiple regression; all independent variables (time devotion in out-of-school activities and student background variables) were measured on an ordinal scale and the dependent variable (mathematics achievement) was measured on a continuous scale. Regarding proper sample size for the regression analyses, at least 20 cases for each independent variable have been suggested (Dattalo, 2008;Tabachnick & Fidell, 2007) as desirable. In the multiple regression models with 11 independent variables, we analyzed 4,918 cases for Korea and 6,772 cases for the U.S. By gender, we analyzed 2,403 cases for Korean girls and 2,515 cases for Korean boys; 3,592 cases for American girls and 3,180 cases for American boys were analyzed in the multiple regression. By achievement level, 516 cases for Korean high achievers and 442 cases for Korean low achievers; 778 cases for American high achievers and 571 cases for American low achievers were analyzed in the multiple regression model. Detailed descriptive statistics for each sample can be found in Appendices A and B. The effect sizes for the multiple regression analyses were obtained by employing Friedman's formula (1968, p. 246;d = [2 (r)] / [(1 ± r 2 ) .5 ]). Finally, the current study adopted a weight calculation created by the TIMSS 2003 (for the specific weight calculation, see Martin, Mullis, & Chrostowski, 2004, pp. 200± 209). Using weighted data is critical to avoid underestimation of the sampling variance. TIMSS 2003 created sampling weights based on a three-step procedure at schools, classrooms (mostly mathematics classes), and student levels. A school weight and a school-level participation adjustment (the first step), a classroom weight and a classroom-level participation adjustment (the second step), and a student weight and a non-participation adjustment (the third step) were separately calculated to consider non participatedsamples at each level."}, {"section_title": "Results", "text": "Descriptive statistics showed students' hours spent in out-ofschool activities in the U.S. and South Korea. As Figure 1 indicates, watching television/videos, playing with friends, playing sports, and using the Internet were the out-of-school activities that American students spent a great deal of time pursuing; more than 2 hours were spent in television/videos and playing with friends during after-school hours. Similarly, Korean students also spent a great deal of time pursuing those activities, except for playing sports. Compared to Korean students, American students spent more hours in paid work (M = 0.53 vs. 0.07) and playing sports (M = 1.71 vs. 0.69). The allocation of student time to each activity by nation is presented as percentages in Figure 2. American and Korean students both spent approximately 35% of their nonschool time watching television and playing with friends. American students allocated about 22% of their time outside school to playing PC  games (8.2%) and using the Internet (13.8%), whereas Korean students spent more than 30% of their time in those activities (15.3% and 17.0%, respectively). American students spent more than 13% of their time in working at either home (9.1%) or paid jobs (4.2%), whereas Korean students spent less than 8% of their time in those activities (7.0% and 0.7%, respectively). Similarities and differences in time devotion to out-of-school activities are represented by gender in the two nations in Table  1. In both nations, male and female students allocated different amounts of time to each out-of-school activity (p < .001), except for working at home in the U.S. Male students spent more hours playing PC games than did female students in both the U.S. (M = 1.31 vs. 0.78, p < .001) and Korea (M = 1.79 vs. 1.14, p < .001). On the other hand, female students spent more hours in doing homework than did male students in the U.S. (M = 1.49 vs. 1.17, p < .001), and Korea (M = 1.16 vs. 0.99, p < .001). In addition, male students allocated more time to playing sports, working at paid jobs, and using the Internet than did female students in both nations. Although most observed differences between boys and girls were statistically significant, effect sizes were rather small; ranging from .04 (paid job) to .32 (playing sport) in Korea and .01 (job at home) to .21 (PC game) in the U.S. Table 2 presents different time use between high and low achievers in all out-of-school activities in Korea and some in the U.S. In the U.S., low achievers spent more hours in all out-ofschool activities except for reading books than did high achievers, although the differences were not statistically significant. In Korea, high-achievers spent more hours in reading books (M = .74 vs. .46, p < .001) and doing homework (M = 1.30 vs. 0.82, p < .001) than did low achievers, whereas high-and low-achieving students in the U.S. showed statistically insignificant differences in both reading books (M = .79 vs. .72) and doing homework (M = 1.41. vs. 1.42). Regarding differences between low and high achievers, small effect sizes were observed; ranged from .17 (playing with friends) to .39 (watching TV) in Korea and .01 (doing homework) to .35 (job at home) in the U.S.   Table 3 presents the results of multiple regressions about the associations between out-of-school activities and achievement in the two nations. In both nations, time spent in reading books was positively associated with achievement (p < .001), whereas watching TV, playing PC games, completing jobs at home, working a paid job, and using the Internet were negatively associated with achievement (p < .001), after controlling for the level of home resources and parent education level. Different associations by nation also emerged in the analysis. In Korea, playing with friends (p < .05, effect size = .01) and doing homework (p < .001, effect size = .25) are positively associated with achievement, but playing with friends (p < .001, effect size = -.22) and doing homework (p < .001, effect size = -.04) are negatively associated with achievement in the U.S. In addition, in the U.S., playing sports (p < .001, effect size = .02) is positively related to achievement, but playing sports (p < .001, effect size = -.17) is negatively associated with achievement in South Korea. Although the associations were observed as statistically significant, effect sizes were all fairly small. Another important finding is that home resources and parent education level were significantly and positively associated with achievement in both nations at the .001 level. That is, no matter how students devoted their time to specific intended activities, students who have higher level of home resources and have more educated parents tended to have higher achievement than their counterparts of lower level of home resources status and lesseducated parents. The proportions of variation in achievement explained by time devotion in different types of out-of-school activities and the two control variables were .28 in the Korean model and .27 in U.S. model. Table 4 indicates the relationships between out-of-school activities and achievement by gender. The results showed fairly consistent associations between out-of-school activities and achievement by gender in Korea, whereas three activities showed different associations by gender in the U.S.: playing sports (p < .001, effect size = .07) and using the Internet (p < .001, effect size = .03) were positively associated with achievement among American girls, whereas among American boys, playing sports (p < .001, effect size = -.07) and using the Internet (p < .001, effect size = -.01) were negatively associated with achievement. No gender differences were found in Korea in terms of the relationships between out-of-school activities and achievement, and gender differences in these associations were found in only two activities in the U.S. As shown, all associations were statistically significant, yet effect sizes among the associations were fairly small. R squared values presented that the proportion of variations explained by independent variables ranged from .26 to .30; 30% in the Korean girl model; 27% in the Korean boy model; 29% in the U.S. girl model; 26% in the U.S. boy model. Table 5 presents associations between students' out-of-school activities and achievement by achievement level (low and high achievers). In Korea, the associations by achievement level were relatively consistent, although contrasting relationships were Table 4 Relationships Between Hours Spent in Out-of-School Activities and Achievement by Gender   shown for two activities: playing with friends (high achiever: a negative association with effect size -.12; low achiever: a positive association with effect size -.21) and using the Internet (high achiever: positive but insignificant; low achiever: a negative association with effect size .17). In the U.S., contrasting relationships by achievement level were found for four activities: completing jobs at home (high achiever: a negative association with effect size -.17; low achiever: a positive association with effect size .07), playing sports (high achiever: a negative association with effect size -.22; low achiever: a positive association with effect size .06), reading books (high achiever: a positive association with effect size .05 ; low achiever: a negative association with effect size -.04), and doing homework (high achiever: a positive association with effect size .13; low achiever: a negative association with effect size -.24). Although all these associations were significant, the effect sizes were fairly small. Except for those activities, the associations were similar in the two nations. Another interesting finding in this analysis is that high achievers in both nations showed similar patterns of associations of outof-school activities with achievement, but lower achievers in the two nations showed fairly different relationships between achievement and out-of-school activities. Playing with friends, reading books, and doing homework were negative indicators in the U.S. but positive indicators in Korea; job at home and playing sports were positive indicators in the U.S. but negative indicators in Korea. Although statistically significant associations were observed in the multiple regression analyses, small amount of variance were explained by the model; the models have accounted for 4% to 9% of the variance in the independent variables; 7% in the Korean high achiever model; 9% in the Korean low achiever model; 6% in the U.S. high achiever model; 4% in the U.S. low achiever model."}, {"section_title": "Conclusion", "text": "Analyzing nationally representative data, this study sought to find the associations between students' time devotion to out-of-school activities and achievement in the U.S. and South Korea. We found similarities and differences in the patterns of students' out-of-school activities and their associations with academic achievement. Major findings with regards to each out-of-school activity follow."}, {"section_title": "Findings", "text": "Playing Sports. American students spend double the amount of time playing sports as their Korean counterparts (approximately 100 minutes vs. 40 minutes). Lower participation in sports among Korean students may have been reported for several reasons. These include a lack of youth sports programs and/or leisure facilities and/or a tight schedule for study. Eighth grade is when Korean students start to prepare for college entrance. Students who have private tutoring and/or attend cram schools following regular school hours may not have time for playing sports (Jeon & Lee, 2006). Most importantly, athletic activities are regarded in Korea as having few benefits to students' college entrance prospects. Overall, the association between playing sports and achievement is positive in the U.S., which is consistent with the literature (Hofferth & Sandberg, 2001;Taras, 2005), but it was negative among high achievers and male students in the U.S. Interestingly, in Korea, the associations between playing sports and achievement were fairly consistent (all negative associations) among all subgroups. Further research should be conducted concerning the reasons for different benefits from playing sports between U.S. (or among different subgroups) and Korean students. Using the Internet and Playing PC Games. Korean students spent 32.3% of their after-school hours using the Internet (17%) and playing PC games (15.3%). The high national level of Internet access has resulted in a majority of Korean households (79.8%) having Internet access (National Internet Development Agency of Korea, 2007). Thus, most students can easily reach the Internet at home and also at PC-Bang, which is a popular fee-for-use Internet facility. Adequate guidance in PC-Bang is unavailable and Internet content is accessible with no adult monitoring (Chee, 2006). According to a study conducted by the Information Culture Center of Korea, 11% of Korean adolescents who use the Internet exhibit addiction symptoms (Kim et al., 2006). Extensive Internet use and PC gaming can be harmful for students in terms of establishing sound social relationships and can negatively affect emotional development (Gross, 2004). Korean school practitioners and parents should advise students about appropriate time allocation for such activities. Reading Books and Doing Homework. Although reading books and doing homework were reported as positive activities for learning, the associations were not consistent across nations and subgroups. Overall, time devotion to homework is positively associated with achievement in Korea, but it is negatively associated with achievement in the U.S. The data used in the study do not provide more detailed information, such as types of homework. Homework can be assigned as various types, from reviewing the class materials, to integrating and/or creating concepts and knowledge (Cooper et al., 2006). The amount of time is not necessarily related to successful outcomes, as efficiency is another important factor in time use. According to our findings, in the U.S., only high achievers successfully use their time to complete their homework; low achievers may not efficiently use their time for their homework. Working in a Paid Job. Compared to Korean students, although effect sizes were small, American students allocate approximately six times more time to paid jobs than do their Korean counterparts (4.2% vs. 0.7%). Multiple regression analyses showed significant and negative associations between spending hours working at paid jobs and achievement. Some researchers have asserted that there is little evidence of negative associations between time spent working in a paid job and academic achievement among high school students (Warren et al., 2000). However, the association may be different among middle school students. American education practitioners should be aware of the needs of working students in their schools and endeavor to provide appropriate advice and assistance. Further studies should be conducted as to whether the time devoted to working is related to achievement differently based on a student's age. Home Resources and Parent Education Level. Although student family background characteristics were used as control variables in our analyses, we observed significant and positive associations among home resources, parent education level, and achievement. That is, no matter how students devote their after-school hours to intentional activities, students with higher level of home resources and more educated parents were more likely to have higher achievement. School practitioners and policy makers should be aware of this fact and should provide practical support for students in disadvantaged families."}, {"section_title": "Limitations of the Study", "text": "The study has several limitations. First, because the study used cross-sectional data, the causality among variables cannot be determined. Second, this study has limitations in its measures of several variables. We used self-managed activities only, thus attending after-school programs organized by a school or a cram school was not included; therefore, we have only an incomplete picture of how students spend their time outside of school. It is important to consider that many Korean students do attend cram schools and/or have private tutors (Chu, 2006;Kim, Yang, Kim, & Lee, 2001;Seo, 2002). Thus, the associations between Korean students' self-managed activities and achievement may be influenced by those other kinds of after-school programs. In addition, family structure, mother's employment status, why/how students get involved in specific activities, and whether parents and/or family members participated in such activities with students were found as potential factors on outcomes in the literature. However, those data were not available in TIMSS 2003."}, {"section_title": "Suggestions for Future Studies", "text": "First, longitudinal data analyses would be useful as the current study, based on cross-sectional data, does not establish causality between out-of-school time use and achievement. Second, the present study examined a variety of out-of-school activities in the U.S. and Korea, yet still there could be other types of activities, such as attending cram school or private tutoring in Korea. Future studies should collect data about various activities by asking students to list all of their activities beyond the given activities in the survey questionnaire. Third, parents and family members have responsibility for students' behavior during after-school hours. Future studies should include more family background variables such as number of siblings, two or single parents, level of parental involvement in out-of-school activities, and socioeconomic status that is measured by multiple items, such as income and parents' employment status or types of their profession or occupation.   Note. All activities were presented with hours spent per day."}]