[{"section_title": "Abstract", "text": "Historical observations of potential temperature (θ), salinity (S), and dissolved oxygen concentrations (O 2 ) in the tropical and subtropical North Atlantic (0-500 m; 0-40°N, 10-90°W) were examined to understand decadal-scale changes in O 2 in subtropical underwater (STUW). STUW is observed at four of the longest, sustained ocean biogeochemical and ecological time series stations, namely, the CArbon Retention In A show that STUW O 2 has decreased approximately 0.71, 0.28, and 0.37 μmol kg À1 yr À1 , respectively. No apparent change in STUW O 2 was observed at ESTOC over the course of the time series (1994)(1995)(1996)(1997)(1998)(1999)(2000)(2001)(2002)(2003)(2004)(2005)(2006)(2007)(2008)(2009)(2010)(2011)(2012)(2013). Ship observation data for the tropical and subtropical North Atlantic archived at NOAA National Oceanographic Data Center show that between 1980 and 2013, STUW O 2 (upper 300 m) declined 0.58 μmol kg À1 yr À1 in the southeastern Caribbean Sea (10-15°N, 60-70°W) and 0.68 μmol kg À1 yr À1 in the western subtropical North Atlantic (30-35°N, 60-65°W). A declining O 2 trend was not observed in the eastern subtropical North Atlantic (25-30°N, 15-20°W) over the same period. Most of the observed O 2 loss seems to result from shifts in ventilation associated with decreased wind-driven mixing and a slowing down of STUW formation rates, rather than changes in diffusive air-sea O 2 gas exchange or changes in the biological oceanography of the North Atlantic. Variability of STUW O 2 showed a significant relationship with the wintertime (January-March) Atlantic Multidecadal Oscillation index (AMO, R 2 = 0.32). During negative wintertime AMO years trade winds are typically stronger between 10°N and 30°N. These conditions stimulate the formation and ventilation of STUW. The decreasing trend in STUW O 2 in the three decades spanning 1980 through 2013 reflects the shift from a strongly negative wintertime AMO between the mid-1980s and mid-1990s to a positive wintertime AMO observed between the mid-1990s and 2013. These changes in STUW O 2 were captured by the CARIACO, BATS, and Hydrostation S time series stations. Sustained positive AMO conditions could lead to further deoxygenation in tropical and subtropical North Atlantic upper waters."}, {"section_title": "Introduction", "text": "The concentration of dissolved oxygen (O 2 ) in a water parcel at the ocean surface is a balance determined by air-sea gas exchange, vertical and horizontal diffusion and mixing, and by biological productivity and respiration processes [Emerson et al., 2004; Deutsch et al., 2005] . Vertical profiles of dissolved O 2 collected in the ocean interior over the last~50 years suggest that thermocline O 2 is decreasing globally at rates between 0.3 and 0.7 μmol kg À1 yr À1 [García et al., 1998; Emerson et al., 2001 Emerson et al., , 2004 Joos et al., 2003; Deutsch et al., 2005; Johnson and Gruber, 2007; Stendardo and Gruber, 2012; Stramma et al., 2008 Stramma et al., , 2012 Tanhua and Keeling, 2012; Emerson and Bushinsky, 2014, and others] . There are still large gaps in our understanding of how O 2 varies within middle-to low-latitude epipelagic water masses. In this study, we examine the mechanisms that control the O 2 inventory of North Atlantic subtropical underwater (STUW), a shallow (0 to~300 m), high-salinity (>36) water mass distributed across tropical and subtropical latitudes [Wust, 1964; O'Connor et al., 2005] . STUW is observed at four of the longest sustained ocean biogeochemical and ecological time series stations in the North Atlantic, namely, the CARIACO Ocean Time Series (10. 5°N Figure 1 ). We seek to determine whether these stations capture regional O 2 trends observed within STUW in historical hydrographic data. We also examine the causes of the decadal-scale variability observed in STUW O 2 since 1950.\nData collected over the last five decades show that oxygen minimum zones in the Atlantic and the Pacific Oceans have expanded, leading to habitat reduction for tropical pelagic fishes of up to 15% [Prince and Goodyear, 2006; Stramma et al., 2010 Stramma et al., , 2012 Prince et al., 2010; Ekau et al., 2010] . Further ecosystem compression from reduction of O 2 in eastern boundary current systems and in other pelagic ecosystem is expected as a result of increasing water column stratification, shifts in basin-wide circulation patterns, declines in thermocline ventilation rates, and rising average global temperatures [Keeling and García, 2002; Bopp et al., 2013; Frölicher et al., 2009; Meehl et al., 2007; Keeling et al., 2010] .\nTo adequately evaluate decadal-scale changes in oceanic O 2 pools, it is necessary to collect relatively good spatial coverage of O 2 profiles across ocean basins over several decades. Although the spatial density of O 2 observations obtained by hydrographic cruises and autonomous platforms such as profiling floats, moorings, and gliders has become more abundant since the 1950s, these measurements are not consistently accompanied by the biogeochemical observations (e.g., inorganic nutrients, dissolved organic matter, settling particulate organic matter, and primary productivity) needed for a comprehensive understanding of O 2 cycling in the ocean. Biogeochemical and ecological ocean time series stations sustained over several decades are the only platforms that have provided high-quality O 2 and other chemical, biological, and physical measurements needed for studying oceanic O 2 dynamics [Whitney et al., 2007; Church et al., 2013] . These observations, however, have limited spatial coverage because they are conducted at a fixed location. To put these O 2 measurements into a larger spatial context, we can use high-quality hydrographic measurements gathered in the global ocean since about 1950.\nIn this study we hypothesize that long-term changes are taking place in the O 2 of subtropical underwater (STUW) of the North Atlantic Ocean. Subtropical underwater forms in the surface eastern subtropical North Atlantic and spreads westward throughout the North Atlantic basin along the 26 σ θ isopycnal ( Figure 1 ). STUW plays an important role in the ocean-atmosphere heat exchange and hydrological cycle [Gu and Philander, 1997; Curry et al., 2003; Schott et al., 2004; O'Connor et al., 2005] . This is also the water mass observed in the upwelling along the southern Caribbean Sea and around the periphery of the Gulf of Mexico [e.g., Rueda-Roa and Muller-Karger, 2013; Muller-Karger et al., 1991] .\nSTUW forms as a high-salinity water in the central subtropical North Atlantic gyre (15-30°N, 25-55°W) and is later subducted into the upper pycnocline [Doney et al., 1998; Qu et al., 2013; Shcherbina et al., 2015] . Subduction rates are variable, but they are generally higher at the end of winter and early spring, when Global Biogeochemical Cycles 10.1002/2015GB005183 density of the water at the surface is highest. This process is unevenly distributed in space. The properties of this intermediate water mass are defined by its last contact with the atmosphere in the core of the high surface salinity region. Because of the relatively short residence time (<10 years) and high subduction rates of STUW, this water mass is a good index for observing potential changes in global climate [Shcherbina et al., 2015] .\nOnce subducted, STUW spreads laterally in the subtropical gyre. It reaches the North Atlantic western boundary current within 2 years, crossing the Caribbean Sea by the end of 5 years [Qu et al., 2013] . From there, most (~70%) of the subducted STUW turns northward as part of the Florida Current and the Gulf Stream and reaches the subpolar region in about 10 years. When it reaches the North Atlantic Deep Water formation region, it is again subducted and becomes part of the Atlantic Meridional Overturning Circulation [Qu et al., 2013] .\nWe examined recent multidecadal trends in STUW O 2 concentration using O 2 observations collected since 1955 at Hydrostation \"S\", and the early to mid-1990s at the CARIACO, BATS, and ESTOC time series stations, as well as discrete O 2 records collected by ships across the tropical and subtropical North Atlantic since the 1950. We used the results to better understand the mechanisms that drive the variability observed in North Atlantic STUW O 2 ."}, {"section_title": "Methods", "text": ""}, {"section_title": "Multiplatform Data Sets", "text": "Multiplatform (i.e., cruise discrete samples and CTD casts, autonomous profiling floats and drifters, gliders, and moored buoys) epipelagic and mesopelagic (0-500 m) observations of potential temperature (θ) and salinity (S) collected in the North Atlantic (0-40°N, 10-90°W) between 1900 and 2013 (103 years) were obtained from the National Oceanographic Data Center (World Ocean Database WOD13; National Oceanographic Data Center (NODC)-NOAA). Multiplatform θ and S observations were used for studying the spatial distribution of STUW. Shipboard discrete dissolved O 2 measurements (bottle data only) from the same region collected between 1911 and 2013 were also obtained from WOD13. The data included observations from the CARIACO and BATS programs (including Hydrostation \"S\" data). ESTOC data were obtained from the Plataforma Oceánica de Canarias. Locations of these time series stations are shown in Figure 1 .\nThe 1900-2013 WOD13 data set included 430,292 vertical profiles of θ and S (49% shipboard, 19% profiling floats, 14% gliders, 12% undulating oceanographic recorders, 6% moored buoys, and 1% bucket samples) and 98,522 bottle O 2 casts.\nTo study the average regional and vertical distributions of North Atlantic STUW and of STUW O 2 concentrations, we used the climatological objectively interpolated mean fields (1°× 1°) from the NODC's World Ocean Atlas (WOA09). The spatial domain of STUW was thus defined using the WOA09 climatology. Contour maps of these distributions were constructed using Ocean Data View [Schlitzer, 2012] . WOD13 and WOA09 data sets were further processed with MATLAB R2014b (Mathworks®)."}, {"section_title": "STUW O 2 Analyses", "text": "The North Atlantic STUW properties were defined according to Wust [1964] and O'Connor et al. [2005] and based on the range of variability of S and θ in waters with a potential density (σ θ ) between 25.6 and 26.3 kg m À3 (upper and lower STUW isopycnals) as measured at CARIACO, BATS, Hydrostation \"S\", and ESTOC ( The \"Mean\" is calculated from \"Range\" values, and the \"Observed Mean\" is calculated using all the data used in this study.\nGlobal Biogeochemical Cycles 10.1002/2015GB005183 higher exposure to solar radiation and precipitation. Climatological (WOA09 data) distributions of O 2 were examined by excluding all measurements in waters with properties outside those of STUW.\nTo understand how STUW O 2 has changed over time, WOD13 O 2 observations in waters with θ and S outside the limits of STUW (Table 1) were excluded from the analyses. WOD13 observations collected outside the climatological domain of North Atlantic STUW as defined by the climatological (WOA09) spatial distribution of STUW (see Figure 1 ) were also excluded. STUW O 2 observations were then binned horizontally at 1°× 1°a nd vertically within 10 m depth intervals. Binning the data at 0.1 kg m À3 density intervals yielded very similar results. The resulting data set included 186,880 O 2 measurements spanning 1911 to 2013 within the upper 500 m (Figure 3 ). Global Biogeochemical Cycles 10.1002/2015GB005183 NODC carries out rigorous data quality control on WOD13 data sets . In this study, only accepted values from WOD13 were used (flag values of zero). Further, data quality control was conducted on WOD13 observations used for STUW O 2 trend analyses, following the approach of Jenkins and Goldman [1985] . Specifically, quality control filtering of data in this study consisted in removing observations that deviated by more than 3σ from the long-term mean (e.g., 1911-2013) at each 10 m depth interval, from surface waters down to 500 m. Flagged data under this criteria represented~1.7% of the 1911-2013 (0-500 m) data set.\nThe vertical binning of WOD13 data allowed the assessment of temporal changes in O 2 over the entire domain of STUW by calculating monthly O 2 anomalies at individual depth horizons (10 m intervals) under the assumption that the age of the water mass at each depth horizon is similar at all sampled locations for a given year. Using this technique, we obtained time series of O 2 anomalies at individual depth layers with comparable time periods. We excluded data collected before 1950 from the analyses because of the very poor vertical and temporal (yearly) coverage ( Figure 3 ). Data collected before 1950 were often available only for small areas of the North Atlantic and thus would bias our results. We excluded data collected below 220 m, which also exhibited poor temporal coverage. O 2 measurements below this depth were collected in less than 30% of all years between 1950 and 2013 (64 years). Observations that met these criteria represented~0.9% of the 1911-2013 (upper 500 m) data set, and their exclusion resulted in a final data set composed by 185,231 STUW O 2 measurements were deseasonalized by subtracting the 1950-2013 monthly mean from observed values for the corresponding month at each depth horizons as follows: Mean annual STUW O 2 anomalies (AO 2 A) were then calculated for the entire domain of STUW and for specific subregions, by averaging all MO 2 A values for each year, using the following equation:\nwhere j is year and N is the number of MO 2 A values for the corresponding year. We also studied the AO 2 A and MO 2 A variability at time series stations in a similar fashion using climatological monthly values derived from the corresponding time series site (BATS: 1988 (BATS: -2011 Hydrostation \"S\": 1955 Hydrostation \"S\": -2013 CARIACO: 1996 CARIACO: -2013 and ESTOC: 1994-2013) . Unlike with WOD13 data, deseasonalization of O 2 measurements from these time series stations was not carried out using discrete depth layers because of limitations with sample size; the number of STUW O 2 observations at these sites is several orders of magnitude smaller than in WOD13 data sets. Instead, MO 2 A values from the four time series stations were calculated using a common climatological monthly mean value for the entire water column for the corresponding time series station.\nLinear O 2 trends were calculated for each of the time series stations and the selected subregions using least squares linear regression analysis. Time periods for linear regression analysis from time series stations were 1996-2013 for CARIACO, 1988-2011 for BATS, 1980-2013 for Hydrostation \"S\", and 1994-2013 for ESTOC. Specifically, we estimated linear O 2 trends over the 1980-2013 period within subregions of 5°× 5°using AO 2 A values from the western North Atlantic near the BATS and Hydrostation \"S\" stations and the eastern North Atlantic near the ESTOC station (i.e., BATS: 30-35°N, 60-65°W and ESTOC: 25-30°N, 15-20°W). The O 2 trend for this period was also calculated in a larger subregion in the southeastern Caribbean Sea near the CARIACO station (5°× 10°; 10-15°N, 60-70°W). We chose a larger area in the southeastern Caribbean Sea to compensate for the lower spatial and temporal data coverage in this subregion compared to the eastern and western North Atlantic subregions. The linear O 2 trend between 1980 and 2013 was also calculated for the entire domain of STUW."}, {"section_title": "Satellite Sea Surface Temperature Within STUW Formation Regions", "text": "Mean monthly and annual satellite sea surface temperature (SST) anomalies in the area of formation of STUW were examined to quantify possible SST trends over the last three decades (1982-2012 inclusive) . The areal extent of the formation region of STUW varied up to an order of magnitude between July-December and January-June periods [O'Connor et al., 2005] . We constructed time series of mean SST anomalies from spatially varying STUW formation regions defined using the WOA09 North Atlantic θ and S seasonal and annual objectively analyzed climatologies. WOA09 seasonal climatologies are based on mean fields calculated for January-March (winter), April-June (spring), July-September (summer), and October-December (fall) periods [see Locarnini et al., 2010] . The regions were defined by outlining the area of all locations (grid cells) where STUW was detected at the surface (0-10 m) using a 1°× 1°linear interpolation.\nSpecifically, a time series of daily SST observations spanning 1982 to 2012 (inclusive) was extracted from the Advanced Very High Resolution Radiometer Pathfinder version 5.2 (PFV5.2). These data were averaged into monthly mean periods. A monthly climatology was also computed. The nominal spatial resolution of these data is 4 × 4 km 2 per pixel. The data were obtained from the U.S. National Oceanographic Data Center Global Biogeochemical Cycles [Casey et al., 2010] . The PFV5.2 data set has a gap, from 2 October 1994 to 17 January 1995. Monthly SST values were deseasonalized by subtracting the climatological monthly value from the mean SST observed within the seasonal region of formation for the corresponding month. Linear trends of SST anomalies over time (months) were then calculated for each of the formation regions using least squares linear regression."}, {"section_title": "Climate Indices", "text": "The North Atlantic Oscillation (NAO) and the Atlantic Multidecadal Oscillation (AMO) climate indices were used since these are considered to be the dominant climate controls over the North Atlantic region [Hurrell, 1995 [Hurrell, , 1996 Visbeck et al., 1998; Marshall et al., 2001; Gruber et al., 2002; Johnson and Gruber, 2007; Schlesinger and Ramankutty, 1994; Kerr, 2000; Enfield et al., 2001] . To study possible relationships between STUW O 2 and climate forcing over the North Atlantic Ocean, we conducted cross-correlation analyses between the NAO and AMO indices and STUW O 2 anomalies using time lags spanning from 0 to 8 years.\nThe NAO index is a metric of sea level atmospheric pressure anomalies between the Azores High and the Icelandic Low pressure systems [Barnston and Livezey, 1987] . The AMO index is a multidecadal mode of variability of SST anomaly in the North Atlantic region (0-60°N) that oscillates with a period of 65-75 years [Schlesinger and Ramankutty, 1994; Kerr, 2000; Enfield et al., 2001] , although higher-frequency cycles of 20-40 years have also been reported [Goldenberg et al., 2001; Vincze and Janosi, 2011] . Periods of positive NAO index phase, which exhibit high trade winds and westerlies intensity, typically show colder-than-normal SST and therefore coincide with the negative AMO index phase [Enfield et al., 2001; Gruber, 2009; Visbeck et al., 2013] .\nMonthly NAO and AMO index data were retrieved from the NOAA National Centers for Environmental Prediction (NCEP). NCEP's NAO index values are normalized using the 1981-2010 base period monthly means and standard deviations."}, {"section_title": "Results", "text": "Average spatial and vertical distributions of STUW in the North Atlantic are shown in Figure 1 . STUW forms in the eastern subtropical North Atlantic at the surface to the southwest and northwest of the Canary Islands [also see Doney et al., 1998; Qu et al., 2013; Shcherbina et al., 2015] . STUW may also outcrop in the central subtropical North Atlantic and around Bermuda (see Figure 1 ). STUW sinks as it spreads to the western tropical North Atlantic including the Caribbean Sea, where it reaches average depths of~250-300 m west of Puerto Rico and around Cuba.\nThe O 2 in STUW follows a gradient, with highest concentrations (~230 μmol kg À1 ) in the area of water mass formation near the surface and lowest (~160 μmol kg À1 ) where it is deepest in the west (Figure 4 , top). This is consistent with cumulative apparent oxygen utilization (AOU), the result of remineralization of sinking organic matter as the water mass spreads across the Atlantic. STUW is also thickest (~80 to 100 m) in the eastern subtropical North Atlantic near the area of formation and thinnest (~10 to 20 m) south of 20°N (Figure 4 , middle). The total estimated STUW O 2 stock is~105 × 10 12 mol O 2 , with~80% of this distributed across the northeastern and northern portions of the North Atlantic subtropical gyre (20°-40°N, 10°-80°W; Figure 4 )."}, {"section_title": "Annual STUW O 2 Anomalies (AO 2 A)", "text": "Time series of AO 2 A computed using data collected at the CARIACO (1996 CARIACO ( -2013 , BATS (1988 ), and Hydrostation \"S\" (1980 showed negative linear trends (rates of À0.71, À0.28, and À0.37 μmol kg À1 yr À1 , respectively; Figure 5 and Table 2 ). The interannual variability of AO 2 A at CARIACO was higher than that observed at BATS and Hydrostation \"S\". AO 2 A at ESTOC did not show a trend.\nTo assess whether the observed trends in AO 2 A measured at the time series sites were comparable to changes at broader spatial scales, we examined historical WOD13 records for changes in AO 2 A across three larger regions in the North Atlantic ( Figure 6 ). Based on these AO 2 A observations, we found that STUW O 2 declined at a rate of À0.58 μmol kg À1 yr À1 in the southeastern Caribbean Sea (Region 1 in Figure 6 ) and À0.68 μmol kg À1 yr À1 in the western subtropical North Atlantic (Region 2) between 1980 and 2013 ( Global Biogeochemical Cycles"}, {"section_title": "10.1002/2015GB005183", "text": "Region 3, the eastern subtropical North Atlantic, over the same period. The rate of STUW O 2 loss calculated for the entire domain of STUW during the 1980-2013 period is À0.75 μmol kg À1 yr À1 , which is comparable to those from Regions 1 and 2 (Table 2) ."}, {"section_title": "SST Trends in the Formation Region of STUW", "text": "The climatological area of STUW formation in the eastern subtropical North Atlantic between~20°N and 30°N varies significantly between seasons (Figure 7, left column) . Specifically, the average surface area of STUW formation in the summer-fall period is~5.8 × 10 11 m 2 , and it grows to~2.4 × 10 12 m 2 during winter-spring. The difference between spring and summer formation regions is~1.8 × 10 12 m 2 , which is in good agreement with that derived by O'Connor et al. [2005] (1.7 × 10 12 m 2 ).\nIn terms of temperature, SST within the formation region of STUW increased at an average rate of~0.035°C yr À1 , or over 1°C, between November 1982 and December 2013 (Figure 7, right column) . This rate of : 1996 BATS: 1988 BATS: -2011 Hydrostation \"S\": 1980 Hydrostation \"S\": -2013 and ESTOC: 1994-2013) . Equations, coefficients of determination (R 2 ), and p values of all linear regressions are shown for each plot.\nGlobal Biogeochemical Cycles 10.1002/2015GB005183 increase was highest in summer (0.040°C yr À1 ) and lowest in winter (0.027°C yr À1 ). The mean STUW S also increased between 1980 and 2013, on average 0.063 salinity units (0.0019 yr À1 ). An increase in S is also observed at Hydrostation \"S\" and BATS over the course of these time series (Figure 2 ). This is consistent with the results from previous studies showing an increase in S in the subtropical North Atlantic over the last 50 years from increasing excess evaporation over precipitation, associated in turn with shifts in El Niño-Southern Oscillation and Pacific Decadal Oscillation conditions [Curry et al., 2003; Gordon and Giulivi, 2008] . A decreasing S trend, however, is observed in the CARIACO station that appears to be associated with increasing precipitation in the southern Caribbean [Lorenzoni, 2012] ."}, {"section_title": "Discussion", "text": ""}, {"section_title": "Variability of North Atlantic STUW O 2", "text": "The initial amount of O 2 within a particular water mass, also known as preformed oxygen (O 2 sat ), is mainly determined by thermodynamic equilibrium with the atmosphere when the water mass is at the surface. After subduction and mixing with other water masses, a water parcel may lose O 2 progressively along its circulation path. An important nonconservative process of O 2 loss in the ocean is respiration of organic matter. The amount of O 2 consumed by respiration, or AOU, is usually expressed as the difference between saturation and measured O 2 levels (AOU = O 2 sat À O 2 measured ); this property is modulated by physical (diffusion, circulation, and ventilation) and biological processes (productivity and respiration or remineralization) [Deutsch et al., 2005] . Changes in total O 2 in a water mass over time (ΔO 2 ) are therefore determined by changes in O 2 sat and AOU as\nThe extent to which ΔO 2 is impacted by changes in (1) Global Biogeochemical Cycles 10.1002/2015GB005183 been noted previously [Hurrell, 1995; Curry et al., 2003] and has been attributed to increased evaporation over the North Atlantic region. In this study we found that the mean STUW S has increased at 0.0019 year À1 between 1980 and 2013. The observed increase of~1°C in SST and 0.063 in S (using an estimated S increase rate of 0.0019 year À1 over a 33 year period) in the region of formation of STUW Global Biogeochemical Cycles 10.1002/2015GB005183 2013 (219.3 μmol kg À1 ). Increasing S and warming of STUW by~1°C in its region of formation should have led to a decline in O 2 solubility of~3 μmol kg À1 in the last 33 years Therefore, thermodynamic changes could only account for an~10% of the observed O 2 loss of~25 μmol kg À1 in STUW, at least over the period 1980 to 2013. If solubility does not appear to be a major driver in the loss of STUW O 2 since 1980, declining O 2 in this water mass over this period must therefore result from (1) increasing respiration rates within subsurface layers, (2) increasing accumulation of AOU below the surface due to slowdown of STUW formation and transport rates, or (3) decreasing wind-driven ventilation within and immediately below the mixed layer. The observed STUW O 2 loss, however, is likely the result of the combined effects of these processes.\nA steady increase in organic matter export rates over the STUW domain would have enhance O 2 removal proportionally by stimulating microbial respiration at depths below the mixed layer depth [Redfield, 1934] . However, sediment trap data from BATS [Lomas et al., 2010 and CARIACO [Taylor et al., 2012; Scranton et al., 2014] show that annual export production has not changed over the course of these time series, suggesting that respiration rates in the North Atlantic have remained constant since the late 1980s, under the assumption that export fluxes measured at these two time series stations are representative of the regional North Atlantic. Other studies based on observations and numerical models have also found that O 2 loss in the Atlantic and Pacific basins is mainly driven by physical processes rather than changes in respiration [Bopp et al., 2002; Keeling and García, 2002; Deutsch et al., 2005; Helm et al., 2011] . Thus, the observed O 2 decline between 1980 and 2013 is most likely the result of changes in physical forcing controlling STUW formation and transport rates and ventilation in the formation region and areas where STUW is within or near the base of the mixed layer (i.e., upper~100 m; see Figure 1 ). STUW formation and transport rates are the result of a complex interplay between wind-driven SST cooling and deepening of the mixed layer, air-sea fluxes (i.e., the balance between evaporation and precipitation), submesoscale (1-10 km) \"slumping\" of high-density water induced by baroclinic mixed layer instabilities, and large-scale circulation dynamics [O'Connor et al., 2005; Qu et al., 2013; Shcherbina et al., 2015] . High wind stress conditions in the formation region of STUW (eastern and central North Atlantic; see Figure 7 ), and thus high STUW outcropping and transport rates, should lead to less AOU buildup in STUW due to faster transit of the water mass across the basin; faster circulation should lead to less exposure of STUW to microbial respiration along its circulation path. The opposite is expected to occur during periods of low wind intensity, with lower outcropping of STUW and transport rates. Under these conditions, higher AOU accumulation rates are expected due to slower transport of STUW toward the west, and a negative O 2 trend would result in areas outside the formation region. Varying wind stress conditions also affect Global Biogeochemical Cycles 10.1002/2015GB005183 ventilation of subsurface STUW isopycnals (after subduction) in regions where STUW is within the mixed layer or immediately below it. STUW is a relatively shallow water mass and thus particularly sensitive to ventilation; STUW is present in the upper 100 m over~60% of its climatological domain (Figure 1 ). Periods of low wind stress conditions, and therefore poor ventilation of STUW, would also lead to accumulation of AOU and negative O 2 trends if these conditions were sustained over time. These two processes could, in part, explain the steeper negative trend detected at CARIACO, as compared to those from BATS and Hydrostation \"S\". STUW reaching CARIACO is older and probably carries a stronger AOU buildup signal than at the two sites near Bermuda.\nWe observed decadal-scale variability in STUW O 2 . In the North Atlantic, long-term air-sea fluxes of heat, salt, and buoyancy follow variability that can be tracked using the NAO and AMO indices [Hurrell, 1995 [Hurrell, , 1996 Visbeck et al., 1998; Marshall et al., 2001; Gruber et al., 2002; Goldenberg et al., 2001; Enfield et al., 2001; Vincze and Janosi, 2011] . O 2 inventories within North Atlantic mode water also follow shifts in the NAO index [i.e., Johnson and Gruber, 2007] . During the positive phase of the NAO, which corresponds to a high-pressure gradient between the Azores and Iceland pressure systems, westerly winds are stronger and are displaced northward of 45°N, and the trade winds are also more intense between 10°N and 30°N [Gruber, 2009; Visbeck et al., 2013] . This affects water mass formation and ventilation of mode waters, especially during winter months. Shifts in the NAO phase, however, affect wind patterns across the North Atlantic differently. For example, during a strong positive NAO phase, the thickness of Subtropical Mode Water (or 18°C water) is reduced due to smaller negative buoyancy fluxes at the ocean's surface resulting from anomalously high wintertime SST and reduced mixing in the western subtropical North Atlantic [Visbeck et al., 2013; Gruber et al., 2002] . The opposite occurs in the Labrador Sea [Visbeck et al., 2013] , where formation rates of Subpolar Mode Waters and O 2 inventories are positively correlated to the NAO phase [Johnson and Gruber, 2007; Stendardo and Gruber, 2012] . Increased wind strength and decreased SST in the tropical North Atlantic during positive NAO phases in turn stimulate subduction and ventilation of waters masses in this region [Marshall et al., 2001; Visbeck et al., 2013] .\nWe found a weak positive correlation (R 2 = 0.08; p < 0.05) between the mean annual NAO index and AO 2 A between 1950 and 2013 ( Figure 8 ). However, a significantly higher negative correlation (R 2 = 0.32; p < 0.01) between wintertime (January-March) AMO index and AO 2 A was observed for the entire domain of STUW and from observations at Hydrostation \"S\" (Figure 9 ). STUW O 2 values were below the climatological mean between 1950 and the early 1970s and after the mid-1990s, when wintertime AMO (NAO) was in a positive (neutral-negative) phase. They shifted above the climatological mean between the early 1980s and the mid-1990s, when wintertime AMO (NAO) was in a negative (positive) phase. AOU values showed the opposite pattern, with high values during the positive (negative) wintertime AMO (NAO) phase. During the wintertime AMOÀ (NAO+) phase, wintertime SST in the North Atlantic is colder than normal and the intensity of the trade winds is high [Cayan, 1992; Enfield et al., 2001; Marshall et al., 2001; Visbeck et al., 2013] . These conditions lead to increased STUW production and subduction rates in the eastern subtropical and tropical North Atlantic and thus lower AOU buildup in STUW if indeed export productions have remained constant during this period. Wintertime AMOÀ (NAO+) conditions also lead to higher O 2 concentrations within STUW as a result of increased gas solubility in surface waters and enhanced mixing and ventilation in both the formation region of STUW ( Figure 7) and in subsurface STUW isopycnals, i.e., where STUW is within or near the base of the mixed layer. The mean rate of change of STUW O 2 over the entire domain of this water mass calculated between 1980 and 2013 (À0.75 μmol kg À1 yr À1 ; Table 2 ) is consistent with previously reported thermocline O 2 declines in the North Atlantic and North Pacific basins of 0.3 and 0.7 μmol kg À1 yr À1 over the last 50 years [Whitney et al., 2007; Keeling et al., 2010; Stendardo and Gruber, 2012] . In particular, this O 2 loss rate is comparable to long-term O 2 declines of~0.3-0.5 μmol kg À1 yr À1 within mode and intermediate waters observed in the eastern and northern North Atlantic since 1960, which have also been attributed to NAO-driven changes in ventilation [Stendardo and Gruber, 2012] ."}, {"section_title": "Detection of STUW O 2 Trends at Time Series Stations", "text": "While negative trends in AO 2 A were detected at the BATS, Hydrostation \"S\", and CARIACO stations over the course of these time series, no apparent change in AO 2 A was observed at ESTOC ( Figure 5 ). ESTOC is located on the eastern edge of the STUW formation region (Figure 1) . The hydrography at the ESTOC site changes because this is at the edge of the North Atlantic gyre circulation, and therefore, the site alternatingly experiences the effects of the African upwelling system and the gyre, depending on season and interannual variations. In this study we found that STUW is observed at ESTOC only in summer and fall ( Figure 2 ) as a result of Global Biogeochemical Cycles 10.1002/2015GB005183 the seasonal increase in water column temperature. Due to the proximity of ESTOC to the formation region of STUW, variability in STUW O 2 at this site should be mainly controlled by in situ changes in air-ocean thermodynamic equilibrium and upper ocean turbulence. While STUW is at the surface, STUW O 2 should be near atmospheric equilibrium. Although SST has increased at 0.035°C yr À1 within the formation region of STUW since 1982 (Figure 7) , a sustained decline in STUW O 2 was not yet detectable using ESTOC observations. In part, this may be due to the lack of a clear positive trend in SST in this region since the onset of the ESTOC time series (1994), especially during spring, summer, and fall (Figure 7) . Furthermore, the absence of a declining trend in STUW O 2 at ESTOC could be due to the variability in the data, but also because ESTOC is at the edge of the STUW region of formation, and therefore, ESTOC is sporadically within the STUW formation region. The frequency of detection of STUW at ESTOC decreased from an average of 5.3 months yr À1 during 1994-2002 to 2.4 months yr À1 during 2003-2011, which is likely a data artifact resulting from decreased sampling frequency at ESTOC since 2004.\nInterannual variability in AO 2 A observed at CARIACO ( Figure 5 ) is in part due to changing upwelling conditions in the southeastern Caribbean Sea. In the southern Caribbean Sea, STUW shoals to the surface between January and April due to coastal upwelling. This upwelling injects nutrients into the euphotic zone and stimulates high rates of primary production, leading to rates of 350-600 g C m À2 yr À1 [Muller-Karger et al., 2001; Rueda-Roa and Muller-Karger, 2013; Muller-Karger et al., 2013] . The strength and duration of upwelling events, and thus the presence of STUW at or near the surface in this location, are controlled by the intensity of the trade winds and the intensity of the geostrophic Caribbean Current [Muller-Karger et al., 2001; Astor et al., 2003] . STUW O 2 levels at CARIACO are the result of the complex interaction between (1) local diffusive airocean gas exchange and upper ocean turbulence (ventilation when the STUW reaches the surface), (2) O 2 production by photosynthetic carbon fixation, and (3) respiration of sinking and suspended particulate and dissolved organic carbon. If primary production is balanced by respiration in the upper~100 m, STUW O 2 levels are then largely controlled by ventilation associated with changes in upwelling strength and vertical mixing. The changes observed in STUW O 2 at CARIACO are consistent with this mechanism, as weaker upwelling events would reduce the effective ventilation of this water mass. Indeed, between 1996 and 2003, when trade winds were strong (>6 m s À1 ) [Taylor et al., 2012] , there was a predominance of positive AO 2 A ( Figure 5 ). Since 2004, significant reductions in upwelling strength and in trade winds intensity occurred associated with a slight northward shift in the average position of the Intertropical Convergence Zone [Taylor et al., 2012; Scranton et al., 2014] . This period was characterized by the predominance of negative AO 2 A at CARIACO ( Figure 5 ). Overall, CARIACO data show that a STUW O 2 loss (À0.71 μmol kg À1 yr À1 ) is~18% higher than that measured regionally (Region 1; À0.58 μmol kg À1 yr À1 ) and slightly lower than that for the total STUW trends (À0.75 μmol kg À1 yr À1 ). A lower STUW O 2 loss trend in the regional southern Caribbean region compared to that in the entire STUW domain is likely due to the periodic local ventilation of STUW induced by upwelling, which also leads to an increase in O 2 due to photosynthesis near the surface. STUW O 2 in Region 1 includes the southeastern Caribbean, which undergoes seasonal upwelling [Rueda-Roa and Muller-Karger, 2013].\nThe loss rate of STUW O 2 at Hydrostation \"S\" also tracks shifts in the wintertime AMO (Figure 9) . O 2 loss rates at BATS, Hydrostation \"S\", and Region 2, however, are smaller compared to the overall rate of À0.75 μmol kg À1 yr À1 from the entire STUW domain (Table 2. ). The lower O 2 loss rates observed at these two time series sites and Region 2 could be the result of an artifact from skewness of the data toward measurements from summer and fall months at these stations (i.e., June through December; see Figure 2e ). The lower frequency of detection of STUW between January and April, when ventilation is highest, compared to summer and fall months, when ventilation is minimal, leads to attenuation of the long-term ventilation signal and thus to apparent lower O 2 loss rates at these two sites and Region 2. Smaller O 2 loss trends in Region 2 than in the entire domain of STUW can also be related to changes in ventilation associated with climate shifts. While in the eastern tropical and subtropical North Atlantic the AMOÀ (NAO+) phase induces an increase in wind velocities and a decrease in SST, the opposite occurs in a portion of the western North Atlantic, such as around the BATS and Hydrostation \"S\" stations [Cayan, 1992; Enfield et al., 2001; Marshall et al., 2001; Visbeck et al., 2013] . During the AMOÀ (NAO+) phase, between the early 1980s and the mid-1990s (Figure 8) , westerly winds were weaker and SST was warmer than normal at these stations [Bates, 2001; Gruber et al., 2002; Lomas et al., 2010 Lomas et al., , 2013 . This likely led to stronger water column stratification and reduced ventilation of STUW. After the mid-1990s, westerlies strengthened and SSTs were cooler than normal at BATS and Hydrostation \"S\". The wintertime AMO (NAO)\nGlobal Biogeochemical Cycles 10.1002/2015GB005183\nshifted to a positive (neutral-negative) phase through at least 2013. This has led to increased primary production and phytoplankton biomass over this period . These conditions should have favored outcropping and ventilation of STUW in this location.\nThe average STUW O 2 loss rate at BATS and Hydrostation \"S\" (0.33 ± 0.06 μmol kg À1 yr À1 ) over the 1980-2013 period is~50% lower than the rate estimated for the western subtropical North Atlantic (Region 2; Table 2 ). The lower STUW O 2 loss rate at BATS and Hydrostation \"S\" is likely a methodological artifact in the calculation of AO 2 A at time series stations. Due to the much smaller sample size than WOD13 data sets, time series stations AO 2 A values were obtained using mean O 2 values for the entire water column as opposed to mean values calculated within discrete depth intervals (see section 2). AO 2 A values calculated with this technique are sensitive to the vertical distribution of the data. For example, if the sample population is predominantly from surface layers, AO 2 A values will be skewed by high O 2 values and negative trends will appear artificially small. The opposite will occur if the data set is dominated by lower O 2 values from the deeper layers. Artificially smaller STUW O 2 negative trends are likely to occur at these two sites since STUW is typically found within the upper~100 m in this region (Figure 1 )."}, {"section_title": "Conclusions", "text": "Since the 1980s, STUW O 2 in the subtropical North Atlantic declined at an average rate of À0.75 μmol kg À1 yr À1 . Warming at the site of formation of STUW likely resulted in a decline of STUW O 2 of~3 μmol kg À1 over this period. The balance of the STUW O 2 loss is driven by increased AOU affected by changes in STUW ventilation, circulation, and transport. Variability in the O 2 levels within STUW follows the wintertime (January-March) AMO and annual NAO index phases. A significant negative correlation between the mean wintertime (January-March) Atlantic Multidecadal Oscillation (AMO) index and mean annual STUW O 2 anomalies (AO 2 A; R 2 =0.32, p<0.01) suggests that STUW O2 concentrations are likely driven by shifts in trade winds intensity and sea surface temperature between 10°and 30°N in the North Atlantic. The neutral-positive (negative) phase of the mean wintertime AMO (annual NAO) leads to weaker trade winds intensity and positive SST anomalies in the formation region of STUW, while negative (positive) wintertime AMO (annual NAO) phases enhance ventilation and formation rates of this water mass.\nDeclining rates in STUW O 2 were detected at the CARIACO, BATS, and Hydrostation \"S\" ship-based ocean biogeochemical time series (À0.71, À0.28, and À0.37 μmol kg À1 yr À1 , respectively). No apparent change in STUW O 2 was observed at ESTOC. The absence of a STUW O 2 trend at ESTOC is likely due to this station's proximity to the formation region of STUW and because STUW is only detected intermittently at ESTOC. The rate of STUW O 2 loss at CARIACO was comparable to those measured within the regional southeastern Caribbean Sea (À0.58 μmol kg À1 yr À1 ) and the entire domain of STUW (À0.75 μmol kg À1 yr À1 ). STUW O 2 loss rates measured at BATS and Hydrostation \"S\", however, were on average 50% lower than that calculated for the subtropical western North Atlantic (À0.68 μmol kg À1 yr À1 ). This could be attributed to a methodological artifact in the calculation of AO 2 A using data from time series stations. In order to clearly discern between shifts in oceanic O 2 pools driven by natural climate variability and those from climate forcing induced by human activities, longer oceanographic time series are needed. Changes in STUW ventilation and transport at scales consistent with variability in the AMO and NAO indices lead to significant interannual changes of the STUW O 2 inventory. Sustained neutral-positive AMO conditions could lead to further deoxygenation in tropical and subtropical North Atlantic upper waters."}]