[{"section_title": "School entry age and the experience of early enrollment across countries", "text": "Many aspects of public education systems around the world are becoming increasingly unified. However, regulations regarding school entry age remain diverse, and are rarely changed by governments. Currently (2014 Currently ( /2015 , most of the 37 countries listed in the Eurydice database have a school starting age equal to six (Eurydice 2013) . This applies to 18 of the 28 EU countries, as well as to Norway, Bosnia and Herzegovina, Iceland, Montenegro, Serbia, and Turkey. However, in several countries -including Sweden, Finland, Lithuania, Latvia, Estonia, and Bulgaria -the typical school entry age is seven. In most of the United Kingdom (namely -in England, Scotland, and Wales) school starts at the age of five. The only country enrolling four-year olds in the first grade is Northern Ireland. "}, {"section_title": "Recent reforms lowering school entry age", "text": "The lowering of school entry age is a difficult step for every government. School-enrollment is a milestone in each child's development, but starting too early may result in traumatic experiences which permanently affect a pupil's life in an adverse way. Many families take a rather conservative view on the issue of school admission, which makes any reform in this matter politically difficult. Changing the school starting age is also very challenging from an organizational point of view. For it temporarily increases the total student population by one full cohort, and this requires proportional adjustment in the number of teachers and classrooms, as well as in infrastructure. The classes enrolled in the year in which such change is introduced are expected to be larger and/or more numerous than usual. Last but certainly not least, there is important difficulty regarding the necessity to teach students of different ages within one grade.\nThe difficulties arising from political and organizational and other institutional reasons, explain why changes to school entry age, although debated in some countries, are rarely introduced. In many educational systems the age of compulsory enrollment has remained unchanged since the formation of these systems in the early 20th century. Germany for instance, in 1938 adopted the regulation in force in Prussia, stating that children reaching the age of 6 years on or before June 30th of a given year shall enroll in school during that year, with instruction beginning on Easter (Fertig and Kluve 2005) .\nPortugal lowered the school starting age from 7 to 6 following the profound education reform in 1973, when it increased the compulsory schooling duration to 8 years, established pre-school education, and strengthened higher education institutions.\nIn Northern Ireland the compulsory age regulation was changed in 1989, when the entry age was lowered from five to four years of age. It was argued that children would benefit from spending more years at school (seven years at primary school and five at secondary school), and that an early start would be particularly beneficial for children from underprivileged families (NFER/EURYDICE).\nOne of the most recent reforms took place in Romania, where school entry age was reduced from 7 to 6 starting with the school year 2003 /2004 . Finally, in 2012 Turkey lowered the school starting age from 6 to 5.5 years of age. Since then children who turn 5.5 years old (66 months) before September 1 st have been obliged to enroll to school in that year. Before the reform the cutoff age was 72 months. In 2012 around 4% of children who reached the cutoff age did not begin school due to insufficient mental readiness, as diagnosed by psychologists (Sert 2014) .\nMost countries choose to extend education onto younger children by introducing compulsory, or at least commonly available preschool services (although sometimes taking place in school buildings), rather than lowering the age for starting school. For example, Denmark made pre-primary education compulsory for 6-year-old children in 2008, and in Hungary preschool attendance became compulsory from age 3 in 2014.\nPoland in turn is a country in which broadening access to preschool education and lowering the school starting age took place in parallel. In 2004 preschool education became compulsory for 6-year-old children, and in 2011 -for 5-year olds. Starting from school year 2015/2016 local governments will be legally obliged to secure spots in preschool for every 4-year-old whose parents wish to send him/her to such a facility.\nAnother 'soft' way of introducing the change in compulsory school age is through loosening the strictness of regulations and increasing the autonomy of parents in deciding on the proper time for their children to start school. This may of course result in the increased share of both early entrants and deferred students, something dependent on many factors specific to the given country, society, and educational system. In some cases noncompliance with the compulsory age is so common that the formal limit becomes uninformative about the general trend in a country. For example, in the Netherlands pre-primary schooling (ISCED 1) is compulsory from age 5, but virtually all children start education at 4 (Eurydice).\nIn the beginning of the 1990s the government of Finland decided that the general school-starting age was to remain at seven years of age, but entry to school became more flexible so as to allow more variation in the school-starting age according to pupils' readiness for school attendance and the wishes of parents (Fort 2006 ).\nIn Germany, as observed by Fertig and Kluve (2005) , adherence to the regulations on age at school entry is not strict, and both deferments and early enrollment are common. Also in the Czech Republic, where parents have the right to decide whether their 6-year-old child is ready for school, is there a growing share of families postponing the school start of their children (Munich 2014)."}, {"section_title": "Lowering the school starting age in Poland -stylized facts", "text": "The decision to lower the school starting age in Poland was made in late 2008. The Minister of Education and other members of the government expressed several arguments in support of this step. First, it was emphasized that, due to the better education of parents and stronger socialization, children develop their cognitive skills much earlier than in the past, and they achieve school readiness at a lower age. It was argued that Poland should follow the experience of highly developed countries, most of which have set the school starting age at six. Another cited advantage of a lower age for school entry was that it would provide replacement for missing preschool education, particularly in small towns and villages. It was claimed that an earlier start would be particularly beneficial for children from underprivileged families, due to their early exposure to pedagogical assistance and the positive influence of peers with higher socio-economic status.\nIndependent of reasoning related to pedagogy and social matters, there were at least two arguments of a more political nature in support of lowering the school starting age. First, the Polish educational system, similarly to many other European systems, was struck by a deep demographic decline over 1990s and 2000s. In ten years the enrollment in primary and secondary schools dropped by roughly one-third, and this exerted strong pressure on local governments to close schools and fire teachers. Sending an additional cohort (6-year-olds) to primary schools, would temporarily ease this pressure and save many teaching posts. This argument was eagerly used in negotiations with teacher unions, which initially opposed the plan to hasten children's commencement of schooling.\nAnother political reason for lowering school starting age was its presumed beneficial effect on the pension system. Increasing average life expectancy combined and a low fertility rate have led to the accelerated ageing of Polish society and put the future solvency of the pension system in danger. A lower school starting age, resulting in the earlier entrance of school leavers to the labor market, might bring relief to the strained budget of the state-operated pension fund -especially that in parallel to changes in the educational system, Poland also introduced a mechanism gradually postponing the retirement age from 65 to 67 for men and from 60 to 67 for women.\nDespite certain efforts of the government to convince stakeholders of the propriety of lowering school starting age, the reform was strongly opposed from the outset by both parents and teachers. Its implementation was very turbulent and took 7 years. Along with other issues, it also contributed to the dismissal of two subsequent ministers of education (in October of 2011 and February of 2013). The major steps in the reform to lower school starting age are shown in Table 2 . . The first term for compulsory enrollment of six-year-olds in 1 st grade was planned for September 2012. However the first two years of the implementation resulted in but a very small share of parents sending their 6-year-old children to school (see Table 3 ). Moreover, parental organizations launched a media campaign aimed at demonstrating that most schools are not prepared to host 6-year-old children, whether in terms of pedagogical preparation, safety conditions, or appropriate physical infrastructure 2 . In October 2011 the government decided to postpone the compulsory phase of the reform until September 2013. Three months later, following the change at the helm of the Ministry of Education, the voluntary phase was further extended. It was announced that all six-year-olds would be enrolled in 1 st grade on an obligatory basis starting from September 2014. In February 2013 however, in response to unrelenting protests and the low rate of the voluntary enrollment of 6-year-olds in schools, another modification was introduced. September 2014 was upheld as the starting date of the compulsory phase only with respect to children born in early 2008 (thus completing the age of 6 before July 1, 2014). The other half of the cohort, unless sent to school voluntarily in 2014, was supposed to join 1 st grade in 2015, simultaneously with the whole cohort born in 2009. September 2015 is therefore the date when the reform to lower the school starting age finally became fully implemented. Table 3 shows the shares of 6-year-old children enrolled in 1 st grade during the whole period of the reform's voluntary phase, including 2014, when school became compulsory for the 6-year-olds born early in the year. The numbers suggest that social confidence in the reform was low throughout the whole period. The greatest share of voluntary enrollment was reached in 2011, when the original schedule of the reform seemed yet unthreatened. The year 2011 was supposed to be the last for voluntary enrollment, so some parents opted for an earlier school start for their children to avoid the expected high enrollment in 2012, when the whole 2006 cohort would meet the majority of the 2005 cohort, held by parents in preschools. However, even with this incentive, less than 20% of parents were willing to send their 6-year-old children to school in September 2011. The experience of lowering school starting age in Poland prompts many important questions related to the organization of schooling, as well as the implementation of challenging reforms. Answers to these questions are valuable from both a cognitive point of view, and for policymakers in various countries who are considering changes in compulsory schooling regulations.\nThe next two issues addressed in this paper are:\n• Who becomes voluntary enrolled in school at the age of 6? More broadly, what are the implications of the voluntary enrollment rule applied in the transition period of the reform for school and class composition?\n• What are the effects of an early start on the development of cognitive skills in mathematics, reading, writing, and reasoning ability? In other words, is a lower starting age beneficial for pupils?"}, {"section_title": "Who wants to go to school: Early investment vs redshirting", "text": "In the education systems with a clearly established school starting age and no reform being introduced in this matter, enrolling children in school before they reach a compulsory enrollment age is a rather uncommon practice. As such, early enrollment is not a subject of careful analyses, and the evidence on it is scarce. However, some conclusions may be drawn from the rich literature on what may be considered the reverse of early enrollment -the phenomenon of redshirting, which has recently gained popularity in many countries. Redshirting is the practice of postponing the entrance into the school system of age-eligible children. A popular belief is that redshirting is mostly the conscious choice of parents with high socio-economic status who try to secure an easy start and better position for their children in academic and labor-market competition (Konnikova 2013) .\nFindings from studies on redshirting are valuable as a background for researching early entrance to school, as both types of parental decisions are based on a similar set of considerations and the same goal -to choose the enrollment time correctly in order to provide children the best conditions for intellectual development. In this context, a decision to enroll children in school before they reach a compulsory age may be considered as an early investment in education, while delayed entry -as an investment in greater school readiness. Naturally, the opposite outcome of parental considerations does not imply that the characteristics of a redshirting parent are the reverse of those of a parent opting for early school start. One can expect the decision on admission to school to be driven by important factors other than parental socioeconomic status (SES), such as the individual traits of their children, the uniqueness of a school district, the quality of local public policies, etc.\nAs for redshirting in the US (were most evidence is from), the actual findings mostly support the popular view on the nature of this phenomenon. Graue and DiPerna (Graue and DiPerna 2000) investigated a representative sample of Wisconsin school district and noticed that, compared to other ethnic groups, African Americans are slightly more likely to enter school later. Contrary to common beliefs, children eligible for free or reduced price lunch were significantly more likely to be redshirted. However in a more recent and nation-wide study, Bassok et al. (2013) find that male, white, and high-SES children are most likely to delay kindergarten, and schools serving larger proportions of white and high-income children have far higher rates of delayed entry. Moreover, there was no evidence that children with lower cognitive or social abilities at age 4 were more likely to be redshirted, which fact suggests that parents' decisions to delay entry are driven by the will to 'game the system' rather than made in response to actual deficits of children.\nThe reform to lower school starting age in Poland provides a unique context for making decisions pertinent to early enrollment in grade 1 (at the age of 6), versus waiting until the child reaches the standard age of 7. As the survey used in this study was conducted in 2012/2013, and the compulsory school starting age ultimately was lowered not until 2014 (see table 2 ), all the surveyed families faced a choice regarding the age of enrollment. However, when making a decision, parents had to take into account that the reform was already in progress and this circumstance created some incentives in favor of both early enrollment and redshirting. Uncertainty regarding the actual readiness of schools to teach and take care of 6-year-olds in the early stage of the reform may have discouraged parents from enrolling their 6-year-old child in grade 1. In turn, the awareness that many families delay school start may have worked as an incentive to go against the trend in order to join the smaller cohort, to study in smaller classes, and to face less competition throughout the whole academic career. Moreover, a stimulus could come from the policy of local governments, among which many have decided to limit the number of slots available in the final year of preschool education, thereby transferring resources to schools in order to prepare them for the enrollment of 6-year-old pupils. With the lower availability of kindergarten, some families may have chosen to enroll early in the first grade, although they might have delayed the school start if preschool care had been more accessible.\nAs it turns out, the choice between enrolling early and in the 'standard' term, in the context of the ongoing reform to lower school starting age, may be altered by numerous factors, and sometimes it may yield a different outcome than would be the case in the conditions of stable policy arrangements."}, {"section_title": "Is an early start beneficial? Evidence from empirical research", "text": "The evidence on the effects of student age on academic performance is abundant, but not easy to summarize. Various national studies, as well as less numerous works using international data, refer to different age-related effects, and sometimes one term used in the literature describes two notions of different nature. In general, there are three major effects investigated in the empirical studies:\n-The effect of absolute age at the measurement time or at the school start. When achievement is measured simultaneously for the whole cohort of students (using test scores, grades, promotion outcomes, etc.), older students are expected to perform better, as they are intellectually more developed at the time the observation is made. This effect is supposed to weaken as students become older, and to become irrelevant in adult life.\n-The effect of relative age with respect to peers. In addition to the role of individual capacity, student achievement may be affected by the fact of being enrolled in school or a class with older or younger children. The effect may work in differing directions. Having older peers (with respect to oneself) may provide a stimulus to work harder, but if catching up turns out to be particularly difficult, it may become a disincentive. Age structure in class may determine the pace of work, which can be harmful for younger students, etc.\n-The effect of starting school earlier or later with respect to the standard/compulsory term. As discussed in the previous section of this study, some children become enrolled in school before or after the term determined by the birth date and the official school cutoff age. Although such students, once enrolled, usually differ from their peers within the educational cohort with respect to both absolute and relative age, the effect of an early (late) start is considered to be distinct from the aforementioned two. For example, as early entrants and redshirts are 'exceptions' from the schooling system's rules, they may be treated differently by the teachers and/or peers (whether in a helpful or harmful way). Moreover, they are supposed to follow a curriculum which was not originally written for students of their age, and this may also influence their perceived performance.\nMany authors, acknowledging the distinct nature of different effects of age on educational performance, choose not to separate them in their empirical research, and therefore what they really estimate is a composite age-related effect. In this approach, the impact of age on achievement usually turns out to be significant and positive. As expected, older students generally perform better. This finding holds for diverse educational systems and tiers. Datar (2006) analyzes data on the kindergarten and early school career of children in the US and observes that beginning kindergarten a year older significantly boosts test scores at kindergarten entry, particularly for at-risk children.\nEntering older also implies a steeper test score trajectory during the first 2 years in school. Puhani and Weber (2007) in turn show that children entering school in Germany at 7 instead of 6 years of age have better achievements in grade 4 and a higher probability of a subsequent academic track.\nIn the same spirit, Schneeweis and Zweimüller (2014) demonstrate that in Austria younger students face a higher probability of vocational tracking in grades 5-8. This effect persists beyond grade 8 for low SES students. Similar conclusions are reached by Altwicker-Hámori and Köllo (2012) for Hungary, as well as by Ponzo and Scoppa (2014) .\nAs students get older the impact of age on their achievements fades out. Nam (2014) shows that in South Korea differences in age have a significant influence on academic achievement until middle school, but this effect does not persist after students have graduated from high school. In Italy, the youngest undergraduate students perform better when compared with their older peers (Pellizzari and Billari 2012) . However, some studies don't support the belief that the strong initial effect of absolute age fades out in later stages of education. For example, using international data from TIMSS, Bedard and Dhuey (2006) show that initial maturity differences have long-lasting effects on student performance. The youngest members of each cohort score 4-12 percentiles lower than the oldest members in grade four, and 2-9 percentiles lower in grade eight. In some countries the youngest members of each cohort are even less likely to attend university.\nWhen the importance of relative age (being younger or older than peer students) is examined without controlling for absolute age (being more or less mature), this usually turns out to be a significant predictor of achievement (see Sharp, George et al. 2009 for a review of the literature).\nHowever, with both effects taken into consideration, the impact of the absolute age is much stronger than the relative effect, and the latter frequently becomes insignificant. For example, Ponzo and Scoppa (2014) do not find any significant effect of the relative age on Italian students' achievements in the PIRLS, TIMSS, and PISA programs. Use of age-adjusted assessments also removes the impact of relative age on IQ scores and the test scores in reading and spelling in Great Britain (Gledhill et al., 2002) . Aliprantis (2014) argues that there could be a decreasing or even negative return to relative age in the United States. Using data from the Early Childhood Longitudinal Study he demonstrates that, for the oldest children in a cohort, educational achievement in third grade decreases as their age relative to that of their classmates increases.\nThe attempts to estimate the effect of early/late school start lead to ambiguous findings. The main division runs between the research examining the age of enrollment into school (including the fact of doing it within or outside the compulsory term) jointly with the absolute age of a student, and research attempting to isolate the two effects from each another. Authors who focus verbally on the issue of school starting age, but who do not control for the age at the time of performance measurement, usually wind up concluding that a delayed start is beneficial for students in terms of test achievements and promotion perspectives (McEwan and Shapiro 2008 , Altwicker-Hámori and Köllo 2012 , Fredriksson and Ockert 2013 . However, separating the effect of enrollment age from the impact of the absolute age may lead to results supporting (or at least not rejecting) the idea of sending children to school earlier. Fertig and Kluve (2005) see no effect of age at school entry on the educational performance of German students. Deming and Dynarski (2009) argue that a later start in primary school is associated with a lower probability of high school graduation and college completion by US students. Moreover they conclude that redshirting contributes to increasing the gender gap in educational attainment in the US. Black, Devereux et al. (2011) investigate the performance of Norwegian students on the IQ test taken outside of school, and they find a small, negative effect of starting school older (which suggests early start may be beneficial). However, this is offset by the much larger positive effects of age on the test.\nSome researchers also investigate the non-academic, long-term implications of school starting age. Of particular importance are issues related to mental health and professional experience after leaving school. Black, Devereux et al. (2011) argue that a late school start decreases the probability of teenage pregnancy for Norwegian girls, and the probability of poor mental health for boys. However, early enrollment seems to be associated with higher earnings until the age of 30. In contrast to the results from Norway, Fredriksson and Ockert (2013) demonstrate that in Sweden starting school early depresses prime-age earnings -at least for students with low socio-economic status.\nOverall, the existing studies are not fully conclusive, but it seems that the prevalence of research disclosing a negative impact of early enrollment may result from considering different age-related effects jointly in the empirical analyses. School starting age, similarly to absolute age, seems also to matter more at the initial stages of schooling than in later years of education -or beyond. Although this research refers to very early measurement of student performance (after just one year at school), its design (e.g., value-added specifications) also enables some understanding of the dynamics of age effects. It also puts strong emphasis on splitting the effect of age, and the effect of the parental decision to enroll a child in the first grade before the compulsory term."}, {"section_title": "Data and empirical strategy", "text": "The research uses data from the TUNSS survey administered by the Institute of Educational Research (IBE) in Warsaw in the fall of 2012 and spring of 2013. The sample consisted of 2,859 observations including four categories of children:\n(1) 6-year-olds enrolled in preschools (n=589), (2) 6-year-olds enrolled in preparatory classes in schools (n=581), (3) 6-year-olds enrolled into 1 st grade in primary school (n=532), (4) 7-year-olds enrolled into 1 st grade in primary school (n=580), (5) 7-year-olds enrolled into 2 nd grade in primary school (n=577).\nCategories 3 and 5 refer to children whose parents have voluntarily sent them to school at the age of 6, while all remaining observations refer to children whoh either were or will be (in the school year following the research) enrolled in accordance to the 'old' schedule -thus, at the age of 7.\nThe sample was constructed in two steps. First, a larger number of children born in 2005 or 2006 (6 or 7 years old at the time of the research) was drawn randomly from the administrative register (PESEL). Later, observations were picked from the pool as long as the assumed quotas of children with different enrollment statuses were reached. The quotas intentionally did not reflect the proportions of enrollment statuses in the population, as early entrants to school were purposely overrepresented. The final sample differed slightly from the population also in terms of regional distribution of students. To achieve the representativeness of the data, for the purpose of this study a rim weight was imposed on the sample, reflecting the true distribution of students according to educational paths, region of residence, and affiliation to the age cohort.\nThe research involved a survey of parents and aimed at collecting all characteristics of pupils' families and contextual information about the child's environment, as well as a series of tests: in mathematics, reading, writing, and finally an IQ test. Each child's performance was tested twice. The first session (fall) was administered shortly after the beginning of school year 2012/2013 and therefore shortly after the 'tracking' of 6-year-old children into 1 st grade The second took place approximately six months later, in the spring of 2013.\nThe empirical strategy of this paper consists of two major steps. The first relies on investigating the determinants of the parental decision to enroll their 6-year-old child in the 1 st grade versus leaving him/her in preschool or preparatory class. The goal is to understand who is more likely to enter school before the compulsory term, and whether we can observe any evidence for redshirting or deliberate investment in early enrollment.\nThe analysis is based on logit model estimation with three sets of explanatory variables, related respectively to the pupil's, family and municipality characteristics (see equation 1).\n(1)\nThe dependent variable reflects the parental decision to enroll their 6-year-old child in the 1st grade of primary school. It equals 1 for all pupils who became 1st graders in the year they turned six, and it is 0 for all enrolled in school at the age of seven. Pupil characteristics include sex, birth order, measure of physical development (height), performance on the IQ test, evidence of preschool\nexperience, age (measured in days) at the start of the school year, and reported health issues. Family-related variables describe the educational attainment of parents, their employment status and age, family living conditions, and size of the family. Finally, district level variables depict the size (population) of the municipality, the unemployment rate on the local labor market, and the availability of preschool care for six-year-old children.\nThe second step of this study is aimed at explaining the variation of student performance in mathematics, reading, and writing in the spring of 2013, and particularly on the effect of early enrollment (at the age of six) in the 1 st grade of primary school. Differently from the analysis described by the equation (1), here the estimation is performed on the subsample consisting exclusively of pupils enrolled in the 1 st grade (thus belonging to categories 3 and 4 listed above).\nThese students can be considered to receive similar treatment between the first and the second performance test, in contrast to the remaining pupils, who were either enrolled into preschool classes or in the 2 nd grade at school. In other words, we compare the achievements of the students who, independent on their age, were enrolled in grade 1 at the time the research was conducted.\nAs observed many times before, student achievement is determined by various factors related to individual and family characteristics, teaching quality, as well as the broader environment in which a student lives and studies. Therefore, in order to isolate the effect of early enrollment on the achievements of pupils in different subjects we start with the similar set of control variables as used in the equation (1). This time however, the parental decision on the time of their child's enrollment in school is used as an additional explanatory variable (see equation 2)\nThere are some important caveats with respect to the above specification. First, as discussed in the literature review section, the effect of age on performance is in fact a composition of different agerelated effects. One way of distinguishing them is to include both the early enrollment dummy, and the variable indicating the precise age of a student measured in days. Without controlling for student age, the early enrollment variable would capture both the effect of student age and the consequence of being sent to school early. With both variables included, these two effects are isolated.\nSecond, controlling for different student, family, and district characteristics is not enough to overcome the expected endogeneity (to be confirmed by the first stage of this study) of the parental decision on whether to enroll a child in the 1 st grade at the age of 6 or 7. Independently of what kind of selection to early enrollment takes place (e.g., whether high SES increases or decreases the propensity to send a child to school before compulsory term), this will yield biased estimates of the impact of parental decisions on student performance.\nSeveral methods are applied in this study to overcome the selection problem. Each specification of the model explaining student achievement in the spring semester is estimated both in terms of raw test score and value added, including the achievement in t-1 (at the start of the fall semester) as another explanatory variable. The value-added approach allows for control of the ability of students at the time they were entering school, which reduces the potential endogeneity bias.\nIn the next step, the effect of early school start on achievements is estimated using the propensity score matching procedure (Rosenbaum and Rubin, 1985) . The propensity score matching method is\nwidely used in the social sciences. The method attempts to mimic a randomized experiment in a nonexperimental setting. It allows for a precise estimation of treatment effects in situations where nonrandom selection is solely based on observable characteristics. In this setting school enrollment before compulsory age is treated as an experimental treatment and enrollment at compulsory age as a control treatment. The main advantage of propensity score matching is that it allows for straightforward construction of the counterfactual outcome, i.e., the study achievements of 7-yearold pupils assuming they exhibit the same characteristics (personal, family background, place of living) as their 6-year-old classmates, except age. Therefore, the observed difference in study performance can be attributed to earlier enrollment.\nThe limitation of the PSM method in the context of this study is that it does not allow us to separate the effects of student age and the consequences of being enrolled before the compulsory term. The variable indicating early enrollment is used to assign observations into the treatment and control groups. Students in both groups are eventually matched based on different observables related to their socio-economic status and place of residence. However, the subsamples cannot be matched with respect to student's absolute age, as by definition all students in the experimental group (enrolled at the age of 6) are younger than any student in the control treatment group. Therefore, while performing PSM analysis, we observe a joint effect of absolute age and early school start on student achievement.\nEarly enrollment and absolute age are considered separately in the next step of the analysis, relying on the two-stage least square estimation, which is another technique used to overcome the endogeneity of student age or the parental decision on early enrollment. Many researchers follow Card (1995) , who argued that geographic differences in the accessibility to school are a source of exogenous variation in educational choices. Distance to school, and other indicators of school accessibility have been used as an instrument in numerous studies looking for determinants of student achievements (inter alia : Hoxby 2000; Bettinger 2005; Schwartz, Stiefel et al. 2013) . In this study, however, another instrument is used 3 . Following Ponzo (2014), Bedard (2006) , and\nPuhani&Weber (2007), it is assumed that parents of children born early in the year are more willing to send them to school before the compulsory term, and therefore being born in the first half of the year is a good predictor of early enrollment. At the same time it is believed to be uncorrelated with students' general ability (other than related to maturity), socio-economic status, place of residence, and similar factors which may influence student performance 4 .\nTo allow a better understanding of subsequent steps of the analysis, some basic information on the techniques and specifications is provided in table 4. Table 5 shows descriptive statistics of all variables used in regression analysis. "}, {"section_title": "How selective is early enrollment in school?", "text": "As shown in the literature review section, there are two major (and opposed) mechanisms linking socio-economic status with the inclination towards early school start. First, more educated and affluent parents tend to have more confidence in schools and other public institutions, as compared to families located lower on the social ladder. Therefore, they should be more willing to send their children to school even before compulsory term. However, at the same time better endowed parents may be more conscious of how their child's age determines his or her achievements and functioning in the peer group. This knowledge, and the will to provide their child with better chances in school competition, may lead parents to delay the enrollment of their children in school (red shirting).\nExamining decisions of parents at different levels of educational attainment leads to the conclusion that in Poland the mechanism of 'deeper confidence' dominates over the syndrome of 'conscious restraint'. In 2011-2012 the share of children enrolled at the age of 6 was 13% among families with the mother having only primary or basic vocational education, but it exceeded 20% for mothers holding at least a bachelor degree (see table 6 ). It seems therefore that voluntary enrollment in school is more likely in families with higher SES. A comparison of the cognitive skills of 6-year-old children in preschools and in the 1 st grade, measured at the beginning of school year, also shows that children enrolled into school perform significantly better, on average, in all kinds of tests than do their peers in preschools. This confirms the hypothesis that voluntary enrollment in schools is associated with strong positive selection. The largest gap is observed for writing, with the difference between means reaching 0.8 of standard deviation. The gap is smaller for reading (0.5 sd) , and smallest, although still significant, with respect to mathematics and IQ test (see table 7 ). The comparison of the average achievements of 6-year-old and 7-year-old children also reveals that older pupils perform better by approximately 0.3 of standard deviation in all subjects tested."}, {"section_title": "What are the determinants of parental decision on starting school early?", "text": "The outcome of the logit model estimation suggests that the decision regarding voluntary enrollment of a 6-year-old child in the 1 st grade stems primarily from the assessment of his/her level of physical and intellectual development. Early enrollment is positively and strongly associated with the child's IQ score, height, and age measured in days. This shows that that rational evaluation of a pupil's readiness for school plays a crucial role in parental decisions (see table 8 ).\nThere are, however, other important factors, ones not related directly to a child's abilities. Independent of the measurable stage of development, girls are more likely to be enrolled at the age of 6 than boys.\nWith respect to family characteristics, we observe early enrollment being more likely to happen in families with numerous children. This may be explained by the less protective attitude of parents towards children in such families, although the outcome may be also related to higher financial stress 5 .\nWell-educated parents are definitely more willing to experiment with early start that those with low educational attainment. Therefore, of the two theoretical effects of parental SES on early school start, the deeper confidence syndrome seems to overweigh the redshirting strategy in Poland. The probability of early school start depends not only on the mother's educational attainment, but also on the importance attached by the family to child's education. This factor is proxied by the number of children's books at home. There is however one aspect of high social status which is negatively associated with the probability of early school start. Families with fathers holding a managerial post are less likely to send their 6-year-old child to school.\nEnrolling a 6-year-old in the 1 st grade is more likely to happen in a rural environment or small town than in the larger city. This may suggest that parents living in small communities, where schools are more integrated in the local societies, tend to have more confidence in school as a good place for their children. On the other hand, however, the direct association between the probability of early enrollment and the municipality population number is positive.\nThere is a number of factors which seems not to have significant impact on parental decisions regarding when to enroll a child in the first grade. Perhaps most surprisingly, the decision is not associated with preschool experience (number of years and hours per day spent in preschool). One would expect parents whose children have already spent a lot of time in an educational facility to be more willing to send a 6-year-olds to the 1 st grade. Nonetheless, there is no statistical evidence of such regularity. There is also no clear effect of parents' age, employment status, nor the effect of single parent family.\nWhile working on the model specification it was assumed that parental decisions on starting school early may be in part caused by some external pressure, related to the availability of preschool care for the six-year-old. At the time the research was conducted, participation in some education program (1 st grade of primary school, preparatory class or preschool class) was already compulsory for all 6-year-olds. Many municipalities have decided to limit the availability of preschools for children at this age, which fact has made parents choose between a preparatory class and 1 st grade.\nBoth choices mean in fact transferring a child from a preschool to a school environment, as preparatory classes are run by primary schools. Therefore, living in a municipality with limited or no access of six-year-old children to preschools might provide an incentive to enroll in the 1 st grade (since a child needs to change the facility anyway), while having the possibility to leave a 6-year-old child in preschool for another year provides a disincentive to sending a child to school before a compulsory term. However, the results of regression analysis do not confirm the existence of such effect. Preschool availability seems not to affect the probability of early enrollment into school.\nFinally, there is no effect of the local labor-market situation (unemployment rate) on the propensity of parents to voluntary enroll their 6-year-old children in the 1 st grade. Table 9 shows the average achievements of children enrolled into different institutions in the spring of 2013. A quick comparison of these outcomes to the achievements from the fall (table 5) reveals that the gap between 6-year-olds in the 1 st grade and those in preschools has further increased. The advantage of school children now equals 0.65 of standard deviation for math (previously 0.36), 1.1 standard deviation for reading (0.5), and 1.3 standard deviation for writing (0.8). The gap in IQ RAVEN test score remained virtually unchanged. Noteworthy is the fact that the difference in average scores between 7-year-old and 6-year-old children in the 1 st grade (previously around 0.3 sd) has almost disappeared during one school year."}, {"section_title": "Effect of early enrollment on achievement", "text": "This applies to all subjects but the RAVEN test, for which the gap remained stable.\nTo elaborate more on how pupils starting school before the compulsory age perform in different subjects, an early enrollment indicator was used as an explanatory variable in the regression analysis explaining the variation of spring achievement in mathematics, reading, and writing. In this stage of the analysis the sample was limited to 1 st graders, as we intend to compare the achievements of students who have received similar treatment, although they differ with respect to the age of enrollment. To isolate the effect of early start (relative age) and the impact of absolute age on the test score, the age of a student (expressed in days) was also included in the specification. Other explanatory variables described individual characteristics of pupils, their families, and their municipalities of residence, as signaled in the methodological section of this paper. Table 10 shows the Beta coefficients by the variable indicating enrollment before the compulsory term and by the age at the test variable in different specifications of the model. As described earlier in table 5, the estimation was repeated in several variants with different combinations of dependent variables (scores in mathematics, reading and writing), measurement approaches (achievement level versus value added), and using different estimation techniques (OLS, PSM, 2SLS).\nFirst, the consequences of being enrolled in the 1 st grade before the compulsory term is estimated through the ordinary OLS procedure, without controlling for the absolute age at the test. The result is expected to reflect the composite effect of age, including the influence of age at the test, relative age, and the effect of early enrollment. As it turns out, the estimated composite age effect is insignificant with respect to mathematics and reading, and negative with respective to writing.\nWith age at the test controlled by a separate variable, OLS estimates suggest that the enrollment before compulsory term exerts a positive and significant impact on student performance after one year at school in all tested subjects. The largest effect is observed in reading (0.38 of standard deviation) and the smallest in mathematics (0.21). At the same time, in accordance with expectations, the effect of student age is also positive. The impact of age is rather homogenous between subjects as it ranges from 0.009 to 0.013 of standard deviation per 10 days of a difference in the birth date.\nAs the early entrants are at the same time younger than the average student taking the test, the two effects tend to cancel each other out. The expected net outcome for a student enrolled before the compulsory term naturally depends on the individual age, but is also specific for each subject. For example, with respect to mathematics the performance of the 6-year-old pupil is supposed to be equal to that of the 7-year-old if the age gap between them is about 8 months (237 days). When the gap gets larger than that, the older student is expected to outperform the early entrant. The corresponding thresholds for reading is 341 days (11.5 moths) and for writing -222 days (7.4 months). Therefore, it turns out that performance in mathematics and writing is more dependent on student age than the achievements in reading. 10 show the results of the value-added specifications, in which the results of the test taken by students in all three subjects in the fall of 2012 are included on the right side of the equation. The results of OLS estimations suggest that older students generally make faster progress in all subjects, but, in parallel to this effect, those who were enrolled before the compulsory term learn faster that those entering school at the age of 7.\nAlthough different family and child characteristics are controlled in the specifications, the endogeneity of early enrollment may bias our judgment on the pure effect of parental choice regarding early enrollment on the child's achievements. The earlier results presented in this article suggest that indeed there is some selection to early enrollment and that the bias is likely to be positive, which means that the achievement of students enrolled in the 1 st grade before the compulsory term is overrated.\nColumn 3 in table 10 presents the outcome of the PSM procedure. This method attempts to mimic randomization by creating a sample of 1st grade students that entered school at the standard age (received control treatment), which is comparable on all observed covariates to a sample of 1st grade students that were enrolled before the compulsory term (received the experimental treatment). The matching refers to such explanatory variables used in the specification as: parental education, type of settlement, student gender, physical development and health issues, family size and birth order, characteristics of the place of residence, etc. However, as discussed in the empirical framework section, the samples cannot be matched with respect to student age (no overlapping between the treatment and control group). As a consequence, the estimated impact of early enrollment displayed in column 3 of table 10 is a composite effect, reflecting the influence of both absolute and relative age. As we can see, the joint effect is slightly negative and significant for all subjects -ranging from 0.04 to 0.11 of standard deviation. More precisely, after one year at school a typical 6-year-old is expected to be basically equal to a 7-year-old in reading, and slightly behind in mathematics (by 0.04 of standard deviation), and noticeably lagging in writing (0.1 of standard deviation). The coefficients for reading and writing are lower than in the OLS, suggesting that the selection to early enrollment affects the perceived consequences of starting early. However, the differences between OLS and PSM outcomes (column 1 and 3) are not substantial. Value-added specifications also suggest that students entering school before the compulsory term make faster progress in mathematics and reading than their older peers. The pace of learning in writing is similar for the two age cohorts.\nColumn 4 of table 10 shows the coefficients estimated using an instrumental variable (2sls) regression, in which the early enrollment variable is instrumented by the student's season of birth. Student age, measured in days, is included as another explanatory variable, which allows us to separate the two age-related effects. As it turns out, with the absolute age of a student controlled, the effect of early enrollment remains positive and significant in 2sls estimation, and the regression coefficients are even slightly higher than in the OLS approach (column 2)."}, {"section_title": "What else affects pupils achievement?", "text": "Although control variables used in the regression analysis are primarily supposed to help us isolate the effect of early school start, and more broadly the effect of age on achievement, their own impact on pupils performance may also be of interest. Table 11 shows the signs of the significant effects (0 if insignificant). Naturally, the importance of different factors varies between specifications and the samples used in this research. Table 11 is based on the results of the 2sls regression of the achievements of 1st graders in mathematics, reading and writing, as measured during the spring session. The only individual characteristics which exert a strong, positive impact on pupils' performance in all subjects is the mother's educational attainment. Having a mother with a university degree is associated with improvement of performance in mathematics by 0.26, in reading -by 0.18, and writing -by 0.12 of standard deviation. Living conditions in turn have some importance for developing skills in mathematics and reading.\nSex seems to have a different importance for the achievements in particular subjects. With other characteristics controlled, girls perform on average much better in writing (0.27) and significantly better in reading (0.11). There is no significant difference between girls and boys in mathematics.\nPreschool experience seems to be helpful only in reading. The performance in mathematics is unaffected by whether and how intensively a child attended preschool in the past. The outcome for writing is surprising: the coefficient by the number of years spent in preschool is negative and significant.\nLiving conditions, proxied here by the variable indicating whether a child has his/her own room, have some importance for the achievement in reading and mathematics (0.12 of standard deviation ), but they turn out to be insignificant with respect to writing skills.\nThere is some evidence for the impact of the parent's age and employment status on the child's performance at school. Students having young parents (under 30) perform generally worse at the tests. Children tend to perform better when living in a family in which the mother is professionally active.\nInterestingly, there is barely any significant effect of any district characteristics on the performance of pupils. Neither city size, nor the accessibility of preschool care are associated with the achievements in any of the tested subjects. High unemployment in the child's town is correlated with lower performance in mathematics, but the effect is weak. A 5pp gap in unemployment rate is associated with a 0.08 of standard deviation difference in the test score."}, {"section_title": "Conclusions", "text": "The reform to lower school entry age in Poland from 7 to 6 was divided into three phases. In the first phase, launched in 2009, the enrollment of 6-year-old children into the 1 st grade was voluntary, although parents were strongly encouraged to do so. Starting from September 2014 all 6-year-olds born early in the year were supposed to become 1st graders on an obligatory basis, and since 2015 all children are supposed to enter school in the year in which they turn 6.\nDuring the phase of voluntary entrance one could expect that the selection of six-year-olds to school would follow either the scheme of redshirting (parents with higher SES delaying the entrance of their children) or deliberate investment in education (children of educated parents are sent to school earlier), or a mix of the two.\nIt turned out that decisions on early enrollment were strongly related to the objective symptoms of school readiness, such as age (in days) and degree of physical development. Children enrolled before the compulsory term were also, as soon as the start of a school year, more adept in all subjects as compared to the 6-year-olds staying in preschool classes. The hypothesis of positive selection to school is also supported by the fact that families with a mother holding a university degree were more likely to send children to school at the age of 6.\nOn the other hand, there is some evidence suggesting that the decision on early enrollment is not so unanimously linked to high socioeconomic status, and may also be driven by a cost-reducing strategy (public school, differently from preschool, if free of charge). Growing up with numerous siblings (although not the birth order) significantly increases the probability of entering school at the age of 6. Moreover, families with the father holding a managerial post are less likely to enroll a child before the compulsory term.\nSurprisingly, the child's preschool experience doesn't affect the parental decision on the age of the child's enrollment into school. Also the place of residence -its size, and labor-market conditions -is not an important factor.\nIndependent of other individual and contextual characteristics, it turns out that girls are more likely to be enrolled in school before the compulsory term.\n6-year-olds enrolled in the 1 st grade start the school year with lower skills (in all subjects) than 7-year-olds. However, during the school year younger pupils catch up to the average level, and the gap between them and those enrolled in compulsory term drops to 1/3 of the original difference. For reading it becomes insignificant. The swiftest catch-up is observed for mathematics.\nWith individual, family, and school districts characteristics controlled in the model specification, the overall effect of early enrollment turns out to be small and negative. The results from propensity score matching with respect to several student characteristics suggest that typical students enrolled at the age of 7 outperform those starting at the age of 6 in writing and math respectively by 0.11 and 0.04 of standard deviation. The performance in reading is in turn virtually equal.\nWhen the concept of early enrollment is split into the absolute age of a student, and the fact of being enrolled before the compulsory term (that is, earlier than most of the peers in the same grade), both effects turn out to be positive and significant. This result is sustained in 2sls regression analysis, which is supposed to neutralize the problem of the endogeneity of parental decisions on the date of enrollment. Therefore, although older students generally have higher achievements in all subjects, children enrolled at the age of six do better than expected as based on their birth dates.\nThe advantage of older students on performance tests, particularly if the measurement is done at the early stages of education, is a common outcome observed in many countries and educational settings. In this respect the results of this study are in accordance with most of the international evidence. However, the simultaneously observed benefit from starting school before the compulsory term is not axiomatic, and deserves nuanced interpretation.\nOne natural way of explaining the positive impact of an early start on the pace of learning in the 1 st grade is through the beneficial pressure experienced by younger students from their older peers. One can expect that 7-year-olds provide challenging performance benchmarks for the 6-year-olds, and that this makes younger students catch up. Such an explanation would support the earlier findings by Coleman et al. (1966) , Evans et al. (1992), and McEwan (2003) .\nHowever, it must be acknowledged that in the transitional (voluntary) period of the reform, 6-and 7-year-olds in many schools were assigned to separate classes within the 1 st grade. The mixed-age classes were usually created in cases when the number of enrolled 6-year-olds was insufficient to form a class. Under a separate classes arrangement the peer pressure on the younger students is expected to be much weaker, although one can imagine it to work indirectly, as well -namely, through common benchmarks imposed by the curriculum and the teachers. Unfortunately, the information on whether a student was assigned into a mixed-age or single-age class was not collected in this research, so it is impossible to assess whether it may explain the observed positive effect of early enrollment on student achievement.\nAnother possible reason for the observed positive impact of early enrollment on the achievements and the pace of learning is through selection of unobservables. Although the PSM and IV methods allow us to reduce the bias resulting from selection on some student characteristics, they hardly help to control other types of endogeneity. First, the beneficial pressure on early entrants needs not necessarily come from older peers. If the youngest students are assigned to separate classes, they have high chances of encountering classmates with high socioeconomic status, as such children are, according to our results, more likely to enter school before the compulsory term. The selection of peers cannot be addressed, as we have no information on the composition of classes attended by the students examined.\nMoreover, the learning outcomes of 6-year-olds versus 7-year-olds may be affected by nonrandom assignment of students to schools and teachers to students. Given that many indicators of school quality (test results, value-added measures, parents' opinions) are publicly available, parents could be more willing to send the child to the 1 st grade before the compulsory term, if they had a high performing school in the neighborhood. As for teacher selection, since in the transitional period of the reform schools faced enormous pressure and control from both regulators at different administration levels and the parents, it seems possible that they tended to assign their best teachers to the youngest classes. Again, these hypotheses remain unverifiable given the data possessed.\nIt is highly recommended to continue the research on the consequences of lowering the school starting age in Poland. Testing the achievements of the 2008 cohort, of which those born early in the year became enrolled in school at the age of six on an obligatory basis, will help to minimize (although not eliminate) the endogeneity issues. Monitoring the performance of young school entrants in further grades will provide new evidence on the persistence of school starting age effects throughout the educational experience and beyond."}]