[{"section_title": "Abstract", "text": "Nitrous oxide is a powerful greenhouse gas that is emitted from cropland treated with nitrogen fertilizer. Reducing such emissions through nutrient management might be able to produce offsets for sale in a cap and trade program aimed at reducing greenhouse gases. We use the Nitrate Leaching and Economic Analysis Program (NLEAP) model and data from the Agricultural and Resource Management Survey to examine what changes in rate, timing, or method of application a farmer would take to produce offsets. We find that reducing the application rate is the most favored approach for producing offsets. We also find that some management choices may increase nitrate losses to water."}, {"section_title": "", "text": "Most cropping systems are naturally deficient in nitrogen (N). Gaseous nitrogen (N 2 ) is abundant in the atmosphere, but it cannot be used by living organisms unless it is first converted into usable forms. Leguminous plants and soil microorganisms can contribute significant amounts of fixed nitrogen that can be used by crops, but yields necessary to support growing populations need more nitrogen than can be provided by natural means.\nMassive inputs of biologically usable reactive forms of nitrogen, fixed from atmospheric N through the Haber-Bosch process, enable high crop yields but have radically altered the nitrogen balances in aquatic, atmospheric, and terrestrial nitrogen pools. This has led to disruptions in ecosystem function and the supply of valuable ecosystem services (Galloway et al. 2008) . One source of concern is nitrous oxide emissions from crop production.\nNitrous oxide (N 2 O) is a powerful greenhouse gas (310 times the warming potential of carbon dioxide) and an important source of ozone depletion (Ravishankara, Daniel, and Portmann 2009, Wuebbles 2009 ). In the United States, about 73 percent of N 2 O emissions are from agriculture (U.S. Environmental Protection Agency 2010). N 2 O is produced in the soil predominantly by the microbial processes of nitrification (ammonia oxidation) and denitrification (nitrate reduction) (Robertson and Groffman 2007) . About 44 percent of all agricultural greenhouse gas emissions are from soil fertilizer management, making it the largest agricultural source (U.S. Environmental Protection Agency 2010). About 28 percent of agricultural greenhouse gas emissions are methane from enteric fermentation from livestock, and 12 percent are various gases from manure handling and storage. Agricultural emissions of N 2 O have increased since 2003, largely as a result of increased use of synthetic nitrogen fertilizers associated with rising demand for corn-based ethanol (U.S. Energy Information Administration 2009). Factors affecting N 2 O creation in the soil include those that affect available carbon, inorganic nitrogen, and oxygen, as well as soil moisture, soil porosity, and aggregate structure (Robertson and Groffman 2007) .\nFarmers can reduce N 2 O emissions in a variety of ways through fertilizer, soil, water, and crop management. A variety of policy instruments are available to government to induce management changes. One approach is a cap and trade program for mitigating emissions of CO 2 and other greenhouse gases. Current discussions over regional and national greenhouse gas (GHG) cap and trade policies have generally not included agricultural emissions under a cap, but these policies could allow agriculture to provide GHG reductions as offsets that could be purchased by the regulated sectors. For example, in the American Clean Energy and Security Act of 2009 (HR 2454), the cap and trade proposal passed by the U.S. House of Representatives, reductions in N 2 O from reduced nitrogen fertilizer use are potentially eligible to be sold as offsets.\nIn this paper we use the new Nitrogen Loss and Environmental Assessment Package with GIS capabilities (NLEAP-GIS) model and cost data from the Agricultural Resources and Management Survey (ARMS), collected by the U.S. Department of Agriculture (USDA) Economic Research ServiceNational Agricultural Statistics Service (ERS-NASS), to explore what changes corn farmers might make, given the opportunity to participate in an offset market for N 2 O reductions. Corn is the most widely planted crop in the United States, and the biggest user of nitrogen fertilizer. We also examine the potential for tradeoffs with other nitrogen-related environmental problems. Our analysis was conducted across different management scenarios and hydrologic soils (e.g., welldrained soils with a large leaching potential, versus poorly drained soils with a low leaching potential) from a selected county in each of four states: Virginia, Ohio, Pennsylvania, and Arkansas."}, {"section_title": "Trading Basics", "text": "Emission trading is organized around the creation of discharge allowances, which is a time-limited permission to discharge a fixed quantity of pollutant into the environment. Whereas atmospheric quality has characteristics of a public good, making it difficult to control using market-based instruments, a discharge allowance has characteristics of a private good; it is rival and exclusive (Ribaudo et al. 2008) . Property rights are enforced by the regulatory agency managing the program.\nA regulatory agency creates demand for discharge allowances by restricting the number of allowances in a market. The regulatory agency first determines the maximum amount of discharge of a particular pollutant the environment can absorb and still meet environmental quality goals. This becomes the emissions cap. The cap is used to set a discharge limit for each regulated firm that becomes part of their discharge permits. Discharge allowances equal to the emissions cap are allocated to all regulated dischargers through an auction or simply allocated free of charge acording to some allocation rule (Tietenberg 2006) . By allowing the allowances to be traded, a market is created that allocates discharge among regulated firms. If the market operates smoothly, a cap and trade program can achieve environmental goals at a lower cost than command-and-control regulations alone (Tietenberg 2006) . Firms that have low pollution control costs will supply a greater extent of the pollution control. A market allows maximum flexibility for firms, in that a firm can meet its obligations by installing pollution control technology, adopting more efficient production technology, rearranging production processes, or purchasing credits (Ribaudo, Horan, and Smith 1999) .\nWhen an unregulated sector such as agriculture is included in a market, it can create offsets that can be sold in the market by adopting management practices that reduce the emissions of the regulated pollutant. As long as agriculture can reduce nitrous oxide emissions at a lower unit cost than regulated sources (i.e., power plants), it stands to benefit financially from such a market, and regulated sources can achieve their permit requirements at a lower cost than if they were limited to trading amongst themselves.\nSince nitrogen can readily change forms and is highly mobile in soil, water, and air, a strategy for reducing N 2 O emissions is to improve overall nitrogen use efficiency (NUE). This would reduce the amount of nitrogen in the soil available to be lost to the environment (Cassman, Dobermann, and Walters 2002) . The basic practices for improving NUE are appropriate timing of applications, proper placement, and an agronomic application rate (U.S. Department of Agriculture and Natural Resources Conservation Service 2006).\nOne of the main factors affecting nitrogen use efficiency is the application rate (Bock and Hergert 1991 , Millar et al. 2010 , Meisenger, Schepers, and Raun 2008 . Nitrogen losses have been shown to increase rapidly when N inputs exceed assimilation capacity (Vanotti and Bundy 1994 , Schlegel, Dhuyvetter, and Havlin 1996 , Bock and Hergert 1991 . Reducing application rates reduces the losses of all forms of reactive nitrogen.\nThe goal of appropriate methods and placement of fertilizer is to provide nutrients to plants for rapid uptake and to reduce the potential for environmental losses. Studies have shown that efficiency can be doubled under some conditions by incorporating fertilizers in the soil, rather than \"broadcasting\" them on the surface (Malhi and Nyborg 1991, Power, Wiese, and Flowerday 2001) . Liquid or gaseous forms of nitrogen can be injected directly into the soil with specialized equipment. Solid forms can be broadcast on the surface and immediately incorporated into the soil by disking. Such placement reduces the opportunity for losses to the atmosphere and through surface runoff. For situations where ammonia volatilization is a significant pathway for nitrogen losses, the method of application can significantly reduce losses (Meisenger and Randall 1991 , Peoples, Mosier, and Freney 1995 , Fox, Piekielek, and Macneal 1996 , Freney, Simpson, and Denmead 1981 .\nThe research on improving nitrogen use efficiency in crop production has emphasized the need for greater synchronization between crop nitrogen demand and the supply of nitrogen from all sources throughout the growing season (Doerge, Roth, and Gardner 1991 , Cassman, Dobermann, and Walters 2002 , Meisinger and Delgado 2002 . Balancing supply and demand implies maintaining low levels of inorganic nitrogen in the soil when there is little plant growth, and providing sufficient inorganic nitrogen fertilizer during periods of rapid plant growth (Alva et al. 2006, Doerge, Roth, and Gardner 1991) . For example, the corn plant's need for nitrogen is not very high until about four weeks after emergence, which in the major corn producing states is June through July (Baker 2001) . Ideally, to ensure that growing crops have adequate N and to minimize losses from the soil, a farmer could split nitrogen applications or \"spoon feed\" nitrogen when using center-pivot sprinkler irrigation systems from June through July-August using information from soil tests and/or advanced remote sensing techniques (Bausch and Delgado 2003) . However, there is a cost to doing this. Workload, seasonal fertilizer price differences, the risk associated with not being able to apply at the right time, application costs, the possibility of compacting the soil, and possible damage to growing crops all must be considered; nonetheless, splitting nitrogen applications can increase nitrogen use efficiency and reduce nitrogen losses to the environment (Doerge, Roth, and Gardner 1991 , Westermann, Kleinkopf, and Porter 1988 , Westermann and Kleinkopf 1985 , Alva et al. 2006 , Delgado and Bausch 2005 .\nIt should be noted that there are a number of other practices that influence soil nitrogen processes, including cover crops and conservation tillage. Research has found the influences of these practices on N 2 O emissions to be small and that the application rate is the single largest factor affecting emissions (Millar et al. 2010 , Jarecki et al. 2009 , Wagner-Riddle and Thurtell 1998 .\nCorn receives about 66 percent of all nitrogen fertilizers applied to field crops in the United States, making it the most important crop in terms of potential N 2 O emissions. We assessed the percentage of corn acres practicing \"good\" nitrogen management with data from the 2005 corn Agricultural and Resource Management Survey 1 . For this study the appropriate rate is defined as 40 percent more nitrogen than what is removed with crop harvest, which is consistent with NRCS treatment of application rate evaluation in their assessment of the Upper Mississippi Basin (U.S. Department of Agriculture 2010). Appropriate timing is defined as no fall applications. Appropriate method is defined as injection or incorporation immediately after surface application. About 30 percent of the 76 million acres of corn that received nitrogen fertilizer in 2005 met the timing, rate, and method criteria (Table 1) . This implies there may be ample opportunity for corn producers to produce nitrous oxide offsets in the presence of a market for greenhouse gas reductions.\nWhile meeting the rate, timing, and method criteria for good nitrogen management may improve overall nitrogen use efficiency, the impacts on N 2 O emissions are not so clear-cut. Applying all nitrogen during the planting and growing seasons 1 ARMS is an annual survey of farm and ranch operators administered by USDA's National Agricultural Statistics Service (NASS). Survey data on field-level production practices, farm business accounts, and farm households are collected. ARMS is a multiple-phase survey. In the fall, NASS interviews producers of major commodities, such as feed grains, food grains, or cotton, to collect information about production practices and land use for a selected field on their operation. In the spring, NASS reinterviews farmers who successfully completed the fall survey. Spring data collection focuses on the structural and economic characteristics of the farm business and farm operator households. This approach helps link commodity production activities and conservation practices with the farm business and operator household. (Hao et al. 2001, Hultgreen and Leduc 2003) . However, applying nitrogen in the spring, with its warmer and wetter conditions, may actually increase N 2 O emissions , HernandezRamirez et al. 2009 , Rochette et al. 2004 , Tilsner et al. 2003 , Wagner-Riddle and Thurtell 1998 , even though overall NUE is higher than for fall applications.\nInjecting or incorporating fertilizer into the soil so that it is closer to the plant roots and away from the surface can reduce the risk of nitrogen loss and improve overall nitrogen use efficiency. But again, the impact of fertilizer placement on nitrous oxide emissions is difficult to generalize. Liu et al. (2006) found that injection of liquid urea ammonium nitrate at deeper levels resulted in 40 percent to 70 percent lower N 2 O emissions compared to shallow injection or surface application. Studies have reported that incorporation increases N 2 O emissions (Wulf, Maeting, and Clemens 2002, Flessa and Beese 2000) . Drury et al. (2006) found that emissions of N 2 O were on average 26 percent higher with deep placement of ammonium nitrate in a clay loam compared to shallow placement.\nThe impact of rate on N 2 O emissions is more certain. A large set of studies indicates that excessive nitrogen inputs contribute to increases in N 2 O emissions (Bouwman, Boumans, and Batjes 2002 , Jarecki et al. 2009 , McSwiney and Robertson 2005 "}, {"section_title": "Model and Data", "text": "We used the new Nitrogen Loss and Environmental Assessment Package with GIS capabilities (NLEAP-GIS) model to assess how changes in nitrogen management practices on corn affect the losses of nitrate (to water), nitrous oxide (to air), and ammonia (to air) ). The NLEAP model has been used extensively across national and international systems (Delgado et al. 2008 ). This tool is capable of simulating the effects of management practices and generating reasonable assessment values that are similar to measured field studies conducted across small-scale plots and large commercial field operations (e.g., water budgets, nitrate leaching, residual soil nitrate, crop uptake, nitrogen dynamics, and N 2 O emissions) (Beckie et al. 1995 , Xu, Shaffer, and Al-kaisi 1998 Because NLEAP is a field-level model, we selected eight different soils in four states (Arkansas, Ohio, Pennsylvania, and Virginia) to assess changes in nitrogen emissions to the environment from management changes in nonirrigated corn production. Four of the soils are type A or B soils (well drained) and four are type D soils (relatively poorly drained). The slopes for these soils were 0 percent to 6 percent, with low erosion potential. For each soil, we examined two rotations (corncorn and corn-soybeans); two tillage practices (conventional and no-till); two sources of nitrogen (inorganic fertilizer and inorganic fertilizer + animal manure); two application methods (surface and inject/incorporate); two timing choices (fall and spring growing season); and two application rates (agronomic rate and overapplication). In total, 64 different scenarios were modeled for each soil (512 scenarios in all).\nTo evaluate these systems, some basic assumptions are made to simplify the evaluation process, which is very complex due to the nature of the nitrogen cycle and management interactions with environmental factors ."}, {"section_title": "Nitrogen Inputs and Uptake", "text": "Nitrogen fertilizer inputs and crop yields are critical inputs to NLEAP. They determine the amount of nitrogen entering the system and how much is removed from the system at harvest. The nitrogen remaining in crop residue, soil profile, and soil nitrogen pools is available for cycling to air or water. We assume an agronomic nitrogen application rate that supplies just enough nitrogen to meet expected yields, given unavoidable losses in the soil. We used state average yields for corn and soybeans derived from the USDA Census of Agriculture, rather than maximum expected yields. For agronomic nitrogen application rates, we used the recommended best management practices for sitespecific state and/or soil as described by Espinoza and Ross (2008) for Arkansas; Alley et al. (2009) for Virginia; Beegle and Durst (2003) for Pennsylvania; and Vitosh et al. (1995) for Ohio. For no-till systems, we had to account for two factors that influence agronomic nitrogen application rates. First, we assumed that yields under no-till are about 10 percent less than under conventional tillage (Ma et al. 2007 . This leads us to simulate a lower N application rate, which is based on yields. In addition, since a similar rate of uptake per unit of bushel was used for both systems, the removal of nitrogen in harvested grain from the no-till system is also lower than the removal of nitrogen in the grain from the higher-yield conventional system. This implies a larger carryover of nitrogen for succeeding crops in the residue, which an agronomic application rate would have to account for. Initial surface residue cover was simulated at 100 percent, 90 percent, 40 percent, and 30 percent for no-till corn-corn, no-till corn-soybeans, conventional corn-corn, and conventional corn-soybeans, respectively. For the manure system, manure was applied every 2 years. For the corn-corn rotation, manure was applied in the first year, and only commercial fertilizer was applied in the second year. The manure rate was calculated for each system to match the fertilizer rate. However, since manures have a large fraction of organic nitrogen that is not immediately available (Davis, Iversen, and Vigil 2002, Eghball et al. 2002) , an additional 50 percent of the recommended rate was added as inorganic nitrogen fertilizer. In other words, the total nitrogen input during the first year of corncorn rotation was 150 percent of the total application rate of the inorganic nitrogen fertilizer scenario (Table 1) . This is consistent with a recommendation that manure applications be supplemented with commercial fertilizer to insure growing crops receive sufficient nitrogen (Iowa Soybean Association 2008). The corn-corn rotation did not receive any manure application in the second year, and the corn received the same rate of nitrogen fertilizer as in the nitrogen-fertilizeronly scenario. Thus, over the two-year period, the manure scenario for corn-corn received an average 25 percent more nitrogen input per year.\nThe corn-soybean rotation did not receive any nitrogen fertilizer or manure during the soybean year (Table 1) . Additionally, nitrogen cycling from the leguminous soybean crop was credited, as is recommended for each state, so the calculated nitrogen inputs for the corn in the cornsoybean rotation were lower than in the corn-corn system.\nThe yield effect of excessive nitrogen application rates was derived from the corn yield and nitrogen input response curve from Bock and Hergert (1991) . For this study, we defined overapplication as 75 percent more than the recommended, agronomic-based rate. This is at the upper limits of application rates for corn observed in the ARMS data. Based on Bock and Hergert (1991) , we assumed that overapplication increased yields by only 1 percent. We believe that our approach of using average yields to evaluate the effects of management on the nitrogen use efficiency of commercial systems is a valid one, as reported by Shaffer and Delgado (2001) , Delgado (2001) , Delgado, Follett, and Shaffer (2000) , and Delgado et al. (2001) . A summary of the nitrogen inputs we used in the NLEAP scenarios is presented in Table 2 . Differences in yields were valued at $4.50 per bushel."}, {"section_title": "Long-Term Evaluations", "text": "All scenarios were evaluated with NLEAP over the long term to arrive at average annual losses of nitrogen compounds from the field. The NLEAP model was run for a 24-year period, using longterm weather data for the given county. The first 12 years were used to reach an equilibrium, and years 13 to 24 were used to evaluate the effect of management practices on nitrogen use efficiency and on reactive losses to the environment , Delgado et al. 2008 )."}, {"section_title": "Costs", "text": "Changing management practices to reduce N 2 O emissions can entail costs for a farmer, in terms of changes in production costs and yields. We used data from the 2001 corn ARMS survey to estimate average per-acre production costs for farms with different sets of management practices 2 . We assumed that differences in management costs represented the long-term costs of shifting from one set of management practices to another. We assumed farmers would maintain the same basic cropping system (crop rotation and tillage), only altering timing, method, or application rate to improve nitrogen use efficiency and reduce N 2 O emissions.\nTotal variable costs (TVC) were defined as the costs of seed, fertilizer, manure, pesticides, custom work, and fuel lubricants. We specified a model of TVC as a function of the following variables: 1) Use of Bt or herbicide resistant corn 2) Use of rotation with soybeans 3) Use of nitrogen inhibitor 4) Tillage (conventional till vs. reduced/no till) 5) Timing (fall vs. spring application) 6) Method (broadcast vs. inject/incorporate) 7) Conservation cropping (contour or strip) 8) Presence of nutrient management plan 9) Use of variable rate technology 10) Presence of irrigation 11) Presence of HEL soils (yes or no) 12) Presence of tile drains 13) Growing season (northern tier, middle tier, southern tier) 14) Farm size (total corn acres on farm) 15) Yield goal An interaction term for timing and method (fall/no fall-incorporate/broadcast) was also included. The cost model was run separately for those farms that do not use manure and for those farms that use both manure and commercial fertilizer. About 16 percent of U.S. corn acres receive manure.\nSince most of the variables are class variables, we used the SAS General Linear Model procedure (GLM) to estimate the model. The RSquares of the no manure and manure cost models are 0.21 and 0.16 respectively, and the models are significant at the 1 percent level. The majority of the explanatory variables are statistically significant at the 5 percent level. Leastsquare means of the production costs ($/acre) under the different management systems are presented in Table 3 , along with an indication of whether the difference is statistically significant. Of interest to this study is that the cost under the preferred method/timing combination (spring/ incorporate) is significantly lower than the costs under the less-preferred, alternative combinations (at the 5 percent and 10 percent levels) for those farms that use only commercial fertilizer (84 percent of treated corn acres). No significant differences in costs were found for farms that use both manure and commercial fertilizer.\nPart of the difference in costs observed with the ARMS data are due to differences in chemical application rates. Since the NLEAP scenarios assumed the management changes were independent, altering the rate, timing, and method in different combinations, we needed to separate out the nitrogen fertilizer cost from the total of changing management. We ran the same models, but with nitrogen application rate as the dependent variable. Both the models were significant, with R-squares of 0.23 and 0.24. Differences in application rates between the spring/inject and the other management combinations were positive (as expected) and significant at the 1 percent level for farms using only commercial fertilizer (Table 4) . The difference in nitrogen fertilizer costs was subtracted from the cost difference derived from the cost model, using a nitrogen fertilizer price of $0.30/lb.\nThe cost of adopting the appropriate method (assuming no change in the fertilizer application rate) was estimated to be $7.35/acre, appropriate timing $3.01 per acre, and both appropriate method and timing $1.86/acre. For farms using manure, we assumed no differences in costs.\nEach of the 512 NLEAP scenarios was treated as the baseline for a model farm. We used the NLEAP results and the cost estimates to identify the management option (reduced rate, improved timing, or improved application method) that reduced nitrous oxide emissions at least net cost for each baseline scenario, while meeting a requirement that total nitrogen emissions (the sum of NO 3 -N, N 2 O-N, and NH 3 -N losses) did not increase. We then used the NLEAP model results to estimate the economic return from selling offsets for a price of $15 per ton/CO 2 equivalent (based on EPA analysis of the American Clean Energy and Security Act of 2009, H.R. 2454). Table 5 summarizes which nitrogen management systems the model farmers would adopt in order to produce credits at least cost, given baseline practices and soils. For example, of the 64 farm types not meeting any of the three criteria in the baseline (\"None\" in the Baseline criteria column), 17 would reduce application rate to the criterion rate, 10 would reduce rate and inject/incorporate, 1 would reduce rate and spring apply, and 36 would adopt all three management choices. The choice depends on the soil type, climate, rotation, tillage practice, and nitrogen source."}, {"section_title": "Results and Discussion", "text": "The results highlight the importance of meeting the application rate criterion for reducing both N 2 O and total reactive nitrogen. For all farms not meeting the rate criterion in the baseline, reducing the application rate, either alone or in combination with another practice, was selected to reduce N 2 O. Method or timing was never the sole practice adopted by farms to reduce N 2 O emissions. The modeling also indicates that 148 of the 512 farming systems will not be able to reduce N 2 O emissions by meeting the rate, timing, or method criteria. For example, none of the 64 farm types meeting the rate and method criteria in the baseline can reduce N 2 O emissions by also meeting the timing criterion. Table 6 provides more detail for one soil in Ohio. It shows the reduction in N 2 O that would be generated for each decision a farmer in a particular baseline situation would make, and offset revenue earned assuming a carbon price of $15 per ton of CO 2 equivalent. The range of N 2 O reductions presented here is similar to those found in the other soils modeled with NLEAP.\nEven though our sample of cropping conditions is very small, we believe we can still make some general inferences from the results. We found that if in the baseline system our criterion application rate is exceeded, the application rate will be reduced to produce offsets, either alone or in combination with timing or method; reducing the application rate is generally the most costeffective means of reducing N 2 O emissions. This is consistent with the findings in the literature concerning the importance of the application rate in addressing nitrous oxide emissions (Kim and Dale 2008, Millar et al. 2010) . Adopting method and/or timing BMPs either cannot reduce N 2 O emissions or can do so only by reducing overall nitrogen use efficiency, which is not permitted under our simulated market rules.\nFarms already meeting both the rate and method criteria will only be able to reduce N 2 O emissions by reducing their application rate below recommended rates. We explored this further by using NLEAP to assess potential reductions in 1 Criteria are appropriate rate, timing, and method of nitrogen application. Note: There are a total of 512 cropping systems evaluated with NLEAP, 128 in each of Arkansas, Ohio, Pennsylvania, and Virginia. Each system defines a soil type (A or D), a rotation (continuous corn, corn soybeans), tillage practice (conventional, notill), nutrient source (inorganic, manure+inorganic), timing of application (before planting, at/after planting), method (inject/ incorporate, broadcast) and application rate (meet criterion, 75 percent over criterion).\nnitrous oxide from reducing application rates below the recommended rate by 25 percent. Based on the nitrogen-yield response curve of Bock and Hergert (1991) , a 25 percent reduction in nitrogen was assumed to reduce yields by 10 percent. The NLEAP modeling indicates only small reductions in N 2 O when the application rate is reduced to below the criterion rate. This is consistent with field studies that indicate a nonlinear relationship between excessive N application rates and N 2 O emissions (Jarecki et al. 2009, McSwiney and Robertson 2002) . For example, reducing the application rate from the criterion rate to 25 percent below the recommended rate only reduces N 2 O by between 0.2 pounds and 1.3 pounds per acre for the Class A (well-drained) soil in Ohio, depending on the cropping system. Assuming a credit rate of $15 per ton CO 2 equivalent, this translates into a payment of between $0.46 and $3.02 per acre. These rates are insufficient to cover the reduction in corn yields. Even for smaller N reductions, it is unlikely that revenue from GHG offsets would be sufficient to cover the increased yield risk from cutting N application rates. However, higher offset prices could increase the incentive to cut application rates to reduce N 2 O emissions, even when yields might be reduced. Another finding is that the potential revenue from GHG offsets produced by reducing N 2 O appears to be quite small. In our Ohio example, only a few situations are capable of producing credit revenue of over $5.00 per acre, assuming a credit price of $15 per ton of CO 2 equivalent (and the results are similar for the other states we studied). These rates are less than those farmers could receive for nutrient management from EQIP, which is a measure of what farmers are willing to accept for the practice (program data for the Environmental Quality Incentive Program, 1997 Program, -2008 . In general, farms overapplying nitrogen and broadcasting fertilizer can produce the largest reductions in N 2 O. However, only 8.3 percent of corn acres fell in this category in 2005. While we found that changes in operating costs after changing management are near 0 or even negative in most cases, we did not consider short-term adjustment costs, changes in risk, or the administrative costs of participating in an offset program.\nOne of the issues we investigated is the possibility that reducing N 2 O could increase nitrate losses to water. It might seem that allowing only management changes that do not increase total losses of nitrogen would prevent this, but we found otherwise. In 25 percent of the cases where management changes were made to reduce N 2 O, NO 3 losses to water increased, even though total nitrogen emissions fell. This occurred almost exclusively when the rate criterion was already being met and injection/incorporation was adopted as an additional practice. While overall N 2 O and total nitrogen losses decreased, water quality was made worse. Such an outcome would be a concern in regions trying to address important water quality problems, such as the Gulf of Mexico, where corn production is a major source of nitrogen at the root of the hypoxia problem (Goolsby et al. 2001 ). An offset program may address this issue by recognizing the creation of offsets only from reduced nitrogen application rates.\nAn important factor in assessing farmers' response to a GHG market is that carbon sequestration also generates offsets. Long-term no-till is generally the practice that sequesters carbon without converting cropland to some other use, such as trees. If adopting no-till also reduces N 2 O emissions, then farmers would benefit from producing both carbon sequestration and N 2 O reductions for a market. Results from the NLEAP modeling indicate that switching from conventional tillage systems to less intensive, reduced tillage systems, without making any other changes to nitrogen management other than adjusting the application rate if expected yield changes, generally reduces N 2 O emissions on fine-grained soils (hydrologic class D). However, N 2 O emissions on well-drained soils (hydrologic class A) increase. In cases where switching to less intensive no-till systems does not produce N 2 O reductions, a farmer must decide which approach produces the greatest economic benefit. For farmers already using no-till prior to a trading program, N 2 O reductions may be the only option available to reduce emissions."}, {"section_title": "A Note on New, Advanced Fertilizers", "text": "Since N 2 O emissions are produced via the biological reactions of nitrification and denitrification, new fertilizers such as controlled-release fertilizers and nitrification inhibitors have become available. These fertilizers have been proven to slow these biogeochemical reactions. Slowing the conversion of NH 3 or NH 4 (nitrogen inputs) to the nitrate form of N significantly reduces the emissions of N 2 O (Delgado and Mosier 1996, Minami 1994) . These new fertilizers can also slow the rate of losses via other pathways, such as leaching, and contribute to the synchronization of nitrogen inputs with nitrogen uptake without reducing yields. For example, Shoji et al. (2001) were able to use about 50 percent of the commercial nitrogen fertilizer rate without reducing total potato tuber yields in Colorado. Additionally, other amendments such as nitrification inhibitors could also slow down these reactions and contribute to lower N 2 O emissions (Bronson and Mosier 1993 , Minami 1994 . NLEAP can be used to simulate the effects of these new types of fertilizers. One factor to consider is that these new fertilizers have a higher cost than the traditional urea fertilizer. Since these fertilizers are not currently used in a large percentage of the area in corn, we did not analyze them in this scenario."}, {"section_title": "Summary", "text": "A market for greenhouse gases could provide an incentive to reduce nitrous oxide emissions from cropland. Our findings suggest that not all farms will benefit from a market for N 2 O reductions. Those already meeting rate, timing, and method criteria for good nitrogen management, and those meeting rate and method criteria, cannot make any improvements to nitrogen management that reduce N 2 O without increasing total nitrogen emissions, except by reducing the application rate below the recommended rate or by switching to crops that use less nitrogen. Over 40 percent of corn acres fit in these categories. However, to reduce nitrogen application rates below recommended levels would not make economic sense unless the credit price was much higher than the $15 per ton CO 2 equivalent we assumed.\nOur findings are also relevant for any program that pays farmers to reduce nitrous oxide emissions. Our findings also point out the importance of considering the entire nitrogen cycle when targeting one particular nitrogen compound. Altering management practices to reduce N 2 O emissions could increase the loss of NO 3 to water resources through increased leaching to groundwater and subsurface flow to surface water. In regions trying to deal with nutrient enrichment to water resources, increased nitrate losses would not be welcome. A trading program could address this problem by restricting the types of practices that could be used to reduce N 2 O emissions. Based on our findings, reduced application rates provide the best opportunity to reduce N 2 O emissions and NO 3 losses.\nThis research is an initial look at the implications of a financial incentive approach to reducing nitrous oxide emissions from corn production. Additional research that is more representative of corn production in the United States, and that considers the cost of increased yield variability that reduced application rates, advanced fertilizers (controlled-release fertilizers, nitrification inhibitors, etc.), and/or advanced management techniques such as remote sensing and split nitrogen applications are likely to bring, is a logical next step."}]