[{"section_title": "Abstract", "text": "Abstract\nTo evaluate the potential clinical value of quantitative functional FDG PET and pathological amyloid-β PET with cerebrospinal fluid (CSF) biomarkers and clinical assessments in the prediction of Alzheimer's disease (AD) progression.\nWe studied 82 subjects for up to 96 months (median = 84 months) in a longitudinal Alzheimer's Disease Neuroimaging Initiative (ADNI) project. All preprocessed PET images were spatially normalized to standard Montreal Neurologic Institute space. Regions of interest (ROI) were defined on MRI template, and standard uptake values ratios (SUVRs) to the cerebellum for FDG and amyloid-β PET were calculated. Predictive values of single and multiparametric PET biomarkers with and without clinical assessments and CSF biomarkers for AD progression were evaluated using receiver operating characteristic (ROC) analysis and logistic regression model.\nThe posterior precuneus and cingulate SUVRs were identified for both FDG and amyloid-β PET in predicating progression in normal controls (NCs) and subjects with mild cognitive impairment (MCI \nQuantitative FDG and 11 C-PiB PET with clinical cognitive assessments significantly improved accuracy in the predication of AD progression."}, {"section_title": "Introduction", "text": "Alzheimer's disease (AD) is a slowly developed dementia. The symptoms could appear years after the biochemical changes in the brain happen. Paying considerable attention to the changes prior to clinical signs would be beneficial to both early diagnosis and possible treatment [1, 2] . People with mild cognitive impairment (MCI) proved to be at high risk of developing AD dementia, particularly for those in late MCI (LMCI) [3] . The pathological criteria for AD, or MCI due to AD, includes neuropathological evidence of neurofibrillary tangles and senile plaques with extracellular β-amyloid (Aβ) deposition and abnormal total tau (t-tau) or phosphorylated-tau (p-tau) deposition [4] . Although the clinical diagnosis of AD is mostly centered on the occurrence of clinical symptoms and cognitive impairment assessments, the new guideline proposed by National Institute of Aging and Alzheimer's Association workgroups in 2011 provides updated details about the biomarkers associated with AD aside from clinical assessments [5] .\nCurrently, the biomarkers of amyloidosis include Aβ and tau concentration in cerebrospinal fluid (CSF) and Aβ and tau brain deposition imaged by positron emission tomography (PET). Indicators extracted from structural and functional neuroimaging, such as atrophy detected by magnetic resonance imaging (MRI) and hypometabolism detected by 18 F-fluorodeoxyglucose (FDG) PET, could also provide essential information closely associated with disease development [5] . The integration of these techniques brings new opportunities, as well as challenges, to the multimodality neuroimaging era in AD clinic and research [6] . FDG PET is used to detect the impairment of neuronal injury through the reduction of regional cerebral glucose metabolism in AD progression [7] . Amyloid deposition could also be measured by PET modality using tracers like 18 F-florbetapir ( 18 F-AV45) and 11 C-Pittsbrugh Compound-B ( 11 C-PiB). The correlation between the measurement of PET amyloid imaging and histological evidence of Aβ deposition were ascertained by several studies [8, 9] . It is now commonly accepted that the combination of different measurements yield promising evaluations for the prediction of disease progression. Longitudinal analysis of AD is essential because as AD develops over many years, the abnormality and order of changes for each biomarker are quite different [10, 11] . Nowadays, the quantitative PET technique is considered as a critical tool for monitoring and evaluating the AD progression. Evaluation of single or multiparametric PET performance in diagnosis and monitoring are indispensable for standardization and optimal use of PET in AD imaging. Through indirect study, comparable characteristics were found among the three widely-used radiotracers, FDG, 18 F-AV45 and 11 C-PiB [12] . However, the direct combination and comparison of these three radiotracers, especially for a longer follow-up time period, would still be meaningful for the further studies. Alzheimer's Disease Neuroimaging Initiative (ADNI) (http://adni.loni.ucla.edu/) is an international longitudinal multi-site multimodal AD imaging study with standardized image acquisition and processing procedures. In this study, a subpopulation with follow-up as long as 96 months from the ADNI project was selected to evaluate the potential clinical value of quantitative FDG, 18 F-AV45 and 11 C-PiB PET in the diagnosis and monitoring of AD progression.\nVarious combinations of studying groups (normal controls, MCI, and AD), multiparametric PET images, CSF measurements, and clinical assessments were evaluated for improving the accuracy of diagnosis and monitoring of AD progression. A total of 82 ADNI subjects (Subject IDs listed in S1 File) were included in this study. Thirty-four and 48 subjects were diagnosed normal control (NC) and MCI at baseline, respectively. These subjects were followed for up to 96 months to ascertain the diagnosed status and progression (mean = 76.7 months; median = 84 months). To the best of our knowledge, this is a longest longitudinal study focusing on PET biomarkers from ADNI database."}, {"section_title": "Materials and Methods", "text": ""}, {"section_title": "Data collection from ADNI", "text": "All the subjects had baseline and follow-up FDG data. All 18 F-AV45 and 11 C-PiB PET scans for amyloid-β imaging were added in follow-up studies. Structural MRIs (1.5T or 3T, magnetization-prepared rapid acquisition gradient echo (MP-RAGE) were collected for each baseline and follow-up. Demographics, Apolipoprotein E (APOE) genotypes and CSF measurements, as well as clinical assessments were also downloaded from ADNI database."}, {"section_title": "Status of subject: cognitively normal, MCI, and AD", "text": "The detailed criteria for each status and overall study protocol can be found at www.adni-info. org. In short, cognitively normal subjects had Mini-Mental State Exam (MMSE) scores between 24 and 30 inclusively, a Clinical Dementia Rating (CDR) of zero, were non-depressed, non-MCI, and non-demented. MCI subjects had MMSE scores between 24 and 30 (inclusive), a memory complaint, objective memory loss, a CDR score of 0.5, absence of significant impairment in other cognitive domains, and preserved activities of daily living. AD subjects presented with MMSE scores ranging from 20 to 26 inclusively, a CDR ! 0.5, and met the NINCDS/ADRDA criteria [13] for probable AD."}, {"section_title": "Cognitive assessments", "text": "Besides MMSE, the cognitive assessments also included Alzheimer's Disease Assessment ScaleCognitive Sub-scale (ADAS-Cog). ADAS-Cog TOTAL 11 contains eleven items including word recall, recognition, naming, etc. (range 0-70) and ADAS-Cog Total Mod includes all the eleven items plus delayed word recall and number cancellation (range 0-85).\nCSF biomarkers: Aβ, t-tau, p-tau, t-tau/Aβ, p-tau/Aβ CSF was acquired by lumbar puncture and the methods for collection of CSF samples are described at http://adni.loni.usc.edu/methods/documents/. The levels of CSF Aβ, t-tau, and ptau were measured using the multiplex xMAP Luminex platform (Luminex Corp., Austin, TX) with Innogenetics (INNOBIA AlzBio3; Ghent, Belgium; for research-use only reagents) immunoassay kit-based reagent. The variables of CSF biomarker were Aβ, t-tau, p-tau, and ratios of t-tau/Aβ and p-tau/Aβ."}, {"section_title": "Image acquisition, processing, and quantification", "text": "All FDG, 18 F-AV45 and 11 C-PiB PET scans were downloaded from http://adni.loni.usc.edu/ as the pre-processed format (co-registered, averaged, standardized image and voxel size, uniform resolution). The detailed methods could be found at http://adni.loni.usc.edu/methods-/petanalysis/pre-processing/. Briefly, the separate PET frames were aligned to one another, averaged, reoriented and then interpolated into a standard image and voxel size (image volume 160×160×96, 1.5x1.5x1.5 mm in x, y, z). Lastly, all the PET images were smoothed to a uniform resolution of 8 mm in full width at half maximum (FWHM).\nThe downloaded PET and MRI images were then processed using Statistical Parametric Mapping software (SPM8, Wellcome Department of Imaging Neuroscience, London, United Kingdom) and MATLAB (The MathWorks Inc.). All preprocessed mean PET images were coregistered to structural MRI images at each follow up. The MRI images were normalized to standard Montreal Neurologic Institute (MNI) space using SPM8 with a MRI template provided by VBM8 toolbox [14, 15] , and the transformation parameters determined by MRI spatial normalization were then applied to the coregistered PET images for PET spatial normalization. A total of 34 regions of interest (ROIs) were manually drawn on the MRI template using PMOD software (PMOD Technologies Ltd., Zürich, Switzerland) in standard MNI space. A global cortex was defined as a union of orbital frontal, prefrontal, superior frontal, lateral temporal, parietal, posterior precuneus, occipital, anterior cingulate, and posterior cingulate. The ROI of cerebellum gray matter was used as reference tissue, and the 34 ROIs including cerebellum were used as template ROIs for all subjects in the standard MNI space. Standard uptake value ratio (SUVR) images relative to the cerebellum ROI for 18 F-FDG, 18 F-AV45, and 11 C-PiB were calculated in the MNI space (image volume: 121x145x121, voxel size: 1.5x1.5x15 mm in x, y, z). ROI SUVRs were obtained by applying ROIs to SUVR images."}, {"section_title": "Statistical analyses", "text": "Receiver operating characteristic (ROC) analysis is commonly used to evaluate and optimize the performance of clinical diagnosis tests [16] [17] [18] . ROC analysis is a reliable statistical tool in the comparison and integrating quantitative multi-modal multi-parametric imaging of AD [19] [20] [21] [22] [23] [24] [25] [26] . In the study, ROC analysis was used to evaluate the predictive value of each biomarkers separately for the disease progression in the NCs and MCI group. The highest area under the curve (AUC) and Youden index (Youden index = Sensitivity + Specificity-1) were used to select the cut-off value of biomarker's measurement. The primary outcome was the diagnostic status of subjects from ADNI. In the NC group, the dichotomous variable indicated negative for those cognitively normal and positive for those converted to MCI or AD status. In the MCI group, the dichotomous variable indicated positive for those in MCI who converted to AD. In general, a test is acceptable in clinical efficacy if its AUC of ROC is not less than 0.70 [27] [28] [29] [30] . First, the diagnostic values of FDG, 18 F-AV45, and 11 C-PiB in predicating AD progression were evaluated separately for each ROIs. In contrast to PET biomarkers, the accuracy of CSF biomarkers and clinical assessments for monitoring AD progression were also studied by ROC analysis. To investigate if multi-biomarker measurements improve the accuracy in monitoring the AD progression, a logistic regression model with stepwise regression was used to determine the optimal model to predict the disease progression. First, we tested the combination of cognitive assessments with SUVR of FDG or amyloid-β PET imaging, with or without CSF biomarkers in the logistic model. "}, {"section_title": "Results", "text": "The demographic information and simple statistics of clinical assessments for all subjects at baseline visit are summarized in Table 1 . During the study period, ten out of 34 NC subjects were converted to MCI or AD, and 24 out of 48 MCI subjects were converted to AD. In the NC group, there was no difference between converters and non-converters in age, gender, education, APOE carriers, and three clinical assessments at baseline. In the MCI group, in addition to the significant higher educations (p<0.05) in education years, the converters in MCI group had significant higher ADAS-cog TOTAL 11 (p<0.05) and ADAS-cog TOTMOD (p<0.01) scores than non-converters at baseline. We also tested all the regions of SUVR for FDG at baseline and found that none of the ROI SUVRs showed significant difference between converters and non-converters in both NCs and MCI group. The results of ROC analysis for each PET ROI SUVRs are summarized in Table 2 . The FDG SUVRs of parietal, posterior cingulate, posterior precuneus, and caudate obtained significant prediction value for NC to MCI conversion (AUC>0.70). Among the 4 ROIs, the caudate had lowest specificity (48.8%) and accuracy (52.2%). The highest (specificity, accuracy) were attained by the posterior precunneus (87.4%, 85.7%), followed by parietal (83.3%, 82.2%), and posterior cingulate (79.5%, 79.1%). Most cortex ROIs of 18 F-AV45 were identified for predicating NC to MCI conversion, and AUC of the global cortex was 0.748 with both high sensitivity (78.6%) and specificity (74.5%), and the corresponding cut off value was 1.288 ( Table 2 ). The highest sensitivity of 18 F-AV45 was attained in the parietal, posterior cingulate, and posterior precuneus (92.9%). The ventral striatum (VST) obtained the highest AUC (0.822) with (85.7%, 74.5%) (sensitivity, specificity). 11 C-PiB was not included in Table 2 for NC group, because all of the initial 11 C-PiB scans in the study were conducted on those NC non-converters (or NC converters but before conversion) and MCIs. For MCI to AD, the ROI FDG SUVRs of the posterior precuneus, posterior cingulate, and lateral temporal provided high specificity (72.5% to 81.3%) and accuracy (70.6% to 78.3%). For 11 C-PiB ROI SUVRs, the medial temporal, orbital frontal, prefrontal, anterior cingulate, lateral temporal, amygdala, hippocampus, and putamen had AUC > 0.700 ( Table 2 ). The highest sensitivities were obtained in the medial temporal and hippocampus (88.9%), followed by the global cortex (77.8%) with SUVR cut-off at 2.207. However, lower specificity and accuracy were also found in the medial temporal (57.4%, 61.9%) and hippocampus (50.0%, 47.6%). In contrast, the AUC values for all 18 F-AV45 ROI SUVR were less than 0.700 with poor performance in specificity for predicating MCI conversion. The sensitivity and specificity of 18 F-AV45 for the global cortex was (79.4%, 46.9%) and with as low as 0.612 of AUC. Note that the posterior precunneus, and posterior cingulate FDG were identified to have significant predicating values (AUC>0.72) for both NC to MCI and MCI to AD conversion. It is also worth noting that the parietal, posterior precunneus, and posterior cingulate SUVRs of both FDG and 18 F-AV45 attained significant predicating values (AUC>0.72) for predicating NC to MCI conversion, and the lateral temporal SUVRs of both 18 F-FDG and 11 C-PiB were identified (AUC>0.70) for predicating MCI to AD conversion.\nAs listed in Table 3 for ROC analysis of CSF biomarkers and clinical assessments, CSF Aβ showed highest AUC (0.850) with (100.0%, 82.1%) (sensitivity, specificity) for NC to MCI conversion. For MCI to AD, t-tau was the only significant CSF biomarker (AUC>0.70) with 93.3% sensitivity and 43.6% specificity. All three clinical assessments had poor sensitivity (42.9% to 53.3%) for predicating NC to MCI conversion, but they all attained high AUC (0.868 to 0.916), as well as sensitivity (83.6% to 86.2%) and specificity (84.1% to 85.8%) for predicating MCI to AD conversion.\nIn the first logistic regression analysis of combined PET biomarkers and clinical assessments, the ROI SUVR of each three PET measurements (FDG, 18 F-AV45 and 11 C-PiB) was entered separately with the three clinical assessments, MMSE, ADAS-cog TOTAL11, and ADAS-cog TOTALMOD. The following three models were identified: A: Logit(P) = Model A was selected for NC to MCI and AD conversion. Both model B and model C were selected for the prediction of MCI to AD conversion. The ROC curves of models A, B, and C are demonstrated in Fig 1, and the ROCs of each single PET biomarker and clinical assessments are also included in Fig 1A, 1B and 1C , respectively. The results of corresponding ROC analysis were summarized in Table 4 . The (AUC, sensitivity, specificity) for model A, B, and C were (0.877, 80.0%, 94.9%), (0.932, 96.4%, 81.2%), and (0.915, 77.8%, 90.4%), respectively. The AUC of Model A was significantly higher than AUC of ADAS-cog TOTALMOD (p<0.01). Model B improved AUC significantly in contrast to each of its components for predication of MCI conversion (p<0.01 for ADAS-cog TOTALMOD and FDG posterior cingulate, and p<0.03 for MMSE). The AUC for Model C is only significantly higher than the AUC of 11 C-PiB medial temporal SUVR. Adding the CSF concentration and APOE ε4 did not bring additional benefit to the stepwise logistic regression models.\nIn the second logistic regression analysis, most of the scans we chose as pairs were conducted at the same visit (137 pairs of C-PiB: only two pairs had 1-year intervals). Five significantly improved (p<0.05) logistic regression models were identified for using 18 F-FDG and 18 F-AV45 to predicate NC conversion (Fig 2) . However, the improvements of AUC in the 5 identified models were not statistically significant (p>0.05). When "}, {"section_title": "Discussion", "text": "According to the current research, the decline of clinical function may appear years after the changes of PET imaging or CSF data [11, 31] . That means when the clues of conversion from imaging were observed, the clinical symptoms may not present at the same visit time. Taking this feature of progression into consideration, the longitudinal study was intended to accurately evaluate the value of biomarkers over time. Several studies also using ADNI data have been working on the predictive value of different measurements and achieving quite meaningful results [20, 32, 33] . Compared to a relatively short follow-up study [32] , our study added more value in monitoring and predicting AD progression. Additionally, the inclusion of subjects in our study was based on the database with more available longitudinal PET imaging data, which was different from previous studies focusing on other biomarkers. APOE ε4 is one of the most prominent genotypes in the onset of AD and has effects on other biomarkers like CSF levels of Aβ42 [34] . As an inherent genetic biomarker, the copies of APOE ε4 alleles do not differ from conversion vs. non-conversion at baseline in our study, which was similar with previous result [35] . However, the number of subjects with APOE ε4 carriers in the NC group was significantly lower than subjects in the MCI or AD group in the study (results not shown).\nIn the study, the cerebellum was chosen as the reference region for PET quantification, as it is commonly believed that FDG uptake in the cerebellum is not affected in MCI and AD, and that amyloid-β binding in the cerebellum is negligible in MCI and AD [36] . Quantitative FDG PET has been widely used in metabolic imaging of Alzheimer's disease. Besides SUVR with conventional ROI determined by manually or templates, several other measurements, such as hypometabolic convergence index (HCI) [37, 38] and statistical-based clusters derived from FDG PET imaging, also helped in characterizing and predicting the AD progression. Regions associated with metabolic reduction in AD were mostly found in temporoparietal association cortices, and temporoparietal and posterior cingulate proved to be the target areas for diagnosis and monitoring AD progression [36, 39] . Hypometabolism of the posterior precuneus was also reported in several MCI conversion studies [40, 41] . Our results also clearly demonstrated that the parietal seemed to be the best indicator region in early phase of conversion, while posterior precuneus and cingulate were the regions with higher AUC and predictive value in MCI to AD, which were of potential clinical value for the diagnosis of AD progression.\nFor the amyloid imaging analysis, a high correlation between 18 F-AV45 and 11 C-PiB regions was confirmed by previous studies [12, 42] . Increased amyloid deposition was discovered in the frontal, temporal, parietal, cingulate, precuneus and striatum by other researchers [43, 44] . Note that the ability of these two tracers and their associated regions differed in our study: regions of 11 C-PiB imaging acted effectively in distinguishing MCI converters from non-converters, and regions of 18 F-AV45 imaging were sensitive to detect early stages of disease progression in the NC group. This could be due to the difference in studied population and scan time difference between the two tracers in the study.\nIn the study we demonstrated that 11 C-PiB ROI SUVRs had high predictive value for MCI conversion to AD, which was consistent with other studies [19, 45] . It was reported that the best predicted region in 11 C-PiB to discriminate AD from MCI was the lateral frontal cortex with an AUC of 0.86, 65% sensitivity and 75% specificity [19] , which was higher than the ROI AUC values in our study. However, the limited 29 subjects and limited 2-year follow-up time should be taken into consideration when comparing the two studies [46] . In the 18 F-AV45 imaging section of Table 2 , more regions showed predictive significance in the NC progression. Among them, the VST indicated the highest AUC (0.822), sensitivity (85.7%) and specificity (74.5%). This was consistent with the results that amyloid deposition may begin in the striatum area [47, 48] . All ROI AUCs of 18 F-AV45 for monitoring the MCI to AD progression were less than 0.7, which is usually considered as low predictive value in ROC analysis. Although there was still no conclusive opinion for the performance of predicting MCI conversion, several previous studies have highlighted the usefulness of 18 F-AV45 in differentiating AD vs NC [49, 50] .\nFrom the single variable analysis of CSF biomarkers, CSF Aβ, and ratio of p-tau to Aβ worked well as predictors in the NC group, whilst CSF t-tau provided high sensitivity in predicating MCI conversion. However, in the logistic regression analysis, only PET biomarkers were selected in the models for prediction NC and MCI conversion. Note that our database was based on the PET imaging scans, and only about 60% of the subjects had CSF data. This may explain why the results did not improve significantly by adding CSF data, and CSF biomarkers were excluded in the final logistic model for progression. Previous studies showed that the multiparametric measurements with CSF information improved accuracy in predicating AD progression [33, 35] .\nThe combined ADAS-cog, MMSE and FDG SUVR of the posterior cingulate was identified as the best multiparametric input model for MCI conversion with AUC of 0.932, and the improvement was more significant than any single input ROC analysis. In the second logistic regression analysis for studying the possible improvements, there was not any significant improvement in AUC when combining FDG with 18 F-AV45 or 11 C-PiB and single PET input.\nThe improvements did not reach the statistical p value of 0.05, but it is worth further to be investigated in the ongoing project."}, {"section_title": "Conclusions", "text": "In conclusion, ROC analysis with up to 96 months of longitudinal data identified ROI SUVRs of FDG PET for monitoring NC to MCI, and MCI to AD progression. 18 F-AV45 is of significant prediction value for early diagnosis of AD, while 11 C-PiB is suggested for monitoring the disease progression at late stage AD. Quantitative FDG and 11 C-PiB PET with clinical cognitive assessments significantly improved accuracy in the predication of AD progression.\nSupporting Information S1 File. The 82 subject IDS. The list of 82 subject IDs used for downloading from ADNI database (http://adni.loni.usc.edu) were listed in S1 File."}]