[{"section_title": "Introduction", "text": "Global warming has been a hot issue lately all around the world since it affects many aspects. It might be the major concern to human being because warming will be directly related to food consumption and human health if it especially decreases agricultural production. It is not surprising that global warming has been receiving a lot of people's attention. According to Oreskes (2004), 928 papers that have abstracts including \"global climate change\" were published in refereed scientific journals between 1993 and 2003. This is very surprising since Houghton et al. (2001) argued that there is surprising absence of impact studies on climate change effects partially due to the slight temperature increase on average over the globe which has warmed only by 0.5°C over the last hundred years. Mendelsohn (2007) also addresses the absence of research in past climate change impact on global agriculture over the last 40 years. The impacts of global warming also have been highly controversial among scientists, scholars, and policy makers. Intergovernmental Panel on Climate Change (IPCC) and the National Academy of Sciences have reported that most of observed warming is likely due to the results of human activities such as Greenhouse gas emission while policy-makers and media argued that climate change is highly uncertain (Oreskes, 2004). However, according to the estimation by the NASA's Goddard Institute for Space Studies and the National Climatic Data Center, warming has been in increasing trend since the 1980s. The National Oceanic and Atmospheric Administration (NOAA) also reports that seven of the eight warmest years on record have occurred since 2001 and the 10 warmest years have all occurred since 1995. Previous studies also suggest that global warming has been in increasing trend since the1980s although the Earth's average surface temperature has increased by about 1.2 to 1.4°F in the last 100 years (Mendelsohn, 2007). There have been different forecasting and extensive debates over the concerns about the impacts of climate change. However, a broad consensus among climate scientists is that there would be drastic temperature increases and change in precipitation patterns due to greenhouse gas effect (Houghton et al., 2001). According to the NOAA's report, the recent warmth has been greatest over North America and Eurasia between 40 and 70°N although the warming has not been occurred in same fashion worldwide. That is, most of European countries and U.S. states except for the Southern states have been affected most by the recent warming. Therefore, climate change might be a major concern to humanity since it affects many economic sectors as well as different aspect of human life. Negative impacts of climate change on the agricultural sector will be especially dangerous since agriculture is directly related to food security and human health. Many believe that agricultural production will be affected most by temperature and precipitation since they are directly related to the production (Deschenes and Greenstone, 2007). This paper mainly examines the economic impacts of climate change on the agricultural profits in the United States. If weather negatively impacts the U.S. agricultural production, it will cause a big problem in world food security because the U.S. is the top exporter of major agricultural products such as maize, soybean, wheat, and pig meat (FAOSTAT)."}, {"section_title": "The Impacts of Climate Change on U.S. Agriculture", "text": "There have been debates on potential climate change and its impacts. The impacts of climate change on the U.S. agricultural sector also have been an issue lately. While negative impacts of climate change on U.S. agriculture are found in most previous research, some argue that warming will be beneficial. Schlenker et al. (2005) find that climate change effect (under warming scenario) will lead to an annual loss of about $5 to $5.3 billion in agricultural profits in dry-land non-urban counties. Kelly et al. (2005) also conclude that warmer weather will be harmful to agriculture. In the results of the estimation, climate change will decrease agricultural profits and its adjustment costs. Huang and Khanna (2010) estimate the future climate change impact on U.S. crop yields using the county level panel analysis. They find that increase in temperature significantly reduces the yields of corn, soybeans, and wheat while precipitation has positive relationship with the crop yields. However, Deschenes and Greenstone (2007) argue that climate change will increase annual agricultural profits by $1.3 billion in 2002 dollars that is equivalent to about 4% increase in profits. Mendelsohn and Massetti (2011) also suggest that warming will be beneficial to farms in relatively cool location. For example, farms in the northern part of the U.S. will get benefit from warming although warming will be harmful to the farms in the western U.S. In previous studies, the production function and hedonic approach are two most widely used methods to estimate the climate impact on agriculture (Deschenes and Greenstone, 2007). 1 Deschenes and Greenstone (2007) argue that both the production function and hedonic approach have weaknesses to properly estimate the effects of climate change. For the method using the production function, the estimates do not account for farmer's adaptations therefore the impacts of climate change are likely biased. The disadvantage of hedonic approach is that the land value may not reflect the discounted value of land rents. Schlenker et al. (2005) also point the potential disadvantage of hedonic approach. In its analysis, agricultural prices are assumed to be constant and it will be inappropriate if there are endogenous price changes however."}, {"section_title": "Data and Methodology", "text": ""}, {"section_title": "Conceptual model", "text": "Following the standard theory on profit maximizing firm, the profits of the firm are formulated as a function of input and output prices. In addition, some technology parameters enter into the profit function. Specifically, the profit function takes the following form: where π represents farm profits. P stands for input prices and output prices of agricultural production. C represents drought indices that are the Palmer Drought Severity Index (PDSI) and Crop Moisture Index (CMI). F is a set of individual farm structure such as total acres operated, farm type (crop farm/ livestock farm), and farm ownership (family farm/ non-family farm). O denotes the characteristics of a primary farm operator including age, gender, and education. The variables C, F, and O are technology shifters."}, {"section_title": "Econometric Model", "text": "The empirical counterpart of the conceptual profit function outlined above is described below: where ߨ ௧ represents the profits of an individual farm i in county c at year t. The equation includes a set of indicators for counties and years, ߙ and ߛ ௧ . ‫ܥ‬ ௧ is the growing-season humidity indicator. Specifically, PDSI and CMI are included in the regressions. The indices are the average of a growing season in county level and weekly-level data are used for the calculation of the growing season. The growing season is defined as the period between the first week of June and the last week of September in the analysis. In fact, a growing season varies by crops and regions. However, except for winter wheat, the period from June to September covers the growing season for most major crops such as corn, cotton, and soybean (USDA-NASS, 1997). ߠ ௧ represents the input price and output price indices. Both input and out prices indices consist of categories of agricultural production inputs and outputs. Regressions in the analysis are run for three different samples, namely all farms together, and crop farms, and livestock farms separately. For the estimation with the sample of all farms, the output price index for \"all farm products\" category is used. For the regressions with the sample of crop farms and livestock farms, the output price indices for \"all crops\" and \"livestock and products\" are chosen, respectively. Input price index reflects costs of several categories of factors of production, such as feed, seeds, fertilizer, chemicals, fuels, farm machinery, building material, farm services, and labor. The average of these factor price indices is used in the analysis. ܺ ௧ is a vector of farm and its operator's characteristics. More specifically, ܺ ௧ includes indicators for whether the farm is a professionally-owned business (non-family owned) and whether the farm mainly produces crops rather than livestock products. In addition, the land area of the farm and the farm operator's age, gender, and education level are included. The standard errors are clustered at the county level in order to correct for the possible correlation in unobservable characteristics of the farms located in the same county."}, {"section_title": "Data", "text": "The empirical analysis utilizes pooled cross-sectional data that is mainly based on the annual Agricultural Resource Management Survey (ARMS)-Phase III from USDA for the time period between 2000 and 2009 in the 48 contiguous States. Due to the fact that ARMS is the only national survey that provides individual farm-level observations, it gives detailed farm structure and financial information for the analysis. The outcome variable is the farm profits. Net farm income (computed as total farm revenues net of total production costs) is used for farm profits. The definitions of the variables used in the estimation are presented in Table 3. Table 4 provides the summary statistics of the variables. Figures 3 and 4 illustrate the relationship between drought indices and average farm profits over time for PDSI and CMI, respectively. PDSI and farm profits follow similar trends over the sample period (2000)(2001)(2002)(2003)(2004)(2005)(2006)(2007)(2008)(2009) considered in this paper. That is, as the average PDSI increases, farm profits tend to increase as well. As illustrated in Figure 4, although weak, a positive relationship is observed between CMI and profits over time. The analyses below quantifies the relationship between the drought indices PDSI and CMI and profits conditioning on several control variables as described in the Data section. In general, farms are divided in two categories: crop farms and livestock farms. Consequently, three different samples are used in the estimation: all farms combined, and crop and livestock farms separately. PDSI is used as a measure of weather variable in the regressions. As an alternative measure, CMI is included instead of PDSI. These two measures are highly correlated (over 0.8). CMI differs from PDSI such that the former is a measure of short term moisture conditions in soil; whereas PDSI is more relevant for long term measurements. The regression results pertaining to the whole sample is reported in Table 5A. Columns 1 and 2 include PDSI and CMI as measures of moisture, respectively. All the remaining control variables are identical. The regressions include indicators for counties and years. The standard errors are clustered at the county level. PDSI has a positive effect on the farm profit and its coefficient is statistically significant at 1%. For each unit increase in PDSI, the farm profits increases by about $7240. This corresponds to about a 5.5% increase from the mean profits ($131,270). For example, if drought condition improves from \"moderate drought\" to \"near normal\" category, an individual farm makes 5.5% more profit on average. Both output and input price indices have expected signs and they are statistically significant at conventional levels. The estimated elasticity of profits with respect to input and output prices at the mean of the data are -1.85 and 3.41, respectively. Total operated land area of a farm does not significantly influence the farm profits. The indicator for livestock farm identifies the difference in profits between a crop farm and a live stock farm. The coefficient of livestock farm indicates that on average livestock farms earn about $14,484 less in profits compared to a crop farm. Similarly, the coefficient on the non-family farm indicates that nonfamily farms earn about $347,000 more compared to the farms that are owned and operated by families. This difference could be observed because of the possibility that non-family owned farms are managed professionally and they use more advanced technologies compared to the family owned businesses. The coefficients on the farm operator's characteristics have expected signs. That is, the farms that are run by an operator who has at least a college degree make an additional $32,491 profits compared to their counterparts which are managed by an operator with smaller educational attainment. Farms with female operators earn $82,186 smaller profits than farms with male operators. There is a negative linear relationship between operator's age and farm profits. Specifically, compared to the operator of an average farm who is 55 years old, an operator who is 54 years old contribute $1,587 to their farm's profits. In column 2 of Table 5A the results of the same model is presented, except CMI is used as a measure of weather effect instead of PDSI. The results are similar to those obtained from the regression with PDSI. CMI has a positive impact on farm profit and it is significant at 1%. Specifically, a one unit increase in CMI leads to $18,300 increase in profits. In other words, farm profits will be increased by about 13.9% for each unit increase in CMI. This change corresponds to increasing the level of index from \"Slightly Dry\" to \"Favorably Moist\". The coefficients of control variables are similar to those obtained in the first column of Table 5A. The estimates of elasticity of profits with respect to input and output prices are -1.93 and 3.61, respectively. Land area of a farm does not have a significant impact on the farm profits. On average crop farms earn about $14,704 more profits compared to a livestock farm. A non-family operated farm make about $347,000 more in profits than the family owned and operated farms. The coefficients on the farm operator's characteristics are almost identical to those obtained from the regression that includes PDSI. Farms with a male operator who has at least a college degree make an additional $82,224 due to gender and $32,241 due to education of the operator. Results pertaining to the regressions that are run for separate samples of crop and livestock farms are presented in Table 5B. The first (last) two columns show the results of the crop (livestock) farm sample. In columns 1 and 3, the regressions include PDSI. PDSI is replaced by CMI in columns 2 and 4. Output price reflects the relevant outputs produced in crop and livestock farms. That is, the national output price index of crops is used as a control variable in columns 1 and 2 (crop farms regressions). In livestock regressions, the national output price index of livestock products is used. All regressions include indicators for counties and years. The standard errors are clustered at the county level. For an average crop farm, a one unit increase in PDSI and CMI increases profits by about $5,900 and $15,000, respectively (columns 1 and 2 of Table 5B). These coefficients translate into an increase in profits of 4% for PDSI and 9% for CMI. From the Table 2, I find that one unit change in PDSI (CMI) is a result of about 15°F (26°F) in temperature change. That is, the profits for an average crop farm increases by about $393 ($577) if temperature increases by 1°F. The coefficients of PDSI and CMI are significant at the 1% level. The magnitude of the impact is greater in livestock farms. A one unit increase in PDSI improves farm profits by about $8,000 (column 3 of Table 5B). That is an increase in profits of about 5%. When CMI rises by one unit, the profits increase by $23,000 or by 14% (column 4 of Table 5B). The coefficients of the control variables reported in Table 5B are mostly similar to those obtained from the regressions run on the whole sample of farms (Table 5A). Specifically, farms with operators who are male, who have more education, and who are younger earn greater profits. In addition, non-family operated farms profits are about $240,000 and $ 376,000 greater than family operated farms for crop farms and livestock farms, respectively. Although land area is a significant determinant of crop farm profits, it does not affect profits of an average livestock farm. As expected by the economic theory, output prices are positively associated with profits and input prices have a negative influence. However, for crop farms, prices are not statistically significant at conventional levels. In order to put these results into perspective (Tables 5A and 5B), the impact of changing the drought index level on profits is simulated. Specifically, I calculated the change in an average farm's profits when it is hypothetically moved from one state to another. The selected results are provided in Table 6. In these simulations, I considered the case of extremes such that a farm is hypothetically moved from the state with a very low level of index to another state with high level of index. For example, if an average farm in Wyoming (lowest PDI: -3.54) is moved to New Hampshire (highest PDI: 2.50), then its profits will rise by about 33%. I also present the impact of a one standard deviation increase in an index on farm profits in Table 6. For example, if a drought index of an average farm was a one standard deviation higher (2.5 units increase in PDSI), then its profits would have been 14% greater. As observed in Table 6, the effect of a bigger index is higher for livestock farms compared to crop farms. A one standard deviation increase in PDSI increase crop farm profits by about 9%, whereas an increase in the level of an index of same magnitude increases profits of a livestock farm by more than 20%. It follows that profits for crop farm and livestock farm increase by about $5874 and $8090 respectively if temperature increases by 15°F."}, {"section_title": "Conclusion", "text": "This paper estimates the climate change effects on U.S. agriculture using the pooled cross-section farm profit model. The data are mainly based on the annual Agricultural Resource Management Survey (ARMS) from USDA for the time period between 2000 and 2009 in the 48 contiguous States. This paper provides several contributions to the literature. First, the ARMS data used in the analysis are very rich and unique resource due to the fact that it is the only national survey providing an individual farm-level observation. Therefore, it gives more detailed farm structure and financial information for the analysis compared to other studies. Another uniqueness of this analysis is that drought indices (PDSI and CMI) are used for estimating the impact of weather on farm profits while including temperature, precipitation, and growing degree-days are typical weather variables in literatures. The result shows that warming is harmful to U.S. agriculture based on the analysis with three different samples (all farms together, crop farms only, and livestock farms only). In all farms sample, for each unit increase in PDSI (CMI), the farm profits increases by about $7240 ($18,300). This corresponds to about a 5.5% (13.9%) increase from the mean profits ($131,270). For an average crop farm, a one unit increase in PDSI and CMI increases profits by about $5,900 and $15,000, respectively. These are equivalent to an increase in profits of 4% for PDSI and 9% for CMI. The magnitude of the impact is greater in livestock farms. A one unit increase in PDSI improves farm profits by about $8,000. That is an increase in profits of about 5%. When CMI rises by one unit, the profits increase by $23,000 or by 14%. As many studies indicate, warming will be very vulnerable to agriculture in most part of the world. Since the U.S. is the top exporter of major agricultural products such as maize, soybean, wheat, and pig meat, climate change might be a major concern to global economy and peoples' well-being. Therefore, adaptation to climate change will be necessary such as developing new varieties that are more tolerant to higher temperature/ less humidity. -3.0 to -3.9 (Severe Drought) -2.0 to -2.9 (Excessively Dry) -2.0 to -2.9 (Moderate Drought) -1.0 to -1.9 (Abnormally Dry) -1.9 to 1.9 (Near Normal) -0.9 to 0.9 (Slightly Dry/ Favorably Moist) 2.0 to 2.9 (Usual Moist Spell) 1.0 to 1.9 (Abnormally Moist) 3.0 to 3.9 (Very Moist Spell) 2.0 to 2.9 (Wet) 4.0 or above (Extremely Moist) 3.0 and above (Excessively Wet) Source: NOAA-Climate Prediction Center      Notes: The outcome variable is the profits of the farm reported in their income statement. Descriptions of other variables are in Table 1 and summary statistics are presented in Table 2. First (Last) two columns are regressions run on the crop (livestock) farms. All regressions include indicators for counties and year dummies. The standard errors are clustered at the county level and they are reported in parentheses. *, **, and *** indicate significance at 10%, 5%, and 1% levels, respectively.  "}]