[{"section_title": "Abstract", "text": "This article summarizes the presentations and recommendations of the tenth annual American Geriatrics Society and National Institute on Aging Bench-to-Bedside research conference, \"Sensory Impairment and Cognitive Decline,\" on October 2-3, 2017, in Bethesda, Maryland. The risk of impairment in hearing, vision, and other senses increases with age, and almost 15% of individuals aged 70 and older have dementia. As the number of older adults increases, sensory and cognitive impairments will affect a growing proportion of the population. To limit its scope, this conference focused on sensory impairments affecting vision and hearing. Comorbid vision, hearing, and cognitive impairments in older adults are more common than would be expected by chance alone, suggesting that some common mechanisms might affect these neurological systems. This workshop explored the mechanisms and consequences of comorbid vision, hearing, and cognitive impairment in older adults; effects of sensory loss on the aging brain; and bench-to-bedside innovations and research opportunities. Presenters and participants identified many research gaps and questions; the top priorities fell into 3 themes: mechanisms, measurement, and interventions. The workshop delineated specific research questions that provide opportunities to improve outcomes in this growing population."}, {"section_title": "", "text": "T his article summarizes presentations and recommendations from the tenth annual American Geriatrics Society and National Institute on Aging Bench-to-Bedside research conference, \"Sensory Impairment and Cognitive Decline,\" on October 2-3, 2017, in Bethesda, Maryland.\nThe risk of impairment of hearing, vision, and other senses increases with age, and almost 15% of individuals older than 70 years have dementia. [1] [2] [3] As the number of older adults increases, sensory and cognitive impairments will affect a growing proportion of the population. To limit its scope, this conference focused on concurrent impairments in cognition, vision, and hearing.\nRates of impairment in near and distance visual acuity increase with age. The most common vision problems in older adults are impaired spatial contrast sensitivity (important for pattern recognition), scotopic dysfunction (slower adaptation to darkness and impaired light sensitivity at night), and slow visual processing. 4 The link between visual impairment and cognitive decline is complex. For example, impaired vision could affect cognitive function, 5 and improving near vision with eyeglasses can reduce depressive symptoms, 6 which can be manifested as cognitive deficits. Cognition could also affect vision. People locate and fixate on visual targets in semantically appropriate locations that are not visually salient, showing that they use cognitive factors, not only image characteristics, to guide their visual attention. Visual impairment and cognitive decline might also have common causes.\nHearing loss is the third most common health disorder in older adults. 7 Peripheral hearing loss in this population is associated with 30% to 40% faster cognitive decline than in those without hearing loss and with a 24% higher risk of cognitive impairment. 8 Hearing impairment is also related to faster decreases in the volume of brain regions that are important for spoken language processing and other cognitive functions. 9 Cognitive impairment could also contribute to hearingrelated difficulties in challenging listening conditions. For example, changes throughout the central auditory pathway make it more difficult for older adults with hearing loss to separate speech from background noise, leading to communication difficulties. 10 This challenge is particularly acute in those with a decrease in cognitive function. Cognitive auditory training could potentially improve the neural processing needed to understand speech in noisy environments."}, {"section_title": "COMORBID SENSORY AND COGNITIVE IMPAIRMENT Mechanisms", "text": "The co-occurrence of sensory impairments (e.g., vision and hearing) is more common than expected by chance alone, and vision and hearing impairments are associated with greater risk of cognitive impairment. 11 One cross-sectional study in community-dwelling older adults who did not have dementia found that more than 2% of this population reported both vision and hearing impairments and screened positive for cognitive impairment. 12 Hearing and vision rely on cognitive processes, and cognitive testing involves visual or auditory tasks, so these relationships may be multifactorial.\nA common pathological process (e.g., vascular disease) might be responsible for sensory and cognitive impairments in older adults (Figure 1 ). According to some studies, amyloid-β, a pathological hallmark of Alzheimer's disease, is present in the ocular lens (where it can cause supranuclear cataracts) and retina, and its presence in the retina could be a biomarker for Alzheimer's disease, which is also associated with changes in retinal ganglion cells and optic neuropathy. 13 Alternatively, sensory impairments might have a causal role in cognitive impairment. By increasing cognitive load, these impairments might limit the neural resources needed for optimal performance of cognitive tasks. In addition, loss of sensory input could directly alter brain structure and function (e.g., long-term deafferentation or overloaded brain circuity from resource demands to address poor signal-to-noise ratios). Finally, sensory loss may lead to depression, social isolation, and lack of physical activity, which could cause cognitive impairment."}, {"section_title": "Consequences of Comorbid Cognitive and Sensory Impairment", "text": "Persons with comorbid sensory and cognitive impairment are at greater risk of depression and death. Whether these are simply additive effects is not clear. Improving vision in persons with cognitive impairment may improve cognition or reduce cognitive decline, but cognitive impairment can reduce the effectiveness of visual rehabilitation.\n14 There has been limited research on the functional consequences of combined sensory and cognitive impairments despite the high prevalence of these conditions in older adults. Table 1 summarizes conclusions and key research gaps identified during the \"Comorbid Sensory and Cognitive Impairment\" session."}, {"section_title": "SENSORY LOSS AND THE AGING BRAIN", "text": "Age-related changes in the central nervous system (CNS) can drive functional decline directly or indirectly (by weakening the potential for plasticity), and CNS changes (e.g., in hippocampal volume and artery and vein radius) are related to cognitive impairment. 15 Noninvasive techniques are invaluable for understanding the neural mechanisms of age-related changes in human sensory perception, but they lack the spatial and temporal resolution needed to fully characterize the sensory processes throughout the CNS or how aging affects these processes. Animal models can help meet this need. Even though the age at which a given species becomes old varies, each species exhibits brain and cognitive changes near the end of the lifespan. Animal models have been used to study the roles of the hippocampus, prefrontal cortex, and perirhinal cortex in cognition and the ability to regulate neuronal responses to sound.\nVisual acuity, contrast sensitivity, dark adaptation, and visual processing speed change with aging, even in people who do not have cataracts, glaucoma, or age-related macular degeneration, and these changes have been associated Figure 1 . Hypothesized relationships that may explain the epidemiological link that has been described between sensory (vision, hearing) impairments and cognitive impairment. The yellow box depicts possible causative pathways by which sensory loss leads to reduced cognitive performance. For example, sensory impairment may increase \"cognitive load,\" or the total amount of demand placed on the brain at any given time. Assuming cognitive capacity is a fixed resource, high cognitive load could impair performance on cognitive tests. Another possibility is that sensory impairment interferes with physical or cognitively stimulating activities (e.g., exercise, reading) and that the lack of activity has a detrimental effect on cognitive function. The red box depicts the possibility that the relationship between sensory impairment and cognitive impairment is correlational. If this is the case, the impairments may co-occur more frequently than expected because they share common risk factors (e.g., age, smoking, genetics). Any or all of the pathways depicted here may explain a link between sensory and cognitive impairment.\nwith cognitive impairments. 4 Impaired vision compromises visual cognition, and cognitive deficits can also impair visual perceptual processes. Interventions that enhance visual stimuli (e.g., by increasing contrast) can improve visual search by decreasing reaction time. 16 Other approaches to enhance visual stimuli include medical and surgical ophthalmic interventions (e.g., cataract surgery) and improving the visual environment in the home by, for example, reducing glare and removing visual clutter. Certain methods, including some that use concurrent brain stimulation, can amplify and clarify visual information in adults with cognitive deficits. 17 Vision is particularly important to adults with hearing impairment, who depend more on visual cues. Vision recruits and repurposes auditory areas of the brain for visual processing in individuals with hearing loss. 18 This reorganization appears to enhance the use of multiple senses in speaking and listening to speech, which is particularly important for people with age-related hearing loss when listening becomes effortful. In difficult listening situations (e.g., noisy environments), older adults also recruit additional brain processes to help them understand conversational speech.\n19 Table 2 summarizes conclusions and key research gaps identified during the \"Sensory Loss and the Aging Brain\" session."}, {"section_title": "BENCH-TO-BEDSIDE INNOVATIONS AND OPPORTUNITIES", "text": "As the population ages, comorbid sensory loss and cognitive impairment will become even more common. The number of centenarians will grow, and it will be important to know what normal cognitive and sensory aging means in these older adults so that sensory measurements can be adjusted to age and cognitive status. According to the Framework for Understanding Effortful Listening, listening requires effort and is tiring for those with impaired hearing, which can reduce motivation to listen, and a better understanding is needed of effortful listening. 20 The same is likely to be true for vision.\nAlthough it is unclear whether sensory loss drives accelerated brain aging or brain aging drives accelerated sensory loss (or both), tools are available to track these changes prospectively in large-scale longitudinal studies. One such study used a new approach to medical image analysis for a cross-sectional analysis of associations between aging and brain changes in 2,705 adults. 21 The results showed varied rates of changes in different brain regions associated with cognitive function. Furthermore, participants in the Baltimore Longitudinal Study of Aging had differences according to sex on most tests of cognitive ability, with better performance in women for verbal memory tasks and in men for visual spatial abilities. 22 Amyloid and tau positron emission tomography has revolutionized research on Alzheimer's disease, making it possible to track the progress of the disease over time.\nDebate continues about which interventions are most effective for influencing cognition later in life. For example, moderately strong evidence supports the benefits of exercise (e.g., brisk walking) for improving cognitive and brain function in older adults, and exercise holds promise as an effective treatment approach. 23 Although exercise affects every part of the body, the mechanisms underlying the link between exercise and cognitive function need to be better understood. Potential explanations include cellular or molecular mechanisms, psychosocial changes, and effects on sleep. The evidence supporting cognitive training interventions is mixed, and it is not clear whether learning during training in one task is transferable to other tasks. There has been little discussion of the potential effect of these interventions on sensory function or how sensory status might modify their effects on cognition.\nIn addition to treating cognitive impairment directly, treating hearing and vision loss in older adults is important for ensuring healthy aging and continued active participation and engagement by adults with sensory and cognitive impairment. Restorative sensory care can consist of pharmacological interventions, surgery (e.g., cochlear implants, cataract surgery), or rehabilitation (e.g., assistive devices (e.g., hearing aids or portable magnifiers), strategies (e.g., speech reading, improved lighting)). Treatment for hearing loss reduces caregiver-identified problem behaviors, depressive symptoms, and neuropsychiatric symptoms. 26 Similarly, in addition to improving visual acuity, low-vision rehabilitation can improve health-related quality of life, memory, and independence in older adults with cognitive deficits. 27 Rehabilitation for age-related hearing loss and low vision is underused. For example, fewer than 20% of the more than half of adults aged 70 to 79 with hearing loss use hearing aids. 28 Simple, low-cost, community-delivered solutions for hearing and vision care are critical for lowincome and minority older adults.\nA variety of office-based sensory system evaluation tools, including questionnaires and clinical techniques, are available. The challenges of using these tools in individuals with cognitive impairment include the uncertainty of test characteristics (e.g., their sensitivity and specificity might not have been determined in populations with cognitive impairments), lack of time to administer the tests, and logistics of arranging multiple clinic visits for follow-up assessments. Furthermore, the U.S. Preventive Services Task Force has determined that the evidence is insufficient to support vision or hearing screening in the primary care setting in adults aged 50 and older, resulting in less impetus for screening. 29, 30 It is possible to modify a standardized cognitive test to accommodate individuals with visual impairment by, for example, asking them to say a sentence aloud instead of writing it down, and individuals with visual impairment do better on vision-independent test versions. Standardized protocols to ensure that sensory impairments do not directly confound cognitive test administration (someone with hearing loss misunderstands a spoken word in a verbal memory task) are not routinely used despite the high prevalence of hearing and vision loss in older adults. Table 3 summarizes conclusions and key research gaps identified during the \"Bench to Bedside Innovations and Opportunities\" session."}, {"section_title": "FUTURE RESEARCH PRIORITIES Mechanisms Underlying the Sensory-Cognitive Interface", "text": ""}, {"section_title": "Effect of Sensory Loss on the Aging Brain", "text": "High-priority research questions include whether changes in sensory systems drive cognitive changes or whether any causal relationships between sensory and cognitive function may be bidirectional. We need to understand the roles of cardiovascular disease, metabolic dysregulation, genetics, and inflammation as common pathways to cognitive and sensory impairment. We also need to learn when the response to cognitive load becomes maladaptive and whether this differs according to system. Another research priority is to determine whether sensory treatment has a downstream effect on cognition, including elucidation of the temporal sequence of peripheral and sensory changes and cognitive decline, and whether comorbid sensory impairment accelerates the downward trajectory of cognitive decline in dementia."}, {"section_title": "Neural Mechanisms", "text": "Major gaps in knowledge about brain pathways and networks at the interface of cognitive and sensory research include how top-down processes and bottom-up activity intersect and how generalizable these processes are across sensory systems. Studies could include comparisons of human and animal models of the same sensory and cognitive functions and between different sensory systems to assess shared top-down cognitive processes. Another research gap is the lack of knowledge as to which genetic and biological factors contribute to good sensory and cognitive function in older adults.\nMore research is needed to understand how senses beyond audition and vision (e.g., vestibular and olfactory systems) influence cognitive health and what happens when more than one sensory system is impaired. Small-vessel disease, a reasonable common pathway for vision, hearing, and cognitive impairment, has been understudied. Leveraging large population studies and existing study data is one potential means of addressing this question. Research gaps also exist regarding the influence of inflammation on sensory and cognitive function. Animal models of human sensory and cognitive processing would help advance this research.\nResearch is needed to identify the primary and secondary mechanisms of the benefits of exercise and healthy lifestyle, genetics, and other factors for cognitive and sensory health and the biology that these activities affect. Research should be conducted to determine whether exercise provides additional benefits, such as enhancing directed attention in background noise, visual acuity, or executive function. More collaboration is needed between those who study the interaction of sensory and cognitive processes and those seeking mechanisms that affect sensory and cognitive function."}, {"section_title": "Disparities", "text": "Most of our knowledge about prevention and treatment of cognitive impairment is based on white populations of higher socioeconomic status. Knowledge is limited on visual, hearing, and cognitive impairment in older underrepresented minorities and other underserved populations.\nResearch should be conducted to determine the trajectory of sensory and cognitive function in older adults without depending on self-reports\\. These data need to be stratified according to sex, race and ethnicity, socioeconomic status, education level, and healthcare use. This research needs to include the oldest, most vulnerable adults who live in assisted living and retirement communities. Few epidemiological datasets are available with minority representation that are not based on self-reported measures. When there is sample bias, the co-prevalence of sensory and cognitive impairments might be underestimated because individuals with sensory impairments might be less likely to participate in research or be excluded."}, {"section_title": "Measurement", "text": ""}, {"section_title": "How to Measure", "text": "Portable, cost-effective, user-friendly measures of sensory and cognitive function that can be used in different populations (e.g., those who speak different languages and are of different ages, sexes, and races and ethnicities) must be developed. These new measures will be more successful if they are freely available to clinicians and researchers, so they should be usable in research environments and transferable to clinical environments.\nResearch should be conducted to determine how best to assess cognition in people with sensory loss, given the need to maintain fidelity with validated cognitive tests. To distinguish cognitive from sensory deficits, researchers might develop standardized test administration protocols that can ensure that a person's inability to perceive the stimuli or understand the instructions correctly does not directly confound existing cognitive tests with auditory or visual stimuli.\nTraumatic brain injury and chronic traumatic encephalopathy affect central visual and auditory processing, but peripheral sensory is often minimally affected. Studies of traumatic brain injury function and chronic traumatic encephalopathy might provide opportunities to study the effect on cognition of changes in vision and hearing function in the absence of peripheral vision or hearing loss.\nAlthough cognitive function is traditionally assessed by observing behavior, the workshop considered the role of a theoretical biomarker of cognitive or brain function. Such a biomarker might be valuable in individuals whose cognitive function is difficult to measure because of sensory deficits."}, {"section_title": "What to Measure", "text": "Surveillance research is needed to describe cognitive, hearing, and vision over the lifespan in different populations. Measurements and analytical tools are required to assess cognition fairly and accurately in the presence of sensory loss, including dual sensory impairment. We need cognitive and sensory tests that are more objective (e.g., brain activation) and more ecologically valid. We also need to collect information on social network, personality, occupational, and other factors that could affect cognitive and sensory health and treatment patterns.\nValid measures of sensory function are needed for animal studies, as are cross-species models of cognition in individuals with hearing and vision loss. "}, {"section_title": "Intervention Development Research", "text": "More data are needed on individual differences in treatment effect and differences between healthy older adults and those with impaired sensory function, impaired cognition, impaired sensory and cognitive interactions, and poor effort and motivation. Intervention development research should be conducted to examine adults who are and are not aging \"successfully.\"\nIntervention development requires multidisciplinary, long-term longitudinal studies to establish trajectories of changes in sensory function and cognition and their interactions. Studies are also needed to determine the mechanisms of successful interventions and their clinical relevance to people.\nTriggers of decline and protective factors should be identified. A precision medicine type of approach could be developed to provide individualized care because the cognitive and functional limitations of older adults probably differ in degree and type of sensory impairment. Research is also needed to identify specific sensory (within domain) or cognitive impairments and address functional problems associated with these deficits.\nMixed-methods approaches to implementation science are critical for ensuring that interventions that are developed are actually used. The best timing for interventions must be determined, as must strategies to ensure feasibility and uptake."}, {"section_title": "Health Services and Comparative Effectiveness Research", "text": "Research is needed to establish the efficacy of assistive devices, such as hearing aids and low-vision assistive devices, including training in their use, for functional outcomes in individuals with visual, hearing, and cognitive impairments. Policymakers, funding agencies, researchers, and training programs are needed to consider vision, hearing, and cognition in an integrated system of health, not in discrete silos.\nComparative effectiveness research could be conducted to determine the efficacy of vision and hearing screening for older adults in primary care for improving individual and population health outcomes, including cognitive outcomes. Such research could compare treatments, including usual care, disease treatment, and rehabilitation interventions, and assess multiple outcomes (e.g., vision, hearing, cognitive function, quality of life, activities of daily living, cost effectiveness, caregiver concerns).\nResearchers should also exploit medical specialty registries that collect electronic health records (e.g., IRIS [Intelligent Vision in Sight] and the Reg-ent ear, nose, and throat data registries) to address research questions. Table 4 provides a summary of the highest-priority research gaps."}, {"section_title": "CONCLUSION", "text": "The evidence reviewed in the tenth annual Bedside-to-Bench research conference, \"Sensory Impairment and Cognitive Decline,\" indicates that vision, hearing, and cognitive impairments co-occur in older adults more often than would be expected by chance alone. Presenters and participants identified many research gaps and questions, and the top priorities fell into 3 themes: mechanisms, measurement, and interventions. This workshop delineated specific research questions that provide opportunities to improve outcomes in this growing population. The full report of the Conference is included as a Supplement Appendix to this Executive Summary."}]