[{"section_title": "Background", "text": "In recent years, many researchers in the Alzheimer's disease (AD) community have concluded that interventions will likely need to be started early in the disease process, before neurodegeneration has destroyed substantial regions of the brain. This notion has important consequences in terms of identifying early signs of pathology and has focused attention on biomarkers, including those measurable in the blood or cerebrospinal fluid (CSF) and through imaging technologies, as well as on the importance of assessing early signs of cognitive impairment. Because AD is defined by its cognitive symptoms, tests of cognition are essential for validating imaging and fluid biomarkers, screening potential research participants, evaluating progression of disease, and evaluating the effects of new treatments in clinical trials.\nSeveral current efforts are focused on early detection of cognitive impairment. The Uniform Data Set, which all National Institute on Aging (NIA)-funded AD centers have used since 2005 to collect standardized data across multiple research studies, is currently being reevaluated to determine which measures to use to best assess the earliest cognitive changes associated with the disease process. In addition, the National Institute on Neurological Disorders and Stroke recently launched the \"Common Data Element\" (CDE) project [1] with the goal of standardizing the collection of investigational data for clinical neurological research so that results can be compared across studies. General CDEs have been developed that are applicable across numerous diseases, and disease-specific CDEs have also been developed for several diseases. Additional disease-specific standards for other diseases are under development. The NIA and the Alzheimer's Association also recently convened workgroups to update the diagnostic guidelines for AD so that these guidelines would better reflect the full range of the disease from its earliest effects to its eventual impact on mental and physical function [2] [3] [4] [5] . The Diagnostic and Statistical Manual of Mental Disorders IV [6] is also being revised, with the fifth edition due to be published in 2013.\nAll of these efforts are converging on the need to find better tools for assessing cognitive impairment in the early stages of the disease. It was with this backdrop that the NIA and the Alzheimer's Association convened a 2-day workshop entitled \"Cognitive Assessment of Early Dementia,\" which was held in Bethesda, MD, from March 31, 2010 to April 1, 2010 . This exploratory workshop aimed to critically appraise the current state of knowledge on the subject of assessment of the earliest measurable cognitive changes associated with dementia. The introductory session set the stage by outlining needs with respect to measuring cognition in terms of diagnosis, biomarker development, and clinical trials. The meeting then addressed the areas of the brain affected earliest in AD, examining neuropathology as well as amyloid and functional imaging. Areas of major focus for the meeting included computerized batteries to measure cognitive function (including demonstrations), spatial cognition, driving and other instrumental activities of daily living (IADLs), domain-focused assessments, measurement of cognition in diverse populations, and measurement of cognition for other dementias."}, {"section_title": "Linking pathology to cognitive impairment", "text": "AD typically manifests with insidious progression of episodic memory impairment and executive dysfunction, but eventually evolves to affect almost all cognitive domains. Although amyloid plaques are one of the hallmark pathologies of AD, plaque burden does not always correlate with severity of cognitive impairment. Indeed, autopsy and amyloid imaging studies show marked amyloid burden in some cognitively normal people and significant heterogeneity in terms of amyloid burden among people with mild cognitive impairment (MCI). Even at the dementia stage of AD, the anatomical distribution of plaques and tangles does not always map well onto what is traditionally assumed about behavioral localization within the brain. Recent work by Seeley et al suggests that the brain is organized into specific networks that may degenerate together in various neurodegenerative diseases [27] , and functional imaging studies suggest that the distributed neural networks that support memory function are disrupted even in early AD [8] . Of particular recent interest is the \"default network,\" which includes parietal, lateral temporal, and frontal cortices, and is thought to be functionally connected to the hippocampus and related regions in the medial temporal lobe (MTL) memory system.\nAssociative memory may be particularly vulnerable to early network dysfunction in AD because the formation of novel associations requires the integration of activity within multiple brain regions, and is dependent on the integrity of the hippocampus. The inability to remember proper names is the most common complaint of older individuals and face-name association tasks are particularly challenging associative memory tasks because faces and names are inherently unrelated, requiring the formation of a novel association across verbal and visual domains. Sperling and colleagues have used functional magnetic resonance imaging (fMRI) during face-name association tasks to probe memory function in early AD. Interestingly, they found that people in the early stages of MCI demonstrated increased hippocampal activity, but by the late stages of MCI show significantly impaired hippocampal function, similar to that observed in people diagnosed with AD [9] . In another associative memory fMRI study involving clinically normal older individuals, they found that hippocampal hyperactivity paralleled failure to modulate the default network [10] . Hyperactivity may be a marker of compensation, where the brain is working harder to solve the face recognition problem, but it could also be a harbinger of impending network failure.\nSimilar overdrive of the default network is seen in carriers of the apolipoprotein E (APOE 34) gene, which has been linked to an increased risk of AD, suggesting that this may be a marker of very early dysfunction [11] . Amyloid imaging studies using Pittsburgh compound B (PiB) and positron emission tomography (PET) show that amyloid is deposited precisely in the areas of the default network that are functionally associated with both learning and remembering these face-name associations, again indicating a link between the pathology and cognitive impairment [12] . In fact, there are converging data that amyloid is associated with abnormalities in this network in cognitively normal older individuals, many years before the onset of dementia."}, {"section_title": "Measuring cognition for diagnosis, clinical trials, and biomarker development", "text": "The Alzheimer's Disease Neuroimaging Initiative (ADNI) began in 2004 to study progressive changes in brain structure and function, fluid biomarkers, cognition, and overall function in people with AD, MCI, and persons without cognitive impairment. The major goal of ADNI was the collection of data and samples to establish a brain imaging, fluid biomarker, and clinical database to identify the best markers for tracking disease progression and monitoring treatment response, thus improving clinical trial efficiency. The usefulness of the imaging and fluid biomarkers is being evaluated by correlating them with established cognitive measures that have been shown to track the disease in clinical trials fairly well. However, because the MCI volunteers enrolled in ADNI would today be classified as late stage MCI, data collected to this point do not address the question of how best to pick up changes in the early MCI (eMCI) period. ADNI has since then been expanded to include individuals with eMCI and some of the more recent promising structural and molecular imaging tests (e.g., PET/PiB) as well as additional CSF biomarkers and cognitive testing.\nADNI has provided a wealth of data indicating that genotype, neuroimaging, and fluid biomarkers are good at predicting progression, and even at identifying cognitively normal individuals with AD pathology (some of whom may turn out to be patients with eMCI) [13] . However, this does not lessen the need for more sensitive cognitive instruments that not only can differentiate cognitive healthy individuals from eMCI but may also be able to pick up subtle cognitive changes early in the disease process. In addition, cognitive instruments that tap into various pathophysiologic networks would be valuable. Perhaps, signals of impaired cognitive performance early in the disease process would be a cheaper and more efficient way of stratifying individuals who might be candidates for further exploration in terms of more invasive and expensive procedures, such as PET.\nThe Alzheimer's Disease Assessment Scale-cognition (ADAS-cog) is the most widely used outcome measure in clinical trials of AD. It was designed in 1984 specifically as a clinical trial tool, assessing a spectrum of cognitive functions with 11 subscales [14] . Used in approvals of all four currently approved drugs for mild to moderate AD, it has become the de facto standard in clinical trials. These trials showed decline in the placebo arm, with lack of decline in the active arm. However, in recent trials in participants with MCI and mild AD, no cognitive decline has been seen in the placebo arm, indicating that changes in early stages are subtler and harder to detect with the ADAS-cog. Thus, although it has been used successfully and has proven neuropsychological underpinnings, the ADAS-cog exhibits a ceiling effect in MCI and mild AD [15] , which contributes to an inability to assess cognitive decline in mildly affected individuals. For clinical trials of drugs intended to halt the early stages of dementia, the ADAS-cog would be improved by incorporating more difficult cognitive measures in a neuropsychologically sound manner using modern psychometric techniques, for example, Rasch analysis."}, {"section_title": "Computerized batteries to measure cognitive function", "text": "Computerized batteries offer several advantages over paper-and-pencil (P&P)-type tests, such as notably precise, accurate assessments that can be obtained with millisecond timing; ease of administration (sometimes with no administrator needed) and scoring; greater standardization; and adaptive presentation of items. In addition, the computer is the only equipment needed and examiner effects are reduced (which could however also be considered a disadvantage). Multiple parallel versions may also be available, which are known to reduce practice effects.\nImportant disadvantages of computerized testing in older adults are that these tests can be challenging for people with visual limitations; they can be too fast-paced or difficult for people who are unfamiliar with computers; and participants may have problems adapting to a keyboard, mouse, or number pad. Ideally, test batteries should be appropriate for people across a broad age range so that studies can begin when participants are in their 30s, 40s, and 50s, long before they may begin to display obvious symptoms of cognitive impairment. Another disadvantage of computerized batteries is that most of them do not assess all cognitive domains and, particularly if an administrator is not involved, less qualitative information may be obtained. For example, most computerized batteries do not address sensory-motor functioning, although this is an important domain in and of itself. Deficits in sensory-motor functioning can also affect performance in other domains, depending on the interface technology used, particularly if no administrator is available. Psychometric properties have not been well studied and there have been few comparisons between these batteries to determine relative accuracy and ability to differentiate among disorders. In addition, there have been few longitudinal follow-up studies.\nIn general, computerized test batteries seem to be sensitive to group differences and show similar patterns of findings in comparison with traditional P&P batteries. Although they show only moderate correlations with P&P tests, they do tend to have higher test/retest reliability than P&P tests. However, more data are needed before computerized batteries can take the place of traditional assessments for clinical decision-making purposes. For example, few studies have undertaken an item-by-item or factor analysis, and little is known about ceiling effects. In addition, some people (both examiners and examinees) will just feel more comfortable with P&P tests than computer-based batteries. For more information on the issues related to computerized cognitive assessment please refer to [16] ."}, {"section_title": "Spatial cognition", "text": "When people are in the early stages of AD, they may get lost, forget where they put things, and have trouble driving, all of which are examples of impairments in spatial cognition. Spatial cognition tasks tap very broad networks in the MTL and the cortex, areas of the brain that are sites of the earliest pathological changes in AD and that are known to play an important role in episodic memory function. Thus, tests of spatial cognition could be used to detect early deficits in AD.\nMuch of what is known about spatial cognition in animal models has been gleaned from studies of hippocampal function in aged laboratory rats. Importantly, this work has focused on the function of hippocampal circuitry that is innervated by the layer II neurons of the entorhinal cortex, which are an early site of pathology and neurodegeneration in the AD brain, accounting for the progressive worsening of episodic memory over the early course of the disease. Although aged rats have an intact complement of entorhinal neurons, their innervation of the hippocampus is diminished by 20% to 25%, thus weakening the cortical input that governs encoding of new information in the dentate gyrus (DG) and CA3 regions so that representations are distinct from previous memories. In computational terms, this process has come to be known as pattern separation. In aged rats with spatial memory impairments, neurons in the DG/CA3 network fail to encode new information when the rats are exposed to a novel environment [18] . At the same time, the CA3 neurons are also aberrantly active, exhibiting unusually high firing rates. This condition in entorhinal/DG/CA3 network could be relevant to observations of excess hippocampal activation observed by fMRI in people diagnosed with MCI and in populations at genetic risk for AD (both familial AD and carriers of APOE 34).\nTo explore the possible connection between these animal data, studies were conducted in people with amnestic MCI (aMCI). These studies confirmed higher activation in the hippocampus, and also showed that this was predictive of subsequent cognitive decline and conversion to AD [19] . Another study using high-resolution neuroimaging tools to look at subregions of the hippocampus showed that individuals with aMCI had deficits in their ability to encode new information in a task that taxed pattern separation and also exhibited increased activation in the DG/CA3 region during task performance [20] . This condition seems to be on a continuum with changes that occur during aging in the human brain; older adults when compared with young adults demonstrate a milder version of this same pattern with increased activity in the CA3/DG region of the hippocampus [21] . These data suggest that sensitive tests of spatial cognition and especially assessments that tax pattern separation could be used to track progression of MCI and AD.\nVirtual reality (VR) can be viewed as an advanced form of human-computer interface that allows a person to naturalistically interact and become immersed within a computergenerated simulated environment. Sensory stimuli can be presented to the user using various forms of display technology that integrate real-time three-dimensional (3D) computer graphics with sound, touch, and even olfactory cues. VR technology offers the capacity to create systematic human testing, training, and treatment environments that allow for the precise control of complex, dynamic 3D stimulus presentations, within which sophisticated interaction, behavioral tracking, and performance recording is possible [22] . Thus, VR technology can create objective digital simulations that are useful for performance assessment. Moreover, advances in the technology and concomitant system cost reductions have progressed to the point where it is becoming feasible and affordable for people to have VR systems in their homes.\nInitial research has begun to demonstrate VR usefulness for cognitive assessment, particularly for visuospatial assessment [22] [23] [24] [25] [26] [27] [28] . For example, the Morris Water Maze test of spatial navigation and place learning in rodents has been simulated in a virtual environment as a test for human beings [29, 30] . In this application, the person being tested must use visual cues in the surrounding environment to help guide navigation to a hidden platform. Used in conjunction with fMRI, the test can demonstrate whether a person has decreased hippocampal activity [31] , which might be indicative of AD. VR systems can also be used to assess mental rotation, a cognitive function where a person needs to visualize the movement and organization of objects in a 3D space [32] . Mental rotation is important for everyday tasks such as driving, organizing items in a limited space, and any activity that relies on dynamic imagery for prediction of object movement. In the normal population, men outperform women in the mental rotation task, and a natural decline in performance is seen over time in both men and women. Interestingly, mental rotation can be improved by giving people hands-on VR interaction and training [28] , which could have interventional implications.\nThese two VR applications-spatial navigation and mental rotation-are now being tested to determine whether they can differentiate between mild dementia, AD, and normal aging. Early stages of this work involved the development of an interface that was simple and comfortable enough to be used effectively in an older population. Thus far, it seems that older adults can learn to effectively use a gaming joystick operated within the Morris-type navigation task as well as with the hands-on and more intuitive magnetic tracked system used in the VR mental rotation task [22] .\nTo understand the mechanisms of visuospatial impairment, different tasks are needed and the ideal task will measure disease-related cognitive changes from an anatomical perspective. Three primary distinctions made with regard to the anatomical basis of visuospatial impairment-dorsal and ventral stream processing, top-down and bottom-up processing, and allocentric/egocentric frames of reference-are important for navigation [33] . Figure copy is the most common test used to assess visuospatial abilities in dementia evaluations and has been used in conjunction with magnetic resonance imaging (MRI) and a surfacebased structural MRI analysis tool called FreeSurfer to test neuroanatomical mechanisms of performance in people with AD. This analysis showed that in AD, figure copy performance was associated with right parietal volumes but not dorsolateral prefrontal cortex volumes. Conversely, individuals with behavioral variant of frontotemporal dementia (bvFTD) displayed the reverse association. A large spatial battery used to investigate cognitive mechanisms showed that in AD, figure copy was associated with bottom-up spatial processes, spatial perception, and forward span, whereas in frontotemporal dementia (FTD), performance was associated with spatial planning and backward spans [34] .\nWith regard to allocentric/egocentric frames of reference for navigation, rodent studies have shown that the hippocampus is critical for anchoring the allocentric network that allows for the development of a flexible cognitive map, whereas the caudate nucleus anchors the egocentric network, which enables learning a fixed route through the environment on the basis of stimulus response and motor learning. Thus, visuospatial tasks that allow participants to develop a cognitive map based on boundary clues, including distal or major landmarks, are useful in assessing AD because hippocampal atrophy disrupts the allocentric system, whereas tasks that engage the egocentric system might be more useful in Huntington's disease, where neurodegeneration occurs primarily in the caudate. Studies using a real-world navigation test of route learning through hospital corridors confirmed that persons with AD were more likely to get lost than those with MCI, and individuals with MCI were more likely to get lost than healthy controls. Those who got lost also showed greater atrophy in the right posterior hippocampus and the bilateral inferior parietal lobes [35] .\nNew navigation tasks, similar to the visuospatial tasks mentioned previously, may be able to better distinguish allocentric from egocentric route learning. For example, another Morris Water Maze task simulates individuals on land using a gas pedal and a steering wheel to drive around a land maze looking for a hidden treasure. After the first trial, the starting position is changed so that the only stable references relative to the treasure are the external cues. This test might be very sensitive to early AD changes.\nIn mice, object recognition and spatial navigation tasks have been shown to be very sensitive to the effects of aging, APOE 34, and sex steroids, as well as environmental challenges such as cranial irradiation and traumatic brain injury. As mentioned earlier, because APOE 34 has been linked to an increased risk of AD and is thus thought to be a proxy for very early dysfunction, human tests of object recognition and spatial navigation would perhaps be sensitive enough to identify the earliest stages of AD.\nRaber and colleagues have developed two such tests [36] [37] [38] [39] [40] [41] and demonstrated that in nondemented elderly population (mean age: 82 years), the presence of APOE 34 did indeed result in poorer performance on object recognition and spatial navigation tasks, but not on other cognitive tests [38] . In the object recognition task, called Novel Image, Novel Location (NINL), APOE 34 carriers had a particularly hard time recognizing a novel location change, and there was additionally a gender difference, with men performing less well than women on this task. The NINL test has been developed as an electronic version and in hard copy format for individuals who might have difficulty with computerized testing that would confound the results.\nThe VR spatial navigation task, called Memory Island, is based on the Morris Water Maze, a commonly used test of spatial navigation in rodents. In Memory Island, volunteers are trained to navigate through a very engaging island environment, first to locate a target visibly marked with a flag, what is called cue training, and then to a hidden target (i.e., no flag marking the target so the study participant has to remember where it is and how to get to it). The test measures ability to locate the target (success), time to get to the target (latency), cumulative distance to the target, and velocity to reach the target. Interestingly, the test shows that good navigators think first and then move, whereas poor navigators move first and then have to decide what to do next.\nThe investigators also invited participants back 6 and 8 months later for repeat testing so that they could assess decline in these cognitive domains [37, [39] [40] [41] . There was no change in Mini-Mental State Examination (MMSE) score over this period. However, APOE 34 carriers, especially those with low object recognition scores, were 2.7 times more likely to drop out and not complete the study. Among those who remained, APOE 34 carriers actually performed a little better than the noncarriers, suggesting that there may be two subpopulations of APOE 34 carriers with different rates of decline. In a follow-up longitudinal study, performance on the MMSE and the NINL tests was compared over a 4-year period [39] . Individual NINL scores over this period were highly correlated. In addition, although MMSE scores did not change over the 4-year period, NINL scores did. In a final testing session of a subset of the participants, NINL scores correlated with Logical Memory and Word Recall lists, cognitive tasks used to detect dementia in the clinic, as well as Clinical Dementia Rating (CDR) scales. The investigators concluded that both the object recognition and spatial navigation tests are valuable for assessing cognitive performance and age-related cognitive decline, and that they might have sufficient sensitivity to assess cognition in early dementia. The next step will be to look at early AD and other neurodegenerative conditions."}, {"section_title": "Alternative assessment methods", "text": "Current methods for cognitive assessment are limited in their ability to detect change in performance for multiple reasons related to the fact that the tests are administered at sparsely spaced intervals and at the convenience of the investigator, and that they rely on self-reporting and recall of events in people who often are memory impaired. As a result, data are collected as brief snapshots that do not reflect real-world situations or contextual aspects of a person's experience that might affect performance, for instance, socialization or physical activity. Testing people frequently, even daily, with unobtrusive, real-world, real-time home-based assessments might be a better way of detecting change. An alternative approach is to directly assess activities that are intrinsically related to cognitive function (\"everyday cognition\"), such as the ability to track medications or use appliances.\nOne approach to more frequent assessment is to adapt existing cognitive testing paradigms using automated interactive voice recognition technology, or a home kiosk system comprising a flat panel touch-screen monitor and phone handset, where all responses are collected through automated speech recognition. Medication adherence can be monitored with a device that stores medication and automatically records when the device is opened to retrieve the medication [42] . A pilot study (conducted by the NIA Alzheimer's Disease Cooperative Study group) of these technologyaided home-based assessments in community-dwelling, nondemented elderly people showed that there was a higher dropout rate than with mail-in questionnaires and live telephone interviews. However, with intensive participant training, these high-technology approaches can provide more time-efficient assessments [43] . Other technologies that show promise for assessing subject performance include wireless, passive, infrared motion detectors that can collect data about in-home activities such as walking speed, sleep patterns, and frequency of opening the refrigerator [44] . Home-based computer usage assessment or monitoring of specific activities such as game playing can also be used to assess psychomotor or fine-motor, as well as cognitive function. Preliminary data from the NIA-supported Intelligent Systems to Assess Aging Changes study using these technologies suggest that the automated unobtrusively collected measures may be able to detect very early signs of functional and cognitive impairment.\nDriving is another activity that is frequently impaired in older individuals and particularly those with AD. Although older drivers curtail their driving exposure, in terms of crashes per miles driving, they are at a risk level approaching teen drivers and they are also more likely to die if involved in a crash. The problem is not really age per se, but rather age serves as a proxy for physical and cognitive impairments that affect driving. Thus, older drivers experience more intersection crashes, which may be related to deficits or changes in reaction time, visual perception, and attention. People with dementia have a 1.5 to 5 times increased risk of getting into crashes as compared with age-matched controls [45] , and after they have had the disease for 3 years, their crash risk rises to that of the highest risk group, teenage males [46] . Functional brain imaging studies in persons with AD have shown a relationship between reduced perfusion in prefrontal regions and hazardous driving, with the right hemisphere more affected than the left [47, 48] . Neuropsychological tests also show that specific abilities thought to be important in driving are impaired in demented individuals, for example, performance on tests of executive function, visual attention, and visual perception [49] .\nLess information is available about driving ability in people with MCI, although studies suggest that on-road and simulator tests, individuals with a diagnosis of MCI have less optimal performance as compared with cognitive healthy individuals, although most are still considered safe drivers. In two longitudinal studies of individuals with CDR of 0, 0.5, and 1.0 [50, 51] , all three groups showed decline in driving ability on road tests. One explanation for this finding is that those cognitive healthy individuals whose driving abilities declined had incipient AD, which could suggest that driving as an IADL may be a very sensitive measure of decline. Supporting this idea is another study conducted in Sweden and Finland, in which there was an over-representation of the APOE 34 allele in people who died in car crashes. In this study, neuropathological examination of those who died in car crashes showed that 14% had histologically definite AD and 33% had histology suggestive of AD [52, 53] . Similar reports from Australia [54] and Japan [55] also support the notion that a large proportion of older drivers who die in car crashes have brain pathology suggestive of incipient AD.\nCould driving impairment be used as a marker of early AD, and if so, how would it be measured? Car crashes are not a reliable indicator because so many external factors play a role. Testing performance on simulators or naturalistic assessments using cameras in people's cars might be other options. A more cost-effective way of collecting this information is from caregiver reports on IADL questionnaires, but these measures need to be more fully developed and validated. It may also be possible to develop interventions that would enhance driving ability in the elderly population, for example, training approaches or even medications that improve visual attention or visual processing speed. An important additional benefit of having a therapeutic intervention for problematic drivers would be that it might encourage caregivers, family members, and even those affected to report problems at an earlier stage of their illness."}, {"section_title": "Daily function", "text": "Functional disability is a core-defining feature of AD and other dementias, and several studies have shown that functional decline starts early in the disease process and can help predict who is going to decline more rapidly in terms of cognitive function and who will progress from MCI to dementia. Thus, measuring functional changes, including subtle changes at the very earliest stages, can have both diagnostic and prognostic value. IADL scales attempt to measure functional decline through a variety of approaches, including both informant ratings as well as performance-based measures of daily function. Informants can be a spouse, other family member, or other caregiver, or someone else who is familiar with the target individual's daily functioning (i.e., has considerable contact across different contexts). Although assessments of everyday function have traditionally focused on basic activities and IADLs, focusing exclusively on these broad domains may limit the ability to capture very early, subtle functional changes. Thus, another approach is to focus on everyday cognition or applied cognition, to try and capture real-world applications of cognitive abilities or cognitive decline. One informant-based rating system is the Cognitive Change Checklist (3CL) [56] , which was designed to provide ratings of problems in everyday cognition at the earliest stages of cognitive decline associated with degenerative dementias. The 3CL was developed using a \"rational-empirical method,\" in which the initial item pool is based on rational expert analysis of clinical phenomena, and subsequent item selection and scale refinement are based on analysis of clinical data.\nDevelopment of 3CL used a sample of 359 individuals seen in memory disorder clinics who had a consensus diagnosis of probable or possible AD, MCI, other dementia, psychiatric disorder, other diagnosis, or normal [56] . On the basis of a review of presenting cognitive complaints from clinic records, a pool of 60 items tapping cognitive problems (e.g., word-finding problems) was developed and reviewed by expert judges. Informants were asked to rate the individuals on 51 expert-selected items using a 4-point Likert-type scale defining the degree of change over the previous 2 years. Self-report ratings were also collected, as well as results from cognitive testing using a modified Consortium to Establish a Registry for Alzheimer's Disease (CERAD) battery. Using factor and item metric analyses, the 51 items were reduced to form a 28-item checklist containing four nonoverlapping subscales to assess memory, executive function, language, and remote recall.\nThe 3CL scale reliabilities were found to be well within guidelines to support their use in the clinical assessment of change in global cognition and specific cognitive domains. Informant ratings on the 3CL scales were shown to discriminate between those with no cognitive impairment, aMCI, and AD. In contrast, self-report scores showed no significant differences. The differences in scale scores among diagnostic groups paralleled those of the neurocognitive measures. receiver operating characteristic analyses showed that informant 3CL scales had discrimination values that were equivalent to the MMSE.\nA subsequent study [57] examined the reliability, validity, and efficacy of the 3CL in distinguishing among groups of normal individuals, those with cognitive complaints, aMCI and non-aMCI cases, and demented individuals in the early stage of progression. Support for the validity of the checklist was obtained from analyses that showed significant 3CL scale correlations with formal neurocognitive measures (rs: .0.30) and with MRI ratings of left medial temporal atrophy (rs: 0.37-0.52). Informant 3CL scales were found to discriminate individuals with cognitive complaints, but without clinical findings, from those individuals with aMCI or early dementia with the same degree of accuracy as standard cognitive performance measures.\nThe 3CL is a brief informant checklist that is characterized by high levels of internal consistency reliability, validity established by comparisons with objective cognitive measures and MRI atrophy ratings, and diagnostic efficacy that approaches that of objective tests of cognition. Future research will examine the value of the 3CL in predicting cognitive decline over time and its use in conjunction with cognitive screening instruments in identifying various forms of MCI and pre-MCI states.\nThe Everyday Cognition Scale (ECog) [58] [59] [60] was developed to capture the everyday manifestations of cognitive impairment across the domains of memory, language, visuospatial abilities, planning, organization, and divided attention. Starting with 138 items, a group of dementia experts pared down the list to 39 items across six domains that would capture a range of ability levels and functional changes across the disease spectrum, particularly in early disease. On each item, the participant's current level of functioning is compared with how he or she was doing 10 years earlier. In this way, their own baseline is taken into account.\nEach ECog scale shows good variability and discrimination between normal individuals, those with MCI, and those diagnosed with dementia, with less of a ceiling effect in the MCI group as compared with many previously developed functional scales. In terms of effect sizes, the MCI group was rated by their informants as about a standard deviation (SD) more impaired than the normal group in the Everyday Memory domain, and about a half of an SD more impaired in other nonmemory domains. Across the board, the dementia group was about 1.5 to 2 SDs more impaired than the MCI group. The ECog also showed minimal correlation with education and a similar pattern of findings across all ethnic groups; and it shows relatively good discrimination between aMCI and non-aMCI. Different patterns of impairment were also observed in people with other dementia types, such as FTD (although social changes seen in FTD are not assessed with this tool).\nA self-report version of ECog has also been developed. As might be expected, cognitive healthy individuals report about the same level of function as the informants do, but in the MCI group, informants report somewhat more functional impairment than the impaired individuals themselves, and this discrepancy is even larger in the dementia group. This suggests that self-reporting may be helpful in identifying the early transition from normal function to MCI, but further study is needed to determine whether self-reports help to predict future conversion. The ECog has also been translated into several different languages, with validation studies underway. A short form has also been developed. Although informant report is considered more reliable than self-report, attention must be paid to the qualifications of the informants in terms of their cognitive ability as well as personality and psychological factors such as depression.\nThe Texas Functional Living Scale [61] uses a different approach to assess IADLs. Rather than using informant ratings, this scale is a performance-based test administered by a neuropsychologist or other healthcare professional with appropriate training. The goal in developing this scale was to have a 15-minute evaluation that would be portable and applicable to people with dementia as a tool for treatment planning, and for assessment of disease progression and response to treatment. A further goal was to construct an assessment that could help family members understand the deficits experienced by the person with dementia. Tasks include practical items such as identifying specific dates on a calendar, reading the time on a clock, and making change. In the area of communication, tasks include writing a check, addressing an envelope, and looking up a number in the phone book. To assess prospective memory, participants are given candy pills and instructed to take them when the timer goes off. The scale was moderately correlated with the Blessed Dementia Rating Scale but not with the CERAD Behavior Rating Scale. However, it achieved a correlation of 0.92 with the MMSE as well as a high correlation with the Wechsler Memory Scale, indicating that there is a strong cognitive component in the scale. It also correlated well with some other standard measures of independent living, such as the Independent Living Scale. In a small preliminary sample, the instrument seemed to be helpful in determining nursing home placement and daily assessment needs. Importantly, the scale was also sensitive to change over time in persons diagnosed with dementia but stable in normal people. In its current form, the administration time is about 9 to 17 minutes in normal people and 15 to 20 minutes in individuals with memory impairment. With continued refinement, the scale may be shortened and there are also efforts to create an MCI version."}, {"section_title": "Domain-focused assessments", "text": "Although episodic memory deficits are the hallmark cognitive impairment in early Alzheimer's dementia, there are important deficits in other areas, including attention, semantic memory, semantic interference, prospective memory, false memory, and executive function. Assessment of impairment in these domains may provide more sensitive tools for identifying the very earliest stages of AD."}, {"section_title": "Attentional control", "text": "In AD, there is evidence of breakdown in attentional control systems even in the early stages. Indeed, what seem to be memory problems may instead be problems in attention, and people with AD may have impairments in their ability to pay attention to relevant information rather than irrelevant information, which can contribute to memory deficits. Attentional control is frequently assessed using the Stroop colorword task, where one can assess facilitation and interference effects as well as overall reaction time. Compared with healthy older adults, individuals with CDR of 0.5 and 1.0 produce large facilitation effects. In addition, intrusion rates showed a much larger increase in individuals with CDR of 0.5 compared with healthy controls, and those participants with higher intrusion rates were more likely to convert to AD [62] . By adding a task-switching paradigm, which puts an increased load on attentional control systems, the Stroop test becomes even more powerful, outperforming all other psychometric tests in terms of discriminating healthy adults from those with CDR of 0.5 [63] . Amyloid imaging with PiB/PET scanning showed a correlation with Stroop intrusion errors and even stronger correlations with switching errors in healthy elderly individuals (CDR: 0).\nVariability in attentional control, as opposed to mean performance, may be an even more sensitive measure of early AD-related changes. In three tasks-Stroop, Simon, and Switching-changes in interindividual variability exceeded overall performance [64] . One possible explanation for this finding is that as attentional control systems break down, variability in reaction times may increase disproportionately, and this is reflected in the interindividual variability of the results. Indeed, the stretching of the tail on the reaction time distribution is what contributes to an increase in the coefficient of variation [65] ."}, {"section_title": "Semantic memory", "text": "Semantic memory is another cognitive domain that is affected in AD. Functional MRI assessment during a semantic memory task allows investigators to test theories about areas of the brain involved in discrimination of famous versus unfamiliar individuals. Early studies in this area showed that famous faces activate the default mode network (DMN)-including the MTL, posterior cingulate, lateral temporoparietal, and medial superior prefrontal regions [66] . Interestingly, these studies also showed that although different areas of the brain are specialized for processing of faces in comparison with names, common areas involved in semantic processing involved DMN regions [67] .\nThis led to studies designed to answer questions about whether cognitively healthy older individuals activate semantic memory circuits differently than younger participants, and whether differences in semantic activation patterns could be detected between cognitively intact older individuals at different levels of risk for AD based on a family history or family history plus APOE 34 and those diagnosed with aMCI. These studies showed that persons at risk for AD demonstrated increased semantic processing in the DMN. This raises the question as to whether increased DMN brain activation is an indicator of disease state or progression. Neuropsychological follow-up of these cognitively intact persons over 1.5 years showed that although only one person met criteria for MCI, 27 of 78 declined on cognitive measures. It was the stable group that showed greater brain activation at baseline, suggesting that level of semantic processing may be an indicator of compensation in these at-risk individuals [68] .\nThe fMRI test of semantic processing has also revealed tantalizing clues about how physical activity may help maintain cognitive function across the lifespan. A study examining the interactive effect of physical activity and APOE 34 suggested that physical activity selectively increases semantic memory-related brain activation in individuals at high risk of AD [69] ."}, {"section_title": "Semantic interference and prospective memory", "text": "One way to develop more sensitive measures to capture cognitive impairment is to take existing measures and retrofit them based on new knowledge about AD or other causes of dementia. For example, a test of semantic interference was built on the Fuld Object Memory Evaluation (FOME), a test of memory for 10 common household items that have been shown to be culturally fair for both English and Spanish speakers and to have small educational biases relative to other commonly used cognitive tests. The FOME has also been shown to be among the memory measures most strongly related to MTL atrophy [70] . The Semantic Interference Test (SIT) introduces 10 additional semantically related objects after the presentation of the FOME, which interferes with learning and recall. Two types of interference are possible: either proactive interference where old learning interferes with learning of the new list, or retroactive interference where the new list interferes with recall of the old list.\nThe SIT has demonstrated 85% sensitivity and more than 96% specificity in distinguishing individuals with MCI from age-matched cognitively normal participants [71] . In addition, relative to a wide array of neuropsychological measures, Bag B recall, a test of vulnerability to semantic interference on the SIT, was highly predictive of conversion to dementia over a 30-month period [72] . SIT measures are also able to pick up deficits in people who complain of memory problems but have no objective neuropsychological deficits on other measures. Even among individuals with non-aMCI without measurable neuropsychological deficits, 23.5% had one or more SIT impairments.\nProspective memory, or the ability to remember an intended action, is one of the biggest complaints among individuals with memory impairments and head injury. Prospective memory can be either event-related (when an event happens, it cues the person to perform an action) or timerelated (at a certain time, the person is supposed to do something). In a community-based sample of 450 people, more than half of the people with aMCI had prospective memory deficits, and surprisingly nearly one-half of those with nonaMCI also had prospective memory deficits, suggesting that the test could be used to identify people with non-aMCI. However, unlike the SIT, the test has limited predictive utility with regard to predicting progression to dementia over time [72] ."}, {"section_title": "False memory", "text": "False memory is another memory domain that is clinically relevant, although underappreciated in terms of assessing the clinical status of individuals with AD or other memory impairments. Indeed, false memories can be one of the biggest reasons for loss of independence, for example, when people falsely remember that they took their medication when in fact they did not. False memory was used as a measure of decline in episodic memory by asking people where and what they were doing when they first heard news of the September 11, 2001 terrorists attacks on the World Trade Center. In comparison with older cognitive healthy controls, individuals with AD and MCI showed impaired memory a few weeks after the event and the AD group also showed more rapid forgetfulness 3 months later; but neither the AD nor MCI group showed much change in memory between 3 months and 1 year, suggesting that memories were fairly stable after they had become consolidated [73] .\nThis phenomenon has also been studied by creating false memories in the laboratory using the Deese-RoedigerMcDermott false memory task, which tests word list recall with semantic intrusions. Interestingly, what these studies have shown is that over time, the false alarm rate among cognitively healthy individuals goes down because they are able to block false recognition of related or \"gist\" lures. In contrast, individuals with AD block both true and false memories equally, resulting in a higher number of false responses. In other words, they are overly dependent on gist memory [74] . Pictures have been shown to reduce false memories in older adults, but in people with AD, pictures also enhance memory [75] .\nUnderstanding the powerful influence of false memories has important implications for people with AD. In experimental situations when confronted with both false statements and true statements, both cognitively healthy controls and people with AD are good at remembering that true statements were true, but people with AD also remembered false statements as true more than half the time. What this means is that if you tell a person with AD \"Don't do this, do that,\" they will likely remember both of those instructions as true. Instead, it is better just to say \"Do this\" [76] .\nAnother aspect of memory that affects how people with AD perform in comparison with cognitively healthy controls is response bias. Cognitively healthy older adults tend to have a conservative response bias, whereas individuals with AD tend to have a liberal response bias, regardless of discrimination or stimulus type. The neurologic functions that correspond to these differences are being investigated [77] ."}, {"section_title": "Executive function", "text": "Executive cognition relies on brain regions and circuitry different from those involved with episodic memory, and impairment in executive cognition appears relatively early in the evolution of AD, resulting in problems with everyday function. Thus, although memory complaints or even mild memory decline may be benign or temporary in cognitively intact older adults, executive dysfunction suggests that the pathology has spread beyond the hippocampal system and therefore may be predictive of imminent dementia.\nExecutive functions are overarching control mechanisms that modulate other processes and thus regulate the dynamics of human cognition. The frontal lobes are critically important in executive cognition, with different regions of the frontal cortex regulating different aspects of executive cognition. Executive function denotes several distinct mental faculties, but impairment in only some of these is important for the development of dementia. The implication is that tests of executive function may be useful in predicting whether individuals diagnosed with MCI (or CDR: 0.5) will progress to dementia (CDR: 1.0). Brandt and colleagues tested this by administering 18 clinical and experimental executive cognition measures to a group of 104 individuals with MCI and 67 normal controls [78] . Over a 2-year period, 18% of individuals with CDR of 0.5 progressed to CDR of 1.0, while most remained stable, and less than 5% reverted to normal (CDR: 0). Three executive cognition measures (clock drawing, category fluency, and the Tinker Toy (Hasbro; http:// www.hasbro.com/customer-service/contacts/) test, which assesses creativity, planning, and constructional praxis) predicted cognitive and functional decline, although none of these tests independently predicted progression to dementia after adjusting for demographic factors, other cognitive characteristics, and measures of everyday function. The best predictors of conversion were informant ratings of subtle functional impairments and lower baseline scores on memory, category fluency, and constructional praxis."}, {"section_title": "Measuring cognition in diverse populations", "text": "Disparities in cognition and cognitive impairment across racial and ethnic lines have been well documented. Based on multiple studies reported in the previously published data, including the Washington Heights-Inwood Columbia Aging Project and the Aging, Demographics, and Memory Study, The Alzheimer's Association estimated that African Americans are about 2 times more likely than older whites to have AD and other dementias [79] . Understanding the cause of those disparities and ensuring that tools used to identify cognitive and functional status are blind to race and ethnicity are necessary so as to achieve the goal of identifying diverse older adults at risk for AD, particularly now that prevention of AD has begun to take center-stage, making early detection and screening more important than ever.\nFor research purposes, race can be deconstructed into several variables that serve as proxies for more meaningful underlying factors, and these factors have been shown to affect cognition. For example, cardiovascular conditions such as hypertension and diabetes are more prevalent in African Americans; however, ethnic discrepancies in rates of cognitive impairment and AD remain even after accounting for the higher prevalence of these conditions. This may not be the final answer, however, because most of these studies did not include brain imaging. When a diverse group of people were scanned, the sensitivity and specificity of selfreported stroke proved to be quite low [80] . Further, when white matter hyperintensities were assessed, race proved to be a factor, with African Americans and Hispanics having more white matter hyperintensities than whites [81] .\nEducational quality is another important race-related factor that may influence cognition. Across the country, there is an enormous disparity in years of schooling among different racial groups, and additional disparities in other factors related to school quality, such as number of days in school [79, 82] . Indeed, most of the variance in reading level/ vocabulary is explained by the state in which an individual was born and raised, and the resulting educational system that he was exposed to. Similar results were found when looking at cognitive outcomes across multiple domains. For example, in the Washington Heights-Inwood Columbia Aging Project study, comparing delayed recall scores among groups with differing levels of literacy showed that although all groups decline over time, lower literacy groups have a more rapid decline than high literacy groups [83] . Similarly, in Spanish speakers, literacy in either Spanish or English was a strong predictor of performance on a language composite score. Moreover, memory and language performance at baseline, as well as reading level and years of education, have been shown to be predictors of incident AD [79] . Because low educational quality is related to a higher risk for cognitive decline, regardless of race and ethnicity, it is imperative that variables such as reading level and other factors related to educational attainment (e.g., place of birth, years of schooling) be collected in studies of early dementia. Moreover, in the development of measures of cognitive performance, the common practice of excluding individuals who have low reading level results in elimination of people who are at the highest risk of developing AD.\nOther strategies to address disparities in cognitive performance include adjusting for educational experience, controlling for cultural or race-related variables, or using separate tests and/or race-based norms [84] . Although differences are often attenuated with these strategies, and the specificity of diagnosing MCI or AD may be improved, the use of these strategies may weaken the ability to predict who will go on to develop MCI and AD."}, {"section_title": "African Americans", "text": "Another useful strategy to address disparities in cognitive function is to examine change in cognitive function over time in which individuals serve as their own baseline. This allows for level and slope to be examined individually, which is important because there may be risk factors that predict level but not change in neurocognitive function. To demonstrate the validity of this approach, cognitive data from two longitudinal cohort studies with identical data collection and study designs-the Minority Aging Research Study and the Rush Memory Aging Project-were merged to examine the relation of risk factors to change in cognition over time. The Minority Aging Research Study cohort included 400 elderly African Americans without known dementia at baseline from the Chicago area, and the Rush Memory Aging Project cohort included elderly residents from senior housing and retirement communities, with about 10% to 12% minorities. First, using years of education as an example risk factor, the merged data showed that there were significant differences in level of cognition for those with high versus low education, but no difference between the two education groups in the rate of cognitive decline. A similar pattern was seen when race was used as a risk factor. Although there was substantial heterogeneity in individual starting levels and rates of decline in both African Americans and whites, there was no difference in average change over time, despite large racial differences in level of performance. These studies next examined whether there were racial differences in the effects of certain risk factors on cognitive decline. For example, they found that although the level of neuroticism was associated with the rate of decline in both African Americans and whites, the association did not differ by race. Likewise, although the presence of at least one APOE 34 allele increased the rate of decline in both racial groups, there was again no difference by race."}, {"section_title": "Primarily Spanish-speaking individuals", "text": "With approximately one in five Americans self-identified as Spanish-speaking, the United States is currently home to the second largest Hispanic population and the third largest Spanish-speaking population in the world [82, 85] . Although Hispanics have the greatest life expectancy among all minority groups, they also have a higher prevalence of medical conditions that are associated with cognitive impairment, including vascular pathology, hypertension, and diabetes [86, 87] . Hispanics also experience the onset of Alzheimer's symptoms 7 to 8 years earlier than their Caucasian counterparts, and yet are least likely to be diagnosed [79, 86, 87] .\nThere are many issues complicating successful neurocognitive assessment among the Hispanic and primarily Spanish-speaking community, including educational and socioeconomic discrepancies from the dominant culture. For instance, 22% of Hispanics live below the poverty line, and Hispanics account for 34% of the 46 million uninsured people [79, 82] . Education levels also vary considerably, with 21% having less than a ninth-grade level of education [79, 88] . Hispanics may also have differences in religious practices, eating habits/diet, exercise, and use of remedies/medication. Such disparities along with various sociodemographic characteristics, including issues related to acculturation and language, can not only affect test comprehension, but also test-taking strategy as well [85, 89, 90] . Acculturation includes cultural differences, different exposures, and the issue of fatalism, which can result in poor medical compliance [89, 91] . Moreover, educational opportunities and the language itself varies across Spanish-speaking countries and commonly used English terms and phrases are not likely to portray the same ideas and concepts when literal translations of cognitive measures are used [91] .\nResearch has shown that 5 or more years of formal schooling in the nondominant language are required to learn some of the test-taking strategies essential to neurocognitive testing, and psychometric instruments can inflate or mask the severity of deficits in individuals lacking such experience [92, 93] . For example, neurocognitive assessments of adaptive functioning may suggest deficits simply because the individual is unfamiliar with the testing paradigm. Nonverbal tests have been used to try to eliminate the influences of language, but cultural differences between Hispanics and non-Hispanics may also influence comprehension of task requirements [94] . In addition, a lack of normative data representative of the sociodemographic profile of U.S. Hispanics and primarily Spanish speakers limits the sensitivity and specificity of cognitive measures used with members of this community [88, 91] . Although efforts have been made to improve the quality and access of neuropsychological tests to primarily Spanish speakers, much remains to be done in terms of establishing norms and developing tools that are useful in such diverse populations."}, {"section_title": "Bilingual individuals", "text": "Bilingualism presents additional challenges in terms of cognitive assessment [95] . Although children of primarily Spanish speakers who were born in the United States may masquerade as English-only speakers or may seem to speak English as well as native monolingual English speakers, in reality, very few people achieve monolingual levels of ability in two languages, meaning that they may perform quite differently from monolinguals on whom norms have been based. One difference between bilinguals and monolinguals concerns the frequency of language use. If a SpanishEnglish bilingual is speaking Spanish some of the time and English the rest of the time, he or she is in fact using each language less frequently than monolingual speakers in either language, and thus may perform differently on tests of skills such as vocabulary.\nAnother linguistic challenge that bilinguals face is interference between languages. This primarily affects speaking in a nondominant language because the dominant language has more power to interfere; however, accumulating evidence suggests that competition between languages can affect bilinguals' ability to use their dominant language. In some ways then, bilingual language use becomes a constant exercise in executive control. In fact, bilinguals rarely speak the wrong language by mistake, and rarely slip even one word in the wrong language into conversation by mistake. This suggests that bilingualism may strengthen the ability to select between competing responses even in nonlinguistic tasks. For example, bilinguals responded more quickly than monolinguals on \"switch trials,\" where people were instructed to switch between a selection based on color or shape. This advantage appears even in college-aged Hispanic bilinguals in the United States if matched to monolinguals for parental education levels, and if not matched, bilingualism seems to offset the effects of lower parental education level, which has been shown to affect performance on these types of tasks.\nSemantic category fluency is also significantly lower in Spanish-English bilinguals than in monolinguals [96] , and because semantic fluency is often an affected domain in AD, this increases the difficulty of assessing bilinguals. Tests can be modified to reduce the bilingual disadvantage, for example, by counting only words that are similar in English and Spanish [97] or in picture-naming tests by allowing bilinguals to use either language; however, if the goal of testing is to distinguish persons with AD from controls, dominant language naming scores seem to provide better discrimination than either-language naming scores [98] . The best solution may be to develop tests specifically for bilinguals and to design standardized methods for assessing the degree of bilingualism."}, {"section_title": "Cross-cultural assessment", "text": "Most studies of dementia and MCI have been conducted in high-income, developed countries. However, additional challenges exist in trying to assess ethnically diverse populations in developing countries, where the life expectancy is increasing even more rapidly than in developed countries and the global burden of AD is expected to be even greater. Cross-cultural studies are therefore needed to make meaningful comparisons of disease burden, risk factors, and outcomes, as well as to plan intervention and prevention programs. These studies must take into account that different cultures have different expectations of what normal aging looks like, as well as different support systems to buffer the impact of age-related changes. Assessment is also hampered by the unavailability of measures in the local language, the lack of culturally validated measures, and considerations for uneducated people, as well as local norms. In addition, the psychometric properties of measures, such as reliability, validity, sensitivity, specificity, and predictive value, may vary across populations.\nTo examine similarities and differences in risk factors for dementia across cultures and nations, investigators at the University of Pittsburgh compared a largely rural population in southwestern Pennsylvania with another in Ballabgarh, India. Instruments were adapted through a process of translation, back translation, testing, and modification to come up with, for example, Hindi versions of the MMSE and the CERAD brief cognitive screening test battery [99, 100] . Because a significant proportion of the volunteers in India were illiterate, oral instructions and auditory stimuli were used in modified tests of verbal memory. For language tests, letter fluency was eliminated and replaced by category fluency. For tests of visuospatial function, because many participants had never used a pencil, linedrawing tests were eliminated for assessing visual/spatial skills but could be replaced, for example, by tasks that required arranging matchsticks [101] . Beyond the test that is used, an additional difficulty in some populations is that the whole idea of being tested is alien to people who have never experienced formal schooling.\nDeveloping functional measures can be even more challenging because functional impairment may be masked by a nonchallenging environment and low expectations for the elderly population. An everyday abilities scale for India was developed [102] , which asks questions such as \"Does she ever lose her way within the village?\" Depression is a particularly difficult condition to assess because different cultural expectations may appear to an outsider as a depressive behavior. For example, traditional Hindu teaching is that the last phase of life should be characterized by gradual disengagement from worldly matters. However, the clinical core of depressive illness is probably the same in all cultures. These issues were addressed in the development of a Hindi version of the Geriatric Depression Scale [103] ."}, {"section_title": "Measuring cognition for other dementias", "text": "Neurodegenerative diseases other than AD may also present with dementia, and it is important to distinguish them to manage these individuals appropriately and identify research candidates for treatment trials.\nAs in the general population, in Parkinson's disease (PD), there is also a continuum between normal cognition, MCI, and dementia (Parkinson's disease with dementia [PDD]). MCI is common in PD (approximately 26%) and heterogeneous [104] . The major risk factors for PDD are older age, parkinsonism severity, particularly postural instability and gait disorder, and MCI. Deficits in semantic fluency and figure copying are risk factors for PDD [105] . These deficits have been linked to genetic polymorphisms in the catechol-Omethyltransferase and microtubule-associated protein tau genes [106] . Taken together, these studies suggest that there are multiple features, genetic and cognitive, that can help predict which individuals with PD will go on to develop dementia.\nThe incidence of dementia is 5 to 6 times higher in persons with PD than in the general population. The prevalence of PDD is 30%, and its cumulative risk is up to 80% [107] . The incidence of PD increases with age [108] . PDD develops progressively, affecting attention, retrieval more than encoding, and executive and visuospatial functions. Language in PDD is mostly preserved. Behavioral symptoms such as depression, hallucinations, and apathy are very frequent, but are not needed for the diagnosis of PDD [19] .\nThere are no specific laboratory studies for the diagnosis of PDD, but CSF b-amyloid 42/38 ratio has been recently suggested as a possible biological marker [110] . Neuropsychological assessment in PDD is challenging, and should consider tests that do not affect motor function [111] . The progression of PD to PDD correlates with the pathological PD stages proposed by Braak et al [112] . In PDD, a-synuclein aggregates forming Lewy bodies and neurites are present in the cortex and limbic areas. AD pathology associates with Lewy body pathology, but the cognitive disturbances usually relate to the a-synuclein aggregates [113] .\nThus, PD has different cognitive, behavioral, and pathological characteristics as compared with AD. Moreover, the neurochemical disturbances in PDD differ from AD, with persons with PD experiencing more severe cholinergic deficits when dementia is also present (PDD) [114] . Serotonin deficits, which are associated with depression and anxiety, are also prominent in persons diagnosed with PD [115] . Hence, in addition to the dopaminergic deficit, individuals with PD experience a lot of nondopaminergic symptoms that include cognitive as well as psychiatric aspects.\nDementia with Lewy bodies (DLB) is assumed by some people to be on a continuum with PD. The criteria for diagnosing DLB were revised in 2005 [116] , although the central feature, dementia, and the core features-fluctuating cognition with pronounced variation in attention and alertness, well-formed detailed recurrent hallucinations, and spontaneous features of parkinsonism-were not changed. Three new suggestive features were added to the criteria, including REM sleep behavior disorder (RBD), severe neuroleptic sensitivity, and low dopamine transporter uptake in the basal ganglia. RBD occurs disproportionately in DLB and other synucleinopathies, but rarely in tauopathies, including AD, FTD, primary progressive aphasia, cortical basal dementia, and aMCI. RBD can precede dementia or parkinsonism by decades, and autopsy studies suggest that persons with dementia and RBD are almost 6 times more likely to have DLB than AD. Cognitive testing further showed that in comparison with participants with AD, persons with polysomnography-confirmed RBD had worse visuoperceptual organization, sequencing, and letter fluency, but better confrontation naming and verbal memory [117] . Thus, it seems that the presence of RBD plus dementia may be diagnostic for early DLB.\nAs in PD, DLB is associated with more severe neocortical cholinergic depletion relative to AD [118, 119] , and as a result, these individuals have difficulty with visual/perceptual attention and reaction time tasks. These perceptual difficulties seem to be the result of an elementary visual processing deficit [120] . A battery of just four tests have been identified that can be helpful in diagnosing DLB [121] , although more sensitive tests of attention and visual problems are needed. This is important from a treatment perspective because individuals with both DLB and Alzheimer's pathology are exquisitely sensitive to neuroleptics and respond well to cholinesterase inhibitors. Identifying the particular pathologies present will also allow participants to be placed into the appropriate clinical trials.\nFTD is a common cause of early-onset dementia that can present as either a behavioral syndrome or a progressive aphasia. New research criteria for bvFTD, the most common variant, include three of six characteristic clinical symptoms (early onset of behavioral disinhibition, apathy or inertia, loss of sympathy and empathy, perseverative or ritualistic behaviors, hyperorality, and executive dysfunction) plus neuroimaging evidence of frontal and frontotemporal atrophy or hypoperfusion. Pathological changes likely begin in the right frontal insular cortex, with rapid inclusion of the anterior cingulate, ventral striatum, and ventral medial prefrontal cortex, only later extending to dorsolateral prefrontal cortex. This anatomical pattern likely explains why behavioral and emotion processing changes are more prominent at an earlier stage than are cognitive deficits.\nNeuropsychological findings from individuals with mild (CDR: 0.5) bvFTD and AD are similar across many domains, but two areas in which persons with bvFTD do worse are (1) the number of times they break rules on neuropsychological tests, and (2) naming facial affect. On cognitive tasks, individuals with mild bvFTD often perform normally on many measures of executive functioning, although experimental measures such as the flanker paradigm may be sensitive to subtle deficits in attentional control [122] . Indeed, it is in the area of social cognition where individuals with bvFTD show the most dramatic impairments. Characteristics like poor social engagement and inappropriate behaviors are not captured by cognitive test scores but can and should be recorded by examiners. Questionnaire and interview-based caregiver reports are also valuable in trying to understand the changes seen in individuals with bvFTD. The Interpersonal Reactivity Index is one such informant-based assessment that looks at aspects of cognitive and emotional empathy [123] . Another useful tool is the Revised Self-Monitoring Scale, which assesses an individual's sensitivity to the expressive behavior of others and ability to modulate selfpresentation. The Social Norms Questionnaire (Rankin) asks participants to state whether 22 different behaviors (e.g., laughing when someone trips and falls) would be appropriate in the presence of an acquaintance according to \"mainstream\" culture. Individuals with bvFTD perform significantly worse on this test as compared with controls or people with AD."}, {"section_title": "Conclusion", "text": "It is clear that a wide variety of measures are becoming available to more sensitively track subtle changes in cognition over time in both cognitively healthy older adults and those with dementing illnesses. Cognitive changes are the hallmark of Alzheimer's dementia, and detecting early cognitive symptoms is essential not only for diagnosis but also for evaluating progression of disease, validating imaging and fluid biomarkers, screening potential research participants, and evaluating the effects of new treatments in clinical trials."}]