[{"section_title": "Abstract", "text": "EBM2\nThe hippocampus is a widely recognized area of early change in AD, yet voxelwise analyses of FDG-PET activity differences between AD and CN controls have consistently failed to identify hippocampal hypometabolism. In this article, we propose a high-dimensional PETspecific analysis framework to determine whether important hippocampal metabolic FDG-PET activity differences between patients with AD and CN subjects are embedded in the Jacobian information generated during spatial normalization."}, {"section_title": "T", "text": "he hippocampus is widely recognized as an area of early change in AD, with volume loss consistently reported across a wide variety of MR imaging studies, sample sizes, methodologies, and instruments. 1 The case for altered hippocampal metabolism in AD, and, more specifically, for whole-brain FDG-PET, has been less clear and even divergent between studies. Most metabolic neuroimaging studies have failed to show hippocampal dysfunction in AD and MCI. 2, 3 A consistent and striking finding has been the lack of hippocampal metabolic differences on whole-brain FDG-PET using statistical parametric mapping-based (SPM; Wellcome Department of Imaging Neuroscience, London, UK) voxelwise analysis methods comparing patients with AD and CN control subjects. [2] [3] [4] [5] [6] Group comparisons using these voxelwise PET methods have consistently shown hypometabolism in the cingulate gyrus and temporoparietal areas for AD but, interestingly, not in the hippocampus. Some ROI-based methods, however, have shown hypometabolism in the hippocampus for AD, 3, 4, [7] [8] [9] [10] and a variety of studies have attempted to address this apparent inconsistency between voxelwise and ROIbased methods. Many of these investigations have centered on potential methodologic artifacts or discrepancies related to spatial resolution, partial volume effects, inaccuracies in PET-MRI coregistration, and the method of PET intensity normalization. [2] [3] [4] 11, 12 The lack of hippocampal metabolic change (and, more specifically, hypometabolism in AD) associated with SPM-style voxelwise analyses, however, has not been adequately explained. We hypothesize that the source of the apparent discrepancy can be traced to the analytic methods and the nature of the question being posed in the analysis.\nVoxelwise methods applied to FDG-PET data typically adapt techniques from VBM developed for MR imaging structural analysis. [13] [14] [15] [16] [17] For PET data, this involves 1) coregistration of the native subject PET data to the native MR imaging, 2) spatial normalization of the subject MRI scan to an atlas or study template (usually based on gray matter segmented tissue maps), and 3) application of the transformation parameters from the MR imaging normalization to the coregistered PET data. These steps bring the individual subject PET images into alignment with each other in template space, allowing voxelwise analysis of differences using standard SPM-style 2-sample t-statistics. In comparison with the MRI-based VBM pipeline, there is a critical step that is universally omitted. In MRI-based analysis, the spatially normalized images are modulated, with the determinant of the Jacobian specifying the degree of expansion or contraction at each voxel. This is necessary to preserve gray matter volumes, as a perfect normalization would show no differences in the spatially normalized images alone (referred to as gray matter concentration). Specifically, a voxel that is segmented as 100% gray matter (concentration) on MR imaging will not vary in gray matter content between populations, and hence, a perfect MR imaging spatial normalization will show no differences in gray matter concentration between template and normalized subject. With the advent of highly accurate high-dimensional normalization algorithms, this realization has led to a method of analysis termed tensor-based morphometry, in which group differences are identified entirely on the basis of the shape change parameters rather than the spatially normalized images that, alone, would carry very little information on the structural differences. The situation for PET is different, in that voxels can show differential FDG activity despite having equal gray matter content. In addition, the assumption that coregistration between PET and MR imaging can be performed accurately in diseased states, for the purposes of applying MR imaging normalization parameters, can be called into question. For example, diseased hippocampal activity on PET imaging may not be reflective of the entire spatial extent of the hippocampus visible to the human observer or to a computer algorithm on the corresponding MRI, which is a central assumption for accurate coregistration between structures.\nIn this study, we investigate hippocampal metabolic activity in AD using a PET-specific framework with a novel highdimensional normalization strategy, while accounting for the degree of spatial deformation. Previous MRI-related normalization methodologic confounds are addressed by using a PET-specific population template. The purpose of this study is to determine whether important hippocampal metabolic FDG-PET activity differences in whole-brain voxelwise analyses between patients with AD and normal controls are embedded in the Jacobian information generated during spatial normalization."}, {"section_title": "Materials and Methods", "text": "Data used in the preparation of this article were obtained from the ADNI database (adni.loni.ucla.edu). The ADNI was launched in 2003 by the National Institute on Aging, the National Institute of Biomedical Imaging and Bioengineering, the Food and Drug Administration, private pharmaceutical companies and non-profit organizations, as a $60 million, 5-year public-private partnership. The primary goal of ADNI has been to test whether serial MR imaging, positron emission tomography, other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of MCI and early AD. Determination of sensitive and specific markers of very early AD progression is intended to aid researchers and clinicians to develop new treatments and monitor their effectiveness, as well as lessen the time and cost of clinical trials.\nThe Principal Investigator of this initiative is Michael W. Weiner, MD, VA Medical Center and University of California-San Francisco. ADNI is the result of efforts of many co-investigators from a broad range of academic institutions and private corporations, and subjects have been recruited from over 50 sites across the U.S. and Canada. The initial goal of ADNI was to recruit 800 adults, ages 55 to 90, to participate in the research, approximately 200 cognitively normal older individuals to be followed for 3 years, 400 people with MCI to be followed for 3 years and 200 people with early AD to be followed for 2 years. For up-to-date information, see www.adni-info.org."}, {"section_title": "Participants", "text": "We used available baseline PET-FDG data, as described in the ADNI acquisition protocol, [18] [19] "}, {"section_title": "PET Scans", "text": "Preprocessing by ADNI project investigators includes reorientation to a common spatial orientation, resampling to 1.5-mm isotropic dimension, and intensity normalization to a subject-specific mask, such that voxel values in the mask sum to 1. 19 The intensity normalization step was designed to account for differences introduced by the use of multiple scanners."}, {"section_title": "20", "text": ""}, {"section_title": "Standard PET Processing Framework", "text": "Before describing our image processing methodology, we first briefly review the standard PET processing framework, followed by a conceptualized description of spatially normalized, modulated, and Jacobian maps. In the typical PET processing pipeline, spatial normalization alone is performed based on MR imaging parameters, without any modulation with the Jacobian. After spatial normalization, the activity in the native image is resampled to the space of the template image. The voxel values are not altered. Comparison of these images asks the question, \"Does average FDG activity differ between structures?\" This does not take into account the effects of atrophy or changes in local spatial distribution of activity (eg, up-or downregulation). Figure 1 demonstrates a conceptualized normalization for a representative atrophied area. After spatial normalization to a template of 16 voxels for the hippocampus, if the activity in an atrophied hippocampus (eg, 1 count for each of 4 voxels; Fig 1B) is the same as that for a normal hippocampus (1 count for each of 16 voxels in Fig  1A) , there will be no difference between the normal and diseased areas (1 count for each of 16 voxels; Fig 1D) . Modulation of the spatially normalized images with the amount of shape change (Jacobian) scales the voxel values to reflect the original volume of the structure. A comparison of modulated images asks the question, \"Does total activity differ between structures?\" Using the same example, the 1 count in each of 16 voxels is now scaled for the degree of expansion, reducing the value to 0.25 in each of the 16 voxels for the diseased case ( Fig  1E) . The Jacobian maps derived from the spatial normalization parameters quantify the degree of local expansion or contraction required to match the template. If there is no difference in average activity, all the differences will be present in the Jacobian deformation fields."}, {"section_title": "Symmetric Diffeomorphic Registration", "text": "Identification of brain imaging differences in populations is highly dependent on precise alignment between different subjects. SyN uses diffeomorphisms (differentiable and invertible maps with a differen-tiable inverse) to capture both large deformations and small shape changes. 21 In the largest evaluation of nonlinear brain registration algorithms to date, SyN provided the most consistently high accuracy across subjects and label sets."}, {"section_title": "22", "text": ""}, {"section_title": "Custom Template Construction", "text": "A PET custom study-specific template was built using a diffeomorphic shape and intensity averaging technique. 21, 23 The PET template was constructed from 397 ADNI participants (102 CN, 203 with MCI, and 92 with AD, including participants for this study). Parameters for the template construction procedure included a 4-level Gaussian pyramid as the multiresolution strategy and the cross-correlation similarity metric, with 200 maximum iterations. This yielded an unbiased average shape and appearance template, as well as the set of diffeomorphisms and inverse diffeomorphisms that map from the template to each individual. The resulting PET study template was then normalized, using SyN to the Montreal Neurological Institute space PET template provided in SPM resampled to 1-mm isotropic voxel dimensions."}, {"section_title": "21,23", "text": ""}, {"section_title": "PET Spatial Normalization", "text": "The subject-specific inverse deformation parameters computed from the PET population template generation procedure were combined with the custom PET template to Montreal Neurological Institute space normalization parameters to bring the PET individual subject images into Montreal Neurological Institute space in a single resampling step."}, {"section_title": "Modulation and Tensor-Based Morphometry", "text": "The nonlinear transformations from the SyN procedure provide deformation tensor fields describing the voxelwise shape changes from the template to each subject's brain. The Jacobian determinants of these deformation fields indicate the fractional volume expansion and contraction at each voxel required to match the template. PET-specific modulated maps were generated by multiplying the spatially normalized PET images by the respective Jacobian determinants."}, {"section_title": "Statistical Group Comparisons", "text": "Voxelwise analyses were performed to identify regional variation in FDG activity between patients with AD and CN subjects using the 2-sample t test model in SPM8. Group comparisons were performed for 1) spatially normalized raw PET, 2) modulated PET (spatially normalized ϫ Jacobian), and 3) Jacobian PET (tensor-based morphometry). For the spatially normalized raw PET data modeling in SPM, no additional intensity scaling (eg, proportional scaling) was performed, as the preprocessed PET data downloaded from the ADNI data base were already subject to intensity scaling. In addition to whole-brain comparisons, an hpa mask was constructed using the automated anatomical labeling atlas, 24 as implemented by the wfu_pickatlas 25 for ROI-based hypothesis testing in SPM8. All statistical parametric maps were thresholded at P Ͻ .05 and corrected for multiple comparisons using a stringent FWE-rate Bonferroni correction for the whole-brain maps or the false discovery rate [26] [27] [28] [29] for the hippocampal masked data."}, {"section_title": "Standard PET Processing", "text": "For comparison purposes, we also performed analysis of the data using a standard PET processing pipeline. PET images from each subject were coregistered to their corresponding MRI T1-weighted image using the mutual information algorithm in SPM8. The individual subject MR images were segmented and normalized to Montreal Neurological Institute space using the Dartel high-dimensional warping and the SPM8 new segment procedure, as implemented in the VBM8 toolbox. The coregistered PET images were normalized to Montreal Neurological Institute space using the transforms computed for the corresponding structural MR imaging. Effect sizes (Cohen d; correlation coefficient, r) were computed between the AD and CN groups using the hpa ROI for the following 3 analysis methods: modulated PET (custom PET template), standard PET-MRI, and MR imaging only (modulated gray matter VBM MRI images from the SPM8 new segment procedure). In addition, sample-size plots were generated for each analysis method using the hpa ROI with a type I error rate of .05."}, {"section_title": "Results", "text": ""}, {"section_title": "Spatially Normalized Raw PET Data", "text": "SPMt maps for CN-AD, using a stringent P Ͻ .05 FWE multiple comparisons correction, demonstrated metabolic differences in the posterior cingulate and bilateral parietal areas (Fig  2) . There were no hippocampal regions that survived correction on the whole-brain analysis. With the use of the hippocampal ROI mask, however, bilateral hippocampal metabolic differences were apparent (Fig 3) ."}, {"section_title": "Modulated PET Data (Custom Template)", "text": "The modulated PET whole-brain SPMt analysis for CN-AD (P Ͻ .05, FWE corrected) demonstrated strong bilateral A) . C, Normalization procedure computes expansion and movement parameters required to match subject to template. D, Application of normalization parameters resamples values based on intensity of source voxels (result is now indistinguishable from template). E, Modulation with Jacobian information restores differences based on degree of expansion/contraction required. In this example, the Jacobian map will look like the modulated map because source and template activity levels are the same (unit 1 activity/voxel). Note that this is a simplified model. If underlying activity differences are present in the raw data, these would also be reflected in the resampled values in D. Similarly, raw voxel values mapped to the same region in the template would be averaged in intensity.\nhippocampal metabolic differences as well as differences in the posterior cingulate (Fig 4) . The parietal differences were no longer apparent. With the hpa mask, CN-AD demonstrated even more robust differences in the hippocampus (Fig 5) ."}, {"section_title": "Jacobian PET Data", "text": "Whole-brain comparison of CN-AD on the Jacobian maps (P Ͻ .05, FWE corrected) demonstrated exclusively bilateral hippocampal metabolic differences (Fig 6) . Other areas, including the cingulate and parietal regions, no longer survived multiple comparison correction. With the use of the hpa mask, strong hippocampal differences were again identified on the CN-AD (Fig 7) ."}, {"section_title": "Effect Sizes", "text": "Effect sizes for the modulated PET data (custom PET template) were 1.12 and 0.49 (Cohen d and r, respectively). Effect sizes for the standard PET-MRI analysis were 0.47 and 0.23, while, for structural MR imaging alone, effect sizes were 1.58 and 0.62. Sample sizes for detecting a difference at 80% power with a .05 Type I error rate were 8, 12, and 68 subjects per group, for MR imaging alone, modulated PET, and standard PET, respectively (Fig 8) ."}, {"section_title": "Discussion", "text": "Whole-brain voxelwise analyses of FDG-PET data in studies of AD have been notoriously devoid of differences in the hippocampus. This has been ascribed to a variety of factors, including partial volume effects, limited spatial resolution, and poor registration between PET and MR imaging, but a definitive explanation has been lacking. We demonstrate that the hippocampal differences are not just present in the FDG-PET data-they are massive in scope and are comparable with those identified for structural MR imaging."}, {"section_title": "Hippocampal Activity Differences Embedded in Jacobian Determinants", "text": "The negative findings in previous FDG-PET reports stem from a processing approach adapted from the MRI VBM literature and the nature of the underlying comparisons in the activity being performed. Specifically, much of the activity difference is contained in the Jacobian information from the spatial normalization procedure. While the Jacobian is used for MRI VBM processing (modulated data, or tensor-based morphometry), it has instead been discarded in the PET processing pipeline. Because the warp fields are typically computed between individual subject MR imaging and template MR imaging, and subsequently applied to coregistered PET data, it does not make sense to use this Jacobian information, as it There is no activity difference that survives correction in the hippocampal regions."}, {"section_title": "Fig 3.", "text": "Raw FDG SPMt for CN-AD with hippocampal ROI mask thresholded at P Ͻ .05 with false discovery rate correction. Bilateral hippocampal activity differences are now apparent. The hippocampal mask markedly reduces the multiple comparisons correction problem, allowing the activity differences to survive.\nwould provide only a measure of MR imaging differences. We have taken the approach of generating a PET-study-specific template for the normalization procedure, rather than relying on coregistration between PET and MR imaging. Thus, the Jacobian information reflects only PET-related differences in populations, with no relationship to the MR imaging normalization procedure. Using this approach, large differences are identified specifically in the hippocampus on both the PET Jacobian maps alone, as well as the modulated PET data. The decreased metabolism on the raw FDG maps is not sufficient to survive multiple comparisons correction for whole-brain voxelwise studies. It only becomes apparent with the use of a hippocampal region of interest, which significantly reduces the multiple comparisons problem, allowing statistical significance to be achieved. An important question is whether there is decreased activity, as a whole, in the hippocampus, taking into consideration the effects of atrophy. The critical piece of information is contained in the degree of expansion and contraction required to match the template. In the case of AD, there is a massive difference in the activity levels in the hippocampus, as manifested on the modulated maps and in the Jacobian maps alone."}, {"section_title": "Extrahippocampal Regions", "text": "Some additional, interesting observations arise from an analysis of the modulated and Jacobian maps, with reference to areas outside the hippocampus. On the raw FDG maps, there are large activity differences in the parietal lobes bilaterally, as well as in the cingulate gyrus, which have been demonstrated in numerous FDG-PET studies. With modulation, however, the parietal areas disappear and the cingulate gyrus activity differences become markedly reduced, as well as more restricted to the posterior cingulate. On the Jacobian maps alone, there are no differences identified in either of these regions. In the context of the PET-based normalization procedure, this suggests that these areas have some increased spatial extent of FDG uptake in the patients with AD (or a spatial up-regulation) to compensate for the reduced underlying activity (assuming the difference is not attributable to a regional increase in gray matter volume in the subjects with AD)."}, {"section_title": "Study-Specific PET Template", "text": "A significant methodologic departure proposed here is the use of a study-specific PET template for the spatial normalization procedure. Many previous studies have used coregistration of PET data to a corresponding MRI in the same subject, and application of the parameters computed from an MRI-to-MRI normalization procedure. The reasoning for this approach is that, due to the inherently higher spatial resolution, the MRIbased normalization is more accurate. This approach assumes that PET activity corresponds to anatomic structure in a consistent manner between disease states and anatomic locations. Bilateral hippocampal activity differences are now present, as well as posterior cingulate gyrus activity differences. The parietal differences are no longer apparent, and the degree of cingulate gyrus activity difference is markedly reduced from the raw FDG comparison. This assumption is not biologically plausible, as cerebral metabolic activity levels can vary within anatomic structures, based on metabolic demand and underlying pathology. In addition, this approach universally discards information on local expansion and contraction computed from the MRI-based parameters. The use of a PET-study-specific template allows the valid use of all normalization information (including the Jacobian determinants) to identify population differences based only on FDG-PET data. In previous reports, the use of MRI-to-MRI normalizations would invalidate any unique PET information to be gained from the tissue expansion and contraction coded in the MRI-based transformations. The PET data can contain combinations of information that may be lost when standard MRI-to-MRI normalization is transposed to PET, such as metabolic volumetric differences, activity changes restricted to an anatomic structure, activity differential gradients across an anatomic structure, as well as upregulation of the spatial extent of activity that may encompass more than a particular anatomic boundary.\nThe use of modulated data and Jacobian information is more than simply academic in importance. A primary goal of AD research is the search for early biomarkers to diagnose and evaluate treatment effects. Imaging has taken an important role in this regard, with numerous efforts aimed at using both MR imaging and PET imaging data for diagnosis and classification of subjects such as those with AD and MCI, or those who are CN. With regard to PET, much of the sensitivity present in the data for identifying AD in the critical hippocampal regions is not currently being utilized. Incorporation of these additional imaging biomarkers (Jacobian and modulated data) may increase the sensitivity of methods for individual subject diagnosis, including those that rely on univariate statistics, z-score population comparisons, and the newer machine learning classification approaches. Jacobian FDG SPMt for CN-AD with hippocampal ROI mask thresholded at P Ͻ .05 with false discovery rate correction. Strong bilateral hippocampal activity differences are present."}, {"section_title": "Fig 8.", "text": "Sample size plots for MR imaging alone (green), modulated PET (blue), and standard PET-MRI (red). Results are subjects/group required for detecting differences in hpa region of interest between CN subjects and patients with AD at .05 Type I error rate.\nThe differences in analytic approaches are clearly exemplified by comparing power curves and sample sizes required to identify differences in populations for the hippocampal region (Fig 8) . Using the modulated PET approach, a difference in populations can be identified using only 12 subjects per group. This is comparable with the power of using MRI VBM alone (8 subjects per group). In contrast, using the conventional PET approach, a 5-to 6-fold increase in subjects (68 subjects per group) is required to observe comparable differences. In addition to the massive loss in sensitivity for identifying subtle differences, this translates to nearly an order of magnitude increase in imaging costs (in this example, well over $100,000, assuming $1000 per PET scan)."}, {"section_title": "Use of Modulated Data", "text": "Unlike the case for structural MR imaging analyses, modulated data are typically not used for imaging studies of brain function. For example, in fMRI studies, most investigators are only interested in comparisons of the average signal within each region. Information on the total amount of signal in fMRI (provided by modulated data) within a region is typically not considered. However, total activity may provide a better model for the underlying processes being studied. In this sense, the use of modulated data with functional brain imaging data (fMRI, PET, arterial spin-labeling, etc) may provide a more appropriate model and better sensitivity, depending on the question being asked."}, {"section_title": "Reconciling Voxelwise and ROI-Based Studies", "text": "We have demonstrated why previous SPM-style voxelwise analyses of AD PET data have not shown strong hippocampal differences. These previous SPM-style analyses are measuring average activity, which is enforced by the spatial normalization process. The average activity within the hippocampi between groups is not greatly different, whereas total activity shows large differences. Activity differences become apparent only with the use of a hippocampal region of interest, which reduces the multiple comparisons problem. ROI methods do not need to correct for multiple comparisons. In this sense, the multiple comparisons correction applied to whole-brain voxelwise studies is potentially the source of differences with ROIbased methods that are also measuring average activity. In addition, some manual and semiautomated ROI-based PET analyses demonstrating hippocampal hypometabolism are probably measuring total activity in the hippocampal region (or mean of total activity between hemispheres). This capability is inherent in the ROI-based approach, regardless of whether each hippocampus is carefully outlined on a corresponding structural image or drawn directly on the PET image itself."}, {"section_title": "Limitations", "text": "There are several potential limitations of our study. For the PET analysis, we used signal-intensity-scaled data from the ADNI data base. There are a variety of signal scaling methods used in PET imaging and continued debate regarding which to use in different circumstances. 30, 31 The ADNI preprocessing is essentially a proportional scaling approach, similar to that of SPM. We performed some analyses using additional proportional scaling in the SPM modeling and had similar results to those reported here. In AD, the cerebellum is probably more normal in FDG activity than the remaining brain; thus, using a cerebellar standard would result in lower supratentorial values for AD and would probably increase the observed cingulate and bilateral parietal activity on the raw FDG maps. It is important to note that a cerebellar normalization procedure can have a profound effect on the reverse AD-CN contrast, in which proportional scaling typically demonstrates large bilateral cerebellar activity differences, which disappear with cerebellar normalization. 30, 31 Thus, some care must be taken in interpreting differences that relate to the regions used for intensity scaling in the frontotemporal dementias. Partial volume effects can result in an underestimation of the metabolic activity. 32, 33 Additional PET analyses performed using a voxelwise gray matter volume regression method 34 to correct for these effects demonstrated similar findings. In many SPM VBM studies, a significant degree of spatial smoothing is used. This has the effect of increasing signal-to-noise for identifying subtle differences, as well as making the data more Gaussian for use with SPM Gaussian random field theory corrections. For this study, smoothing was unnecessary, as we had ample SNR for demonstrating activity differences. In addition, we used stringent Bonferroni corrections for whole-brain analyses, which do not rely on Gaussian random field theory."}, {"section_title": "Conclusions", "text": "We demonstrate the heretofore elusive AD hippocampal FDG-PET activity differences on whole-brain SPM voxelwise analyses to be embedded in spatial normalization Jacobian information. We introduce a PET-specific analysis framework using a PET population template, high-dimensional SyN, and Jacobian information as imaging biomarkers for whole-brain voxelwise FDG-PET analyses. The use of modulated data and Jacobian information may provide novel biomarkers of AD to diagnose and evaluate treatment effects.\nCooperative Study at the University of California, San Diego. ADNI data are disseminated by the Laboratory for Neuro Imaging at the University of California, Los Angeles. This research was also supported by NIH grants P30 AG010129 and K01 AG030514."}]