[{"section_title": "Abstract", "text": "Abstract-Rapid advancement of next-generation sequencing (NGS) technologies has facilitated the search for genetic susceptibility factors that influence disease risk in the field of human genetics. In particular whole genome sequencing (WGS) has been used to obtain the most comprehensive genetic variation of an individual and perform detailed evaluation of all genetic variation. To this end, sophisticated methods to accurately call high-quality variants and genotypes simultaneously on a cohort of individuals from raw sequence data are required. On chromosome 22 of 818 WGS data from the Alzheimer's Disease Neuroimaging Initiative (ADNI), which is the largest WGS related to a single disease, we compared two mUlti-sample variant calling methods for the detection of single nucleotide variants (SNVs) and short insertions and deletions (indels) in WGS: (1) reduce the analysis-ready reads (BAM) file to a manageable size by keeping only essential information for variant calling (\"REDUCE\") and (2) call variants individually on each sample and then perform a joint genotyping analysis of the variant files produced for all samples in a cohort (\"JOINT\" computational time and memory compared to JOINT. Our findings indicate that the multi-sample variant calling method using the JOINT process is a promising strategy for the variant detection, which should facilitate our understanding of the underlying pathogenesis of human diseases."}, {"section_title": "I. INTRODUCTION", "text": "Recent large-scale genome-wide association studies (GWAS) have identified and confirmed many susceptibility genes associated with human diseases and traits [1] [2] [3] . However, only a small portion of their heritability is accounted for by all of the known susceptibility genes leaving a substantial proportion of the heritability remaining to be identified [4] [5] . Next-generation sequencing (NGS) may enable discovery of novel genetic underpinnings that account for some of the missing heritability [6] [7] . Rapid advancement of next-generation sequencing (NGS) technologies has facilitated the search for genetic susceptibility factors that influence disease risk and become a key technique for detecting pathogenic variants in human diseases [8] [9] . Several sequencing-based association studies could identify functional risk variants with large effects on human disease pathogenesis within genes [10] . Accumulating evidence shows that common and rare risk variants are likely to co-exist at the same locus (known as pleomorphic risk loci) [11] .\nIn particular, whole-genome sequencing (WGS) has been used to obtain the most comprehensive genetic variation of an individual and perform detailed evaluation of all genetic variation [12] . To this end, sophisticated methods to accurately call high-quality variants and genotypes simultaneously on a cohort of individuals from raw sequence data are required. Therefore, numerous methods have been proposed for high throughput short read alignment and variant calling [13] . Still highly accurate variant calling is one of the most important challenges. The reduction in the cost of sequencing a human genome has led make possible to sequence many samples completely. As multi-sample variant callings can use additional information from multiple samples at a single site, multi sample variant callings are thought to have advantages compared to single-sample variant calling [14] . However, the file size is a major roadblock for data analysis scalability, and multi-sample variant callings can require considerable computing time and resources. Therefore multi-sample variant calling methods are under active development.\nHere we compared two multi-sample variant calling methods for the detection of single nucleotide variants (SNVs) and short insertions and deletions (indels) in WGS on chromosome 22 of 818 WGS data from the Alzheimer's Disease Neuroimaging Initiative (ADNI). The first type of multi-sample variant caller is to reduce the analysis-ready reads (BAM) file to a manageable size by keeping only essential information for variant calling that allows greater performance and scalability for multi-sample variant callers. The second type of multi-sample variant caller is to first call variants individually on each sample to produce a comprehensive record of genotype likelihoods and annotations for each site in the genome and then perform aj oint genotyping analysis of the variant files produced for all samples In a cohort (www. b roadinstitute.org/gatkl)."}, {"section_title": "II. MATERIALS AND METHODS", "text": ""}, {"section_title": "A. Samples", "text": "All individuals used in this report were participants of the Alzheimer's Disease Neuroimaging Initiative Phase I (ADNI-l) and/or its subsequent extension (ADNI-GO/2). The initial phase (ADNI-l) was launched in 2003 to test whether serial magnetic resonance imaging (MRI), position emission tomography (PET), other biological markers, and clinical and neuropsychological assessment could be combined to measure the progression of MCI and early AD. The ADNI-l participants were recruited from 59 sites across the U.S. and Canada and include approximately 200 cognitively normal older individuals (healthy controls (HC)) , 400 patients diagnosed with MCI, and 200 patients diagnosed with early probable AD aged 55-90 years. ADNI-l has been extended to its subsequent phases (ADNI-GO and ADNI-2) for follow-up for existing participants and additional new enrollments. Inclusion and exclusion criteria, clinical and neuroimaging protocols, and other information about ADNI have been published previously and can be found at www.adni-info.org. Demographic information, raw scan data, APOE and whole genome sequencing data, neuropsychological test scores, and diagnostic information are available from the ADNI data repository (http://www.loni.usc.edu/ADNII). Written informed consent was obtained at the time of enrollment for imaging and genetic sample collection and protocols of consent forms were approved by each participating sites' Institutional Review Board (IRB)."}, {"section_title": "B. Whole genome sequencing (WGS) analysis", "text": "WGS was performed on blood-derived genomic DNA samples obtained from 818 ADNI participants. Samples were sequenced on the IIIumina HiSeq2000 using paired-end read chemistry and read lengths of 100bp (www.illumina.com). The resulting IIIumina qseq files were converted into fastq files, a text-based format for storing both sequence reads and their corresponding quality information in Phred format. Short-read sequences were mapped to the NCB I reference human genome (build 37) using BWA, allowing for up to two mismatches in each read. During the alignment, we use only bases with Phred Quality> 15 in each read to include soft clipping of low quality bases, retain only uniquely mapped pair-end reads, and remove potential PCR duplicates. After completing initial alignment, the alignment is further refined by locally realigning any suspicious reads. The reported base calling quality scores obtained from the sequencer are re-calibrated to account for covariates of base errors such as sequencing technology and machine cycle. Finally, the realigned reads are written to a BAM file for further analysis (see Figure 1 ). Variant Discovery: The analysis-ready BAM files are analyzed to identify all variants with statistical evidence for an alternate allele present among samples using the HaplotypeCaller module of GA TK for multi-sample variant callings. The first type of multi sample variant caller is to reduce the analysis-ready reads (BAM) file to a manageable size by keeping only essential information for variant calling that allows greater performance and scalability for multi-sample variant callers (\"REDUCE\"). The second type of multi-sample variant caller is to first call variants individually on each sample to produce a comprehensive record of genotype likelihoods and annotations for each site in the genome and then perform a joint genotyping analysis of the variant files produced for all samples in a cohort (\"JOINT\"). The HaplotypeCaller module of GATK calls SNVs and indels simultaneously via local de-novo assembly of haplotypes in an active region. The quality of the variant calls was assessed by comparing sequencing-derived SNVs with those obtained from the IIIumina Omni 2.5M genotyping array in order to estimate the concordance rate. Among 818 subjects, two subjects had concordance rates less than 99% and had been removed from our analysis. We used a same pre-calling procedure and two different multi-sample variant calling methods to identity SNVs and indels from 818 ADNI WGS data. First we compared the numbers of SNVs and indels across two multi-sample variant callers. Figure 2 and Table 1 JOINT increased the proportion of called variants, i.e., identified 43% and 14% more SNVs and indels compared to REDUCE. 98.1% (351,648 SNVs) and 9l.0% (48,101 indels) of the REDUCE SNV and indel calls, respectively, are also present in the JOINT set. The concordance ratios of the common SNVs and indels from two caller methods are 99.60% and 99.06%, respectively. The observed transition-to transversion ratios for the SNV sets on chromosome 22 for JOINT and REDUCE are 2.39 and 2.36, respectively. In order to assess the quality of the variant calls, we compared sequencing-derived SNVs with those obtained from the Illumina Omni 2.5M genotyping array and overall genotype consistency rates are 99.7% for the JOINT SNV set and 99.5% for the REDUCE SNV set."}, {"section_title": "IV. DISCUSSION", "text": "Our understanding of the association of the genetic variation with human disease has been greatly advanced using high-throughput NGS technologies. NGS has become a powerful tool for explaining the missing heritability of human diseases through rare and de novo variants. One of the most important challenges in NGS analysis is to accurately call high-quality variants (SNVs and indels) and genotypes simultaneously on a cohort of individuals from raw sequence **Data used in preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (adni.1oni.usc.edu). As such, the investigators within the ADNI contributed to the design and implementation of ADNI and/or provided data but did not participate in analysis or writing of this report. A complete listing of ADNI investigators can be found at: http://adni.loni.usc.edu/wpcontent/uploads/how _to _ apply/ ADN 1_ Acknowledgement_List. pdf 2014 The 8th International Conference on Systems Biology (lSB) 978-1-4799-7294-4114/$31.00 ©2014 IEEE"}, {"section_title": "61", "text": ""}, {"section_title": "Variant calling", "text": "Preliminary analysis data and is still under an active research topic. Multi-sample variant callings have been shown to have more advantages than the corresponding single-sample variant callings. However, under current computing resources, it is not possible to call multi-sample variants using all mapped reads simultaneously from 818 WGS.\nHere we compared two multi-sample variant calling methods for SNV s and indels on chromosome 22 of 818 WGS data from ADNI, which is the largest WGS related to a single disease.\nThe JOINT method identified much more SNVs and indels, and required considerably less computation time and resources. The JOINT method identified 43% more SNVs, although the JOINT method identified 14% more indels. In particular, 98.1 % and 9l.0% of SNV s and indels identified by the REDUCE method were also called by the JOINT method with more than 99% concordance. Both methods showed very high concordance with both each other and the lIIumina Omni 2.5M genotyping array. The concordance analysis indicated that the JOINT method performed considerably better than the REDUCE method.\nIn conclusion, our data indicate that the multi-sample variant calling method to first call variants individually on each sample in order to produce a comprehensive record of genotype likelihoods and annotations for each site in the genome and then perform a joint genotyping analysis of the variant files produced for all samples in a cohort is a promising strategy for the variant detection. As the development of multi sample variant calling methods is a rapidly evolving target, these methods will require frequent re-evaluation for further improvement. "}]