[{"section_title": "Introduction", "text": "Quantitative conjectures about spread of epidemics or pandemics based on mathematical modeling using simulations and data analysis techniques is critical information for policy makers as well as ordinary citizens susceptible to these viral infections. Even as the pandemic batters the whole world, India is facing unique challenges. India imposed country-wide lock down on 24 th March 2020 which continued up to 17 th May 2020. On 17 May 2020 lockdown was further extended up to 31 st May 2020 with different rules for three different district zonesgreen, red, and orangecreated based on spread of pandemic. The lockdown in India during 25 March to 31 May 2020 has been acknowledged as one of the most stringent in the world (Hale et al., 2020) . Researchers have also recognized the fact that but for the lockdown, the number of infected individuals in India would have been much larger. A study done by The Center for Disease Dynamics, Economics & Policy (CEDEP), John Hopkins, and Princeton suggests that the very first phase of 21-day nationwide lockdown up to 14 April 2020 must have significantly slowed down the spread of COVID-19 as compared to a lack of intervention (Schuller et al., 2020) . 1 st of June 2020 onwards, the Government of India issued the notification for \"Unlock 1\" with emphasis on restarting economic activities and easing of restrictions in all areas except the containment zones. The Unlock 1 phase has started even as the cumulative number of confirmed COVID-19 cases and per day increase in confirmed cases in India (Figure 1 ) is still showing an upward trend. As on 20 th June 2020 the number of confirmed cases in India stood at 4,11,727 (Worldometers, 2020, June 21) with the per day increase in number of cases reaching 14,516 (WHO, 2020, June 21).\nThe five Indian states analyzed in this study also show an increasing trend in number of confirmed cases. As a result, India is caught in a catch-22 situation having to choose between the devil and the deep sea. It has come down to an argument between life and livelihood."}, {"section_title": "Figure 1. Trend of Cumulative Cases -India and States", "text": "While the number of confirmed cases is still registering an exponential growth, the lockdown is being eased to restart economic activities. In such a scenario, the study explores the longevity of COVID-19 in India and five of its states using confirmed cases data and based on a robust theoretical frameworkthe susceptible, infected, recovered, and dead (SIRD) compartmental model. Our analysis is of utility to policy makers, public health authorities, and industry leaders to prepare themselves better in the coming months in terms of healthcare resources and restarting of economic activities. It also enlightens the common citizens regarding COVID-19 timelines so that they are mentally prepared for a self-protective lifestyle. The study, thus, fulfills two objectives. First, we predict the COVID-19 longevity timelines for India using confirmed "}, {"section_title": "COVID-19", "text": "Cases Timeline"}, {"section_title": "Maharashtra", "text": "Tamil Nadu Delhi Gujarat Rajasthan cases time series data during 01 April to 20 June 2020 based on SIRD model. Second, we also derive the COVID-19 longevity pattern for five most infected states which cumulatively contribute approximately 70% cases to the India tally. These states are Maharashtra, Tamil Nadu, Delhi, Gujarat, and Rajasthan. In the process, we predict the following attributes related to the COVID-19 lifespan pattern of India and its states: (1) the peak-date;\n(2) the peak number of infections; and,\n(3) the end-date.\nTo the best of our knowledge, no study so far has endeavored to fulfill these objectives so comprehensively. Even though Behl and Mishra (2020) have attempted to predict lifecycle patterns of COVID-19, our study is different from theirs on following four counts. First, our study's theoretical foundation is based on SIRD model whereas their study is based on susceptible, infected, removed (SIR) model. Second, we derive the predictions based on confirmed case data of more than two months (01 April to 20 June 2020) whereas they used the data of only one month (01 to 30 April 2020). Moreover, it was at a time when the trend was just about beginning to exhibit an upward trend. Third, our study predicts COVID-19 lifecycle pattern of India as a whole, along with five of its most affected states whereas their study carried out prediction for ten most infected states only. Fourth, unlike their study, we derive the critical parameter of basic reproduction number R0 for India and each state separately using the exponential growth method proposed by Wallinga and Lipsitch (2007) . Even as we make a quantitative conjecture in this article regarding the lifecycle of COVID-19, we must concede that we are not epidemiologists. We are data scientists reporting what the data is telling us. Therefore, the results should be interpreted and used with caution. The remaining part of the article comprises of following sections: Section 2 discusses the conceptual framework; Section 3 describes the research method; Section 4 presents outputs of the study, and finally; Section 5 delves upon on implications."}, {"section_title": "Conceptual Framework", "text": "Extant literature in Epidemiology has used various compartmental models to analyze the spread of infectious diseases (Hethcote, 2000) . The most prominent and widely used among them being SIR model proposed by Kermack and McKendrick (1927) . However, SIR model is criticized as being too simplistic (Bhattacharya et al., 2015) and is limited by the assumption that the pandemic is non-fatal (Miller, 2020) . With the fatalities due to COVID-19 going up, it would not be suitable to assume zero fatalities. Therefore, this study draws its theoretical moorings from the seminal SIRD model of epidemiology for predictive modeling of COVID-19 in India. The SIRD model has been extensively used in extant literature to model spread of epidemics, in general, and COVID-19, in particular (e.g., Caccavo, 2020; Chatterjee et al., 2020; Fernández-Villaverde and Jones, 2020) . The SIRD model classifies individuals into four mutually exclusive compartments:\nsusceptible (S), infected (I), recovered (R), and dead (D). The SIRD model considers recovered and deceased as separate compartments and, therefore, must consider the case-fatality rate. The transition from susceptible to infected, and from infected to either recovered or dead is captured through a series of differential equations.\nWherein, s = S/N, i = I/N, r = R/N, and d = D/N. Here, β is the effective contact rate which captures the proportion of susceptible population in contact that an infected individual further infects per unit time (Hill, 2016) . ύ, the removal rate, is the inverse of the expected duration of infection (Jones, 2007) . And σ is the case-fatality rate i.e. the number of infected patients who die per unit of time (Miller, 2020) . The other acronyms used in the equations are N, the population; S, the number of susceptible individuals at time t; I, the number of infected individuals at time t; R, the number of individuals who have recovered from infection at time t; and, D is the number of deceased individuals at time t. The unit of time considered is day and therefore, all calculations have been done on per day basis. Additionally, the population N need not necessarily be same as the population of the state (Batista, 2020) . If we consider all members of this population equally likely to be infected, N can be considered as equal to the total susceptible population at the beginning of time. This study is based on reported confirmed cases of COVID-19 (C). Therefore, as C increases, the population of susceptible individuals S out of the total population N keeps decreasing and moving away from N. The data on number of confirmed cases C includes infected, recovered, as well as deceased individuals. The application of SIRD model is based on two important assumptions: (1) the model is recursive and therefore, there is no possibility of a recovered individual getting infected again; and, (2) the population is constant during the period of study which means the birth rate and death rate, including deaths due to COVID-19, are equal (Miller, 2020) . The laws of motion with respect to COVID-19 are as depicted in Figure 2 . "}, {"section_title": "Data", "text": "We have taken into consideration COVID-19 confirmed cases data for the duration 01 April to 20 June 2020. The time series data reports per-day wise change in the number of cases. The data pertains to India and five of its most infected states which together contribute approximately 70%\nof the cases as on 20 June 2020 -Maharashtra, Tamil Nadu, Delhi, Gujarat, and Rajasthan. The state-wise time-series data was downloaded from Kaggle (Rajkumar, 2020) whereas the timeseries data pertaining to India was downloaded from Our World in Data (Roser et al., 2020) . Both sources are publicly accessible data platforms. Even though the first case in India was reported on 31 January 2020, the data prior to 1 st April 2020 was not utilized to avoid getting trapped by the noise in the data."}, {"section_title": "Methodology", "text": "The critical parameters used for predictive modeling are determined as per established procedures (Batista, 2020; Behl and Mishra, 2020) ."}, {"section_title": "Susceptible Population (S)", "text": "The total population, denoted by N, is also equal to the population of individuals susceptible (S) to infection at the beginning of the time period. The value of susceptible population is estimated using the method proposed by Chatterjee et al. (2020) . (Table I) . "}, {"section_title": "Basic Reproduction Number (R0)", "text": "An important epidemiological parameter in modeling of infectious diseases is the basic reproduction number denoted by R0 (Bettencourt and Ribeiro, 2008) . The basic reproduction number for a pandemic in each region is determined based on the \"expected number of secondary cases produced by a single (typical) infection in a completely susceptible population\" (Jones, 2007, p. 1). Liu et al. (2020) argue that an R0 value greater than one suggests rapid transmission of the infectious disease whereas if the value of R0 is less than one, it indicates a decreasing transmission.\nFor COVID-19, the World Health Organization (WHO) suggests an R0 ranging between 1.4 to 2.5 (Liu et al. 2020) . Some of the other estimated range of values of R0 for different countries are: 2.6 to 3.2 for South Korea and 2.6 to 3.3 for Italy (Zhuang et al., 2020) ; and, 2.24 to 3.58 for China (Zhao et al., 2020) . Liu et al. (2020) (Obadia et al., 2012) to estimate the value of R0 for India and five of its states. The parameter case generation time, which is required for calculation of R0, is estimated from the mean serial interval value. The serial interval is the time gap between onset of illness in a primary and secondary case.\nFor COVID-19, Bi et al. (2020) estimate the mean serial interval value to be 6.3 days with a standard deviation of 4.2 days."}, {"section_title": "The recovery rate (ύ)", "text": "Even as research on recovery period from COVID-19 is still in its infancy, most experts agree on a 2 to 6-week period. World Health Organization (WHO) suggests that 80-85% of COVID-19\npatients recover in about 2-weeks. This contention to a large extent is also supported by academic research (Toda, 2020) . For India, Chatterjee et al. (2020) suggest a recovery period of 12 days.\nBased on the preceding discussion, we have considered a recovery period of 12 days."}, {"section_title": "The effective contact rate (β)", "text": "The effective contact rate, denoted by β, influences the spread of the epidemic. It is defined as per capita \"average number of effective contacts with other individual hosts per unit time\" (Li et al., 1999, p. 192 ). Among the three parameters of the SIRD model, this is the only parameter that is controllable and therefore, can check the spread of epidemic (Toda, 2020) . The effective contact rate of an epidemic in a population is determined by two factorsthe average rate of contact between infected and susceptible individuals i.e. the total number of contacts per unit time, and the transmissibility of the epidemic (Jones, 2007) . The effective contact rate, rate of recovery, and basic reproduction number of an epidemic are related to each other by the following equation, as suggested in extant research (Bhattacharya et al., 2015; Jones, 2007) . This equation was used to calculate the values of effective contact rate β for India and the five states modeled in this study."}, {"section_title": "The case-fatality rate (σ)", "text": "The case-fatality rate σ reflects the number of infected patients who die per unit time i.e. each day.\nIt is related to recovery rate ύ and fraction of infected individuals who die R1 in the following equation (Miller, 2020) . The value of σ varies across the states considered and is different from the national value.\n(σ = R1*ύ/100)"}, {"section_title": "Results", "text": "The implementation of SIRD model depends on the parameters effective contact rate (β), rate of recovery (ύ), and the case-fatality rate (σ). The effective contact rate, in turn, depends upon the basic reproduction number (R0) of the epidemic (Jones, 2007) . We estimated the values of basic reproduction number R0 by applying exponential growth method (Wallinga and Lipsitch, 2007) (Liu et al., 2020) .\nThe recovery rate (ύ) of COVID-19 infected individuals is determined by the average recovery period. The recovery rate is considered as inversely proportional to the recovery period in days (Hill, 2016; Toda, 2020) . Since the recovery period of COVID-19 is 12 days (Chatterjee, 2020) , a uniform recovery rate of ύ = 1/12 = 0.08 is considered for India as well as all five of its states. The value of recovery rate is expected to be constant irrespective of the geographical region.\nThe recovery rate obtained is used to calculate the values of effective contact rate β using equation\n(1) and the case-fatality rate σ using equation (2). The values of susceptible population (S), basic reproduction number (R0), recovery rate (ύ), effective contact rate (β), proportion of deaths among infected individuals (R1), and case-fatality rate (σ) for India and the five states investigated are provided in Table II . (Rajkumar, 2020) and https://www.worldometers.info/coronavirus/. #Calculated from the population, as per the process given in Table I and therefore, no confidence intervals are provided. (Hunter, 2007) . The predictive modeling plots (Figure 3 ) provide insights pertaining to: (1) the peak-date and peak cumulative number of infected individuals in the susceptible population; and, (2) the end-date of pandemic in India and five of its states. The information in the plots pertaining to peak date, number of cumulative infections as on peak date and the end date have been tabulated (Table III) for better understanding. "}, {"section_title": "Discussion and conclusion", "text": "Quantitative conjectures based on mathematical modeling play an important role in understanding an epidemic. Drawing upon SIRD model, this study endeavors to do predictive modeling of COVID-19 epidemic in India and five of its states: Maharashtra, Tamil Nadu, Delhi, Gujarat, and\nRajasthan. These are the five most infected states and account for approximately 70% of all COVID-19 confirmed cases in India as on 20 th June 2020 as per data obtained from Kaggle (Rajkumar, 2020) . It is a scientifically robust study wherein all parameters have been estimated objectively rather than relying excessively on assumptions. We have used established tools and techniques to arrive at our estimates. Population susceptible (S) to COVID-19 has been determined by averaging the lower-bound and upper-bound estimates as proposed by Chatterjee et al. (2020) .\nThe basic reproduction number (R0) has been calculated using RStudio 1.3.959 (RStudio Inc., Boston, MA) package R0 1.2-6 (Obadia et al., 2012) through the exponential growth method (Wallinga and Lipsitch, 2007) . The recovery rate (ύ) has been calculated from the recovery period of COVID-19 available in extant literature (Chatterjee et al., 2020) . The effective contact rate (β) and case-fatality rate (σ) have been obtained by using equations (1) and (2), respectively. Finally, the ordinary differential equations defining SIRD model are run on Python 3.7.4 (Van Rossum and Drake, 2009) using the Jupyter Notebook (Kluyver et al., 2016) platform and the plots (Figure 3) are obtained using Python Matplotlib 3.2.1 (Hunter, 2007) package.\nThe projections from this study throw up two interesting insights for policy makers, industry leaders, and healthcare experts. The basic reproduction number R0 for India was found to (Banik et al., 2020) . Even as R0 is still much larger than the value of 1 required for the epidemic to show signs of stagnation (Liu et al., 2020) , yet it is an encouraging sign given the large population and high population density of India.\nAnother interesting finding of the study is pertaining to the lower case-fatality rate σ of India. The value of σ is determined using equation (2) and is based on R1, the fraction of infected individuals who died. For India, R1 is 3.22% as on 20 th June 2020. Whereas, Onder, Rezza, and Brusferro (2020) suggest that the rate was 7.2% for Italy as on 17 March 2020, the fraction has increased to 14.5% as on 20 June 2020 (Worldometer, 2020) . Similarly, for USA and Brazil, two of the most affected countries, the value of R1 as on 20 th June 2020 stands at 5.3% and 4.7%, respectively (Worldometer, 2020) . India faces some unique demographic challenges in terms of a very large population, high population density, and scarcity of healthcare resources. In view of these challenges, it is very difficult on India's part to drastically contain the spread of COVID-19.\nMore so when almost 80% of COVID-19 infected individuals in India are asymptomatic and may never have been known but for contact tracing (Times of India, 2020, May 28). Therefore, India should primarily invest its limited healthcare resources to limit R1, the fraction of infected individuals who die.\nThe overall picture of COVID-19 pandemic presented by this study is that of an epidemic which may continue to impact us all the way up to the first quarter of 2021. As WHO has rightly pointed out, the worst of COVID-19 is yet to come since the pandemic is now in acceleration mode. Our study also reflects this observation (Figures 1 and 3) . The pandemic is likely to reach its peak during October 2020 and may start showing signs of decline only in January 2021 in most parts of India (Table III) . While the findings are critical, the study has two limitations which should not be overlooked. First, there is possibility of potential bias since different states have different testing capacities and reporting jurisdictions which cannot be accounted for in the model. Second, the model assumes that future would be a mirror image of the past. As data scientists we have extrapolated the past with a robust theoretical framework. Given the novelty of the virus, we do not know how some of the important epidemiological parameters like incubation period, mean serial interval, generation time would pan out in future. The study stands out as the only study which has projected COVID-19 confirmed cases for India with data as recent as 20 th June 2020. It would help the policy makers, public health authorities, and industry leaders to prepare themselves better in the coming months in terms of leveraging healthcare and economic resources."}]