[{"section_title": "INTRODUCTION", "text": "Wetlands are widely considered to be one of the most biologically productive ecosystems of the biosphere (Gibbs, 2000;Turner, 1997;Twilley, 2007;Zedler and Kercher, 2005). Not only do wetland ecosystems provide habitats for an abundance of diverse species, including fish, aquatic invertebrates, waterfowl, and various aquatic and terrestrial plant species, but they also affect water quality, nutrient content, and flood prevention. Secondary consequences of wetland habitat loss include eutrophication, hypoxia, bioaccumulation of pollutants and toxins, and increased frequency of harmful algal blooms (Stegeman and Solow, 2002). The economic contribution of these wetland resources has a significant impact on coastal communities (Mitsch and Gosselink, 2000). The U.S. EPA defines wetlands as areas \"where saturation with water is the dominant factor determining the nature of soil development and the types of plant and animal communities living in the soil and on its surface.\" Wetland habitat once covered an estimated 221 million acres of the lower 48 states of the U.S. Since the late eighteenth century, however, over 50% of that total area has been lost (Dahl, 1990). In the last 30 years, action has been taken to begin restoration and protection of wetlands in the United States by state and federal agencies (NOAA, 2003). These restoration efforts have managed to achieve a small net gain per year of wetland habitat area nationally, but coastal areas are continuing to experience yearly net losses, and the ecological and economic consequences are noticeably impacting coastal communities (Dahl, 2006). Land cover/land use (LCLU) change has most commonly been considered the dominant cause of wetland habitat loss (Ehrenfeld, 2000;Turner, 1997;Zedler and Kercher, 2005). Drainage for agricultural purposes, dredging for canals causing hydrological changes, exploitation of resources, and general urban development and population growth are all major causes of LCLU change and wetland area loss (Turner, 1997). More recently, research has begun to attribute climate change with coastal habitat losses, specifically sea level rise and precipitation and temperature trends (Baldwin and Mendelssohn, 1998;Scavia et al., 2002;Turner, 1997;Twilley, 1997). Climate change is considered a cause for general habitat destruction, as well as shifts in species composition and habitat degradation within existing wetland areas (Baldwin and Mendelssohn, 1998). Conversely, it has been suggested that wetland decline can lead to changes in climate patterns (Marshall et al., 2003). The Gulf of Mexico coastal area comprises around 41% of the total remaining area of wetland habitat in the U.S. Changes in wetland habitat in the Gulf coastal region impact the quality of the Gulf itself, for example, through nutrient loading. The estuaries of the Gulf coast region receive a large contribution from the Mississippi River, which contains agricultural runoff from the Midwestern Corn Belt (Bricker et al., 1999). Wetlands have historically degraded and metabolized much of this waste and runoff before it reaches the Gulf. As wetlands continue to degrade, however, both sediment and nutrients freely enter into rivers and estuaries. Higher levels of nitrogen and other inorganic nutrients lead to eutrophication and could eventually result in bioaccumulation of these pollutants at toxic levels in aquatic food webs, potentially damaging biodiversity and endangering wildlife. Higher nutrient content also contributes to a phenomenon known as \"red tide,\" or harmful algal blooms (HABs). HABs are large patches of toxic or harmful algae that are visible to the human eye. The development of HABs in the oceans is not recent; Spanish explorers observed the \"red tide\" off the coast of Florida in the 1500s. However, the incidence of these toxic blooms is on the rise (NOAA Fisheries, 2007). Not only are HABs toxic to aquatic species, but they can also have deadly effects on humans and deprive other organisms of oxygen. Because the Gulf of Mexico region contributes 80% of total wetland habitat loss in the U.S., more aggressive habitat restoration initiatives have been established in prominent bay areas around the Gulf (Turner, 1997). The wetlands associated with Galveston Bay, Mobile Bay, and Tampa Bay have suffered significant losses since the eighteenth century, and as coastal populations continue to expand, restoration in these areas is proving to be challenging (NOAA, 2003). Because the study sites are geographically separate from one another, different factors contributing to species loss and composition change can be compared between them. We assessed the changes in wetland habitat area in those three sites, and the impact of that change. The objectives of this study are: 1) assessment of the extent of recent wetland area loss and changes in species composition in the Mobile Bay, Galveston Bay, and Tampa Bay watersheds; 2) analysis of the potential causes of this loss in the watersheds; and 3) examination of the potential ecological impact of this loss, as well as potential socioeconomic effects."}, {"section_title": "METHODOLOGY Objective One: Analysis of the Extent of Recent Wetland Habitat Loss in Three Study Sites Along the Gulf Coast", "text": "In order to evaluate the extent of wetland habitat loss, a geographic information system (GIS) was used to manipulate remote sensing data sets from NOAA's Coastal Change Analysis Program (C-CAP) and the USGS Gulf of Mexico Integrated Science database to compare the change in area (acres) and shift in species composition of wetland habitat in the study areas of Galveston Bay, Mobile Bay, and Tampa Bay over three time points: the 1950s, 1996, and 2001. NOAA C-CAP land cover analysis data was used to compare the three watershed sites at the 1996 and 2001 time points. Comparison of total area change of each wetland site was completed using overall change in acres of habitat from existing literature and change in LCLU determined through mapping over the three time points. Using a common classification system based on a simplified version of the C-CAP system allowed for a comparison of wetland species composition between the three study areas as well as within the individual wetland habitats. C-CAP data are not available before 1996 for these areas; therefore, the historical 1950s maps show a basic wetland area and LCLU. Historical data were obtained from the USGS National Wetlands Research Center (NWI). It was converted to digital data using the Wetland Analytical Mapping System (WAMS) from NWI maps at a 1:24,000 scale. The classification system of the historical maps was based on the wetland habitat scheme described by Cowardin and Golet (1995). Because the two mapping data sets came from different sources, the habitat types did not directly coincide; therefore, a classification scheme was developed to allow direct comparison of historical and C-CAP mapping data. Wetlands were divided into two broad classes: palustrine, or freshwater, and estuarine, or salt water. All freshwater wetland classes, including palustrine, lacustrine, and riverine were classified as palustrine, and both estuarine and marine classes were defined as estuarine. Rock bottom and unconsolidated bottom were included in the open water class in the reclassified historical data sets. Both classes most closely resemble open water, as they have little to no vegetation and standing water. Developed areas were consolidated into one broad category, and upland areas, which are those with no standing water present and are located above sea level, were divided into four broad categories in order to merge the two data sets into a logical common classification (Table 1). In order to calculate the extent of wetland losses, the area of each consolidated class was measured using ArcView 9.2. For each region, the spatial extent of the historical map was used as the zone within which the LCLU class area was calculated. Percent losses were calculated and analysis performed to compare losses between the three watersheds."}, {"section_title": "Objective Two: Analysis of Potential Causes of Wetland Habitat Loss in the Three Watersheds LCLU Change", "text": "Change in LCLU was evaluated using the same remote sensing data sets used to show overall change in wetland habitat area. Each watershed area was defined as the counties that have the most direct influence on the wetland habitat. For Galveston Bay, the counties defined by the Houston-Galveston Area Council as the \"lower Galveston Bay watershed\" represent the Galveston Bay area in this study. Mobile Bay was defined as the two counties that are contiguous to the bay itself, with the same being true for Tampa Bay (Table 2). Population growth trends in each of the defined watershed areas were analyzed using census data obtained from Social Science Data Analysis Network (SSDAN) for 1960 through 2007."}, {"section_title": "Climate Change", "text": "The effects of climate change on wetland habitat loss and change in species composition were addressed using three climatic categories: sea level rise, precipitation, and air temperature. Galveston Bay precipitation and temperature data were measured at a U.S. Historical Climatology Network station in Liberty, TX. Mobile Bay data were measured at Fairhope, AL, and Tampa Bay measurements were taken at a station in Tarpon Springs, FL (Williams et al., 2007). General trends in sea level rise were determined through data collected from NOAA's Center for Operational Oceanographic Products and Services. In order to analyze the impact of sea level rise on wetland habitat change in each of the three watersheds, linear regression and correlation were calculated. Precipitation and temperature data were obtained from NOAA's National Climatic Data Center and the U.S. Historical Climatology Network. Trends in yearly mean minimum, mean maximum, and average temperatures, as well as mean precipitation for each watershed area were established. Data were sorted temporally by decade and decadal averages for each class (mean minimum temperature, mean maximum temperature, mean average temperature, and mean precipitation totals) and used for analysis. Objective Three: Evaluation of Potential Ecological, Socioeconomic, and Public Health Impacts Ecological Impact Two major ecological areas of impact from wetland habitat loss were addressed: fishery depletion and water quality. Changes in fishery levels were established using state-by-state harvest levels for 1950 through 2007, as reported by NOAA. Changes in water quality were established using dissolved oxygen levels for the Gulf of Mexico from the United States Geological Service (USGS) for 1986 through 2000. Seasonal variance was taken into consideration, as dissolved O 2 levels vary depending on time of year. Nitrogen content in the Gulf of Mexico was evaluated qualitatively using existing literature.\nThe 2007 Intergovernmental Panel on Climate Change (IPCC) report describes an increasing trend in average temperatures globally at an accelerating rate since the 1950s. The IPCC (2007) predicts a global temperature rise anywhere from 1.1 to 6.4 °C in the next one hundred years. While mean temperatures and precipitation for the three watersheds addressed in A C this study have not changed drastically over the few decades, that does not indicate that future conditions will remain unchanged (Table 4). Galveston is the only watershed of the three that has experienced a relatively large change in average yearly precipitation, increasing from 46.9 inches per year in the 1950s to 70.9 inches per year in the 2000s (Table 4). Sea level rise trends demonstrate a more drastic change in the Gulf region than either temperature or precipitation patterns (Table 4; Table 5). The three watersheds in this study experienced a general trend in the last century higher than the global mean of 1-2 mm per year as reported by the IPCC. Galveston Bay has demonstrated an especially high rate of sea level rise in the last century (Table 4). Coastal wetlands have proven to be susceptible to climate change, with a net loss of 33,230 acres from 1998 to 2004 in the United States (Dahl, 2006). This loss was mainly due to conversion of coastal salt marsh to open salt water. Salt marshes are a wetland habitat common to all regions of the Gulf coast. Sea level rise can cause drowning of salt marsh habitats, as well as reduced germination periods (Noe and Zedler, 2001). The Gulf of Mexico region has experienced a large net loss of salt marsh (GBEP, 2002;Stout et al., 1998;TBEP, 2000). Figure  6 shows linear regression and correlation analysis of the relationship between salt marsh habitat loss and sea level rise and reveals a strong positive correlation between the two events. Because data for Mobile were only available from 1966, the average yearly sea level rise for Mobile is calculated over 14 years (1966)(1967)(1968)(1969)(1970)(1971)(1972)(1973)(1974)(1975)(1976)(1977)(1978)(1979)(1980), while Galveston and Tampa Bay both have averages calculated over 30 years . Sea level rise can also have an impact on other coastal wetland habitat types, such as freshwater marshes and mangrove forests. In Florida, mangroves have been migrating inland and replacing salt marsh in response to rising sea levels and increased wetland salinity (McFadden et al., 2007). Rising sea levels and temperatures may also contribute to another coastal wetland disturbance: hurricane intensity. The IPCC 2007 Synthesis Report predicts an increase in hurricane intensity in tropical areas. Hurricanes can cause extensive wetland habitat damage. In 2005, Hurricane Katrina destroyed over 95,000 acres of wetland habitat in Louisiana (McFadden et al., 2007). Such severe disturbances are major obstacles for restoration efforts, which can be erased by a single storm."}, {"section_title": "Socioeconomic and Public Health Effects", "text": "The economic impact of fishery depletion was determined through data provided by NOAA about statewide fishery landing profit for 1950-2007. General trends were established for each of the three states (Alabama, Texas, and Florida). Categorization of location and species of harmful algal blooms (HABs) in the study area were used to qualitatively analyze potential public health threats due to HABs."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Extent of Wetland Habitat Loss", "text": "There has been extensive loss of estuarine aquatic bed along coastal areas of the Galveston watershed since 1956 ( Figure 1; Table 3). Differences in LCLU between 1996 and 2001 include losses of palustrine scrub/shrub, agricultural, and bare land (Figure 1b-c). Increases in habitat from 1956 to 2001 are meaningless, because they are due to reclassification of the 1956 data from Unclassified to another habitat type, not an actual growth in habitat area ( Figure  1; Table 3). Because this skews any results gained from this data set, any growth was treated as no change in order to make the comparison between sites as accurate as possible ( Figure 4). The C-CAP data sets do not depict the damage to wetland habitat done by Hurricane Ike in 2008. Updates depicting changes in wetland habitat area will be necessary after a survey of total damage to the area has been completed. The Mobile Bay data set reflects an 11% overall decrease in wetland habitat from 1955 to 2001. From 1996 to 2001 a less than 1% decline in wetland habitat in the Mobile Bay watershed is evident, meaning the rate of degradation has decreased over time. Despite this trend, there have still been losses due to conversion of both emergent and scrub/shrub habitat to aquatic bed and open water since the 1950s, as well as palustrine emergent losses to developed land ( Figure  2). Between 1996 and 2001, the most noticeable changes have been the conversion of wetland scrub/shrub to upland scrub/shrub and slight gains in unconsolidated shorelines in the delta area of the bay, as well as a 67% decline in palustrine aquatic bed (Figure 2b-c; Table 3). From 1955 to 2001, Mobile Bay lost more palustrine and estuarine emergent habitat than Tampa, but reversed this trend from 1996 to 2001 ( Figure 4). Since the 1950s, the Tampa Bay area has experienced close to 90% losses of both estuarine scrub/shrub and aquatic bed habitat, as well as a substantial growth of mangrove, or estuarine forested habitat (Table 3). Mangroves have recently begun spreading northward and replacing emergent and scrub/shrub wetland habitat ( Figure 3b). Urban developed area has grown significantly since the 1950s, resulting in a loss of both wetland and upland habitat (Table  3). There has also been conversion of small areas of estuarine emergent and upland habitat to palustrine scrub/shrub (Figure 3a-b). Estuarine aquatic beds have suffered large losses since the 1950s, despite restoration efforts of several organizations. Those efforts have been successful in the reestablishment of some estuarine emergent habitat, restoring 2,350 acres from 1996 to 2003 (Figure 3a-c;TBEP, 2000). Only Mobile Bay experienced a net loss of wetland habitat (11%) from the 1950s to 1996. Tampa Bay had gains of 36% overall. However, there were still losses to individual wetland classes in each of the three watersheds ( Figure 4a). All three areas exhibited similar losses in estuarine emergent habitat and gains in palustrine forested habitat ( Figure 4a). The unification of the two separate classification schemes allowed for a direct comparison between the two different data sets in order to establish change over time in wetland habitat area and LCLU. While this resulted in a more accurate analysis of change, it caused a loss of detail, most notably in the C-CAP maps. This did not affect the accuracy of the results, but it should be noted that the maps, particularly those derived from C-CAP data, do not depict the complete land cover details of each of the study areas."}, {"section_title": "Potential Causes of Wetland Habitat Loss", "text": "LCLU Change Current literature generally acknowledges LCLU change as a key contributor to wetland habitat loss (Dahl, 1990;Dahl, 2006;Ehrenfeld, 2000;Turner, 1997). Coastal areas are generally densely populated and industrialized due to proximity to water resources (Crossett et al., 2004). Continued population growth is one of the chief reasons for LCLU change along the Gulf coast, a trend that commonly results in wetland habitat loss. The Tampa Bay area has experienced the most high density urban development since the 1950s, drastically reducing emergent and aquatic bed wetland habitats (Figure 3). Experiencing an almost 200% population growth since 1960, the Tampa Bay watershed area (Table 2) population is expected to grow by another 19% by 2015, posing a threat to shoreline and wetland habitat as urban development expands with the population ( Figure 5). As one of the top ten most active trade ports in the country, industrial and commercial expansion has also contributed heavily to wetland habitat degradation in Tampa Bay (TBEP, 2000). The Tampa Bay area experienced nearly 8% urban growth between 1996 and 2001, compared to only 3.9% growth in the Galveston area ( Figure 4). The lower Galveston Bay watershed is home to two major cites, Galveston and Houston. Population has increased over 200% in the area since 1960, resulting in urban expansion and contributing to the 19% loss of wetland habitat since the 1950s ( Figure 5; Figure 2). Compared to the other two watershed areas, Mobile Bay has experienced a relatively lower population increase of 58% since 1960 ( Figure 4). This suggests that other factors may contribute more dramatically to wetland habitat losses in Alabama than in the other two areas."}, {"section_title": "Potential Impact of Wetland Habitat Loss Ecological Impact", "text": "Researchers can detect HAB outbreaks in the Gulf using satellite imagery to track photosynthetic activity. Figure 7 depicts an example of chlorophyll measurements in the Gulf of Mexico, indicating active areas of phytoplankton in June 2008. The darker red areas depict the highest concentration of chlorophyll, indicating high levels of photosynthetic activity and potentially an HAB outbreak. When the millions phytoplankton that make up an HAB die, benthic decomposers consume an excess of oxygen in order to break down the large amount of dead algae, leading to dissolved oxygen depletion. Hypoxia in the Gulf of Mexico has become a major issue. Figure 8 shows an example of this Dead Zone, depicting dissolved oxygen levels from June 11, 2008 to July 16, 2008. Temporal variance is observable in dissolved oxygen and extent of hypoxic conditions in the Gulf, mainly due to an influx of nutrients during the spring and summer months when agriculture is at its peak. Each summer, a hypoxic \"Dead Zone\" forms along the northern Gulf Coast, where dissolved oxygen levels are close to zero and very few aquatic species can survive (Rabalais et al., 2002)."}, {"section_title": "Socioeconomic Impacts", "text": "Beginning around 1960, a slump in fishery catch occurred in the Gulf of Mexico ( Figure  9i). While Alabama's fishery catch has remained steady since the 1950s, Texas and Florida have both experienced a decline. The decline in fishery profits did not occur until 2000, when they decreased in Alabama, Texas, and Florida (Figure 9ii). In recent years, the impact of HABs on fisheries has averaged 18 million dollars annually. HABs cause fish kills and render shellfish toxic to humans, resulting in commercial losses along the coast (Anderson et al., 2000). Hypoxia resulting from HAB outbreaks can also impact fisheries in the Gulf. When dissolved oxygen reaches hypoxic levels (<2mg/L), aquatic life can no longer be sustained. This affects sedentary invertebrates and aquatic plants, as well as fish. In the Gulf of Mexico, the dominant species associated with HABs are brown tides and Karenia brevis. Occurrences in the Tampa area have been known to cause manatee kills, posing a threat to the endangered animal (Bushaw-Newton and Sellner, 1999). Estimated losses due to HABs total nearly 50 million U.S. dollars annually (Anderson et al., 2000). HABs can have serious public health implications, as well as economic effects. The toxins produced by the algae can cause respiratory distress in humans, and toxic shellfish consumed by humans can have neurotoxic effects, including permanent short-term memory loss, referred to as amnesic shellfish poisoning (ASP). The toxin responsible for ASP is produced by several marine species, including diatoms and species of red algae (Jeffery et al., 2004). The neurotoxic sicknesses caused by HABs are often temporary. ASP is an exception, as is chronic liver disease caused by exposure to cyanobacteria toxins (Baden, 2001)."}, {"section_title": "DISCUSSION", "text": "It is estimated that the lower 48 states of the U.S. consisted of 221 acres of wetland habitat in the late eighteenth century. In just over 200 years, over half of that area has been lost (Dahl, 1990). Coastal wetlands have experienced some of the most drastic losses, as coastal areas have traditionally been centers of urban and industrial development and growth (Crossett et al., 2004). The U.S. Gulf of Mexico coastal region contains more than 40% of national wetland habitat area, but is the site of 80% of national wetland losses in the last 200 years (Turner, 1997). While conservation efforts have significantly reduced the area of wetland loss, a net loss of zero has not yet been achieved. Between 1950 and 1979, an average of 458,000 acres per year were lost; however, from 2002 to 2004, a total of 30,000 acres of wetland habitat has been lost in the U.S. Gulf of Mexico area (Dahl, 2006). Since the 1780s, the state of Texas has experienced a loss more than 8,380,000 acres of wetland habitat (Dahl, 1990). Nationally, 95% of wetlands consist of freshwater palustrine habitat, but the Galveston Bay watershed is only 17% freshwater habitat. Since the 1950s, the Galveston Bay Estuary Program has reported a loss of 19% of total wetland area in the Galveston watershed area (GBEP, 2002). The calculated results for Galveston in this study are inconsistent with this report, as recategorization of a majority of the historical USGS data from unclassified to another habitat type occurred. The data do still report a change, but are not representative of many of the overall trends of wetland losses in the lower Galveston Bay watershed and the Gulf region as a whole from the 1950s to the present. The most substantial illustration of loss between 1955 and 2001 was the 66% loss of estuarine aquatic bed habitat (Table 3). This is most likely due to the considerable rise in sea level and subsidence in the Galveston Bay area in the last century. Losses in estuarine aquatic bed may also have occurred as an indirect effect of climate change, as hurricane frequency has increased in the last fifty years. Gains in all of the palustrine wetland classes were due to the reclassification of both wetland and upland area, although some actual gain in palustrine scrub/shrub habitat may have occurred, as was the overall trend in the Gulf. Few substantial gains or losses in wetland habitat occurred from 1996 to 2001. The slight gains exhibited in palustrine and estuarine aquatic bed can be attributed to watershed restoration efforts, and palustrine scrub/shrub losses can largely be attributed to urban expansion in the Galveston and Houston areas. Alabama has suffered a 50% loss in wetland area in the last 200 years, with the most significant losses in palustrine and estuarine marsh. Since the implementation of wetland and estuary restoration practices, however, Alabama coastal areas have experienced a reported 90% growth in scrub/shrub habitat (Stout et al., 1998). This growth was not reflected in both palustrine and estuarine classes of the data set, possibly because different time points were used. A substantial increase in unconsolidated shore between 1956 and 2001 in the Mobile Bay watershed may be due to estuarine habitat degradation and erosion as a result of sea level rise or damming and dredging practices. Losses in estuarine emergent habitat around the watershed associated with sea level rise continued during the 1996 to 2001 time point, illustrating the continuing influence of climate change on wetland habitat. The steady decline in palustrine and estuarine aquatic bed could be a result of increasing salinity or a secondary result of dredging and damming. Both Galveston and Tampa experienced gains or comparatively small losses in aquatic bed habitat when compared to Mobile, likely reflecting more robust restoration efforts in Galveston Bay and Tampa Bay than in Mobile Bay. Expanding urbanization can be attributed to the loss of both palustrine and estuarine emergent habitat near the city of Mobile, Alabama (Figure 2; Table 3). Extensive gains in estuarine forested habitat reflect an overall shift in Florida's wetlands from emergent salt marsh to forested mangroves (Figure 3). Climate change is believed to be responsible for this species shift (Marshall et al., 2003). Milder frosts and warmer mean low temperatures have allowed the tropical mangrove species to spread northward and become a more dominant habitat type in the Tampa Bay watershed (Table 4). This conversion suggests a stronger influence of temperature and climate change in the Tampa watershed than in either Galveston or Mobile, as Tampa was the only site to experience such an extensive increase in estuarine forested habitat. A combination of urbanization and sea level rise has led to substantial losses in estuarine emergent and scrub/shrub habitat. Tampa Bay has experienced the most expansive urban growth of the three watersheds, resulting in more extensive losses to urbanization. The ditches dug in Tampa for mosquito control during the 1950s have also contributed to mangrove and emergent habitat loss, and only recently have restoration efforts begun to reverse the damage done by those ditches (Smith et al., 2007). Climate change is now being recognized as having a significant role in coastal wetland loss (Marshall et al., 2003Turner, 1997). As temperatures increase, marshes and mangroves may replace other habitat types, as they are most ideally suited for warmer temperatures. A decrease in the frequency and severity of frosts in the Gulf region will favor the spread of mangroves, as they flourish in tropical temperatures (Scavia et al., 2002). An example of this trend can be seen in the Tampa Bay watershed as mangroves have replaced other species as the dominant habitat class in the coastal area (Figure 3). Since the 1950s Mobile Bay has experienced slight increases in both mean temperatures and precipitation. This reflects predicted conditions in this region (IPCC, 2007). A combination of factors, including temperature rise, can affect wetland salinity and lead to habitat damage or loss (Day et al., 2003). Increases in precipitation could reduce salinity in some areas as an influx of freshwater would dilute salt levels in estuarine habitats and cause displacement of wetland flora (Twilley, 2007). The drastic changes in sea level rise in the Galveston Bay area could be due to a higher rate of subsidence than in other areas of the Gulf. Subsidence is most often caused by the extraction of groundwater, oil, and/or gas, and also occurs around natural fault lines. Since 1906, Galveston has experienced up to 3 m of subsidence, caused mainly by groundwater extraction and losses (White and Tremblay, 1995). Because the rate of sea level rise is substantially higher in Galveston than in either the Mobile or Tampa Bay areas, anthropogenic-induced subsidence appears to be a much larger problem in the northwestern part of the Gulf than in the east, leading to increased sea level rise. This poses several threats to coastal wetland habitat, including erosion and saltwater intrusion into freshwater habitats (Baldwin and Mendelssohn, 1998). The invasion of salt water inland can shift habitat composition to saline species, and prolonged inundation resulting from sea level rise can cause damage to estuarine habitat (Day et al., 2003). Estuarine emergent, or salt marsh habitat, is particularly susceptible to changes in sea level. While salt marshes can recover from disturbance such as sea level rise, coupled with sediment losses, damage can be irreversible. This implies that continued sea level rise, combined with other factors such as erosion, will exacerbate current trends of salt marsh habitat loss in the Gulf region, despite current restoration efforts. Because wetlands act as an ecological buffer zone for rivers and other bodies of water, loss and degradation of habitat can have a significant impact on environmental quality. Without wetland areas to break down and absorb agricultural and industrial runoff and waste, those chemicals enter rivers and the Gulf without being filtered and metabolized by wetland fauna. This can lead to nitrogen and other nutrient loading and eutrophication, which in turn can contribute to hypoxia. Both hypoxia and high nutrient concentrations in wetland and open water areas can have a detrimental effect on fisheries in the area. Low levels of oxygen in the Gulf have had a detrimental impact on aquatic organisms. For about fifty years, fisheries in the Gulf of Mexico have been experiencing a general decline, reflecting a decreasing fish population in that region. Numbers begin to decline sharply in the 1960s. The Galveston area in particular experienced a sharp drop in fishery population in the sixties. This coincided with an increased incidence of hypoxia in the Texas Gulf coast region. The Galveston Bay watershed region was named a \"hotspot\" for fish kills in 1991 (Thronson and Quigg, 2008). Hypoxia is not the only contributing factor in the fishery population decline. Wetlands serve as spawning grounds for many species of fish, and habitat degradation and loss results in losses for fisheries as well (Zedler and Kercher, 2005). Wetlands contribute to coastal economies at a variety of levels, supporting fisheries and contributing to energy and natural gas, lumber and forestry, tourism, water quality, and flood mitigation. The fishery industry is a major contributor to commerce in the Gulf of Mexico, and as fish population in the Gulf declines, so do profits. Because fishery profits did not begin to reflect the population loss until 40 years after the initial decline, overfishing trends, advances in fishing technology, and changes in seafood market prices could all be contributing factors (Figure 9). Threats to fisheries in the Gulf include over fishing, habitat loss and degradation, and the effects of HABs and hypoxia (Mitsch and Gosselink, 2000). Hypoxia causes mortality in both farmed and wild fishes, resulting in severe losses to commercial fisheries. The preservation and growth of fisheries is particularly dependent on salt marsh and mangrove habitats. These areas serve as sheltered nurseries and provide large amounts of organic detritus to serve as nourishment for young fish (Boesch and Turner, 1984). Because fishery populations rely on wetland habitat for growth, restoration efforts are imperative to fishery maintenance and growth (Houde and Rutherford, 1993)."}, {"section_title": "CONCLUSIONS", "text": "The impacts of wetland area loss go far beyond habitat degradation and species loss. The effects on human infrastructure, the environment, and the economy can be severe. Current restoration efforts by federal and state government agencies have made an impact on area loss, but coastal net losses have not yet reached zero. The strong correlation between salt marsh loss and sea level rise suggests an especially strong relationship between climate change and wetland habitat loss. If current climate change and urban development patterns persist, wetland habitat will continue to be lost and degraded, leading to further deterioration of the Gulf of Mexico aquatic ecosystem, which in turn can have serious consequences for the coastal economy and health conditions. Overall, the U.S. Gulf region has suffered the most substantial losses in aquatic bed and emergent habitat. Vigorous restoration efforts in the Galveston and Tampa watersheds have helped to scale back on wetland losses more recently, and with continued effort losses could eventually be reversed to some extent. LCLU change, specifically urbanization, has contributed most dramatically to losses in palustrine emergent habitat, as marshes and swamps were drained for agricultural and urban expansion purposes. Secondary effects of urbanization, such as dredging and damming have led to severe losses in palustrine aquatic bed around the U.S. Gulf coast. A combination of sea level rise and anthropogenically driven subsidence have contributed to estuarine emergent and estuarine aquatic bed losses in the U.S. Gulf region, while temperature increases have created a more favorable environment for sub-tropical species along the eastern Gulf Coast. Hypoxia and habitat degradation have contributed to a decline in fishery populations since the 1950s. HABs have had a detrimental impact on fishery profits, as well as effects on other aspects of the coastal economy, such as tourism and public health. Further research is needed to pinpoint the driving force behind the changes in fishery trends, as well as to update LCLU data to include recent hurricane events in the Gulf region. This information could potentially be useful in influencing policy changes concerning the mitigation of climate change and protection of wetland habitat. Using the overall trends from this report, a model could potentially be developed to predict the future conditions of wetlands in coastal areas. Table 3. Percent changes in wetland habitat classes in the Galveston, Mobile, and Tampa Bay watersheds from a) 1956-1996, and b) 1996-2001. Unavailable data are signified as (X). Table 3. Percent changes in wetland habitat classes in the Galveston, Mobile, and Tampa Bay watersheds from a) 1956-1996, and b) 1996-2001. Unavailable data are signified as (X). Table 4. Temperature and precipitation data for the three watersheds from 1950 to 2006, grouped by decade. All temperature measurements were in degrees Fahrenheit and all precipitation measurements were in inches. Table 4. Temperature and precipitation data for the three watersheds from 1950 to 2006, grouped by decade. All temperature measurements were in degrees Fahrenheit and all precipitation measurements were in inches.         "}]