[{"section_title": "Abstract", "text": "Abstract. We describe an approach for estimating occupancy rate or the proportion of area occupied when heterogeneity in detection probability exists as a result of variation in abundance of the organism under study. The key feature of such problems, which we exploit, is that variation in abundance induces variation in detection probability. Thus, heterogeneity in abundance can be modeled as heterogeneity in detection probability. Moreover, this linkage between heterogeneity in abundance and heterogeneity in detection probability allows one to exploit a heterogeneous detection probability model to estimate the underlying distribution of abundances. Therefore, our method allows estimation of abundance from repeated observations of the presence or absence of animals without having to uniquely mark individuals in the population."}, {"section_title": "INTRODUCTION", "text": "Estimation of abundance for animal populations involves two basic issues (e.g., see Thompson 1992 , Lancia et al. 1994 , Skalski 1994 , Thompson et al. 1998 , Yoccoz et al. 2001 . First, the investigator is sometimes interested in areas that are sufficiently large that ground surveys cannot be conducted over the entire area of interest. In such situations, investigators must select a sample of locations to survey, and the selection must be conducted in a manner that permits inference about the entire area of interest, and thus about the locations not sampled. This is a standard problem in spatial sampling; statistical texts such as Cochran (1977) and Thompson (1992) present sampling designs and associated estimators to permit such inference. The second problem in animal abundance estimation involves detectability, or the idea that animal survey methods seldom detect all animals present in any surveyed area or sample unit. Instead, animal survey methods involve collection of some sort of count statistic, and the investigator then must develop an estimator for the probability that an animal present in the area of interest appears in the count statistic. This probability also can be viewed as the expected proportion of the animals present that is actually detected. The variety of methods presented in texts (e.g., Seber 1982 , Buckland et al. 2001 , Williams et al. 2002 ) and reviews (Lancia et al. 1994 ) of animal abundance estimation provide different methods of estimating detection probabilities for specific kinds of count statistics. Methods for estimating detection probabilities, and thus abundance, on sample units can be expensive in both time and effort. For example, capture-recapture methods require repeated efforts to capture or observe animals (Otis et al. 1978 , Pollock et al. 1990 ). Even observation-based methods such as distance sampling (Buckland et al. 2001 ) and multiple observers (Cook and Jacobson 1979, Nichols et al. 2000) are viewed by some as too consumptive of time and effort.\nOne potential approach to reducing effort in largescale monitoring programs involves a shift of interest from numbers of animals to numbers of sample units occupied by animals. Methods implementing this general approach are based on presence-absence (more properly, detection-nondetection) data obtained on sampling units. Such methods have been developed independently several times (Geissler and Fuller 1987 , Azuma et al. 1990 , Bayley and Peterson 2001 , MacKenzie et al. 2002 ) and appear to be useful for a variety of different monitoring programs (e.g., patch occupancy by spotted owls in western North America, area occupancy by tigers in India, wetland occupancy by anurans throughout North America). In addition to providing a reduced-effort approach to large-scale monitoring, surveys directed at occupancy are very useful for metapopulation studies (e.g., see Hanski and Gilpin 1997) . The proportion of patches occupied is viewed as a state variable in various metapopulation models (e.g., Levins 1969 , 1970 , Hanski 1992 , 1997 , Lande 1987 . Many metapopulation studies also focus on so-called ''incidence functions'' (e.g., see Diamond 1975 , Hanski 1992 in which the probability of occurrence of a species in a patch is expressed as a function of patch characteristics such as area and habitat.\nEstimation approaches developed for occupancy surveys incorporate detection probability directly into the estimation process (see MacKenzie et al. 2002) and thus deal appropriately with this fundamental component of animal abundance estimation. It is not necessary to count the numbers of organisms observed on sample units, and occupancy surveys are thus relatively easy and efficient to conduct. As with traditional capture-recapture studies, the possibility that heterogeneity exists in detection probability is an important modeling consideration. One important source of heterogeneity, probably the most important source in many situations, is variation in animal abundance, N, among sites. Variable N induces heterogeneity in sitespecific detection probabilities. Thus, failure to accommodate heterogeneity in detection probability is a de facto assumption of constant abundance among sites.\nTo illustrate this linkage between abundance and heterogeneous detection probabilities, suppose that the ith sample unit is occupied by N i animals, that all animals in a sample unit have identical detection probabilities, and that detection of an individual animal in a sample unit is independent of detection of other animals in that unit. In this situation, the conditional (on N i ) probability of detecting occupancy on a sample unit, say p i , can be written as\nwhere r is a binomial sampling probability that a particular individual is detected. Detection probability at the level of the sample unit p i is estimated via repeat visits by investigators to the sample units (e.g., MacKenzie et al. 2002) . That approach requires that a group of sample units either have the same p i or else have p i that vary in accordance with measurable covariates, and therefore it is inappropriate when p i varies as a result of variation in N i .\nThis relationship suggests that if one is able to adequately characterize the distribution of detection probabilities, then the distribution of abundances can be deduced from Eq. 1. Because one of the main perceived limitations of occupancy surveys is their inability to generate information about absolute abundance, such a framework may greatly expand the utility of occupancy surveys in many settings.\nIn this paper, we provide a method for: (1) dealing with heterogeneity in detection probabilities caused by variation in animal abundance, and (2) using this heterogeneity to extract information about abundance from occupancy surveys. Our approach is to acknowledge that heterogeneity in N i induces heterogeneity in p i according to Eq. 1. When properly specified to acknowledge this, a mixture distribution for p i permits estimation of the distribution of N i . From this estimated distribution, the best estimate of N i , given the data at a particular site, can be computed. The estimated distribution of abundances across sites, {N i ; i ϭ 1, 2, . . . ,}, is useful in certain kinds of metapopulation modeling (see Discussion) . In addition, these estimates of N i are useful for estimating two important quantities. First, the estimates can be summed over all sites to estimate overall abundance on the sample units or average abundance per sampled unit. Second, the estimated fraction of occupied sites (N i Ͼ 0) estimates occupancy probability in a manner that deals directly with the heterogeneity associated with the variation in unit-specific abundances."}, {"section_title": "OCCUPANCY SURVEYS", "text": "Occupancy surveys entail repeat visits to R sample units i ϭ 1, 2, . . . , R (we refer to these as ''sites''). At each visit, an effort is made to detect the species of interest, producing a detection history of whether or not the species was detected at each of the visits to the site. The observed presence-absence at each visit is a binary random variable defined as follows:\nWe note that the key element of this problem is that observed nondetection is ambiguous, in the sense that there may be nondetection at sites that are, in fact, occupied (sampling zeros) and nondetection as a result of a site being unoccupied (fixed zeros). The important estimation problem is the separation of these two types of zeros by parameterizing a model that allows estimation of both detection probability and occupancy rate.\nThe likelihood of the data is constructed by acknowledging that the site-specific detection frequencies, w i. ϭ ⌺ t w it , are a mixture of two processes. One process is the usual binomial likelihood found in many capturerecapture problems. This model is conditional on animals being present at site i (i.e., occupancy) and available for counting. Sampling zeros may result from this binomial sampling model. We assume that each site has probability of being occupied. Thus, the second process is that w i. has a point mass at 0 with probability 1 Ϫ . That is, if animals are not present, then Pr(w i. ϭ 0) ϭ 1. This component model generates the fixed zeros.\nFrom these considerations, the marginal likelihood of the data may be constructed. This may be found in MacKenzie et al. (2002) , for example. The simple closed-population, constant-p version with T sample periods is\nwhere w i. is the number of times that detection occurred at site i, and p is the conditional (on occupancy) probability of detection, i.e., analogous to the usual capture-recapture detection probability parameter. It is a simple matter to numerically maximize this likelihood in order to obtain estimates of p and . This basic occupancy model is often referred to as a zero-inflated binomial model (e.g., Hall 2000) in other applications. Zero-inflation models are commonly used for modeling count data that contain excessive zeros, including Poisson and negative binomial models. Extension of this concept to any distribution is, in principle, straightforward.\nAs specified here, data consist of detection or nondetection. In practice, counts or some other ordinal measures of abundance may be observed. Such data can be reduced to a binary (presence-absence) response and model 2 can be applied. Also, possibilities exist for making direct use of data other than detectionnondetection, such as counts, although methods for handling more general problems must be developed. We address this further in the Discussion."}, {"section_title": "The occupancy survey model as a finite mixture on p", "text": "The argument producing the likelihood in Eq. 2 is that there are two classes of sites, those that are occupied and those that are not. Then, conditional on occupancy, animals are detected with probability p.\nAn alternative way to develop this model is to assume that each site has its own detection probability, say p i , and that there are two possible values of p i . First, a constant, nonzero p, say p i ϭ p 1 , which occurs with probability . Sampling from such a site will yield w i. according to the usual binomial (T, p 1 ) sampling model. Second, define ''unoccupied'' sites to have zero capture probability, i.e., p i ϭ 0, so that Pr(w i. ϭ 0) ϭ 1, which occurs with probability 1 Ϫ . In this case, w i. is sampled from a binomial p ϭ 0 distribution, which, of course, always will yield w i. ϭ 0. This formulation as a mixture of binomial random variables with different values of p, and mixing proportion , is equivalent to the earlier construction as a mixture of a binomial random variable conditional on occupancy, and a point mass at 0. That is, both yield the likelihood of Eq. 2.\nWhen viewed as a mixture on detection probability, this type of problem is similar to the finite-mixture models considered by Norris and Pollock (1996) for modeling heterogeneity in capture probabilities among animals in a traditional N estimation framework, with the exception that the finite mixture in Norris and Pollock (1996) is specified on the conditional capture probabilities, which are assumed to be nonzero for all animals in the population. Here, we have simply marginalized the likelihood over two capture probability states, one of which is zero, with the implicit understanding that sites with p i ϭ 0 are unoccupied sites, i.e., that animals cannot be detected at those sites. That is, the detection probability under this alternative development is a marginal detection probability."}, {"section_title": "MODELING HETEROGENEITY IN p WITH FINITE MIXTURES", "text": "We suppose that the number of animals available for detection, N i , varies among sites. As is customary in other capture-recapture type problems, we assume that the events during which individual animals at a site are detected are independent of one another. Let y i be the number of animals observed. Then, the probability of detecting at least 1 animal, given that animals are present, is equal to 1 minus the probability of not detecting all N i animals at the site:\nWe see that variation in N i is manifest as heterogeneity in capture probability. We note that, in many problems where the focus is on the proportion of the area occupied, only the event that y i Ͼ 0 (or y i ϭ 0) is observed (see Discussion), but for the development of the model, it is useful to think in terms of the site-specific count, y i . Consequently, unless one believes that abundance is constant among sites, it is important to accommodate variation in capture probability among sites that is a result of variation in N i . This relationship further suggests that modeling heterogeneity in p i will allow characterization of the distribution of N i , because distinct values of p i result only from variation in N i .\nIn the following development, we suppose that detection probability varies by sample location only according to the number of animals available to be detected, p i ϭ 1 Ϫ (1 Ϫ . One could impose additional Ni r) model structure on r, which we discuss shortly. We emphasize here that p i is defined conditional on N i , which may be zero. This is in contrast to the traditional development presented in Occupancy Surveys, where detection probability is defined conditional on N i Ͼ 0. We discuss this further in Conditional and unconditional detection probability. The particular case where N i ϭ 0 is important because in this case we have p i ϭ 0. That is, if a site is unoccupied, then the probability of detection at that site is 0, which is the alternative development of the occupancy model alluded to in Occupancy Surveys, based on a finite mixture on marginal detection probability.\nFor site i, let w i. be the number of detections observed in T repeated samples. Then, w i. is a binomial random variable with likelihood\nIt is difficult to obtain reasonable estimates of each p i for realistic values of T. Moreover, it is even less clear how to obtain an estimate of abundance from this likelihood. However, we can exploit the relation between p i and abundance to make progress in this regard.\nWe now suppose that abundance is a random variable with some probability distribution, say Pr(N ϭ k) ϭ f(N ϭ k) ϭ f k . Thus, the site-specific abundances, N i ; i ϭ 1, 2, . . . , are viewed as realizations of the random variable N having probability distribution f(N). Because the random variable N is discrete, the density of site-specific detection probabilities, p i , has support on the values p k ϭ 1 Ϫ (1 Ϫ r) k for k ϭ 0, 1, . . . . Moreover, because of the relationship between p k and N, {f k } is also the density for p i ; i.e., Pr(\nIf the particular values of N i were known, then one could simply estimate r from the likelihood conditional on N. However, site-specific abundances are unknown. A standard trick in similar problems involving random effects or nuisance parameters is to estimate parameters of the marginal likelihood of w i. , which is the following mixture:\nThe goal is to estimate r, the animal-specific detection probability relating the mass points, and their masses f k . Without further assumptions, this infinite-dimensional estimation problem cannot be solved. One reasonable assumption is to impose a parametric form on f k (we discuss specifics in the section Estimation of the Mixing Distribution and Abundance). Although this does not require limiting the number of support points, one would likely do so for numerical analysis of the likelihood. In this case, with K support points, we have\nThis has the appearance of the finite-mixture model proposed by Norris and Pollock (1996) . In their statement of the problem, K would be limited by the number of sampling occasions because the number of parameters to be estimated increases with K. With a parametric form imposed on f k , this is not necessary, except in the numerical analysis of the likelihood. For independent data from R sites, w ϭ (w 1. , w 2. , . . . , w R. ) the likelihood is the product of R versions of Eq. 4:\nThe fact that the masses of the support points in this finite mixture correspond to abundance classes is crucial to being able to estimate abundance from presenceabsence data. Application of finite mixtures on detection probability to the problem of occupancy surveys generates an estimated mixing distribution that is, by construction, an estimate of the distribution of animal abundance among sites. Estimation of this model will be discussed shortly, including selection of the masses."}, {"section_title": "Relationship to model ''M h ''", "text": "This model is analogous to the finite-mixture distributions used by, for example, Norris and Pollock (1996) and Pledger (2000) for the modeling of heterogeneity in animal-specific capture probabilities (socalled ''Model M h ''), in the sense that the model is of heterogeneity in detection probability among sample units. In traditional applications, sample ''units'' are individual animals (being captured and recaptured), whereas in occupancy applications, ''units'' are spatial units wherein animals are repeatedly detected or not detected. Some discussion of this issue also is given in MacKenzie et al. (2002) .\nThere are several important practical differences between the model described by Eq. 5 and traditional applications of model M h that merit further discussion. First, in the present problem, the discrete support of p i is a direct consequence of the discrete support of the random variable N. In traditional applications, the discrete support of p i is merely a convenient modeling decision. Second, the support points are known except for the unknown parameter r, and are specified by the expression p k ϭ 1 Ϫ (1 Ϫ r) k for k ϭ 1, 2, . . . , K, the support of the distribution of N i . The only unknowns are the densities of the support points and the animalspecific capture probability, r. In general problems involving heterogeneity, continuous mixtures may be more appropriate, e.g., the beta mixture Overton 1978, Dorazio and . However, discrete mixtures are especially relevant for this particular problem because of the nature of the heterogeneity, as arising from variation in N (which is discrete). Third, in traditional applications of finite mixtures, the finite mixture is imposed on the conditional (on occurrence) capture probability. In the present development, the event that a site is not occupied is equivalent to that site having p i ϭ 0, as a result of N i ϭ 0. Thus, it is sensible to think of a portion of the population with zero capture probability, and to model this case as simply another support point for the mixing distribution of the marginal detection probability p i . Then, the zero point mass (Pr(p i ϭ 0)) is the occupancy rate parameter."}, {"section_title": "Alternative models for detection", "text": "Although the model has been presented assuming that r is constant, this is no more necessary here than it is in any other capture-recapture type of problem. For example, if r varies according to certain site or time-specific covariates, then the model could be extended to accommodate them. Natural candidates that influence detection probability are weather or sampling conditions, or simply time (i.e., r varies over the study). We provide an example of this in Application to Avian Point Counts.\nObservation of simple presence-absence does come at some expense with regard to modeling structure on r. Because recapture information is unavailable on individual animals, obviously one cannot accommodate individual heterogeneity in detection probability. Of course, this is a consideration in any study design; thus, in problems in which individual heterogeneity is thought to be critical, one should conduct a capturerecapture study with unique marking of individuals. Even though individual animal heterogeneity may be important in many problems, relevant data often are not collected, which of course motivates the general interest in occupancy-type problems. Regardless, heterogeneity among spatial units as a consequence of variable abundance will generally be important unless one believes that abundance is constant among sites, which is biologically untenable in many situations, but perhaps reasonable in others (see Discussion)."}, {"section_title": "Conditional and unconditional detection probability", "text": "Because conventional thinking in capture-recapture problems is based on the notion of a capture probability defined conditional on presence, or occupancy, it is instructive to clarify the relationship between the unconditional capture probability that forms the basis of the likelihood given by Eq. 5 and the more conventional definition.\nWe first consider the unconditional detection probability. This is the probability of detection, regardless of whether or not a site is occupied. Because occupancy states are indexed by abundance, this average detection probability may be expressed as the average over the unoccupied (N ϭ 0) and various occupied (N Ͼ 0) states as"}, {"section_title": "kϭ0", "text": "We emphasize that p is the average probability of detecting animals on any particular sample unit that includes the p i ϭ 0 possibility, which is ''non-occurrence.'' In this sense, it differs from the detection probability parameters typically considered in animal abundance estimation problems. However, this is sensible in occupancy survey problems because of the duality between a finite mixture on occupancy state and a finite mixture on unconditional detection probability including the 0 state (i.e., Occupancy Surveys).\nTo determine the relationship between p and the more familiar conditional detection probability, note that Eq. 6 is the same as\nwhere, of course, the second term is 0. Here, Pr(y Ͼ 0ͦN Ͼ 0) is the conditional (on occupancy) detection probability, which we will denote as p c . Also, Pr(N Ͼ 0) is the occupancy rate, analogous to in Eq. 2. Therefore,\nc kϭ1 This is analogous to the usual detection probability parameter (e.g., that of MacKenzie et al. [2002] ), in the sense that it is conditional on animals being present and available for detection. The difference between this expression and the traditional conditional detection probability is, of course, that p c is a mixture of different detection probabilities that depend on N. Similarly, one can compute the variance (or standard deviation) of the p i 's either conditional on N i Ͼ 0 or not. In the simulation studies discussed in the section Simulation Study, we report the conditional standard deviation, say c , as a measure of the induced heterogeneity in p i resulting from variation in abundance. As with p c , c will depend on the abundance distribution. This parameter may be interpreted in the same manner as that found in traditional situations involving Model M h (e.g., Burnham and Overton 1978 , Pollock and Norris 1996 , Dorazio and Royle 2002 . For example, larger values of c imply more heterogeneous p i 's, in which case the ''constant p'' models will perform relatively poorly."}, {"section_title": "ESTIMATION OF THE MIXING DISTRIBUTION AND ABUNDANCE", "text": "Estimation of the mixing distribution may proceed in two ways. First, we may adopt the nonparametric approach laid out in Norris and Pollock (1996) and Pledger (2000) . The number of nonzero support points that may be considered in this situation is limited by T, so where the range of N i is large, the nonparametric approach will lead to a coarse approximation to the true underlying distribution.\nThe second approach, and the one that we prefer, is to consider parametric forms for the masses f k . Perhaps the most natural candidate for f is the Poisson density,\nwhere is the Poisson intensity parameter to be estimated. This expression may be substituted into Eq. 5, along with\n, yielding a model with only two parameters, and r.\nThe Poisson model is a natural assumption for modeling abundance for two reasons. First, suppose that N i were observable without error, and interest was in constructing statistical models that explain variation in the N's. The most obvious modeling approach for such data is a Poisson generalized linear model (GLM) with a log-linear model explaining variation in the mean of N. This is classical Poisson regression, analogous to linear regression for normal data. In the present context, the Poisson regression model functions as a prior distribution for the unobservable abundances. Seber (1982) provides other instances in which the Poisson assumption is useful. Second, the Poisson model for abundance arises under a random distribution of animals in space, and hence it is popular in many ecological studies involving the distribution of plants and animals.\nMany other models for abundance are possible. A second model that we consider here is the negative binomial model (e.g., Lawless 1987) given by\nwhere a and are the parameters, and the mean and variance under this model are\nThe negative binomial model can be viewed as a mixture of Poisson distributions with means that vary according to a gamma distribution. This may be an appealing model in some instances because it allows the density of animals to vary spatially. Thus, the negative binomial model can allow for more variation in abundance than can be described by a constant mean Poisson model (extra-Poisson variation in N, or overdispersion).\nThe benefit of using a parametric density for abundance is a great reduction in the number of parameters to be estimated (i.e., to one parameter describing the support points and one describing their masses) compared with the nonparametric finite-mixture models of Norris and Pollock (1996) , wherein the number of parameters increases with the number of support points defining the mixture. Additionally, with a parametric mixing distribution, the support of N need not be artificially restricted so as to ensure identifiability of model parameters.\nEstimation by maximum likelihood proceeds as described in Pledger (2000) , except for f k being constrained according to Eqs. 8 or 9, and with support points specified by p k ϭ 1 Ϫ (1 Ϫ r) k . Thus, the two parameters to be estimated are the animal-specific detection probability, r, and , the mean of this Poisson distribution on N. Using these estimates, we may estimate {f 0 , f 1 , . . . , f K }, the set of probabilities Pr(N ϭ k), and the corresponding support points, p k ."}, {"section_title": "Estimating occupancy", "text": "Under a parametric model such as the Poisson, ϭ 1 Ϫ f 0 is a derived parameter (i.e., implied by ), and so an estimator of under the Poisson model, for example, is 1 Ϫ Pr(N ϭ 0; ):"}, {"section_title": "Estimating abundance", "text": "We may compute Pr (N i ϭ kͦw i. ) given the total number of detections at each site, w i. , using Bayes theorem:\nNote that Pr(w i. ͦN i ϭ k) are simply binomial probabilities, and f k ϭ Pr (N i ϭ k) , for which we may use the estimates, f k .\nThe posterior masses from Eq. 10 may be computed for each value of k. One could use as an estimate of N i that value of k that produces the highest posterior probability (i.e., the posterior mode). Alternatively, we prefer using the posterior mean:\nwhich will not usually be an integer. Other characteristics of the posterior of N i (e.g., the variance, percentiles, etc. . . . ) may be computed using the posterior probabilities in Eq. 10.\nIn many problems, one would expect abundance to be small at a local scale; consequently, estimates for N i 's will be very poor. However, this framework may produce very good estimates of the total or average number of individuals present at the collection of sites sampled. Of course, is an estimate of the average, and, where R sites are sampled, R is an estimate of the total abundance on the R sample units. When sampling units are inherently discrete, such as wetland basins in amphibian surveys, or in waterfowl breeding pair counts or brood counts, then the total abundance in a region of interest may be estimated directly by area expansion. Otherwise, when the effective area of a sampling unit is known, then an estimate of total abundance may be obtained by a simple area expansion."}, {"section_title": "APPLICATION TO AVIAN POINT COUNTS", "text": "Avian point counts are widely used to investigate problems in avian biology and ecology. Because it is sometimes difficult to determine the number of unique individuals observed, the use of presence-absence data for the analysis of occupancy and other questions is appealing. Here, we demonstrate the application of our method for estimating abundance from simple presence-absence data based on avian point counts. The data were collected on a North American Breeding Bird Survey (BBS) route in New Hampshire in 1991. The data were collected at 50 points (''stops'') over a period of 30 days during the BBS sampling interval. The 50 points were sampled 11 times each by the same ob-server. For general background on the BBS, see Robbins et al. (1986) . For further description of the data used here, see Link et al. (1994) . We consider five species for analysis: Hermit Thrush (Catharus guttatus), Wood Thrush (Hylocichla mustelina), Gray Catbird (Dumetella carolinensis), Ovenbird (Seiurus aurocapillus), and American Redstart (Setophaga ruticilla).\nWe make use of the Poisson assumption on abundance at the stop-level, as described in the previous section. We believe that the assumption that N i is constant over the time period in question is reasonable, on the grounds that birds have established breeding territories at that time. No stop-specific covariates are available to allow for the modeling of variation in stoplevel abundance. In general, such information could be modeled in the Poisson mean, as in traditional generalized linear models. An important aspect of these data is that breeding activity may vary over the period in question, which suggests that the detection probability may vary over the course of the study as a result of variation in nesting or calling activity. Because of this, we considered several alternative models for detection probability, based on a logistic model for detection probability according to 2 logit(r ) ϭ ␤ ϩ ␤ day ϩ ␤ day . \nHere, the variable ''day'' indexes the day on which the sample was conducted from the beginning of the study. The three models considered were those submodels containing only ␤ 0 (Model 1 [M1], constant detection probability), ␤ 0 and ␤ 1 (Model 2 [M2], linear change in detection probability) and all three parameters (Model 3 [M3]), allowing for quadratic change in detection. For example, quadratic change might involve an increase in detectability followed by a decrease, or vice versa. In addition to these models allowing for temporal variation in detection probability and variation in abundance among stops, we considered the simple occupancy model described by MacKenzie et al. (2002) . Because this model implies the assumption of constant abundance across stops, we believe that it will frequently be untenable, although it may provide a reasonable approximation in some situations. However, because it is the only rigorous competitor that is capable of yielding biologically relevant information (i.e., patch occupancy) from sample data, we believe that many investigators would consider its use for some problems. We will label this model ''Model 0'' (M0).\nWe used AIC (Akaike 1973, Burnham and Anderson 1998) to compare the various models. Because the sample size in the present problem is the number of spatial samples (i.e., there are R ϭ 50 w i. 's in Eq. 5), we used the small-sample adjustment AIC c (e.g., Burnham and Anderson 1998:221) . In general, models with lower AIC c scores are considered to be better candidate models than those with higher scores. In some analyses, one could make an argument for the use of an AIC statistic that adjusts for overdispersion. Instead, we choose to defer this issue of possible overdispersion to the next section (negative binomial). Our approach then deals explicitly with overdispersion by attempting to model it, rather than adjusting for it, and hence we do not consider other refinements to AIC beyond the small-sample correction.\nFor the various models fit to each species, we computed the MLEs of (for Models 1-3, as it is not available for Model 0), the various detection probability parameters, and the occupancy rate. In addition, for Models 1-3 the conditional detection probability, p c , was computed according to the discussion of section Conditional and unconditional detection probability, as this is the quantity comparable to the detection probability of MacKenzie et al. (2002) . Because Models 2 and 3 contain a nonconstant detection probability, the value at the mean sample day was used (i.e., evaluating (11) at day ϭ day). The results for the five species are shown in Table 1 . For each species, model results are ordered by AIC c value, from best to worst, and AIC c differences (⌬ m ) and Akaike weights (w m ), where m is the model index (Burnham and Anderson 1998:122-124 ) are given to facilitate interpretation.\nWe see from Table 1 that one or more of the models that allow for variation in abundance (Models 1-3) are preferred to Model 0 in all cases. The Akaike weights for Model 0 are near zero in all cases except for the Gray Catbird, which is the only instance in which Model 0 beats any of the variable abundance models. For the Gray Catbird, w 0 ϭ 0.158, which is still only onefourth that of Model 1, for which w 1 ϭ 0.572. In general, one might use the Akaike weights to carry-out ''model-averaging'' in order to obtain estimates of critical parameters averaged across the model set (Burnham and Anderson 1998), but in the case of Model 0, no abundance estimate is obtained. Moreover, even for occupancy, justification for averaging Model 0 results (which assumes constant abundance) with other models is unclear. Mean abundance estimates ( ) are given in Table 1 . To better gauge the uncertainty associated with these estimates, we computed 95% profile likelihood intervals for of each species using the model with the best AIC c . Profile likelihood intervals are probably more suitable for this problem because of the low sample sizes where conventional asymptotic (Wald-type) intervals will tend to understate the confidence interval width. The 95% profile intervals for the five species are: Hermit Thrush (0.332, 2.098), Wood Thrush (1.624, 3.036), Gray Catbird (0.332, 0.941), Ovenbird (1.612, 2.779), and American Redstart (1.381, 3.869).\nGenerally, the conditional detection probability estimates (i.e., p c ) are fairly similar across the various models, the main discrepancy being associated with Model 0 (as expected). Consequently, the estimates of occupancy for Model 0 depart from those estimates based on the variable abundance models, although the difference is not always large (e.g., for the Wood Thrush, the difference is on the order of 2-3%). The difference is most pronounced for the Hermit Thrush and American Redstart.\nThere is evidence of temporal variation in detection probability for the Hermit Thrush, in which case the linear change model (M2) is slightly preferred to the constant model (M1), but the Akaike weights are similar. The direction of temporal change (decrease in detection probability over time) is consistent with the expected reduction in detection probability as the breeding season progresses. Estimates of abundance (the Poisson mean) do not appear to be sensitive to the choice of model for detection probability.\nAn important benefit of Models 1-3 is that they allow for estimation of abundance, and these estimates appear reasonable, as do the estimates of animal-specific detection probabilities (i.e., r) , based on our informal assessment and knowledge of bird biology and sampling. In particular, the Ovenbird is typically easy to detect because of its distinctive call, and its estimated detection probability is r ϭ 0.315 (for Model 1), the highest among the five species. Similarly, our informal assessment is that the Ovenbird, Gray Catbird, and Wood Thrush are all easier to detect than both the American Redstart and Hermit Thrush, the latter having very low estimated detection probabilities. In general, detection probabilities will depend on the specific observer and other sampling protocol issues (which are controlled for in this study by use of the same observer and the same protocol in each sample); thus, detection probabilities for other surveys may very well differ from those obtained here."}, {"section_title": "Negative binomial results", "text": "We investigated the negative binomial model on abundance for these data. In all cases, maximum likelihood estimation appeared unstable, indicated by high correlation between the parameter estimates (typically between r, the detection probability, and , the negative binomial mean) and flat likelihood surfaces. For example the correlation between and r for the American Redstart was Ϫ0.998 and similar negative values between these two parameter estimates were found for the remaining four species. We attempted to compute 95% profile likelihood intervals for (the parameter of interest), and these intervals typically had an upper bound of ϱ (i.e., no finite value of could be found to yield a log-likelihood difference of 3.84). The single exception was for the Wood Thrush data, for which the 95% profile likelihood on was (5.79, 102.81). This highlights the main problem that we found in attempting to interpret the negative binomial results: the estimates, in most cases, were simply not sensible. For example, for the Wood Thrush, ϭ 29.7 would suggest that the average point count is observing 29.7 Wood ESTIMATING ABUNDANCE FROM DETECTION DATA Thrushes, which is certainly beyond the realm of possibility for point counts of most breeding song birds. The lone exception for which sensible negative binomial estimates were obtained was the Gray Catbird, for which ϭ 0.69 (compared to ϭ 0.56 under the Poisson model). Even in this instance, the likelihood was extremely flat, yielding no finite upper bound on the profile likelihood.\nBecause of this apparent instability, we omit additional detail on the negative binomial results for these species, and we are cautious about considering this model as a viable candidate model for explaining detection-nondetection data from this BBS field experiment until this suspect behavior is better understood (see Discussion)."}, {"section_title": "SIMULATION STUDY", "text": "Although the previous example offers some indication that the Poisson model provides sensible answers for real data, it remains to establish suitable frequentist properties of the estimators, i.e., their average behavior over a large number of data sets. As with any likelihood-based technique, we expect performance to deteriorate in small samples. We conducted a simulation study to evaluate estimation of the critical parameters in these occupancy problems under the Poisson model for abundance, and to assess what constitutes ''small'' sample sizes over a range of conditions. We also carried out a more limited simulation study to evaluate the performance of the MLE when the datagenerating model is negative binomial.\nSee Appendix A for additional information on the simulation design. Results are given in Appendix B. We provide a summary of the salient points from that study here."}, {"section_title": "Discussion of simulation results", "text": "Poisson data-generating model.-Bias of is generally small over the range of situations considered in the simulations. Naturally, the largest bias occurs for low values of animal-specific capture probability (e.g., r ϭ 0.1) and when fewer sites are sampled. In such cases, the bias is typically ϳ10-15%. This is not surprising, because when is small, the expected number of sites at which detection occurs also is small.\nFor this reason, it is difficult to extend simulation studies to smaller sample situations because, for example, with R ϭ 100 sites, and over a broad range values of r and , one does not expect to collect much data. As an illustration, suppose that abundance does behave as a Poisson random variable with ϭ 0.5. Then, occupancy rate is slightly less than 40%. We expect to see animals at fewer than 40 sites, depending on r and T. If r ϭ 0.1 and T ϭ 5, the expected number of sites at which animals are detected at all is only about 18 or 19. Expectations must be moderated in such situations, and one probably would not design a study with T ϭ 5 and R ϭ 100 if similar values of and r were suspected. We emphasize that likelihood-based inference is not a small-sample procedure, and this should be considered in any study. Thus, although it is tempting to consider R in the context of traditional capture-recapture, this is misleading because R ϭ 100 does not generate 100 capture histories of animals detected at least once, but instead includes sites with allzero capture histories.\nNevertheless, can perform very well for R ϭ 100 or even less, under the right circumstances. For example, larger values of r and T provide more favorable conditions for estimating . Simulation results not presented here indicated that T ϭ 10 may yield practical estimates for small values of r. Similarly, if r is larger, say Ն0.3, performance of the MLE of is adequate even for T ϭ 5.\nAs a final comment on estimation of , we note that the distribution of is slightly skewed over the range of situations considered. Thus, although the bias of is apparent in the mean of the sampling distribution, the median is frequently very close to the truth over all situations considered, which may be some consolation for the observed small-sample bias.\nEstimation of .-In traditional capture-recapture problems for which estimation of abundance is the objective, failure to account for heterogeneity causes a negative bias in the estimator of N (e.g., see Seber 1982 , Pollock et al. 1990 ). Thus, in occupancy surveys, we expect that failure to model heterogeneity will lead to negative bias in the occupancy rate estimator. We see this behavior clearly in the results given in Appendix B, where, regardless of the situation, the mean of under the constant-p model described by MacKenzie et al. (2002) exhibits a negative bias. Conversely, there is almost no discernible bias in the estimator of under the data-generating Poisson heterogeneity model when R ϭ 500, and only slight bias in most cases when R ϭ 200. As before, there is some skew in the distribution of . Also consistent with the results for , the performance of deteriorates somewhat as decreases, because this generally leads to fewer detection histories upon which to base inference.\nNegative binomial data-generating model.-The sampling distribution of under the negative binomial model is highly skewed. Consequently, the estimator of is considerably biased in the small-sample situation considered. We note that additional simulation results (not reported) indicate that this bias diminishes rapidly as either R or T is increased. To elucidate the results, we report medians (Table 3 of Appendix B) for summaries of estimators under the negative binomial data-generating model. In general, the sampling distributions of and are centered approximately on the truth, with (interestingly) slightly more discrepancy in the low-heterogeneity cases. As expected, when the Poisson model is fit to negative binomial data, we generally observe larger (negative) bias in the estimators of both the mean and occupancy rate, although the bias is minimal for the low-heterogeneity case, but quite substantial when there is extreme heterogeneity. The sampling distribution of is nearly normal, so the means are similar to the medians reported in Table 3 of Appendix B. Note that, although the bias in the estimation of the mean abundance may be substantial, occupancy rate estimates are less affected. Finally, the estimator of using the constant-p model of MacKenzie et al. (2002) exhibits more bias than under the misspecified Poisson model, as expected."}, {"section_title": "CONCLUSIONS AND DISCUSSION", "text": "In this paper, we have developed a method for accounting for heterogeneous detection probabilities in replicated presence-absence data (i.e., ''occupancy surveys'') where the heterogeneity arises as a result of variation in abundance among sites. Although heterogeneity could be accounted for indirectly, in traditional methods, by inclusion of covariates in a model for p, it is not always possible to observe covariates that are correlated with abundance. The benefit of our approach is that it is based on the direct linkage between p i and local abundance, N i , which is a consequence of binomial sampling (i.e., Eq. 1). One important benefit of exploiting this linkage is that our approach allows for the estimation of the distribution of site-specific abundances, and even site-specific abundance. This is made possible by recognizing that variation in N induces heterogeneity in detection probabilities among sites. Therefore, the probability distribution of abundance can be deduced from the latent detection probability distribution.\nAs suggested in the Introduction, we believe that occupancy surveys have the potential to be useful in various kinds of ecological investigations. Because of the reduced effort typically associated with the collection of presence-absence data, we believe that occupancy surveys may prove very useful in large-scale surveys of various organisms. For example, some amphibian surveys involve repeat visits by investigators to wetlands, with sampling carried out at each visit in an attempt to ascertain presence of one or more species of interest. Such sampling should be much less intensive than the multiple-observer (Cook and Jacobson 1979) or capture-recapture (Wood et al. 1998) sampling usually required to obtain reasonable abundance estimates. Avian point counts can be used to draw inferences about abundance when distances to detected birds are recorded (Buckland et al. 2001) , when multiple observers conduct the counts (Nichols et al. 2000) , or when the timing of detections is recorded (Farnsworth et al. 2002) . However, for standard point counts that do not include collection of such ancillary data, when distance measurements are imprecise, or when there is ambiguity in the number of unique birds seen, inference about abundance is not really possible without very restrictive assumptions about stationarity of detection probabilities (e.g., see Nichols et al. 2000 , Anderson 2001 , Rosenstock et al. 2002 . However, repeat point counts at sample locations with associated records of presence-absence could be used with occupancy models in order to provide reasonable inferences about the proportion of the area occupied by species. In these examples of avian and amphibian surveys, presence-absence will be ascertained by visual or auditory detection of animals. In the case of some secretive species of mammals, it may be reasonable to conduct occupancy surveys using automated remote detections (e.g., camera-trapping) or detections of animal sign (scats, tracks). For example, sign-based surveys of tiger occupancy of sample units will be much less expensive in time and effort than methods of abundance estimation based on detections of marked animals . The approach described in this paper uses the data from occupancy surveys to draw inferences not only about proportional occupancy of sample units, but also about abundance in some situations.\nWe believe that such occupancy surveys also will be useful in metapopulation studies involving multiple visits to many different sites among which animal movement is hypothesized. As noted in the Introduction, the proportion of patches occupied is the state variable of interest in many metapopulation models (e.g., Levins 1969 , 1970 , Lande 1987 , Hanski 1992 , 1997 . In association with metapopulation studies, substantial effort has been directed at parameterizing so-called ''incidence functions'' (Diamond 1975 , Hanski 1992 characterizing the probability of occurrence as a function of patch characteristics. The methods presented here provide a means of properly estimating occupancy probabilities and associated functional relationships when there is heterogeneity of detection probabilities associated with variation in abundances over patches or sampling units.\nIn addition to reasonable estimation of occupancy rates, the information on the distribution of abundances over sampling units may be very useful in metapopulation studies as well. Metapopulation models range from very simple to fairly complex. Under the simplest models (e.g., Levins 1969 Levins , 1970 , all patches are assumed to be equal with respect to the parameters governing patch occupancy dynamics, local colonization, and extinction probabilities. Perhaps the most detailed metapopulation models involve the use of structured multisite matrix models that model the abundance of each age or stage class at each location as functions of class-and location-specific vital rates and rates of movement (e.g., see Rogers 1966 , Le Bras 1971 , Schoen 1988 , Lebreton 1996 , Lebreton et al. 2000 . Models of intermediate complexity and detail include those of Gyllenberg and Hanski (1992) and Gyllenberg et al. (1997) , in which the abundance or population size of each patch is a state variable of interest. This is a very reasonable state variable, because extinction probability depends very strongly on abundance (e.g., Bailey 1964 , MacArthur and Wilson 1967 , Goel and Richter-Dyn 1974 , Gilpin and Soulé 1986 , Boyce 1992 , and dispersal and vital rates are frequently modeled as functions of abundance (density dependence) as well. The distribution of abundance over patches is one of the summary statistics used to characterize metapopulation systems under the models of Gyllenberg and Hanski (1992) and Gyllenberg et al. (1997) , which indeed predict an equilibrium abundance distribution. The methods presented in this paper provide a means of estimating this distribution and thus yield opportunities to test model predictions.\nIt is often the case that little additional information beyond simple presence-absence is available. In such cases, reduction of data to presence-absence may be appropriate or may entail little loss of information. For example, even when counts of organisms are made (such as in avian point counts), it may not be possible to determine the number of unique individuals that were observed due to movement of individuals or imprecise locational information. A second example, mentioned previously, is that of anuran surveys, in which it is often very difficult to generate a useful ordinal measure of abundance beyond simple presence or absence. Thirdly, in carnivore scent station surveys, it is not always possible to determine the number of unique individuals that have visited a particular scent station. Finally, in the monitoring of rare organisms, or those that are difficult to detect, the detection of multiple organisms may seldom occur. Consequently, even in problems where additional information may be available in the form of counts or similar statistics, it is often not clear how such information can be brought to bear in a rigorous manner toward assessing questions having to do with occupancy. This is not to say that we recommend collecting only presence-absence data where it is possible to collect other types of information. In fact, we strongly discourage such methods, as techniques may evolve that allow for such information to be used. However, at this time no general methods exist for dealing with every type of data that biologists might collect regarding abundance. Our method provides abundance estimates from presence-absence data that may be collected directly or obtained by reduction of other information to presence-absence data.\nAlternative latent abundance models.-In our development and analyses, we have considered models for the latent distribution of p i based on parametric forms implied by Poisson and negative binomial distributions on abundance. Thus, the latent p i distribution has support on the integers 1 Ϫ (1 Ϫ r) k ; k ϭ 0, 1, 2, . . . , with probabilities f k proportional to the Poisson (or negative binomial) density. The benefit of this approach is that there are only two (or three) parameters to be estimated, and the number of parameters does not increase with the number of support points considered, in contrast to the ''nonparametric'' approach of Norris and Pollock (1996) . In addition, the parametric approach seems to be the most logical modeling approach for this problem because the distribution structure of p i is entirely a consequence of that on site-specific abundance. Nevertheless, one could adopt a nonparametric approach, choosing to estimate both the support points and their masses with no imposed ''ultrastructural'' relationships, consistent with the approach of Norris and Pollock (1996) . However, in doing so, the number of support points that can be considered is severely limited by the number of sampling occasions. Such nonparametric estimation can lead to bias in the parameter estimates, and hence abundance estimation, depending on the coarseness of the finite approximation to the true distribution of N. Nevertheless, this approach may be preferred when assumption of parametric forms is not desirable. It is not clear, however, whether or not sufficiently complex nonparametric finite mixtures may be estimated from simple presenceabsence data.\nWe have given only brief consideration to the negative binomial model for N, which allows overdispersion relative to the Poisson assumption. Simulation results are encouraging, and suggest that the model parameters may be reasonably well estimated. However, our attempts to fit this model to avian point-count data were not satisfactory, resulting in flat likelihoods, highly correlated parameter estimates, and estimates that are at odds with our understanding of the problem. In short, the negative binomial parameters appear to be poorly identified by the BBS data considered. This is not necessarily an indictment of the negative binomial model, and may simply be due to small sample size estimation under that complex model, or additional pathologies in the data not considered here.\nWhere possible, we feel that extra-Poisson variation in site-specific abundance is best modeled with the aid of sensible explanatory covariates. The modeling framework presented here extends trivially to this situation, simply by specification of the log-linear model on site-specific means, i :\nFor amphibian or waterfowl surveys on wetland basins, an important covariate might be the area of the wetland being sampled. With sufficient additional information (x j 's), we think that most substantial overdispersion due to variation in abundance can be accounted for explicitly in this manner. One reviewer also suggested the use of quasi-likelihood to model overdispersion in abundance, which may be a viable approach. Additional analysis of the negative binomial and other approaches to modeling variation in detection due to variable abundance require further study.\nOur main reason for focusing on the Poisson model is its motivation as arising under a random distri-bution of individuals in space. Clearly, the negative binomial is an important generalization of this, allowing for (spatial) variation in mean abundance. Although the negative binomial is appealing for this reason, we question whether overdispersed models (relative to the Poisson assumption) are sensible in many contexts. For example, breeding birds, because they are territorial, are probably more likely to be distributed in space in a manner that suggests underdispersion relative to the Poisson model. Research in this regard is also needed.\nDesign considerations.-Successful application of our approach depends critically on the ability to characterize the variability in detection probabilities. There are many factors that affect this ability. One of the more important factors in this regard is the number of sampling sites. As with traditional applications of complex capture-recapture models allowing for heterogeneity among individuals, good performance of the estimators requires large sample sizes (i.e., many observed capture histories). This is often neglected in applications of capture-recapture methods because one cannot design a study to observe a desired number of individuals.\nOur simulation studies indicate little bias in the estimators of both mean abundance and occupancy rate under a range of conditions. We feel that our simulation studies encompass a broad range of practical sampling scenarios for monitoring programs and large-scale field investigations. We did not extensively investigate small-sample extremes because estimator performance under these situations is highly variable. In short, when heterogeneity exists as a result of variation in abundance, several hundred sample sites may be necessary to provide reasonable estimates of mean abundance and occupancy rate, although it may be possible to realize success with many fewer. Precise guidance is very sensitive to context. In general, because the essence of any occupancy study is a binomial sampling model (occupied or not), sample sizes should be considered within this context.\nThe number of sampling occasions is also an important consideration. For the range of situations that we considered, T ϭ 5 may be adequate for many intents and purposes, but larger T can be advantageous when it is practical to achieve while still satisfying the closure assumption. Although abundance is not usually a controllable factor (unlike T and R), the mean site-specific abundance has important consequences for the performance of maximum likelihood estimators. If N is large, on average, then animals will be detected almost all of the time and no variability among the p i 's will be observed (unless r is very small). Thus, there will be little ability to characterize the distribution of abundances. Although this leads to an ''apparent constant-p'' situation for which the MacKenzie et al. (2002) method would be well suited, it also would suggest very high occupancy rates under the Poisson model. In such cases, one might consider alternative mixing distributions on abundance that allow more flexibility in occupancy rate, perhaps nonparametric finite mixtures. Alternatively, in problems where the size of the sample unit size can be controlled to some extent, this may allow some flexibility in the control of mean abundance. That is, mean abundance is scale specific, and the choice of sample unit determines the scale at which model parameters are defined. Conversely, very low ''mean abundance'' yields either N ϭ 1 or N ϭ 0, and this case is essentially that considered by MacKenzie et al. (2002) . These considerations lead to the recommendation to evaluate different designs using simulations tailored to anticipated sampling conditions.\nExtensions.-The proposed method applies to repeated point counts that may be reduced to detectionnondetection data. In general, however, there is some loss of information in reduction to binary data. For example, if one observes y it ϭ 2, then it is known that N i must be Ն2. This can be accounted for by generalizing the observation model to a product binomial likelihood. When mean abundance is low, which will tend to happen whenever the sampling unit is small in relation to animal density, we suspect that there will be little difference between the two approaches. Other types of sampling schemes, including common anuran monitoring programs, give rise to multinomial categories of abundance (e.g., none, few, many). The possibility exists for extracting abundance information from these data also, but the form of the likelihood (as it relates to abundance) is less clear in this instance. We are currently investigating these extensions in the context of several monitoring programs involving point counts of birds and waterfowl."}]