[{"section_title": "[Abstract]", "text": "Since early December 2019, a number of pneumonia cases associated with unknown coro navirus infection were identified in Wuhan, China, and many additional cases were identi fied in other regions of China and in other countries within 3 months. Currently, more tha n 80,000 cases have been diagnosed in China, including more than 3,000 deaths. The epid emic is spreading to the rest of the world, posing a grave challenge to prevention and cont rol. On February 12, 2020, the International Committee on Taxonomy of Viruses and the World Health Organization officially named the novel coronavirus and associated pneum onia as severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) and coronavirus disease 2019 (COVID- 19) , respectively. According to the recent research on SARS-CoV-2, the virus mainly infects the respiratory system but may cause damage to other systems.\nIn this paper, we will systematically review the pathogenic features, transmission routes, an d infection mechanisms of SARS-CoV-2, as well as any adverse effects on the digestive system, urogenital system, central nervous system, and circulatory system, in order to provide a theoreti cal and clinical basis for the diagnosis, classification, treatment, and prognosis assessmen t of SARS-CoV-2 infection.\n[Keywords] SARS-CoV-2; COVID-19; digestive system; urogenital system; central nervous sy stem; circulatory system oronavirus is highly homologous (96%) to the coronavirus that infects certain bats. Furth er alignment of seven conserved nonstructural viral proteins confirmed that the novel cor onavirus belongs to SARSr-CoV, the same genus of severe acute respiratory syndrome co ronavirus (SARS-CoV). Moreover, researchers have identified that the novel coronavirus enters cells via the same mechanism as SARS-CoV, by binding to angiotensin-converting enzyme 2 (ACE2), a receptor on the cell surface [1] . On January 24, the National Institute f or Viral Disease Control and Prevention, Chinese Centers for Disease Control and Preven tion, officially published the information on the first novel coronavirus strain, including s train type, electron micrographs, and sequences of primers and probes for detection of its nucleic acid by RT-PCR. On January 25, Chinese researchers published an article in the New England Journal of Medicine and formally identify the novel coronavirus as the seve nth member of the coronavirus family that can infect humans [2] . On January 30, the World Health Organization (WHO) held an official meeting and decided that the novel coronavi rus outbreak is a public health emergency of international concern. On February 12, the I nternational Committee on Taxonomy of Viruses and WHO officially named the novel co ronavirus and associated pneumonia as severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) and coronavirus disease 2019 (COVID-19), respectively.\nSince the outbreak, all levels of the Chinese government have taken strict prevention and control measures, but the situation is still grave. On February 8, Han et al published an ar ticle on the risk of SARS-CoV-2 infection in different human organs based on single-cell RNA sequencing technology. The results showed that ACE2 is expressed in many tissues, including heart, esophagus, ileum, kidneys, and bladder, at a level that is even higher tha n that in the alveolar cells, suggesting that SARS-CoV-2 may affect many systems [3] . The refore, besides the respiratory system, its potential targets may be the digestive system, ci rculatory system, urogenital system, and even the central nervous system. A study based o n a clinical sample showed that a small percentage of blood samples had positive PCR test result s(about 1%), suggesting that infection sometimes may be systemic [4] . Transmission of the SARS -CoV-2 by respiratory and extrarespiratory routes may help explain the rapid spread of COVID- 19 .In addition, the latest guidelines for diagnosis and treatment of COVID-19 from the N ational Health Commission (China) and other related study also showed that the detection of viral nucleic acids in blood is one of the important diagnostic criteria. It can be inferre J o u r n a l P r e -p r o o f d that SARS-CoV-2 can spread to other organs except the lungs through the blood route, but the specific mechanism needs to be further studied [5, 6] .\nIn this paper, we will review the pathogenic features, transmission routes, and infection mechanisms of SARS-CoV-2, as well as any adverse effects on the digestive system, urog enital system, central nervous system, and circulatory system, in order to provide a theoreti cal and clinical basis for the diagnosis, classification, treatment, and prognosis of SARS-CoV-2 infection and new directions for COVID-19 prevention and control."}, {"section_title": "Pathogenic features of SARS-CoV-2", "text": "SARS-CoV-2 is a β coronavirus (enveloped, single-stranded, positive-sense RNA virus), with an average diameter of 60 to 140 nm. The viral particles are oval or round with spike s. Its genetic information is encoded by nearly 29,000 ribonucleotides. The entire genome sequence of SARS-CoV-2 has been published on virological.org, nextstrain.org, and bio Rxiv. SARS-CoV-2 is highly homologous (> 85%) to a bat SARS-like coronavirus (bat-S L-CoVZC45) [7] . Like HIV gp120 protein, SARS-CoV-2 spike protein recognizes cell surf ace receptors, allowing the virus to enter cells; the difference lies in specific receptors an d target cells-SARS-CoV-2 binds to ACE2 and enters mucosal epithelial cells, while HI V binds to cluster of differentiation 4 (CD4) receptor and enters CD4 + T cells [8] . Research ers have determined how long it takes SARS-CoV-2 to enter cells by in vitro virus isolati on and culture-approximately 96 hours for SARS-CoV-2 to enter human respiratory epit helial cells and approximately 6 days for SARS-CoV-2 to enter cell lines such as Vero E6\nand Huh-7. SARS-CoV-2 does not attack T cells, CD4 + cells, or ACE2cells. Moreover, up to seven nucleotide variations are identified in the known SARS-CoV-2 sequence, sug gesting that SARS-CoV-2 did not attack humans until very recently."}, {"section_title": "Transmission routes of SARS-CoV-2", "text": "Like the pathogens of SARS and the Middle East respiratory syndrome (MERS), SARS-CoV-2 is a member of the coronavirus family, but it is genetically distinct from other co ronaviruses. According to the latest guidelines for diagnosis and treatment of COVID-1 9 from the National Health Commission (China), infected individuals are the main sour ce of SARS-CoV-2 infection, and some asymptomatic patients may be potential sources of infection. Respiratory droplets and close contact are the two most important routes of J o u r n a l P r e -p r o o f transmission. In closed spaces, prolonged exposure to a high concentration of SARS-Co V-2 aerosols may cause viral transmission [5] . Recently, the nucleic acid of SARS-CoV-2 h as been detected in fecal samples, suggesting that the digestive tract is a potential route of transmission, although further research is needed to validate this hypothesis."}, {"section_title": "Mechanism of SARS-CoV-2 infection", "text": "Based on SARS and MERS research and the latest SARS-CoV-2 sequence, these three coro naviruses capable of infecting humans share the same receptor (ACE2). The infection me chanism is shown in Figure 1 . ACE2, also known as ACEH, is a member of the angiotens in-converting enzyme (ACE) family of dipeptidyl-carboxydipeptidase and is highly homo logous to ACE1. ACE1 and ACE2 convert angiotensin 1 into angiotensin (Ang) 1-9 and a ngiotensin 2 into Ang 1-7. ACE2 has high affinity to Ang II type 1 and type 2 receptors a nd plays an important role in many physiological functions, such as cell proliferation and hypertrophy, inflammatory response, blood pressure, and fluid balance. ACE2 is specifica lly expressed in certain organs and tissues, suggesting that it plays an important role in re gulating cardiovascular, renal, and reproductive functions [9, 10] In another study, the ACE2 protein level was determined in human organs and tissues, including respiratory mucosa, lung, stomach, sm all intestine, colon, skin, lymph nodes, thymus, bone marrow, spleen, liver, kidney, and b rain. The results showed that ACE2 is abundantly expressed in the lungs and small intesti ne and is highly expressed in endothelial cells and smooth muscle cells of virtually all or gans. Therefore, once in the circulatory system, SARS-CoV-2 is likely to spread via blood fl ow [11] . These data suggest that SARS-CoV-2 not only affects the respiratory system but is also a potential threat to the digestive system, urogenital system, central nervous system, and circulat ory system. s that could bind to the entry receptor ACE2. It is worth noting that in cytoplasm of gastric, du odenal and rectal epithelium, the expression of viral nucleocapsid protein is visualized [12, 13] .. ifestation. This suggests that clinicians should pay attention to suspected patients who ha ve diarrhea [14] . Lan and Cai performed RNA sequencing and found high, specific ACE2 ex pression in bile duct cells, suggesting that it is important to monitor liver function of SAR S-CoV-2 patients, especially liver indicators involving bile duct function. In case of liver d ysfunction, targeted treatment and care should be given in a timely manner [15] . and complement activation [16] . Therefore, ACE2-mediated SARS-CoV-2 infection may be a double-edged sword with respect to susceptibility and immunity.\nIn summary, during clinical diagnosis and treatment of patients with SARS-CoV-2 infecti on, clinicians should pay attention to patients who present digestive symptoms (especially diarrhea) as the initial symptoms. Moreover, should diarrhea or other related symptoms o f intestinal infection arise during treatment, the patient should receive prompt integrative treatment as needed, including anti-diarrhea therapy, hydration, correction of electrolyte disturbance, and antiviral therapy. In addition, because the virus and antiviral therapy ma y cause liver damage, patients should be closely monitored for liver function and receive liver-protective therapy as needed."}, {"section_title": "SARS-CoV-2 and the urogenital system", "text": "SARS-CoV-2 shares the same receptor as SARS-CoV. A retrospective analysis found that among SARS patients, the proportion of patients with acute renal insufficiency (ARI) wa s low but the mortality rate was more than 90%. As a control, the researchers conducted a clinical study to assess kidney function in 59 patients with SARS-CoV-2 infection, inclu ding 28 severe cases and three deaths. The results showed that 19% of the patients had el evated serum creatinine, 27% had elevated urea nitrogen, and 63% had urine protein (+ to ++). Kidney CT was abnormal in all the patients [17] . In addition, three separate clinical st udies in six, 41, and 99 patients with SARS-CoV-2 infection, respectively, showed that b esides severe respiratory dysfunction, 3% to 10% of the patients had renal insufficiency, and 7% had acute kidney injury [18] . Zhong et al showed that viral nucleic acid was isolated f rom the urine samples of SARS-CoV-2 patients. These data indicate that the incidence of ki dney dysfunction is high after SARS-CoV-2 infection. The bladder may also be affected an d may ultimately lead to multiple-organ failure and death. ACE2 mRNA and protein levels are higher in testis than in any other organ. The research ers surmise that SARS-CoV-2 binds to ACE2 to affect the kidneys and testis and subsequ ently causes their dysfunction [18] . Wang et al found that ACE2 was predominantly enriche d in spermatogonia and Leydig and Sertoli cells. Gene Set Enrichment Analysis (GSEA) i ndicated that Gene Ontology (GO) categories associated with viral reproduction and trans mission were highly expressed in ACE2-positive spermatogonia, but terms which related to male gamete generation showed significantly low expression [19] . Both viral infection an d antiviral therapy have potential nephrotoxicity and may cause kidney injury. Therefore, SARS-CoV-2 patients should be closely monitored for fluid and electrolyte disturbance a nd kidney function and receive specific targeted treatment and care as needed. Patients wi th chronic renal insufficiency should undergo hemodialysis or renal replacement therapy i f necessary to facilitate metabolic waste removal. In addition, the virus may affect testicu lar tissue, and clinicians should assess the risk of testicular lesions in younger patients du ring the hospital treatment and follow-up and provide prompt prevention and treatment fo r potential SARS-CoV-2-related reproductive injury. [20] SARS-CoV-2 may infect the central nervous system(CNS), as the viral nucleic acid has b een detected in patient's cerebrospinal fluid and brain tissue from autopsy. As for the route of virus entering the CNS, the blood route still needs to be further verified due to the existence o f blood-brain barrier. But on the other hand, neuronal pathway is important vehicles for neurotro pic viruses to enter the CNS. Viruses can migrate after infecting sensory or motor nerve endings."}, {"section_title": "SARS-CoV-2 and the central nervous system", "text": "Under the action of motor proteins, dynein and kinesins, the viruses can achieve neuronal transp ort in a way of retrograde or anterograde. Here's a classic example. Based on the unique anatomi cal structure of olfactory nerves and olfactory bulb, it becomes a channel between the nasal epith elium and the CNS. In the early stages of SARS-CoV-2 infection of the respiratory system, Olfac tory tract becomes an important channel for virus transmission to brain. In addition to the above r esearch, an Gu et al study of gene sequences in neurons in the brain showed that coronavirus can invade the CNS from the periphery through neural pathways [21, 22, 24] ."}, {"section_title": "J o u r n a l P r e -p r o o f", "text": "In addition, as the life center of human body, the brainstem controls vital functions such as heart beating, blood pressure maintenance and respiration. Studies have shown that some coronaviruse s can invade brainstem via a synapse-connected route from the lungs and airways. The potential i nvasion to CNS of SARS-CoV-2 may be one reason for the acute respiratory failure. Therefore, i t is of great significance for the treatment of severe patients to clarify the disease mechanism of p atients with respiratory failure clinically whether it is caused by pulmonary lesions or viral infect ion of the brainstem [23] .\nSome confirmed cases present with specific headache, epilepsy, and confusion, which are similar to symptoms of intracranial infection. In some cases, intracranial infection-relate d symptoms have been the initial symptoms, coming before the symptoms of pulmonary i nfection, such as cough, fever, and dyspnea. Therefore, for suspected SARS-CoV-2 cases with intracranial symptoms, plain and enhanced brain magnetic resonance imaging and lu mbar puncture (SARS-CoV-2 nucleic acid test on cerebral spinal fluid) are essential. For SARS-CoV-2 patients with intracranial symptoms, early treatment should be given to in a ddition to routine anti-infective therapy, including rehydration (reduce intracranial pressu re), nerve nourishment, epilepsy prevention, and acid suppression. rain and excessive accumulation of acid metabolites, relevant clinical manifestations will appear such as swelling of brain cells, interstitial edema, obstruction of cerebral blood flow, headache d ue to ischemia and congestion and even a coma. Additionally, previous studies showed that when coronavirus attacked primary glial cells, a large amount of inflammatory factors such as IL-6, IL -12, IL-15, and TNF-α after being infected were released. This is also one of the pathophysiologi cal processes of CNS damage caused by inflammatory factors [21, 23] ."}, {"section_title": "SARS-CoV-2 and the circulatory system", "text": "Huang et al showed that five of the 41 patients first diagnosed with SARS-CoV-2 infection in Wuhan, China, had viral myocarditis, mainly manifested as elevated hs-cTnl. Among them, four patients developed severe conditions, accounting for 31% of all severe cases. The mean systolic blood pressure was significantly higher in severe cases than in nonsevere cases (145 mm Hg vs 1 22 mm Hg). Clinical data show that an increasing number of SARS-CoV-2 patients present circ ulatory symptoms (palpitations, chest tightness, short of breath) as the initial symptoms [25] . On Ja nuary 23, the National Health Commission (China) released a report on 17 deaths, which shows t hat two patients had no underlying cardiovascular disease but developed apparent cardiac sympto ms after the diagnosis of SARS-CoV-2 infection. One patient had changes in the ST segment o n electrocardiogram and persistent abnormal myocardial enzymes, and one patient had sudden pr ogressive decline in heart rate and undetectable heart sounds.\nHou et al published an analysis of 84 cases of SARS-CoV-2 infection, which showed that eleva ted creatine kinase and creatine kinase isoenzyme MB during treatment is a sign of severe con dition and disease progression. After SARS-CoV-2 infection in humans, immune disorders exac erbate the inflammatory response, which directly or indirectly leads to high risk of cardiovascula r symptoms and diseases.\nAt present, researchers believe that three mechanisms may be involved in how SARS-CoV-2 in fection induces acute myocardial injury. First, the virus infects the heart and causes myocardial injury directly. Second, Xu et al showed that SARS-CoV-2 binds to highly expressed ACE2 rec J o u r n a l P r e -p r o o f eptors in the cardiovascular system to cause myocardial injury via certain signaling pathways [26] .\nThird, Huang et al showed that in SARS-CoV-2 patients, Th1/Th2 imbalance triggers cytokine cascade, and the release of a large amount of cytokines causes myocardial injury [25] . In addition, hypoxaemia and respiratory dysfunction instigated by SARS-CoV-2 may also cause damage to myocardial cells. Meanwhile, plasma high-sensitivity C-reactive protein (hsCRP) is one of the most classical inflammation markers, as well as levels of cytokines linked to cardiovascular risk, are also related to adverse outcomes and could be some potential biomarkers to assess the diseas e progression [27, 28] . Since the recent outbreak, cytokine cascades have been observed in many severe SARS-C oV-2 cases [25, 29] . Figure 2 shows the mechanism of cytokine cascade, also known as an infl ammatory cascade. Pathogen infection triggers an intense immune response and inflamma tory response and rapid release of a large amount of cytokines (such as tumor necrosis fac tor-α, interleukin (IL)-1, IL-6, and interferon-γ (IFN-γ) ). In this context, patients with vir al infection are particularly susceptible to acute respiratory distress syndrome and multipl e-organ failure. Cytokine cascades and low lymphocytes are also specific in other severe coronavirus diseases (such as SARS and MERS) and are positively related to disease prog ression and severity [30] [31] [32] . Recent studies have confirmed this conclusion, showing low lym phocytes and elevated inflammatory cytokines in most SARS-CoV-2 cases [33, 34] . Once trig [6] ."}, {"section_title": "Conclusion and outlook", "text": "While SARS-CoV-2 is highly infectious, with a basic reproduction number (R0) of 3.77 (for S ARS, R0 = 3-5) [35, 36] , most cases are mild, and the overall mortality is low. Based on cur rent data, the mortality rate is higher in patients aged 60 or above and in patients with un derlying diseases such as hypertension, diabetes, and cardiovascular disease. At present, a lthough epidemic prevention and control efforts have achieved remarkable results in China, SAR S-CoV-2 is emerging as a pandemic world-wide. In addition, although Wuhan was the \"place of discovery\" of SARS-CoV-2, it was probably not the \"place of origin\". Many recent studies have shown that there are many possibilities for the origin of this virus [37] [38] [39] . Moreover, gene sequence analysis has proved that patients with SARS-CoV-2 infection in some countries had no history of exposure to Wuhan, and the relevant virus had no homology, with significant differences [40, 41] . S ARS-CoV-2 is a novel coronavirus, and we are still trying to understand how it spreads a nd causes disease, which makes it more challenging to prevent and control the epidemic [42, rus affects many other systems in humans as well. This complicates potential clinical man ifestations and makes it harder to treat such cases [45, 46] . However, with a deeper understand ing of this virus from biomedical research and epidemiological observation, researchers will know more about how SARS-CoV-2 damages the respiratory system, circulatory syst em, digestive system, urogenital system, and central nervous system in the near future, w hich will provide important clues to etiologic research, diagnosis, differential diagnosis, t reatment, and prognostic assessment. When developing the treatment plan for SARS-CoV -2 patients, it is important to perform a comprehensive assessment of vital organ function and provide symptomatic treatment. Specifically, patients should be monitored for liver a nd kidney function and receive supportive care as needed, in order to reduce the risk of in flammatory cascade and improve overall treatment outcomes. In addition, it is important t o investigate the structural and functional variation and patterns of SARS-CoV-2 to inves tigate its molecular mechanisms in different organs and look for potential targets or recep tors in order to aid in the development of vaccines and screens of antiviral drugs. Table 1 lists some traits of known coronaviruses as a reference for researchers. The homology of S ARS-CoV-2 and the common poultry coronavirus genome is 40.3 % ~ 51.7 %, and that of the c ommon poultry β-coronavirus genome is 49.5 % ~ 51.7 %, indicating that the homology of com mon poultry coronavirus and SARS-CoV-2 is less than 52%, showing a distant relationship. The results of S protein analysis showed that the homology of S-protein gene sequence of SARS-Co V-2 and common poultry coronavirus was 37.1% ~ 46.2%, and the homology of S-protein amino acid sequence was very low, less than 31% [47] [48] [49] . In addition, since the genomic homology betwe en SARS-CoV-2 and poultry coronavirus is only about 50%, it can be considered that cross-spe cies infection is difficult to achieve. Overall, in terms of susceptibility, except for the seven coro naviruses that can infect humans, poultry or other host-related coronaviruses appear to be less su sceptible to human disease in the present study [50, 51] .\nWe believe that with concerted efforts among the government, healthcare professionals, a nd biomedical researchers, the COVID-19 epidemic will be brought under control in the n ear future. The treatment outcomes of confirmed cases will improve, and the mortality of critical cases will decrease. We will win this battle against this epidemic that affects not only the population of 10 million in Wuhan but the rest of the world as well. We sincerel y appreciate the sacrifice and efforts of front-line healthcare professionals. "}, {"section_title": "Availability of data and materials", "text": "The datasets used and analysed during the present study are available from the corresponding aut hor on reasonable request."}, {"section_title": "Authors' contributions", "text": "YHZ and XCG were the major contributors to the writing and revision of the manuscript. YLT, QL and CX collected the related references and participated in discussions. JLX, LCH and ZMZ revised this article critically for important intellectual content. XPL provided help in the producti on of manuscript figures. FLL and HW gave approval for the final version of the manuscript. "}]