[{"section_title": "fluorodeoxyglucose (FDG) PET, CSF total tau (t-tau), and neurofilament light (NfL) (N).", "text": "Although Aβ and tau deposits define AD pathology, a significant degree of copathology is common in patients with AD. In addition, multiple pathological processes co-occur in AD, including inflammation and innate immune response, synaptic and vascular dysfunction, or blood-brain barrier (BBB) impairment ( Figure 1 ). Successful treatment of AD may require the targeting of several pathological processes. Therefore, there is a clear need for suitable biomarkers to track pathological processes and detect concomitant pathologies, diagnose more accurately, assess prognosis, monitor treatment response, test target engagement, and to stratify participants in research studies and clinical trials. CSF biomarkers are widely used in research and clinical practice but lumbar puncture, despite being a well tolerated procedure with a very low rate of adverse effects, is still an invasive procedure. 4 Therefore, increasing efforts have been made in recent years to develop biomarkers in more accessible biological matrices including urine, saliva, and blood. 5, 6 The development of blood biomarkers has become a priority in the AD field and several new developments have occurred over the last few months.\nIn this review, we will examine the current status of AD biomarkers in CSF and blood (Table 1 and Figure 1 ). Because recent evidence suggests that sex, gender, or both can have an influence on different aspects of AD, we also briefly discuss their effects on fluid biomarkers."}, {"section_title": "Aβ pathology", "text": "Aβ peptides are generated physiologically by the sequential cleavage of the amyloid-β precursor protein (APP), a type 1 transmembrane protein. APP can be cleaved by two pathways. The amyloidogenic pathway comprises the cleavage by the β-secretase enzyme (β-site APP-cleaving enzyme 1, BACE1) generating the β soluble N-terminal fragment of APP (sAPPβ) and the APP carboxy-terminal fragment (βCTF). βCTF is subsequently cleaved in the membrane by γ-secretase and results in Aβ peptides of variable lengths and the amyloid precursor intracellular domain (AICD). The 40-amino acid form (Aβ40) is the predominant type in the brain in physiological conditions, but the 42-amino acid Overview of the main AD-related fluid biomarkers. The table depicts the changes observed in AD (prodromal, dementia, or both) compared with controls as follows: ↑ increased or ↓ decreased levels in most or all studies; = no changes; ≈ inconsistent results; ○ unknown; NA not applicable. To complete these table, we reviewed all studies available in AlzBiomarker (https://www.alzforum.org/alzbiomarker) for GFAP, MCP-1, neurogranin, NfL, sAPPα, sAPPβ, sTREM2, VILIP-1, YKL-40. For Aβ, t-tau, and p-tau we reviewed those studies in AlzBiomarker with a total number of patients >300. We also included other biomarkers not available in AlzBiomarker that we, however, found relevant for AD. form (Aβ42) is the predominant type in amyloid plaques. 7 The AICD may act as a transcriptional regulator of several target genes and is thought to contribute to AD pathology. 8, 9 The nonamyloidogenic pathway comprises the cleavage by α-secretase resulting in the α soluble N-terminal fragment of APP (sAPPα) and the APP carboxy-terminal fragment (αCTF).\nα CTF is cleaved by γ-secretase that generates a p3 fragment and an AICD fragment. 7, 10, 11 Of note, Aβ pathology is highly associated with the APOE genotype. Individuals carrying APOE-ε4 develop more amyloid plaques when they age. 12, 13 The APOE-ε4 allele decreases the brain clearance of Aβ, triggering its aggregation. 14 In addition, the APOE-protein can bind Aβ, but its affinity differs between the three APOE isoforms. Thus, it is important to interpret amyloid-related biomarkers in the context of the APOE genotype. 15, 16 Aβ peptides CSF Aβ42, in combination with t-tau and p-tau, constitutes the widely accepted CSF signature for AD diagnosis. CSF Aβ42 has a high diagnostic accuracy to discriminate between AD and controls and, in addition, it is helpful for distinguishing AD from other neurodegenerative diseases. More importantly, CSF Aβ42 allows us to identify AD in its preclinical stage. CSF Aβ42 accurately predicts disease progression in cognitively unimpaired individuals and in those with mild cognitive impairment (MCI). 17 In contrast with amyloid PET, CSF Aβ42 plateaus early in the disease progression. 18, 19 Despite the high agreement between amyloid PET and CSF Aβ42, there are some conflicting results that may be due to the fact that CSF Aβ42 reflects a biological process preceding the aggregation of Aβ detected with amyloid PET. 20 Recently, optimal centiloid cut-offs have been defined maximizing the agreement between the PET and CSF levels of Aβ42. 21 However, the use of CSF Aβ42 can be limited by the impact of pre-analytical factors and by interindividual differences in Aβ production. These limitations can be partially overcome by normalizing Aβ42 values with Aβ40. Aβ40 does not change in AD and its concentration in CSF is 10-times higher than that of CSF Aβ42 and can, therefore, be used as a 'proxy' of total Aβ levels. The CSF Aβ42/Aβ40 ratio appears to be a better predictor of amyloid PET positivity in prodromal AD and performs better at distinguishing AD from other dementias than CSF Aβ42 alone. 22, 23 Similar to CSF Aβ40, CSF Aβ38 does not vary between AD and controls and the CSF Aβ42/ Aβ38 ratio shows a comparable predictive potential to that of the CSF Aβ42/Aβ40 ratio. 22 Increasing efforts are focusing on the measurement of blood Aβ. Most previous studies demonstrated inconsistent results and a lack of correlation between CSF and blood Aβ. [24] [25] [26] That was probably due to the fact that Aβ concentration in blood is low 27 and Aβ measurements were affected by matrix effects. However, recent studies using ultrasensitive assays are very promising. Aβ has been measured in blood using the Simoa platform, 28, 29 immunoprecipitation coupled with mass spectrometry (IP-MS) [30] [31] [32] and stable isotope labeling kinetics followed by IP-MS. 33 . These studies have shown that blood Aβ42, Aβ42/Aβ40 ratio, or both, correlate with those in CSF and with amyloid PET. [31] [32] [33] They have also shown that Aβ42, Aβ42/Aβ40 ratio, or both differ between AD and controls or other diagnostic groups, although the magnitude of the difference is smaller than that found in CSF. The xMAP technology has been used to measure Aβ42/Aβ40. While a study demonstrated that Aβ42/Aβ40 could not predict AD, 34 other studies showed that pretreatment of plasma with a mixture of protease and phosphatase inhibitors may help to detect amyloid positive individuals. 35 37 Other Aβ pathology biomarkers Soluble fragment sAPPα or sAPPβ can be readily measured in CSF, but results are conflicting with regards to differences between AD and controls, or between progressive MCI and stable MCI. [38] [39] [40] [41] However, sAPPβ may be used as a target engagement biomarker of BACE inhibitors. BACE1 activity, or its protein levels, can be measured in CSF but there are some inconsistencies in the results for AD patients. Most studies showed an increase on BACE1 (either activity journals.sagepub.com/home/tan 5 or protein levels) in AD compared with controls. [41] [42] [43] In addition, patients with MCI appear to have higher levels of BACE1 activity and protein levels compared with controls or AD patients, and BACE1 has been shown to be a good progression marker in MCI patients. 44 However, other studies have reported different results, including no differences in BACE1 activity between controls, MCI and AD, or even decreased CSF levels in AD compared with controls. 45 53, 54 In addition, it is important to note that t-tau is measured using antibodies against the mid-domain, and there are other truncated tau forms in CSF that are being investigated.\nIn contrast, CSF p-tau is considered to be a biomarker of tau deposition in AD. In fact, CSF p-tau appears normal or only slightly increased in most of the other neurological diseases. Thus, CSF p-tau is a more specific biomarker for AD.\nIn the recently published AT(N) system, 2 CSF t-tau and p-tau, account for neurodegeneration (N) and tau pathology (T), respectively. However, these two biomarkers are highly correlated and it is difficult to determine which component of each biomarker reflects neurodegeneration and tau pathology. Phosphorylation at threonine 181 (p-tau 181 ) is the most widely used target as a p-tau biomarker in the clinical setting and increases very early in the AD continuum, even before tau PET becomes positive.\nOther tau species are increased in AD, including those phosphorylated in other mid-domain residues (threonine 231, serine 199, and 231) and C-terminal residues (Serine 396 and 404). 55 Of note, the abundance of several other phosphorylation sites in tau differs in the brain and CSF of individuals with and without AD. 56 In addition to being validated diagnostic markers of AD, CSF t-tau and p-tau are useful biomarkers to stage the disease, predict its prognosis, and monitor drug response. Tau deposition follows disease progression more effectively and has a stronger correlation with cognitive status than Aβ. 57,58 However, longitudinal studies have shown that CSF t-tau and p-tau, and other neurodegeneration markers, may decrease in advanced stages of the disease. CSF t-tau and p-tau have been shown to be good predictors of progression from cognitively unimpaired to MCI and progression to AD dementia. 17 CSF t-tau and p-tau are normally monitored in clinical trials, but the association between these biomarkers and the therapeutic response remains unclear.\nSimilarly to blood Aβ, the introduction of ultrasensitive immunoassays now allows the reliable measurement of tau in blood. Before this, most studies showed considerable variability in results. 26 Using the ultrasensitive techniques, several groups have shown an increase in blood t-tau in AD compared with controls, 59-62 but the overlapping values between groups precludes their use as a diagnostic tool. In addition, plasma t-tau predicts cognitive decline and the risk of dementia. 59, 60, 63 The measurement of blood p-tau is technically challenging but promising results are being produced. Higher plasma or serum p-tau 181 "}, {"section_title": "Neuronal injury", "text": ""}, {"section_title": "NfL", "text": "Neurofilaments are intermediate filaments that are abundant in neuronal axons. Among the neurofilaments, NfL has the most promising results as a biomarker. NfL leaks into the CSF after neuronal and axonal damage. CSF NfL increases in multiple neurological diseases and is widely accepted as a nonspecific biomarker of axonal injury. [68] [69] [70] Of note, this increase is more prominent in the neurological diseases where there is axonal degeneration, white matter injury, or both, including amyotrophic lateral sclerosis (ALS), FTLD, and CJD.\nThe development of ultrasensitive techniques enables the accurate measurement of NfL in blood. Blood NfL levels closely correlate with those of CSF. 71, 72 Therefore, blood NfL can be considered to be a noninvasive proxy of CSF NfL. Plasma or serum NfL levels are increased in AD and MCI compared with controls and in other neurological diseases. [72] [73] [74] [75] More importantly, blood and CSF NfL levels increase many years before the symptom onset in autosomaldominant AD, [76] [77] [78] and in Down syndrome. 79 In addition, CSF and blood NfL are associated with disease severity markers including brain atrophy, glucose hypometabolism, and cognitive impairment, which favors its use as a disease staging biomarker. 71, 80 Finally, increasing agreement favors the use of NfL, instead of t-tau, as an independent marker of neurodegeneration 'N' in the AT(N) classification for AD. 3 Visinin-like protein 1 Visinin-like protein 1 (VILIP-1) is a calcium sensor protein that is highly expressed in neurons. 81 Intracellular VILIP-1 expression is decreased in AD, especially in the entorhinal cortex. 82 VILIP-1 in CSF is correlated with t-tau and p-tau, supporting the theory that VILIP-1 is a neuronal injury biomarker. 83 Most studies, except one 84 have shown that VILIP-1 is increased in AD compared with controls, 26, 83, 84 . Further studies have suggested that it could help to differentiate AD from other dementias. [85] [86] [87] In addition, VILIP-1 has been shown to predict cognitive impairment and atrophy rates and to identify the MCI individuals that will progress to AD dementia. 84, [87] [88] [89] Longitudinal measurements in late-onset AD and autosomal-dominant AD have shown that the initial increase in CSF VILIP-1 is ameliorated as dementia develops, similar to what happens with other neural injury markers including CSF t-tau. 90, 91 Studies on blood VILIP-1 are limited, but a significant increase in plasma VILIP-1 has been reported in AD compared with controls. 87 In autosomal-dominant AD mutation carriers, VILIP-1 was also found to be increased but this finding did not not reach statistical significance. 90 "}, {"section_title": "Synaptic dysfunction", "text": "Synapse dysfunction and eventual synapse loss is an early process in AD pathogenesis. 92, 93 Pathological studies have demonstrated that synapse loss is closely associated with cognitive impairment. 94, 95 Synaptic biomarkers can be classified as presynaptic (axonal) and postsynaptic (dendritic) biomarkers. The main presynaptic biomarkers are synaptotagmin-1, synaptosomalassociated protein 25 (SNAP-25), and growthassociated protein 43 (GAP-43), and the main postsynaptic biomarker is neurogranin."}, {"section_title": "Synaptotagmin-1", "text": "Synaptotagmin-1 is a calcium sensor protein located in the presynaptic plasma membrane that is involved in the exocytosis of synaptic vesicles and the release of neurotransmitters. 96 Synaptotagmin-1 was first detected in the CSF in the late 1990s. 97 A later study, using mass spectrometry, showed that CSF synaptotagmin-1 was increased in both MCI and dementia due to AD. Of interest, higher levels were found in MCI due to AD. 98 "}, {"section_title": "SNAP-25", "text": "SNAP-25 is a component of the SNAP receptor (SNARE) complex located in the synaptic vesicles where it plays a key role in their exocytosis. 99 CSF SNAP-25 is significantly increased in prodromal and AD dementia compared with controls. 100 To date, to the best of our knowledge, no data is available on blood SNAP-25 in AD."}, {"section_title": "GAP-43", "text": "GAP-43 is a presynaptic protein involved in neuronal development and synaptogenesis in the adult brain. It is mainly expressed in the hippocampus, entorhinal cortex, neocortex, cerebellum, and olfactory bulb. 101, 102 CSF GAP-43 is increased in AD patients compared with controls and, importantly, compared with other neurodegenerative diseases. Therefore, it is a potential specific biomarker for AD-associated synaptic dysfunction. 103, 104 There is a lack of studies on blood GAP-43 in AD."}, {"section_title": "Neurogranin", "text": "Neurogranin is a postsynaptic protein that is highly expressed in the dendritic spines of the hippocampus, amygdala, caudate, and putamen. It binds the calcium-binding protein calmodulin (CaM) and regulates calcium signaling and synaptic plasticity. 105 CSF neurogranin is increased in AD and MCI. It is also increased in progressive compared with stable MCI, and predicts cognitive decline in cognitively unimpaired individuals. 26, 68, [106] [107] [108] More importantly, CSF neurogranin is specific for AD, reinforcing the view that synapses, in particular, are affected in AD. In addition, high levels of CSF neurogranin are found in CJD. 109 Unexpectedly, a study in the Alzheimer's Disease Neuroimaging Initiative (ADNI) cohort found a longitudinal decrease of CSF neurogranin in AD patients. 91 Studies of blood neurogranin are limited and they have not reported significant differences between AD and controls. 26 Emerging synaptic biomarkers Synaptic markers are a current area of intensive research in the AD field and some interesting results are being produced. "}, {"section_title": "Vascular dysregulation", "text": "Cerebrovascular disease and AD share multiple risk factors and concomitant cerebrovascular disease is more frequent in AD than in any other neurodegenerative disease. 113 In fact, vascular dysregulation has been proposed as a causative factor for AD 114 and, in addition, recent studies have proposed that vascular dysfunction is the earliest event in the sequence of pathogenic events that occur in AD. 115, 116 Alterations in the integrity of the blood-brain barrier (BBB) are related to the pathogenicity of AD and other dementias. 117, 118 From the fluid biomarker perspective, the CSF/serum albumin ratio has been the standard measure of BBB function in clinical routine practice. 119, 120 However, measurement of CSF/serum albumin ratio in AD has produced conflicting results and the meta-analysis by Olsson and colleagues found a minor but statistically significant increase in AD compared with controls. 26 A large population study from the Swedish Dementia Registry observed an increase in the CSF/serum albumin ratio in late-onset AD that was even higher in DLB, VaD, and mixed dementia. The CSF/serum albumin ratio was associated with CSF NfL but not with AD CSF core biomarkers, suggesting that BBB damage is not a specific feature of AD. 121 Other biomarkers that have been proposed to reflect BBB integrity include tight junction proteins, the proinflammatory cytokine CypA, MMP-9, and blood-derived fibrinogen and plasminogen. 122 In addition, the CSF soluble plateletderived growth factor receptor-β (sPDGFR-β) has been proposed as a marker of pericyte breakdown. 117, 123 The endothelial markers, vascular cell adhesion molecule-1 (VCAM-1), and intercellular adhesion molecule-1 (ICAM-1) have been studied in AD. Previous investigations of CSF and blood VCAM-1, and ICAM-1 have produced conflicting results, but a recent study found that the CSF levels of these biomarkers were increased in preclinical, prodromal, and dementia stages of AD, and correlated with CSF tau, Aβ, cortical thinning, and subsequent cognitive deterioration in nondemented patients. 124 In addition, the same study found that an increase in CSF IL-15 and Flt-1, which are proteins also related to vascular dysfunction and inflammation. Blood levels of VCAM-1 are increased in AD and vascular dementia patients compared with elderly controls. 125, 126 Inflammation Inflammation and innate immunity play a crucial role in AD pathogenesis from the very early stages. [127] [128] [129] Misfolded and aggregated Aβ and tau proteins bind to pattern recognition receptors on microglia and astroglia and trigger an innate immune response. 127 This inflammatory response is heterogeneous and may have a beneficial effect (e.g. clearance of Aβ and tau deposits, removal of cellular debris) 130 or, in contrast, a detrimental one (e.g. accelerated neurodegeneration). 131 In addition, the pattern of neuroinflammatory response may change throughout the AD continuum, exerting opposite effects at different stages. 132 Several inflammatory-related biomarkers are available but only help to determine partial aspects of the complex innate immune response. Thus, there is a need to develop and validate biomarkers, or combinations of them, that reflect different patterns of inflammatory response along the Alzheimer's continuum. Unfortunately, results on inflammatory-related biomarkers are inconsistent between studies. 133, 134 In this study we review the most promising ones."}, {"section_title": "Soluble triggering receptor expressed on myeloid cells 2", "text": "Triggering receptor expressed on myeloid cells 2 (TREM2) is an innate immune receptor of the immunoglobulin family that is expressed on the plasma membrane of myeloid lineage cells, including microglial cells in the central nervous system (CNS). TREM2 has multiple roles in microglia including migration, proliferation, cytokine release, phagocytosis, lipid sensing, APOE binding, and shielding of amyloid plaques. [135] [136] [137] [138] [139] [140] [141] Homozygous loss-of-function mutations in TREM2 cause Nasu-Hakola disease and FTD-like syndrome, that are rare neurodegenerative diseases characterized by an early-onset frontal syndrome and, in Nasu-Hakola disease, by a concomitant bone involvement. 142, 143 Low frequency coding variants in TREM2 have also been associated with an increased risk for AD 144, 145 and other neurodegenerative diseases. TREM2 is a type-1 transmembrane protein that is shed at the C-terminus of histidine 157 by ADAM10 and 17, and its soluble ectodomain (sTREM2) is released into the extracellular space 138, 146 and can be measured in CSF and blood. 138, 147 CSF sTREM2 may reflect the amount of TREM2 competent signaling on the surface of microglia and can, therefore, be used as a marker of the TREM2-mediated microglia response. However, to the best of our knowledge, it is still not known whether sTREM2 has a specific biological function other than acting as a decoy receptor opposing full-length TREM2 signaling.\nMost studies have reported increased levels of CSF sTREM2 in AD versus controls, 128,148-155 although this was not found in all studies. 138, 156 Further studies have demonstrated that CSF sTREM2 dynamically changes throughout the AD continuum and reaches a peak in the later asymptomatic stages and early symptomatic stages of late-onset AD and autosomal-dominant AD. 128,150,151,155 CSF sTREM2 is closely associated with tau-related neurodegeneration but not with Aβ pathology. 150 In addition, CSF sTREM2 increases in MS and other neuroinflammatory diseases, 147, 157 HIV1 infections, 158 in dementia patients with delirium, 159 and in those patients with a biomarker profile for suspected non-Alzheimer pathology (SNAP). 150, 151 This suggests that a TREM2-mediated microglial response occurs whenever there is neural injury, and not only in AD. Of note, CSF sTREM2 normalizes in MS after treatment with natalizumab or mitoxantrone, 157 which indicates that CSF sTREM2 may be used to test treatment response. In contrast, CSF sTREM2 has not been shown to be increased in HD, 160 FTLD, 138, 161 or in repetitive head impacts. 162 Despite the changes found in CSF sTREM2 in AD, there is a considerable overlap in the values between AD and controls that precludes its use as a diagnostic marker. However, there is one situation where sTREM2 may be useful for diagnostic purposes. Both CSF and blood sTREM2 are undetectable in patients with Nasu-Hakola disease and FTD-like syndrome. 138, 156 Individuals bearing low frequency TREM2 coding variants, in contrast, may have increased, decreased, or unchanged sTREM2 levels compared with noncarriers of these variants. 148, 150, 153, 163 A major question in this field is whether TREM2 has a beneficial or a detrimental effect. Human neuroimaging cross-sectional and longitudinal studies have shown that higher CSF sTREM2 is associated with increased gray matter volume and reduced diffusivity in early AD. 164, 165 More importantly, a recent longitudinal study in the ADNI cohort has demonstrated that in individuals with biomarker evidence of amyloid and tau pathology, regardless of the clinical syndrome, higher CSF sTREM2 at baseline is associated with an attenuated decline in memory and global cognition at follow-up. 130 In addition, common variants of the MS4A gene are associated with increased CSF sTREM2 concentrations. Of interest, these variants are additionally associated with reduced AD risk and delayed age at onset of disease. 163 Altogether, this suggests a beneficial effect of TREM2 function.\nIn contrast with CSF sTREM2, blood sTREM2 has been considerably less studied. No changes have been found in plasma or serum sTREM2 in MS, neuroinflammatory diseases, AD, FTD, or PD. 138, 147, 148, 153 Of interest, higher serum sTREM2 levels predict a higher risk of developing dementia in the Japanese population. 166 "}, {"section_title": "Progranulin", "text": "Progranulin is a secreted glycoprotein mainly expressed in activated microglia and, to a lesser extent, in neurons in the CNS. It contains 7.5 tandem repeats, that form the granulin domains. Proteolytic processing of full-length progranulin leads to the formation of individual granulins that are released into the extracellular space. 167, 168 Among other biological functions, progranulin and the granulins are involved in the modulation of neuroinflammation. Progranulin is best known for its relation to FTLD because loss-of-function mutations of the progranulin gene (GRN) cause FTLD-TDP. GRN mutation carriers have decreased blood and CSF progranulin levels. However, progranulin is related to AD because some GRN variants increase the risk for AD 169, 170 and studies in mice models have shown that progranulin has an impact in β-amyloid and tau pathology. [171] [172] [173] In addition, these GRN variants have an effect on blood and CSF progranulin levels but to a lesser extent than the FTLDrelated mutations. 170, 174, 175 Unlike FTLD, most studies had reported no differences in CSF progranulin levels between AD, MCI, and controls. [174] [175] [176] [177] However, a larger cross-sectional study carried out in the ADNI cohort demonstrated that CSF progranulin increases over the course of autosomal-dominant AD and late-onset AD and is associated with cognitive decline and markers of neurodegeneration. 178 Of note, higher CSF progranulin was associated with higher sTREM2 in AD but not in healthy controls. 178 This suggests that, when there is underlying pathology, microglia secrete sTREM2 and PGRN which, interestingly, may have opposing effects. 179 Results for blood progranulin are not very promising because no changes in AD have been found, 175, 180 and blood progranulin levels do not reflect progranulin levels in the brain. 174 Overall, CSF and blood progranulin are only useful diagnostic markers to screen GRN mutations in FTLD, but not in AD."}, {"section_title": "YKL-40", "text": "YKL-40, which is also known as chitinase 3-like protein 1 (CHI3L1) or human cartilage glycoprotein 39 (hCGP-39) is upregulated in several inflammatory diseases and cancers and its biological function may be related to remodeling during inflammation. 181 In the CNS there is an increasing amount of evidence suggesting that YKL-40 is predominantly an astroglial protein. 181, 182 In AD, CSF YKL-40 levels are associated with tau pathology and neuroimaging variables including cortical thickness in amyloid positive patients and gray matter volume in APOE-ε4 carriers. [183] [184] [185] Several studies have found an increase in CSF YKL-40 in AD patients compared with controls and these results have been confirmed by a recent meta-analysis. 26, 183 CSF YKL-40 increases with disease progression as demonstrated in longitudinal studies 91, 186 and it is positively correlated with biomarkers of neurodegeneration. Some studies have even reported a significant increase of CSF YKL-40 in preclinical AD. 39, 185 CSF YKL-40 can predict progression from cognitively unimpaired to MCI 183 and from MCI to AD dementia. 84 Increases in CSF YKL-40 are not specific for AD and can be found in other neurological diseases. [187] [188] [189] Of interest, CSF YKL-40 levels are unchanged or even decreased in PD without dementia. [190] [191] [192] A few studies have assessed YKL-40 in blood. There may be a trend for elevated plasma YKL-40 in AD compared with controls. 183, 193 Overall, CSF YKL-40 might have a limited diagnostic value, but it can be useful for tracking astroglial activation, assessing response to treatments targeting neuroinflammation, and the identification of subgroups of patients or disease staging based on inflammatory processes."}, {"section_title": "Other inflammation markers", "text": "Several other inflammatory biomarkers for AD have been studied but with heterogeneous and inconsistent results. 133 CSF human interferoninducible protein-10 (IP-10) appears to increase in MCI and mild AD, although this is not consistent across studies. 192, 194 In addition, plasma IP-10 has shown conflicting results. 115, 195 Glial fibrillary acidic protein (GFAP) in CSF does not differ in AD compared with controls in most studies. 26 However, a recent study found increased CSF and serum GFAP in AD patients and a significant correlation between serum GFAP and cognitive decline. 196 Monocyte chemoattractant protein-1 (MCP-1) is slightly elevated in CSF of AD patients, and no differences are found in the blood. 26 Other inflammatory markers have been reported to be elevated in AD. 133, 197 In contrast, serum sirtuin1 decreases with aging, making this reduction more pronounced in AD patients. 198 Sirtuin1, a NAD-dependent protein deacetylase nuclear receptor, has been proposed as a regulator of aging, metabolic and inflammatory processes involved in AD. [199] [200] [201] Overall, most AD-related inflammatory biomarkers do not demonstrate a clear diagnosis potential, but they can be useful in tracking different patterns of inflammatory response to AD pathology."}, {"section_title": "TDP-43 pathology", "text": "Transactive response DNA-binding protein of 43 kDa (TDP-43) is a DNA and RNA-binding protein that is found phosphorylated in the ubiquitin inclusions in most cases of ALS and in FTLD-TDP. 202, 203 Remarkably, TDP-43 deposits are found in elderly people and in 20-50% of patients with AD. [204] [205] [206] [207] [208] [209] TDP-43 copathology in AD is probably not a mere bystander but it is associated with memory loss and brain hippocampal atrophy. 207, 210, 211 Recently, a new entity called 'limbic-predominant age-related TDP-43 encephalopathy' (LATE) has been described. 212 The neuropathological changes of LATE are characterized by deposits of TDP-43 in the amygdala, hippocampus, and middle frontal gyrus, and is sometimes accompanied by hippocampal sclerosis. LATE usually presents with an amnestic syndrome and can, therefore, mimic AD. A few studies have investigated TDP-43 in AD. Plasma TDP-43 levels may indicate the amount of TDP-43 pathology in AD 213 . Another study showed that plasma TDP-43 is increased in AD and progressive MCI. 214 The availability of TDP-43 biomarkers would not only be useful to diagnose ALS and FTLD-TDP but also to detect the TDP-43 pathology burden in AD. They would help to discriminate between LATE and other neurodegenerative diseases. However, the use of TDP-43 as a biomarker is restricted by the technical difficulties to specifically detect the protein. 215 α-synuclein pathology α-synuclein is the major component of Lewy bodies and Lewy neurites, which are intracellular inclusions that constitute the pathological hallmark of PD and DLB. 216 In addition, α-synuclein aggregates can be found in multiple system atrophy (MSA), predominantly in oligodendrocytes and neurons. 217 In combination, PD, DLB, and MSA are referred to as α-synucleinopathies. Of interest, over half of AD patients (including lateonset AD, autosomal-dominant AD, and Down syndrome) have Lewy pathology, especially in the amygdala. 218, 219 The pathological contribution of α-synuclein in AD is unclear, but it may promote β-amyloid and tau aggregation. 220,221 CSF α-synuclein has mainly been studied as a biomarker for α-synucleinopathies and most studies have observed a decrease in CSF α-synuclein levels in PD and DLB compared with controls or AD. [222] [223] [224] [225] In AD, CSF α-synuclein is slightly higher compared with controls. 26, 226 CSF α-synuclein is higher in those MCI patients that rapidly progress to AD. 227 Of interest, a set of AD patients have high CSF p-tau but low CSF α-synuclein, and it has been speculated that this may reflect AD patients with Lewy bodies. In CJD, CSF α-synuclein is significantly increased. 222, 228 In blood, no differences have been found in plasma α-synuclein between AD and controls, 229, 230 but one study observed that plasma α-synuclein increased in PD compared with controls. 231 Of note, most studies on α-synuclein have measured the full-length protein and research is being carried out to detect α-synuclein fragments and oligomers in biological fluids. It is also important to note that α-synuclein biomarkers may simply reflect age-related copathologies rather than specific AD pathologies."}, {"section_title": "Sex differences in fluid AD biomarkers", "text": "There is an increasing body of evidence that sex, gender, or both have an effect on the epidemiology, pathogenesis, clinical presentation, course, and treatment response in AD. This is, however, a complex topic because multiple social and biological factors are involved. We will focus on sex differences, although gender (i.e. social and cultural differences rather than biological) have an impact on AD. 232, 233 The prevalence of AD dementia is higher in women than in men 234 and women appear to have a faster cognitive decline and brain atrophy rate once symptoms have started. 235 Some AD risk factors (e.g. depression and sleep disorders) are more prevalent in women 232, 236 and APOE-ε4 confers a greater AD risk in women than men. 237 In addition, early menopause is associated with a higher risk of cognitive decline and AD neuropathology. 238, 239 Thus, understanding the role of sex in AD is crucial to develop a precision medicine approach in AD. 232 Although sex is generally included as a covariable in biomarker studies, only a few studies specifically focus on the effect of sex in biomarkers. Table 2 reviews the main differences on AD-related biomarkers between women and men. In most studies, no sex differences have been found in AD core biomarkers. [240] [241] [242] [243] [244] However, a few studies found higher basal levels of t-tau in women compared with men in the whole cohort, 243 or solely in the AD group, 245 which is consistent with the fact that women have higher levels of tau pathology compared with men in pathological and PET studies. 246, 247 In addition, the association between APOE-ε4 and CSF t-tau and p-tau is stronger in women than in men. 240, 243 Although most studies did not find differences in Aβ42 between women and men, one study demonstrated a modifying effect of gender and APOE on the evolution of CSF Aβ42 linked to age. Specifically, women carrying an APOE-ε4 allele have stable CSF Aβ42 levels until the age of 50 years old but they then show a faster decline. 242 With regard to other biomarkers, the data available on sex differences is limited. A recent study including patients along the AD continuum found higher CSF NfL levels in men than in women. 186 CSF sAPPα and sAPPβ have been reported to be higher in women with AD, 248 and CSF E-selectin and ICAM1 and VCAM1 are higher in men. 124, 242 Inflammatory biomarkers are the markers that appear to be more influenced by sex. CSF progranulin is consistently higher in men than in women 174,175,178 but, surprisingly, plasma or serum progranulin are higher in women. In addition, CSF sTREM2 may be slightly higher in men, although the difference is not as pronounced as in CSF progranulin. 148"}, {"section_title": "Conclusion", "text": "Overall, the effect of sex and gender on AD and, in particular, on AD fluid biomarkers, requires further research because it will help to improve the understanding of the disease and, especially, in the design of preventive and therapeutic strategies. The Women's Brain Project and the Alzheimer Precision Medicine Initiative have recently published some recommendations to improve the design, analysis, and reporting of sex and gender differences in future studies. 232"}, {"section_title": "Acknowledgments", "text": "The authors would like to thank Elsa Velasco for the scientific illustrations included in this review. We also recognize and have heartfelt gratitude to Mrs Blanca Brillas for her outstanding and continued support to the Pasqual Maragall Foundation that makes possible a future without Alzheimer's."}, {"section_title": "Funding", "text": "The authors received no financial support for the research, authorship, and/or publication of this article. "}]