[{"section_title": "Abstract", "text": "Objective To document accessible magnetic resonance (MR) brain images, metadata and statistical results from normal older subjects that may be used to improve diagnoses of dementia. Methods We systematically reviewed published brain image databanks (print literature and Internet) concerned with normal ageing brain structure.\nResults From nine eligible databanks, there appeared to be 944 normal subjects aged ≥60 years. However, many subjects were in more than one databank and not all were fully representative of normal ageing clinical characteristics. Therefore, there were approximately 343 subjects aged ≥60 years with metadata representative of normal ageing, but only 98 subjects were openly accessible. No databank had the range of MR image sequences, e.g. T2*, fluidattenuated inversion recovery (FLAIR), required to effectively characterise the features of brain ageing. No databank supported random subject retrieval; therefore, manual selection bias and errors may occur in studies that use these subjects as controls. Finally, no databank stored results from statistical analyses of its brain image and metadata that may be validated with analyses of further data. Conclusion Brain image databanks require open access, more subjects, metadata, MR image sequences, searchability and statistical results to improve understanding of normal ageing brain structure and diagnoses of dementia.\n• We reviewed databanks with structural MR brain images of normal older people.\n• Among these nine databanks, 98 normal subjects ≥60 years were openly accessible.\n• None had all the required sequences, random subject retrieval or statistical results.\n• More access, subjects, sequences, metadata, searchability and results are needed.\n• These may improve understanding of normal brain ageing and diagnoses of dementia."}, {"section_title": "Introduction", "text": "Normal ageing and dementia are associated with brain tissue loss (atrophy) measured by magnetic resonance (MR) imaging [1] [2] [3] [4] [5] [6] [7] . The progressive economic and human burden of dementia, and the likely limited effect of future treatments beyond the early clinical stages, necessitates earlier and more accurate diagnoses of pathological atrophy [8] [9] [10] . Better understanding of the effects of normal ageing on brain tissue, in visual or computational assessment tools, may afford earlier and more accurate diagnoses of dementia and other age-related neurological disorders [1] .\nThe variation of brain tissue loss in normal subjects increases with advancing age [1, 4, 5] . Thus, one-off studies including relatively small numbers of subjects may not be reliable [11] [12] [13] . Indeed, these studies are in disagreement as to whether atrophy (of grey matter) is slowed in old age [6] , constant across adulthood [3] , or increased in old age [2] . Reports of correlations of normal brain volumes and cognitive measures are also inconsistent [14] .\nWith large volumes of data, brain image databanks may facilitate a better understanding of the variation in structure of the normal ageing brain [11] [12] [13] [15] [16] [17] [18] [19] , e.g. results from statistical analyses (such as correlation coefficients of brain volumes and age) can be stored and validated with analyses of further data. Image data should include a range of MR sequences, such as T1, T2, T2* and fluid-attenuated inversion recovery (FLAIR), to effectively describe the features of normal brain ageing [20] . These databanks should support random and stratified random, i.e. random within study-specific constraints such as brain structure volumes and clinico-demographics, image (subject) retrieval so to remove manual selection bias and provide appropriately matched controls in studies of ageing.\nStudies of ageing should also address the issue of what is \"normal\" [21] . Many older people without neurological disorder have clinical characteristics that may affect brain structure, such as hypertension, diabetes, arthritis and medication use that may not be regarded as \"normal\" in younger populations [1, [21] [22] [23] [24] [25] [26] [27] . Therefore, these clinical characteristics should be considered part of the \"effects of normal ageing\" and subjects with them, if otherwise cognitively normal, should probably not be excluded from normal ageing brain image studies and databanks. Instead, it should be possible to say in which way subjects are normal, i.e. whether they are ageing \"successfully\" (without these clinical characteristics) or \"usually\" (with these characteristics) [28] , and hence their inclusion and categorisation in normal ageing brain image studies and databanks should be supported by thorough cognitive and medical test results (metadata) [21] . This is particularly true if these subjects are to be used as controls in studies of dementia and related disorders where cognitive state greatly influences diagnoses [29, 30] .\nIt is apparent that brain image databanks have the potential to support studies of age-related neurological disorders and better understanding of normal ageing brain structure [19] . A systematic review may determine if they have yet realised this potential and, if not, what still needs to be done."}, {"section_title": "Materials and methods", "text": "We used the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) statement [31, 32] , a checklist for preparing clear and transparent accounts of systematic reviews [33] , to prepare this report. Between October 2010 and October 2011 we searched the literature using PubMed (http://www.ncbi.nlm.nih.gov/pubmed/) and the Internet using Google (http://www.google.co.uk/) and Google Scholar (http://scholar.google.co.uk/) with the terms: \"magnetic resonance imaging\" or \"MRI\" or \"MR\" and \"brain\" and \"databank\" or \"database\" or \"data set\" and \"human\". The Internet search ended after two consecutive result pages provided no reference to brain image databanks. We supplemented the search by consulting the Biomedical Informatics Research Network (BIRN; http://www.birncommunity. org/resources/data/), repositories of neuroimaging resources (http://neuinfo.org/; http://www.nitrc.org/) and reference lists in previous commentaries of brain image databanks [16] [17] [18] [19] . We first read the abstracts and/or titles produced from the search to select publications potentially describing a human brain image databank. We included databanks described in these selected publications for review if they: (1) provided publicly accessible and downloadable brain images; (2) included people aged 60 years and over; (3) described some or all of their subjects as \"normal\"; (4) stored structural brain images of individual subjects, but not if they stored only brain atlases or templates, i.e. averaged or combined brain images from multiple subjects, without the underlying individual subjects' images. While the latter three criteria are selfexplanatory, public accessibility allows the sharing of data and results derived from these data thereby may lead to better understanding of normal brain ageing [12, 19] .\nWe sought from all available information about each databank its: (1) purpose, (2) number of subjects, (3) number of \"normal\" subjects aged 60 years and over, (4) criteria for normality, (5) MR image sequences, (6) image (subject) retrieval parameters and (7) results from statistical analyses, e.g. correlation coefficients, the mean and variance of brain volumes by age, on the data contained. We estimated missing values where possible; the bases for estimates are noted in the results tables. Finally, we interfaced with databanks and/or consulted databank manuals and publications to determine how data were accessed and searched. We compiled tables summarising these results and composed individual descriptions of each databank."}, {"section_title": "Results", "text": "The literature search produced 591 publications, and we found a further 31 items through Internet and supplementary searches. Seven records were duplicates; therefore the search produced 615 individual records. We screened these to identify 144 that potentially described a databank of human brain images. Based on criteria given in the Materials and methods section, we excluded 135 of these ( Fig. 1) Summary of MR brain image databanks concerned with defining \"normal\" ageing brain structure\nThis left nine MR brain image databanks that met the criteria as follows (Table 1 ). All nine of these databanks reported to include \"normal\" subjects aged 60 years and over. However, only five databanks, ADNI, fMRIDC, OASIS cross-sectional, OASIS longitudinal and XNAT Central, included subjects fully representative of the normal ageing population according to cognitive and medical test results. Further, we could not find information on the total number of normal subjects aged ≥60 years and the criteria for normality for all subjects in the XNAT Central databank. Furthermore, many subjects were in more than one databank (fMRIDC, OASIS longitudinal, OASIS cross-sectional and XNAT Central databanks) [23, 24] . Therefore in total, according to information we could find, there were approximately 343 different individual, representative normal subjects aged ≥60 years (from the ADNI, fMRIDC and OASIS Cross-sectional databanks; Table 2 ). The mean age of these 343 subjects was 75.78, standard deviation (SD) 6.49 years. Many of these subjects were not accessible without application; only 98 different individual, representative normal older subjects were openly accessible. The mean age of these openly accessible subjects was 75.92, SD 8.99 years.\nRegardless of whether representative metadata were available or not and discounting subject overlap, the apparent total [23, 76] 9. The Extensible Neuroimaging Archive Toolkit (XNAT) Central [77, 78] number of normal subjects aged ≥60 years (in the eight databanks where we could determine the number of subjects) was 944 with a mean of 118, SD 74 (range 15-229) subjects per databank. From the seven databanks where we could find or estimate age (Table 2) , the mean age of subjects aged ≥60 years was 72.31, SD 6.36 years. Table 3 shows the acquisition parameters of subject images and Table 4 the subject retrieval parameters in all of the eligible databanks. We found no databank to support subject retrieval by measures of white matter changes whether qualitative, e.g. Fazekas rating, or volumetric. No databank supported random or stratified random, i.e. random within study specific constraints such as volume of white matter changes or age, subject retrieval. Finally, no databank stored results from statistical analyses, e.g. correlation coefficients, the mean and variance of brain volumes by age, of the data it contained. d Estimated from age frequency distribution graph [22] e Many of these subjects were part of the fMRIDC, OASIS Cross-sectional, OASIS Longitudinal and XNAT Central databanks [23, 24] f Estimated from ages and sample sizes in original studies [27, 79] g Estimated from exclusion by age group graph [21] h This is the age range according to information that we could find i Accessibility was data dependent PD proton density, FLAIR fluid-attenuated inversion recovery, SWI susceptibility-weighted imaging 00image sequence was not in the databank; 10image sequence was in the databank; -missing value a For normal ageing subjects that were accessible Purpose, subjects, criteria for normality and subject retrieval parameters of each databank"}, {"section_title": "ADNI databank", "text": "The ADNI was set up to determine which combination of neuroimaging, cerebral spinal fluid (CSF) and blood biomarkers provides the earliest and most accurate diagnosis and expected course of Alzheimer's disease (AD). Housed at the Laboratory of Neuroimaging (LONI) Image Data Archive (IDA), the ADNI databank contained serial MR brain images, separated by 6-12 months over 2-3 years, from approximately 229 normal, 398 mild cognitive impairment (MCI) and 192 AD subjects aged 55-90 years (normal subjects were aged 70-90 years; Table 2 ). Normal subjects may have had some medical problems common in ageing.\nThe criteria for normality also included results from a battery of cognitive tests including the American National Adult Reading Test (ANART), Clinical Dementia Rating (CDR) and Mini Mental State Examination (MMSE), which were in the databank and subject retrieval parameters. Image analysis results were in the databank but we did not find statistical results. The LONI IDA also supported subject retrieval by a range of clinico-demographic, image acquisition and image analysis parameters."}, {"section_title": "AIBL databank", "text": "The AIBL study was designed to understand the pathological features and early clinical manifestation of AD, improve the diagnosis of AD, and identify diet and lifestyle factors that are significant in the development of AD. Also housed at the LONI IDA, the AIBL databank contained serial MR brain images acquired from 177 normal, 57 MCI and 53 AD subjects aged 60-100 years. Although medical and cognitive test results were part of the criteria for normality, the normal subjects were not representative of the normal ageing population because they were preferentially selected as APOE ɛ4 allele carriers [68] ."}, {"section_title": "Designed Database of MR Brain Images of Healthy Volunteers", "text": "The Designed Database of MR Brain Images of Healthy Volunteers was created to assess the effects of healthy ageing on brain structure and provide references for the assessment of disease. It contained MR brain images from 100 normal subjects aged 18-72 years (15 subjects were aged ≥60 years; Table 2 ). These subjects had \"no history of diabetes, hypertension, head trauma, psychiatric disease, or other symptoms or history likely to affect the brain\" and therefore may not have been representative of the entire normal ageing population. We did not find cognitive test results to be within the criteria for normality. Subject demographics age, gender, race and handedness were in the database, and these could be used to retrieve subjects from the database."}, {"section_title": "The fMRIDC", "text": "The fMRIDC was created to allow the functional magnetic resonance imaging (fMRI) research community to validate methods and hypotheses and perform metaanalyses of a large number of peer-reviewed studies. It stored structural MR brain images as well as fMRI data from these studies. We did not have access to the overall composition of the databank, e.g. we could not determine the total number of subjects, but found 66 normal subjects aged ≥60 years. These subjects had no history of stroke, heart attack or psychiatric disorder but had medical characteristics common in ageing, e.g. hypertension and arthritis. Fifty of these subjects were also in the OASIS and XNAT Central databanks. Subjects could be retrieved by study title, author, keywords, abstract or \"special collections\" (selected novel data sets) but not directly by subject clinico-demographic, imaging or cognitive parameters."}, {"section_title": "IXI dataset", "text": "The IXI dataset was acquired to develop computer-aided diagnostics of MR brain images. It contained MR brain images from 593 normal, healthy subjects aged 19-86 years (197 subjects were aged ≥60 years; Table 2 ). We did not find the criteria for normality, and medical and cognitive test results were not in the data set. Subject demographics such as age, gender, weight, ethnicity and qualification were in the data set, and these could be used to retrieve subjects from the data set."}, {"section_title": "ICBM databank", "text": "The ICBM study will develop a probabilistic atlas and reference system for the normal human brain throughout the lifespan [16] . The ICBM databank, also housed at the LONI IDA, had 851 normal subjects aged 18-90 years (approximately 76 subjects were aged ≥60 years; Table 2 ). The criteria for normality included results from several medical and cognitive tests such as the MMSE. As the criteria for normality were the same regardless of age, the older subjects may not have been representative of the entire normal ageing population, e.g. subjects with any prescription medications (with some exceptions such as antibiotics or non-steroidal anti-inflammatories) or hypertension were excluded regardless of age.\nOASIS: Cross-sectional MRI Data in Young, Middle Aged, Nondemented, and Demented Older Adults\nThe OASIS cross-sectional databank was created to provide the data needed, for example, for widespread study of ageing and dementia and to develop new MR brain image analysis techniques. It contained MR brain images from 316 normal subjects and 100 dementia sufferers aged 18-96 years (98 normal subjects were aged ≥60 years; Table 2 ), including older subjects with hypertension and treated diabetes. The criteria for normality also included MMSE score and CDR. The databank supported subject retrieval by a range of clinico-demographics, cognitive test results (CDR and MMSE), imaging acquisition parameters and parameters derived from analyses of brain images: atlas scaling factor, estimated total intracranial volume, whole brain volume and normalised whole brain volume, i.e. proportion of whole brain volume in total intracranial volume. Although these image analysis results were in the databank, statistical results were not."}, {"section_title": "OASIS: Longitudinal MRI Data in Nondemented and Demented Older Adults", "text": "The OASIS longitudinal databank was created for reasons similar to the OASIS cross-sectional databank. It contained serial MR brain images, acquired over two or more sessions and separated by at least 1 year, from 86 normal subjects (14 of which later converted to dementia) and 64 dementia sufferers aged 60-96 years. Many of the older subjects in the OASIS cross-sectional databank were also in this longitudinal databank but were assigned new subject identifiers. The criteria for normality and subject retrieval parameters were the same as in the OASIS cross-sectional databank."}, {"section_title": "The Extensible Neuroimaging Archive Toolkit (XNAT) Central databank", "text": "The XNAT Central databank was designed to allow secure and quality-controlled data (medical image and metadata) sharing among local colleagues, external collaborators and the broader neuroscience community. It contained over 3,000 subjects from approximately 200 medical imaging studies, including the OASIS data. In addition to the OASIS subjects we found nine subjects (with brain images) aged ≥60 years; however, these subjects were not normal (they were neurosurgery patients). We did not have access to the remaining subjects or criteria for normality. Subjects could be retrieved by the parameters in the OASIS cross-sectional databank among others, including medical test results and regional brain volumes."}, {"section_title": "Discussion", "text": "We systematically reviewed published MR brain image databanks with structural brain images of \"normal\" older people (aged ≥60 years). Amongst nine databanks that met the inclusion criteria, concerned with defining \"normal\" ageing brain structure, there appeared to be 944 normal subjects aged 60 years and over. However, after adjusting for the many subjects who were in more than one databank and those who did not have metadata (cognitive and medical test results) representative of the entire normal ageing population, there were 343 normal subjects aged 60 years and over, only 98 of whom were openly accessible. While lack of open access is not necessarily a criticism (MR imaging data are expensive to acquire and easily misused), application reviewer bias may restrict investigators with intentions not aligned with those of the original studies. The high variation in structure of the normal ageing brain [1, 4, 5] and inconsistency of causal inferences [2, 3, 6, 14] indicate that this number of subjects (most of whom some investigators may not be able to access) is too few to effectively characterise this variation.\nThe criteria for normality in many of these databanks may not have fully represented the clinical characteristics of normal ageing. For example, the Designed Database of MR Brain Images of Healthy Volunteers and ICBM criteria for normality were the same across the lifespan [21, 70] and thus may not have been fully representative of the normal ageing population's clinical characteristics such as the increasing proportion with prescription medications and hypertension. When a population has a mean of approximately three prescriptions and approximately 50% have medically diagnosed hypertension [1, 21, 25] , it would be reasonable to conclude that subjects with these characteristics are at least equally \"normal\" to subjects without and both should be included in normal ageing brain image databanks. Thus, representing the entire normal ageing population that includes \"successful\" and \"usual\" ageing individuals [28] . This is particularly true when considering that these subjects may be used as controls for study groups, e.g. dementia subjects, that have similar clinical characteristics [23] .\nMagnetic resonance brain image databanks with representative normal older subjects have led to many publications: over 200 publications from the ADNI databank and the OASIS cross-sectional databank has been cited by over 100 publications [80, 81] . However, these databanks provided a limited range of image sequences [63] ; the openly accessible images from representative normal older subjects were only T1-weighted [24] . To support better understanding of normal ageing brain structure, databanks should include, for example, T2* and FLAIR images as well as the commonly used T1-and T2-weighted images [20, 24, 63] .\nAlmost all databanks supported image (subject) retrieval by clinico-demographic and imaging acquisition parameters but few (LONI IDA, OASIS and XNAT Central) supported subject retrieval directly by medical and cognitive test results and parameters derived from image analyses, e.g. brain volumes. In particular, we did not find any databank to support subject retrieval by white matter changes that, if prevalent in a normal ageing control group, could skew cognitive measures [82] . Therefore, it may be difficult to match or differentiate databank subjects (to study groups) on parameters, e.g. age, brain structure, MMSE, head size and blood pressure, that could undesirably affect experimental results when using them as controls. Moreover, no databank supported random subject retrieval; therefore, manual selection bias and errors may occur in studies that use these subjects as controls.\nFurther to storing subjects, databanks that store results from statistical analyses of normal brain images and metadata may facilitate better understanding of normal ageing brain structure [1, [11] [12] [13] 19 ], e.g. results from statistical analyses (such as the mean and variance of brain volumes by age) can be stored, tested and validated with analyses of further data. The storage of statistical results is required owing to the unreliability of causal inferences from single studies [11] [12] [13] and particularly so given the inconsistencies in reports of the progression of atrophy in normal ageing and correlations of cognition and brain volumes [2, 3, 6, 14] . However, we found no databank that had these results.\nAlthough not yet included, the ICBM databank plans to include probabilistic atlases (maps) of the variation of normal whole and regional brain structures from 7,000 subjects throughout the adult lifespan [16] . However, according to a recent progress report of this work [21] , the number of older subjects (aged ≥60 years) to be included in these atlases will be limited (estimated 581, from subject proportions in the progress report, if the 7,000 subject target is reached). The Internet Brain Volume Database (IBVD) [60] , excluded from our review as it did not contain structural brain images, contained brain volumes from different studies with different parameters and criteria for normality, and hence may not effectively describe normal ageing brain structure variation. Therefore, there is a current lack of easily accessible statistical results, e.g. the distribution of normal ageing brain volumes, and atlases (from representative normal ageing subjects) that may facilitate better understanding of normal ageing brain structure and the required earlier and more accurate diagnoses of dementia and related disorders [1, 9, [11] [12] [13] . To have such a great effect, e.g. so as to be used in large clinical trials that may, for example, test the effectiveness of dementia preventing treatments according to patient positions in the distribution of normal ageing brain volumes, these results and atlases should be openly accessible in a brain image databank [19] .\nThe strengths of this study include use of established systematic review criteria, exhaustive search of printed and online materials, and structured evaluation of databanks according to prespecified criteria. The study limitations include difficulty in searching for databanks and our search process, although we used multiple overlapping techniques, may not have found every databank with structural brain images from \"normal\" older subjects. In particular, we were not able to comment on databanks that were not publicly accessible. Further, we used available publications, user guides and fact sheets, and interfaced with databanks when possible. However, we may not have found all relevant information so may, inadvertently, not have justly described the databanks we did find, for which we apologise. These limitations notwithstanding, we have considered all of the leading published brain image databanks [19] , and others not previously reviewed, that are concerned with the variation in structure of the \"normal\" ageing brain.\nAccording to our review, brain image databanks with normal older subjects have the potential to facilitate better understanding of the normal ageing brain structure. This understanding is ever more important as cases of age-related neurological disorders grow with the average life expectancy, which is now on average in the 9th decade for western countries. However, the total number of openly accessible subjects fully representative of the normal ageing population's clinical characteristics (approximately 98 different individual subjects aged ≥60 years) in existing brain image databanks is too limited at present to inform the true variation in normal ageing brain structure.\nDatabanks should include subjects thoroughly tested to show no cognitive or other debilitating disorder but with clinical characteristics that are common in ageing, e.g. prescription medications, diabetes, hypertension and arthritis [1, [21] [22] [23] [24] [25] [26] [27] . As long as these characteristics are carefully documented and searchable, this will allow others to draw subjects appropriate for their study group and/or representative of the wider population. To avoid bias and errors in brain imaging studies that use these subjects as controls, databanks should support random and stratified random subject retrieval. Multiple image sequences, including the T2, T2* and FLAIR, as well as T1-weighted sequences, that are routinely used in diagnosis, are required to define the structure of the normal and abnormal ageing brain. Finally, results of statistical analyses and atlases defining normal ageing brain structure variation should be included in databanks to provide a reference for others to test. With further data and analyses these results and atlases will be validated or evolve to facilitate better understanding of normal ageing brain structure. In turn, this understanding may lead to earlier and more accurate diagnoses of disorders such as dementia and facilitate clinical trials of new treatments."}]