[{"section_title": "Abstract", "text": "Background: An association between cognition and physical function has been shown to exist but the roles of muscle and brain structure in this relationship are not fully understood. A greater understanding of these relationships may lead to identification of the underlying mechanisms in this important area of research. This systematic review examines the evidence for whether: a) brain structure is related to muscle structure; b) brain structure is related to muscle function; and c) brain function is related to muscle structure in healthy children and adults. Methods: Medline, Embase, CINAHL and PsycINFO were searched on March 6th 2014. A grey literature search was performed using Google and Google Scholar. Hand searching through citations and references of relevant articles was also undertaken."}, {"section_title": "", "text": "Results: 53 articles were included in the review; mean age of the subjects ranged from 8.8 to 85.5 years old. There is evidence of a positive association between both whole brain volume and white matter (WM) volume and muscle size. Total grey matter (GM) volume was not associated with muscle size but some areas of regional GM volume were associated with muscle size (right temporal pole and bilateral ventromedial prefrontal cortex). No evidence was found of a relationship between grip strength and whole brain volume however there was some evidence of a positive association with WM volume. Conversely, there is evidence that gait speed is positively associated with whole brain volume; this relationship may be driven by total WM volume or regional GM volumes, specifically the hippocampus. Markers of brain ageing, that is brain atrophy and greater accumulation of white matter hyperintensities (WMH), were associated with grip strength and gait speed. The location of WMH is important for gait speed; periventricular hyperintensities and brainstem WMH are associated with gait speed but subcortical WMH play less of a role. Cognitive function does not appear to be associated with muscle size. Conclusion: There is evidence that brain structure is associated with muscle structure and function. Future studies need to follow these interactions longitudinally to understand potential causal relationships."}, {"section_title": "Background", "text": "Maintaining good levels of brain and muscle function across the lifespan is crucial to achieving a good quality of life [1] [2] [3] . There is substantial evidence showing an association between cognition and muscle function [4] [5] [6] [7] [8] , however the role of muscle and brain structure within this association is less well understood. A greater understanding of this role will help to improve current knowledge of the mechanisms linking brain and muscle function over the lifecourse.\nSeveral theories have been proposed as to why relationships between brain and muscle structure and function may exist. The common cause hypothesis postulates that there are core common underlying processes which drive ageing throughout the human body. The construct was originally described in a paper by Lindenberger and Baltes in 1994 who noted that measures of visual and auditory acuity accounted for variance in intelligence in old age [9] . Since then experiments in caloric restriction have demonstrated that the ageing process can be slowed down in multiple systems throughout the body by one intervention [10, 11] . However, environmental factors also impact on how tissues change across the lifecourse and another theory by Mitnitski et al. proposes that the number of environmental stressors experienced (e.g. disease, smoking) and the ability to recover from them, vary the level of deficit accumulation experienced in multiple organ systems, and hence how tissues like brain and muscle change with age [12] . Potential underlying mechanisms include: pro-inflammatory cytokines (e.g. TNF-alpha and IL-6); the role of glucocorticoids and their intracellular amplifier 11beta-hydroxysteroid dehydrogenase type 1 [13] [14] [15] ; the role of vitamin D [16, 17] ; exercise as a way to improve cardiovascular fitness in addition to its beneficial effect through hormones and cytokines [18] [19] [20] ; and cellular senescence (e.g. through oxidative stress) [21, 22] .\nIn view of these theories, there should be a correlation between the structure and function of brain and muscle throughout our lifetime in the absence of significant pathology. This systematic review will search for studies that test the hypotheses that brain structure is related to muscle structure and/or function and that muscle structure is related to brain function in healthy children and adults. Previous studies and reviews have looked at evidence relating brain function (e.g. MMSE score) to muscle function (e.g. walking speed) therefore this separate but closely related field of literature will not be included in this review [5, [23] [24] [25] ."}, {"section_title": "Methods", "text": "The study protocol was published online in December 2011 at: http://www.ccace.ed.ac.uk/sites/default/files/ Kilgouretal.pdf."}, {"section_title": "Inclusion criteria Population", "text": "All human subjects regardless of age were included in the study; from newborn babies to the oldest old, including post-mortem studies. This study is examining the relationship between brain and muscle in health, not within the effects of pathology therefore studies looking at how a disease affects brain or muscle were excluded. However studies which included a healthy control group, where the data from these subjects can be or was analysed separately were included. As morbidity increases in frequency with age it would be very restrictive to include solely those studies which include only participants who are free from any disease, therefore studies will be included provided the subjects have been recruited in a way that did not pre-dispose to morbidity being more prevalent than in the general population (e.g. from a diabetes clinic).\nIt was planned that subgroup analysis would be undertaken where possible and would include data being extracted to investigate the effects of gender, age, socioeconomic status and ethnicity."}, {"section_title": "Interventions/Comparators", "text": "Not applicable as the study is investigating normal physiology."}, {"section_title": "Outcomes", "text": "Brain structure Whole brain volume (WBV) or total brain volume (TBV) Volume or cross sectional area of regions within the brain (e.g. hippocampus, frontal lobes) White matter integrity (e.g. White matter hyperintensities (WMH) or white matter signal abnormalities (WMSA) Histological findings about brain structure on autopsy"}, {"section_title": "Brain function", "text": "Any recognised measure of cognitive function including: memory, attention, executive function, language and processing speed Reaction time will not be used as this is dependent on aspects of brain and muscle structure and function"}, {"section_title": "Muscle structure", "text": "Muscle cross sectional area on CT, MRI or USS Muscle volume (using CT or MRI) Whole body lean tissue mass using DEXA, giving: total lean mass (TLM) or appendicular lean mass (ALM) Bioimpedance analysis (BIA) Histological findings on muscle biopsy or on autopsy"}, {"section_title": "Muscle function", "text": "Any recognised test of muscle strength, including isometric, isotonic, isokinetic tests Any recognised test of muscle power Functional tests of muscle function (e.g. usual or maximum gait speed)"}, {"section_title": "Study design", "text": "As this review is studying a physiological relationship, intervention studies were not included, unless they contained either a control arm with extractable data with no placebo treatment or baseline data prior to the intervention.\nObservational studies including cohort studies and cross sectional studies were included and the control arm of case control studies. Case reports were excluded as these would not contain evidence of normal physiological relationships out with pathology. The only other limiter used was \"human\" in Medline, Embase and PsycINFO but not Cinahl as it appears to screen out human studies erroneously."}, {"section_title": "Search strategy", "text": "Database searches of Medline, Embase, CINAHL and PsycINFO were undertaken. All languages were included in the search. The Medline search strategy can be found in Appendix 1. The searches were all performed on 6th March 2014. A grey literature search was performed using Google and Google Scholar. Hand searching through citations and references of relevant articles was also undertaken."}, {"section_title": "Study selection", "text": "The search was undertaken by two independent researchers. Titles +/− abstracts found using our search strategy were independently screened for relevance. The full text of the selected studies was reviewed against the inclusion criteria, and reasons for exclusion at this stage were recorded. At this point the two researchers met to discuss shortlists and discuss any articles which only one researcher had selected to decide if they should be included or not. Disagreements were resolved by consensus or adjudication by a third party (a Professor in Geriatric Medicine)."}, {"section_title": "Data extraction", "text": "The Clinical Fellow (AK) performed the data extraction using a data extraction sheet written by the Clinical Fellow and approved by the two co-authors (OT, JS)."}, {"section_title": "Contacting authors", "text": "Of the 84 studies found through our search, we wrote to 79 to request data or associations which were not given in the text. Five of the studies had given all the associations for the variables listed in the text. A letter was sent by email to either the corresponding author (after checking they were still working at the study location) or the last author (after the same checking process). Only one author was written to from each study (e.g. all articles arising from the Kansas Brain Aging Project, were grouped together when requesting extra data/associations). After the initial email a further email was sent around 2 weeks later to act as a reminder. Studies were given a minimum of around 1 month to reply.\nOut of the 79 studies we wrote to: 25 studies (32%) sent either the requested data or associations; 22 (28%) replied stating they would try and send the data or associations to us but then never did; 12 studies (15%) replied stating they either no longer had access to the data or did not want to send either the requested data or associations to us; and 20 (25%) never replied to either of the emails."}, {"section_title": "Quality assessment and risk of bias", "text": "All papers included in the study had their inclusion and exclusion criteria reviewed to check for possible bias in the study selection. The topic of the review is not looking at an intervention, therefore the risk of reporting bias for an individual paper is small. Also, in most of the papers, the relationship between muscle and brain was not the primary topic of the paper, further decreasing the risk of reporting bias. However when contacting the authors, asking for either the data or the associations, it was considered that the studies which replied may show some bias. The authors may look at their data and only reply if an association was found, or if they found a strong relationship they may not want this to be initially reported within a systematic review, but rather in a paper in its own right. All summary measures were included (e.g. odds ratio, beta)."}, {"section_title": "Data analysis", "text": "A narrative synthesis was completed. It was thought unlikely that the data would be comparable enough to allow meta-analysis (i.e. different measures of cognition, different muscle groups studied using different machines) and this proved correct. It was hoped that subgroup analysis would be undertaken, either in the form of a meta-analysis or more likely as a narrative synthesis for the reasons mentioned in the above paragraph."}, {"section_title": "Results", "text": "The search results are presented in the PRISMA flow diagram in Figure 1 . Reasons for exclusion of articles after reviewing the full text are reported in Table 1 . After applying the inclusion and exclusion criteria 84 articles were identified; 53 articles either reported the appropriate associations or sent us the data or associations requested (Tables 2, 3 and 4) , and 31 articles contained the required data but did not report the association between them and did not supply either the data or associations requested ( Table 5 ). Out of the 53 articles which could be included in the review; 6 contained data on brain structure and muscle structure ( Table 2 ); 33 contained data on brain structure and muscle function ( Table 3) ; and 14 contained data on brain function and muscle structure ( Table 4 )."}, {"section_title": "Association of brain structure and muscle structure", "text": "Of the six articles which looked at the relationship between brain structure and muscle structure, three were from the Kansas Brain Aging Project [28] [29] [30] , and the others were from Germany, UK and USA, Phoenix [26, 27, 31] (Table 2 ).\nThe Kansas Brain Aging Project was set up to determine the effects of exercise and cardiorespiratory fitness on age-related brain changes. Only one of the papers from this project reported the relationship between brain and muscle structure [29] : Burns et al. reported a positive relationship between WBV and TLM (beta 0.20, p < 0.001) when control and subjects with Alzheimer's disease (AD) were grouped together, adjusting for age sex and intracranial volume (ICV), and they note that this was driven by WM volume [29] . They state that this relationship persists in just the control group but do not give any statistics for this relationship. A General Linear Model (GLM) was performed on the data from the nondemented group supplied to us by the study authors from the Kansas Brain Aging Project [28] [29] [30] . WBV, grey matter (GM) volume and hippocampal volume were not predicted by TLM adjusting for age, sex and ICV +/− education. White matter (WM) volume was predicted by TLM (t 3.12, p = 0.003, partial eta squared 14%) adjusting for age, sex and ICV. Adjusting for total years of formal education only slightly attenuated the results (t 2.99, p = 0.004, partial eta squared 13%).\nKilgour et al. also looked at older subjects however they used neck muscle CSA as a measure of muscle bulk [27] . They found that total neck muscle CSA predicted 17% of the variance in whole brain volume (p = 0.01), but they found no significant association between total neck muscle CSA and ventricular, hippocampal or cerebellar volumes (p > 0.05), adjusting for age, sex, ICV and NART (a measure of childhood intelligence).\nThe other two studies looked at younger subjects. Heymsfield DEXA for FFM Study: Linear regression models found that after adjusting for age and fat mass, FFM predicted brain mass in men (beta 0.023, R 2 5%, p = 0.01) and women (beta 0.003, R 2 6%, p = <0.0001). Study: A significantly lower mean walking speed was found in those with a total WMH volume above the 75th percentile compared to those below the 25th (Beta −0.026, p = 0.0003). A similar relationship was found for both deep WMH and PVH. A WMH volume greater than the 90th percentile more than doubled the risk of decline Study: Gait speed was significantly associated with frontal WM normalized for brain tissue volume (R = 0.4, p = .003). Gait speed was significantly associated with frontal GM normalized for brain tissue volume (R = 0.3, p = .01). Adjusted for age and BMI (but not gender). Doesn't say about other regional brain volumes, ie temporal etc. WMH volumes and PVH and punctuate scores were not associated with gait speed (p > 0.05). Study: Total WMH burden was significantly associated with usual walking speed at baseline but not at follow-up, and maximum walking speed was not associated with total WMH at baseline or follow up. At baseline, regional WMH burden in the splenium of corpus callosum and anterior and superior corona radiata, was significantly associated with both walking measures (p < 0.05) and in addition the body of the corpus callosum was also associated with usual walking speed (p < 0.05). At follow-up, WMH burden in the splenium was significantly associated with both walking measures (p < 0.05) and in the body with maximum walking speed. Change in WMH burden, either total or in any of the 7 regional areas, over 2 years was not associated with a decline in usual walking speed (p > 0.1).\nGiven: WMH burden is significantly associated with lower gait speed after adjustment for age, sex and BMI (rho = −0.327, p = 0.0008). WM/ICV is not significantly associated with gait speed with or without adjustment (p > 0.05). GM/ICV is significantly associated with gait speed with adjustment for age, gender and BMI (rho = 0.232, p < 0.05). CSF/ICV is significantly associated with gait speed with adjustment for age, sex, BMI (rho = −0.285, p = 0.004). Study: Gait speed was significantly correlated to total WMAs (r = −.18, p < 0.0001) and white matter lesions in the brainstem (r = −.18, p = 0.01). After adjusting for age, slower gait speed was still significantly associated with white matter grade (p = 0.02). Logistic regression found that those in the lowest two quartiles of gait speed (ie < 1.02 m/s) had double the likelihood of having WMH graded 3 or above (p = 0.03), after adjustment for age, race, gender, and prevalent clinical CVD. VE graded >4 was not found to be significantly predicted by gait speed, however VE graded > 5 was, independent of age, gender, race and presence of CVD (OR = 2.91 for 1st vs. 4th quartile, OR 3.82 for 2nd vs 4th quartile) Study: Adjusted for age and ICV, higher baseline total WMH vol. was associated with increased rate of change in timed walking in seconds (r 2 = 0.08, p = 0.0052). This relationship became non-significant after adjustment for multiple comparisons to threshold p value. PVH volume is associated with increased rate of change in timed walk in seconds (r 2 = 0.12, p = .0039). However, baseline subcortical WMH vol. was not related to change in gait performance over time. Higher rate of PVH accumulation is associated with increased rate of change of time to walk 9 m (r 2 = 0.15, p = .0453). Adjusted for age, ICV and baseline WMH volume:"}, {"section_title": "Moscufo", "text": "Calculated: In an unadjusted GLM, gait speed was predicted by total brain, WMH and hippocampal volume (p < 0.001). The relationship remained significant after adjusting for sex, age, ICV and height, for total brain volume (t = 3.61, p = .004, partial eta squared 4.3%) and WMH (t = −2.80, p = 0.006, partial eta squared 4.4%) but not for hippocampal volume. Study: In men: Time to walk 6metres predicted by WMH volume (beta 0.13, p = 0.02) but not brain atrophy or peak height MTR (adjusted for age and brain size as includes measure of brain atrophy). In women: Usual walking speed predicted by lower MTR height (i.e. indicating abnormal brain tissue) (beta −0.14 (p = 0.01), increased WMH (beta 0.12, p = 0.003) and greater brain atrophy (beta 0.15, p = 0.01) (adjusted for age and brain size). Lower muscle strength associated with peak height MTR (p < 0.005, beta not given). # All brain structure variables performed using MRI. *Associations column key: Study = results published within the study; Given = associations calculated by study authors and supplied to us for this review; Calculated = study authors supplied raw data to us and we performed the analysis. Given: CS-CSID did not predict TLM or ASM at baseline or at 4 years (all p > 0.05). However baseline MMSE was associated with baseline TLM (rho = 0.058, p = 0.002) and ASM (rho = 0.061, p = 0.001) and at followup (TLM rho = 0.058, p = 0.002, ASM rho = 0.054, p = 0.005). MMSE at follow up was not associated with TLM or ASM at baseline or follow-up (p > 0.05). *Associations column key: Study = results published within the study; Given = associations calculated by study authors and supplied to us for this review; Calculated = study authors supplied raw data to us and we performed the analysis. Table 5 Studies identified with measures of brain structure or function and muscle structure or function but no associations given in paper or on request Studies with brain structure and muscle structure (re: Studies with brain structure and muscle function (re: relationship between brain mass and body composition [26] . They performed multiple linear regression and found that after adjusting for age and fat mass, FFM predicted brain mass in men (beta 0.023, R2 5%, p = 0.01) and women (beta 0.003, R2 6%, p = <0.0001). Fat mass or bone mineral content did not significantly predict brain mass in either sex. So they conclude that it is FFM that drives the relationship between body size and brain size not bone or fat mass. Weise et al. investigated the associations between regional grey matter volume and fat free mass index (FFMI = FFM/height 2 ) [31] . They found several areas of grey matter volume that were significantly associated with FFMI (p < 0.01, see Table 2 ), however after adjusting for percentage body fat or fat mass only two areas remained significant (the right temporal pole and bilateral ventromedial prefrontal cortex)."}, {"section_title": "Aribisala", "text": ""}, {"section_title": "Association of brain structure and muscle function", "text": "Thirty three studies which included measures of brain structure and muscle function were identified ( Table 3 ). The muscle function variables most commonly studied were grip strength and gait speed. Only one study was identified which used a different measure of muscle function and that was maximal isometric knee extension strength (IKES) [60] . The brain structure variables include: corpus callosum area, and volumes for total and regional GM and WM, cerebrospinal fluid (CSF), cerebellum, hippocampus, basal ganglia and whole brain volume and measures of prevalence of WMH, either volume or scoring systems (e.g. Fazekas)."}, {"section_title": "Brain structure and grip strength", "text": "The PATH through life project [32] [33] [34] [35] , the Cardiovascular Health Study [55] [56] [57] [62] [63] [64] , the Lothian Birth Cohort 1936 study [61] , a study from japan [36] and a study from Philadelphia [37] all looked at the relationship between grip strength and brain structure.\nThere are four papers identified by our search strategy from the PATH through life project, which was set up to track and define the lifespan course of depression, anxiety, substance use and cognitive ability. In one paper from this project, Anstey et al. (2007) studied the relationship between the area of the corpus callosum (CC) (measured in three sections: anterior, midbody and posterior; and total area) and grip strength [33] . They used the grip strength from the hand the subject wrote with and adjusted for age, sex and ICV. They found no significant relationship between total, anterior or posterior CC area and grip strength however they found a positive relationship between midbody CC area and grip strength (beta −0.09, p < 0.05). They conclude that this is due to the association between midbody CC and the motor cortices. Another paper from the PATH through life project studied the association between grip strength and the percentage of WM occupied by WMH in different brain areas [35] . They found that a larger percentage of WMH per WM volume is associated with decreased grip strength for both the total brain and several brain areas (frontal, temporal, parietal, anterior horn and periventricular body (all p < 0.01)). However, the amount of WMH in the occipital lobe, the cerebellum and the posterior horn was not associated with grip strength. The 2009 paper from this study further investigated the relationship between WMH and grip strength [32] . This time they looked at the relationship in men and women separately. They found that larger amounts of WMH was associated with reduced grip strength, adjusting for age, depression severity and brain atrophy index, in men (p < 0.05) but not in women (n/s). However they comment that they feel that the relationship between WMH volume and motor function is likely to be the same in both sexes and that their finding may be due to the difference in WMH amount between men and women in their study population. Sachdev's 2006 paper from this study did not look at the relationship between motor function and brain structure and the authors did not respond to our data request [34] .\nThe Cardiovascular Health Study (CHS) is a large, longitudinal, observational study of risk factors for cardiovascular disease in adults 65 years or older, which commenced in 1989 [52] . The CHS measured grip strength and gait speed and WMSA, however only one paper from this study looked at the relationship between grip strength and WMSA [64] . In this paper Longstreth et al. (1996) performed a partial correlation which found no significant association between grade of WMSA (graded on a scale of 0-9) and grip strength in either the dominant or non-dominant hand (p > 0.05) after adjusting for age, sex and presence of clinically silent stroke on MRI [64] .\nThe Lothian Birth Cohort 1936 study measured grip strength at baseline and 3 years later at which point brain volumes were also measured [61] . It is the only study to look at longitudinal changes in muscle strength and brain structure. Grip strength at wave 1 predicted ventricular volume at wave 2 (standardized beta −0.10), however there was no significant association with other brain volumes and grip strength at wave 2 predicted ventricular volume (−0.11) and NAWM (0.08). Therefore, increased grip strength was associated with less brain atrophy in this wave. However, decreased grip strength over 3 years was not significantly associated with any brain volume measure.\nThe paper by Doi et al. used multiple linear regression to show that grip strength is not related to brain atrophy (beta −0.082 (SE 0.005) p = 0.54) [36] . They measured brain atrophy by mapping the MR brain scans from their subjects to those from healthy controls. Most studies used an index to intracranial volume to calculate degree of brain atrophy. No associations with the other measured brain volumes were included in the paper.\nThe paper by Hardan et al. looked at the association between caudate volume and grip strength in both hands in children and young adults [37] . They found nonsignificant statistical trends using Pearson's correlation between total caudate volume and mean grip strength in the right (r = −0.303, p = 0.05) and left (r = −0.28, p = 0.07) hands. The relationships are negative, therefore there is a trend that those with larger caudate nuclei were found to have lower grip strength in both hands.\nGait speed and brain structure\nThe Sydney Older Person's Study [38] , the TASCOG study [39] [40] [41] , the Three-City Study [42] [43] [44] [45] , the AGES-Reykjavik study [60] , ABC1921 study [46] , WML and mobility study [52, 53] , further studies from Boston [47] [48] [49] [50] [51] , the Cardiovascular Health Study [54] [55] [56] [57] [62] [63] [64] , the Oregon Brain Aging Study [58, 59] , the LBC1936 study [61] all looked at the relationship between structural brain measures and gait speed. There were 27 studies identified to include in this section, making it the most researched association in our review. The measurement of gait speed varied considerably, with studies variously using maximum speed or usual pace, and some studies requiring a turn halfway through the measurement and others not. The distance used for the measurement also varied from 2.5 to 75 metres, however the most commonly used measure was usual pace over 6 metres.\nThe Sydney Older Person's Study was set up to investigate the environmental, biological and social determinants of healthy ageing. Within it Piguet et al. looked at the relationship between timed walk over 5 meters, adjusted for lower limb arthritis, and cerebellar vermis area (broken down into V1, V2 , V3 and total), and total cerebellar volume. None of the measures of cerebellar size/ volume significantly predicted the timed walk [38] .\nThe Tasmanian Study of Cognition and Gait was set up to examine the role of age-related brain changes in causing problems with walking, balance and cognitive abilities in the general community. It measured brain volumes and usual walking speed over 4.6 metres at baseline and 31 months [39] . They found that a greater decline in gait speed over this period was associated with more WM atrophy and hippocampal atrophy and greater accumulation of WML (p < 0.05). There was a non-significant trend with GM atrophy and decline in gait speed (p = 0.06).\nThe Three-City study is a longitudinal study of the relation between vascular diseases and dementia in persons aged 65 years and older in France, which includes measures of WM volume and maximum walking speed over 6 metres and a repeat walking speed test at the fourth follow up assessment (i.e. roughly 7 years after the first). There were four papers identified from this study which contained reference to these variables. Soumare et al. looked at the association between WMH volume and both baseline walking speed and decline in walking speed over the 7 year follow up period [45] . They adjusted for age, gender, education and brain white matter volume. They found a significantly lower mean walking speed in those with a total WMH volume above the 75th percentile compare to those below the 25th. They found similar relationships for both deep WMH and periventricular hyperintensities (PVH), however further analyses revealed that PVH may have more of an effect on walking speed than deep WMH. They also looked at WMH volume and the decline in walking speed over the follow up period. They found that having a WMH volume greater than the 90th percentile, more than doubled the risk of decline in walking speed compared with subjects with lower volumes of WMH. This finding was replicated when looking at PVH but not for deep WMH volume. Elbaz et looked at this association further and found that large WMH volumes were not associated with slow walking speed among highly educated participants (OR = 0.72), but were associated with a 2-fold-increased risk of slow walking speed among those with low education (OR = 3.19/1.61 = 1.99) (p interaction = 0.026) [42] . Results remained unchanged after adjustment for height, BMI, and MMSE score. Dumurgier et al. looked at GM volumes and gait speed in the same cohort and found that only basal ganglia volume (beta 0.075 (SE 0.025) p = 0.003) was significantly associated with walking speed; driven by caudate nucleus volume (beta 0.114 (SE 0.024) p < 0.001) [43] . All other regional GM volumes were not significantly associated with walking speed.\nThe authors from the Three-City study provided further associations between the variables of interest on written request [39] [40] [41] . They looked at the relationship between WM volume and maximal walking speed at baseline, and walking speed decline over 31 months using a multiple linear regression (MLR) and found no significant association. Finally they performed a logistic regression between a one standard deviation increase in WM volume and the risk of having the highest walking speed decline, which was again not significant.\nThe AGES-Reykjavik study is a longitudinal cohort study which includes an MRI brain and usual walking pace over 6 metres [60] . The MR brain imaging included a magnetization transfer imaging sequence, which can be used to calculate the magnetisation transfer ratio (MTR), which can detect normal and diseased brain tissue by looking at the homogeneity of the brain tissue being studied. They found that in men usual walking speed was predicted by WMH volume (beta 0.13, p = 0.02) but not by degree of brain atrophy or peak MTR height (both p > 0.05) (adjusted for age and brain size) [60] . However in women slower walking speed was associated with: lower MTR height (i.e. indicating abnormal brain tissue) (beta −0.14 (p = 0.01); increased WMH (beta 0.12, p = 0.003); and greater brain atrophy (beta 0.15, p = 0.01) [60] . Additionally they comment that isometric knee extension strength was found to positively correlate with peak height MTR (p < 0.005) however they do not give the strength of the correlation or say what it was adjusted for.\nThe Aberdeen Birth Cohort 1921 study is a longitudinal study which includes a measure of gait speed (selfpaced walk time over 6 metres) and a MR brain scan, which was assessed for WMH. Lower gait speed was significantly associated with increased WMH in the brainstem (p = 0.009, partial eta squared 7%), but not in the cerebral white matter or with PVHs [46] .\nSeven studies were identified which met the inclusion criteria from the Boston area in the United States. These include two papers from the WML and mobility observational follow up study [52, 53] , two papers looking at mobility, brain changes and cardiovascular risk factors at baseline [51] and follow up at 2 years [50] , two papers conducted at the Beth Israel Deaconess Medical Centre, where it seems there may be overlap between the study volunteers [48, 49] and a case-control study about diabetic peripheral neuropathy [47] . The two studies from the WML and mobility study recorded variables at baseline [53] and after a period of follow up (19-22 months) [52] . The baseline paper comments that gait velocity was not significantly predicted by WMSA corrected for ICV, however does not give any specific figure for this analysis [53] . The follow up paper found a significant negative relationship between gait velocity and WMSA at baseline (p < 0.05) [52] , however this is in contrast to the baseline paper and only 14 of the original 28 subjects consented for this study. Change in gait speed between visit 1 and 2 did not predict WMSA volume (p = 0.07). They also state they found a significant negative relationship between change in gait speed between visits and CSF volume (r = 0.733, p < 0.005) and a positive relationship between change in gait speed and WM volume (r = 0.558, p < 0.05) [52] . However both the quoted correlations are positive.\nMoscufo et al. recruited 99 subjects to a longitudinal study about mobility, brain changes and cardiovascular risk factors [50, 51] . Gait speed was measured using time to walk 2.5 metres as part of the Short Physical Performance Battery (SPPB). This is a considerably shorter distance than most other measures of gait speed used. The authors supplied Spearman partial correlations between the brain volumetric variables and gait speed, which were not described in the paper. Greater WMH burden (rho = −0.365, p = 0.0002) and CSF volumes (rho = −0.284, p = 0.004) are associated with slower gait speed. White matter was not found to significantly predict gait speed, however larger GM volume did predict faster gait speed (rho = 0.232, p = 0.020) [51] .\nAn analysis was made in the baseline paper, to investigate whether location of WMH affected gait speed [51] . They selected 10 regions of interest (ROI), which were neural pathways involved in sensory input or motor response and performed a Spearman's correlation with a corrected significance threshold of ≤0.005 (calculated using the Bonferroni method to adjust for multiple comparisons). All 10 ROI were found to significantly correlate with the walking speed score at p < 0.005 (rho values between 0.279 and 0.426), except in the superior longitudinal fasciculus (p = 0.035) [51] .\nThe follow up paper in this study, performed after 2 years, found that total WMH burden was significantly associated with usual walking speed at baseline but not at follow-up, and maximum walking speed was not associated with total WMH at baseline or follow up [50] . At baseline, regional GM WMH burden in the splenium of corpus callosum and anterior and superior corona radiata, was significantly associated with both usual and maximum walking speed (p < 0.05) and in addition the body of the corpus callosum was also associated with usual walking speed (p < 0.05). At follow-up, WMH burden in the splenium was significantly associated with both walking measures (p < 0.05) and in the body with maximum walking speed. Change in WMH burden, either total or in any of the 7 regional areas, over 2 years was not associated with a decline in usual walking speed (p > 0.1). However decline in walking speed was entered as a binary variable for this analysis (i.e. decline or no decline in walking speed over 2 years), which may have missed a relationship between greater WMH burden and greater declines in walking speed.\nTwo papers carried out their studies at the Beth Israel Deaconess Medical Centre. One paper looked at healthy volunteers [49] and the other looked at stroke patients in comparison to healthy volunteers [48] . It does not explicitly state the healthy volunteers are the same for each study, but the exclusion criteria, time period and author list would indicate this. The first study measured gait speed over 12 minutes at normal walking speed. MR brain images were analysed for WMH burden and brain volumes corrected for ICV. They found that gait speed was correlated to frontal WM volume (r 0.4, p = 0.003) and frontal grey matter volume (r 0.3, p = 0.01) [49] . However total WMH burden was not associated with gait speed. It is not exactly clear why they looked at frontal brain volumes and gait speed and not other regions of the brain or total brain volume. The second paper also measured gait speed over 12 minutes and used MR brain images. In the non-stroke group, white matter volume was found to predict gait speed (B 1.30, p = 0.03) but not grey matter (p > 0.05). They comment that greater brain atrophy is associated with slower gait speed, but this is for the whole group, so includes stroke patients.\nThe final study from Boston was by Manor et al. and quoted results from the control group [47] . They found no association between total GM volume or regional GM volumes and walking speed over 75 metres (p > 0.005, Bonferroni adjusted). They were being compared to subjects with diabetic peripheral neuropathy in this study. No results for WM or CSF were reported in the study.\nSeven studies from the Cardiovascular Health Study (CHS) met our criteria for inclusion. However three of the studies did not contain any associations between the variables of interest and the study authors did not supply the raw data or correlations [55, 62, 63] . The first study used gait speed measured over 15 feet, and MR brain images were used to measure ventricular enlargement (VE) and WMH both of which were recorded on a 10 point scale (0-9). Both greater ventricular enlargement (p < 0.001) and greater WMH burden (p = 0.003) were associated with slower baseline gait speed and greater decline in gait speed over the 4 year follow up period [57] . Indeed, after adjusting for baseline performance, those with severe VE were found to have 2.5x the decline in gait speed compared to those with minimal VE at baseline. The model included adjustment for age, sex, race and education.\nThe next study looked at a subset of the CHS who had undergone two MR brain scans, separated by roughly 5 years, and a MMSE and had undergone assessment on the GaitMat, a 4 metre long instrumented walking surface [56] . THE MR brain scans were classified as above, but given binary cutoffs for the analysis of WMH grade ≥3 or <3 and VE >4 or <4 for some of the analyses. Gait speed was correlated with WMH grade (r = −0.18, p < 0.0001) and with WMH in the brainstem (r = −0.18, p < 0.01). Logistic regression was used to analyse the relationship further and gait speed was separated into quartiles. This showed that those in the lowest two quartiles of gait speed (i.e. < 1.02 m/s) had double the likelihood of having WMH graded 3 or above (p = 0.03). VE graded >4 was not found to be significantly predicted by gait speed, however VE graded > 5 was significantly predicted by gait speed (OR = 2.91 for 1st vs. 4th quartile, OR 3.82 for 2nd vs 4th quartile) [56] .\nLongstreth et al. is mentioned in the above section on grip strength and brain structure, as this was also studied in this paper [64] . Gait speed was again measured over 15 feet and WMH burden was scored 0-9 on MR brains scans. Time to walk 15 feet was found to correlate with WMH grade (partial correlation coefficient 0.153, p < 0.001, adjusting for age, sex and presence of clinical silent stroke on MR brain) [64] . The population in this study and the study by Rosano et al. [57] overlap considerably and only appear to differ in the time they were still in the study and the particular inclusion and exclusion criteria for that part of the study.\nIn a separate paper, Rosano et al. found that prefrontal area volume significantly predicted time to walk in a stepwise forward model (beta −0.15, p = 0.02) [54] . This relationship was attenuated when adjustment was made for DSST score, which is a measure of processing speed. They conclude that smaller prefrontal area volume may contribute to slower gait speed through slower information processing.\nThe final two studies identified are both from the Oregon Brain Aging Study (OBAS) [58, 59] . OBAS I is a prospective study commenced in 1989 of healthy older adults age 65 years or older at the initial assessment, a second arm was added in 2004, OBAS II, with less stringent exclusion criteria and these subjects were 85 or older at the start of the study. The first paper by Marquis et al. (2002) , looked at the correlation of timed walk, measured at self-selected pace over 9 metres, against brain volumes. Hippocampal volume was found to negatively correlate with timed walk (partial r = −0.12), however no significance value was given and it did not explicitly state what was adjusted for in the correlation [59] . The correlation between TBV and timed walk was <0.1. The other OBAS paper, by Silbert et al. (2008) , found that a higher baseline total WMH volume was associated with a greater increase in timed walk over follow up (R 2 = 0.08, p = 0.0052), the average follow up was 9.1 years [58] . They then looked at whether location of WMH mattered and found that whilst periventricular (PV) WMH volume was associated with a greater change in timed walk over follow up (R 2 = 0.12, p = 0.0039), a higher subcortical WMH volume was not. These analyses were adjusted for age and ICV. They next looked at change in WMH volume with time and found that a higher rate of accumulation of PV WMH was associated with a greater increase in timed walk (R 2 = 0.15, p = 0.0453). However there was no relationship described between subcortical or total WMH accrual and change in timed walk. Further data from the study was requested, which was kindly provided. Baseline data from all subjects from OBAS I and II who had had a MRI brain scan and a timed walk at baseline was used to perform our analysis (n = 176).\nGLMs were performed to investigate the relationship between brain structures and gait speed, calculated in metres per second for the analysis. In an unadjusted model, gait speed was predicted by TBV, hippocampal volume and WMH volume, all p < 0.001. Upon adjusting for age, sex, ICV and height, TBV (t 3.61, p = 0.004, partial eta squared 4.3%) and WMH (t −2.80, p = 0.006, partial eta squared 4.4%) significantly predicted gait speed, but hippocampal volume did not (p > 0.05).\nOnly one study looked at the relationship between whole brain, GM or WM volume and grip strength [61] . There were no significant associations except for a positive relationship between WM volume and grip strength at wave 2 (age 73) [61] . This could mean that the relationship between WM volume and grip strength only becomes important with age, once a volumetric threshold is passed. Another study found no association between caudate volume and grip strength [37] . However the basal ganglia may be expected to play less of a role in grip strength than in gait speed. Two studies found a negative association with markers of brain atrophy and grip strength [36, 61] , however one of these studies also looked at change in grip strength over 3 years and found no association with ventricular volume (a marker of brain atrophy) [61] . This means that whilst cerebral atrophy and grip strength appear to be associated, decline in grip strength does not predict cerebral atrophy. A Table 6 Number of studies of brain structure and muscle structure, direction of effect and number of subjects Negative association (n)\nNo association (n) Positive association (n) References Whole brain size and muscle size -1 (70) 2 (311) [26] [27] [28] [29] [30] White matter volume and muscle size --1 (70) [28] [29] [30] [31] Grey matter volume and muscle size 1 (76)* 2 (146)* - [28] [29] [30] [31] Hippocampal volume and muscle size -2 (121) - [27] [28] [29] [30] Cerebellar volume and muscle size -1 (51) - [ 27] Ventricular volume and muscle size -1 (51) - [ 27] *This study found negative associations between some areas of grey matter volume (the right temporal pole and bilateral vmPFC) and muscle size but found the majority of GM areas had no association. At wave 1 in this study there was no association and at wave 2 there was a positive association [61] .\nlongitudinal study including both measures would help explain this relationship further.\nOne study found an association between WMH and grip strength [35] . They found that location of the WMH is important, with some brain areas correlating with grip strength and others not [35] . On looking at the data separated by sex, this relationship persisted in men, but not women, but the study authors think this is due to a sex difference present in their study population, with the men having higher volumes of WMH [32] . Two larger studies found no association between WMH and grip strength, however one of these studies used a visual rating scale from 0-9 to measure WMH, which may lead to differing results than using WMH volumes [61, 64] . The other study also looked at change in grip strength over 3 years and WMH volume at follow up and found no association [61] . WMH are known to predict dementia and cerebrovascular disease but their relationship to physical function is less well understood [110] ."}, {"section_title": "Association of brain function and muscle structure", "text": "Fifteen papers were identified which looked at brain function and muscle structure: DEXA was used in eleven of the studies; BIA in two; and CT for thigh muscle CSA and MRI for neck muscle CSA in the final two papers ( Table 4 ). Measures of brain function were the MMSE, the Community Screening Instrument of Dementia (CSI-D), Trail Making Test (TMT) A and B, digit span and a measure of global cognitive performance (using z scores from multiple cognitive tests). The studies included the Kansas Brain Aging Project [28] [29] [30] and the MHEM study [27] , both mentioned in the above section, and studies from Canada [65] , Chile [67] , the Chinese University of Hong Kong [69, 71] ,Denmark [72] , Italy [73] , Lithuania [74] , Taiwan (the I-Lan Longitudinal Aging Study, ILAS) [75] , and from the USA, the Baltimore Longitudinal Study of Aging [76] and the FITKids Study [77, 78] .\nFrom the Kansas Brain Aging Project, Burns et al. (2010) found a relationship between both MMSE (beta 0.11, p = 0.009) and global cognitive performance (beta 0.12, p = 0.007) and TLM, again grouping AD and control subjects together [29] . They state that in this relationship if the AD subjects are removed from the analysis the results are attenuated, but do not show any results for this. A GLM was performed on the data from the non-demented group supplied to us by the study authors, and we found that neither the global cognitive performance score nor MMSE was predicted by TLM adjusting for age and sex. Adjusting for height and education did not affect this.\nThe MHEM study used 9 different cognitive tests, which they reduced to two factors using principal components analysis [27] . Total neck muscle CSA did not significantly predict variance in either the memory factor or the cognitive processing factor (p > 0.05), however, it did predict 10% of the variance in the NART score (t = −2.12, p < 0.05). The NART score is a measure of childhood intelligence and the authors comment that the finding is the opposite of what they hypothesized, as they found that lower childhood intelligence is associated with larger neck muscle size in old age.\nBerryman et al. supplied the baseline data from their physical training intervention trial. Subjects had performed a MMSE and modified Stroop test and underwent a DEXA scan at baseline [65] . A GLM was performed which showed no association between LBM and MMSE or the Stroop naming, reading or inhibition tasks. However there was an association between the Stroop flexibility task and LBM (t 2.126, p = 0.039, partial eta squared 9.3%), however after adjusting for education and height the effect was attenuated (p > 0.05). This effect was in the opposite direction than might be expected, i.e. bigger muscle mass is associated with a worse score (the Stroop test is measured in seconds to perform the task).\nThe two papers from Chile are a study by Bunout et al. which includes baseline data for a randomized controlled trial (RCT) investigating an exercise intervention in the elderly [67] and a paper by Bites et al. which used baseline trial data from several studies, including the study by Bunout et al., held on their University database [66] . The authors sent one data sheet for both studies as there is a large amount of overlap between the studies (overlap n = 203). A GLM was performed which showed total LM (t 2.38, p = 0.018, partial eta squared 1.4%) and leg LM (t 3.53, p < 0.001, partial eta squared 3.1%) were both associated with MMSE score but arm LM is not. After adjusting for height the relationship between TLM and MMSE became non-significant and between leg LM and MMSE is attenuated (t 2.09, p = 0.038, partial eta squared 1.1%). Therefore it seems that leg LM is driving the relationship between total LM and MMSE.\nFour papers from the Chinese University of Hong Kong were identified which used data from a large prospective longitudinal study looking at bone mineral density in older Chinese adults to assess the relationship between physical and cognitive function [68] [69] [70] [71] . They used two measures of cognitive function; the MMSE and the cognitive score from the Community Screening Instrument for Dementia (CS-CSID). Only one of the papers included the associations between the cognitive tests and muscle mass [69] . They found that in men, but not in women, lower appendicular skeletal mass (SM) at baseline predicted lower MMSE at follow up (for a 2.54 kg increase in appendicular SM, there would a 0.246 change improvement in MMSE, p < 0.001). However after adjustment for age, years of education and baseline MMSE, the relationship became non-significant (P > 0.05) [69] . The authors from this study kindly supplied further analyses of their data upon our request.\nThey performed Spearman's partial correlations, adjusting for age and sex. There was no significant relationship between baseline CS-CSID and total LM or appendicular LM at baseline or 4 years. However baseline MMSE predicted both baseline total LM (partial rho 0.058, p = 0.002) and appendicular LM (partial rho 0.061, p = 0.001) and 4 years follow up total LM (partial rho 0.058, p = 0.002) and appendicular LM (partial rho 0.054, p = 0.005). However, the effect size is small. They also looked at the whether those with lower MMSE at follow up had lower muscle mass at baseline or follow up but found no significant associations (p > 0.05) [69] . Unfortunately the study authors did not supply data for the relationship between change in cognition and change in muscle mass over the four year follow up which would be very interesting in such a large study population.\nPedersen et al. investigated cognition and physical fitness in normal controls, subjects with impaired glucose tolerance and type 2 diabetes [72] . They supplied the raw data for their control group to be analysed. Subjects underwent DEXA for FFM and six cognitive tests (a cognitive z score was computed as a marker of general cognition). FFM did not predict the cognitive z score with or without adjusting for BMI and childhood intelligence (Danish Adult Reading Test, DART). The six individual cognitive tests were then analysed. There was no association between FFM and most of the individual cognitive tests. Also, unadjusted there was no significant association between the letter fluency test (using \"s\") and FFM (P > 0.05), however after adjustment for BMI and DART, letter fluency was significantly associated with FFM (t 2.34, p = 0.02, partial eta squared 7.7%). Letter fluency is a test of executive function and this may indicate that change in this type of cognition with age is associated with FFM in older age. TMT-A test did significantly predict FFM (t 3.08, p = 0.003, partial eta squared 12.3%), but after adjusting for BMI and DART the relationship became non-significant. The TMT-A test is a measure of processing speed. Magri et al. (2006) performed a cross-sectional study looking at postmenopausal women and HRT, however their study also contained a control group of young healthy women which were used for our analyses after the study authors kindly supplied their data [73] . A GLM was performed with MMSE as the outcome/ dependent variable and FFM as the predictor/independent variable as measured by BIA. FFM did not significantly predict MMSE after adjustment for age (p > 0.05) [73] . Adjustments for BMI and educational level did not further affect these results.\nLasaite et al. performed an observational case-control study which looked at women with osteoporosis and healthy controls [74] . The study data for the healthy controls was supplied to us on request. The cognitive measures were the TMT-A and B and a digit span test. FFM was measured using BIA. A GLM was performed on the available data. FFM did not predict TMT-A or B adjusting for age +/− height (p > 0.05). There was a nonsignificant trend with FFM predicting digit span adjusting for age (t 1.96, p = 0.06, partial eta squared 13%), however when adjusted for height too, the relationship was attenuated (p = 0.37).\nThe I-Lan Longitudinal Aging Study is an ageing cohort study in Taiwan [75] . Within the study they performed a t test comparing mean MMSE in those with a normal relative appendicular skeletal mass (RASM = ASM/height 2 ) with those in the lowest 20% for RASM, and they found a significant difference in both men and women. They also supplied the results of a linear regression on our request for further data, which showed that RASM did not predict MMSE after adjusting for age and sex (beta −0.003, p = 0.940). This may mean there is a non-linear relationship between cognition and muscle mass.\nThe Baltimore Longitudinal Aging Study is a large longitudinal cohort study, in which the subjects underwent four cognitive tests and had a mid-femur CT for thigh CSA [76] . No associations between the cognitive tests and thigh CSA were included in the study, but the authors sent the results of a MLR they had performed. They found that none of the cognitive tests predicted thigh CSA, adjusting for age and gender. After adjusting for age, gender and height, the digit-span backward test became significantly negatively associated with thigh CSA (beta −1.55, p = 0.024), meaning those with bigger thigh muscles perform better on the test (a higher score is better in the digit span tests).\nThe final study which looked at cognition and muscle structure is the FITKids study based in Illinois, USA [77, 78] . Two papers from this study were identified; however there were no relevant associations in the papers and the study authors kindly provided us with the raw data on which to perform an analysis. As the subjects were all from the same study the authors provided us with one dataset for the study. We performed a GLM which found that TLM did not predict the Kaufman Brief Intelligence Test, used to assess IQ."}, {"section_title": "Discussion", "text": "This systematic review looked at the evidence for whether: a) brain structure is related to muscle structure, b) brain structure is related to muscle function and c) brain function is related to muscle structure in healthy humans over the life course."}, {"section_title": "Brain volumes and muscle mass", "text": "The relationship between brain structure and muscle structure was first reviewed (see Table 6 for summary). Three studies tested for an association between whole brain volume and muscle mass; the three papers from the Kansas Brain Aging Project are treated as one study [26] [27] [28] [29] [30] . Two studies found a positive association between WBV and muscle mass [26, 27] and one study found no significant association [28] [29] [30] . However, this study found a significant positive association between WM volume and FFM but no association between GM volume and FFM [28] [29] [30] . A different study looked at regional GM volume and found four areas negatively associated with FFM but found most areas to have no association with FFM [31] . Two studies found no association between hippocampal volume and muscle mass [27] [28] [29] [30] . One study looked at ventricular volume and cerebellar volume and muscle size and found no association either [27] . Four of the studies were of older adults and two were of younger adults, and it may be that the relationship between brain and muscle structure varies over the life course. Furthermore if there is a relationship between whole brain volume and muscle size it looks like it may be regional brain volume that drives this relationship rather than total volume. The studies are all cross-sectional and a large longitudinal study is needed to explore these relationships further."}, {"section_title": "Brain structure and muscle function", "text": "Next evidence for an association between muscle function and brain structure was reviewed. Muscle function was either grip strength (5 studies, see Table 7 for summary) or gait speed (13 studies, see Table 8 for summary) apart from in one paper where isometric knee extensor strength (IKES) was used [60] ."}, {"section_title": "Brain structure and gait speed", "text": "Two studies found a positive association between WBV and gait speed [58, 59, 61] , whereas studies investigating the relationship between WM and GM volume and gait speed found less unanimous results. Three studies found a positive association between WM volume and gait speed [48, 49, 61] and two studies found no association [42, 50] . Four studies found no association between GM volume and gait speed [43, 47, 48, 61] but three studies found a positive relationship [49, 50, 54] . There was no evidence that hippocampal volume or cerebellar volume were associated with gait speed [38, 58, 59] . It may be that specific sub-regions of the white and grey matter are associated with gait speed, for example one paper found one study only looked at frontal WM/GM volume not total WM volume [49] . c basal ganglia volume was positively associated with gait speed in this study [43] . d one study only looked at prefrontal area volume within GM [54] . e this study found usual walking speed was negatively associated with WMH but that maximum walking speed was not [50] . f except brainstem WMH which were negatively associated with gait speed in this study [46] . g at wave 1 there was a negative association and at wave 2 there was no association in this study [61] .\nan association between basal ganglia volume and gait speed but no association with total GM and gait speed. Further studies looking at regional brain areas will help to clarify these relationships. Five studies looked at markers of brain atrophy and gait speed; two found a negative association (i.e. more atrophy associated with a slower gait speed) [50, 56, 57] and one found no association [60] , with one finding an association at wave 1 but not at wave 2 [61] .\nNo association was found between change in gait speed over follow up and whole brain, WM and GM volume (mean length of follow up in each study, 3 and 7 years) [42, 61] . However one large study did find an association between ventricular volume and change in gait speed over follow up (mean 4 years) [57] but another study found no association (mean follow up 3 years) [61] . Only one study looked at the relationship between change in gait speed and change in brain structure over time (mean follow up 30.6 months) [39] . They found a positive association between change in gait speed and WM and hippocampal atrophy but no association with GM atrophy. The well-established relationship between cognitive decline and gait speed and cognitive decline and brain atrophy could underpin the possible relationship between brain atrophy and gait speed [4] [5] [6] [7] [8] . It is interesting that the only study to look at both variables in a longitudinal study found significant associations between brain structure and gait speed and further studies like this are needed.\nEleven studies were found which looked at gait speed and WMH, making it the most studied relationship in our review. Seven of these studies found that greater levels of WMH were associate with slower gait speed [45, 50, 52, [56] [57] [58] [59] [60] [61] 64] , but four other smaller studies found no association [46, 49, 50, 53] . Two of these studies found that this is primarily due to the volume of PVH and not subcortical WMH lesions [45, 58] and two papers found that volume of brainstem WMH was associated with gait speed [46, 56] . One small study (n = 14) found no association between gait speed and WMH progression over follow up (19-22 months) [52] . However, change in gait speed was found to be associated with WMH volume in two large studies [45, 57] with another study showing no association [61] . Two studies looked at change in both variables; one found that greater decline in gait speed was associated with greater WMH progression [39] , whereas the other found no association [50] . Further studies looking not just at total WMH volume but their rate of accumulation and location within the brain, and their association with gait speed should help clarify this area."}, {"section_title": "Cognitive function and muscle mass", "text": "Nine studies were found which looked at cognitive function and muscle structure. Table 9 shows the main results from these studies. Three studies looked at a measure of global cognitive performance (a composite score of several tests used in their study) and muscle size and all 3 found no association [27, 28, 72] . The Kaufman Brief Intelligence Test can also be used as a marker of general cognition and it too found no association with muscle size [77, 78] . Seven studies looked at muscle size and MMSE score, which is a useful screening tool for dementia but is not a robust test of cognitive function. Four of the studies found no association between MMSE and muscle mass [28, 65, 73, 75] and one found an association but with a very small effect size [68] . However in one study which showed no association between Muscle size and NART 1 (51) -- [27] Muscle size and TMT-a -3 (887) - [72, 74, 76] Muscle size and TMT-b -3 (887) - [72, 74, 76] h Leg LM was associated with muscle size but not total LM or arm LM in this study [66] . i In an MLR there was no association between MMSE and FFM but when comparing subjects with normal RASM and those within the lowest 20% of RASM this study found a significant difference [75] . j Digit span forwards unadjusted and adjusted was not associated with thigh muscle CSA, but adjusted backwards digit span was negatively associated with thigh muscle CSA in this study [76] .\nMMSE and FFM, when comparing subjects with normal RASM and those within the lowest 20% of RASM this study found a significant difference in mean MMSE [75] . Several of the included studies did not include those with cognitive impairment and it may be that an association does exist between MMSE and muscle size but in a non-linear relation, affecting the frailer older adult more, but that it was not picked up in these studies due to the method of analysis in a linear regression. Overall though in healthy individuals it seems that no such association exists. The final study found an association between leg LM and MMSE but not between total or arm LM [66] . Sarcopenia is known to affect leg and arm muscles differently which perhaps explains this effect [111] . Another screening tool for dementia, the cogscore part of the CSI-D, also found no association with muscle mass [68] . It is well established that gait speed and cognition are associated in older age and these results appear to show that muscle size is not a driving force behind this relationship [4] [5] [6] .\nWith regard to the individual cognitive tests (which measure processing speed and executive function), there were no significant associations [65, 72, 74, 76] , except for the NART (a measure of childhood IQ, which showed a negative association with neck muscle CSA [27] . The authors comment that perhaps subjects with higher cognition are more likely to have sedentary jobs and therefore more likely to lose their muscle mass over time. None of the studies looking at cognition and muscle size contained longitudinal associations therefore whilst these results appear to support no association between muscle mass and cognition; it may be that longitudinal data would show an association, whereby those that lose more muscle with age have a sharper slope of decline in their cognition also. Longitudinal studies will help to elucidate these complex relationships further."}, {"section_title": "Limitations", "text": "In the review protocol the decision was made to write to study authors for relevant associations or data that were not given in the study but could be calculated using the recorded variables. This expanded the number of articles included in the review and the scope that they covered, however this may have led to some bias in which articles responded to the request and therefore what was reported, as study authors who found an association may have been more likely to reply. Of the 79 articles written to 59 replied therefore 25% did not respond. However the studies that did respond included both those which showed a significant association and those that did not. The associations which were sent to us and the associations performed by us have not undergone peer review (e.g. for variable selection when adjusting the models), however we have included this information in our review and the statistical technique used to remain as transparent as possible.\nThe studies included in the review used a wide variety of techniques to record the variables of interest which means it is difficult to compare them (e.g. in a metaanalysis). Gait speed for example was recorded over multiple lengths, using automated and manual techniques and different levels of speed (i.e. maximum or usual pace). The large differences in how gait speed was measured combined with the fact that over longer distances it can become a test of cardiovascular fitness etc. more than a test of muscle function, makes it difficult to compare the results of these studies directly. Hopefully more standardized testing will come about in the wake of resources like the NIH toolbox which includes a proforma for measuring gait speed [112] .\nWhen looking at the relationship between brain size and muscle size or function it is important to make sure that the size of the individual being studied is not acting as a confounding factor (i.e. that large people have large brains and large muscles). This meant that it was important to ensure that some measure of body size had been adjusted for in each association (e.g. ICV, height, BMI). In most of the studies we looked at this occurred but in some it did not and this may lead to a false relationship being reported.\nA relatively wide range of ethnicities are represented in the study, however Caucasian subjects were by far the most commonly studied and there were no studies including those of Arabic or Indian ethnicity. Also most of the studies used subjects in their sixties, seventies or eighties, meaning the validity of our findings for other age groups, particularly children and adolescents is limited.\nFinally, while a few of the studies included longitudinal data, it would be very useful to have more studies looking at the relationships over time as these may be able to highlight potential modifiable factors."}, {"section_title": "Conclusions", "text": "An increasing body of research has now linked brain function (cognition) and muscle function (e.g. gait speed) [4] [5] [6] [7] [8] , however less well studied is the role of muscle and brain structure in this relationship. This systematic review looks at the evidence for whether: brain structure is related to muscle structure; brain structure is related to muscle function; and brain function is related to muscle structure in healthy humans across the lifecourse.\nThe review found evidence of a positive association between whole brain volume and total white matter volume with muscle size and evidence that some areas of regional grey matter volume (right temporal pole and bilateral vmPFC) are negatively associated with muscle size [26] [27] [28] [29] [30] [31] .\nThe review found no evidence of a relationship between grip strength and whole brain volume, however there was some evidence of a positive association between grip strength and WM volume. Markers of brain ageing, that is brain atrophy and greater WMH accumulation, were associated with grip strength [35, 36, 61] . Unlike grip strength, there is evidence that gait speed is positively associated with whole brain volume; this relationship may be driven by total WM volume or regional GM volumes, specifically the hippocampus [58, 59, 61] . Like grip strength, gait speed is also associated with markers of brain aging; WMH accumulation, brain atrophy and WM atrophy all show evidence of either a temporal association with gait speed or change in gait speed with time, with PVH and brainstem WMHs playing a particularly important role, but not subcortical WMH [45, 57] .\nThe evidence overwhelmingly points to no association between cognition and muscle size, except in the case of MMSE where it is mixed, but MMSE is more a screening tool for dementia than a true marker of cognitive function [27, 28, 65, 66, 68, 72, 73, 75] . Longitudinal studies are now needed to explore these relationships over time, which will allow a better understanding of the potential causal relationships."}]