[{"section_title": "Abstract", "text": "To evaluate the longitudinal change in prostate-specific antigen (PSA) and the influence of initial PSA on the PSA change. We retrospectively analysed health examination data collected at Beijing Hospital from March 2007 to November 2011. Men with an initial PSA levels less than 4 ng ml 21 and an annual PSA test for 5 years were enrolled into the study. The men were separated into four groups by the initial PSA level (0-0.99, 1-1.99, 2-2.99 and 3-3.99 ng ml 21 ), and the difference in PSA change among the four groups was analysed. A total of 1330 men were enrolled into the study. , respectively (P50.06). As the initial PSA increased, the percentage of having a PSAV over 0.75 ng ml 21 year 21 and a negative PSAV both significantly increased. Males with a baseline PSA of 0-0.99, 1-1.99, 2-2.99 and 3-3.99 ng ml 21 had a 1.88%, 6.16%, 16.30% and 57.81% chance, respectively, that their PSA would increase above 4.0 ng ml 21 over the following 4 years (P,0.0001). The PSAV has no correlation with the initial PSA level. However, as the initial PSA increases, the chance that males will have an abnormal PSA or PSAV in the future increases."}, {"section_title": "INTRODUCTION", "text": "Prostate-specific antigen (PSA) is a glycoprotein that is primarily produced by the epithelial cells that line the acini and ducts of the prostate gland. PSA is concentrated in prostatic tissue, and serum levels are normally low. Disruption of the normal prostatic architecture, such as by prostate cancer (PCa), allows greater amounts of PSA to enter the general circulation. Therefore, the serum PSA level has become an important marker in PCa screening in clinical practice. However, other prostate diseases, including benign prostatic hyperplasia and prostatitis, may also lead to increased serum PSA levels. In particular, when the PSA level is slightly higher than normal, it can be difficult to interpret and assess its relevance to the pathological results. This lack of specificity has prompted unnecessary prostate biopsies.\nSeveral hypotheses have been proposed during recent years to improve specificity and avoid an excess number of biopsies for benign conditions. Among them, PSA kinetics evaluates longitudinal changes in PSA and may improve the ability to use PSA to diagnose PCa. It has previously been shown that the rate of change in PSA is greater for men with PCa compared with those without PCa.\n1,2 Recent studies have shown that tracking changes that occur in serial PSA measurements may be useful in detecting men at a high risk of death from PCa as well as monitoring the progression of PCa in an active surveillance program. 3, 4 PSA velocity (PSAV) is one index of PSA kinetics, and it is defined as the PSA change divided by the interval between measurements and expressed as ng ml 21 year"}, {"section_title": "21", "text": ". PSAV is primarily used to detect PCa. Some investigators have suggested that a PSA increase of o0.75 ng ml 21 year 21 is an indication for biopsy in patients with a PSA level between 4 and 10 ng ml 21 . 5 However, PSAV in men with a normal PSA level and its relationship with initial PSA are not fully understood, especially in the Chinese population. Therefore, this study was designed to analyse PSAV and related parameters, especially the initial PSA level, in Chinese men with no history of PCa and with an initial PSA level ,4.0 ng ml 21 .\n). A total of 704 cases (52.93%) had a positive PSAV, whereas the others had a negative value. As the initial PSA level increased, the likelihood of patients having a PSAV .0.75 ng ml 21 year 21 and a negative PSAV value also increased. The distribution of PSAV differed among each initial PSA group (P,0.001) ( Table 3) .\nDuring the follow-up, the annual number of cases who had PSA levels .4.0 ng ml 21 was 28, 37, 34 and 46 from year 2 to 5, respectively. In year 5, the cumulative number of cases with PSA levels .4.0 ng ml 21 was 99, and PSA levels .3.0 ng ml 21 was 186. Beginning in the first year of follow-up, the likelihood of patients converting to PSA levels .4.0 ng ml 21 or PSA levels .3.0 ng ml 21 was correlated with the initial PSA level ( Table 4) . A total of 39 cases that had elevated PSA levels greater than 4 ng ml 21 during the follow-up underwent prostate biopsy, and 9 (23.08%) cases were diagnosed with PCa. The biopsy rate was 39.39%.\n. During the five-year follow-up, only 99 cases had PSA levels over 4 ng ml\n; of these cases, 39 underwent biopsy, and 9 cases of PCa were found. Therefore, the results were from a group in which most of the patients had no malignant prostate disease. This longitudinal study showed that in the entire cohort, the mean PSA level increased from 1.18 ng ml 21 at baseline to 1.34 ng ml 21 after 4 years. The mean annual PSA change in this population was 0.04 ng ml 21 year\n, which is similar to previous studies based on Western populations. One data evaluation report of the Baltimore Longitudinal Study of Aging showed that the annual PSA change was 0.18 ng ml 21 in PCa cases and 0.03 ng ml 21 in non-cancer cases. 6 Another 10-year longitudinal study in 4272 men with no evidence of PCa found that the annual PSA change was 0.03 ng ml\n. 7 All these data demonstrate that the PSA level is correlated with age and slightly increases over time in the general population. However, PSA does not increase over time in all individuals. Only 52.93% of the men in the present study had a final PSA level higher than at baseline.\nIt has been demonstrated that several factors can affect PSA levels. Some factors, including benign prostatic hyperplasia, PCa and 5a-reductase inhibitors, may affect the PSA level gradually. However, other factors, such as prostatitis, urinary infection, ejaculation and prostate massage, can cause short-term fluctuations in PSA. PSA variability by chance may be one of the reasons for the diversity of PSA changes in longitudinal studies. The likelihood of having higher PSA levels in the final test increases with the initial PSA level. In men with an initial PSA level ,1 ng ml 21 , the likelihood of a higher final PSA was 46.03%. This value increased to 56.25% in those with an initial PSA level between 3 and 3.9 ng ml 21 .\nPSAV indicates the rate of change in PSA levels over time. Carter et al.\n, an increase of o0.75 ng ml 21 year 21 is an indication of a greater possibility of PCa. Even in men with a PSA level ,4 ng ml\n, PSAV has some power to predict the risk of PCa. 9 Additionally, PSAV is thought to be a clinically useful marker to either predict the presence of highly aggressive PCa or improve the detection rate of life-threatening PCa. From this point of view, PSAV may reduce the most pressing problem of screening: the overdetection and overtreatment of nonaggressive PCa. 10, 11 Because of the variability of a single PSA test due to chance, PSAV results from two serum PSA measurements obtained within a short time interval may have significant bias. To correctly measure PSAV, measuring at least three PSA values over a period of at least 18 months is recommended. 12 In our study, the mean PSA test interval was nearly 12 months, and all the men had five test results, which may have minimized this type of bias. The possibility of men having a PSAV .0.75 ng ml 21 year 21 increased with the initial PSA level: from 0.58% in the 0-0.99 ng ml 21 group to 4.69% in the 3-3.99 ng ml 21 group. However, we found no correlation between the mean PSAV and initial PSA level in this population. Two similar studies based on the Korean population have shown that the initial PSA level is correlated with PSAV. However, one study demonstrated this correlation to be positive, but in the other, it was negative. 13, 14 We do not know the reason for this difference between these two studies. One possible explanation for our results is that many factors can affect the PSA results and cause fluctuation. In the present study, the greater the initial PSA increase, the higher the PSA fluctuation. Therefore, PSAV had no correlation with the initial PSA level.\nWe found that as the baseline PSA increased, the possibility of having PSA levels .4 ng ml 21 increased. This PSA level is indicative of a higher incidence of PCa; therefore, men with a comparatively higher normal PSA level will have a greater risk of abnormal PSA in the future and may need closer follow-up. Similar results were observed in a previous study that evaluated the influence of baseline PSA on longitudinal PSA in black and white patients. 15 In that study, black and white men with a PSA between 3.0 and 3.9 ng ml 21 had a 44.7% and 51.6% chance, respectively, of converting to PSA .4.0 ng ml 21 in the following 4 years. The percentage in our study was even higher. One potential reason for this discrepancy may be ethnic differences.\nOur study had similar findings as previous studies that have suggested that annual PSA testing may be unnecessary for men with very low (,1 ng ml\n) baseline PSA levels. 16, 17 Some studies have suggested that men with an initial PSA level ,1 ng ml 21 have a 99% probability of PSA levels remaining normal (,4 ng ml 21 ) for the next 4 or 5 years. 15 In our study, men with an initial PSA level ,1 ng ml\nhad only a 1.88% chance of having PSA levels .4 ng ml 21 and a 2.89% chance of having PSA levels .3 ng ml 21 in the next 4 years. A previous study performed a population-based screening of Japanese men to determine the optimal screening interval for men with PSA levels ,2.0 ng ml 21 . 18 They found that men with baseline PSA levels ,1.0 ng ml 21 were best suited to a rescreening interval of 4-5 years, whereas annual rescreening was optimal for men with PSA levels between 1.0 and 2.0 ng ml 21 . Because this was a retrospective study, we had no records of symptoms, prostate volume, or medication at the time of PSA testing. Thus, the potential influence of prostatitis, benign prostatic hyperplasia, or 5a-reductase inhibitor treatment could not be distinguished. Another limitation was that only 39.39% of cases with abnormal PSA levels during the follow-up underwent biopsy. Therefore, the potential influence of PCa could not be ruled out. Additional large-scale prospective studies, including biopsy data, are required to evaluate the incidence of PCa and its relationship with PSAV in the Chinese population.\nBased on our results, we conclude that in men with an initial PSA level less than 4 ng ml\n, the PSAV has no correlation with the initial PSA level. However, as the initial PSA increases, the chance that men will have an abnormal PSA or PSAV in the future increases. In men with very low PSA levels (,1 ng ml 21 ), an annual PSA test may not be necessary because they have a very low chance of having an abnormal PSA in the next year. In the future, prospective studies with special attention on potential influential factors, such as medication, prostatitis or PCa, may lead to more precise results on PSA longitudinal change. PSA longitudinal study concerning correlation between initial PSA and PSA change M Liu et al 485"}, {"section_title": "MATERIALS AND METHODS", "text": ""}, {"section_title": "Population selection and analysis", "text": "We retrospectively analysed the health examination data from Beijing Hospital. The numbers of men who had a PSA test each year and had repeat tests during the following years are listed in Table 1 . A total of 1443 men who lived in downtown Beijing visited our hospital for a routine health examination every year, and serum PSA was measured from March 2007 to November 2011. Each man had five PSA measurements. Six men were excluded from the study as a result of PCa history, and 107 were excluded as a result of initial PSA o4 ng ml 21 or abnormal digital rectal examination.\nBlood samples were taken prior to any prostatic manipulations, including digital rectal examination. The electrochemiluminescence immunoassay method was used for the measurement of PSA. The age, PSA and digital rectal examination results were recorded. The research protocol was approved by the Medical Ethics Committee of Beijing Hospital."}, {"section_title": "Statistics", "text": "All statistical analyses were carried out using SAS software, and P,0.05 was considered statistically significant. Pearson's correlation analysis was used to determine the effect of initial PSA on PSAV. The GLM procedure was used to compare the PSAV between different initial PSA groups. The Student-Newman-Keuls test was used to compare the cumulative incidence of abnormal PSA or PSAV in different initial PSA groups. We divided the cases into four groups according to their initial PSA level. Table 2 shows the number of cases and the mean PSAV in each group. There was no correlation between PSAV and initial PSA level (P50.06).\nThe mean PSAV was 0.0460.25 ng ml 21 year 21 (range: 21.34 to 2.02 ng ml 21 year"}, {"section_title": "DISCUSSION", "text": "This study investigated a Chinese health assessment population who had annual PSA tests for 5 years. They had no history of PCa before entry and had an initial PSA level of ,4.0 ng ml"}, {"section_title": "1", "text": "first reported that PSA changes in patients with localized PCa were significantly greater than in men without PCa 5 years before diagnosis. The annual increase in PSA levels in patients with PCa was 3.5 ng ml 21 for every one gram of cancer tissue, which was 10-fold greater than in patients with benign prostatic hyperplasia. 8 As a result of these studies, PSAV has primarily been used to help detect PCa. If the PSA level is between 4 and 10 ng ml"}, {"section_title": "AUTHOR CONTRIBUTIONS", "text": "ML designed and performed experiments, analysed data and wrote the paper. JYW designed, supported and supervised the project. HXS and LZ supervised the study. GW and XMW analysed the data and performed the statistical study."}]