[{"section_title": "An overview of the SARS-CoV-2", "text": "In the late December 2019, a novel virus called Severe Acute Respiratory Syndrome Coronavirus 2 (SARS-CoV-2), also known as 2019 novel coronavirus (2019-nCoV), was reported with an unidentified source. [1] The genomic sequence of this newly emerged virus is highly similar to that of severe acute respiratory syndrome coronavirus (SARS-CoV) with a 79.6% sequence identity. [2] The SARS-CoV-2 causes coronavirus disease 2019 (COVID-19), a respiratory tract infection, with a clinical spectrum ranging from asymptomatic to acute respiratory distress syndrome. On March 11, 2020, COVID-19 was declared as a global pandemic and the sixth public health emergency worldwide by the World Health Organization (WHO). During the recent months, some antivirals (e.g., remdesivir) and anti-inflammatory medications (e.g., tocilizumab) showed acceptable outcomes to viral clearance and amelioration of patients' symptoms. [3, 4] Additionally, following the initial release of some researches for coronavirus vaccine, the spectrum of hope moves from cure to hope for prevention. As of September 19, 2020, 27 vaccines are in Phase 1, 15 in Phase 2, nine in Phase 3, and five have been approved for limited use. [5, 6] However, no approval has been granted by the United States Food and Drug Administration (FDA) so far.\nUnderstanding the genetics of SARS-CoV-2 may open some new avenues for the development of more effective and safer targeted therapies and even new generations of vaccines for this highly mutable coronavirus. In this review, we tried to cover the most critical and up-to-date findings related to the genetics of SARS-CoV-2 to be used for developing the current strategies of diagnosis, and treatment platforms. each mutation in the identical sequences causes a sharp increase in Shannon entropy, and also to omit biases in collection time and location in Shannon entropy analysis. [38] In a recent study, ten hotspot mutations including D614G (23403A>G) on S, L84S (28144T>C) on ORF8, S5932F on nsp14, M5865V on nsp13, L37F (10818G>C) on nsp6, T85I (1059C>T) of nsp2, Q57H (25563G>T) on ORF3a, G251V (26144G>T) on ORF3a, R203K (28881G>A) on N, as well as G204R (28883G>C) on N with a frequency of over 0.10 were reported in SARS-CoV-2 genomes. [35] Due to the role of more mutable regions in viral replication, transmission, and the induced immune responses accordingly, further surveys required to determine the effects of these mutations in the outbreak of SARS-CoV-2. [30, 38, 43] Compared to the genome sequence of SARS-CoV-2 isolated from Asia, coinciding mutation 14408C >T (P323L) on nsp12 with more spot mutations was shown in European viral genomes. [26] Reportedly, co-mutations 241C>T (in 5′ UTR) with 3037C>T (F105F), 23403A>G (D614G), and 28144T>C (L84S), as well as 8782C>T (S75S) with 28144T>C (L84S) and 18060C>T>C (L6L), were found. Also, the leader sequence mutation 241C >T tends to coincide with three mutations including 3037C > T (F105F), 14408C >T(P323L), and 23403A>G (D614G) in the virus isolates extracted from European population with a high COVID-19 infection rate reports, thus, these four comutations may have a pivotal role in raising virus transmission. [31] In a recent study, the co-occurrence of 8782C > T, 29095C > T, and 28144T > C variants were observed in various samples. Moreover, both single-base substitutions (8782C > T and 29095C > T) are synonymous variants; in contrast, 28144T > C caused a nonsynonymous substitution, where lysine was replaced with serine (L84S) on ORF8. [14] Since publishing complete SARS-CoV-2 sequences, various studies have been conducted to categorize globally circulating SARS-CoV-2 population, based on mutation profiles. [41, [50] [51] [52] For instance, a recent study on the genomic distribution of SARS-CoV-2 mutations has grouped detected mutations into five distinct clades, G (241C>T, 3037C>T, 14408C>T, and 23403A>G), GH(241C>T, 3037C>T, 14408C>T, 23403A>G, and 25563G>T), GR (241C>T, 3037C>T, 14408C>T, 23403A>G, and J o u r n a l P r e -p r o o f 28881GGG>AAC), S (8782C>T and 28144T>C), and V (11083G>T and 26144G>T), each clade being identified by a specific set of mutations. Considerably, clades allow tracking of the SARS-CoV-2 genetic diversity and prevalence over time. [33] There is presently little evidence on the clinical and molecular effects of mutations detected in the SARS-CoV-2 genome. The results of several preliminary studies suggested a strong link between raising the case fatality rate with the proportion of viruses bearing mutation 23403A > G (D614G), a mutation outside the receptor-binding domain (RBD), over a time period in different regions, as well as the association of this variant with viral infectivity and greater transmissibility. [53] [54] [55] [56] [57] [58] Using in silico methods, the effect of mapped mutations R408I, L455Y, F486L, Q493N, Q498Y, N501T on RBD, and A930V, D936Y on heptad repeat 1 (HR1) domain identified deleterious and cause instability of spike glycoprotein. [59] Furthermore, the substitution of proline to leucine (P323L) caused by the 14408C>T mutation on RdRp appears to increase mutation rates. The results of studies have suggested that this mutation leads to rigidify the RdRp protein structure and subsequently change interactions of RdRp with other components of the replication or transcription machinery. [26, [60] [61] [62] In addition to P323L, A97V and A185V mutations on RdRp have also been reported to alter the secondary structure of the protein. [62] According to a cohort study, COVID-19 patients with a 382-nucleotide deletion on ORF8 have reportedly illustrated a milder infection compared with patients infected with wild-type virus only. [63] palindromic repeats/CRISPR associated (CRISPR/Cas)-based approach have been employed for genetically detection of SARS-CoV-2. [64] "}, {"section_title": "Real-time RT-PCR", "text": "Real-time RT-PCR, which has been recommended by WHO could be applied as the effective, straightforward, and gold standard method for the detection of SARS-CoV-2 genome in respiratory secretions, serum, stool, sputum, or ocular secretions, [65] [66] [67] although a study indicated that sampling by nasopharyngeal swab is associated with more accurate results than other types of samples. [68] Generally, RT-PCR has been performed as a one-step or two-step format. In the one-step procedure, which is also preferred to identify SARS-CoV-2, a single tube is used for the whole RT-PCR reaction. This method has been considered in SARS-CoV-2 detection due to the possibility of quick start-up as well as reducing the possibility of contamination and pipetting technique errors. [69, 70] However, the possibility of false-negative results is considered to be one of the major challenges in real-time RT-PCR test, [71] which has been reported to range between 21% and 67%. [72] [73] [74] [75] [76] The most important suggested underlying causes include thermal inactivation, storage time and temperature of specimen preservation, inadequate viral material, laboratory error, and test sample transfer limitation. [77, 78] It was also suggested that inappropriate timing of sample collection and deficiency in sampling technique, especially of nasopharyngeal swabs are other reasons for false-negative results of real-time RT-PCR. [79] Furthermore, mutations in the primer-and probe-target regions caused by the rapid evolution of the SARS-CoV-2 genome, infection routes, issues related to sampling (timing and method), and co-infection with other viruses would probably have specific effects on RT-PCR test accuracy. [71, 72, 80] According to the need to test asymptomatic patients or test before quarantine release as well as the high false-negative rate of RT-PCR for detection of SARS-CoV-2, digital, and digital-droplet PCR methods have received attention due to their high sensitivity. In a study, digital PCR has demonstrated 96.3% accuracy for SARS-CoV-2 detection J o u r n a l P r e -p r o o f from pharyngeal swab samples and identified four patients' samples, which were considered negative based on the RT-PCR test. [81] It was shown that digital-droplet PCR capability for SARS-CoV-2 detection with lower minimum detection range is 500 times more sensitive than RT-PCR. [82] The use of the latest laboratory standards, quality sampling at different times from multiple sample types, and selection of RT-PCR kits with the lowest rate of reported falsenegative results can effectively prevent the occurrence of false-negative results. Moreover, considering real-time RT-PCR results along with clinical features, especially computed tomography imaging, can be impactful in the timely diagnosis of SARS-CoV-2 infection and COVID-19 management. [83, 84] According to the association between the quality of specimens and satisfactory RT-PCR results, evaluating cellular content and considering an internal reference such as RPP30 has been suggested. Indeed, the reliability of the SARS-CoV-2 RNA test and detection of false-negative results could be assessed using the cycle threshold cutoff values of RPP30 RT-PCR. [85] Until now, myriads of real-time RT-PCR kits with different qualities and methods of optimization have been introduced for SARS-CoV-2 detection by clinical laboratories and companies around the world, [84, 86, 87] Also, many SARS-CoV-2 primers and probes were designed and published by WHO as well as many laboratories worldwide. Employed primers and probes address different SARS-CoV-2 genomic regions target, including ORF1ab or ORF8 regions as well as E, N, S, and RdRP genes. [88] [89] [90] [91] [92] Additionally, a two-target system with one universally primer for detection of diverse coronaviruses and a second primer set for the only identification of SARS-CoV-2 can be employed in RT-PCR assay. [1, 91, 93] "}, {"section_title": "Loop-mediated isothermal amplification (RT-LAMP)", "text": "J o u r n a l P r e -p r o o f"}, {"section_title": "Journal Pre-proof", "text": "As another diagnostic technique, RT-LAMP is considered as a rapid, effective, and one-step nucleic acid amplification method used to identify different viruses including influenza virus, MERS-CoV, Ebola virus, Zika virus, yellow fever virus, and West Nile virus. [94] [95] [96] [97] This method is performed at a constant temperature using DNA polymerase and four to six specific primers to detect six to eight sequences of the target gene in the only 60 minutes. [98] Recently, RT-LAMP has been applied as an alternative test for SARS-CoV-2 detection. [99] [100] [101] [102] Compared with the RT-PCR method, the RT-LAMP assay is faster, easier, more cost-effective as well as less time-consuming for diagnosing COVID-19. [103] Besides, the sensitivity of this assay has been reported to be similar to the RT-PCR assay. [93] Importantly, the RT-LAMP method can be used as a point-of-care diagnostic test. load. Additionally, they developed direct swab-to-RT-LAMP assay, a simplified version of RT-LAMP without the need for prior RNA isolation. [104] In different studies, in order to use RT-LAMP assay to diagnose SARS-CoV-2 in patients, several primer sets have been designed that target the ORF1ab, nsp3, S, and N genes/regions for optimization of the assay, which are summarized in supplementary Table 1 ."}, {"section_title": "Metagenomic next-generation sequencing", "text": "As another alternative approach, metagenomic next-generation sequencing (mNGS) allows unbiased detection of pathogenic genomes for epidemiological aims, as well as identification of co-infections that may lead to increase morbidity and mortality in emerging infectious diseases. [106] Additionally, this offers an opportunity to identify unknown pathogens with sudden onset in a particular area, similar to the Ebola virus in West Africa. [107] In recent studies, mNGS has been reported as a feasible and efficient approach for detecting a wide range of pathogens, especially the SARS-CoV-2 in clinical samples. [108, 109] Moreover, the amplicon-based metagenomic sequencing approach which is a combination of amplicon-based sequencing and metagenomic sequencing has been utilized to recognize the genome sequence of SARS-CoV-2 and the other microbiome from nasopharyngeal swabs of patients with COVID-19. [108] J o u r n a l P r e -p r o o f 4.5. CRISPR/Cas systems CRISPR/Cas systems are recently characterized as rapid and versatile platforms for nucleic acid detection. [109] Further, the analysis of the results of CRISPR-based methods can be done using fluorescent, lateral flow strips, or agarose gels in less than an hour. [110, 111] Compared to the PCR strategies, CRISPR-Cas diagnostic tools are significantly more sensitive and less costly than PCR-based approaches. [112] Additionally, in a study on the performance of the three technology platforms including mNGS, RT-PCR, and CRISPR in identifying the SARS-CoV-2, results indicated a great sensitivity and specificity of CRISPR-based assay for SARS-CoV-2 detection in clinical specimens with a shorter turn-around time than other methods. [113] Since the beginning of the COVID-19 outbreak, several CRISPR-Cas-based platforms have been developed to detect the SARS-CoV-2, which are compared in Table 2 . For instance, using a combination of CRISPR-Cas12-based assay and LAMP, Broughton et al. were able to reduce the SARS-CoV-2 detection time to around 30 minutes, while maintaining a relatively low sensitivity (10 copies of RNA per ??L). [114] In contrast, All-In-One Dual CRISPR-Cas12a (AIOD-CRISPR ) platform was able to detect 4.6 copies of SARS-CoV-2 RNA per ??L of input in about one hour. [115] "}, {"section_title": "Multiplex diagnostic approaches", "text": "In contrast to the singleplex reaction, in the multiplex diagnostic methods, more than one viral gene can be detected in a short time, which makes these methods acceptable for routine diagnostic tests. Furthermore, the multiplex approach has some advantages including increased sample throughput, as well as a reduced amount of sample required and turnaround time than a singleplex diagnostic approach. [116] Until now, several multiplex assays including FTD21 kit, [117] GeXP assay, [118] Qiagen ResPlex II V2.0 kit, [119] and FilmArray multiplex PCR system [120] have been developed for the detection of respiratory viruses as well as some common human coronaviruses (HCoV-229E, HCoV-OC43, HCoV-NL63, and HCoV-HKU1) in J o u r n a l P r e -p r o o f particular. According to the operation assessment results of AusDiagnostics respiratory multiplex tandem PCR assay including SARS-CoV-2, this assay has shown high specificity (98.4%) and considerable concordance with the reference laboratory for the identification of SARS-CoV-2 by the ORF1ab gene. [121] The QIAstat-Dx Respiratory SARS-CoV-2 panel (QIAstat-SARS) has also been indicated the ability to detect 1000 copies per milliliter with 100% sensitivity and 93% specification by targeting the E and ORF1ab genes from SARS-CoV- which has been shown to be useful for COVID-19 screening. [124] In addition, HCR technology features including the lack of thermal cycler or enzymes need for amplification, as well as the possibility of testing at room temperature, have made HCR technology as a suitable method for quick detection of some viruses such as the hepatitis B and influenza A. [125] J o u r n a l P r e -p r o o f"}, {"section_title": "Using RNA interference as a weapon for combating SARS-CoV-2: possible challenges and opportunities", "text": "RNA interference (RNAi) is a molecular process in which small noncoding RNAs (of endogenous or exogenous origin) match with the target mRNA in a sequence-specific manner and silence its expression. [126] During the past decade, based on the therapeutic potential of RNAi and their abilities to limit gene expression, many of them have been investigated and employed for medical application. NucB1000 against four separate targets (Pre-C, Pre-S1, Pre-S2, and X) of chronic hepatitis B virus (phase I), [142] SPC3649 for blocking miR-122 and its interaction with hepatitis C virus RNA (phase II), [143] pHIV7-shI-TAR-CCR5RZ for targeting several human immunodeficiency virus genes (Tat, Tar, and CCR5) (phase I), [144] and TKM-Ebola against some transcripts (L, VP24, and VP35) of Ebola virus (phase I). [145] J o u r n a l P r e -p r o o f [152] In another study, two siRNAs targeted the SARS-CoV genome at S and nsp12 regions, which led to the depletion of fever caused by the virus as well as SARS-CoV viral loads. Likewise, it reduced acute diffuse alveoli damage in Rhesus macaques. [140] Furthermore, the previous study reported the N protein of SARS-CoV as a VSR in mammalian cells by a cellular reversal-of-silencing assay regarding viral infection. [153] "}, {"section_title": "The use of siRNA-based therapeutics for COVID-19", "text": "In order to target the RNA genome of SARS-CoV-2 and as the first step in the production of antiviral siRNAs, Chen et al. [154] suggested nine potential siRNA targets with 21-25 nucleotides in length within ORF1ab, S, ORF3a, M, and N regions of the SARS-CoV-2 genome and detected those regions as conserved areas. In another study, considering siRNA as a potential therapy for COVID-19, nsp5, and nsp12 were introduced to be targeted using siRNA based therapeutics. [147] Besides, in a study related to the interaction between antiviral RNAi immunity and SARS-CoV-2 has been reported structural protein N of the SARS-CoV-2 as an indicator of viral suppressor of RNAi (VSR) activity, which is a challenge in developing siRNA therapeutic and a factor which opposes the antiviral activity of RNAi in different steps. [155] J o u r n a l P r e -p r o o f A recent study found that host cell entry of SARS-CoV-2 is contingent on ACE2, as well as the transmembrane protease, serine 2 (TMPRSS2) produced by the host cell is needed to cleave and activate spike protein in the invasive process of the SARS-CoV-2. [156] Therefore, siRNA targeting TMPRSS2 and ACE2 can be considered as therapeutic options for blocking SARS-CoV-2 infections, as shown in Figure 2 . Regarding the strategy of inhibiting viral entry for antiviral treatment, Lu et al. [157] reported a reduction in the replication of SARS-CoV in the ACE2-silenced cells using siRNA technology. However, there is a concern that the selective elimination of ACE2 in vulnerable organs to SARS-CoV-2 may have unanticipated outcomes because ACE2 has critical roles in a variety of pathological and physiological processes. [158] Moreover, siRNA targeting of TMPRSS2 has formerly indicated a significant decrease in SARS-CoV entry into Calu-3 cells. [159] Figure 2 briefly shows the use of RNAi as a preventive or therapeutic agent against SARS-CoV-2."}, {"section_title": "miRNAs as the potential therapeutic option for SARS-CoV-2", "text": "In viral infections, many known human miRNAs appear to play an important role in regulating immune responses and interfering with functions of viral genes including reproduction, translation, and expression by targeting viral genes. Consequently, miRNA targeting can be considered as an antiviral therapy approach. [160] In a recent computational study, a list of predicted possible host genes targeted by viral miRNAs and viral genes targeted by cellular miRNAs was presented by computational analysis to understand the basic mechanisms of SARS-CoV-2 infection. [161] Additionally, in a recent study, six antiviral host-miRNAs comprising hsa-let-7a, hsa-miR101, hsa-miR126, hsa-miR23b, hsa-miR378, and hsa-miR98 were predicted to act on nsps, S, and N genes of SARS-CoV2 by cleaving their target sites or translation inhibition. The association between these miRNAs and several viruses, including Hepatitis C virus, Herpes simplex virus 1, and Enterovirus 71 has already been identified. [44] Moreover, in a current study on the prediction of miRNAs in SARS-CoV-2 genomes, seven miRNAs, including miR-8066, miR-5197-3p, miR-3611, miR-3934-3p, miR-1307-3p, miR-3691-3p, and miR-1468-5p were introduced that J o u r n a l P r e -p r o o f were related to viral pathogenesis and host response using KEGG pathway analysis. [162] In another in silico prediction-based study, the SARS-CoV-2 genome was searched for finding virus-encoded miRNA seed sponges that could bind to human miRNA seed sites and subsequently disrupt the interaction of host miRNA with their native targets. Nearly 80 human miRNAs that can interact with the SARS-CoV-2 genes have been identified. According to the literature, these miRNAs are related to pulmonary and cardiac disorders. [163] "}, {"section_title": "DNA vaccine", "text": "The past few years have witnessed a surge in the development of highly efficacious delivery materials for nucleic acids with some remarkable results. Following viral sequencing technology, nucleic acid therapeutics have emerged as promising alternatives to conventional vaccine approaches. Regarding previous strains of coronavirus, some studies had been performed to develop DNA-vaccines. [166, 167] One of the most successful DNA-based vaccines for MERS is INO-4700, which led to durable neutralizing antibodies and T cell immune responses through targeting MERS-CoV S protein. "}, {"section_title": "RNA Vaccine", "text": "RNA-based therapies and vaccines have remarkable potential for the treatment and prevention of a wide range of diseases. [172] RNA vaccines offer a promising alternative to conventional vaccine approaches because of their high potency, capacity for rapid development, safe administration, and low-cost production. However, their application has been restricted until recently by the instability and inefficient in vivo delivery of mRNA. [173] Gradually, some techniques served to reduce toxicity and improve the translation of the mRNA. Various modifications including the incorporation of modified nucleosides (particularly modified uridine), optimization of coding sequences, and stringent purification of in vitro transcribed mRNA by high-performance liquid chromatography have been applied to remove doublestranded RNA contaminants. [174] Given that the 5' and 3' UTRs of mRNA can significantly influence the rate of translation and half-life of the transcript, optimization of the UTRs is of paramount value in the design of mRNA vaccines. [173] As of September 2020, the phase III, (NCT04470427) clinical trial of a novel lipid nanoparticleencapsulated mRNA-based vaccine, mRNA-1273, encoding the S protein of SARS-CoV-2, began in the United States by the Moderna Inc. [175] The German company BioNTech has recently entered into collaborations with Pfizer, based in New York, and the Chinese drug maker Fosun Pharma to develop their mRNA vaccine. They found that one version, called BNT162b2, produced significantly fewer side effects, such as fevers and fatigue, and so they chose it to move into Phase 2/3 trials. On September 12, the companies announced the launch of a Phase 2/3 trial with 43,000 volunteers in the United States and other countries including Argentina, Brazil, and Germany. [171] J o u r n a l P r e -p r o o f In addition to these two RNA-based vaccines, which are entered into the clinical trials, there are at least sixteen other ongoing studies in pre-clinical evaluation (based on WHO's report on September, 2020). In addition to the aforementioned active clinical trials, there is a competition between those in pre-clinical for entering the clinic. Imperial College London, which has developed a \"self-amplifying\" RNA vaccine with the aim of boosting the production of a viral protein to stimulate the immune system. They begun Phase I/II trials on June 15, and have partnered with Morningside Ventures to manufacture and distribute the vaccine through a new company called VacEquity Global Health. Also, CureVac is working on a similar vaccine and launched a Phase II trial of its mRNA vaccine in August. [171] "}, {"section_title": "Epitope-based vaccine", "text": "In addition to the DNA and RNA-based vaccines, epitope-based vaccines are other approaches, which somehow rely on the genetic aspect of SARS-CoV-2. In the new era of medicine, the immunoinformatics approaches have been desperately used to provide putative epitopes using a genome database. Recently, a group of computational scientists obtained immunogenic epitopes for all critical proteins of the virus.\nThis list is composed of top-ranked cytotoxic T cell helper and epitopes common across MHC alleles, covering all predominant human leukocyte antigen (HLA) supertypes in population. [176] By immunogenicity predictive models, researchers provide the immunogenicity of detected peptides and their binding potential to HLA alleles. [177] Currently, a total of 63 peptides with a high immunogenicity potential have been identified for SARS-CoV-2. Identification of a ranked list of immunogenic peptides shows that they can be used as potential targets for SARS-CoV-2 vaccine development, and it accelerates the development pipeline. A detailed screen of candidate peptides based on comparison with immunogenic peptides was used using deposited data in the immune epitope database, which resulted in a de novo prediction from SARS-CoV-2associated 9-mer peptides. [177] It has been shown that these peptides bind various HLA alleles (both class I and class II), although with a higher tendency towards HLA-A:02:01, and can cause activation of effector T cells. In another study to provide a fast-immunogenic profile of these epitopes, linear B-cell J o u r n a l P r e -p r o o f Journal Pre-proof epitopes, along with their sequence, position, and length, were introduced for SARS-CoV-2. In a recent study, 13 Major Histocompatibility Complex-(MHC) I and 3 MHC-II epitopes were recognized to have antigenic properties. [178] These epitopes molecularly dock on toll-like receptor-5 to get binding affinity and are usually linked to specific linkers to build vaccine components. Reportedly, a list of 22 SARS-CoV-2 peptides has been revealed, which have a higher predicted immunogenicity score than their target peptides. Further predictive models and algorithms for the characterization of immunogenic peptides, as well as several in vitro and in vivo validations, are required for the most efficient vaccine development. [177] "}, {"section_title": "Concluding remarks", "text": "Currently, the genome of SARS-CoV-2 has been comprehensively studied. Without a doubt, our understanding of this regard caused molecular-based diagnosis, some targeted therapies, and vaccine developments. Focusing on targeting the SARS-CoV-2 genome via RNAi technology could lead to emerging effective and safe treatments, which probably could prevent disease severity and decrease COVID-19 associated mortality. Although many efforts have been made to reveal the behavior of SARS-CoV-2, based on its genetics, there are still some concerns regarding emerging variation/mutations. These could significantly affect targeted therapies and, more importantly, vaccine development. Moving forward, we must recognize that we have had a new major coronavirus epidemic every decade in the twenty-first century SARS in the 2000s, MERS in the 2010s, and now COVID-19. It is, therefore, a global security priority to advance coronavirus vaccines and to identify international funding support resources, as well as other data regarding their development, manufacture, and storage. This recent outbreak should be considered as a sine qua non to alert the international research community to both react and prepare for the next coronavirus transmission to mammals. We urgently need to manufacture a pan-coronavirus vaccine, and it is something that appears feasible if sufficient resources are provided in Tables   Table 1 the SARS-CoV-2 can either be directed against the SARS-CoV-2 itself or against the ACE2 receptor or TMPRSS2, whose silencing will inhibit"}]