[{"section_title": "", "text": "Ongoing climate change is causing complex and potentially irreversible changes to crop growing conditions across the United States. Increases in average temperatures, accompanied by increases in the frequency of warm days and nights, and higher precipitation variability over the central U.S. are amplifying drought risk (IPCC, 2014). Drought prevalence and risk are projected to increase across much of the U.S. through 2050, with the Rocky Mountain states and the southwestern U.S. experiencing greater drought frequency (Strzepek et al., 2010). These regions, along with the Central Plains, are at high risk of a multi-decadal drought this century (Cook et al., 2015), even as groundwater sources for irrigation in certain areas continue to decline (Steward et al., 2013). Using historical crop yield data, some applied econometric studies have found little evidence of long-run adaptation to climate change in major U.S. row crops. For example, through a comparison of long difference and panel regression coefficients, Burke and Emerick (2016) conclude that adaptation has offset no more than half of the negative short run impacts of extreme heat on U.S. corn yields. Their median estimate of future climate change impacts suggests that such limited adaptation will contribute to decreases in annual yields by 15% in 2050. Much of this is driven by the finding that corn yields decline sharply at temperatures above 28-29 °C (82.4-84.2 °F) (Schlenker and Roberts, 2009;Burke and Emerick, 2016). However, past agricultural adaptations are imperfectly captured, and the prospects of future adaptation-inducing technical progress (Heisey and Day Rubenstein, 2015) or large-scale price feedbacks (Auffhammer and Schlenker, 2014) cannot be precisely forecasted over long time horizons. In the short run, U.S. farmers have few potential tools for reducing downside production risk from changes in drought frequency or intensity. Adoption of irrigation equipment, increased irrigation, or adoption of more efficient equipment are only viable for farmers with access to sufficient irrigation water. Regardless of irrigation availability, no-till crop management and conservation tillage practices can be effective adaptation tools (Powlson et al., 2014) because they reduce soil moisture evaporation and help improve soil water-holding capacity and infiltration."}, {"section_title": "Federal working lands conservation programs, such as the Environmental Quality Incentives", "text": "Program, pay farmers to use such practices. Federal conservation easement programs like the Conservation Reserve Program can also help certain farmers adapt to drought risk by retiring land from agricultural production (Wallander et al., 2013). One recent and increasingly-available option is adoption of drought-tolerant (DT) corn varieties. Non-genetically-engineered (non-GE) DT corn hybrids were commercialized in 2011, while GE DT varieties were released on a limited basis in 2012. Adoption has been rapid in the first five years since introduction: by 2016, just over 22% of U.S. corn acreage was planted to DT varieties (USDA\\ERS, 2016). Currently, most DT corn acreage is concentrated in drought-prone areas of the Western Corn Beltparticularly in Nebraska and Kansas. However, DT corn seed adoption is also significant in the Eastern Corn Belt and in regions of relatively lower corn productivity. Climate and drought risk, local growing conditions, and seed company marketing strategies likely factor into farmers' decisions about which corn varieties to grow. The objective of this study is to determine how drought risk and recent drought exposure lead to the adoption of DT corn in the U.S. We begin by detailing research and development (R&D) of DT corn seeds and the subsequent use of these varieties across the U.S. Next, we motivate our empirical analysis of adoption trends through a state-contingent framework that accommodates farmers' beliefs about future drought based on objective drought risk and exposure. Our discrete choice analysis suggests that exposure to 2013 and 2014 droughts lead to increased adoption of DT varieties, with adoption generally increasing in drought severity. We also find that adoption is increasing in exposure to long-run drought risk. Using model estimates, we predict increasing probabilities of adoption under alternative scenarios of increasing short-run drought shocks and greater long-run drought risk."}, {"section_title": "Research, Development, and Adoption of Drought-Tolerant Corn", "text": "Private-sector research on drought tolerance in corn dates back to at least the 1950s (Cooper et al., 2014). Initial research focused on varietal selection for yield performance under drought conditions. Public-sector research began in the mid-1970s (Edmeades, 2013). In contrast to the private sector, non-profit institutions like the International Maize and Wheat Improvement Center (CIMMYT) began selecting for drought tolerance in tropical varieties using an index of traits. The methods (e.g., conventional breeding, molecular breeding, and genetic engineering) and germplasm (i.e., seeds and plants used in crop breeding research) used in both sectors have improved over the past several decades. To date, the international research community has introduced several hundred varieties of DT corn that are adapted to growing conditions in the U.S. and abroad. 1 By 2012, both non-GE and GE DT corn hybrids had been commercialized in the U.S. Non-GE varieties were developed through the use of molecular breeding. Under this approach, field trial data were assessed to identify a set of high-potential hybrids. The genetic composition of these hybrids were then analyzed, with subsequent statistical predictions about their yield performance and other traits under drought conditions. A subset of these hybrids were then released after further 1 The Drought Tolerant Maize for Africa (DTMA) project  was an international partnership that developed and released DT corn varieties adapted for sub-Saharan growing conditions. Wossen et al. (2017) found average yields were 12.6% higher among DTMA DT corn adopters in Nigerian villages under mild droughts than non-adopters. The Water Efficient Maize for Africa (WEMA) project (2013-18) is a public-private partnership that has also developed and commercialized DT corn varieties for certain sub-Saharan nations (Edmeades, 2013). A successor, the Stress Tolerant Maize for Africa project (2016-19), intends to develop 70 varieties with more resistance to non-drought stresses, e.g., low soil fertility, diseases, and pests (CIMMYT, 2018). field tests across multiple site-year combinations (Gaffney et al., 2015). 2 Non-GE DT corn acreage has increased following its 2011 commercial release (Minford, 2015)."}, {"section_title": "GE drought tolerance involves insertion of a gene from the soil bacterium Bacillus subtilis", "text": "into the genetic material of the corn plant. This gene causes expression of cold shock protein B (cspB), which binds to certain molecules and \"unfolds\" some molecular structures that \"fold\" during drought. This mitigates the effects of drought on photosynthesis, carbon dioxide movement through leaves, and conversion of inorganic carbon. 3 Similar to non-GE varieties, GE DT corn acreage has also increased since commercialization in 2012 (Castiglioni et al., 2008;Waltz, 2014). The percent of U.S. corn acreage planted to DT corn varieties has increased swiftly in the years following commercialization ( fig. 1). In 2012, DT corn (both GE and non-GE varieties) accounted for a little over 2% of national corn acreage. By 2016, roughly 22% of U.S. corn acres were drought-tolerant, a 20-percentage-point increase over five years. This growth is similar to that of insect-resistant (Bt) and herbicide-tolerant (HT) GE corn varieties in their first five years (1996)(1997)(1998)(1999)(2000). Comparisons of adoption trends for these three technologies must be interpreted cautiously because each is used to manage different factors that cause yield loss. Bt varieties are mainly used to manage two insect pests common throughout the U.S. Corn Belt. HT traits are used to manage weeds. In contrast, there are several areas of the Eastern Corn Belt where drought is less common. In addition, there was no universal expectation that HT and Bt traits would subsequently become \"breakthrough\" and widely-adopted technologies. Nonetheless, the pace of early DT corn adoption has been comparable to that of other major recent innovations in corn varieties. Aggregation of national acreage trends masks significant regional variation in 2016 DT corn adoption. A decomposition by land resource region (LRR) illustrates the broad geographical extent of these varieties across corn-growing areas of the U.S. (fig. 2). 4 Roughly 18-24% of corn in the traditional Corn Belt was drought-tolerant, with 12-17% shares in the northern portions of the Great Lakes states. The Great Plains exhibit significant within-state variability, particularly in Nebraska, Kansas, and Texas, though adoption was highest (40%) for cropland over or near the Ogallala Aquifer. High-latitude regions like North and South Dakota and northwest Minnesota had minimal adoption (6-11%) but also tend to have relatively less corn production. As expected, adoption is highly correlated with incidences of recent and severe droughts ( fig. 3). The U.S. Drought Monitor indicates that substantial swaths of the Corn Belt experienced a \"severe\" (category 2) or worse drought in July 2012. One year later, droughts were concentrated in western states, with many counties in Colorado, Nebraska, Kansas, and Texas experiencing \"extreme\" (category 3) or \"exceptional\" (category 4) droughts. These drought patterns are confirmed by spatial variation in July drought risk ( fig. 4), as measured by the standard deviation of the Palmer Modified Drought Index (PMDI). Counties that had one or more severe-or-worse droughts in 2011-15 tended to have higher risk values (1.5-2.5). However, most counties in South Dakota, North Dakota, and Minnesota did not experience significant drought over 2011-15, despite being higher-risk. Conversely, many Texas counties experienced more frequent and/or more severe droughts during 2011-14 than might be implied by their long-run risk. These discrepancies in short-run exposure and long-run risk partially motivate our economic framework, which we discuss next."}, {"section_title": "Economic Framework", "text": "We define the farmer's partial per-acre profit function as   where P represents the corn price, s Y is state-contingent corn yield, DT p is the price premium of DT corn seeds, and {0,1}"}, {"section_title": "DT", "text": "represents the binary decision to use DT seeds. Yields are a function of both drought-tolerant seed use and drought ( s D ). Since seed decisions occur on or before planting time, DT seed use and the seed price premium are not state-contingent. We also assume that farmers do not consider corn prices to be state-dependent. The farmer's objective is to maximize their evaluation of state-contingent profits, choosing whether or not to plant DT corn: where indexed by state s S  . Farmers will choose to use drought tolerant seeds if where"}, {"section_title": "Preference functions", "text": "A number of preference functions W: s    , defined on the set of profit outcomes  s with elements  s , have been used in the literature of choice under risk and uncertainty. We present two commonly used preference functions to motivate our empirical models."}, {"section_title": "Mean Variance", "text": "The objective of a risk-facing farmer with risk-neutral preferences is simply to maximize expected profits. However, some empirical agricultural production models have shown utility maximization models provide better fit than expected profit maximization (e.g., Lin et al., 1974). We choose the mean variance model with preference function  The preference function defines the marginal utility of DT seeds. 5 With this preference function a farmer will choose to use drought tolerant seeds if 10 0. vv \nSubstituting equation 5into the inequality 10 0 vv  and rearranging gives Applying the logarithmic transformation, we have Using the Palmer Modified Drought Index as our measure of drought risk, and noting that the long-run mean is zero, our estimating equation from 14becomes"}, {"section_title": "Prospect Theory", "text": "Expected utility models, while sometimes an improvement over expected profit maximization models, have theoretical shortcomings and do not always reconcile with empirical evidence (e.g., Schoemaker, 1982). For example, individuals often over-weight low probability states and under-weight high probability states (e.g., Kahneman and Tversky, 1979). This can have important implications for farmers' decisions to plant DT corn. In some regions, severe or extreme drought is rare. For these reasons, we also use the following preference function h is a probability weight function and ) ( u is a utility function. Note this model assumes farmers know the probability of each possible state and systematically weight these probabilities. This model can be simplified by noting that the marginal rate of substitution between two statedependent profits is "}, {"section_title": "Empirical Specifications and Data", "text": "Using a weighted probit regression, we estimate the following prospect-theoretic empirical model of DT corn adoption on corn field i in year 2016 Irr is an indicator of field-level irrigation, and i SL is a vector of field-level soil and land characteristics. 7 Per the usual probit model assumption, Due to lack of sufficient drought variation across counties, we are unable to include all year-severity drought combinations from the U.S. Drought Monitor in specification (16). Relative to a base category that aggregates no drought and \"abnormally dry\" conditions (category 0), we include the following severities in these years: moderate (2011-15), severe (2011-14), extreme (2011-13), and exceptional (2014). The motivating economic framework suggested that producers could consider short-run shocks and/or long-run risk when making varietal adoption decisions. However, owing to the usual ceteris paribus regression assumption, it would not be suitable to include both measures in the same specification (i.e., long-run risk will not generally be constant if drought frequency and severity change annually during a half-decade period). We therefore estimate the mean variance where is the standard deviation of the county-level PMDI measure in July for field i in 2016. This is a normalized measure of variability in natural soil moisture over the past century (Wallander et al., 2013). The Agricultural Resource Management Survey (ARMS) is our primary source of data. ARMS is a survey conducted each year on farms' production practices (e.g., crop choice and rotations, tillage operations, conservation program enrollment and assistance), input use (e.g., GE trait choices, chemical applications, and irrigation use), soil and land characteristics, farm business and household financial characteristics, and operator household demographics. We use data from Phase II of the 2016 ARMS, which randomly-sampled one corn field per farm in the survey. The year 2016 is the first year in which ARMS Phase II surveyed farmers about their use of DT corn seeds, for both the 2015 and 2016 seasons. Using a 'base' weight provided by USDA's National Agricultural Statistics Service (NASS), our sample expands to 73.3 million corn acres, representing just over 78% of 2016 U.S. corn acreage (USDA\\NASS, 2016). Roughly 21% of 2016 sample acres were DT (table 1), similar to the national average of 22% (USDA\\ERS, 2016). We merge drought-related weather and climate data with the ARMS data for the regression analysis. The U.S. Drought Monitor produces expert-adjusted observational data through a collaboration of USDA, the National Drought Mitigation Center at the University of Nebraska-Lincoln, and the National Oceanic and Atmospheric Administration. 8 Roughly 91% of the fields in our sample experienced either no drought or abnormally dry conditions (category 0) in 2011 and 2014-15 (table 1). Nearly two-thirds of fields experienced a severe or extreme drought in 2012. More broadly, the 2012 drought affected two-thirds of all land in the U.S., causing agricultural losses estimated at $30 billion (Rippey, 2012). The 2013 droughtsevere for western countiesimpacted only 15% of sample fields. The PMDI is an \"operational\" version of the Palmer Drought Severity Index (PDSI), which quantifies the duration and intensity of long-term drought patterns. The PMDI uses hydrologic models to estimate net soil moisture based on precipitation recharge and losses from evapotranspiration, infiltration, and runoff. The PMDI introduced the concepts of severe, moderate, and extreme drought based on PDSI values (Heddinghaus and Sabol, 1991;Wallander et al., 2013). On average, many of the fields were at risk of experiencing a drought in any given year; the weighted mean of the standard deviation of long-run PMDI was 2.32. Farm-or state-level DT corn premiums are unavailable. To proxy for the price of corn, we use a countywide measure of average basis (Barr et al., 2011). In particular, we subtract the February 2016 cash price from the March futures price for the December contract. The weighted average basis in our sample is -$0.23. Field-level indicators of irrigation use, clay-dominant soils, and highly-erodible land are taken from the ARMS data. Only seven percent of corn acres in our sample are irrigated, consistent 8 In order to produce drought estimates, the U.S. Drought Monitor first relies on data from other drought and precipitation indices; fire risk data; satellite imagery of vegetation health; soil moisture data and model estimates; and hydrologic data. These are synthesized to develop an initial weekly assessment of the percent area of each county that is in one or more of five drought categories, including an \"abnormally dry\" category. This initial assessment is sent to over 350 observers across the U.S. These observers include meteorologists, climatologists, hydrologists, and extension agents whose weather expertise and knowledge of local conditions inform their reports of drought impact. The initial assessment is subsequently revised to incorporate these experts' collective judgment (U.S. Drought Monitor, 2017). with the fact that the vast majority of DT corn was grown on non-irrigated cropland in 2016 ( fig.   5). Roughly 14% of the sample acreage had a primarily clay soil type. Given that clay soils are better at retaining water than other soil types, we might expect lower DT corn adoption under adequate soil moisture. In contrast, adoption on highly-erodible soils might be higher due to a combination of steeper slopes and greater potential for soil detachment, which can contribute to soil moisture loss. Roughly 18% of sample acres are highly erodible. We control for other unobserved countywide land productivity attributes through use of NRCS' National Commodity Crop Productive Index (NCCPI) for corn and soybeans (Dobos et al., 2012). These index values lie in [0,1], with higher values indicating higher inherent soil suitability for growing corn and soybeans. As expected, most fields are suitable for growing corn, with an average county NCCPI value of 0.61."}, {"section_title": "Results and Discussion", "text": "We first discuss the weighted probit regression results and then examine the simulated effects of increasing long-run drought risk or short-run drought exposure."}, {"section_title": "Coefficients and Average Marginal Effects", "text": "We find that long-run drought risk has a significant positive effect on DT corn adoption (table 2). Though insignificant, irrigation and clay have negative (main level) effects on adoption. Consistent with expectations, DT corn tends to be adopted more readily on highly-erodible (e.g., less productive) soils. However, the crop productivity index is insignificant, perhaps because we are modeling farmers' choices to plant a particular set of varietiesnot their broader decision to grow corn. The positive average basis coefficients suggest that farmers in areas with higher corn prices are more likely to adopt DT corn. The results are largely robust to dropping individually insignificant regressors (column 2). Recent-year droughts are also significant determinants of DT corn adoption. Use of these varieties are generally increasing in drought severity for 2013 (column 3) and 2014 (column 4). Interestingly, the 2012 drought did not influence adoption. This could be due to unmodeled rotation effects or a \"short memory\" effect. The latter explanation is unlikely, however, given the magnitude and areal extent of the 2012 drought damages. As with the long-run model, highlyerodible fields are more likely to be planted to DT corn, though not irrigated fields (significant at the 10% level). Average basis becomes insignificant, a likely consequence of multicollinearity with our county drought indicators. This collinearity arises because droughts in the recent past can impact current planting and storage decisions, influencing both spot and futures prices. The average marginal effects quantify the significant drought and drought-risk impacts (table 3). A one-standard-deviation increase in PMDI leads to increased adoption by 21-22 percentage points. For our sample, this would be roughly similar to an area with moderate drought risk becoming an area with severe drought risk. The short-run effects have similar magnitudes and are generally increasing in severity. For example, relative to no drought, adoption would be expected to increase by 21 percentage points after exposure to an extreme drought in 2013. Operators of fields that experienced a severe drought in 2013 and a moderate drought in 2014 were 36 percentage points more likely to adopt than operators on drought-free fields in both years. This appears to be a reasonable point estimate, given: (1) the variation in adoption in our sample, with DT corn comprising roughly 6-40% of corn acres depending on LRR, and (2) DT corn best protects against yield losses (relative to non-DT varieties) under moderate drought. Although of less concern, several of the marginal effects for the soil and land characteristics regressors are significant. In the short-run shocks specification, operators of irrigated fields are 11-14 percentage points less likely to adopt DT corn than operators of dryland fields. This provides some evidence that irrigation use and these varieties could be substitutes in the short run, though we do not rigorously test this relationship. Across specifications, we also find that operators of highly-erodible fields are 8-9 percentage points more likely to plant DT corn varieties. This is broadly consistent with evidence that adoption is lower in counties less suitable for corn and soybean growth (column 1)."}, {"section_title": "Simulations", "text": "To simulate the effects that increased drought would have on expected adoption of DT seeds, we begin by looking at the long-run models based on drought risk. For each of the long-run models, we simulate the impacts of broad (across the board) ten percent and twenty percent increases in drought risk. At the mean drought risk exposure, this is roughly equivalent to one standard deviation and two standard deviation increases and so represents fairly large increases in risk exposure. The simulations for the two models are nearly the same (table 4). For a 10 percent increase in drought risk, the simulation predicts a 5.6 percentage point (or 26.2 percent) increase in DT seed adoption. For a 20 percent increase in drought risk, the simulation predicts an 11.8 percentage point (or 55.3 percent) increase in adoption. Simulating an increase in exposure under the short-run model is more difficult because there are many different ways to increase exposure given that current adoption is modeled as dependent upon as many as five previous droughts. Moreover, the current model specification does not capture potential exposure to severe and extreme drought in the immediately preceding year because 2015 was a year with minimal drought in the main corn-producing regions of the U.S. Due to those limitations, we explore the impact of one and two category increases in three years prior to the current year (2013 in our sample). For the one category increase, we increase all observations in categories 1 and 2 by one category. Since the reduced-form model does not contain a coefficient for category 4 in 2013, all observations in category 3 stay at this level for the simulations. We do not increase category 4 exposure because it is the most severe level. We do not increase the category 0 level because it is unrealistic to push all of these counties into drought. 9 For the two category increase, we increase exposure in category 1 by two categories. Observations in category 2 are increased by 1 category, and all observations in category 3 stay at this level. The simulations for increased exposure show minimal increases in adoption rates (table 5). The reason for this is that there is little difference in the relative impact of droughts of different severity on adoption."}, {"section_title": "Conclusions", "text": "We document and analyze trends in the adoption of DT corn in the U.S., which accounted for 22% of national corn acreage by 2016. This represents rapid adoption, as these seeds were commercialized roughly five years earlier during the 2011-12 seasons. These varieties comprised substantial shares of 2016 corn acreage in dry regions of the Western Corn Belt, especially Kansas and Nebraska, though they were also planted across and beyond the traditional Corn Belt. We find that exposure to drought in 2013 and 2014 contributed to increased adoption in 2016, with greater severity leading to greater DT corn use. Adoption is also increasing in long-run drought risk, as measured by the standard deviation of the PMDI drought measure. Simulated probabilities suggest greater adoption under increasing and increasingly-severe drought exposure, which is expected as largely-unmitigated climate change continues. Recent evidence suggests that the 2012 drought did not significantly affect agricultural advisors' climate change beliefs or adaptation attitudes. However, advisers indicated greater concern about risks from pests and drought arising from 2012 yield damages (Carlton et al., 2016). Against the current backdrop of steep learning requirements for progressing technologies and evolving drought risk (Lybbert and Bell, 2010), further research is needed to assess the potential of drought-tolerant crop varieties to serve as adaptation mechanisms. Although substantial field trial evidence confirms that DT corn has higher average yields relative to non-DT controls under water-stressed growing conditions (e.g., Gaffney et al., 2015;Nemali et al., 2015;Adee et al., 2016), this is not necessarily proof of its adaptation efficacy. Adoption of DT corn is an adaptation tool only if the gains (e.g., yield bump) from these varieties relative to conventional varieties under a changing climate is larger than the gains under a constant climate (Lobell, 2014). One caveat is that we are not able to calculate an average short-run effect of drought exposure on DT corn adoption. Since adoption data are only available for 2016, we cannot completely isolate short-run drought effects from circumstances surrounding the 2012 or adjacentyear droughts. This is of less concern if shocks similar in magnitude, timing, and duration to the 2012 drought are not exceptionally rare events, which seems unlikely under climate change. Indeed, exogenous variation in the severity and geographic extent of drought during 2011-15 permits plausible identification. The ideal dataset, though, would contain repeated field-level observations over time, which would allow us to distinguish short-run effects from recent-year effects. However, to the extent that long-run drought risk will not lessen over the coming years, our analysis suggests that widespread disadoption of DT corn under current economic, technology, and policy environments is unlikely. We do not formally identify barriers to early DT corn adoption. In the context of sub-Saharan Africa, Fisher et al. (2015) find that poor market access, seed and labor availability, and lack of information about the new varieties hampered adoption of DT corn in 2012-13. Such factors are unlikely to significantly impact adoption in the U.S., where there are far fewer impediments to flows of seed, labor, capital, and information. However, seed premiums and farmers' perceptions of possible yield penalties could have decreased early adoption rates in the U.S. We do not formally test this claim due to lack of data. Rather, our results suggest U.S. DT corn adoption is mainly influenced byand is likely to continue to be influenced bydrought exposure and risk. Note: For all types except DT corn, year 1 is 1996, the initial year that HT and Bt traits were introduced in corn. For these, year 5 is 2000. For DT corn, year 1 is 2012, the year in which GE varieties of DT corn were introduced. For DT corn years 1-4, DT corn acreage is taken from various industry sources and then divided by total harvested acreage of corn for grain. For DT corn year 5, the DT adoption rate is calculated from Phase II ARMS data. Since Phase II of ARMS does not survey corn each year, estimates of adoption rates are unavailable prior to 2016. Adoption rates for Bt and HT corn include minimal acreages of stacked varieties (1996)(1997)(1998)(1999)(2000), whereas adoption rates for DT corn include varieties stacked with Bt and/or HT traits (2012-2016).  Observations 1,515 1,515 1,515 1,515 Note: Estimates are expanded to the population of 2016 U.S. corn fields using a base weight. Delete-a-group jackknife standard errors are in parentheses. Significance is denoted as ***p<0.01, **p<0.05, and *p<0.10.   "}]