[{"section_title": "ABSTRACT OF THE THESIS", "text": "Global mean temperatures have risen above pre-industrial temperatures resulting in a sea level rose 0.3 -0.4m between 1901-2010 in the Mid-Atlantic (Kopp et al., 2016) and causing increasingly frequent and intense storms (Trenberth, 2011). These changes in environmental factors are linked to changes in vegetation communities in coastal marsh and adjacent maritime forest. This vegetation change is evident in the appearance of standing dead trees among tidal salt marsh vegetation known as \"Ghost Forests\". This study investigates this transition of maritime forest to tidal saltwater marsh observed in New Jersey, USA. The spatial location of the salt marsh-upland forest edge was mapped using historical aerial photography and the rates of edge migration were measured at eight sites in New Jersey, USA. This study also reviews the present state of knowledge of the geographic scope and potential mechanisms behind forest edge migration along the eastern seaboard of the United States and investigates. The results were compared to data gathered on several of the identified mechanisms to determine the potential role each mechanism may be playing in the forest edge migration. Using aerial photography between 1940 and 2015 at intervals ranging from ten to two years, this study demonstrates that forest dieback is occurring at the forest-coastal marsh interface and iii that salt marsh is expanding into this transition zone. The rates of forest edge migration observed at the 8 sites varied geographically and across the 75 year time period. This variation in forest edge migration rate is likely due to a combination of mechanisms that vary between sites, some as direct mechanisms and others as modulators. The driving mechanisms of migration of the forest edge are likely sea level rise induced changes in groundwater and increased severity of storm surges, as these mechanisms directly affect the soil properties of the ecosystem. These mechanisms are ultimately controlled by climate change induced changes in SLR and storm intensity, but are moderated by other physical phenomena such as changes in tidal flooding and human land use alterations. Figures ........................................................................................................................................... Appendix A: Uncertainty of Rates ................................................................................................. Uncertainty of Rates and Distances ........................................................................................... Appendix B: Detailed Site-Specific Rates .................................................................................... Site Specific Rates ..................................................................................................................... Nantuxent ............................................................................................................................... Fortescue ................................................................................................................................ Belleplain ............................................................................................................................... Delmont ................................................................................................................................. Cape Shore ............................................................................................................................. Little Egg ............................................................................................................................... Tables   Table 1: Dates, spectral resolution, and source of imagery used for digitization ------------------- Table 2: Horizontal Positional Accuracy (HPA) values for each imagery year obtained from Metadata, derived using methods outlined. Final HPA value was used for further calculations. - Table 3: Photograph Clarity Ranking and Digitization Uncertainty ---------------------------------- Table 4: Final Uncertainty Values calculated by adding HPA and Digitization Uncertainty ----- Table 5: DSAS output statistics with description and units associated. ------------------------------ Table 6: End Point Rate (EPR), Weighted Linear Regression Rate (WLR), and Average and Maximum distance between 1940 and 2015 treelines for each site. ---------------------------------- Table 7: Dominant forest type lost between 1987 and 2015 compared to dominant cover type of the same area in 2015 . Figure 1: A concept map summary of mechanisms behind forest edge migration as compiled from relevant literature. Figure 2: Locations of Study Sites relative to USGS wells, SETs and existing survey locations. Figure 3: Locations of the 30 control points used to determine horizontal positional accuracy. - Figure 4: Examples of imagery with good and bad clarity. The images above is two separate sites showing 1961 imagery. In image 4a the border between salt marsh and treeline is fuzzy where as in image 4b the boarder is much more distinct. ---------------------------------------------------------- Figure 5: Examples of imagery with shadows that distort the forest edge -------------------------- Figure 6: Examples DSAS analysis methods. The distance from the baseline to each treeline is calculated. The distance from the baseline between two years can be subtracted to obtain the distance between the treelines. This distance along with the knowledge of ------------------------- Figure 7: Average and maximum distance between 2015 and 1940 treeline. This is a representation of how far the forest has migrated over the study period.      "}, {"section_title": "vii", "text": ""}, {"section_title": "List of", "text": ""}, {"section_title": "--------------------------------------------------------------------------------------", "text": ""}, {"section_title": "List of Figures", "text": ""}, {"section_title": "-------------------------------------------------------------------------------------", "text": ""}, {"section_title": "-----------------------------Figure 8: Rates of change between each available year for all sites ----------------------------------Figure 9: Rates of change between each available year for the Nantuxent Site with uncertainty values ----------------------------------------------------------------------------------------------------------Figure 10: Rates of change between each available year for the Fortescue Site with uncertainty values. ----------------------------------------------------------------------------------------------------------Figure 11: Rates of change between each available year for the Delmont Site with uncertainty values. ----------------------------------------------------------------------------------------------------------", "text": ""}, {"section_title": "Introduction", "text": "Global mean temperatures have risen on average 1.5°C above pre-industrial temperatures caused partly by anthropogenic greenhouse gas emissions (IPCC, 2018;IPCC, 2014). This increase in global mean temperature is affecting many global systems. While sea levels have been rising since the last glaciation, the increase in global temperatures has caused thermal expansion of the warmer ocean water and land ice melt resulting in an increase in rate at which the sea is rising (Nicholls and Cazenave, 2010). The rate of sea level rise (SLR) has increased from the pre-twentieth century rate of 2 mm/yr average to the current average rate of 3.5 mm/yr (Cooper et al., 2008). As a result, global mean sea level has risen 0.19m between 1901 and 2010 (IPCC, 2014). In the mid-Atlantic United States, rates of SLR exceed 5mm/year, and in New Jersey, sea level rose 0.3 -0.4m between 1901-2010 (Kopp et al., 2016). In addition to SLR, the increase in average global temperature is also expected to increase the frequency and intensity of storms, due to increased water vapor in the atmosphere and warming ocean waters (Webster et al., 2005;Trenberth, 2011). Stronger and more frequent storms will not only cause damage to the coastal landscape due to wind damage, but when coupled with sealevel rise, flooding events and storm surges will be exacerbated (Fagherazzi et al., 2019). Saltwater tidal wetlands are some of the most vulnerable ecosystems to these climate change repercussions. This vulnerability extends to the maritime forest directly adjacent to saltwater wetlands. Rising seas cause changes to both surface water inundation and groundwater levels that may affect the health and distribution of upland vegetation. These effects on the health of the vegetation may make it harder for the ecosystem to recover after the disturbance caused by the more extreme and frequent storms. These perturbations of the status quo have caused mortality of upland vegetation and expansion of salt marsh vegetation into the previously upland area. A number of possible mechanisms have been proposed to be driving this phenomenon, some better understood than others. The following study reviews the present state of knowledge on the geographic scope and potential mechanisms behind forest edge migration along the eastern seaboard of the United States. The spatial location of the salt marsh-upland forest edge was mapped using historical aerial photography and the rates of edge migration were measured at eight sites in New Jersey, USA. The results were compared to data gathered on several of the identified mechanisms to determine the potential role each mechanism may be playing in the forest edge migration."}, {"section_title": "Literature Review", "text": ""}, {"section_title": "Saline Tidal Marshes and Climate Change", "text": "Saline tidal marsh plants are adapted to live in specific moisture and salinity regimes, controlled by tidal influx and the structure of the groundwater, which creates well-delineated vegetation zones (Bertness and Ellison, 1987;Strange et al., 2008;Barlow et al., 2010). In the mid-Atlantic United States, low and mid-elevation zones are dominated by native grass halophytes. At lower elevations, where flooding occurs during most of the tidal cycle and the salinity is similar to that of the bay water, Spartina alterniflora (Smooth Cordgrass) grows in dense monocultures. Further upland in the midelevations zones where flooding only occurs during high tide and the salinity is slightly lower, a mix of Spartina patens (Salt Hay), Distichlis spicata (Desert Saltgrass), and Juncus gerardii (Blackgrass) grow in patches. The upland edge of mid-Atlantic salt marshes is dominated by various trees and shrubs that, while halophytic, are less so then the grasses of the low and mid-elevations. This zone is occupied by Juniperus virginiana (Red Cedar), Iva frutescens (Marsh Elder), Chamaecyparis thyoides (Atlantic White Cedar), and Pinus rigida (Pitch Pine). The differences in the salt and flooding tolerances of the species are well defined. S. alterniflora can withstand a salinity up to 30 ppt and near constant flooding where S. patens can only handle salinities up to 20 ppt and requires a period during the tidal cycle where it is not flooded (Hester et al., 2001). The trees and shrubs at the upland edge of the marsh can only handle low concentrations of salt. C. thyoides has shown to be negatively impacted by salinity at concentrations as low as 0.4 ppt (McCoy and Keeland, 2006). This variation in tolerances of the marsh species creates the zonal pattern of growth characteristic of these marshes because of the specific hydrology in the marsh. The groundwater zone of a typical salt marsh is often vertically stratified with the higher density of saltwater underlying lower density freshwater, mixing in the transition zone where they meet (Barlow et al., 2010). This dynamic causes fine scale differences in soil salinity and moisture content which is strongly linked to the vegetation zonation on the marsh. Because the low elevation zone is flooded the most by the daily tides, the groundwater in this zone is saline and interacts with the surficial floodwaters. While the mid-elevation zone is only strongly flooded during spring tides and dries down during neap tides, the groundwater has a constant flow of salty groundwater upward caused by the pressure exerted by the saltwater wedge. This constant upward flow of saltwater combined with evapotranspiration and the lack of floodwaters makes this zone of the marsh saline. Moving inland closer to the marsh-upland interface, the groundwater is influenced more by the outwelling of the freshwater aquifer, eventually becoming almost completely fresh around the area the marsh transitions to marsh forest (Wilson et al., 2015). As the groundwater transitions from saline to fresh, the vegetation community composition is determined by the salinity and inundation tolerances of the various species (Donnelly and Bertness, 2001). Because the changes in salinity and flooding happen at a fine scale, competition at the borders between each vegetation zone occurs as fringing species compete for the space based on minute differences in environmental tolerances. This interaction between the groundwater and the vegetation community makes the system highly sensitive to the changes that can occur due to SLR. Preliminary research conducted by the US Geological Survey into how groundwater levels change in relation to SLR on barrier islands suggests that the water table will rise as sea level rises due to not only increased salt water intrusion itself, but also how the saltwater intrusion effects fresh groundwater drainage (Carleton, Unpublished USGS Report). Freshwater enters the groundwater in upland environments and some of that water drains through wetlands (Harvey and Odum, 1999). As saltwater intrudes into the wetland, the freshwater that is moving toward the drainage outflow is now slowed due to the presence of more saltwater. This decrease in drainage outflow causes the water table to rise due to the maintained, or potentially increased, pressure of inflow from the upland due to maintained or increased precipitation events (i.e., creates a damming effect backing up fresh groundwater outflow) (Carleton, Unpublished USGS Report). The rise of the water table also decreases drainage potential for the area which would cause the water table to rise higher creating a positive feedback loop for the system (Nuttle and Portnoy, 1992). The presence of human alterations, specifically old farming ditches or parallel grid ditching, may also play a role in moderating this rise in groundwater. The farther the water must travel to drain, the slower the drainage occurs especially in wetland soils (Harvey and Odum, 1990). It is possible that if human drainage pathways are located near the upland edge, they will decrease the distance in which the freshwater must travel to reach an outflow which therefore alleviates the pressure of the system. Both the changes in groundwater and surficial flooding affect salinity and saturation of the soils within the marsh. These physical changes can occur both episodically from events such as storm surge, or more permanently, caused by changes in tidal extent due to SLR. As sea level rises, the pressure of the change in mean sea level and mean high water causes the water table to rise (Knott et al., 2018). The groundwater salinity regime will also move laterally inland and the water table will move vertically towards the surface (Bjerklie et al., 2012). Because these changes could be seen up to a few kilometers from the coast (Knott et al., 2018), this movement will cause changes in salinity and saturation across the whole marsh ecosystem. These changes in the fundamental components of the marsh soil chemistry can have a compounding effect. Changes in salt content effects the marsh ecosystem, but it also causes other changes in soil chemistry. The addition of more salt to the soil increases the solubility of minerals and other solutes which changes the soil chemistry and can alter biogeochemical cycles (Herbert et al., 2015;Hopfensperger et al., 2014). For example, the processes behind both nitrogen uptake and carbon sequestration (Ardon et al., 2013;Ardon et al., 2018;Neubauer et al., 2013). These changes in salinity and saturation and the subsequent changes in soil chemistry cause can effect vegetation health, growth, and regeneration (Fagherazzi et al., 2019;Kerney et al., 2019). Climate change driven changes in salinity regime and flooding on the marsh have begun to be documented. S. alterniflora has been found to be encroaching on areas that were previously exclusively occupied by the high marsh species S. patens and D. spicata (Donnelly and Bertness, 2001). The change in environmental conditions that could allow S. alterniflora to outcompete S. patens could be extremely minimal. The fine scale gradient of salinity and flooding on the marsh platform changes quickly in response to any increase in sea level. These changes in the gradient, even if small, changes the location in which S. alterniflora outcompetes S. patens. This new line of delineation between areas that is occupied by S. alterniflora and S. patens creates a successional movement inland, referred to as marsh migration."}, {"section_title": "Marsh Migration", "text": "This migration of the marshes inland goes by several names in the literature; marsh migration, transgression, and transition all refer to the die back of trees at the interface of the marsh and adjacent upland and the eventual transition to emergent marsh vegetation. The upland vegetation adjacent to salt marshes are not adapted to handle a highly saline, frequently flooded environment that becomes the norm of their habitat as sea levels rise into the salt marsh. The increased salinity causes stress to the upland vegetation causing leaves to brown or fall and decreases both the ability to uptake water and the organism's nutrient metabolism heavily affecting growth rates (Fagherazzi et al., 2019, Fernandes et al., 2018. The stress on the upland vegetation is especially evident in the tree seedlings as seedlings have been documented to have a much higher sensitivity to changes in salinity as compared to their full-grown counterparts (Kerney et al., 2019;Fagherazzi et al., 2019). Therefore, the influx of sea level driven saltwater intrusion can cause widespread mortality of tree seedlings (Conner and Askew, 1993). This mortality can result in forest stands of stressed upland vegetation with limited to no regeneration potential (Fagherazzi et al., 2019;Kerney et al., 2019). Marsh migration has been documented at a number of locations across the Northeast USA coast (Kirwan and Gedan, 2019;Smith, 2013;Schieder et al., 2018). For example, Smith (2013)  The implications of the lack of regeneration potential caused by sea-level rise can be exacerbated when coupled with the increase in severity and frequency of storms. Increasing storm severity can lead to a concomitant increase in the magnitude and longevity of storm surges (Fagherazzi et al., 2019). Inundation of saltwater can intensify the soil salinization, deplete O2, and potentially create toxic compounds, which will, in turn, intensify the stress on upland vegetation (Fagherazzi et al., 2019). The impact of this influx of water can also last for several years after the storm (Dai et al., 2011). The storms also cause physical damage to the upland vegetation by causing breakage, defoliation, and uprooting caused by the extreme winds, and flood scars caused by floating debris transported by waves (Fagherazzi et al., 2019). The physical damage combined with the stress caused by the increased soil salinity can lead to mortality of the stressed stand (Conner and Inabinette, 2003;Fagherazzi et al., 2019). The repercussions of these storm events increase exponentially if more than one storm occurs in successive years (Douglas et al., 2018). The death of these stands is not only loss of habitat, but also could lead to more significant issues like changes in hydrology (Dai et al., 2011). Coastal habitats are not spatially fixed, but rather are continually in spatial flux, responding and shifting to various forcing factors, including sea level rise (SLR). Through the process of vertical accretion of sediment and organic matter, the surface elevation of a salt marsh will rise in relation to sea level, i.e., the marsh can continue to grow 'up' into a rising sea (Cahoon and Guntenspergen, 2010;Titus, 1988). When sea level rises faster than the rate of marsh accretion, salt marshes are \"drowned\" and replaced by tidal mud or sand flats and eventually open water (Cahoon and Guntenspergen, 2010). The shoreline edge of the salt marsh is especially susceptible to large amounts of erosion from the battering of the storms and drowning due to sea-level rise (Nicholls and Cazenave. 2010). The mortality caused by both the effects of SLR and storms do, however, facilitate the migration, or sometimes referred to as transgression, of the marsh inland. The taller trees and shrubs that grow at the upland edge of the marsh shade out lower stature marsh grasses such as Spartina alterniflora and Spartina patens. Die back of the trees and shrubs opens up the canopy, with increased light levels these marsh grasses and other higher marsh plant species such as Phragmites australis expand inland. The combination of storms and sea-level rise drives changes in competition at the upland edge of each marsh vegetation zone creating environmental conditions that better suits low marsh plant species. The facilitation of marsh migration inland as well as maintaining vertical accretion rates that surpasses SLR and reducing marsh shoreline erosion is on the agenda of many climate change adaptation plans."}, {"section_title": "Region Specific Issues", "text": "In the Mid-Atlantic, there is another species that adds complication to this migration process. The non-native common reed, Phragmites australis (henceforth referred to as Phragmites), was introduced to the Mid-Atlantic in the early 1900s and now occupies the upland edge of most salt marshes in this region. Phragmites, reproducing both by clones and seed dispersal (Hazelton et al., 2018), readily invades any habitat within its growth tolerance range and is known for establishing quickly and flourishing in disturbed habitats (Rice and Rooth, 2000). These characteristics make Phragmites a highly invasive species and can result in dense monocultures within its range (Chambers et al. 2003, Windham, 2001). This range, however, is limited by Phragmites lower salt-tolerance (Moore et al., 2012) and higher soil saturation requirements. Because soil salinity increases in proximity to water in these coastal wetlands, Phragmites is only able to invade seaward until it is out-competed by the more salt-tolerant S. patens or D. spicata. As soil saturation decreases toward the upland, the Phragmites eventually reaches an area where the soil is too dry for this hydrophilic plant or too shaded, an area usually occupied by woody upland plants. Due to the mortality of the upland shrubs and trees caused by the climate change-induced increase in flooding and salinity, Phragmites takes advantage of the open habitat and invades further inland (Smith, 2013). The invasive nature of Phragmites changes the structure and species composition of the marsh plant community and may impact the habitat value of the marsh for some marsh-dwelling fish, shellfish and wildlife species (Able and Hagan, 2003). This threat has been of concern to ecologists and has resulted in the species being a target for management over the past few decades (Hershner and Havens, 2008). However, in light the need for marshes to migrate inland to keep pace with sea-level rise, Phragmites has some characteristics that could prove the species more helpful than harmful (Smith, 2013;Hershner and Havens, 2008). Phragmites has proven to be better at sediment trapping and contribute more below ground biomass adding to the substrate elevation which leads to higher elevations overall added every year than in the areas held by native species (Rooth and Stevenson, 2000). Its accretion potential combined with its ability to readily invade into habitat opened up by the loss of marsh forest trees could make Phragmites a suitable intermediate succession species for marsh migration. However, Phragmites' assistance with the migration of the ecosystem inland can only be beneficial if the Phragmites is also migrating its seaward boundary inland. If Phragmites were to maintain a stationary seaward boundary and not allow any migration of the mid-elevation marsh plant species, the native species that live in front of that boundary could be \"squeezed out\" as the marsh is lost to inundation and erosion over time."}, {"section_title": "Summary of the Literature", "text": "The literature review on the interaction between climate change and marsh/upland ecosystem was summarized in conceptual model (Figure 1). While climate change induced changes in sea level and storms is the ultimate cause of any changes observed, there are a number of proximate causes steaming from these changes that have varying impacts to the marsh/upland communities. Changes in sea level causes increase extent of tidal surface inundation and saltwater intrusion into the groundwater of these coastal systems. Storms also impact the system by changing surface inundation due to more intense storm surges and increased freshwater entering the system from precipitation. The existence of human alterations to marsh and forest structure are moderators of these changes. The presence of mosquito management or farming ditches may create good drainage paths increasing groundwater outflow and may be providing pathways for bay water to move farther into the marsh. Diking for farming often causes a sediment deficit in the marsh due to lack tidal flow and removal of crops. Ultimately, these changes in groundwater and surface inundation cause changes in soil salinity and saturation which in turn also causes changes to soil chemistry. These changes in soil characteristics facilitate the change in vegetation communities."}, {"section_title": "Knowledge Gaps", "text": "The existence and mechanisms of marsh migration due to climate change has been documented as reported here. There are, however, some gaps in knowledge this project aims to address. First, while the marsh forest retreat inland has been documented at a number of locations most of the studies have been of either limited time duration (i.e., less than a decade) or over a long time span (i.e., several decades) but between just two time points (Kirwan and Gedan, 2019;Smith, 2013;Schieder et al., 2018). Variability in the rate of forest edge migration at higher temporal frequency over a decadal time spans has not been well documented. Observing that rate of forest edge migration at fine temporal frequency will elucidate how steady or variable the rate of forest edge migration has been over time. Examining the rates of forest movement at decadal or sub-decadal frequency in concert with the driving factors should help to increase the quality of future projections and inform management. A finer timescale of observation will also illuminate the validity of some of the prevailing theories on the importance of surface inundation, groundwater, and storms as leading mechanisms behind marsh retreat. How groundwater changes with SLR and how groundwater pumping effects that dynamic has not been well documented. While the general movement inland of the salt groundwater has been modeled (Bjerklie et al., 2012), the effect that has on the freshwater aquifer is not entirely understood. Meanwhile, humans are also changing the levels of the freshwater aquifer by pumping groundwater for human uses. The upland edge of the marsh may respond differently to climate change effects on groundwater depending on if the freshwater aquifer is being depleted by humans or not. Examining the correlation between observed changes in existing long-term groundwater wells and changes to the marsh forest could provide a proof of concept for further empirical experiments on groundwater at the marsh/upland interface. At the local level, furthering the understanding of how the legacy of human alterations to the marsh system affects how climate change impacts the salt marsh ecosystem is critical. Most of the salt marshes in New Jersey have been previously farmed and/or been extensively ditched for mosquito control. Human interactions with tidal flow could change how the salt marsh landscape responds to SLR. Years of salt hay farming can cause a decrease in sediment elevation due removal of the crop and diking. The diking limits vertical accretion by restricting tidal flow which decreases the flux of suspended sediment onto the marsh surface. This could mean that previously farmed salt marshes are lower in elevation and therefore more susceptible to flooding then a nonfarmed marsh. The addition of ditching for mosquito control alters the tidal flow of the marsh in an extreme way. Water can now travel farther into the marsh then it naturally would. This could create pathways for floodwater to get to areas of the marsh it would not naturally reach thus increasing the susceptibility of the marsh to climate change driven flooding (Bhattachan et al., 2018. The ditching could also be outflow locations for groundwater that may alter the repercussions of a rising water table due to saltwater intrusion and damming of fresh groundwater. Because these alterations could be both a hindrance and an accelerator of change, determining nuanced relationship between impacts from increased access for rising waters, the impacts of better drainage for freshwater, and these impacts combined on groundwater levels is important for both modelling and management. In adjacent upland habitats, as the individual trees die, the forest canopy thins facilitating the growth of understory herbaceous and shrub vegetation and the marshforest edge moves inland. Which plant species tend to occupy this space, however, has not been well documented. Taking an in-depth look at what vegetation is occupying areas that were previously forested will help further understand marsh succession and will inform what can be expected in the future. Additionally, understanding the types of forest lost during this transition could assist in the forecasting of future forest loss. Increasing knowledge of marsh succession should improve projections of future change and hopefully lead to more informed management decisions regarding marsh protection, creation and restoration."}, {"section_title": "Project Objectives", "text": "Given these knowledge gaps, this project aims to answer 4 questions: 1. At what rate is the interface between salt marsh and marsh forest moving inland and has that rate changed over time? 2. Which, if any, of the identified mechanisms (i.e. changes in tidal surface inundation, groundwater, and storms) appear to be contributing to the "}, {"section_title": "Methods", "text": "Eight areas of interest along the Delaware Bayshore and Barnegat Bay back-bay system along the Atlantic coast of New Jersey, USA were selected to span a range of geographic and environmental conditions. These areas were partly determined by proximity to the United States Geological Survey (USGS) groundwater well sites and existing Surface Elevation Table (SET) sites. A search area of a kilometer from either a USGS well site or a SET site was created because it was assumed that the data from these sites could apply to land within this distance. The 1 km search area was visually scanned for a saltmarsh fringing maritime forest, and the final areas of interest were selected based on imagery availability and clarity searches ( Figure 2)."}, {"section_title": "Determining Rates of Forest Edge Migration", "text": "Historical aerial imagery for years between 1940 and 2015 (Table 1Error! Reference source not found.) were compiled and were assessed for accurate georegistration to the New Jersey State Plane projection system. At each site, the seaward forest edge (henceforth referred to as the \"treeline\") was visualized on screen and headsup digitized at a 1:5000 scale. These digitized lines were checked for accuracy at a 1:2,500 scale. The digitized lines were then analyzed using the USGS Digital Shoreline Analysis System (DSAS). This software calculates rates of forest edge migration statistics and is typically used to quantify the erosion or accretion of shorelines. For this study, DSAS will be used to quantify the displacement of the treeline. DSAS uses the digitized lines from the imagery and an arbitrarily created baseline to compute rates of forest edge migration ( Figure 6). The DSAS software assumes the input line is ground truth. This is a problem when the input lines are digitized and have a level of inherent uncertainty. This is why DSAS also requires an uncertainty value, in meters, that qualifies the rates given by DSAS. While the default uncertainty is 10 m, the methods outlined by Ruggiero et al. (2013) were utilized as it takes into account both the air photo/geo-referencing and digitization uncertainty for each individual line. The individual air photograph and geo-referencing uncertainty lie within the horizontal positional accuracy (HPA) of the photograph. While some of the more recent years (2007)(2008)(2009)(2010)(2011)(2012)(2013)(2014)(2015) have HPAs within the metadata (Table 2, Column 2), this was not available for any of the photos from years prior to 2007. The HPA was determined for each of these photographs by identifying landscape features identifiable in each date of imagery and digitizing these locations to serve as ground control points. The same 30 landscape features (i.e. ground control points) were digitized at 1:5,000 scale for each year (Figure 3). These ground control points were spread across the sites to take into account the variability of the photographs by site. The point digitized using the 2015 imagery, which had the highest metadata given HPA, was used as a pseudo-ground truth point. For each year, the average distance from all 30 control points to their corresponding 2015 pseudo-ground truth point was determined, and that average distance was designated as the HPA for that year (Table 2, Column 3). Comparing the metadata given HPAs for 2012 and 2007 to the derived HPA for those same years show that the methods used are overestimating the HPA for those years. This means the HPAs for the unknown years are likely overestimated. Therefore, if the year was given an HPA in the metadata that value was used (Table 2, Column 3). Digitization uncertainty combines the human error in the digitization of the line caused by the spatial scale and the error caused by the variability in clarity of photographs ( Figure 4) and the presence of shadows ( Figure 5). This uncertainty was determined by first categorizing each the photograph for each site for each year into a clarity category. These categories ranged from clearest (1) to least clear (4) ( Table 3, Column 3, and 7). Three photographs from each category were randomly selected using a number generator. At each of these photographs, a section of the treeline was digitized three times, each time with the visual of the last digitized line removed to prevent the previously digitized lines from influencing decisions. The maximum distance between all three lines was taken every 10m for the site. These maximum distances were conglomerated for each photo category and averaged. The outcome of this calculation rounded to the same whole number for categories 1 and 2 (7m) and the same for categories 3 and 4 (14m). Each of the photographs was assigned their corresponding digitization uncertainty (Table 3, Column 4, and 8). More information on uncertainty rates is provided in Appendix A. The overall uncertainty was calculated by adding the HPA and the digitization uncertainty together (Ruggiero et al., 2013). This uncertainty was then assigned to each corresponding year's digitized line (Table 4, Columns 5 and 10). With the uncertainty value determined, DSAS was then run to determine rates of forest edge migration. DSAS creates transects from the given arbitrary baseline and measures the distance from the baseline to each year's digitized line along the transect (Figure: 6). The transects were set 10m apart. To get complete statistics, the treelines are required to pass through all of the input treelines. To be able to meet this requirement, some of the generated transects had to be deleted or adjusted due to the sinuosity of the treelines. DSAS creates eight statistics based on these distances ( Table 5). The rate values that DSAS outputs are either based on just the oldest and most recent lines (End Point Rate or EPR) or uses a regression to find the best average rate among all the years (Linear or Weighted Linear regression or WLR). Any rate that DSAS will compute when all lines are input into the program will be an average rate of forest edge migration over the total timeframe and does not take into account variability over the years. Therefore, to get a better understanding of factors impacting rate of forest edge migration, rates were calculated for each time step (i.e. individual points or IP rates). DSAS outputs a file of the locations of all of the input lines transect intercepts and the intercepts distance from the baseline. Using the baseline distances, the distance between one input line to another was calculated, and a rate of forest edge migration was calculated between each of the years (i.e. between 2007 and 2012, 2012 and 2015, etc.)."}, {"section_title": "Examining Potential Drivers", "text": "The three major mechanisms that, based on the literature, could be shaping the way treeline migration is occurring are changes in tidal surface inundation, groundwater, and storms. These mechanisms were examined separately."}, {"section_title": "Tidal Surface Inundation", "text": "To understand the effects of sea-level rise induced increases in tidal surface inundation, the observed marsh retreat was compared to the New Jersey Projected Marsh Retreat Zone data (Lathrop et al., 2014). This dataset takes into account the slope of the land, the tides, and anthropogenic barriers to determine areas the marsh could retreat by 2050, given three sea-level rise scenarios. The data uses a modified bathtub model of sea-level rise with a baseline sea level taken in 2010 and therefore is projecting the marsh retreat based on tidal surface inundation of the marsh. Comparing the location of the observed 2015 treeline (as mapped herein) to this future marsh dataset shows how well the observed migration corresponds to an estimate of migration based solely on projected future tidal surface inundation (I.e. the location of the MHHW elevation contour). This comparison was performed both visually and analytically. A visual interpretation of where the 2015 treeline sat within the modeled marsh retreat zones was conducted. To better compare how much area was expected to convert to the observed conversion, the modeled area was calculated both on the marsh side and the upland side of the 2015 treeline. The marsh area denotes the areas already surpassed by observed treeline, and the upland area denotes areas that have been predicted to convert by 2050 but as of 2015 have not.\nThe 2015 digitized treeline was compared to the New Jersey Projected Marsh Retreat Zone data. Upon visual comparison, all of the sites sit within areas modeled to be areas that the marsh could retreat given SLR scenarios from the 2010 sea level ( Figure   17). The Nantuxent and Little Egg sites 2015 treeline sits within the area of retreat for the 1ft SLR scenario. The Reedy Creek site's 2015 treeline sits mostly within the 1ft SLR scenario with a small section of the treeline within the 2ft scenario retreat area. The Fortescue, Cape Shore, and Delmont sites' treelines sit mostly in the area of retreat for the 2 ft. scenario with a few small areas crossing into the 3ft scenario retreat area. The modeled area was calculated on both the marsh and upland sides of the 2015 treeline ( Figure 188). Except for the Nantuxent site, all sites' area of observed changed surpassed the total area predicted to convert over the three SLR scenarios. For all sites, the area of observed change is composed mainly of areas predicted to convert under 1ft of SLR. The Cape Shore and Belleplain sites have both surpassed 60% of the total area predicted to change over all three scenarios. Specifically, at the Cattus Island site, the observed retreat has surpassed nearly 95% of the area predicted to convert at 1ft of SLR, and 75% of the area predicted to convert at 2ft of SLR. While most of the area surpassed at each of these study sites was mostly areas predicted to convert under 1ft SLR, all sites, except Nantuxent, have shown forest edge migration into the areas that were predicted to convert only after 2ft or 3ft SLR from the 2010 sea level."}, {"section_title": "Changing Groundwater Levels", "text": "The USGS has monitoring wells located all around the country. The Jones Island monitoring wells (USGS Site 110097 and 110096), the Oyster Lab monitoring wells (USGS Site 090089 and 090306) and the Belleplain site (USGS Site 090510) are located near the Nantuxent, Cape Shore, and Belleplain sites, respectively. These monitoring wells are within a kilometer of each site. This distance is assumed to be close enough to relate to the groundwater levels at the site. The trends in groundwater changes were examined and compared to the rates of forest edge migration over time.\nThe Jones Island and Oyster Lab USGS groundwater sites have both a deep and shallow well. The Belleplain groundwater sites only has a shallow well. The Oyster Lab and Belleplain shallow wells showed an increase over time both at a rate of +5.5mm/yr (Figure 21 and 23). The Jones Island well showed a very slight decrease over time at a rate of -0.001mm/yr ( Figure 19). The deep wells both show large amounts of change over the timeframe (Figure 20 and 22). The Oyster Lab deep well shows an overall negative trend, decreasing about 15ft over the 29 years at a rate of -0.5ft/yr ( Figure 22). The Jones Island deep well is also decreasing about 67ft over 45 years an average rate of -1.5ft/yr, but the rate changes over the time period (Figure 20). The water drops at a steady rate until around 1990, where it begins to stabilize. The well then begins to drop at a much more rapid rate between 2005 and 2010. After 2010 the rate begins to slow again but is still on a downward trajectory. The Nantuxent, Cape Shore, and Belleplain sites are within 1km of USGS groundwater wells, where the groundwater data can be compared to the rates of forest edge migration over time (Figure 24). The Nantuxent rates remain relatively stable over the entire study time period, except for an increase in rate for the 1991-1995 time period. The groundwater in during this period was stabilizing at around 40 ft. below the land surface in the deep well ( Figure 25 \nThe trees living within each site are likely most impacted by the groundwater that is being measured in shallow groundwater wells because the well is measuring within the root zone. Therefore, changes occurring in the shallow wells are changes that can directly affect tree health. Two out of three of the shallow wells are increasing at a rate comparable to average rates of SLR. The Oyster Lab and Belleplain wells are both increasing at about 5.5mm/yr and the average rate of SLR for the Mid-Atlantic was reported to be around 5mm/yr (Kopp et al., 2016). The Jones Island shallow well showed an extremely slight decrease in depth over the period which is not concurrent with the other sites. This could be because the well is located in close proximity to a farm that may be pumping this groundwater for irrigation. The rates of increase in these shallow groundwater wells is rising similarly to SLR. No clear trend in the magnitude of the IP rates of forest edge migration was observed at the sites that are experiencing a rise in groundwater. The Belleplain site experienced very extreme forest edge migration of the marsh upland where the Cape Shore (Oyster Lab) site experienced much lower migration. There is also no apparent increasing rate of forest edge migration over time as the IP rates are highly variable over time for both sites, while the groundwater rate is quite steady. The research conducted by the USGS (Carleton, in press) on the rise of the water table due to damming of fresh groundwater due to salt water intrusion is supported by this increasing shallow water table at rates comparable to SLR. There is also potential for the increase in water table to effect storm water runoff drainage potential that could further increase the water table (Nuttle and Portnoy, 1992). This positive feedback could create higher water tables then would be predicted based solely on SLR. Thus direct SLR-derived changes in tidal inundation may be more of an accelerator of forest edge migration rather than a direct driver. However, while the data assembled here is sparse, the implications are intriguing and deserve further targeted research."}, {"section_title": "Storms", "text": "National Oceanic and Atmospheric Administration (NOAA) created a dataset of the top ten highest water levels for its long term tide gauge stations. These dates and water levels correspond to the worst storm surges that have occurred over the time period available from each long term tide gauge station. Two of these tide gauges, the Atlantic City gauge (NOAA Gauge 8534720) and the Cape May gauge (NOAA Gauge 8536110), are located near the sites. While the NOAA tide gauge water level may not directly correlate to the water levels at each site, it is assumed that if the gauge is showing abnormally high water levels, the sites located near the gauge would also be experiencing abnormally high water levels. Because of this, the rates of forest edge migration were compared to the dates of these top 10 extreme high water levels and inspected for visual correlation.\nThe top 10 extreme storm surges from the closest NOAA long term tide gage were compared to each of the site's rates. It is assumed that the extreme surge events noted for the most proximate tide gages likely also affected the sites bordering the same body of water. The top 10 highest water levels for both tide gages all fall within the date range of this study except for the storm on 1/23/2016. These storms were compared to spikes in the IP rates of forest edge migration in the same time period (i.e. if a storm were to take place in 2013, the IP rate of forest edge migration would be examined for the 2012-2015 time interval). An IP rate of more than 4m/yr in a given time period was classed as a spike. This threshold was chosen by averaging the uncertainty of the rates, calculated using DSAS suggest methods, of the IP rates. Using this threshold decreases the probability that the change observed was due to the uncertainty of the data. For the sites that border Delaware Bay, Nantuxent, Delmont, Fortescue, Belleplain, and Cape Shore, the Cape May tide gage, which has records back to 1965, was used for comparison ( Figure 30). The Nantuxent site is 27 miles from the tide gage, Fortescue is 23 miles, Delmont is 17 miles, Belleplain is 16 miles, and Cape Shore is 7.5 miles away. The top 3 worst storm surges within the study's date range were Hurricane Sandy on 10/29/2012, Hurricane Gloria on 9/27/1985, and a historic Nor'easter on 10/29/2011, with storm surges of 1.05m, 1.02m, and 0.98m above MHHW at the tide gauge, respectively. The height of the storm surge cannot be directly extrapolated to all of the sites. The 2011 Nor'easter along with another major storm that occurred on 8/28/2011 that had a storm surge of 0.89 occurred in the 2007-2012 time frame. A spike in IP rates occurs at the Fortescue, Delmont, Belleplain, and Cape Shore sites during that time frame with IP rates of forest edge migration of +6.5m/yr, +9.5m/yr, +16m/yr and +9.9m/yr respectively. During the 1978-1987 time frame, in which Hurricane Gloria occurs, the IP rates of forest edge migration for Fortescue, Delmont, and Belleplain were relatively high at +6.0m/yr, +6.8m/yr, and +11m/yr respectively. Hurricane Sandy occurred in 2012 but it is known that the aerial photography for 2012 was taken before the hurricane, so any reaction of the system would have been shown in the 2012-2015 time series. In that time series, the IP rates of forest edge migration of Fortescue, Delmont, and Cape Shore all decrease significantly from the previous time step. The highest IP rate of forest edge migration observed at the Belleplain site occurs after the 1992 storms which both reached a storm surge of 0.9 m above MHHW at the tide gauge. The reaction of the IP rates of forest edge migration to these storms is not similar across all sites. The rates of forest edge migration for Nantuxent do not seem to react to any of the extreme storms captured by the Cape May tide gauge. This could be because Nantuxent is almost 30 miles away from the Cape May tide gauge and much farther up the estuary and does not have similar storm surges to what is found at the tide gauge. A For each time step that had one or more of these extreme storms, the IP rate of forest edge migration at the Delmont site is +4m/yr or higher. The IP rate of forest edge migration at the Fortescue site was above +4m/yr for all time steps with extreme storms present except the 1977 storm. The Cape Shore site's IP rate of forest edge migration is above +4m/yr after the storms that take place in the 1991-1995 and 2007 -2012 time steps. Within these two time steps, the storms occurred very close to each other with the 1992 storms occurring 11 months apart and the 2011 storms occurring 2 months apart. The Barnegat Bay sites, Little Egg, Reedy Creek, and Cattus Island are compared to the extreme storm surges recorded by the Atlantic City long term tide gage, which has data back to 1911 ( Figure 31). The Little Egg site is 15 miles from the tide gage, Reedy Creek is 50 miles, and Cattus Island is 45 miles away. The tide gage is located on a pier that goes out into open ocean, but the sites are all within Barnegat bay. This means the height of the storm surges cannot be assumed to directly correspond to the inundation experienced at these sites. What can be assumed is that a major storm was in close proximity to the sites and could have caused some storm surge. Reedy Creek and Cattus Island are far enough away from the site where it cannot be assumed that the storms were of the same intensity at the site as at the tide gauge. Therefore, any correlations drawn from this storm data could be inaccurate and some storms that affected this northern area more intensely could be missed. The top ten extreme storm surges recorded at the Atlantic City gauge were different than the top ten recorded by the Cape May site. The top 3 worst storm surges within the study timeframe were the \"Great Atlantic Hurricane\" on 9/14/1944, an extreme Nor'easter on 12/11/1992, and Hurricane Sandy on 10/29/2012, with storm surges of 1.335m, 1 .292m, and 1.267m. The changes in IP rate for the Cattus Island and Little Egg sites, are all below the 4m/yr threshold which make any spikes uncertain. Because of this, it was concluded that the IP rates do not show any correlation to the storm events. The Reedy Creek distance traveled is less than the spike threshold except for the except the 1991-1995, 1995-2002, 2007-2012, and 2012-2015 time periods. These time slots were examined for correlation. During the 2012-2015 time slot, in which Hurricane Sandy occurred, and there was a jump in IP rate to +5.77m/yr. Because the tide gauge is 50 miles from the Reedy Creek site, NJFloodMapper was used to make sure there was actually storm surge at the site. Based on NJFloodMapper's Sandy Storm Surge layer, the Reedy Creek site was impacted by surge and therefore the spike in IP rate in the years following Hurricane Sandy can be correlated to the storm. There was also a large increase in IP rate in the 1991-1995 where the extreme Nor'easter of 1992 and another extreme storm at the end of 1991 occurred. All of the extreme storms showed increases in IP rate in the same time period except two extreme storms occurred during the 1970-1978 time period during which the IP rate dropped into the negative which denotes growth of the treeline toward the bay.\nBased solely on the top 10 worst storm surges in the time period, there appears to be a relationship between intense storms and IP rates of forest edge migration. After almost every significant storm surge, there are high IP rates of forest edge migration at one, if not multiple sites (Figure 30 and 31). The Belleplain site has extreme variability in IP rates over time and each large spike in IP rate was observed in the time period immediately after the major storm surge events. The 1978-1995 period for the Delaware Bay saw 5 major storm surges and for the Belleplain site, IP rates remained extremely high at over 10m/yr for all 17 years. The period between 1995 and 2007, during which the Cape May tide gauge recorded no storm surges high enough to make the top 10, the IP rates of forest edge migration dropped below 5m/yr. When the back-to-back 2011 storms hit followed by Hurricane Sandy in 2012, the IP rates at Belleplain returned to over +10m/yr. While this example is an outlier in both magnitude of IP rate increases and correlation to 8 out of the 9 major storms within the time frame for Delaware Bay (2016 was in top 10, but outside of study period), most of the other sites show increases in IP rates after some of the major storms. For Delaware Bay's nine major storm surges, Delmont showed high IP rates after 7 out of the 9 major surges, Fortescue after 6, and Cape Shore after 4. Reedy Creek showed high IP rates after 5 out of the 9 major storms for Barnegat Bay. The variability in reaction to a significant storm surge may have to do with storm trajectory or length, which were not examined in this study (Morton and Barras, 2011). The storm path, intensity, or duration can lead to increased death at one site over the other due to the storm surge height or exposure time. Further investigation into the variability of the spatial extent of storm surge events along the coast could be crucial to understanding if a storm will cause a death event."}, {"section_title": "Transition Zone Vegetation Change", "text": "The area within the boundaries of the earliest (1940) and the most recent 2015digitized treeline represents the area of land that once was forested and transitioned to another vegetation community type, hence forth referred to as the transition zone. Within this area, the boundaries between areas dominated by a Phragmites and shrub community and those dominated by a native marsh grass community (Spartina sp., J. gerardii, D. spicata, etc.) were visually interpreted and heads-up digitized with the 2015 imagery, using 2012, 2007, and leaf-on 2010 imagery to assist in the differentiation among vegetation types. The total area of vegetation community change, as well as the area of each of these sub-types, were calculated. In conjunction with this analysis, current and historical land use -land cover (LULC) data contains classifications of wetland type adapted from the National Wetlands Inventory (NWI). The LULC data for each of the sites were acquired from the New Jersey Department of Environmental Protection (NJDEP) for 1986(NJDEP) for , 1995(NJDEP) for , 2002(NJDEP) for , 2007(NJDEP) for , 2012(NJDEP) for , and 2015. For the corresponding years transition zone (the area between the 1940s treeline and the corresponding year's treeline), an analysis of percent area of the classifications within the boundaries was performed (the 1987 treeline was used for the 1986 LULC analysis). Additionally, the 1986 LULC was extracted for the area of transition between 1987 and 2015. Extracting the area of each 1986-2015 transition zone from the 1986 LULC gives a glimpse into the types of forest lost over the greatest timespan available. The areas of each forest land cover type was calculated and the dominant land cover type was recorded.\n"}, {"section_title": "Site Characteristics", "text": "The marsh area adjacent to each of the treelines were examined for the existence Average elevation of each sites 2015 transition zone was calculated using the USGS National Elevation Dataset digital elevation models (DEM). The resolution of the DEM was 3m. The 2015 transition zone was extracted for each site and the average of the cells was recorded. The distance from the approximate center of the transition zone to the closest bay shoreline was also measured."}, {"section_title": "Results", "text": ""}, {"section_title": "Rates of Forest Edge Migration and Site Characteristics", "text": "A detailed analysis of each site can be found in Appendix B. The overall results as well as a comparative assessment of trends is discussed below. At all sites, the forest edge has migrated inland and some sites have done so substantially. The average distance the forest edge migrated at each site ranged from 3m to 606m, with maximum distances ranging up to 784m inland (Figure 7). There was 170 ha of total area of forest lost between 1940 and 2015 over all eight of our sites. The average rate of forest edge migration was calculated given the distance between the 1940 and 2015 treelines, reported as end point (EP) rate. A weighted linear regression (WLR) forest edge migration rate was calculated based on all input treelines ( Table 6). The EP rates and WLR rates for all sites were within 1 meter of each other. Given that the WLR rate takes into account all of the input years, potentially giving a more accurate representation of the data, this rate will be discussed hereafter. The WLR rates are highly variable across sites (Figure 7). Some sites, like Belleplain and Delmont, averaged WLR rates of forest edge migration over 5m/yr while other sites like Nantuxent and Little Egg, do not exceed 0.5m/yr (Figure 7). Belleplain exhibited the highest rate of forest edge migration with a WLR of 9.2m/yr while Little Egg exhibited the lowest with a WLR of only 0.3m/yr. The rates of forest edge migration for each time step were also compared across sites and will henceforth be referred to as the intermediate period (IP) rate ( Figure   8). 6 out of 8 of the sites exhibited increasing WLR rates over time (Figures 9-14). The remaining two sites, Little Egg and Cattus Island, the WLR rates are slightly decreasing over time (Figures 15 and 16). "}, {"section_title": "Impacts of Mechanisms", "text": ""}, {"section_title": "Visual Analysis", "text": "When comparing the digitized species habitat within the transition zones across sites, the Belleplain site was excluded from the analysis. The area of forest lost at Belleplain has a complicated habitat structure that does not follow usual marsh zonation likely due to the land history previously discussed. The area is heavily pockmarked with small ponds and the plant species intermingle, both issues making it near impossible to distinguish the species. When comparing the remaining sites, it is clear that Phragmites/Shrub habitat is prevalent at all sites (Figure 32 and 33). Phragmites/Shrub habitat holds the highest percent area at 6 out of the 7 sites and is the only plant habitat at the Cape Shore and Little Egg sites. Native grasses are present at 5 out of the 7 sites. The Delmont site is the only site to have native grasses be the dominant habitat. At the Fortescue site, while Phragmites/Shrubs are the dominant habitat, there is a significant amount of native grass habitat also present."}, {"section_title": "Land Use/Land Cover Analysis", "text": "The LULC classifications were compared to the digitized habitat for context. For ease of comparison, Figure 33 shows the 2015 LULC color-coded to match the classifications of the digitized habitats. When the 2015 LULC coverage is compared to the digitized habitats, most of them are similar. Nantuxent, Fortescue, and Delmont were all very similar to the digitized habitat. Each site classified some of the area as forest, which could be due to differences in treeline delineation between this study and the National Wetlands Inventory. The Cape Shore and Reedy Creek LULC classifications show much more forest habitat for these sites, which may be a similar issue with the discrepancy between treeline delineation. The LULC for Cape Shore does show some native grass habitat, which was coded as \"Saline Marsh\" that was not delineated when digitized. The Little Egg site showed the most difference between the LULC and the digitized habitat. This is likely due to the previously forest habitat as a whole being smaller than the NWI minimum mapping unit of 2 acres. The LULC from NJDEP was extracted, and the percent area was compared across years and sites ( Figure 34). Some NJDEP classifications were combined due to similarity or for simplicity. Over the time period, the sites have shown fluctuations in cover type. It is important to note that the 1986 and 1995 LULC did not classify Phragmites in its category. If Phragmites were present in those years, it is likely classed as \"Herbaceous Wetland\" or in a scrub/shrub classification. At the Nantuxent site, the classes \"Brushland/Shrubland\" and \"Mixed Scrub/Shrub Wetlands\" shown in the years 1986 and 1995 respectively could potentially have contained Phragmites. If this is true, the LULC showed an increase in Phragmites habitat from 1986 to 2007 then a decrease in Phragmites in subsequent years. At the Fortescue site, determining whether the \"Deciduous Scrub/Shrub Wetland\" class could have contained Phragmites is less straight forward. Because there is still a substantial amount of \"Deciduous Scrub/Shrub Wetland\" in the 2002 LULC when they began classifying Phragmites as its own class, it is unclear if the class above can be assumed to be Phragmites. The site overall saw a similar trend in the increase then decrease of Phragmites in the years between 2002 and 2015. Over that same time period, however, the \"Saline Marsh\" stayed very steady. Since the areas that the LULC were clipped to were created using the digitized 1940 and 2015 treelines, it is possible that the issue with where NWI delineated the treeline is different than the one digitized for this study. This issue could explain why there is \"Mixed Wooded Wetlands\" classified in the previously forested habitat and could be skewing the results. The Delmont site has a large amount of \"Herbaceous Wetlands,\" which is defined as \"wetlands dominated by various herbaceous species that are not connected or associated with tidal waters. Leersia oryzoides, Phalaris arundinacea, Nuphar lutea, Polygonum arifolium, P. sagittatum, Typha latifolia, and Phragmites are species that may dominate this cover type\" (LULC Metadata). Even though the channel that runs into the area is tidal, it may be classified as \"Herbaceous Wetlands\" and not \"Saline Marsh\" because there is a freshwater stream running into the area as well, which could be influencing the species composition. The species living in this may be a mix of saline species and freshwater species that could satisfy the \"Herbaceous Wetlands\" classification requirements. The Belleplain site's LULC classifications show evidence of the rapidly changing environment during these time periods. The change from mostly \"Atlantic White Cedar Wetlands\" to mostly \"Deciduous Wooded Wetlands\" then back to \"Atlantic White Cedar Wetlands\" in the 1995, 2002, and 2007 LULC mapping suggests that the Deciduous classification could be a mislabeling. However, the conversion to \"Deciduous Scrub/Shrub Wetland\" dominance in the 2012 and 2015 LULC does concur with both successional theory and the aerial imagery. The Cape Shore site's LULC denotes large amounts of \"Deciduous Scrub/Shrub Wetlands\" and \"Mixed Scrub/Shrub Wetlands.\" Based on the aerial imagery, the areas in the digitized habitat within the Phragmites/Shrub area appear to be dominated in areas by shrubs. There is a distinct fluctuation of \"Saline Marsh\" over the time period. The variation in \"Mixed Scrub/Shrub Wetlands\" could be due to the previously mentioned Due to limitations with the aerial photography at the Cattus Island Site, the 1986 LULC was excluded from the analysis due to lack of aerial photography interpreted comparison. The LULC at the Cattus Island site remains almost steady over the years. There is a spike in the Phragmites cover in 2002 that decreases in the subsequent years. The fluctuations in the LULC are mainly due to changes in \"Deciduous Scrub/Shrub Wetlands\" and \"Coniferous Wooded Wetlands\". These fluctuations could also be attributed to discrepancies in location of treeline between the LULC and this study."}, {"section_title": "Composition of Forest Lost", "text": "The dominant forest type lost between 1987 and 2015 at all sites were some form of wetland forest (Figure 35). Cattus Island, Little Egg, and Belleplain all lost mostly \"Atlantic White Cedar Wetlands\". Delmont, Nantuxent, and Fortescue all lost a form of \"Scrub/Shrub Wetlands\". Delmont and Nantuxent dominant forest cover type was \"Mixed Scrub/Shrub Wetlands\" and Fortescue had \"Deciduous Scrub/Shrub Wetlands\". The remaining sites had wooded wetlands as their dominant forest cover lost with Cape Shore losing \"Coniferous Wooded Wetlands\" and Reedy Creek losing \"Mixed Forested Wetlands\". When these dominant forest type lost are compared to IP rate of forest edge migration over time, there is no clear relationship. While the data are limited, there may be a relationship between the dominant forest type lost and the dominant 2015 land cover (Table 7). Two out of three Atlantic White Cedar Wetlands\" converted to \"Saline Marsh\" as reported in the 2015 LULC. Similarly, two out of three of the \"Scrub/Shrub Wetlands\" converted to \"Phragmites Dominated Interior Wetlands\"."}, {"section_title": "Key Findings", "text": " All sites except Little Egg show evidence of forest edge migration over the 75year time period with average distances greater than the mapping uncertainty.  Rates of treeline retreat are highly variable over time.  Shallow groundwater wells show water levels rising at 5.5mm per year at 2 out of 3 sites examined.  High rates of treeline retreat were preceded close in time by extreme storm events at many of the sites examined.  While Phragmites and shrubs are dominant in the transition zones at most of the sites examined, native marsh grass sub-communities did establish at some sites.  No single mechanism examined in this study demonstrated a sufficiently strong correlation to be deemed as the key driver of forest edge migration.  It is likely that the forest edge migration is caused by a combination of all of the drivers examined in the study. The combination and weight of each of the drivers is likely unique to the location of the system."}, {"section_title": "Discussion", "text": "The changes observed over the 75-year time span of this study ranged from dramatic to minimal and varied considerably across the sites. Observing forest edge migration at a fine temporal scale, which to our knowledge has not been done for as long of a time frame with as fine a temporal scale, showed that the rates forest edge migration of the marsh/upland ecotone also varies depending on time-frame assessed. This demonstrates that when assessing for rate of forest edge migration or spatial changes, timescales matter. For example, if the Delmont site was analyzed only using the 1970 and 1978 imagery, the average (EPR or WLR) rate of forest edge migration would have been observed to be over 16m/yr. Conversely, if the same site was assessed using the 2012 and 2015 treeline data, the EPR and WLR rates of forest edge migration would be determined to only be 4m/yr. While data availability is an issue, compiling the longest timeframe available and examining it in the smallest temporal scale lends itself to better understanding of how the system changes over time and the mechanisms behind that change. The observation of extreme spikes in the forest migration rate during a specified time period implies that the mechanisms behind those changes are likely episodic where consistently steady changes in rate over time implies a more gradual mechanism. This study found that some sites exhibit both of these scenarios. Belleplain and Delmont are highly affected by episodic disturbance where changes observed at Nantuxent and Cattus Island are more gradual in nature. This suggests that some sites are more vulnerable to episodic events such as storms than others. Because the rates of forest edge migration over the timeframe are so variable, the mechanisms behind the response of any given site to changes in sea level and storms are likely multilayered and complicated. Each mechanism is examined below both individually and in conjunction with other factors. Correlation of each of the mechanisms to changes in rates and habitat characteristics will be examined, but this does not imply causation."}, {"section_title": "Location", "text": "The study sites were chosen to capture a variety of location characteristics that also vary spatially. Further, the salinity of the bay water directly adjacent to the site also does not correlate to WLR rate of forest edge migration (Figure 36). This study does not disqualify these drivers, however. The range of elevation of the transition zones of all sites is between 0.53 m and 1.07m above NAVD88. These elevations may be within the uncertainty range of the DEM and therefore any relationships found within the data may be an artifact of this uncertainty. With this possibility in mind, there is still no strong relationship between elevation and WLR rate. While the three sites with the highest WLR rates are relatively high in elevation for the sites, each about 1m above NAVD88, multiple sites are similar in elevations with low WLR rates of forest edge migration (Figure 37). When the sites are grouped by regional location, the Barnegat Bay sites exhibit a negative correlation between WLR rate and elevation (Figure 38) while the Delaware Bay sites no correlation between WLR rate and elevation ( Figure 39). Nantuxent has the lowest elevation in Delaware Bay. Fortescue is the highest in elevation but is the 3 rd highest WLR rate of forest edge migration. In the Barnegat Bay sites, the two lowest sites, Reedy Creek and Cattus Island both at 0.5m above NAVD88, exhibited different WLR rates of forest edge migration. While it is assumed that all transition zones are within a spectrum of elevations that are likely to be flooded, these data shows that whether the site is on the low or high end of this spectrum does not relate closely to magnitude of migration. The data suggests that elevation alone is not likely to be the only mechanism of change. A factor that does appear to have some correlation to WLR rate is the distance from the site to the bay. Despite a few outliers, there is a clear trend that sites that are farther away from the bay have higher WLR rates of forest edge migration (Figure 40). This trend is at first counter-intuitive when thought about in a situation where tidal surface inundation is the key driver of change. This trend becomes much more explanatory when the change in groundwater and storms are considered. Being further upland could put the site closer to a larger freshwater aquifer or make them far enough away from the bay that it would not experience storm surge as often as sites closer to the bay. More investigation into species composition relative to the distance from open water would be pertinent to clearly understand this trend. Another possibility that was not examined in this study could be the landscape configuration of each of the sites and surrounding areas. The marsh/forest ecotone can exist along concave, convex, and flat shoreline configurations. For example, the marshupland edge is often indented where streams enter the system leading to a concave shape that may funnel and focus storm surge inundation. Elsewhere points of upland may jut out into the marsh leading to a more convex shape of the shoreline."}, {"section_title": "Tidally-induced Inundation", "text": "The New Jersey Projected Marsh Retreat Zone data uses a modified bathtub model to predict locations where, given terrain elevation, that would be inundated at MHHW NAVD88. The future scenarios of potential marsh retreat were modeled for 1, 2, and 3 feet (or 0.3, 0.6 and 0.9m) of SLR by 2050, using 2010 sea level as the baseline year. Given that the average mid-Atlantic rate of 5mm/yr of SLR (Kopp et al., 2016), the rise in sea level between the baseline year of 2010 and 2015 (the final year of mapping in this study) has been approximately 25mm (or 0.025m). The increased salinity and soil saturation caused by increased tidally-induced surface inundation would cause stress to the upland vegetation ultimately resulting in death (Fagherazzi et al., 2019). Thus, if tidal inundation were the driving factor in tree death, one would expect that the 2010 baseline marsh edge and the 2015 mapped treeline would be nearly identical in spatial location; however this was not the case. A spatial cross-tabulation of the projected vs. observed marsh retreat areas reveals that the current 2015 treeline extends well the 0.3m (1 foot) SLR retreat zone and even into the higher 0.6-0.9m (2-3 foot) SLR marsh retreat projection areas. For example, most of the mapped 2015 marsh-forest edges fall within the 0.6m (2ft) projection zone with Cattus Island site falling within the 0.9m (3ft) projection zone. There are several possible explanations for these findings. One possibility is that the projected 2050 marsh retreat zones employed a starting point in 2010 that was too far out in the marsh than was observed in this study. Thus it would appear that the 1', and in some cases the 2' or 3', marsh retreat zones were not in fact upland in 2010 but actually already below MHHW by 2010 (i.e., already subject to SLR inundation). An alternative explanation is that SLR direct inundation alone may not be the primary driver but rather, other mechanisms are also playing a major contributing role to forest dieback. SLRinduced changes to the groundwater water table upgradient of the MHHW contour may be leading to soil saturation, resulting in tree death and limited regeneration (Knott et al., 2018). This implications of changes to the groundwater table will be discussed in greater depth below. Alternatively, extreme storm events and associated storm surge may also \"predispose\" the forest edge to dieback ahead of normal SLR-induced regular tidal inundation."}, {"section_title": "Human Alterations of the Marsh Landscape", "text": "All of the sites, except for Nantuxent, were altered by humans for farming, logging, or mosquito control. There is no pattern in WLR rate of forest edge migration that emerges in respect to type of land use of the adjacent marsh or forest. Nantuxent is unaltered, yet does not have the lowest WLR rate of forest edge migration, and neither does Little Egg despite being extremely grid diched. It is likely that the role these alterations play varies greatly based on how the other mechanisms of change are interacting with the site. The presence of human alterations, specifically old farming ditches or parallel grid ditching, may also play a role in the aforementioned rise in groundwater due to impediment of freshwater outflow. It is possible that if the farming and parallel ditches act as outflow for fresh groundwater, the damming effect caused by the saltwater intrusion could be moderated (Carleton, unpublished). The effect of having these ditches for outflow sites could either be positive or negative depending on the goal in mind. More ditches present could mean that the groundwater levels would not rise as fast as it would if the ditches were not present. This may mean that sites with ditches do not have as much death caused by drowning and, therefore, cause the treeline to change much slower than an unaltered marsh. The ditches could also make the trees more vulnerable to surface water as they provide a more ready route for tidal inundation or storm surge. Whether the changes would ultimately be similar, just on different time scales for a marsh effected verses not effected by increasing groundwater is unclear. More research into changes in groundwater at sites that have been extensively ditched vs sites that have been less altered could lend to better understanding of the lasting impacts of groundwater levels as sea-level rises."}, {"section_title": "Vegetation Community Change", "text": "The plant community changes to fill the niche that becomes open when the tree species die back. The new communities living in the previously forested areas do not have the same community structure across all of the sites, but there are a few trends. Based on visual interpretation of the aerial imagery, every site examined for community composition was populated at least in part by the Phragmites/shrub sub-community. For all sites except Delmont, the Phragmites/shrub sub-community was the dominant cover class and for the Cape Shore and Little Egg sites, it was the sole cover class. For the sites not completely dominated by the Phragmites/shrub cover class, native marsh grasses were also observed to be present. The Delmont site was dominated by the native marsh grass sub-community and there over 25% cover of native marsh grasses the Fortescue and Reedy Creek sites. The presence of native marsh grasses in a community that used to be dominated by trees is a promising find. It is the concern of some managers that the new marsh created in the wake of tree dieback will be monocultures of Phragmites due to the species invasive nature and affinity to disturbed sites. These monocultures of Phragmites are not ideal habitat for many of the fish that use the marsh as a nursery ground and therefore present a risk to fish populations if they were to become the norm (Able and Hagen 2003). This study shows that there is some environmental situations in which native marsh grasses can out compete the invasive Phragmites for space. While it is known that Phragmites is likely limited at lower elevations in the tidal frame as it is sensitive to higher salinity or extended inundation (Moore et al., 2012), it is unclear if that is the driving factor in this transitional circumstance. There may be other drivers, such as speed of hydrological transition or landscape factors (Chambers et al., 2008), that may give competitive advantage to native marsh grasses like S. patens. Given that there were some classifications of forests that converted to the same dominant land cover type (Table 7), it could also be possible that the community composition of the transition zone could be linked to the forest community previously occupying the habitat. While this study covers 75 years of change, the transitioning communities could transform again given more time or increasing sea level rise. As SLR continues to occur in the future, the physical characteristics of the areas that are currently occupied by Phragmites may shift to be more favorable for high marsh species like S. patens or low marsh species like S. alterniflora. Defining the mechanisms behind community structure is an important next step for management of this changing system."}, {"section_title": "Conclusion", "text": "In conclusion, this study demonstrates that forest dieback is occurring at the forest-coastal marsh interface and that salt marsh is expanding into this transition zone at eight locations in both New Jersey's Delaware Bayshore and Atlantic Coast. Observation across multiple decades (in this case 75 years) and at a comparatively fine temporal scale (at least once per decade) provided solid documentation of how the system changes over time. The rates of forest edge migration observed at the 8 sites varied geographically and across the 75 year time period. The dieback occurring at any given point in time is likely a function of unique site level interactions between sea-level and storms, some of which occur episodically and others gradually. This variation in forest edge migration rate is likely due to a combination of mechanisms, some as direct mechanisms and others as modulators. Each mechanism described in this study likely occurring at some level in each of the sites, it is the magnitude of which each mechanism effects the system that is varied among sites. Some sites seem to be responding strongly to episodic events, such as storms, while others seem to only be changing gradually with the more chronic mechanisms like changes in groundwater. Given the results of this study and the literature reviewed, the most important driving mechanisms of migration of the forest edge appear to be SLR induced changes in groundwater (Carleton, Unpublished USGS Report; Nuttle and Portnoy, 1992) and increased severity of storm surges (Fagherazzi et al., 2019;Dai et al., 2011;Conner and Inabinette, 2003) as these mechanisms directly affect the soil properties of the ecosystem. The increase in tidal and storm surge related surface flooding causes increasing soil salinity and saturation (Carleton, Unpublished USGS Report; Nuttle and Portnoy, 1992). The increased SLR increases the water table causing more saturated soils and increased damming of freshwater inflow which in turn increases the water table even more (Carleton, Unpublished USGS Report; Nuttle and Portnoy, 1992). The increased water table causes stress to upland vegetation and can affect the regeneration potential of some species (Fagherazzi et al., 2019, Fernandes et al., 2018. For some of the sites observed, particularly the migration that occurs gradually, this chain of events may be the chief driver of change. It may be that the groundwater is increasingly stressing the vegetation and decreasing regeneration potential as the water table slowly rises over time, resulting in a gradual wave of mortality as tolerances to salt or saturation are surpassed (Fagherazzi et al., 2019). If the upland vegetation can withstand the stressed caused by the changes in groundwater, they may persist but their stressed state and potential lack of regeneration potential causes mass mortality after a storm surge As the surge of saltwater enters the system the stressed vegetation reaches their tolerance limits and due to their stressed state, die. These areas of mortality then do not regenerate as the SLR induced changes in the groundwater or lingering effects of the storm surge cause the soil to be inhospitable for seedlings (Fagherazzi et al., 2019). This leaves the space open for marsh species such as Phragmites or S. patens to fill the vacated niche, and thus forest edge migrates inland. These mass mortality events were observed at multiple sites in this study. These mechanisms are ultimately controlled by climate change induced changes in SLR and storm intensity but are moderated by other physical phenomena. These processes are also being mediated by the presence of historical salt marsh hay farming and/or mosquito management. Ditches created for farming or mosquito management may be increasing groundwater drainage, thus moderating water table rise, or conversely, creating pathways for bay water to gain access further inland causing more areas of surface flooding or increasing saltwater intrusion. Salt marsh hay farming and logging may also have created a sediment deficit due to diking that restricted tidal flow or removal of sediment during crop harvest. The variation between sites is likely linked with local differences in hydrology, soil characteristics, drainage, exposure, and land use legacies. The current available data, however, is not equipped to explain how the variation in site characteristics relates to the mechanisms of action. Further research into the individual mechanisms will be key in understanding site variability. While some of the following suggested research opportunities have been previously studied, deeper knowledge into these areas of interest will benefit from being studied in the context of marsh retreat. One, how rising sea levels affect the depth of the groundwater table in the marsh-forest interface zone appears to be a critical factor. Where rising sea levels results in a damming effect that increases the height of the groundwater table, the resulting chronically saturated soils could be the proximate cause of tree death. Confirmation that this damming effect is occurring in a non-barrier island system and exploration into the effects of higher water tables on tree growth are both topics the current data is likely unable to address. Two, better understanding the components of the storm surge event, salinity, height of water, and length of inundation, may inform which storms are causing the most damage and therefore when combined with meteorological predictions, is important to predicting how often and to what extent future die-back events can be expected. more information about the extent to which human land use legacy plays a role in dampening or heightening the effects of each of the mechanisms of action will lend to better management decisions on hydrological restoration or intervention. In terms of management, more information about the extent to which human land use legacy plays a role in dampening or heightening the effects of each of the mechanisms of action will lend to better management decisions on hydrological restoration or intervention. In addition, further research into limiting factors to Phragmites growth in previously forested areas could significantly enhance the management of these systems. Based on the current data available, there is not enough known about the interactions between climate change induced changes in sea level and storms and the marsh/upland interface to accurately predict what may happen in the future. However, this study has documented that forest dieback accompanied by marsh migration is occurring in New Jersey and potentially faster than expected. With a better understanding of each of the mechanisms at work in this system, hopefully managers can be better prepared for the changes ahead and facilitate pro-active adaptation strategies.      "}, {"section_title": "Tables", "text": ""}, {"section_title": "DSAS Statistic Description Units Net Shoreline Movement", "text": "Average Distance between the oldest and youngest shoreline"}, {"section_title": "Meters", "text": ""}, {"section_title": "Shoreline Change Envelope", "text": ""}, {"section_title": "Average greatest distance between all the shorelines Meters", "text": "End Point Rate A rate of movement calculated by dividing the distance between oldest and most recent shoreline by the time elapsed between the two years"}, {"section_title": "Meters per year", "text": "\n\nBased on the examination of the imagery, the salt marsh adjacent to the Fortescue site shows evidence of grid ditching likely for mosquito control. Some of the ditches filled in naturally and revegetated over the years, and some remain open marsh channels. The average elevation of this site was +1.07m from NAVD88. The site is approximately 1.5 miles from the bay shoreline."}, {"section_title": "Linear Regression Rate", "text": "A rate of movement calculated by fitting a least-squares regression line to all shoreline points"}, {"section_title": "Weighted Linear Regression Rate", "text": "A rate of movement calculated by fitting a weighted linear regression line to all shoreline points weighted by the points with a smaller uncertainty value receiving the highest weight.      imagery. In image 4a the border between salt marsh and treeline is fuzzy where as in image 4b the boarder is much more distinct.                   1961 and 1961-1970 overlapped, therefore, the distances and rates calculated for these time steps are more uncertain than other rates."}, {"section_title": "Belleplain", "text": "The rates of forest edge migration for the Belleplain reported by the DSAS software were an EPR of +8.3m/yr and a WLR of +9.2m/yr. The average linear distance between 1940 and 2015 treelines was +606m with a maximum distance of +784m. When the rates of forest edge migration were computed between each time interval ( Figure   1210), the highest rate occurred between 1991and 1995. The treeline moved an average distance of +177m upland over the 4 years for a rate of +44.3m/yr. The lowest rate of forest edge migration occurred between 1995 and 2002. The treeline moved an average distance of +2m towards the marsh over than 9 years for a rate of growth of +0.2m/yr. The uncertainty buffers for 1940-1951, 1961-1970, 1970-1987, 1995-2002, and 2002-2007 overlapped, therefore, the distances and rates calculated for these time steps are more uncertain than other rates. The Belleplain site is a site of historical logging activities that complicated the digitization of the treeline because clear cuts of the forest appear similar in the imagery to areas of standing dead. In the timeframe of the study, however, the area of interest at the site was not clear cut. The average elevation of this site was +1.00m from NAVD88. The site is approximately 2.1 miles from the bay shoreline."}, {"section_title": "Delmont", "text": "The rates of forest edge migration reported by the DSAS software were an EPR of +4m/yr and a WLR of +5m/yr. The average linear distance between 1940 and 2015 treelines was +321m, with a maximum distance of +546m. When the rates of forest edge migration were computed between each time interval (Figure 11 11), the highest rate occurred between 1970 and 1978. The treeline moved an average distance of +134m upland over the 8 years for a rate of +16.7m/yr. The lowest rate of forest edge migration occurred between 1961 and 1970. The treeline moved an average distance of -39m toward the marsh in the 9 years for a rate of -4.4m/yr. The uncertainty buffers for 1940-1951, 1987-1991, and 2002-2007 overlapped, therefore, the distances and rates calculated for these time steps are more uncertain than other rates. Based on examination of the imagery, the salt marsh adjacent to the Delmont site was farmed, likely for salt marsh hay, and shows evidence of ditching and diking to facilitate this farming. This farming likely continued until sometime between 1970 and 1978. The imagery shows over wash events on the shoreline in the marsh adjacent to the treelines in the 1970 and 1978 imagery with complete breach of the shoreline visible in the 1987 imagery. This breach remains open for all subsequent years, becoming a wellestablished channel into the marsh. The average elevation of this site was +0.97m from NAVD88. The site is approximately 1.6 miles from the bay shoreline."}, {"section_title": "Cape Shore", "text": "The rates of forest edge migration for the Cape Shore Site reported by the DSAS software were an EPR of +1.0m/yr and a WLR of +1.0m/yr. The average linear distance between 1940 and 2015 treelines was +74m with a maximum distance of +194m. When the rates of forest edge migration were computed between each time interval ( Figure   1312), the highest rate occurred between 2007 and 2012. The treeline moved an average distance of +49m upland over the 5 years for a rate of +9m/yr. The lowest rate of forest edge migration occurred between 1978 and 1987. The treeline moved an average distance of -8m towards the marsh 8 years for a rate of -1m/yr. The uncertainty buffers for all years except 2007-2012 overlapped, therefore, the distances and rates calculated for these time steps are more uncertain than other rates. Based on examination of the imagery, the salt marsh adjacent to the Cape Shore site was salt hay farmed and shows evidence of ditching and diking to facilitate this farming. The farming ended sometime between 1951 and 1961 and the ditches were either filled or filled in naturally and revegetated between 1961 and 1991. Between 1991 and 1995, new grid ditches were dug in the marsh platform possibly for mosquito control. These ditches widened over time, and tributary channels appeared and continued to fluctuate. The 2015 imagery shows signs of some ditch filling. The average elevation of this site was +1.04m from NAVD88. The site is approximately 0.4 miles from the bay shoreline."}, {"section_title": "Little Egg", "text": "The rates of forest edge migration for the Little Egg Site reported by the DSAS software were an EPR of +0.3m/yr and a WLR of +0.2m/yr. The average linear distance between 1940 and 2015 treelines was +3.4m with a maximum distance of +28m. When the rates of forest edge migration were computed between each time interval ( Figure   1513), the highest rate occurred between 1940 and 1951. The treeline moved an average distance of +5m upland over the 11 years for a rate of +0.5m/yr. The lowest rate of forest edge migration occurred between 1951 and 1961. The treeline moved an average distance of -5m towards the marsh 11 years for a rate of -0.5m/yr. The uncertainty buffers between all consecutive years overlapped, therefore, the distances and rates calculated for each time step for this site are more uncertain than other sites. Based on the examination of the imagery, the salt marsh adjacent to the Little Egg site shows evidence of extensive parallel grid ditching for mosquito control. Some of the ditches filled in naturally and revegetated over the years, and some remain open marsh channels. The average elevation of this site was +0.71m from NAVD88. The site is approximately 1.3 miles from the bay shoreline."}, {"section_title": "Reedy Creek", "text": "The rates of forest edge migration for the Reedy Creek Site reported by the DSAS software were an EPR of +1.3m/yr and a WLR of +1.4m/yr. The average linear distance between 1940 and 2015 treelines was +100m with a maximum distance of +490m. When the rates of forest edge migration were computed between each time interval ( Figure   1414), the highest rate occurred between 1991 and 1995. The treeline moved an average distance of +30m upland over the 3 years for a rate of +7.7m/yr. The lowest rate forest edge migration occurred between 1978 and 1987. The treeline moved an average distance of -7m towards the marsh over than 9 years for a rate of -0.8m/yr. The uncertainty buffers for all years except 1991-1995, 1995-2002, 2007-2012, and 2012-2015 overlapped, therefore, the distances and rates calculated for these time steps are more uncertain than other rates. Based on the examination of the imagery, the salt marsh adjacent to the Reedy Creek site shows evidence of extensive parallel grid ditching for mosquito control. Some of the ditches filled in naturally and revegetated over the years, and some remain open marsh channels. The average elevation of this site was +0.53m from NAVD88. The site is approximately 0.2 miles from the bay shoreline."}, {"section_title": "Cattus Island", "text": "The Cattus Island site was missing aerial photography for 1951, 1978, and 1991. The rates of forest edge migration for the Cattus Island Site reported by the DSAS software were an EPR of +1.2m/yr and a WLR of +1.8m/yr. The average linear distance between 1940 and 2015 treelines was +85m with a maximum distance of +265m. When the rates of forest edge migration were computed between each time interval ( Figure   1615) the rates were calculated using the available years (i.e. because 1951 is missing a rate was computed for 1940 and 1961). The highest rate forest edge migration over the time period occurred between 1961 and 1970. The treeline moved an average distance of +15m upland over the 9 years for a rate of +0.75m/yr. The lowest rate forest edge migration occurred between 2007 and 2012. The treeline moved an average distance of -4m towards the marsh over than 5 years for a rate of -0.2m/yr. The uncertainty buffers between all consecutive years overlapped, therefore, the distances and rates calculated for each time step for this site are more uncertain than other sites. Based on the examination of the imagery, the salt marsh adjacent to the Cattus "}]