[{"section_title": "Abstract", "text": "Abstract-Pulse pressure and pulse wave velocity, markers of arterial stiffness, have been associated with stroke, dementia, and lowered levels of cognitive function. Here we examine longitudinal relations of pulse pressure and pulse wave velocity to multiple domains of cognitive function among nondemented, stroke-free persons. Up to 1749 participants from the Baltimore Longitudinal Study of Aging completed tests of verbal and nonverbal memory, attention, perceptuo-motor speed, confrontation naming, executive functions, and cognitive screening measures, as well as concurrent sphygmomanometric assessment of blood pressure (for derivation of pulse pressure) on 1 to 8 occasions over 14 years. A subset of Յ582 participants also underwent a single baseline assessment of pulse wave velocity and cognitive assessment on 1 to 6 occasions over 11 years. Results of mixed-effects regression models revealed a prospective decline on tests of verbal learning, nonverbal memory, working memory, and a cognitive screening measure among those with increasing levels of pulse pressure (PϽ0.05). Persons with higher baseline pulse wave velocity also exhibited prospective decline on tests of verbal learning and delayed recall, nonverbal memory, and a cognitive screening measure (PϽ0.05). Markers of arterial stiffness are associated prospectively with cognitive decline before dementia. ypertension is a well-established risk factor for stroke and dementia 1,2 and is associated with diminished cognitive performance and cognitive decline before these conditions. 3-5 However, findings have been mixed regarding the respective contributions of systolic versus diastolic blood pressure and the domains of cognitive function affected. 3 Among older adults (Ͼ50 years of age), systolic hypertension is the dominant form of hypertension. Systolic hypertension is attributed in large part to increased arterial stiffness. 6 We therefore sought to examine the contributions of arterial stiffness to cognitive function.\nTwo common markers of arterial stiffness are increased pulse pressure (PP) and pulse wave velocity (PWV). Although these measures are moderately correlated, PWV is considered a direct measure of arterial stiffness, whereas PP is viewed as a surrogate marker. 7 PP and PWV are independent predictors of cardiovascular diseases including stroke 8 -11 and are considered markers of preclinical cardiovascular disease. 12 Both high and low PP predict incident Alzheimer's disease. 13 Furthermore, greater PP has been associated with lower levels of cognitive performance among nondemented persons. 14 In cross-sectional studies, PWV has been found to be higher in patients with vascular dementia, Alzheimer's disease, or mild cognitive impairment than in cognitively intact individuals. 15 Higher PWV has also been related to lower levels of, or decline in, performance mainly on screening measures of cognitive function, such as the Mini Mental State Examination (MMSE). 16 -18 However, a recent longitudinal investigation did not identify prospective relations of PWV to cognitive decline or dementia. 19 The present study extended on previous literature by examining longitudinal relations of PP and PWV to performance on tests reflecting a greater number of domains of cognitive function 20 including verbal and nonverbal memory, attention, perceptuo-motor speed, executive function, and language among stroke-and dementia-free individuals. For consistency with most previous investigations in this area, we also examined 2 commonly used cognitive screening measures, the MMSE and the Blessed Information-MemoryConcentration (I-M-C) Test."}, {"section_title": "", "text": "H ypertension is a well-established risk factor for stroke and dementia 1, 2 and is associated with diminished cognitive performance and cognitive decline before these conditions. [3] [4] [5] However, findings have been mixed regarding the respective contributions of systolic versus diastolic blood pressure and the domains of cognitive function affected. 3 Among older adults (Ͼ50 years of age), systolic hypertension is the dominant form of hypertension. Systolic hypertension is attributed in large part to increased arterial stiffness. 6 We therefore sought to examine the contributions of arterial stiffness to cognitive function.\nTwo common markers of arterial stiffness are increased pulse pressure (PP) and pulse wave velocity (PWV). Although these measures are moderately correlated, PWV is considered a direct measure of arterial stiffness, whereas PP is viewed as a surrogate marker. 7 PP and PWV are independent predictors of cardiovascular diseases including stroke 8 -11 and are considered markers of preclinical cardiovascular disease. 12 Both high and low PP predict incident Alzheimer's disease. 13 Furthermore, greater PP has been associated with lower levels of cognitive performance among nondemented persons. 14 In cross-sectional studies, PWV has been found to be higher in patients with vascular dementia, Alzheimer's disease, or mild cognitive impairment than in cognitively intact individuals. 15 Higher PWV has also been related to lower levels of, or decline in, performance mainly on screening measures of cognitive function, such as the Mini Mental State Examination (MMSE). 16 -18 However, a recent longitudinal investigation did not identify prospective relations of PWV to cognitive decline or dementia. 19 The present study extended on previous literature by examining longitudinal relations of PP and PWV to performance on tests reflecting a greater number of domains of cognitive function 20 including verbal and nonverbal memory, attention, perceptuo-motor speed, executive function, and language among stroke-and dementia-free individuals. For consistency with most previous investigations in this area, we also examined 2 commonly used cognitive screening measures, the MMSE and the Blessed Information-MemoryConcentration (I-M-C) Test."}, {"section_title": "Methods", "text": ""}, {"section_title": "Participants", "text": "Participants derived from the Baltimore Longitudinal Study of Aging (BLSA), which is a prospective study of community-dwelling volunteers initiated by the National Institute on Aging in 1958. Approximately every 2 years, participants visit the Gerontology Research Center in Baltimore for medical, psychological, and cognitive testing. 21 Beginning in 1986, participants Ն60 years of age were administered a more extensive neuropsychological test battery to assess multiple domains of function involved in cognitive aging. Therefore, the majority of tests examined herein were available only during visits occurring on or after January 1, 1986. A total of 1780 participants (ages 19 to 93) were available for potential inclusion in the PP analyses. After excluding persons with dementia (nϭ7; see Reference 22 for determination of dementia status); cerebrovascular diseases including stroke (nϭ24), defined by International Classification of Diseases, Ninth Revision, codes 430 to 438; and renal failure (nϭ0) across all of the assessment visits, 1749 participants (933 men and 816 women) were included in the PP analyses. Because assessment of PWV was added much more recently to the BLSA protocol, 596 participants were available for potential inclusion in the PWV analyses. After the exclusion of individuals with dementia (nϭ4), cerebrovascular disease (nϭ10), or renal failure (nϭ0), 582 participants (258 men and 324 women) were included in the PWV analyses. Baseline clinical characteristics of participants for each sample are presented in Table 1 . The correlation between PP and PWV in the largest PWV sample (nϭ582) was rϭ0. 36 . The BLSA uses continuous enrollment procedures; thus, participants have different numbers of visits, in part, because of differential start times in the project (see Table 2 ). Follow-up times are also variable. Participants in the PP analyses had an average of 2.7 visits (SD: 1.6 visits; range: 1 to 8 visits), and the average time between visits was 1.8 years (SD: 0.7 years); for the PWV analyses, participants averaged 2.3 visits (SD: 1.3 visits; range: 1 to 6 visits) and 1.6 years (SD: 0.6 years) between visits. Over the course of the study, 304 participants died, and 84 formally withdrew from the investigation; the rate of attrition was therefore 17% (from the PP sample). Institutional Review Board approval was obtained from the Johns Hopkins Bayview Medical Center before 2002 and the MedStar Research Institute after 2002. All of the participants provided written informed consent, and all of the procedures followed were in accordance with institutional guidelines. Data analyses were approved by the Institutional Review Board of the University of Maryland Baltimore County."}, {"section_title": "Neuropsychological Tests", "text": "At each BLSA visit, standard neuropsychological tests 20 were administered by highly trained psychometricians. The numbers that follow each test indicate respective sample sizes because of testspecific missing data for the PP and PWV samples, respectively. The Digits Forward (nϭ1326 and nϭ486) and Digits Backward (nϭ1327 and nϭ487) portions of the Wechsler Adult Intelligence ScaleRevised assessed attention and concentration. The California Verbal Learning Test (CVLT; nϭ1208 and nϭ451) measured verbal learning and memory (ie, learning slope and short and long free recall), and the Benton Visual Retention Test (BVRT; nϭ1478 and nϭ482) evaluated nonverbal memory. The Trail Making Test Part A (nϭ930 and nϭ259) and Part B (nϭ925 and nϭ260) assessed attention, perceptuo-motor speed, visuomotor scanning, and mental flexibility (an executive function). Letter Fluency and Category Fluency (nϭ949 and nϭ261) examined phonetic and semantic association fluency, respectively, and executive function. The Boston Naming Test (nϭ720 and nϭ243) assessed confrontation naming (ie, word finding). The MMSE (nϭ947 and nϭ260), and the Blessed I-M-C Test (nϭ1749 and nϭ582) are cognitive screening measures."}, {"section_title": "PP", "text": "Brachial blood pressure determinations were performed in the morning, after a nonstandardized breakfast, with subjects in the seated position and after a 5-minute quiet resting period. Blood pressure was measured in both arms with a mercury sphygmomanometer using an appropriately sized cuff. The blood pressure values used in this study are the average of the second and third measurements on both the right and left arms. Systolic blood pressure (SBP) and diastolic blood pressure (DBP) were defined by Korotkoff phases I and V, respectively. PP was computed as PPϭ(SBPϪDBP), and data are available for each BLSA visit."}, {"section_title": "PWV", "text": "Carotid-femoral PWV was measured as described previously. 23 A minimum of 10 arterial flow waves from the right common carotid artery and the right femoral artery were recorded simultaneously using nondirectional transcutaneous Doppler probes (Model 810A, 9-to 10-Mhz probes, Parks Medical Electronics, Inc) and averaged using the QRS for synchronization. PWV was calculated as the distance traveled by the flow wave divided by the time differential. Assessment of PWV was completed at a single BLSA visit. A single reader (who differed over time without overlap) assessed PWV. The reader was blinded to clinical and neurocognitive data."}, {"section_title": "Covariates", "text": "Selection of covariates was predicated on 3 criteria: (1) previous demonstration of influence on arterial stiffness, cognitive function, or both; (2) typical use in previous literature on markers of arterial stiffness (or blood pressure) and cognitive function; and (3) availability for a sufficient number of participants to preclude major reductions in sample size. Accordingly, age and education were assessed in years. Use of antihypertensive medications was collapsed into a single \"yes/no\" category (because coding methods precluded examination of specific medications). Depressive symptomatology was examined using the Center for Epidemiological Studies Depression Scale. 24 Body mass index was calculated as the ratio of weight (kilograms) to height (in meters) squared. Fasting total cholesterol measure was determined enzymatically. Mean arterial pressure was computed as MAPϭ(2ϫDBPϩSBP)/3. Heart rate was assessed in beats per minute. A cardiovascular comorbidity index (absent/present) reflected the history of coronary artery disease, myocardial infarction, peripheral arterial disease, congestive heart failure, or diabetes. Smoking was coded (absent/present) as current versus former or never. Alcohol use was coded as consumption of Ն2 drinks per day versus less than that amount. One drink was defined as 12 oz of beer, 4 to 5 oz of wine, or 2 oz of spirits."}, {"section_title": "Data Analyses", "text": "Mixed-effects regression analyses were conducted to examine longitudinal relations of PP and PWV to cognitive function. 25, 26 Because concurrent measures of PP and cognitive function were available at all of the visits, the models indicate an age-related change in cognitive performance as a function of a change in PP (and all of the relevant covariates). For PWV, measures were only obtained at a baseline visit, whereas cognitive function and covariates were assessed at that visit and Յ5 subsequent times. Thus, results reveal whether PWV at baseline predicts the trajectory of age-related change in cognitive performance thereafter.\nTo maximize the unique information provided by each neuropsychological test, separate regression models were constructed for each test. Separate models were computed for the analysis of PP and PWV. Linear and quadratic (squared) PP (or PWV) effects were initially included in each model, but given the absence of significant associations, quadratic terms were removed from the final models. Years of education, depression scores, MAP, heart rate, body mass index, and total cholesterol levels were treated as continuous covariates, and sex, smoking, alcohol use, antihypertensive medications, and cardiovascular comorbidities were treated as categorical covariates. Other than sex, all of the covariates were treated as time varying. Age was modeled as a random effect to index time. 25 Quadratic age (to index nonlinear change over time) was examined but removed from the models because it was not informative. All of the main effects, 2-way interactions of PP or PWV with age or sex, and 3-way interactions of age, sex, and PP or PWV were entered into each model. The 3-way interactions were not informative and were removed from the final models. Body mass index was not informative as a covariate and was also removed from the final models. Models were recomputed using SBP and then DBP instead of MAP. Results were unchanged, and MAP was retained in the final models.\nSignificant main effects of PP (or PWV) indicate that the cognitive outcome (collapsed across all of the testing sessions) is associated with overall differences in PP (or baseline PWV) regardless of longitudinal changes. Longitudinal, or age-related, change in cognitive outcomes associated with PP (or baseline PWV) is indicated by the interaction term of PP (or PWV) and age. When the main effects of PP or PWV were qualified by interactions of those variables with age or sex, only the interaction terms were reported in the Results section and interpreted herein.\nStatistical analyses were conducted using SAS version 9.1. Graphs were created to visualize the significant relations using the prototypical values of the predictors as a function of age. 25 Each graph depicts predicted age-related change in cognitive performance as a function of prospectively assessed PP or baseline PWV time using all of the information in the analyses regardless of the number of repeated assessments."}, {"section_title": "Results", "text": "For full PP and PWV models, please see http://hyper. ahajournals.org. For PP, significant interactions of PP and age (indicating change over time) were found for the BVRT (␤ϭ0.0006; Pϭ0.003), the CVLT learning slope across 5 trials (␤ϭϪ0.0002; Pϭ0.001), digits backward (␤ϭϪ0.0004; Pϭ0.043), and the Blessed I-M-C Test (␤ϭ0.0003; Pϭ0.011). In general, individuals with higher PP displayed accelerated decline in cognitive function over time (ie, as they aged). A significant interaction of PP and sex was also noted for the CVLT free recall long delay (␤ϭϪ0.0121; Pϭ0.044). Men generally scored lower than women, and this effect was slightly enhanced at higher levels of PP (figure not displayed).\nFor PWV, significant interactions of PWV and age were found for the BVRT (␤ϭ0.0013; Pϭ0.0001), the CVLT learning slope across 5 trials (␤ϭϪ0.0002; Pϭ0.012), CVLT free recall short delay (␤ϭϪ0.0008; Pϭ0.019), CVLT free recall long delay (␤ϭϪ0.0010; Pϭ0.003), and the Blessed I-M-C Test (␤ϭ0.0004; Pϭ0.019). Those with higher PWV at baseline displayed a trajectory of greater decline in performance over time on each cognitive test.\nGraphic depictions of predicted parameters associated with the interaction of PP (or PWV) and age for the Blessed I-M-C test, CVLT learning slope, and the BVRT are displayed in the Figure. To view all of the figures depicting significant results, please see the data supplement available at http://hyper.ahajournals.org."}, {"section_title": "Waldstein et al Arterial Stiffness and Cognitive DeclineDiscussion", "text": "This study examined relations of PP and PWV, markers of arterial stiffness, with longitudinal assessment of cognitive function in stroke-and dementia-free persons using a fairly extensive range of neuropsychological tests. Results revealed that, as individuals grew older, those with accelerated increases in PP or higher PWV at baseline showed a performance decline on tests of verbal and nonverbal learning and memory and a cognitive screening measure weighted for memory and concentration. Those with increasing levels of PP also displayed a longitudinal decline on a test of concentration that taps working memory, and those with higher baseline PWV showed decline in delayed verbal recall. In addition, an interaction of PP and sex on delayed verbal memory revealed that, across all of the testing sessions, men scored lower than women, but this effect was a bit more pronounced at higher levels of PP. Tests of simple attention, perceptuo-motor speed, executive functions, and language were not impacted by measures of arterial stiffness. Our findings extend previous, largely cross-sectional work, relating higher levels of PP or PWV to dementia and lower levels of performance mainly on cognitive screening measures among nondemented individuals. [13] [14] [15] [16] [17] [18] [19] In contrast to these investigations, measures of arterial stiffness did not predict performance on the MMSE, a test that is commonly used as a screening instrument for dementia, perhaps because our sample was relatively healthy and high functioning. However, both PP and PWV predicted decline on the Blessed I-M-C Test, a screening measure that is more heavily weighted toward assessment of memory and concentration than the MMSE and that may be more appropriate in screening for subtle alterations in cognitive function associated with increased vascular risk.\nThe Blessed I-M-C Test findings are consistent with the results noted for the more specific clinical neuropsychological measures of cognitive function, which suggest that tests of learning, memory, and working memory (or concentration) may be most sensitive to the deleterious effects of PP and PWV over time. That both the BVRT and CVLT are affected suggest involvement of learning and/or memory processes in both verbal and nonverbal modalities. Furthermore, results for the CVLT learning slope measure suggest a possible influence on encoding processes. That delayed recall is associated negatively with PWV may reflect either a carryover of poor initial encoding and/or diminished retrieval or retention. Working memory, assessed by Digits Backward, can also influence learning and memory processes. A detailed analysis of the respective influences of encoding, retention, retrieval, working memory, or other cognitive processes to the present learning and memory findings is beyond the scope of the present work but could lead to further understanding of affected neurobiological processes that may involve frontotemporal and/or subcortical regions. Importantly, individuals who experience more pronounced difficulties with memory may ultimately progress to mild cognitive impairment and/or dementia. 27 Indeed, various cardiovascular risk factors have been associated with risk for mild cognitive impairment and dementia. 2, 28 It is unclear whether the apparent crossover effect for younger and older participants on select measures (eg, CVLT learning slope) reflects a biological phenomenon, statistical artifact, or complex survival issues (see Reference 3), but similar findings have been noted in the blood pressurecognition literature. 3 The similarity in longitudinal outcomes for PP and PWV is striking and may reflect the shared variance (r 2 ϭ0.13) between these measures that relates to arterial stiffness. Although directionally consistent, the minor difference in results may, in part, reflect that the analyses were conducted with different samples; that PWV is a direct measure of stiffness, whereas PP is only a surrogate measure of stiffness 7 ; and that a peripheral (brachial) measure of PP, rather than a central measure, was used. Importantly, we do not believe that our PP findings simply reflect distending blood pressure effects, because we adjusted statistically for MAP (with results unchanged with SBP or DBP in the models), thus suggesting that the pulsatile component of blood pressure is of critical importance. It would be useful for future studies of blood pressure and cognitive function to include an assessment of PP (and PWV when possible).\nIncreased arterial stiffness, as reflected in a greater PP and PWV, has been associated with various cardiovascular and metabolic risk factors, such as the metabolic syndrome, and measures of inflammation, 29, 30 which, in turn, have been associated with lower levels of cognitive function. 31, 32 However, relations of PP or PWV to cognition are unlikely to be solely attributable to correlated risk factors. In that regard, evidence suggests a genetic component to arterial stiffness that is independent of these factors 33 and that operates via structural changes in the arterial wall. There are several direct and indirect mechanisms whereby PP or PWV may relate to diminished cognitive function. First, because the brain is not shielded from the pulsatile nature of blood flow, increases in pulsatility associated with arterial stiffness may place distal vessels in the brain at direct risk for injury. Second, although not assessed formally, it has been hypothesized that PP or PWV may negatively influence microvascular disease, macrovascular disease, cerebral perfusion, and integrity of the blood-brain barrier (eg, References 13 and 34). Potential influences of endothelial dysfunction and NO deficiency should also be assessed. The pattern of the present results, which revealed associations of PP or PWV with tests of learning, memory, and concentration, could be consistent with any of the above mechanisms.\nStrengths of this investigation include the greatest number of repeated, concurrent assessments of PP and cognition available to date and the use of an extensive neuropsychological test battery. Limitations include a single baseline assessment of PWV and different PWV readers over the years. Although many potential confounding variables were adjusted, it is possible that other cardiovascular risk factors or psychological influences, such as C-reactive protein, maximal oxygen consumption, or anxiety, may have affected in the present findings. The use of a highly educated and predominantly white convenience sample limits the study's generalizability. Because BLSA participants are followed frequently for medical comorbidities, hypertensive participants were most often medicated (eg, calcium channel blockers or angiotensin-converting enzyme inhibitors), which may lower PP and PWV and, thus, underestimate their relations with cognition. Future research should examine associations with specific classes of antihypertensive agents, because they may exert differential influences on PP (or PWV) associations with cognitive function. Finally, the single interaction of sex and PP may be spurious. Nonetheless, the possibility of sex differences in the relation of arterial stiffness to cognitive function warrants further exploration."}, {"section_title": "Perspectives", "text": "The present findings indicate that, among nondemented individuals, markers of arterial stiffness are associated with prospective decline in verbal and nonverbal memory, working memory or concentration, and a cognitive screening measure weighted for memory and concentration. These results underscore a need to examine whether pharmacological or nonpharmacological interventions aimed at reducing arterial stiffening can maintain optimal cognitive function or attenuate its decline with age. Health habits such as exercise may also be critical to the maintenance of good arterial compliance, and, thus, appropriate lifestyle interventions may be of benefit. 35, 36 "}, {"section_title": "Source of Funding", "text": "The National Institute on Aging Intramural Research Program of the National Institutes of Health supported this research."}, {"section_title": "Disclosures", "text": "None. "}]