[{"section_title": "", "text": "The aim of this study is to compare school adjustment, mental health symptoms, and substance use among 15-to 16-year-old students attending mainstream schools in Ö rebro County, in Sweden. The students self-reporting disability/disabilities or no disability were categorized in four groups. If the students self-reported ''hard-of-hearing'' (HH), they were divided into two different groups-''just HH'' and ''HH with multiple disabilities.'' They were compared with two other groups of students''other disability than HH'' and ''no disability.'' Adolescents attending special schools were not included in this study. The present study mainly focuses on groups of adolescents with hearing disabilities. They do have a slight/mild or moderate hearing loss but not severe or profound because almost all Swedish adolescents with a strongly marked hearing loss attend special schools with bilingual education in a sign language environment (Specialskolemyndigheten, 2007) . Adolescents with a moderate hearing loss mostly attend mainstream schools, but decisions about school placements are made by professionals from a communicative, psychosocial, and medical perspective and not just from an audiometric screening point of view.\nA hearing disability is a rather common disability, but the situation is complex and day-to-day life can be very different for different adolescents. For example, hearing loss may affect both ears or be unilateral, it may be a low-or high-frequency hearing loss, and its severity may vary from slight, moderate, severe, to a profound hearing loss (World Health Organisation, 2007) . The hearing loss may also be described from different perspectives, such as from a medical, audiometric, communicative, educational, or sociopsychological perspective. It can also be described from a parent-oriented or a self-reported child perspective. In the present study, the adolescents self-reported their hearing disability, and the school placement told us that the adolescents were neither deaf nor had a severe hearing loss, nor was there a need for a bilingual education in a sign language environment because then they would have attended a special school."}, {"section_title": "Prevalence of Slight/Mild Hearing Loss", "text": "Generally the prevalence of children with a slight/ mild hearing loss is much higher than those with a marked hearing loss. In Sweden, 301,873 men belonging to sex age cohorts born from 1953 to 1977 were given audiological screenings at age 18 from 1971 to 1995 (Muhr, Rasmussen, & Rosenhall, 2007) . The screening took place when the men started national service. During the study period, all young Swedish men had to undergo a medical examination on conscription if they could not provide a medical certificate. Moderate to severe hearing loss and/or ear diseases were accepted as grounds for exemption (participation rate for audiometry 82%-93%). Consequently, mainly participants with just slight/mild in one or both ears (from 25 up to 40 dB) and not moderate/severe/profound hearing loss in both ears were investigated. Among the men, there was a big group with a slight/mild hearing loss and there were large variations over time in prevalence of hearing loss: in 1971, 15.7% had hearing loss, in 1976 14.4%, in 1981 8.3%, in 1986 9.8%, in 1991 13.9%, and in 1995 16 .3%. For most men, only one ear was affected and mostly they had a mild high-frequency hearing loss. There can be different reasons for the changes over time, such as changes in extrinsic factors like improved welfare system and medical care and differences in noise exposure.\nA national population-based cross-sectional survey from the United States, in which 6,166 children aged 6-19 years were interviewed and underwent audiometric screening, indicated that 14.9% of US children have a hearing loss of at least 16 dB. Most hearing loss recorded was slight and unilateral (Niskar et al., 1998) .\nIn another population-based longitudinal study from northern Finland, based on 11,780 children aged 14 years, 14.5% of the children reported a hearing loss. Among those children, 0.5% had a marked hearing loss (greater than 25 dB in the better ear), 3.6% a minor hearing loss, and 10.4% slight abnormalities (Sorri & Rantakallio, 1985) . The size of the first two groups corresponds well with the figures presented in a Gallaudet report. In the 817 age group, 0.09% were deaf, 0.44% had a lot of hearing problems, and 3.25% had some hearing problems (Gallaudet Research Institute, 2005) . Consequently, deaf and HH individuals who need hearing equipment constitute only a small proportion of all individuals with a hearing loss.\nConsequently, it can be concluded from those figures that the group of adolescents with a mild hearing loss is at least twice as big as the group with a more marked (moderate, severe, or profound) hearing loss."}, {"section_title": "Impacts on Psychosocial Adjustment and Health", "text": "There can be no doubt about the severe impact of a severe or profound hearing loss, but the impact of a slight, mild, or moderate hearing loss is not that well known (see Wake & Poulakis, 2004) . Bess, Dodd-Murphy, and Parker (1998) reported that children with minimal sensorineural hearing loss exhibited significantly greater dysfunction than children with normal hearing on self-reported variables as behavior, energy, stress, social support, and selfesteem. These variables were examined in the sixth and ninth years of school and the problems were somewhat more pronounced in the ninth year.\nIn contrast, Wake et al. (2006) found no differences between 55 children with slight/mild sensorineural hearing loss compared with children with normal hearing, in terms of language, reading, behavior, and health-related quality of life variables. These children, however, were younger than in the other group (first and fifth years)."}, {"section_title": "Follow-up Studies", "text": "There are only a few follow-up studies of HH children in the literature. One of them is the Finnish study that followed up the participants up to the age of 25. The group with a marked hearing loss had a significantly lower acceptance for intermediate studies (64%) than the other two groups with minor and slight hearing loss and the children with normal hearing (both 88%). This difference was still significant after statistical adjustment for relevant prenatal, neurological, and social factors. At the age of 25, 14% of the most severe group, 9% of the intermediate group, and 7% of the hearing children were unemployed (Jarvelin, MakiTorkko, Sorri, & Rantakallio, 1997) . The researchers concluded that a hearing loss appears to affect both the outcome of education and employment status."}, {"section_title": "Hard-of-Hearing Adolescents With Multiple Disabilities", "text": "Most studies of HH children with multiple disabilities have included only participants in need of hearing aids. Generally, the combined difficulties caused by a hearing loss associated with some other disability have a negative impact on adjustment to education and work . In a study from Norway, 24% of the children needing hearing aids had multiple disabilities (Steen, Gallefoss, Nordal, Ronning Arnesen, & Bechensteen, 1989) . In a Swedish study of HH children attending a regional special school, 28% of the children had multiple disabilities but there were more children who needed special support (Brunnberg, 2003) . Another Swedish study that focused on deaf/HH children attending special schools and needing special support found that 40% of the children had additional disabilities. They were in need of special support (Hendar, 2005) . Figures from the United States also indicate that there are many hard of hearing, not just deaf, children in need of special support and many of the children have another disability too. Annual Survey (Gallaudet Research Institute, 2005 showed that 42% of children had additional disability."}, {"section_title": "Approach and Hypotheses in Present Study", "text": "The students in the mainstream classes were asked to self-report hearing loss and other disabilities. This allowed us to study the importance of a hearing loss, its interaction with other disabilities, and the effects on school adjustment, mental health symptoms, and substance use. The students were also asked to report tinnitus. Several studies have shown that HH participants with tinnitus report more psychiatric symptoms or emotional problems than those without tinnitus (Aust, 2002; Rosanowski, Hoppe, Proschel, & Eysholdt, 1997) . This item was therefore included in the present analysis. This is the approach of the present study and the main hypotheses in this study were, firstly, that HH influences school adjustment, rate of mental health symptoms, and substance use and, secondly, that the combination of a hearing loss with other disabilities intensifies this influence."}, {"section_title": "Methods", "text": ""}, {"section_title": "Participants", "text": "The present database was based on a survey, ''Life and Health-Young People 2005'' (Lindén-Boström & Persson, 2007) , of all adolescents in mainstream schools, year 9, in the county of Ö rebro, Sweden. Students attending special schools in the area did not participate in the present study. The original study population consisted of all adolescents in mainstream schools in the county. A total of 3,084 students completed the survey, which is a completion rate of 85.5%. Of the students completing the survey, 2,919 answered the questions on disability and were included in the analysis.\nThe adolescents in the county attending special schools for deaf and HH children, children with multiple disabilities, autistic children, and children with intellectual disabilities were not included in the present study.\n1 Consequently, many adolescents with a grave disability did not participate in the present study because they attended special schools or special classes. The adolescents responding to the questionnaire attended ordinary classes in mainstream school."}, {"section_title": "Procedure", "text": "Teachers distributed the survey and the students answered the questionnaire at school. The students were 15-16 years of age. Ethical principles were applied throughout the research project. The adolescents answered the questionnaire anonymously, and they participated voluntarily. The students were considered to be fully competent to give their consent and answer the survey (Docherty & Sandelowski, 1999; Mayall, 2002; Balen, Blyth, Calabretto, Fraser, Horrocks, & Manby, 2006) . Pupils absent on the day of the survey did not participate."}, {"section_title": "The Survey", "text": "The questionnaire comprised 87 questions divided into the following sections: social background and family (11 items), mental and physical health symptoms (9 items), sense of coherence scale (13 items), leisure activities (10 items), eating habits (2 items), smoking, alcohol, and drugs (23 items), relationships (4 items), school (11 items), gambling (3 items), and future perspectives (1 item). All items had previously been used in four other counties in Sweden. Several items were taken from other scales, such as the instrument from WHO, AUDIT (Alcohol Use Disorders Identification Test) item 1, 2, and 3 (Bergman, Kallmen, Rydberg, & Sandahl, 1998; Saunders, Aasland, Babor, de la Fuente, & Grant, 1993) . The sense of coherence scale measures sense of belonging and, in this study, the short version with 13 items was used (see Myrin & Lagerström, 2006; Nilsson, Starrin, Simonson, & Leppert, 2007) .\nIn the present analysis, the main groups were defined by the question about disabilities: Do you have any of the following disabilities/handicaps? HH (hard of hearing) (yes, no), visual disability that cannot be corrected with spectacles or lenses (yes, no), motor disability (yes, no), difficulties in reading and writing (yes, no), and other disabilities (yes, no). Those reporting both a hearing disability and at least one other score were included in the group ''HH with multiple disabilities.'' Those with only a positive score in hearing disability were included in the group ''just HH.'' Those with one or several scores in other disabilities were included in the group ''other disability than HH,'' and those children with no positive scores were placed in the group ''no disability.''\nThe analysis of social background data included country of birth of child and parents; general selfrated health and physical/psychosomatic symptoms like headache, stomach pain, etc.; mental health symptoms; smoking and use of snuff; frequency of alcohol drinking and of heavy drinking; use of illicit drugs; school adjustment; and being bullied and gambling.\nSeveral of the items had five alternative responses. In the present analysis, the rates of ''often'' and ''always'' (''bad,'' ''very bad'') were compared with the other three alternatives. The scores of the items of the sense of coherence scale were calculated, and the total score was dichotomized in the lowest quartile and in other quartiles (lowest sense of belonging). Physical and mental items concerned the last 3 months, except the item ''ill-health,'' which had no time limit."}, {"section_title": "Statistics", "text": "All analyses were performed in SPSS 13.0. Differences of rates of the variables in the four groups were calculated with the chi-square method with three degrees of freedom. Multiple logistic regression analyses were performed using the stepwise forward method (Tabachnick & Fidell, 2006) . The logistic regression analysis was used to predict membership in one of two groups being compared, based on a set of independent variables including those related to background, physical and mental symptoms, school adjustment, and use of tobacco, alcohol, or drugs. The first analysis focused on the group ''HH with multiple disabilities'' compared to the ''no disability'' group. The second analyses compared ''HH with multiple disabilities'' with ''just HH'' and the third analyses compared ''just HH'' with the ''no disability'' group. Logistic regression analysis produces an odds ratio (OR). Behaviors or characteristics for which the OR is greater than 1 occur more often in the first group in the analysis than in the second group. Significant differences between the incidence of the variable in the two groups is indicated when the 95% confidence interval does not encompass the number 1. In addition, Nagelkerke R-square analysis gives a measure of the strength of the relationship between the variable and the group identification and provides an estimate of the variance in group membership predicted by the variable."}, {"section_title": "Results", "text": ""}, {"section_title": "Rates of HH and Other Disabilities", "text": "A total of 431 (15%) students self-reported disabilities. Fifty-six (1.9%) students reported that they were HH and that they had some other disability too (HH with multiple disabilities), and 93 (3.1%) students reported they were HH but did not report any other disability (just HH). A total of 149 (5%) students reported a hearing disability, and 282 (9.7%) students reported other disability or disabilities than HH (other disability than HH). The largest group of students (2,488 [85.2%]) reported no disability (no disability).\nThe types of disabilities reported by the adolescents with multiple disabilities, with and without HH, were visual disability 36% (with HH) and 20% (without HH), motor disability 39% (with HH) and 7% (without HH), reading and writing problems 68% (with HH) and 57% (without HH), and other disabilities 52% (with HH) and 31% (without HH). The average number of multiple disabilities was 2.0 in the group of HH students and 1.2 in the group of students not reporting a hearing disability.\nOf the participants who reported tinnitus often or always, 51% were in the ''HH with multiple disabilities'' group, 33% in the ''just HH'' group, 13% in the ''other disability than HH'' group, and 5% in the ''no disability'' group. Questionnaire Table 1 shows the percentage positive scores for the different items of the questionnaire. There was a consistent pattern of results with the ''HH with multiple disabilities'' group tending to show more problem behaviors and characteristics across the items.\nBackground. The groups differed significantly on some background data. The group ''HH with multiple disabilities'' was more often born outside Sweden (20%) and was more often not living together with both mother and father (46%) compared with the other three groups, ''just HH'' 7% and 27%, ''other disability than HH'' 9% and 39%, and ''no disability'' 7% and 31%. The three groups of adolescents with disabilities had a higher rate of participants living outside the city of Ö rebro, which is probably explained by the fact that special school facilities are more available in the city than in the countryside. There were no significant gender differences.\nPhysical and mental symptoms. All items about physical and mental symptoms had high rates in the ''HH with multiple disabilities'' group of adolescents, intermediate rates in the ''just HH'' group and the ''other disability than HH'' group, and lowest rates in the ''no disability'' group. The rates in the ''HH with multiple disabilities'' group were high: 30% were feeling bad, 52% were depressed, and 62% were in the lowest quartile of the sense of coherence scale. Corresponding figures for the ''no disability'' group were 4%, 23%, and 21%.\nTobacco, alcohol, and drugs. The pattern was similar to the mental health items. Substance use was high in the ''HH with multiple disabilities'' group, intermediate in the ''just HH'' and ''other disability than HH,'' and lowest levels were found in the ''no disability'' group. In the ''HH with multiple disabilities'' group, 45% reported daily smoking/use of snuff, 41% binge drinking, and 41% use of illegal drugs. Corresponding rates in the ''no disability'' group were 12%, 9%, and 5%.\nSchool adjustment and inclusion. Most items showed a pattern similar to the mental health and tobacco, alcohol, and drug section, with the highest rate in the ''HH with multiple disabilities'' group, intermediate rates in the ''just HH'' and ''other disability than HH,'' and lowest rate in the ''no disability'' group. In the ''HH with multiple disabilities'' group, 72% reported truancy and 29% being bullied. Corresponding rates for the ''no disability'' group were 46% and 11%, respectively. One school-related item-not achieving passes in all subjects-had a deviant distribution. The lowest rate was in the ''just HH'' group, 25%, compared with 33% in the ''other disability than HH'' group."}, {"section_title": "HH Students With Multiple Disabilities", "text": "In the results, HH participants also reporting a visual disability or a motor disability did not differ from those HH participants who had reading and writing problems. So the situation for the students with multiple disabilities was just the same irrespective of disability. But HH students with multiple disabilities who often/ always suffered from tinnitus had higher rates of symptoms compared with the others in this group. Items reaching a significant level (p , .05) included many of the mental health items, the binge drinking item, and the item about being offended by an adult (i.e., insulted or badly treated) at school this semester."}, {"section_title": "Multivariate Analyses", "text": "''HH with multiple disabilities'' group in relation to ''no disability'' group. The ''HH with multiple disabilities'' group had higher scores in all included items ( Table 2 ). The background items explained 3% of the total variance and included the items ''not born in Sweden'' and ''not living together with father and mother.'' The physical and mental health symptoms items explained 17% of the variance and included ''often irritated,'' ''poor health,'' ''often headache'' and ''low sense of coherence.'' The alcohol, drugs, tobacco, and gambling items explained 15% of the variance and included ''use of illicit drugs'' and ''daily use of cigarettes or snuff.'' The school adjustment and inclusion items explained 9% of the variance and included ''not passing all subjects,'' ''being bullied,'' ''offended by adults'' (insulted or badly treated), and ''truancy.'' An integrated model, including the items ''use of illicit drugs,'' ''irritated,'' ''poor self-rated health,'' and ''being bullied,'' explained 24% of the variance.\n''HH with multiple disabilities'' group in relation to ''just HH'' group. The background item, not born in Sweden, explained 7% of the variance (Table 3) . The physical and mental health items explained 17% of the variance and included ''ill-health'' and ''often irritated during last 3 months.'' The alcohol, drugs, tobacco, and gambling items included 23% of the variance and included ''ever used illicit drugs'' and ''six drinks or more on the same occasion at least twice a month.'' The school adjustment and inclusion item ''not passed in all subjects'' explained 10% of the variance. The integrated model including the items ''six drinks or more on the same occasion at least twice a month,'' ''often irritated during the last 3 months,'' and ''not passed in all subjects'' explained 27% of the variance.\n''Just HH'' group in relation to ''no disability'' group. The physical and mental symptoms just including ''often depressed during the last 3 months'' explained 2% of the variance (Table 4 ). The school adjustment and inclusion items explained 2% of the variance and included ''been bullied this semester'' and ''do not like to be in school.'' There were no significant items in background or tobacco, alcohol, drugs, and gambling items. The integrated model including the items ''often depressed during the last 3 months'' and ''been bullied this semester'' explained 3% of the variance."}, {"section_title": "Discussion", "text": "The main finding of this study was that ''HH students with multiple disabilities'' were evidently more at risk in most areas studied than the ''no disability'' group and also compared with students with ''just HH.'' ''HH students with multiple disabilities'' experienced less wellbeing, were more often being bullied, and used drugs more often than other students. The ''just HH'' students were not as vulnerable as the students ''HH with multiple disabilities,'' but they were however more often depressed and being bullied compared with the ''no disability'' group of students. In both groups with a hearing loss, being bullied was one of the items that were more common compared to the group with ''no disability.'' This possibly indicated that all types of weakness increase the risk of being bullied. This has earlier been reported in literature (Eriksson, Lindberg, Flygare, & Daneback, 2002) . These two groups had also a poor self-reported health, but in different ways. The ''just HH'' reported that they were depressed and the adolescents ''HH with multiple disabilities'' reported that they were irritated and had headache and a low sense of coherence.\nA large proportion of students (38%) reporting a hearing loss also reported additional other disabilities. This is a figure comparable with previous studies (Brunnberg, 2003; Gallaudet Research Institute, 2005; Hendar, 2005; Steen et al., 1989) . The group of ''HH with multiple disabilities'' reported that problems in different areas were much more frequent than the other groups. The strong influence of illicit drugs could possibly indicate early breaking of norms in this group of students as part of a marginalization process (Lander, Olsson, Rönneling, & Skrinjar, 2002) .\nMost adolescents in the region with severe or profound hearing loss (n 5 21) attended special school and were not included in the present survey. They constituted 0.7% of the total cohort and were the majority of young people needing to communicate in Swedish Sign Language (SSL). The students in the present study reporting a hearing loss with and without other disabilities constituted a further 5.0% of the cohort and probably correspond rather closely to the group with minor hearing loss that constituted 3.6% of the northern Finland cohort (Sorri & Rantakallio, 1985) and the group with some hearing problems (3.25%) in the report from Gallaudet Research Institute (2005). The students answered ''yes'' to the question about having a disability/handicap, so the students themselves felt they had a hearing disability. So our conclusion is that most students in the present study had a mild/moderate hearing loss. We will use the concept of a minor hearing loss in contrast to a marked hearing loss for students having a severe or profound hearing loss. In Sweden, there is a difference between the two groups in a language baseline so students with minor hearing loss are educated in a spoken language environment and children with a marked hearing loss in an SSL environment where the first language in the classroom can be either spoken Swedish or SSL.\nIn the National Education Longitudinal Study (NELS:88) in the United States, approximately 10% of young people had a disability (Hollar, 2005) . In the present study, 14.7% of the students reported disabilities. Other studies have reported 9.4% (Hollar & Moore, 2004 ) and 9.6% (Suris & Parera, 2005) . Our figures are somewhat higher, which could be explained by differences in the classification of disability and type of report (student or parent) (Hollar, 2005) . In this study, the students self-reported. We would argue that the students are better placed than adultsparents or professionals-to provide specific information that prioritizes the importance of their everyday experiences (Balen et al., 2006) . There can also be big changes in the frequency of a mild hearing disability over time in a country (Muhr et al., 2007) , and there might be changes over time even for a moderate hearing loss and other disabilities. There can also be differences between countries.\nWhen completing the survey, participants with a disability were offered routine help, such as support for those with visual disability. There was no indication during our analysis of the survey that the participants with a disability had more missing answers, or obviously incorrect answers, than students without a disability. Consequently, our findings could probably not be explained by differences in response style or other external factors. The results in this study could be generalized to the population with slight, mild, moderate hearing loss, excluding the most severe and profound cases with deaf and HH participants. All students in the present study had spoken language and not sign language as their first language.\nOur survey included a specific item on hearing disability as well as about other disabilities. We specifically analyzed the situation for adolescents with a hearing disability. They were categorized into HH with and without some other disability. Hollar's (2005) study only analyzed sensory disabilities in general. In several other studies, type of disability is not related to the main findings (Hogan, McLellan, & Bauman, 2000; Hollar & Moore, 2004; Suris & Parera, 2005) . We do not know of any previous study of adolescents with disabilities that analyze the situation in the present way.\nSorri, Maki-Torkko, Jarvelin, and Oja (1997) concluded that very few studies in the literature are about children with minor hearing loss. They added that, from the clinical point of view (need for therapy or rehabilitation, or allocation of services), figures based on clinical data may be considered sufficient. On the other hand, children with slight/mild/moderate or unilateral hearing loss should not be ignored. They may need interventions and are potentially at risk from other health hazards in later life (Muhr et al., 2007) . In the study by Sorri et al. (1997) , clinical suspicion revealed only one-third of the HH/deaf. Those missed were children with minor or unilateral hearing loss. Our study shows that this group of adolescents with a minor (slight/mild/moderate) hearing loss having some other disability is a high-risk group in terms of ill-health.\nThe findings of Bess, Dodd-Murphy, and Parker (1998) are also in accordance with our findings of mental health and school problems. They do not report data on smoking, alcohol, and drugs. The ninth year children reported somewhat higher rates of symptoms than those in the sixth year. Wake et al. (2006) could not confirm increased mental symptoms in children in the first and fifth years. Perhaps a slight or mild hearing loss has more important implications during the adolescent period in life than during younger years.\nMany studies show that, in a group of adolescents with a marked hearing loss, the relationship with mental symptoms and school problems is obvious. HH and deaf children are using health services more frequently than other children (Gallaudet Graduate Research Institute & Delmarva Foundation for Medical Care, 2002) and report mental health problems 1.5-2 times more often than other children (Hindley, 2005) . In one study from Ö rebro, Sweden, use of alcohol and drugs did not considerably differ between deaf and HH participants and other adolescents in terms of quantitative aspects. However, deaf and HH participants used sedatives and hypnotics more frequently than adolescents without a hearing loss (Nilsson, Samuelsson, Å blad, & Ö sterholm, 2003) .\nThe present study seems to confirm the concern expressed by Sorri et al. (1997) . Even if the ''just HH'' group only differs on a few items, those findings could be important for the future general adjustment of the adolescent. They include mental health symptoms such as depressive symptoms as well as bullying by fellow students. Increased number of mental health symptoms is reported in several studies of deaf and HH participants (Bond, 2000; Hindley, 2005; Van Eldik, Treffers, Veerman, & Verhulst, 2004 ). An increased rate of being bullied, ostracism, or isolation has also been reported in populations with severe or profound hearing loss (Brunnberg, 2003; Lawenius & Andersson, 1998; Tvingstedt, 1993) .\nAs in the present study, some studies have related disability in general to use of alcohol and drugs during adolescence. A study from Canada involving 104 participants reported a lower rate of smoking cigarettes or marijuana or drinking alcohol (Stevens et al., 1996) . In a larger study from Australia, 5.8% of 3,918 pupils self-reported disabilities (Hogan et al., 2000) . The participants with a disability reported a higher rate of smoking cigarettes and being drunk on four or more occasions. They had more psychiatric symptoms but were less often bullied. In a recent study from Spain, 665 (9.6%) adolescents with chronic disorders in a sample of 6,952 pupils were examined (Suris & Parera, 2005) . Differences were only found in the female group, with higher rates of sexual activity, regular smoking of cigarettes, and history of use of synthetic drugs in the group with disabilities. These studies present divergent results. Our study supports the positive association between adolescents with disability and substance use, but only among those adolescents with multiple disabilities.\nThe NELS of 1988 NELS of -2000 in the United States reported that students with a disability who smoked cigarettes and used alcohol and drugs showed a higher rate of poor school performance compared with those who did not (Hollar & Moore, 2004) . Comparing type of disability, Hollar (2005) reported that those with learning disabilities, emotional disabilities, and multiple disabilities were more often binge drinkers and marijuana users than those with sensory disability and physical disability. This corresponds with our finding of substance use problems in the group ''HH with multiple disabilities'' but not in the group ''just HH''. So HH adolescents with multiple disabilities seem to be a high-risk group for substance use problems."}, {"section_title": "Implications for Intervention Procedures", "text": "The two groups of young people with a hearing loss-''HH with multiple disabilities'' and ''just HH''-have more mental health symptoms and have more often been bullied by children or badly treated by adults than the children with ''no disability.'' Our results indicate that it is especially important to identify the adolescents with a hearing loss and some other disability in order to intervene. In the group ''HH with multiple disabilities,'' being bullied, being illtreated, ill-health, and early norm-breaking behavior are identified, such as use of illicit drugs. Intervention procedures directed toward illicit drugs could possibly be used. Such procedures have been developed (McCambridge & Strang, 2004 . But a special model needs to be developed for supporting ''HH adolescents with multiple disabilities.'' There seems to be a multiplied, not just added, influence of the hearing loss when combined with some other disability, and the ''HH with multiple disabilities'' needs to get attention and support. "}, {"section_title": "Note", "text": "1. The region has one special school for deaf and HH children, with bilingual education in Sign Language and Swedish, used in parallel for different functions and reinforcing each other. The school environment is a sign language environment. A central authority in Sweden, and not the parents, makes the decision about which child will attend the special school. One criterion for the child to be able to attend the special school is that the child is not able to follow the education in mainstream school, and another reason is that the child also needs sign language in order to communicate. The students attending this special school are deaf or HH students with a severe and profound hearing loss although there is no decibel limit. The dominant discourse about learning environments for HH children, which can affect the decisions about placement, seems to concern a model about the impact of communication and language as a whole. It is not a family culture-based model. The decision is made after an educational, social, psychological, and medical investigation. The students can have SSL as their first or second language. In this special school, there are no children with just minor or moderate hearing loss, so the students participating in the present study are those with minor and moderate hearing loss. There can be just single students with severe hearing loss or with cochlea implantation. In the region, 21 deaf and HH adolescents in the same age as the students in this study attended the special school for deaf and HH children. There were some other special schools or special classes in the region for children with disabilities. One adolescent from the region attended a special school for children with profound multiple disabilities, and 12 adolescents attended a special school for children with a motor disability or autism. There were at least 19 adolescents with a learning disability attending special classes in mainstream schools in the region who were not included in this study."}]