[{"section_title": "Abstract", "text": "Time-dependent data collected in studies of Alzheimer's disease usually has missing and irregularly sampled data points. For this reason time series methods which assume regular sampling cannot be applied directly to the data without a pre-processing step. In this paper we use a machine learning method to learn the relationship between pairs of data points at different time separations. The input vector comprises a summary of the time series history and includes both demographic and non-time varying variables such as genetic data. The dataset used is from the 2017 TADPOLE grand challenge which aims to predict the onset of Alzheimer's disease using including demographic, physical and cognitive data. The challenge is a three-fold diagnosis classification into AD, MCI and control groups, the prediction of ADAS-13 score and the normalised ventricle volume. While the competition proceeds, forecasting methods may be compared using a leaderboard dataset selected from the Alzheimer's Disease Neuroimaging Initiative (ADNI) and with standard metrics for measuring accuracy. For diagnosis, we find an mAUC of 0.82, and a classification accuracy of 0.73. The results show that the method is effective and comparable with other methods."}, {"section_title": "Introduction", "text": "Alzheimer's disease (AD) is an irreversible brain disorder which progressively affects cognition and behaviour, and results in an impairment in the ability to perform daily activities. It is the most common form of dementia in older people, affecting about 6% of the population aged over 65, and it increases in incidence with age. The initial stage of AD is characterised by memory loss, and this is the usual presenting symptom. Memory loss is one constituent of mild cognitive impairment (MCI), which can be an early sign of Alzheimer's disease. MCI is diagnosed by complaints of subjective memory loss (preferably corroborated by a close associate or partner of the individual), impairment of memory function, unimpaired general cognition and behaviour but with no evidence of dementia [1] . MCI does not always progress to dementia or to a diagnosis of Alzheimer's disease, but those with amnestic mild MCI, the type of MCI characterised by memory impairment, are more likely to develop dementia than those without this diagnosis. In cases where an individual does develop Alzheimer's disease, the phase of MCI ends with a marked decline in cognitive function, lasting two to five years, in which semantic memory (the recall of facts and general knowledge) and implicit memory (the long-term, nonconscious memory evidenced by priming effects) also becomes degraded.\nClinical diagnosis of dementia relies on information from a close associate or partner of the individual, and on cognitive and physical examinations. Once dementia is diagnosed it is usually subclassified into Alzheimer's disease, vascular dementia or Lewy Body dementia [2] [3], these three classes making up the majority of cases. Risk factors for Alzheimer's disease are multifarious, including sociodemographic (in particular age), genetic (notably ApoE status), and medical history (such as a diagnosis of depression). The cause of Alzheimer's disease is not fully understood, but plaques containing amyloid β-peptide (Aβ) in brain tissue and neurofibrillary tangles containing tau protein are the primary histological features [4] ."}, {"section_title": "Predicting Alzheimer's disease", "text": "The disease pathology leads to an progressive, irreversible loss of brain function which suggests that prospective drug therapies should be tested for efficacy as early in the process as possible. So there has been a demand for predicting which individuals will develop AD as early as possible in order to test drug therapies which might inhibit or prevent tissue damage. There has been much research effort put into the prediction of an AD diagnosis among those who are diagnosed with MCI, in particular using imaging to detect early signs of the disease pathology: a meta analysis of 32 structural MRI or amyloid PET imaging studies that reported conversion to AD in patients with MCI is given by Seo et al. [5] . This analysis concluded that amyloid PET is a better predictor of progression to AD from MCI than MRI atrophy measures (effect size 1.32 vs 0.77), but that MRI on entorhinal cortex atrophy (effect size 1.26) is comparable in prediction value to that of amyloid PET. Another comparison of biomarker predictivity found that the highest predictive accuracy was achieved by combinations of amyloidosis and neurodegeneration biomarkers [6] . The individual biomarker with the best performance was [18F]-fluorodeoxyglucose-positron emission tomography (FDG-PET) which measures temporoparietal hypometabolism.\nCognitive markers have also been widely applied for early detection of Alzheimer's disease: a review is presented by Gainotti et al. in [7] which concluded that measures of delayed recall are the best neuropsychological markers of conversion from MCI to AD. Significantly, they also suggest that MCI subjects with deficits in multiple cognitive domains including memory may not be the best candidates for clinical trials of disease-modifying drugs: of this group about 50% of this will convert to AD within 2 years, making their condition less modifiable than for those who are at an earlier stage of the disease."}, {"section_title": "The TADPOLE challenge", "text": "In evaluating a method for predicting Alzheimer's disease it is important to compare the results with the current state of the art in order to calibrate the accuracy. In the past few years there have been a number of challenges which allow comparison between methods using a common data set and standardised evaluation metrics. The CADDementia challenge [8] compares algorithms for multi-class classification of AD, MCI and controls based on structural MRI data. The Kaggle Neuroimaging challenge https://www.kaggle.com/c/mci-prediction [9] is based on the Kaggle machine learning platform and uses data from the Alzheimers Disease Neuroimaging Initiative (ADNI) http://adni.loni.usc.edu/ which is one of the most commonly used data sets for studies of Alzheimer's disease [10] . The challenge involved a four-fold classification into AD, MCI, MCI converters to AD, and controls.\nThe 2017 TADPOLE grand challenge https://tadpole.grand-challenge.org/ is currently taking place with the evaluation to be completed by January 2019. The challenge is a three-fold diagnosis classification into AD, MCI and control groups, and the prediction of ADAS-13 score and normalised brain volume [11] . The TADPOLE challenge has the aim of predicting the onset of Alzheimer's disease using different modes of measurement, including demographic, physical and cognitive data. In common with many other studies [10] , the TADPOLE data set is also derived from ADNI. ADNI itself is comprised of four phases: ADNI-1 (2004), ADNI-GO (2009), ADNI-2 (2011), and ADNI-3 (2016). ADNI-1 registered 200 healthy elderly, 400 participants with MCI, and 200 participants with AD, and the subsequent phases continued to add participants. The TADPOLE competition involves predicting future data collected as part of the ADNI-3 phase. The competition organisers provide a leaderboard dataset which is separate from the main competition and which allows prediction methods from different teams to be evaluated. The results presented here are derived from the TADPOLE leaderboard dataset. Since TADPOLE data is based on ADNI, data used in the preparation of this article were obtained from the (ADNI) database (adni.loni.usc.edu). ADNI is led by Principal Investigator Michael W. Weiner, MD. For up-to-date information see www.adni-info.org."}, {"section_title": "Forecasting", "text": ""}, {"section_title": "Leaderboard data", "text": "The leaderboard dataset has a training set LB1 and a set LB2 whose participants subsequently continued from ADNI-1 into ADNI GO/ADNI-2 to form the leaderboard test set LB4. LB2 is formed of ADNI-1 time points for 110 participants who who were not diagnosed with AD at the last ADNI-1 time point. The test set LB4 comprises the data points for those same LB2 participants during their continuing participation in ADNI GO/ADNI-2. The training set LB1 comprises data from participants who are not represented in LB2. The task is to predict the diagnosis, ADAS-13 score and the normalised ventricle volume for the set LB4 using set LB1 and the participant histories recorded in LB2. The results are evaluated by comparison with LB4 data using a variety of metrics. No information from LB4 may be used for model training, but demographic and other details about the participants who contributed to LB4 are available from LB2, and past time varying data such as imaging and cognitive measurements are also available from LB2. A histogram of time series lengths for LB1 and LB2 is shown in Figure 1 .\nFeatures for prediction are selected from the demographic, cognitive and physical data variables in the ADNI/TADPOLE data. The physical data comprises, among other measurements, MRI data (volumes, cortical thickness, surface area), PET (FDG, AV45 and AV1451), DTI (regional means of standard indices) and levels of markers from cerebral spinal fluid (CSF)."}, {"section_title": "Evaluation set", "text": "For the purposes of training we form an evaluation set which is similar to the time series used in the leaderboard evaluation, that is LB2 from the ADNI-1 phase and the test set LB4 from the ADNI-GO and ADNI-2 phases. We select the evaluation set from LB1 by choosing participants who match those of LB2 and whose ADNI-1 time series length is similar. The post-ADNI-1 phases of this matched evaluation set can be used to assess the prediction accuracy, which should be similar to that of the test set LB4. To create the evaluation set we examine each participant time series in LB2 and find those participants in LB1 who have a matching gender, ApoE status and age (to within 5 years) and whose diagnosis matches at the start and end of the ADNI-1 period. If more than one matching participant is found we select the one who has the closest match for the time series length in the ADNI-1 phase. The demographic characteristics and ApoE status of the participants from set LB2 and the matched evaluation set are shown in Figure 1 . Table 1 : Demographic characteristics and ApoE status for participants from the set LB2 compared with a matched evaluation set selected from LB1. The variables shown are the sample size n, age as minimum, mean and maximum, gender and ApoE status.\nDiagnosis. The accuracy for ten independent splits of 10% of the evaluation set, and the training error on the full evaluation set is shown in Table 2 Table 2 : Prediction accuracy for diagnosis in the evaluation set. The first ten rows show the results for each partition of the evaluation set. The final row labelled Full shows the training accuracy for the entire set of 92 participants. The first column shows a baseline accuracy which is obtained by using the last diagnosis as the predictor for subsequent values. The metrics used are taken from the TADPOLE competition and the codes reimplemented in order to double-check the results. As a measure of accuracy we report the multiclass area under the receiver operating curve (mAUC) and balanced classification accuracy (BCA). The mAUC is based on Hand and Till's extension of AUC to multiple classes [15] which takes the average AUC over all the pairs of classes, where each pair of AUCŝ A(c i , c j ),Â(c j , c i ) is itself averaged. The balanced classification accuracy (BCA) is based on point scores, and is the mean of the True Positive rate and True Negative rate."}, {"section_title": "Training", "text": "We train the model using the time series from LB1 and LB2. Points from ADNI-GO and ADNI-2 which are used to compute prediction accuracy are not used for for training. Training is performed on 90% of the participants in the evaluation set with accuracy measured on the remaining 10%, this repeated for 10 independent splits of the whole evaluation set. We train only on time series with at least 4 points, this minimum having been determined during training. The prediction variables are selected manually by optimising the mean accuracy found on the evaluation set."}, {"section_title": "Forecasting method", "text": "The purpose of a forecasting method is to predict a patient's condition at points in the future using demographic, cognitive and physical data variables from time points in the participant's history. A common approach to automatic prediction is to use time series methods which use weighted combinations of past data points to predict the next data point. Time series models in general encode a mapping from an r-dimensional space to the output, where time is not one of the input dimensions. But many time series in the training data are short and the sampling periods are irregular, so much of the information in the training set lies in the mapping from the time delay between measurements to the output rather than in the sequence of input values 5 . Another approach is to use an input space formed of demographic variables λ, last diagnosis g (t−∆t) , time since last measurement ∆t, and map vectors in this to the output variable g t . Again assuming additive error, the model is,\nWe use an ensemble of decision trees to estimate the regression function f . Decision trees approximate the regression function by partitioning the input (feature) space into a set of rectangles [13, p305] . The training algorithm iterates over all the features and selects the feature and split point that gives the best partition for the training data; this is repeated until a stopping criterion is met, such as a minimum number of points in the rectangle. The best partition is that that which gives the minimum total impurity in the two subsets that are formed. However, in our experience decision trees own tend to overfit the training data and perform poorly on new data, so we use a ensemble of trees and poll the individual results as an estimator. Further improvement is seen with the random forest algorithm in which the features are chosen randomly at each split point [14] . An introduction to the theory of random forests is given in Hastie et al. [13, ch16 ]."}, {"section_title": "Results", "text": "There are three target outcomes for prediction: 1) Diagnosis, 2) the ADAS-13 score, and 3) VENTS-ICV which is the ventricles volume divided by intracranial volume. We first present results from the evaluation set, followed by the test set accuracy."}, {"section_title": "ADAS-13 and VENTS-ICV.", "text": "The prediction error for ten independent splits of 10% of the evaluation set, and the training error on the full evaluation set is shown in Table  3 where the first two columns show ADAS-13 results and the next two columns show those for the ratio of ventricle volume divided by intracranial volume.\nPredictors. The predictor variables that were selected during training are shown in Table 4 . These were chosen by starting from a base set of variables and adding variables to increase the prediction accuracy. The set of predictors for diagnosis and ADAS-13 are the same except that for ADAS-13 the most recent value of the variable ADAS13 and its slope are added. Table 3 : Mean absolute error for predicting ADAS-13 and VENTS-ICV in the evaluation set. In each case the baseline is a prediction using the last value of the variable to be predicted. The first ten rows show the results for each partition of the evaluation set. The final row labelled Full shows the result for the entire set of 92 participants. Table 4 : The set of variables from which features are chosen for predicting diagnosis and ADAS-13 values. The most recent value of each variable is used for prediction. The MMSE value is thresholded at 26. For predicting ADAS-13, the variables ADAS13 and ∆ADAS13 are added. For predicting VENTS-ICV, the two target variables VENTS and ICV are predicted separately using the last value and slope of the respective variable, with TIME DELAY also used. The prefix ∆ indicates that the slope of the variable over the history is used for prediction."}, {"section_title": "Variable Meaning", "text": ""}, {"section_title": "RID", "text": ""}, {"section_title": "Participant identifier", "text": ""}, {"section_title": "Test set LB4", "text": "The accuracy on the test set LB4 is shown as the highlighted row of Table 6 which reproduces the results  from the TADPOLE competition leaderboard table. The leaderboard shows entries in rank order where the rank is determined by the lowest sum of individual ranks for mAUC, ADAS-13 MAE and VENTS-ICV MAE. For diagnosis the accuracy is mAUC=0.82 and BCA=0.73, which compares a mean accuracy on our evaluation set of mAUC=0.82 and BCA=0.71. The similarity of test and evaluation errors shows that the evaluation set is well matched to the test set and that the model has not been overtrained. For ADAS-13 prediction the test set error is MAE=5.19, and the evaluation set error is MAE=5.56 and for VENTS-ICV the test error is MAE=0.0023 and the evaluation error is MAE=0.0021. The confusion matrix for the test set is shown in Table 5 . Table 5 : Confusion matrix for predicting the diagnosis of the test set. In this case, the a point forecast is derived from the probabilistic forecast by selecting the diagnosis with the highest score."}, {"section_title": "Discussion", "text": "In selecting participants for clinical trials, a positive PET scan is commonly used as part of the inclusion criteria. However PET imaging is expensive, so when a positive scan is one of the trial inclusion criteria it is desirable to avoid screening failures. So one application of predicting Alzheimer's disease is to preselect candidates before applying the criteria. Time series collected both in clinic and from studies such as ADNI inevitably have missing data points, and are of variable length. The same will be true for clinical data collected from patients, since it is not uncommon for appointments to be missed, and for people to withdraw from data collection for various reasons. Most time series prediction methods assume data which is complete and regularly sampled, so that it has to be pre-processed using imputation or interpolation methods to fulfil this assumption. In this paper, rather than using a traditional time series method we have used a machine learning method to learn the relationship between pairs of time points at different separations. The input vector comprises a summary of the time series history up to that point and the demographic and non-time varying factors such as genetic data. This method makes no assumptions about the dynamics of the time series, and it is applicable to data which has missing and irregularly sampled points. The results are better than a baseline last-value estimator, and they validate the method as effective. There are three target outcomes for prediction: 1) Diagnosis, 2) the ADAS-13 score, and 3) VENTS-ICV which is the ventricles volume divided by intracranial volume. Predictions for diagnosis are presented as relative probabilities for each of the three potential diagnostic categories. For the ADAS score, and the normalised ventricles volume, we provide confidence intervals which indicate in the limit where 50% of the predictions would lie if an experiment were repeated many times on new data. The rank is determined by the lowest sum of ranks from mAUC, ADAS-13 MAE and VENTS-ICV MAE. The metrics are based on those used in the TADPOLE competition. For diagnosis classification we use the multiclass area under the receiver operating curve (mAUC) and balanced classification accuracy (BCA) as described in Table 2 . The metrics used for ADAS-13 and VENTS-ICV are the mean absolute error (MAE), the weighted error score (WES), which is the absolute error weighted by the inverse of the confidence interval range, and the coverage probability accuracy (CPA), defined as, CP A = |j − 0.5|, where j is the proportion of measurements falling within the 50% confidence interval."}, {"section_title": "Acknowledgements", "text": "Data collection and sharing for this project was funded by the Alzheimer's Disease Neuroimaging Initiative (ADNI) (National Institutes of Health Grant U01 AG024904) and DOD ADNI (Department of Defense award number W81XWH-12-2-0012).\nA full list of funding sources for ADNI is provided in the document 'Alzheimers Disease Neuroimaging Initiative (ADNI) Data Sharing and Publication Policy' available through adni.loni.usc.edu/.\nThis work uses the TADPOLE data sets https://tadpole.grand-challenge.org constructed by the EuroPOND consortium http://europond.eu funded by the European Unions Horizon 2020 research and innovation programme under grant agreement No 666992.\nThe MRC Dementias Platform UK (DPUK) https://www.dementiasplatform.uk/ provided support in the preparation of this paper. DPUK is a multi-million pound public-private partnership, developed and led by the MRC, to accelerate progress in and open up dementias research. The aims of DPUK are early detection, improved treatment and ultimately the prevention of dementias."}]