[{"section_title": "Abstract", "text": "ABSTRACT\nFood security and obesity represent two of the most significant public health issues. However, little is known about how these issues are intertwined. Here, we assess the causal relationship between food security during early childhood and relatively long-run measures of child health. Identifying this causal relationship is complicated due to endogenous selection and misclassification errors. To overcome these difficulties, we utilize a nonparametric bounds approach along with data from the ECLS-K and ECLS-B. The analysis reveals a positive association between food insecurity and future child obesity in the absence of misclassification. However, under relatively innocuous assumptions concerning the selection process, we often obtain bounds that indicate a negative causal effect of food insecurity on future child obesity. All results are extremely sensitive to misclassification.\nJEL Classification: C14, C21, I12, I32"}, {"section_title": "Introduction", "text": "The U.S. currently confronts two signi…cant issues related to the health and nutrition of its population.\nThe …rst is food insecurity. The second is obesity. Food insecurity is a metric of material hardship designed to measure 'hunger'in the U.S. (Bhattacharya et al. 2004 ). For households with children, it is measured using the 18-question Core Food Security Module (CFSM), with a greater number of a¢ rmative responses indicating greater levels of food insecurity. Households responding in the a¢ rmative to at least one question are categorized as marginally food secure; a¢ rmative responses to at least three (eight) questions are categorized as low (very low) food secure. Obesity, either as a child or adult, is de…ned as having a body mass index (BMI) above the 95 th percentile of the age-and gender-speci…c reference population. Overweight is de…ned as above the 85 th percentile of the same distribution.\nThe twin issues of food insecurity and obesity have received signi…cant attention of late. In terms of food insecurity, the most recent …gures indicate that 14.9%, or 17.9 million, households were food insecure in 2011. 1 Of these, 9.2%, or 11.0 million, households were classi…ed as low food secure; 5.7%, or 6.8 million, were classi…ed as very low food secure. Among households with children under the age of 18, 10.6%, or 4.1 million, had one or more food insecure adults (but only food secure children); 10.0%, or 3.9 million, contained both adults and children classi…ed as food insecure. These …gures represent a sizeable increase (Muirhead et al. 2009 ). In fact, one of the primary reasons for the increasing interest in food insecurity is its potential association with nutritional deprivation (Bhattacharya et al. 2004 ). In sum, Gundersen et al. (2011, p. 282 ) characterize food insecurity as \"one of the most important and high pro…le nutrition-related public health issues in the United States today.\"\nIn terms of obesity, and child obesity in particular, the prevalence of obese adolescents has tripled in the last thirty years; it has more than doubled for younger children. Speci…cally, the rate of child obesity 1 See http://www.ers.usda.gov/topics/food-nutrition-assistance/food-security-in-the-us/key-statistics-graphics.aspx.\nincreased from 5% to 10.4% for 2-5 year old children, from 4.0% to 19.6%, and from 6.1% to 18.1% for 12 to 19 year-olds between 1971 and 2008 (Ogden and Carroll 2010) . While obesity is a concern for children from all demographic groups, its greater prevalence within lower socioeconomic populations is well established (e.g., Rosin 2008; Liping et al. 2012 ). In 2010, 2.1% of pre-school children from low income families were extremely obese while 15.0% of low-income pre-school children were obese (Liping et al. 2012 ). Brisbois et al. (2012, p. 347) state: \"Obesity is considered to be a worldwide epidemic with little evidence that its incidence is declining or that it has even reached a plateau.\"\nAs childhood obesity has received greater attention, its consequences have becoming increasingly welldocumented. Obesity burdens individuals with severe physical, economic, and emotional su¤ering, and puts children and adolescents at risk for a number of health problems such as those a¤ecting cardiovascular health, the endocrine system, and mental health (Deckelbaum and Williams 2001). Dietz and Gortmaker (2001) note that 60% of overweight children aged …ve to ten years old have at least one associated cardiovascular disease risk factor. Moreover, obesity is persistent; childhood obesity is highly correlated with adolescent and adult obesity (Serdula et al. 1993; Liping et al. 2012 ). In the U.S., the total cost attributable to obesity was over $75 billion in 2000 according to Finkelstein et al. (2004) . More recent estimates put the cost over $200 billion (Cawley and Meyerhoefer 2012) . Walpole et al. (2012) calculate that North America accounts for 34% of the total human biomass in the world despite containing only 6% of the world population. Moreover, the authors estimate that if the entire world had the same BMI distribution as the U.S., this would be equivalent to an additional 935 million people in the world of average BMI. Based on a U.S. poll in 2008, obesity tops the list of health problems children face (Cawley 2010 ). Globally, the World Health Organization ranks obesity among the top ten global public health issues (WHO 1998).\nAs is evident, food insecurity and obesity represent two signi…cant public health issues in the U.S.\nHowever, research related to these problems has remained predominantly distinct. This is, perhaps, not surprising given that 'hunger'and 'obesity'are not usually seen as related. While this may be true in the short-run, the long-run relationship between food insecurity and child BMI is less clear. In this paper, we address this issue by assessing the causal e¤ect of food insecurity on long-run child obesity and overweight status.\nThe long-run relationship between household food insecurity and child BMI is complex, being potentially a¤ected by a number of a factors. First, because food insecurity directly impacts the quantity and quality of food available in the household, nutritional habits may be altered even after a household is elevated to being food secure. For example, households may inadvertently develop unhealthy consumption patterns such as overeating when food is available or consuming energy-dense foods that have no nutri-tional value (Kuku et al. 2012) . Such unhealthy eating patterns may be exacerbated or mitigated over time through participation in nutrition assistance programs such as the School Breakfast Program (SBP), National School Lunch Program (NSLP), and Supplemental Nutrition Assistance Program (SNAP). 2 Second, there is increasing evidence that nutrition in utero and during early infancy have long-run consequences on obesity (Dietz 1997; Martorell et al. 2001 ). Thus, undernutrition due to food insecurity, particularly at critical junctures of fetal, infant, and child development may have long-term e¤ects on future obesity status.\nExisting research sheds little light on the long-run causal relationship between food insecurity and child BMI for two reasons. First, the majority of existing studies focus purely on association, not causation.\nThe reported associations run the gamut, …nding either no relationship (e.g. Bhattacharya As stated above, in this paper we wish to move beyond associations and assess the causal e¤ect of food insecurity on future child obesity and overweight status. To do so, requires us to address two identi…cation issues. First, food insecure households do not constitute a random sample of the population. Observed (in the data) characteristics and unobserved attributes of households may be associated both with a higher propensity to be food insecure and a higher propensity of obesity among its child members. Second, food insecurity status is often mismeasured or misreported in household surveys. People may misreport food insecurity status (e.g., Hamelin et al. 2002) or it may be mismeasured (Gundersen and Kreider 2008, 2009 ).\nThis study extends the literature on the long-term consequences of food insecurity on childhood obesity and child overweight by accounting for non-randomness and mismeasurement of food security status in household survey data. 2 In response to concerns about food insecurity, many nutrition assistance programs exist in the U.S., with SNAP being the largest (Coleman-Jensen et al. 2012). Gundersen and Kreider (2011) …nd a bene…cial, causal e¤ect of SNAP participation on food security after accounting for non-random selection and measurement error in reports of both SNAP participation and food insecurity. Schanzenbach (2009) and Millimet et al. (2010) …nd a detrimental, causal e¤ect of NSLP participation on child obesity. Millimet et al. (2010 Millimet et al. ( , 2012 ) obtain a bene…cial, causal e¤ect of SBP participation on child obesity. Private food assistance programs administered through the nationwide network of Feeding America are additional sources of food assistance for families (Fiese et al. 2011 ).\nTo proceed, we begin by utilizing panel data on over 6,400 children from relatively low socioeconomic status (SES) households during early primary school obtained from the Early Childhood Longitudinal Survey -Kindergarten Class of 1998-99 (ECLS-K). In particular, we examine the causal e¤ect of household very low food security status in spring kindergarten on child obesity and overweight status in the spring of …fth grade. The analysis contains two stages. In the …rst stage, we assess the nature of selection into food insecurity status. In the second stage, we use the nonparametric partial identi…cation method proposed in Kreider et al. (2012) to account for both non-random selection and measurement error in food security status in a single unifying framework. We then turn to a younger sample of children obtained from the Early Childhood Longitudinal Study -Birth Cohort (ECLS-B). Here, we examine the causal e¤ect of household very low food security status at nine months of age on child obesity and overweight status at approximately age …ve.\nThe nonparametric partial identi…cation method of Kreider et al. (2012) provides sharp bounds on the average treatment e¤ect (ATE) of very low food security when food security is non-random and potentially measured with error. These bounds require weaker assumptions than those of an instrumental variable (IV), classical measurement error, or linear response model while addressing both selection and measurement error in food security status. However, as a consequence of imposing less structure, we obtain bounds rather than point estimates. Nonetheless, the bounds reveal exactly what can be learned under di¤erent assumptions concerning the nature of the selection process and the extent of misreporting. Tamer (2010, p. 168) summarizes the advantages of this approach: \"This partial identi…cation approach favors the principle that inference-and conclusions and actions-based on empirical models with fewer suspect assumptions is more robust, hence more sensible and believable. Stronger assumptions will lead to more information about a parameter, but less credible inferences can be conducted.\"\nIn terms of the selection problem, we start with the assumption of exogenous selection. We then discuss what can be learned without making any assumptions concerning the selection mechanism; this is the socalled worst-case bounds (Manski 1995) . Finally, we impose several monotonicity assumptions: a monotone instrumental variable (MIV) assumption that the latent probability of child obesity and overweight status are nonincreasing in socioeconomic status (SES); a monotone treatment selection (MTS) assumption that children from food insecure households have a higher probability of being obese or overweight compared to food secure children; and a monotone treatment response (MTR) assumption that food insecurity cannot reduce long-run child obesity or overweight status. The MIV assumption is weaker than that required for a typical IV (since the MIV is allowed to have a direct impact on the outcome of interest and may be non-random itself). The MTS assumption posits negative selection into food insecurity, a well established …nding in the literature.\nIn terms of the measurement error problem, the existing literature on food insecurity states that people may either under-report food insecurity due to social stigma (e.g., Hamelin et al. 2002) or over-report food insecurity if they fear losing access to food stamps or other nutrition assistance (Gundersen and Kreider 2008 ). We start with the assumption of arbitrary patterns of measurement error ranging from zero to 10% of the sample. However, since the empirical literature on SNAP and the Special Supplemental Nutrition Program for Women, Infants, and Children (WIC) suggests that eligible participants rarely falsely claim such receipt, we further restrict the assumption on measurement error by imposing the assumption of no false positive errors.\nThe results are striking and ought to serve as a note of caution and guide to future evaluations of the long-run e¤ects of very low food security on child outcomes. First, in both the ECLS-K and ECLS-B we obtain positive associations between food insecurity and long-run obesity and overweight status when failing to account for non-random selection or misclassi…cation. However, we …nd strong evidence of nonrandom selection on observed attributes, suggesting that non-random selection on unobserved attributes is likely as well. Unobserved attributes such as household nutritional knowledge, …nancial management skills, pre-and post-natal health and nutrition, etc. are likely to be associated with both food security and subsequent child health. Second, if even one percent of households misreport their food security status, then the association between food security and future obesity or overweight status cannot be signed even under exogenous selection. Thus, accounting for measurement error is crucial.\nThird, bounds that account for selection only -ignoring the possibility of measurement error -exclude zero, indicating a long-run, negative causal e¤ect of very low food security on child obesity when using the ECLS-K data. The ATE cannot be signed when using overweight status as the outcome, or either outcome using the ECLS-B. However, if we rede…ne the control to include only being food secure (as opposed to de…ning the control as being not very low food secure), we are able to exclude zero when assessing obesity in the ECLS-K and overweight status in both the ECLS-K and ECLS-B. This negative causal e¤ect indicates that there potentially exists some tension when simultaneously addressing the twin public health issues of food security and child obesity; achieving the former may contribute to the latter.\nFinally, bounds accounting for both measurement error and non-random selection fail to sign the ATE for any outcome in either data set without imposing additional assumptions beyond those considered here. We are unable to conclude there exists a long-run causal e¤ect (positive or negative) of very low food security on child weight outcomes even if as few as one percent of households misreport their food security status. These results highlight the importance of accounting for both non-random selection and measurement error in food security status in order to identify the long-run causal impact of very low food security on child health or other outcomes.\nThe rest of the paper is organized as follows. Section 2 summarizes the existing literature. Section 3 describes the data. Section 4 describes the methodology. Section 5 discusses the results and o¤ers directions for future research. Section 6 concludes."}, {"section_title": "Literature Review", "text": ""}, {"section_title": "Food Security and Child Health", "text": "As noted in the prior section, a growing number of studies have assessed the contemporaneous association between food insecurity and child obesity. Only a handful of studies investigate the long-run consequences of food insecurity. This research also predominantly focuses on associations. Metallinos-Katsaras et al. waves of the ECLS-B to conclude experiencing very low food security at nine months of age is associated with a higher probability of being overweight at two years of age. The authors also note that very low food security is strongly correlated with infant feeding practices, depressive symptoms, and parenting practices which may explain the higher likelihood of being overweight as a toddler. Dubois et al. (2006) use data from the Longitudinal Study of Child Development in Québec over the period 1998-2002, reporting that family food insu¢ ciency during preschool years is a strong predictor of obesity and overweight status at 4.5 years of age. Moreover, family food insu¢ ciency during preschool years remains a strong predictor of overweight status at 4.5 years of age even if the child was born with a low birthweight.\nSeveral studies utilize the ECLS-K. Jyoti et al. (2005) assess the e¤ect of food insecurity in both kindergarten and third grade on various child development indicators, including BMI, at third grade. They categorize children based on di¤erent combinations of food security and insecurity at the two points in time.\nThe authors …nd a statistically signi…cant, positive association between kindergarten food insecurity and weight gain for girls, regardless of food security status in the third grade. Bhargava et al. (2008) use the ECLS-K to estimate a dynamic random e¤ects model. The authors conclude that household food insecurity is unlikely to exacerbate child obesity. Finally, Rose and Bodor (2006) assess the relationship between food insecurity in kindergarten and overweight status in …rst grade and weight gain from kindergarten to …rst grade. The authors conclude that food insecurity is negatively associated with weight gain, but not overweight status. However, their conclusions vary with the de…nition of food insecurity.\nOf the studies assessing the contemporaneous relationship between food insecurity on child BMI, Gundersen and Kreider (2009) merits detailed discussion given the similarity with our analysis. The authors assess the causal e¤ect of food security on child health outcomes while accounting for both non-random selection and measurement error in food security status using pooled cross-sectional data from the [2001] [2002] [2003] [2004] [2005] [2006] National Health and Nutrition Examination Survey (NHANES) and employing a similar nonparametric bounds approach. The authors obtain bounds that exclude zero under certain monotonicity assumptions and assumptions concerning the misclassi…cation process. Speci…cally, they …nd some evidence of a bene…cial causal e¤ect of food security on overweight status.\nWhile our study is similar to Gundersen and Kreider (2009) , there are important di¤erences. First, we focus on long-run outcomes (i.e., outcomes several years after the measurement of food security). Second, while the age range of children included in their sample is not provided, we examine two speci…c periods of child development. In particular, the ECLS-B allows us to examine the crucial early post-natal period, while the ECLS-K allows us to examine the crucial period spanning the transition into adolescence (Dietz 1997 ). Third, although the non-parametric methodology is identical across the two studies and both consider the assumption of arbitrary measurement errors in food security status, we also consider the additional assumption of no false positives in the reporting of food insecurity. Finally, the treatment of primary focus in their study is being marginally food secure or food secure; the control includes being low or very low food secure. In contrast, our baseline analysis de…nes the treatment as very low food secure and thus the control includes marginally food secure, low food secure, and food secure. We consider their split between the treatment and control in our supplemental analyses."}, {"section_title": "Non-Random Selection and Measurement Error", "text": "None of the above longitudinal studies provide evidence on the long-run causal e¤ect of food insecurity and child health since they fail to simultaneously address the selection and measurement error issues. In terms of selection, Coleman et al. (2012) report that food insecurity rates were substantially higher than the national average for poor households with children of single parents, black and Hispanic households, and households in large cities and rural areas. Thus, food insecure children are not randomly selected. These characteristics, in turn, are correlated with worse health outcomes such as greater incidence of obesity (e.g., Forshee et al. 2004 ).\nHowever, food insecurity and poverty are not synonymous. For instance, document that a signi…cant number of poor households are food secure; almost 65% of households around the poverty line are food secure. Moreover, a substantial number of non-poor households are food insecure; households with an income-to-poverty ratio close to two have a food insecurity rate above 20%, and households with an income-to-poverty ratio of around three have food insecurity rates of close to 10%. As such, it is quite likely that unobserved attributes such as nutrition and health knowledge, …nancial literacy, social networks, etc. may be associated with both food insecurity and obesity and overweight status in adults and children. Thus, selection into food insecurity depends on more than observed socioeconomic attributes.\nTurning to measurement error, Bound et al. "}, {"section_title": "Data", "text": "Data come from the ECLS-K and ECLS-B, collected by the National Center for Education Statistics.\nThe ECLS-K surveys a nationally representative cohort of children throughout the U.S. in fall and spring kindergarten, fall and spring …rst grade, spring third grade, spring …fth grade, and spring eighth grade.\nThe sample includes data on over 20,000 students who entered kindergarten in one of roughly 1,000 schools during the 1998-99 school year. We retain children for whom we have valid measures of age, gender, height, and weight in …fth grade. 3 The ECLS-B collects information on a nationally representative cohort of roughly 10,700 children born in 2001 at nine months of age, two years, four years, and …ve years. Both surveys collect detailed family background information, as well as height, weight, and food security. We retain children for whom we have valid measures of age, gender, height, and weight during the …nal wave.\nIn addition, in both cases we limit the samples by excluding households in highest quintile of SES. 4 From the information on height and weight of the children, we create BMI z-scores. We convert z-scores to percentiles. Note that z-scores and percentiles are based on CDC 2000 growth charts; these are ageand gender-speci…c, are adjusted for normal growth, and percentiles are based on the underlying reference population. 5 Obesity (overweight) is de…ned as being above the 95 th (85 th ) percentile.\nThe o¢ cial food security rate is de…ned over the preceding 12 months. In both surveys, it is calculated on the basis of households'responses to a list of 18 questions in the CFSM for families with children. 6 The CFSM is a survey module used by the USDA (Nord et al. 2009 ). The questions aim to capture certain aspects of food insecurity and vary in terms of the severity of the outcome. For example, \"We worried whether our food would run out before we got money to buy more\"is the least severe outcome while \"Did you or other adults in the household ever cut the size of your meals or skip meals because there wasn't enough money for food?\"is more severe. The most severe food insecurity outcome captured in the CFSM is: \"Did any of the children ever not eat for a whole day because there wasn't enough money for food?\" Some of the questions inquire about the frequency with which a certain aspect of food insecurity manifests itself. It is important to note that each of these questions assumes that the condition is due to …nancial constraints. Table A1 in the appendix presents the CFSM.\nThe earliest wave of the ECLS-K containing responses to the CFSM is spring kindergarten. The ECLS-B contains responses to the CFSM beginning in the initial wave. Utilizing this information, we obtain three measures of food insecurity following o¢ cial de…nitions. First, a household with children is classi…ed as 3 We do not examine eighth grade outcomes due to the high attrition rate of children during the transition to middle school for many children. 4 The initial sample size of the ECLS-K is 21,260. After cleaning age, weight, and height as described in Millimet and Tchernis (2013, Appendix C), and due to sample attrition, the sample size falls to 9,360 in the …fth grade wave. Restricting the sample to a balanced panel reduces the sample size to approximately 9,160. Excluding children from households in the top quintile of SES reduces the sample to 6,470. All samples are rounded to the nearest 10 per NCES restricted data guidelines. In the ECLS-B the possible sample size is roughly 6,950; the initial sample size in the …rst wave is about 10,700. Restricting the sample to those with valid data on age, gender, height, and weight reduces the sample size to approximately 5,450. Excluding children from households in the top quintile of SES reduces the sample to 4,100. Note, all sample sizes are rounded to the nearest 50 per NCES restricted data regulations for the ECLS-B. 5 z-scores and their percentiles are obtained using the -zanthro-command in Stata. 6 Families without children and one-member households face a subset of ten questions. "}, {"section_title": "Methodology", "text": "Our objective is to bound the ATE of being food insecure on future weight status. The ATE captures the expected e¤ect of food insecurity (relative to not food insecure) for a random child chosen from the underlying population. 7 With binary outcomes, the ATE is de…ned as\n7 In this section, child's weight status implicitly refers to our long-run measures of obesity and overweight status. Food insecurity refers to a measure of household food insecurity (i.e., marginally food secure, low food secure, or very low food secure) obtained in the initial period (spring kindergarten in the ECLS-K and 9-months of age in the ECLS-B). For ease of exposition, we will refer to the child being food insecure (or not) although food security is determined at the household level.\nwhere P [ ] denotes the probability of the argument being true, H is a binary indicator de…ned such that one (zero) denotes a bad (good) health outcome (e.g., obese or overweight), and F I is a binary indicator de…ned such that one (zero) corresponds to actual food insecurity (security). The probabilities are conditioned on observed covariates denoted by X 2 with values in the set . In this approach, conditioning on covariates only helps to de…ne subpopulations of interest (Kreider et al. 2012 ). For notational simplicity, X 2 is dropped in the following derivations. Furthermore, from here on let H(1) H(F I = 1) and\n, where H(1) and H(0) represent potential outcomes.\nTo assess the causal e¤ect of food insecurity on a child's health using observational data, two identi…cation problems must be addressed. The …rst is the well-known problem of the missing counterfactual.\nFor instance, we do not observe the probability of an adverse health outcome for food insecure children if instead they had been food secure. This is referred to as the selection problem. To see this, note that by the Law of Total Probability we can write\nIf actual food insecurity status is observed, the sampling process identi…es P (F I = 1) and P (F I = 0) and the expected outcome conditional on the outcome being observed, P [H(1) = 1jF I = 1]. However, the sampling process fails to identify the average outcome for those not food insecure, P [H(1) = 1jF I = 0].\nThe second identi…cation problem arises if actual food insecurity status is not observed for all respondents. Let F I denote the observed, self-reported indicator of food insecurity status, where F I equals one if the household reports being food insecure and zero otherwise. This is referred to as the measurement or misclassi…cation error problem. With misclassi…cation the sampling process fails to provide any useful information on actual food insecurity status, F I , absent assumptions on the extent and type of measurement error. In this case, all quantities on the right hand side of equation (2) are unknown.\nLet the latent variable Z denote whether a report is accurate or not; Z equals one if F I = F I and zero otherwise. Kreider et al. (2012) show that P [H(1) = 1] may be decomposed as follows:\nwhere H is the observed (realized) health outcome,\nP (H = j; F I = 1; Z = 0) and j P (H = j; F I = 0; Z = 0) represent the proportion of false positive and false negative classi…cations of food insecure children, respectively, for children realizing health outcome j = 1; 0. 8 Examination of (3) reveals that all of the terms on the right hand side except P (H = 1; F I = 1) and P (F I = 0) are unobserved.\nis not identi…ed since F I is unobserved and the terms are not identi…ed since Z is unobserved.\nGiven the lack of nonparametric identi…cation of the ATE, bounds are derived by combining various assumptions concerning the nature of the selection process along with two assumptions about the nature and extent of measurement error."}, {"section_title": "Classi…cation Error Assumptions", "text": "When considering measurement error, we allow for two cases. In the …rst case, we place no structure on the pattern of reporting errors. We refer to this case as arbitrary errors. In the second case, we impose some structure by assuming that no households falsely report being food insecure. We refer to this as the case of no false positives. Due to social stigma or embarrassment, many households may overstate their level of food security (Hamelin et al. 2002) . However, it is also possible that some households falsely report being and\nAssumption A2 implies"}, {"section_title": "Exogenous Selection 4.2.1 No Misclassi…cation Errors", "text": "Since the existing literature on the long-run consequences of food insecurity typically assumes exogenous selection into food insecurity, this assumption provides a usual starting point for the analysis. The assumption of exogenous selection is expressed as\nAccordingly, using (2) implies\nFinally, with exogenous selection and no misclassi…cation errors, the ATE is nonparametrically identi…ed and given by"}, {"section_title": "Misclassi…cation Errors", "text": "Allowing for misclassi…cation, the AT E is no longer nonparametrically identi…ed even under the assumption of exogenous selection as F I is not observed in (6) . To illustrate, note that\ncan be decomposed as\nwhere the sampling process identi…es only P (H = 1; F I = 1) and P (F I = 1). The term ( To derive bounds on the ATE under di¤erent assumptions concerning the nature and extent of the misclassi…cation errors, recall that ATE is given by\nThus, the bounds for the ATE are given by\nwhere U B and LB denote the upper and lower bounds, respectively.\nWith arbitrary errors, Kreider and Pepper (2007) derive the following expressions for the bounds:\nUnder the assumption of no false positives, the individual components of the ATE, given in (8) , are bounded as follows\nAccordingly, the bounds on the ATE are given by\nAllowing for measurement error, the bounds on individual components of the ATE become\nWith arbitrary errors, the bounds on ATE are given by\nLB AT E = P [H = 1; F I = 1] minfQ;\nUnder the assumption of no false positives, the bounds become potentially tighter and are given by"}, {"section_title": "No Selection Assumption", "text": "The bounds given in (11) - (14) invoke the assumption of exogenous selection which is highly improbable.\nConsequently, we next consider what can be learned about the ATE of food insecurity on child health without invoking any assumptions concerning selection into the treatment following Manski (1995)."}, {"section_title": "No Misclassi…cation Errors", "text": "In the absence of measurement error, but with no assumptions concerning selection, the only information available concerning the missing counterfactuals are that they lie in the unit interval since they represent\n. Accordingly, the individual components of the ATE are bounded as follows\nNote, the width of the bounds on P [H(1) = 1] is the censoring probability, P (F I = 0), while the width of the bounds on P [H(0) = 1] is the inclusion probability, P (F I = 1). As a result, although the bounds on ATE are sharp, the width always equals unity and includes zero (Manski 1995) . So, without identifying restrictions on the selection mechanism, it is impossible to sign the ATE. While the sign is unknown, extreme values are excluded from the bounds, thus providing some potentially useful information."}, {"section_title": "Monotonicity Assumptions", "text": "While the bounds given in (15) - (18) have the advantage of not invoking any assumptions concerning the selection process into actual treatment assignment, they have the disadvantage of never being able to exclude zero from the bounds. Thus, the sign of the ATE cannot be learned. To tighten the bounds on ATE, without going so far as to assume exogenous selection, we assess the identifying power of three monotonicity assumptions which impose di¤erent restrictions on the relationships between food insecurity, child health outcomes, and the available data."}, {"section_title": "Monotone Treatment Selection", "text": "The Monotone Treatment Selection (MTS) assumption places some structure on the relationship between potential outcomes and treatment assignment (Manski and Pepper 2000) . Speci…cally, the MTS assump- \nsince H( ) = 1 represents a worse health outcome (i.e., obese or overweight). Imposing MTS, the bounds on ATE are given by\nwhere\n= 0 in the absence of measurement error.\nWith arbitrary errors, the upper bound of the ATE is given by the upper bound of the ATE under exogenous selection with arbitrary errors in equation (11) . The lower bound is given by the lower bound under no selection assumptions with arbitrary errors in equation (16) . Under the assumption of no false positives, the bounds are obtained from the same models, however using the corresponding no false positive assumption (i.e., Equations (13) and (18)). "}, {"section_title": "Monotone Instrumental Variable", "text": "where v is the MIV and u 1 < u < u 2 . In other words, lower values of v are associated with worse potential outcomes (again, since H( ) = 1 represents a worse health outcome). Here, we use household SES as the MIV. A lengthy literature documents the positive income-health gradient for children (e.g., Case et al."}, {"section_title": "2002).", "text": "To proceed, we combine the MIV and MTS (with and without measurement error) assumptions. Let U B(u) and LB(u) denote the upper and lower bounds of the individual components of the ATE obtained under a set of MTS and measurement error assumptions evaluated conditional on v = u. As a result, the joint MTS-MIV assumption implies"}, {"section_title": "See Proposition 1 in Manski and Pepper (2000).", "text": "To calculate these bounds in practice, the sample is divided into four SES cells. Weighted averages of the estimates of the U B and LB across the four cells yield joint MTS-MIV bounds on the individual components of the ATE. Final bounds for the ATE are then computed using (9) "}, {"section_title": "Monotone Treatment Response", "text": "The …nal monotonicity assumption is the Monotone Treatment Response (MTR) assumption. This assumption relates to the expected relationship between the treatment and outcome (Manski 1997) . Speci…cally, the MTR assumption posits that food insecurity cannot improve health outcomes. Formally, this implies that H(1) H(0); i.e., the probability of a bad health outcome must be at least as high under food insecurity as food security. To be clear, the MTS assumption states that food insecure children are comparatively more disadvantaged on average than their food secure counterparts, so they have worse outcomes on average independent of food insecurity. The MTR assumption, on the other hand, states that becoming food insecure would not improve a child's weight status. While we assess the information content of this assumption, it is not obvious that the assumption is true. While one would expect food insecurity to adversely impact long-run general health, the impact on weight status is unclear due to opposing forces (Gundersen and Kreider 2009 ). On the one hand, food insecurity limits food intake which should reduce child weight, at least in the short-run. On the other hand, food insecurity may alter the nutritional content of the food consumed, encourage overeating when food is available, and contribute to metabolic changes in children, thereby contributing to weight gain in the long-run. That said, the practical implication of the MTR assumption in the current context is that it tightens the bounds on the ATE by excluding all negative values since equation (8) must be non-negative."}, {"section_title": "Results", "text": ""}, {"section_title": "Baseline", "text": "The baseline set of empirical results are presented in Figures 1-4 and Table 1 -4. In all cases, the treatment is very low food security and the control group includes all other children (i.e., children from food secure, marginally food secure, and low food secure households). Turning to the results, several …ndings stand out. First, in all four tables, the ATE is positive, but not statistically signi…cant, under the assumptions of exogenous selection and no measurement error. The lack of statistical signi…cance is not surprising given the small number of children experiencing very low food security. In the ECLS-K, very low food security during kindergarten is associated with a 3.1% (4.1%) increase in the probability of a child being obese (overweight) in …fth grade. In the ECLS-B, very low food security at nine months of age is associated with a 6.1% (6.6%) increase in the probability of a child being obese (overweight) at approximately age …ve. Given the di¤erence in observed characteristics between children in very low food secure households and all other children, this positive association is not surprising.\nSecond, the impact of misreporting is profound. If even one percent of the sample misreports their food security status, the sign of the ATE cannot be determined even under exogenous selection. Given prior data on misreporting in other contexts (e.g., Bound et al. 2001) , combined with the sensitive nature of the food security questionnaire, this is a stark result. Third, without imposing any assumptions concerning the selection process, the bounds are of width one and necessarily include zero as discussed above under the assumption of no measurement error. Nonetheless, the bounds are useful in excluding possible values of the ATE. For instance, Table 1 reveals bounds on the ATE for obesity using the ECLS-K of [ 0:251; 0:749]. Fourth, the monotonicity assumptions are quite powerful in terms of tightening the bounds. MTS results in signi…cant shrinkage of the upper bounds; MIV further reduces the upper bounds. MTR raises the lower bounds quite substantially, but in an obvious way (it simply assumes away negative values for the ATE). That said, even in the absence of measurement error, the point estimates include zero in all cases except one. In Table 1 , the joint MTS-MIV bounds are [ 0:252; 0:018]; the Imbens-Manski (2004) con…dence intervals, however, include zero. Nonetheless, this is suggestive of a negative, long-run e¤ect of very low food security on child obesity. This has important policy implications. While certainly no one would advocate inducing food insecurity to combat the obesity epidemic, the results suggest that there exists some tension in simultaneously combating hunger and obesity.\nFinally, it is worth noting that even upon invoking the various monotonicity assumptions, even small rates of misreporting signi…cantly widen the bounds. However, in combination with the monotonicity assumptions, the assumption of no false positives has signi…cant identifying power. For example, in Tables   1 and 2 , the upper bound under MTS alone attains its maximum possible value of unity when Q = 0:02 under arbitrary errors; this occurs at Q = 0:05 in Tables 3 and 4 under arbitrary errors. However, the upper bound, while still high, never exceeds 0.75 under MTS and the assumption of no false positives.\nIn summary, we …nd that the ATE of very low food security in kindergarten (relative to not very low security) has a negative causal e¤ect on obesity in …fth grade under the minimal assumptions of MTS-MIV only when we assume food security is reported without error. However, it is not possible to sign long-run relationship between very low food security in kindergarten and child overweight status in the …fth grade, nor very low food security at nine months of age on child obesity or overweight status at …ve years of age, with or without measurement error in self-reported household food security status. Moreover, our results illustrate the di¢ culty in not only narrowing the range of plausible values for the ATE, but even estimating its sign, in the absence of strong assumptions regarding selection and the lack of measurement error."}, {"section_title": "Additional Analyses", "text": "We undertake several additional analyses to see what can be learned under the set of assumptions considered here when we alter the parameter being bounded. As stated previously, in the baseline analyses we estimate bounds for the ATE of being very low food secure relative to not being very low food secure. Thus, the control consists of any level of food security in the initial period except very low food secure. As a result, being low food secure or marginally food secure, in addition to food secure, comprise the control. Our …rst supplemental analysis maintains the same treatment group -children in very low food secure householdsbut restricts the control to only food secure children. Our second supplemental analysis alters the treatment group as well as the control group. Here, we …rst de…ne the treatment as being low or very low food secure, retaining marginally food secure and food secure as the control, and second de…ne the treatment as being marginally, low, or very low food secure, retaining only food secure as the control. Our …nal supplemental analysis de…nes the treatment as low or very low food secure, but includes only food secure as the control."}, {"section_title": "Alternative Control", "text": "Bounds for the ATE of being very low food secure relative to food secure are presented in Figures 5-8 and Tables 5-8 . These …gures and tables are analogous to those in Figures 1-4 and Tables 1-4. The only di¤erence is that now the control group excludes children in low and marginally food secure households.\nBecause of the greater disparity between the treatment and control groups in terms of the provision of food, one might expect a more stark causal e¤ect of the treatment. 9 Turning to the results, many of the …ndings from the baseline results continue to hold. Thus, in the interest of brevity, we focus on the one main di¤erence. In the baseline case, the MTS-MIV bounds under 9 It is important to remember that the causal e¤ect of a treatment is only de…ned with respect to a speci…c control. As the control di¤ers from that used in the baseline analysis, the parameter being estimated is di¤erent. In the baseline analysis we are bounding the ATE of being very low food secure relative to being not very low food secure. Here, we are bounding the ATE of being very low food secure relative to being food secure.\nthe assumption of no measurement error exclude zero -indicating a negative causal e¤ect on averageonly when using the ECLS-K to assess obesity status. However, when de…ning the control as food secure, the point estimates for the bounds exclude zero not only in this case ( Figure 5 and Table 5 ), but also when assessing overweight status in the ECLS-K ( Figure 6 and Table 6 ) and ECLS-B (Figure 8 and Table 8 ).\nWith the caveat in mind that the Imbens-Manski (2004) con…dence intervals include zero, this continues to provide a strong indication of a negative, long-run e¤ect of very low food security on child weight status."}, {"section_title": "Alternative Treatment", "text": "Our next analyses assess the causal e¤ect of less extreme forms of food insecurity. First, we bound the ATE of being low or very low food secure relative to being marginally food secure or food secure. These results are presented in Panel I of Tables A4-A7 in the Appendix. 10 Second, we bound the ATE of being marginally, low, or very low food secure relative to being food secure. These results are presented in Panel   II of Tables A4-A7 .\nIt continues to be the case that results are very similar to the baseline results. Thus, we focus on only a few salient …ndings. First, while the associations between the two treatments and weight status under exogenous selection, assuming no measurement error, continue to be positive when using the ECLS-K, the estimate is also statistically signi…cant in Panel II of Table A4 . The associations between the two treatments and weight status under exogenous and no measurement error are very close to zero when using the ECLS-B and, in fact, become negative for both treatments when assessing overweight status (Table   A7 ). Thus, while perhaps not statistically di¤erent, there is some evidence that the long-run association between low and marginal food security is closer to zero during the years prior to kindergarten than during early primary school.\nSecond, the MTS-MIV bounds exclude zero in many cases when no misreporting is assumed. Speci…-cally, we obtain bounds for the ATE of low or very low food security (relative to marginally food secure Table   A4 ) and ECLS-B (Panel I, Table A6 ), respectively. The bounds for this treatment also exclude zero when assessing overweight status in the ECLS-B (Panel I, Table A7 ). Finally, bounds for the ATE of marginally, low, or very low food security (relative to food secure) on obesity and overweight status also exclude zero when assessing either obesity (Panel II, Table A6 ) or overweight (Panel II, Table A7 ) status in the ECLS-B.\nFinally, when assessing overweight status in the ECLS-B, MTS alone, along with the assumption of no measurement error, is su¢ cient to exclude zero from the bounds for both treatments (Panels I and II, Table A7 ).\n1 0 To conserve space, we omit the corresponding …gures.\nOur …nal analysis retains the same treatment from Panel I of Tables A4-A7, namely being either low or very low food secure, but now the control is food secure (rather than marginally food secure or food secure). As in the prior section, this introduces a greater wedge between the treatment and control. The results are presented in Table A8 for the ECLS-K and Table A9 for Table A9 ). Second, the bounds continue to exclude zero for overweight status even when some measurement error is allowed (Q = 0:01) under either arbitrary errors or no false positives. However, now the con…dence intervals fail to exclude zero. Finally, MTS alone is su¢ cient to exclude zero when assessing overweight status assuming no measurement error."}, {"section_title": "Discussion", "text": "Accounting for adverse selection into various degrees of food insecurity and assuming self-reports of food security status are accurate, the results provide strong, albeit often not statistically signi…cant, evidence of a long-run, negative causal e¤ect of food insecurity on child obesity and overweight status. The fact that the point estimates of the bounds are often able to exclude zero highlights what can be learned under minimal monotonicity assumptions. More importantly, the results suggest that the twin public health goals of ameliorating hunger and reducing childhood obesity may be somewhat at odds, at least in the near term. Finally, the results point to the substantial loss of information from relatively little measurement error. Researchers in this area (and others) should heed this warning. It is not su¢ cient to overlook measurement error under the rationale that it is a relatively 'minor' problem. With even one percent of the sample misreporting their food security status, the width of the bounds can increase markedly.\nReturning to the long-run, negative causal e¤ect often suggested by the analysis under the assumption of no measurement error, further discussion is warranted. In particular, it is noteworthy that the study most similar to this by Gundersen and Kreider (2009) obtain bounds providing some evidence that food security reduces the probability of children being overweight. As stated previously, there are several di¤erences between their study and ours. First, the de…nitions of the treatment, control, and outcome in their primary analysis correspond most closely to Panel I of Table A5 in the appendix. Speci…cally, they bound the ATE of being marginally food secure or food secure relative to being low or very low food secure on contemporaneous overweight status. Second, the age ranges of the samples may di¤er; it is not reported in their study. Third, and most importantly, the bounds in Gundersen and Kreider (2009) typically exclude zero only when they impose MTR in addition to MTS-MIV. As stated above (and in Gundersen and Kreider (2009) ), the validity of the MTR assumption when analyzing weight outcomes is highly questionable. It is noteworthy that when they impose MTS-MIV only, along with the assumption of no measurement error, they obtain bounds for the ATE of low food security on contemporaneous "}, {"section_title": "Conclusion", "text": "The existing literature on the long-run relationship between food security status and child obesity and overweight status explores only the association between these two major public health concerns instead of the causal relationship. This is because existing studies do not account for two important identi…cation issues: non-random selection and misreporting in household surveys. Here, we revisit the long-run impact of food security on obesity and overweight status, addressing both identi…cation issues in a single partial identi…cation framework proposed in Kreider et al. (2012) . This nonparametric approach is especially suitable for this analysis given that obtaining consistent point estimates of an endogenous and mismeasured binary variable is not trivial (Black et al. 2000) . Moreover, our study complements prior work on bounding the short-run causal e¤ect of food security on child weight in Gundersen and Kreider (2009).\nIn the presence of both misreporting of and adverse selection into food insecurity status, the average treatment e¤ect is not nonparametrically identi…ed. To circumvent this, we impose several weak assumptions concerning both the selection and measurement error processes to bound the long-run causal impact of food security. Using data from the ECLS-K and ECLS-B, we assess the identifying power of these assumptions to determine what can be learned about the average treatment e¤ect. While there are a host of interesting …ndings, two main results arise. First, under the assumption of no measurement error, there exists some evidence that food insecurity has a long-run, negative causal e¤ect on child obesity and overweight status. Second, measurement error is extremely consequential. If only one percent of the households misreport their food insecurity status, we …nd only one situation where it is possible to sign the ATE given the selection and measurement error assumptions imposed."}, {"section_title": "Appendix Table A1. Core Food Security Module (CFSM)", "text": "Note: Responses in bold are \"affirmative\". 9. \"The children were not eating enough because we just couldn't afford enough food\". Was that often, sometimes or never true for you in the last 12 months? Sample excludes households in the highest quintile of SES. Data are from from the kindergarten wave except for obese and overweight which are from the spring fifth grade wave. Omitted category for family structure is 'other or missing', and for mother's education is 'missing'. Columns 5, 7, and 9 report the mean difference between food insecure (F1) households (according to the definition indicated) and food secure (FS) households; p-values obtained using t-test. Sample excludes households in the highest quintile of SES. Data are from from the 9-month wave except for obese and overweight which are from wave 4 (approximately five years old). Omitted category for family structure is 'other or missing', and for mother's education is 'missing'. Columns 5, 7, and 9 report the mean difference between food insecure (F1) households (according to the definition indicated) and food secure (FS) households; p-values obtained using t-test. "}, {"section_title": "(F1 -FS) (F1 -FS) (F1 -FS)", "text": ""}, {"section_title": "Marginally Food Secure Low Food Security Very Low Food Security", "text": ""}, {"section_title": "Marginally Food Secure Low Food Security Very Low Food Security (F1 -FS) (F1 -FS) (F1 -FS)", "text": ""}, {"section_title": "No Assumption on Selection MTS", "text": "Notes: p.e. = point estimates; CI = confidence Interval; AE = arbitrary errors; FP = false positives. CI around ATE are calculated using methods from Imbens-Manski (2004) with 250 pseudosamples. Number of observations = 6470 (rounded to nearest 10 per NCES restricted data regulations). "}, {"section_title": "MTS & MIV MTS & MTR Exogenous Selection", "text": "\nNo Assumption on Selection MTS "}, {"section_title": "Exogenous Selection No Assumption on Selection", "text": "Notes: p.e. = point estimates; CI = confidence Interval; AE = arbitrary errors; FP = false positives. CI around ATE are calculated using methods from Imbens-Manski (2004) with 250 pseudosamples. Number of observations = 4100 (rounded to nearest 50 per NCES restricted data regulations). "}, {"section_title": "MTS MTS & MIV MTS & MTR", "text": ""}, {"section_title": "Exogenous Selection No Assumption on Selection MTS MTS & MIV MTS & MTR", "text": "Notes: Control group includes only food secure households. p.e. = point estimates; CI = confidence Interval; AE = arbitrary errors; FP = false positives. CI around ATE are calculated using methods from Imbens-Manski (2004) with 250 pseudosamples. Number of observations = 5870 (rounded to nearest 10 per NCES restricted data regulations). "}, {"section_title": "MTS & MIV MTS & MTR", "text": "-"}]