[{"section_title": "Abstract", "text": "With recent advances in our understanding of the continuous pathophysiological changes that begin many years prior to symptom onset, it is now apparent that Alzheimer's disease cannot be adequately described by discrete clinical stages, but should also incorporate the continuum of biological changes that precede and underlie the clinical representation of the disease. By jointly considering longitudinal changes of all available biomarkers and clinical assessments, variation within individuals can be integrated into a single continuous measure of disease progression and used to identify the earliest pathophysiological changes. Disease time, a measure of disease severity, was estimated using a Bayesian latent time joint mixed-effects model applied to an array of imaging, biomarker and neuropsychological data. Trajectories of regional amyloid b and tau PET uptake were estimated as a function of disease time. Regions with early signs of elevated amyloid b uptake were used to form an early, focal composite and compared to a commonly used global composite, in a separate validation sample. Disease time was estimated in 279 participants (183 cognitively unimpaired individuals, 61 mild cognitive impairment and 35 Alzheimer's disease dementia patients) with available amyloid b and tau PET data. Amyloid b PET uptake levels in the posterior cingulate and precuneus start high and immediately increase with small increases of disease time. Early elevation in tau PET uptake was found in the inferior temporal lobe, amygdala, banks of the superior temporal sulcus, entorhinal cortex, middle temporal lobe, inferior parietal lobe and the fusiform gyrus. In a separate validation sample of 188 cognitively unimpaired individuals, the early, focal amyloid b PET composite showed a 120% increase in the accumulation rate of amyloid b compared to the global composite (P < 0.001), resulting in a 60% increase in the power to detect a treatment effect in a primary prevention trial design. Ordering participants on a continuous disease time scale facilitates the inspection of the earliest signs of amyloid b and tau pathology. To detect early changes in amyloid b pathology, focusing on the earliest sites of amyloid b accumulation results in more powerful and efficient study designs in early Alzheimer's disease. Targeted composites could be used to re-examine the thresholds for amyloid b-related study inclusion, especially as the field shifts to focus on primary and secondary prevention. Clinical trials of anti-amyloid b treatments may benefit from the use of focal composites when estimating drug effects on amyloid b and tau changes in populations with minimal amyloid b and tau pathology and limited expected short-term accumulation."}, {"section_title": "Introduction", "text": "Traditionally, Alzheimer's disease (AD) has been primarily described in terms of discrete clinical stages. However, with recent advances in our understanding of the continuous pathophysiological changes that begin many years prior to symptom onset, it is now apparent that AD cannot be adequately described by clinical stages, but should also incorporate the continuum of biological changes that precede and underlie the clinical representation of the disease (Aisen et al., 2017) . Conceptualizing the progression of AD as a continuum of overlapping pathological and subsequent clinical changes will facilitate a realistic examination of the time course of the disease. Clarifying this time course, from initial biomarker changes to severe functional impairment, is essential for accurate early diagnosis, clinical trial enrollment, disease monitoring and eventual disease prevention and management.\nThe likelihood of successfully treating AD may be highest in the earliest stages of the disease, requiring a detailed understanding of incipient biomarker changes.\nConsiderable evidence confirms the accumulation of fibrillar amyloid b (Ab) and aggregates of hyperphosphorylated tau, the pathognomonic lesions, as early AD biomarker changes. In this study, we focus on the early development of Ab and tau pathology in order to provide finer detail about the temporal course of early neuropathological changes in AD. By jointly considering longitudinal changes of an array of neuropsychological, imaging and biomarker data, the variation within individuals and the associations among multiple outcomes are simultaneously integrated into a single continuous measure of disease progression (Donohue et al., 2014; Li et al., 2017 Li et al., , 2018 . Using estimates of each participant's location on the disease continuum, or 'disease time', we sought to estimate a temporal ordering of spatial changes of Ab and tau lesions throughout the brain. After identifying the earliest regions to demonstrate pathological changes, we tested the performance of these early regions in hypothetical primary and secondary prevention clinical trial settings in a separate validation sample."}, {"section_title": "Graphical Abstract", "text": ""}, {"section_title": "Materials and methods", "text": ""}, {"section_title": "Participants", "text": "Data were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (adni.loni.usc.edu, www.adni-info.org) . This study was approved by the Institutional Review Boards of all of the participating institutions. Informed written consent was obtained from all participants at each site. The population in this study included ADNI participants with measurements of both Ab and tau PET. All available participants who were cognitively unimpaired (CU), Abþ mild cognitive impairment (MCI) or Abþ AD dementia at baseline were included, where Abþ was defined using a previously established threshold (SUVR ¼ 1.10) . Impaired AbÀ participants were excluded due to impairment ostensibly unrelated to AD.\nA separate validation sample included CU ADNI participants with measurements of Ab who were not included in the first part of the analysis because of missing tau PET information."}, {"section_title": "PET imaging and CSF Ab", "text": "Methods to acquire and process Ab (18F-florbetapir) PET image data were described previously (Landau et al., 2012) . Twenty Ab PET region of interests (ROIs) were analysed: the inferior, middle and superior temporal lobe; the precuneus, supramarginal gyrus, inferior and superior parietal lobe; the isthmus, posterior, caudal and rostral anterior cingulate; and the pars opercularis, pars triangularis, pars orbitalis, caudal and rostral middle frontal, medial and lateral orbitofrontal, frontal pole and superior frontal lobe.\nMethods to acquire and process tau (18F-flortaucipir) PET image data were described previously (Maass et al., 2017) . Thirty tau ROIs were analysed: the amygdala, entorhinal cortex, parahippocampus, fusiform, banks of the superior temporal sulcus (BSTS), transverse temporal lobe, temporal pole, and the inferior, middle and superior temporal lobe; the isthmus cingulate, precuneus, supramarginal gyrus, and the inferior and superior parietal lobe; the pars orbitalis, pars triangularis, pars opercularis, lateral and medial orbitofrontal, pre-and paracentral, rostral, caudal, middle and superior frontal lobe; and the cuneus, lingual, pericalcarine, and lateral occipital lobe. Full details of PET acquisition and analysis can be found at http://adni.loni.usc.edu/methods/.\nCSF samples were analysed for CSF Ab42 using the AlzBio3 assay (Fujirebio, Ghent, Belgium) on the xMAP Luminex platform and have been described previously (Olsson et al., 2005; Shaw et al., 2009) . CSF Ab <192 ng/L defined CSF Abþ."}, {"section_title": "Statistical analysis", "text": "Continuous disease time, an alternative to discrete diagnostic categories, as described and estimated previously (Donohue et al., 2014; Li et al., 2017 Li et al., , 2018 ) was used to model the spread of regional uptake in Ab and tau PET (not used in the estimation of disease time). Disease time is a measure of disease severity, estimated from a Bayesian latent time joint-mixed effects model (LTJMM). Briefly, for subject i (i ¼ 1, . . ., n), outcome k (k ¼ 1, . . ., p), at time t[ijk] (j ¼ 1, . . ., q ik ) the model is of the form:\nwhere y ijk are the observed outcome, x 0 t ijk ½ are vectors of predictors, b k are fixed effects, c k are the disease time slopes, t ijk ½ þ d i are the shifted disease times, a are random effects and e are multivariate Gaussian residuals. Jointly modeled outcomes included cognitive data (the 13-item Alzheimer's disease assessment scale, cognitive subscale, the mini-mental state exam, the Functional Activities Questionnaire, the Rey Auditory Visual Learning Test, the CDR Sum of Boxes and the Preclinical Alzheimer Cognitive Composite), CSF data (Ab, phosphorylated tau and total tau), MRI volumes (hippocampus, entorhinal cortex, fusiform, middle temporal gyrus, ventricles and whole-brain volume) and PET imaging of global amyloid burden and glucose metabolism in the brain. LTJMM provides estimates of disease severity while accounting for the dependency between different markers. Prior to modeling, outcomes are transformed to quantiles, then transformed again to Z-scores via the inverse Gaussian cumulative distribution function. See Li et al. (2018) for more detail.\nThe relationship between longitudinal uptake in PET ROIs and disease time was examined using mixed-effects models with random intercepts. Natural splines were used to capture departures from linearity with respect to disease time. Spline knots were placed at the median and boundaries of disease time, with the number of knots selected by Akaike information criterion. PET responses were covaried for age, sex and mean Ab PET uptake in the whole cerebellum for Ab ROIs and mean tau PET uptake in the inferior cerebellar grey matter for tau ROIs.\nWe used a positional variance diagram to depict the temporal ordering of the ROIs. For a specific point on the disease time axis, ROIs were ordered by PET uptake. The positional variance diagram shows the proportion of 500 bootstrap samples in which a particular ROI appears in a particular position in the central ordering. Positional variance was assessed 15, 10 and 5 years before the estimated time of AD dementia diagnosis.\nTo further inspect early development of Ab and tau pathology, changes in mean uptake with small increases in disease time (first derivatives of uptake curves) were plotted to show how the regional slopes of accumulation accelerate over disease time. Ab regions with high mean uptake early on the spectrum of disease time and continued increase with advances in disease time were evaluated further in the validation sample. Baseline and longitudinal change in a composite of regions with early uptake were compared to a commonly used global composite (comprising regions throughout the frontal, parietal and temporal lobes and cingulate gyrus; Landau et al., 2012) in a sample of CSF AbÀ CU participants, and separately, CSF Abþ CU participants. Baseline and accumulation rate differences between early and global estimates were tested using t-tests with bootstrap estimated standard errors.\nTo estimate power for Ab PET end-points in hypothetical primary and secondary prevention trials, mixedmodel estimates were used to calculate the power for 24-month clinical trials, assuming a range of sample sizes, a 100% slowing of Ab accumulation, a 12-month visit interval and a 30% dropout rate.\nAssociations between diagnosis and demographics were assessed using Wilcoxon rank-sum test for continuous variables and Fisher's Exact test for categorical variables. All analyses were done in R v3.5.1 (www.r-project.org)."}, {"section_title": "Data availability", "text": "All data are publicly available at http://adni.loni.usc.edu/."}, {"section_title": "Results", "text": ""}, {"section_title": "Cohort characteristics", "text": "One-hundred and eighty-three CU (102 AbÀ and 81 Abþ), 61 Abþ MCI (including 10 individuals who progressed from CU to MCI during follow-up) and 35 Abþ AD participants (including 28 MCI to AD progressors) were included in the analysis. Mean follow-up time was 4.0 years (SD ¼ 2.6). Seventy-seven participants had one Ab PET scan, 25 had two scans, 77 had three scans and 100 had four or more scans. Two-hundred and nineteen participants had one tau PET scan, 52 had two scans and 8 had three scans. Participants had a mean age of 72 years (55-90 years), 145 (52%) were female, they had a mean of 16.5 years of education (12-20) and 114 (42%) were APOE e4 carriers. Demographics are summarized in Table 1 ."}, {"section_title": "Disease time", "text": "Disease time was estimated for each individual (estimated previously in Li et al., 2018) . Disease time was centred on the average observed time of progression to an AD dementia diagnosis, making the measure interpretable at disease time ¼ 0. The average disease time was À10, ranging from À18 to 6. The distribution of disease time by diagnosis is shown in Fig. 1 and summarized in Table 1 . In 28 participants with an observed time of progression to AD, the correlation between estimated disease time and progression to AD was 0.74 (P < 0.001)."}, {"section_title": "Regional Ab and tau PET", "text": "Trajectories of all Ab and tau PET ROIs are plotted against disease time in Fig. 2 . Several patterns emerge, as described in more detail below. Several Ab PET regions follow a similar pattern of high initial elevation with respect to disease time and continued increase as disease time approaches the time of an AD diagnosis. A younger sample would be required to characterize the earliest changes in these regions. This pattern is most noticeable in the posterior cingulate and precuneus ( Fig. 2A and B ). High levels of uptake are also seen initially in the isthmus cingulate, inferior parietal and lateral orbitofrontal cortex, but increased more modestly. The main tau PET region to follow this pattern of a high initial level and a steep increase was the inferior temporal lobe. The entorhinal cortex also showed a steep increase in tau uptake, as well as the fusiform, middle temporal lobe and the inferior parietal lobe. The amygdala and the BSTS showed high initial tau uptake levels, but increased modestly. Spaghetti plots of uptake of several select ROIs are shown in Fig. 3 . To more closely examine how accumulation is accelerating over the course of disease time, we plotted the first derivatives of the uptake curves against disease time in Fig. 4 . These plots show the change in uptake over small advances in disease time. The posterior cingulate and isthmus cingulate show the highest initial rates of increase of Ab uptake with respect to disease time. However, the rate of isthmus cingulate increases minimally over time. A similar pattern is seen in the caudal anterior cingulate. Large rate increases are seen in the other regions, especially in the precuneus, middle temporal lobe and the lateral orbitofrontal cortex.\nInitial tau uptake slopes are steepest in the amygdala, BSTS and the inferior temporal lobe. However, the inferior temporal lobe quickly accelerates, while both the amygdala and BSTS begin to plateau. While the initial slope is more gradual in the entorhinal cortex, fusiform gyrus and middle temporal lobe, all start to accelerate, similar to the inferior temporal lobe."}, {"section_title": "Order", "text": "A positional variance diagram, depicting the order of all PET ROIs by uptake 10 years before an AD diagnosis (disease time ¼ À10), is shown in Fig. 5 . Ten years before an AD diagnosis, the Ab PET ROIs with the highest mean uptake were the posterior cingulate, isthmus cingulate, caudal anterior cingulate and the precuneus. The tau PET ROIs with the highest mean uptake were the amygdala, inferior temporal lobe, BSTS and the fusiform gyrus. The entorhinal cortex moved to the top half of the order by 5 years before an AD diagnosis due to the slope increase over the course of disease time; otherwise, the ordering of the ROIs was stable at 15 and 5 years before an AD diagnosis ( Supplementary Figs 1 and 2) . "}, {"section_title": "Early composite performance in the validation sample", "text": "To evaluate the performance of the regions selected by the LTJMM models, an outside validation sample consisting of 111 CSF AbÀ and 77 CSF Abþ CU participants was used. The average follow-up time of the validation sample was 2.7 years (2.8 in the AbÀ group and 2.5 in the Abþ group). Participants were 74 years old on average, 51% female, had an average of 16 years of education, and were 23% APOE e4þ.\nBased on early uptake patterns, a volume-weighted average of the posterior cingulate and the precuneus were used to form the early Ab PET composite. In AbÀ CU participants from the validation sample, there was significantly more Ab uptake at baseline in the early composite compared to the global composite (1.25 versus 1.19, SE ¼ 0.005, P < 0.001). In AbÀ CU, Ab uptake in the early composite accumulated at a rate of 0.006/year [95% confidence interval (CI): 0.003-0.09, P < 0.001), compared to 0.003/year in the global composite (95% CI: À0.0001 to 0.006, P ¼ 0.06). The accumulation rate in the early composite was more than double the rate (120% increase, P < 0.001) of the global composite, in the AbÀ CU participants.\nIn Abþ CU, there was significantly more uptake in the early composite at baseline compared to the global composite (1.65 versus 1.50, SE ¼ 0.01, P < 0.001). The accumulation rate in the early composite was 0.013/year (95% CI: 0.003, 0.023, P ¼ 0.01) and was not significantly different from the accumulation rate in the global composite, 0.012/year (95% CI: 0.003, 0.020, P ¼ 0.01). Plots of baseline and change estimates are shown in Fig. 6A -D."}, {"section_title": "Power calculations for primary and secondary prevention trials", "text": "To reach 80% power in a 24-month primary prevention trial of AbÀ CU participants to detect a slowing of Ab deposition, 233 subjects/arm would be required, using the early composite. Using the global composite with 233 subjects/arm would result in 50% power; for 80% power, 481 subjects/arm would be required.\nTo reach 80% power in a 24-month secondary prevention trial of Abþ CU participants to detect a slowing of Ab deposition, 110 subjects/arm would be required, using the early composite. Similarly, to reach 80% power using the global composite, 106 subjects/arm would be required. Plots of power by the required sample size for hypothetical treatment trials are shown in Fig. 6E and F."}, {"section_title": "Discussion and conclusions", "text": "As the details of early biomarker changes in AD emerge, early detection and diagnosis of disease may improve by considering disease progression on its natural continuum without relying on discrete stages with artificial boundaries. By integrating biomarker and clinical data to determine each individual's location on a pathological timeline, the earliest changes in disease progression can be accurately detected and examined. In Fig. 1 , the peaks of the disease time distributions align with clinical stages, although the overlap demonstrates the wide variation that is ignored when individuals are grouped discretely. As seen in Fig. 2 , Ab PET uptake levels in the posterior cingulate and precuneus start high and immediately increase with small advances in disease time, followed by multiple frontal lobe regions, especially the lateral orbitofrontal cortex, and then several parietal ROIs, with little crossing of trajectories. These regions align with multiple recent independent reports of early Ab accumulation consistently found in the posterior cingulate, precuneus and superior frontal lobe, as well as the orbitofrontal and inferior/middle temporal lobes (Villemagne et al., 2011; Vlassenko et Sojkova et al., 2013; Cho et al., 2016; Palmqvist et al., 2017 , Mattsson et al., 2019c .\nSimilarly, early elevation and increases in tau PET uptake were found in the inferior temporal lobe, amygdala, BSTS and fusiform gyrus, and also the entorhinal cortex, inferior parietal lobe, middle temporal lobe and the precuneus. Uptake in multiple medial temporal lobe ROIs starts slightly higher and accelerates early, followed by lateral temporal and parietal lobe ROIs (Figs 2 and 3) . These regions, demonstrating early elevated tau PET uptake, also coincide with several reports consistently finding elevated uptake primarily in the inferior temporal lobe, fusiform and entorhinal cortex, as well as the amygdala, parahippocampus and middle temporal lobe (Cho et al., 2016; Johnson et al., 2016; Schö ll et al., 2016; Vemuri et al., 2017; Schultz et al., 2018 , Mattsson et al., 2019b .\nThe order of both Ab and tau PET ROIs remains mostly stable at different cross-sections of the disease time scale, with the exception that uptake in the entorhinal cortex accelerates quickly across disease time and moves up in the order. Several ROIs show initially elevated uptake but increase modestly with advancing disease severity. This is the case for several anterior cingulate regions in terms of Ab uptake, including the caudal and rostral anterior cingulate. Similarly, several frontal regions, such as the lateral orbitofrontal cortex and the pars orbitalis/triangularis, show elevated tau uptake early, but do not increase at the same rate as either temporal or parietal regions, potentially due in part to the off-target binding.\nThe observed early pattern of uptake points to the posterior cingulate and precuneus as candidate ROIs for a targeted Ab composite. In the validation sample, the rate of Ab uptake in the early composite was more than twice the rate observed in the global composite, in the CSF AbÀ participants. By streamlining the commonly used global composite to include only the posterior cingulate and precuneus, the doubled rate of Ab uptake resulted in a 60% increase in the estimated power to detect a hypothetical treatment effect in a primary prevention clinical trial. In the CSF Abþ participants, there was no difference in the rate of Ab PET uptake, suggesting that the excluded regions from the early composite are now accumulating at a similar rate observed in the early composite. Such an early composite could be used to reexamine the thresholds for Ab-related study inclusion, especially as the field shifts to focus on secondary and primary prevention. Clinical trials of anti-Ab treatments may benefit from the use of an early Ab composite when estimating drug effects on Ab changes in populations with minimal Ab deposition and limited expected shortterm accumulation.\nSimilarly, an early tau composite comprising the inferior temporal lobe, entorhinal cortex, amygdala, BSTS, middle temporal lobe, inferior parietal lobe and the fusiform gyrus could aid in detecting the earliest tau changes. Additional longitudinal tau PET data will be required to provide further evidence for such a composite and whether it can be optimized to correlate with early Ab changes, neurodegeneration and the onset of cognitive symptoms.\nThis study is limited by its follow-up on participants younger than 65 years of age. Precise estimates of early change will require additional longitudinal follow-up focused on a younger cohort. Incorporation of emerging biomarkers such as blood-based measures of amyloid dysregulation ( and neurodegeneration (Mattsson et al., 2019a) into this effort will further clarify the course of AD.\nOrdering participants on a continuous disease time scale, jointly estimated from biomarker, imaging and cognitive data, facilitates the inspection of the earliest signs of Ab and tau pathology in the healthiest participants, informing conceptualization of the pathophysiologic processes underlying the disease. Identifying the sequence of brain regions where deposition is initiated will aid in the design of Ab and tau composites optimized to detect and monitor disease progression facilitating the design of feasible prevention studies in AD."}, {"section_title": "Supplementary material", "text": "Supplementary material is available at Brain Communications online."}]