[{"section_title": "Abstract", "text": "This paper uses the Schools and Staffing Survey to examine the determinants of teacher salaries in the U.S. using a spatial econometric framework. These determinants include teacher salaries in nearby districts, union activity in the district, union activity in neighboring districts, and other school district characteristics. The results confirm that salaries for both experienced and beginning teachers are positively affected by salaries in nearby districts. Investigations of the determinants of teacher salaries that ignore this spatial relationship are likely to be mis-specified.\nIncluding the effects of union activity in neighboring districts, the study also finds that union activity increases salaries for experienced teachers by as much as 18-28 percent but increases salaries for beginning teachers by a considerably smaller amount. JEL Classification: J45; J50."}, {"section_title": "Introduction", "text": "Teacher pay is an issue that has received much attention from researchers, politicians, and the general public. Teacher pay is important for several reasons. For one, state and local governments spend a large portion of their budgets on education. For the 2005-06 school year, public school districts in the U.S. had current expenditures per pupil of $9,138, with more than 60 percent of current expenditures going toward teacher salaries and benefits (U.S. Census Bureau 2006a). Teacher pay is also important because of the sheer number of public school teachers in the U.S. In 2006, full-time equivalent employment of elementary and secondary teachers by state and local governments was more than 4.6 million, making teachers by far the largest group of state and local government employees (U.S. Census Bureau 2006b ). Teacher pay is also likely to affect the ability of school districts to recruit and retain quality teachers as suggested by a sizable literature in education finance (e.g. Murnane and Olsen 1989, 1990; Figlio 1997 Figlio , 2002 Clotfelter et al. 2008 ). This paper uses a spatial econometric framework to examine the determinants of teacher salaries in the U.S. These include teacher salaries in nearby districts, union activity in the district, union activity in neighboring districts, and other school district characteristics. A large literature has examined the determinants of teacher salaries, with many such studies especially interested in the effects of unions. These studies generally find that unions increase teacher salaries. Only a handful of these studies, however, account for the possible effects of teacher salaries in nearby districts. Because teachers can leave low-paying districts for higher-paying districts nearby, teacher salaries are very likely to be positively affected by teacher salaries in nearby districts.\nThe few studies that examine the effects of teacher salaries in nearby districts provide analysis of individual states. Important insights, however, may be missed by investigating only school districts from a single state. To my knowledge, this paper is the first to examine teacher salaries in a spatial econometric framework for the 48 contiguous U.S. states. This paper also devotes considerable attention to the effect of unions on teacher salaries and utilizes several different measures of union activity. In particular, this paper differentiates between the effects of union activity in the district and union activity in the state."}, {"section_title": "Previous Literature and Theoretical Framework", "text": "Numerous research studies investigate the determinants of teacher salaries. Many of these focus specifically on how teacher unions affect teacher salaries. Lipsky (1982) , Ehrenberg and Schwarz (1986) , and Freeman (1986) provide early reviews of the literature. Theory suggests that the effect of unions on the level and structure of teacher salaries should be determined by union goals and bargaining power. A number of models have emerged in attempts to explain union goals (Hirsch and Addison 1986; Kaufman 2002) . For example, union leaders have been assumed to maximize the total wage bill, the utility of a representative union member, or the utility of the median union member. Furthermore, the goals of union leaders may often differ from the goals of union members (Pencavel 1991; Booth 1995) . Union leaders may be first and foremost concerned with the survival and growth of the union instead of member well-being. Bargaining power derives from numerous factors, including state collective bargaining laws, the extent of organizing, political support, and financial ability to pay.\nPrevious empirical studies typically regress the log of average salaries on union activity measures and other characteristics of the school district and local labor market. Results vary considerably across studies in part due to the measures of teacher salaries and union activity that are used, differences across states, and differences over time. A few studies, such as Lovenheim (2009), find little to no effect of union activity on teacher salaries, but most recent studies find at least a modest positive effect. Hoxby's (1996) finding of a roughly five percent effect of collective bargaining representation on average teacher salaries is fairly representative of most studies. Still, at least a few studies find union effects as large as 20 percent of wages (e.g. Baugh and Stone 1982; Zwerling and Thomason 1995) .\nA few studies also recognize that teacher unions might differentially affect the salaries of teachers within a given district. In other words, unions not only affect the average level of salaries but also the distribution of salaries within a district. Holmes (1976) finds that unions increase both the return to experience and the return to education within a district. Similarly, Delaney (1985) finds that collective bargaining increases the salary differential between experienced teachers and inexperienced teachers. Zwerling and Thomason (1995) and Lentz (1998) also find that while unions have a positive and significant effect on the salaries of teachers earning the highest salary in a district, unions have a small (though still positive) and statistically insignificant effect on the lowest salary in a district. Babcock and Engberg (1999) and Ballou and Podgursky (2002) also suggest that the average levels of teaching experience and education in a district affect the returns to experience and education as well.\nThe effect of teacher unions on intra-district salary differentials is often explained by appealing to a median voter model. If union preferences are determined by a simple-majority vote, individual preferences are single-peaked, and there is only one outcome to be decided, the preferences of the median voter will be decisive. Virtually all public school districts, including those without collective bargaining, pay teachers according to a salary schedule that maps salary to teaching experience and education. In the absence of union pressures, district administrators may dictate a salary schedule that is more appealing to marginal teachers than median teachers, with the marginal teachers likely being those with little or no teaching experience and without advanced degrees. However, the union's preferred salary structure may be heavily influenced by the preferences and hence characteristics (i.e. experience and education) of the median teacher in the district. According to data tabulated from the 1999-2000 Schools and Staffing Survey (SASS) Teacher Survey, about half of public school teachers in the U.S. had advanced degrees and the average experience was about fifteen years.\nBecause there are multiple dimensions to union contracts (returns to experience, returns to education, the level of fringe benefits, etc.), the median voter model may not adequately explain the salary determination process within districts. Having multiple choice variables means that there is likely no single median voter whose preferences are decisive. Instead, it may be useful to more generally view union preferences as resulting from a majority coalition of teachers. Union cohesion may even require that there be a super-majority coalition. Even with multiple choices to be made, though, it still seems likely that teachers with median levels of experience and education will be important members of the majority coalition and will push for a salary structure that benefits them. Teachers with little or no experience are the ones most likely to be left out of the majority coalition for several reasons. First, inexperienced teachers may be less likely to be members of the union and less likely to be active in the union when they are members. Additionally, union contracts are often negotiated months or even years in advance of the school year for which they apply. As a result, the very newest teachers never had a vote on how the salary schedule would be structured. School district administrators, however, are likely to be sensitive to market conditions for new school teachers since this is when teachers are most mobile. Thus, we might expect unionized school districts with strong union bargaining power to respond to the preferences of experienced (median voter) teachers, whereas nonunion districts or union districts where bargaining power is weak may be more responsive to market conditions for new teachers.\nEven if the median voter model is not perfectly applicable, it is reasonable to expect that unions might increase the salary differential between beginning and experienced teachers.\nUnions might also increase the salary differential between teachers with and without advanced degrees. This shifting in the salary structure may even result in less experienced teachers having lower salaries than would be the case in the absence of union negotiations. Chambers (1977) , Delaney (1985) and Zwerling and Thomason (1995) suggest that teachers salaries in a district are positively affected by union activity in nearby districts. In fact, all three studies suggest that the union spillover effect on wages is larger than the direct effect on wages of union activity in the district. This paper often uses the term \"union spillovers\" to refer to the effects that union activity in nearby districts have on teacher salaries in a given district.\nUnion spillovers are likely to result from a number of sources including pattern bargaining, union threat effects, and the political influence of unions on state and local policymakers.\nMore recent studies by Wagner and Porter (2000) , Greenbaum (2002) , Babcock, Engberg and Greenbaum (2005) , and Millimet and Rangaprasad (2007) find using spatial econometric methods that teacher salaries in a district are also positively influenced by teacher salaries in nearby districts.\n1 In this paper, I often use the term \"wage spillovers\" to refer to the effects that teacher salaries in nearby districts have on teacher salaries in a given district. These previous studies consistently find evidence of positive wage spillovers, at least in the states considered. Unions are also likely to affect school districts in ways other than increasing teacher salaries. For one, unions are likely to affect the level of fringe benefits that teachers receive as part of their compensation package. Unions are likely to work toward better health insurance benefits, better pension benefits, and greater job security for the teachers they represent. Unions may also affect other school district characteristics such as the student-teacher ratio and the level and composition of non-instructional expenditures. Perhaps most importantly, the overall influence of unions may affect the amount that students learn through altering inputs into the production of education and by empowering teachers. The current paper, however, focuses on the effect of unions on the salaries that teachers are paid. Additional effects that unions might have on school districts are beyond the scope of this paper."}, {"section_title": "Empirical Framework", "text": "Most previous studies of the determinants of teacher salaries do not account for the effect of teacher salaries in nearby districts. The usual estimation equation in these studies is given by: (Anselin 1988) . A second concern is that there may be spatial correlation in the error term, say from spatially correlated unobservable characteristics or spatially correlated measurement error in explanatory variables (Kalenkoski and Lacombe 2008) . Failing to account for spatial correlation in the error term may result in standard errors that are inconsistently estimated, especially for the union activity measures employed in this paper. While a spatially correlated dependent variable and a spatially correlated error term are similar, there are important differences. Spatial correlation in the dependent variable suggests that districts are directly responding to each other either through competition or attempts to maintain comparability.\nSpatial correlation in the error term is more indirect and results from nearby districts responding similarly to common nearby forces such as state laws.\nThe spatial model in this paper can be represented by:\n, where and are weighting matrices that specify the structure of the spatial correlation for the dependent variable and the error term, and are spatial autocorrelation coefficients for the dependent variable and the error term, and is a mean zero error term that is i.i.d. across observations. Some spatial econometric studies only model spatial correlation in the dependent variable (by assuming that 0) or in the error term (by assuming that 0).\nAfter conducting numerous spatial econometric tests suggested by Anselin et al. (1996) , it was concluded that it was appropriate to account for spatial correlation in both the dependent variable and in the error term. A number of studies also use the same weight matrix for and , but this can lead to identification issues.\nDetermining who the relevant neighbors are and how to weight them are important issues in spatial econometric studies. Most studies specify spatial weight matrices based on geographic proximity, but other concepts of \"nearness\" are also possible. For example, Gerwin (1973) reports that the city of Milwaukee was more concerned with teacher salaries in other large urban school districts than in its suburbs. Thus, one might consider weighting districts by similarity in enrollment levels. The current paper, however, follows the bulk of the previous literature and specifies based on the distance between school districts. For row i of the matrix, districts that are more than 50 miles away from i are given zero weight. In other words districts are only considered neighbors if their centroids, i.e., geographic centers, are within 50 miles of each other. Districts within 50 miles of i are weighted based on their inverse distance to i, so that nearer districts are given more weight than districts further away. Several additional weight matrices were also explored for such as altering the distance cutoff to 30 miles and 100 miles and equally weighting all districts within the cutoff. The 50 mile cutoff was ultimately chosen to keep the group of neighbors as tight as possible while minimizing the number of districts that must be excluded due to not having any neighbor in the sample. The inverse distance specification was chosen based on the assumption that salaries in a district are most strongly affected by salaries in other districts that are closest to it and the effect attenuates with distance.\nI also explored using an inverse-distance weight matrix with a 50 mile cutoff that also requires neighbors to be in the same state, but the interstate neighbors were ultimately retained because wage spillovers are likely to spread across state borders. The results are for the most part qualitatively robust across various weight matrices. The weight matrix for the spatial error term,\n, is specified such that for district i all other districts in the same state are treated as neighbors and given equal weight. This specification captures spatial error correlation due to common unobserved factors within states. Each weight matrix is also structured so that the elements in each row sum to unity and all diagonal elements are equal to zero so that a district cannot be its own neighbor. In other words, is a distance-weighted average of teacher salaries in nearby districts, and is an un-weighted average of the error terms of other districts in the same state.\nIt should be clear that teacher salaries in neighboring districts are hypothesized to be simultaneously determined. Salaries in district j affect salaries in district i, but salaries in district i also affect salaries in district j. Because of the simultaneity involved, using Ordinary Least Squares (OLS) to estimate the spatial model is inappropriate. Instead, instrumental variable methods are used. More specifically, the present paper estimates the spatial models by the Generalized Method of Moments (GMM) estimator developed by Kelejian and Prucha (1998) using the Spatial Econometrics Toolbox for MATLAB developed by James LeSage and described in LeSage (1999) . The GMM estimator instruments for using and as instruments. In other words, the estimator instruments for salaries in nearby districts using the distance-weighted averages of the other explanatory variables in nearby districts along with the distance-weighted averages of their neighbors' neighbors' characteristics. Kelejian and Prucha (1998) outline the conditions under which the GMM estimator provides consistent estimates."}, {"section_title": "Data", "text": "The primary data used in this analysis come from the school district survey of the 1999-"}, {"section_title": "Schools and Staffing Survey (SASS) conducted by the National Center for Education", "text": "Statistics (NCES) and completed by school district administrators. Unfortunately, there may be potential drawbacks to using cross-sectional data because wage spillovers might not always be contemporaneous. Unions and district administrators often reference contracts negotiated in other districts in prior years and contracts often last for multiple years (Babcock et al. 2005) .\nInformation on when a contract was agreed to might provide additional insights about the nature of wage spillovers, but unfortunately the SASS does not collect this information. Still, there are important insights from the cross-sectional analysis in this paper. Additional data for this study are obtained from the NCES Common Core of Data (CCD), the NCES School District Demographics System (SDDS), the Bureau of Labor Statistics (BLS) Local Area Unemployment Statistics (LAUS), and the NCES Comparable Wage Index (CWI) developed by Taylor and Fowler (2006) . The CWI measures the wages in the local labor market of occupations comparable to teaching based on microdata from the 2000 decennial Census and is available for nearly every district in the SASS. Table 1 provides summary statistics for the variables used in the study and documents the source for each.\nThe SASS sample originally includes more than 4600 school districts, or about one fourth of all districts in the U.S. However, a number of observations are lost due to missing data values and due to not having a neighbor in the sample within 50 miles. The final sample includes 4237 school districts in the 48 contiguous states. The fact that all districts are not included could pose problems for our spatial results since salaries for some of a district's neighbors are not observed.\nThe key assumption is that for each district the neighbors that are observed are not statistically different from the ones that are not observed. In other words, the included neighbors are representative of the excluded neighbors. If so, the GMM estimates will be consistent. The high degree of spatial correlation in both the dependent variable and the error term in the results below at least partially alleviates concerns that the included neighbors might not be representative of the excluded neighbors.\nTeacher salaries are investigated for both beginning teachers and experienced teachers and come from the 1999-2000 SASS. Beginning teacher salaries are measured by the base salary according to the district's salary schedule for teachers with no teaching experience and only a bachelor's degree (BA0). Salaries for experienced teachers are measured by the base salary on the district's salary schedule for teachers with 20 years of teaching experience and a master's degree related to the teaching field (MA20). 3 Individual teachers are sometimes paid amounts above that required by the salary schedule for special credentials or extra duties such as coaching a sports team. However, the salary measures in this paper are for the base salary in the district and do not include extra pay for special credentials or extra duties. Beginning teachers in the sample have a mean salary of $25,901 while the mean salary for experienced teachers is nearly twice that. There is also greater variation in the salaries of experienced teachers. The standard deviation in salaries for experienced teachers is nearly three times that of beginning teachers, and the coefficient of variation (CV) for experienced teachers of 0.232 is more than 1.5 times the CV for beginning teachers of 0.147.\nThe regression analysis below includes a number of important explanatory variables.\nThe effect of unions is given considerable emphasis in this paper and union activity is measured in three different ways. I first measure union activity by two mutually exclusive indicator variables for collective bargaining and the presence of a meet and confer agreement in the district. Meet and confer agreements generally stipulate that district administrators are to meet and confer with teacher representatives about salaries, benefits, and working conditions, but they do not legally compel the district to reach an agreement with a teachers' union. They tend to be concentrated in a handful of states with meet and confer laws and weak collective bargaining laws. Because they are not binding on school districts, meet and confer agreements are likely to result in less favorable outcomes for teachers. As seen in The analysis also includes a number of other important variables thought to affect teacher salaries. Teachers are expected to require greater compensation for longer school years, so the number of days in the school year is expected to have a positive sign. Teachers generally prefer smaller classes, so the student-teacher ratio is expected to have a positive coefficient as found by Vedder and Hall (2000) . Secondary teaching is thought to be more difficult and require greater skills, so the share of secondary teachers is expected to have a positive coefficient (Walden and Sogutlu 2001) . Districts that have dismissed relatively large numbers of teachers recently are expected to have a lower need for teachers and pay less competitive salaries. Districts that have experienced increased enrollments over the previous five years are expected to have a high demand for teachers and be willing to pay higher relative salaries (Zwerling and Thomason 1995) . Similarly, larger districts are expected to pay higher salaries, and the log of district enrollment is expected to have a positive coefficient (Walden and Newmark 1995) . A number of researchers (e.g. Merrifield 1999 and Taylor forthcoming) suggest that monopsony power in the local teacher labor market adversely affects teacher salaries. To account for this, the regressions include the local labor market teacher employment Herfindahl Index (HI) as a measure of employer concentration. The HI is computed as the sum of the squared market shares of all school districts in a local labor market, including ones not in the sample, and is expected to have a negative coefficient. Martin (forthcoming) suggests that teachers require compensating differentials to teach students from disadvantaged backgrounds, so the share of students who are white is expected to have a negative effect, while the share of students that are low income as measured by free or reduced lunch eligibility is expected to have a positive effect. The log of the Comparable Wage Index is included to control for the relative cost of living in a particular labor market and also serve as a proxy for the opportunity cost of teaching in a given market (Stoddard 2005) . A higher level of comparable wages is expected to increase teacher salaries. More educated residents are thought to have greater demand for education, so the share of adults (age 25+) living in the district with at least a high school degree and the share of adults with at least a bachelor's degree are both expected to have positive coefficients (Taylor forthcoming).\nResidents with children are expected to demand greater spending on education, so the share of households with at least one child under age 18 is expected to have a positive effect (Easton 1988) . Renters are thought to be more likely than homeowners to support spending on education, perhaps in part because renters do not believe that they bear the burden of local property taxes to finance education, so the share of households who are homeowners is expected to have a negative effect (Martinez-Vasquez and Sjoquist 1988). The unemployment rate in the county in which the district is located is also included to capture local labor market conditions.\nHigher unemployment is likely to make it more difficult to find a well-paying career outside of teaching and is expected to have a negative effect on teacher salaries (Taylor forthcoming).\nFinally, a number of studies (e.g. Lentz 1998 and Winters 2009 ) suggest that districts with a greater property tax base pay higher teacher salaries. Therefore, the log of the median value of owner-occupied housing in the district is included as a proxy for the property tax base and is expected to have a positive effect."}, {"section_title": "Empirical Results", "text": "I begin by estimating equation (1) using OLS, but theory and numerous empirical tests suggest that spatial correlation is likely to be present in both the dependent variable and the error term. Therefore, I also estimate the spatial model of equation (2) using GMM. Results that measure union activity by collective bargaining and meet and confer indicator variables are discussed first and reported in Tables 2 and 3 for experienced and beginning teachers, respectively. Tables 4 and 5 re-estimate the equations in Tables 2 and 3 measuring union activity by the share of districts in the state with a collective bargaining agreement. Tables 6 and   7 re-estimate the equations in Tables 2 and 3 measuring union activity by the share of teachers in the state who are members of a teacher union.\nImportantly, the marginal effects of the exogenous variables in the spatial models are not equal to their coefficient estimates. In the spatial results below, I report coefficient estimates, standard errors in parentheses, and average marginal effects in brackets computed as described in the Appendix. For ease of discussion, I often refer to the average marginal effects simply as the marginal effects, and I focus on these when discussing magnitudes for these variables. This is important because the marginal effects for some variables below are more than twice the size of the coefficient estimates. Note that coefficient estimates for the OLS equations can be directly interpreted as marginal effects because of the linearity assumption."}, {"section_title": "Spatial Correlation Coefficients", "text": "The results confirm that salaries are spatially dependent for both experienced teachers and beginning teachers even after controlling for many other variables that explain teacher salaries. The results in column 2 of Tables 2 and 3 report statistically significant spatially lagged dependent variable coefficients ( ) of 0.64 and 0.69 for experienced and beginning teachers, respectively. According to these estimates, a one percent increase in the distance-weighted average of experienced teacher salaries in nearby districts increases salaries for experienced teachers in a given district by 0.64 percent. For beginning teachers, the effect of salaries in nearby districts is even stronger; a one percent increase in the distance-weighted average of salaries for beginning teachers in nearby districts increases salaries for beginning teachers by 0.69 percent. The spatial error coefficient ( ) is also statistically significant for both experienced and beginning teachers. The spatial error coefficient is 0.60 for experienced teachers in Table 2 and 0.62 for beginning teachers in Table 3 ."}, {"section_title": "Collective Bargaining and Meet and Confer Indicators", "text": "Estimating the effects of teacher unions on teacher salaries is a primary concern of this paper. Previous studies have usually found that unions increase teacher salaries, at least for experienced teachers, but these studies do not generally account for spatial dependence in teacher salaries. For experienced teachers, the OLS results in this paper suggest that the presence of collective bargaining increases teacher salaries by roughly 10 percent. Accounting for the spatial nature of the data, however, the average marginal effect of collective bargaining for experienced teachers is only 0.037, suggesting that collective bargaining in a district increases salaries for experienced teachers by about four percent. Thus, it appears that failing to account for spatial dependence causes one to overstate the effects of collective bargaining in a district on the salaries of experienced teachers in that district. However, because collective bargaining is measured at the district level but may have spillover effects across districts, some of the observed wage spillover in Table 2 may be a union spillover. Later on, I will measure union activity by two state-level variables whose observed effects include union spillovers, the share of districts in a state with collective bargaining and the share of workers in a state who are members of a teacher union.\nFor beginning teachers accounting for spatial dependence has a similar effect on coefficient estimates for collective bargaining but on a much smaller scale. OLS suggests a small but statistically significant effect of collective bargaining, just less than one percent. The spatial model, however, reports an even smaller (negative) coefficient that is not statistically different from zero. Thus, consistent with previous literature, the results in Tables 2 and 3 suggest that collective bargaining increases teacher salaries for experienced teachers but not for beginning teachers. Tables 2 and 3 also include an indicator variable for the presence of a meet and confer agreement in the district. For experienced teachers the meet and confer effect is small and statistically insignificant in the OLS specification. For the spatial results, however, meet and confer agreements have a significantly positive effect for experienced teachers with a marginal effect estimate of 0.026, which is slightly smaller than the effect of collective bargaining. For beginning teachers the meet and confer effect in the OLS specification is actually negative and statistically significant though relatively small. Accounting for spatial dependence, though, the meet and confer effect for beginning teachers is very small, positive, and not statistically significant."}, {"section_title": "Additional Explanatory Variables", "text": "The results in Tables 2 and 3 suggest that additional variables affect teacher salaries as well. These include characteristics of the teachers, the school district, the students, the local residents, and the local labor market. Importantly, the results for the spatial models are often quite different from the OLS results for the non-spatial models in the first column of the tables.\nHere I discuss the results for the spatial models in the second columns of Tables 2 and 3 .\nBecause the dependent variables are measured in logs, the marginal effects can be loosely interpreted as percentage changes. Note, however, that a few variables have been rescaled for estimation and presentation purposes. The length of the school year has a positive and statistically significant effect on the salaries of both experienced and beginning teachers with marginal effects of 0.096 and 0.085, respectively. The student-teacher ratio has a positive effect on the salaries of experienced teachers with a marginal effect of 0.106 that is statistically significant at the 10 percent level. However, the estimates suggest that increasing the studentteacher ratio by ten would only increase teacher salaries by about one percent, so the effect is relatively small. For beginning teachers the student-teacher ratio effect is even smaller and not statistically different from zero. For both experienced and beginning teachers, salaries increase with the percentage of teachers who teach secondary grades, with significant marginal effects of 0.050 and 0.030, respectively. This suggests that secondary teaching is either less pleasant or requires greater skills or greater effort than teaching primary grades (Walden and Sogutlu 2001) .\nThe percentage of teachers dismissed in the previous year has a negative but statistically insignificant coefficient for both experienced and beginning teachers. Consistent with expectations, enrollment and the growth in enrollment both have significantly positive effects on the salaries of experienced and beginning teachers. Enrollment growth has marginal effects of 0.024 for experienced teachers and 0.023 for beginning teachers. The log of enrollment has marginal effects of 0.024 for experienced teachers and 0.015 for beginning teachers. This may suggest that larger school districts are worse places to work and require compensating differentials (Walden and Newmark 1995) . The Herfindahl Index has a statistically significant negative effect for both experienced and beginning teachers with marginal effects of -0.049 and -0.042, respectively. The share of students who are white has a negative and statistically significant effect for both experienced and beginning teachers with marginal effects of -0.031 and -0.033, respectively. This is consistent with Martin (forthcoming) who finds that teachers require positive compensating wage differentials to work in districts with a higher percentage of minority students. The share of low-income students has a small negative coefficient for both that is not statistically significant.\nThe results also suggest that teacher salaries are affected by local labor market conditions and the local demand for education. The log of the comparable wage index, which measures teachers' opportunity cost of teaching in the local market, has a statistically significant effect for both experienced and beginning teachers, with marginal effects of 0.392 and 0.269. Thus teachers require higher wages to teach in labor markets that pay higher wages to other occupations. Increases in the share of the adult population with a college degree significantly increases salaries for both experienced and beginning teachers, with marginal effects of 0.191 and 0.118. The share of the population with a high school degree or higher, however, has a negative coefficient for both experienced and beginning teachers, though the effect is only statistically significant for beginning teachers with a marginal effect of -0.086. The share of households in a district with children under age 18 results in significantly lower salaries for experienced teachers, with a marginal effect of -0.118. This is in contrast to expectations that households with children would demand greater education services and be willing to support higher teacher salaries. For beginning teachers, the effect of the share of households with children is small and statistically insignificant. The share of households in a district who are homeowners has a negative but statistically insignificant effect on the salaries of both experienced and beginning teachers. The county unemployment rate has a positive coefficient for both experienced and beginning teachers, but the effect is only statistically significant for experienced teachers with a marginal effect of 0.340. However, the positive effect of unemployment on teacher salaries is somewhat unexpected. Finally, the log of the median of home values in the district has a statistically significant positive effect on the salaries of both experienced and beginning teachers with marginal effects of 0.031 and 0.023. This suggests that wealthier districts demand greater spending on education and this translates into higher teacher salaries. Tables 4 and 5 present the results of re-estimating the equations in Tables 2 and 3 measuring union activity by the share of districts in a state with a collective bargaining agreement. For the sake of brevity, I report only results for the spatial variables and the state collective bargaining share. The results for the additional explanatory variables are qualitatively similar to the corresponding results in Tables 2 and 3 and are available from the author in an unpublished appendix. Measuring union activity by the state collective bargaining share, the spatial lag coefficient decreases to 0.53 for experienced teachers in the second column of Table   4 . This seems to confirm the earlier hypothesis that the spatial lag coefficient in Table 2 was partially capturing union spillovers. For beginning teachers, however, the spatial lag coefficient of 0.69 in Table 5 is identical to that in Table 3 . The spatial lag coefficient is now significantly larger for beginning teachers than for experienced teachers. This result is likely due to the greater mobility of new than experienced teachers. District administrators may be especially concerned with keeping beginning salaries competitive in order to be able to hire and retain beginning teachers. Because experienced teachers are usually less mobile, spatial dependence in salaries for experienced teachers may result more from union efforts to keep salaries comparables to those in nearby districts. The spatial error coefficients are again statistically significant for both experienced and beginning teachers with estimates of 0.65 and 0.63, respectively."}, {"section_title": "Measuring Union Activity by the State Share of Districts with Collective Bargaining", "text": "The results in Table 4 also suggest that the share of districts with collective bargaining has a statistically significant effect on salaries of experienced teachers, with a marginal effect of 0.163 in the spatial model. This is more than four times the effect of collective bargaining in the second column of Table 2 suggesting that the spillover effects from collective bargaining are considerably larger than the direct effect of collective bargaining in the district. For beginning teachers, the share of districts with collective bargaining has a positive coefficient in Table 5 , but the effect is small and not statistically significant at conventional levels. This suggests that the state collective bargaining share likely has at best a weak effect on the salaries of beginning teachers. In results not shown, I also estimated regressions that simultaneously included both an indicator variable for collective bargaining in a district and the state share of districts with collective bargaining. In these regressions the effects for the indicator variable were virtually zero and statistically insignificant, while the effects for the state collective bargaining share were virtually identical to the results in Tables 4 and 5 . This suggests that being in a heavily unionized state has a much more important effect on salaries for experienced teachers than being in a district with collective bargaining."}, {"section_title": "Measuring Union Activity by State Union Membership", "text": "Following Zwerling and Thomason (1995) I also explore measuring union activity by the percentage of teachers in a state who are members of a teacher union. Tables 6 and 7 present the results of re-estimating the equations in Tables 2 and 3 The spatial lag and spatial error results in Tables 6 and 7 measuring union activity by the state membership share are very similar to the corresponding estimates in Tables 4 and 5 . For experienced teachers the state membership density has a significant marginal effect of 0.347 in Table 6 . For beginning teachers the state membership density is significant at the ten percent level, with a marginal effect of 0.098. This is the first statistically significant effect of union activity on beginning teacher salaries in this paper. The marginal effects for the state membership density in Tables 6 and 7 are larger in magnitude than the marginal effects for the collective bargaining share in Tables 4 and 5 , but we must also account for the fact that the state membership density is less dispersed than the state collective bargaining share to assess their relative impacts. The state collective bargaining share has a minimum value of zero, a maximum value of one, and a standard deviation of 0.410, while the state membership density ranges between 0.312 and 0.992 and has a standard deviation of 0.185. Therefore, according to the second column estimates in Tables 4 and 6 , moving from a state with no collective bargaining to a state with complete collective bargaining coverage would increase salaries for experienced teachers by 17.8 percent, while moving from the state with the lowest membership density to the state with the greatest membership density would increase salaries for experienced teachers by 28.2 percent. Alternatively, moving from one standard deviation below the mean to one standard deviation above the mean of union activity increases salaries for experienced teachers by 14.6 percent for the collective bargaining share and by 15.4 percent for the state membership density.\nMoving from the 25 th percentile to the 75 th percentile of union activity increases salaries for experienced teachers by 15.6 percent for the collective bargaining share and by 12.5 percent for the state membership density. Thus, although the two measures differ, their estimated impacts on the salaries of experienced teachers are both fairly large."}, {"section_title": "Conclusion", "text": "Using a national level dataset this paper has shown that salaries for both experienced and beginning teachers are considerably affected by teacher salaries in nearby districts, though the effect is larger for beginning teachers. Investigations of the determinants of teacher salaries that ignore spatial dependence are likely to be mis-specified. The results of the spatial regressions suggest that a number of other important factors affect teacher salaries. The effect of unions on teacher salaries is given considerable attention in this paper and several measures of union activity are explored. Including union spillover effects, I find that collective bargaining and union membership density in a state increase salaries for experienced teachers by as much as 18 and 28 percent, respectively, but the estimated effects on the salaries of beginning teachers are much smaller. Given the relatively weak bargaining position of beginning relative to experienced teachers within unions, this result is not surprising.\ndoes not vary among neighboring districts (e.g. the variable is measured at the state level and all neighbors are in the same state), then the average marginal effect of a unit increase in is equal to / 1 . We can think of ∑∑ as a spatial multiplier with both ∑ and 1/ 1 as special cases. 0.7878 Notes: Column 1 is estimated by OLS and column 2 is estimated by GMM. The dependent variable is the log of the salary for teachers with 20 years of experience and a Master's degree. Standard errors are in parentheses and average marginal effects are in brackets for the spatial model. * Significant at 10%; ** Significant at 5%; *** Significant at 1%. 0.7876 Notes: Column 1 is estimated by OLS and column 2 is estimated by GMM. The dependent variable is the log of the salary for teachers with 20 years of experience and a Master's degree. Regressions also include the additional non-union explanatory variables in Table 2 . Standard errors are in parentheses and average marginal effects are in brackets for the spatial model. *** Significant at 1%. 0.7795 Notes: Column 1 is estimated by OLS and column 2 is estimated by GMM. The dependent variable is the log of the salary for teachers with no experience and only a Bachelor's degree. Regressions also include the additional non-union explanatory variables in Table 2 . Standard errors are in parentheses and average marginal effects are in brackets for the spatial model. *** Significant at 1%. 0.7866 Notes: Column 1 is estimated by OLS and column 2 is estimated by GMM. The dependent variable is the log of the salary for teachers with 20 years of experience and a Master's degree. Regressions also include the additional non-union explanatory variables in Table 2 . Standard errors are in parentheses and average marginal effects are in brackets for the spatial model. *** Significant at 1%. 0.7790 Notes: Column 1 is estimated by OLS and column 2 is estimated by GMM. The dependent variable is the log of the salary for teachers with no experience and only a Bachelor's degree. Regressions also include the additional non-union explanatory variables in Table 2 . Standard errors are in parentheses and average marginal effects are in brackets for the spatial model. * Significant at 10%; *** Significant at 1%."}]