[{"section_title": "Abstract", "text": "Evolution favored individuals with superior cognitive and physical abilities under conditions of limited food sources, and brain function can therefore be optimized by intermittent dietary energy restriction (ER) and exercise. Such energetic challenges engage adaptive cellular stress-response signaling pathways in neurons involving neurotrophic factors, protein chaperones, DNA-repair proteins, autophagy, and mitochondrial biogenesis. By suppressing adaptive cellular stress responses, overeating and a sedentary lifestyle may increase the risk of Alzheimer's and Parkinson's diseases, stroke, and depression. Intense concerted efforts of governments, families, schools, and physicians will be required to successfully implement brain-healthy lifestyles that incorporate ER and exercise.\nSensing, Acquiring, and Remembering Energy Sources The brain is the master regulator of energy intake and expenditure, and so it determines whether energy balance is maintained within limits that foster optimal health or deviate by amounts that incite disease. In one way or another, nerve cell circuits in most brain regions are involved in energy acquisition and/or expenditure (Woods, 2009 ). Thus, neurons in the hypothalamus regulate appetite; neurons in the hippocampus and prefrontal cortex encode memories of food sources and motivation to acquire food; and neurons in the motor cortex, basal ganglia, and cerebellum regulate energy use via controlling muscle movements. Energy expenditure (exercise and shivering and nonshivering thermogenesis) is also regulated by the central and autonomic nervous systems (Dishman et al., 2006). The integration of environmental cues such as the smell or sight of a food source, internal metabolic biochemical and endocrine pathways, decision-making processes, and behavioral responses involved in food acquisition is highly complex and not well understood. In natural environments, mammals typically maintain a neutral energy balance throughout adult life, except under conditions of long-term food scarcity. However, humans in modern societies and rodents in research laboratories are ''unnaturally'' overfed and sedentary, a state of chronic positive energy balance (CPEB) that results in suboptimal health (Martin et al., 2010) .\nBecause of their well-established effects on general health, diet and exercise are topics of daily discussion throughout the world. More than 60% of the populations of many industrialized countries, including the United States and the United Kingdom, are overweight (body mass index > 25) and so are at risk for progression to obesity, and for the development of diabetes, cardiovascular disease, and physical disabilities (https://apps. who.int/infobase). The vast majority of studies of the effects of energy intake and exercise on health have therefore focused on body composition (fat and lean mass/distribution), blood chemistry, and the cardiovascular and musculoskeletal systems. Numerous interventional trials have demonstrated a wide range of health benefits of exercise and/or energy restriction in overweight subjects. For example, controlled daily caloric restriction (Redman and Ravussin, 2011; Weiss and Fontana, 2011) , alternate day caloric restriction (ADCR) (Johnson et al., 2007; Varady and Hellerstein, 2007) and 2 days of caloric restriction each week (Harvie et al., 2011) result in reduced abdominal fat mass, increased insulin sensitivity, and reduced amounts of oxidatively damaged molecules, proinflammatory cytokines, and atherosclerotic lipids in the blood. Individuals who are not overweight also realize improved health when they exercise regularly and eat in moderation.\nEvolutionary Perspective: Necessity Is the Mother of an Inventive Brain and a Fit Body While humans in modern societies have the opportunity to consume food throughout the day and night (ad libitum), our ancestors typically had to compete amongst themselves and with other species for a limited supply of food. In the case of primates, the ability to travel relatively long distances (e.g., tens of kilometers from a family shelter to sites of food sources) conferred a survival advantage for erect (human) runners compared to less efficient apes (Lieberman and Bramble, 2007) . A brain capable of mapping large areas of terrain and the location of resources and hazards, and of communicating such information to others, developed in concert with the ''endurance runner'' phenotype. It may therefore be no coincidence that the most intelligent species also has a very high endurance capacity (Mattson, 2012) .\nAs our species evolved, a survival advantage was conferred on individuals that were cognitively ''sharp,'' physically agile, and energy-efficient during periods of limited resource availability. A consideration of the environments and day-to-day behaviors of our ancestors and us sets the stage for much of the remainder of this article. Early humans foraged within relatively small areas of land, with most of their time spent seeking and consuming plants. They encountered many hazards (weather, predators, physical injuries, and infections), as well as intraspecies competition. Energy intake was relatively low and intermittent, and energy expenditure relatively high. Based upon musculoskeletal and physiological adaptations for locomotor efficiency and body cooling, it has been suggested that endurance running was possible for Homo erectus, but not likely for earlier hominins (Ruxton and Wilkinson, 2011) . More recently (e.g., 10,000 years ago), humans lived in villages with shelter and considerable cooperation among families, mostly focused around hunting, the domestication of animals, the development and fabrication of tools, and agriculture. Languages and mathematics and early educations systems were also being developed. Energy intake was mostly sufficient and energy expenditure high. This view of the metabolic state of our ancestors 5 million and 10,000 years ago is, of course, not based upon direct quantitative data concerning their daily energy expenditure, energy intake, BMI, and other aspects of their energy metabolism. Nevertheless, the fossil record and molecular analyses of artifacts do provide a reasonable basis for concluding that those ancestors were more physically active, and consumed food less frequently and in amounts less than present day man in our modern Western societies. Indeed, just within the past 100 years, there have been dramatic changes in the energy intake (increased) and expenditure (reduced) of most humans in modern societies. The development of effort-sparing technologies for rapid transportation, mechanized agriculture, and food processing, together with the persuasive power of advertisements, has led to the consumption of high-energy density foods and sedentary lifestyles. As described below, brain performance is at a peak level under conditions of intermittent energy restriction and periodic vigorous energy expenditure. The question therefore becomes this: What will be the evolutionary fate of the human brain and body if couch potato lifestyles are passed on from generation to generation? Will engaging in intellectual activities be sufficient to maintain and enhance the neuronal circuits that evolved for the purpose of energy acquisition in harsh environments, even in the absence of the necessities to survive on limited-energy resources and to expend considerable energy to obtain food?\nEnergy Restriction and Exercise Enhance Synaptic Plasticity, Neurogenesis, and Cognition ER and exercise enhance the functional capabilities of the brain via actions on synapses and neural stem cells. The term ''synaptic plasticity'' refers to changes that occur in the numbers, structure, and functional status of synapses as adaptive responses to a range of environmental challenges (Figure 1 ), including those that are voluntary (e.g., problem solving, writing, and competing in sport) and those that are unwelcomed (e.g., a traumatic injury or disease). Synaptic plasticity is believed to be essential for learning and memory (Kim and Linden, 2007) and provides a potential mechanism to preserve and/or restore brain function in the settings of aging and injury (Duffau, 2006). Long-term potentiation (LTP), an electrophysiological measure of synapse strengthening associated with learning and memory, declines in hippocampal neurons during aging, and this agerelated decrement is ameliorated by daily ER during adult life in rats (Hori et al., 1992) . ER restored ocular dominance plasticity in the visual cortex and recovery from amblyopia in rats (Spolidoro et al., 2011) . ER can also prevent age-related atrophy of the brain. In a study of old rhesus monkeys, stress reactivity was associated with smaller sizes of the hippocampus, amygdale, and prefrontal cortex (measured by MRI-based volumetric analysis), and long-term ER (beginning in early adulthood) resulted in lower-stress reactivity and increased sizes of all three brain regions (Willette et al., 2012a) . The ability of ER to preserve synaptic plasticity during aging is associated with maintenance of youthful levels of N-methyl-D-aspartate (NMDA) glutamate receptors (Eckles-Smith et al., 2000). Levels of some postsynaptic glutamate receptor subunits and presynaptic vesicleassociated proteins are stabilized during middle and late life in rats maintained on an ER diet compared to those on an ad libitum diet (Adams et al., 2008) . Additional molecular changes that may occur in neurons in response to ER include those involving proteins for mitochondrial function, inflammation, oxidative stress, and Notch and Wnt signaling (Lee et al., 2000; Xu et al., 2007) .\nThe molecular and structural changes that occur in synapses in response to exercise, and their functional consequences, A glutamatergic (excitatory) neuron in the hippocampus, with a long axon (red) and three major dendrites (blue) is shown. During exercise, energy restriction, or when engaged in cognitive challenges, the excitatory neurotransmitter glutamate is released from presynaptic terminals (red) and activates receptors located on postsynaptic spines (black projections on the dendrites). As a result, Ca 2+ influx occurs which then activates signaling pathways that: 1) induce the expression of genes involved in synaptic plasticity and cell survival, including those encoding neurotrophic factors, protein chaperones, and antioxidant enzymes; 2) modify mitochondrial energy metabolism and free radical generation; and 3) trigger Ca 2+ release from the endoplasmic reticulum (ER). The activity and function of glutamatergic neurons is subject to modification by intrinsic interneurons that employ the inhibitory neurotransmitter GABA, as well as by inputs from serotonergic and noradrenergic neurons located in the brainstem and cholinergic neurons in the basal forebrain. The arrows indicate the direction of information flow to and within the glutamatergic neuron.\nCell Metabolism 16, December 5, 2012 ª2012 Elsevier Inc. 707\nReview are being elucidated. Runner rats exhibit greater short-term potentiation and LTP compared to nonrunner controls (Farmer et al., 2004). Extracellular recording from CA1 hippocampal neurons revealed that early-phase LTP is impaired in sedentary sleep-deprived rats but is normal in sleep-deprived rats that exercise (Zagaar et al., 2012) . Of note, ''exercising'' neurons without aerobic exercise (by engaging them in intellectual challenges) can also enhance synaptic plasticity (Duffy et al., 2001).\nNeurogenesis is a process in which neural stem cells cease dividing and differentiate into neurons. The newly generated neurons may then grow axons and dendrites, and form synapses with existing neurons, thereby becoming part of a functional neuronal circuit. The seminal work of van Praag et al. showed that voluntary exercise (wheel running) stimulates neurogenesis in the hippocampus of adult rodents (van Praag et al., 1999) . Electrophysiological recording from newly generated neurons (labeled with a GFP-expressing retrovirus) demonstrated that the new neurons integrate into functional circuits (van Praag et al., 2002) . ER can also increase neurogenesis by enhancing the survival of newly generated hippocampal neurons (Lee et al., 2002) . Exercise and ER may enhance neurogenesis by similar mechanisms involving upregulation of the expression of trophic factors including BDNF, insulin-like growth factor 1 (IGF-1), and vascular endothelial cell growth factor (VEGF) (Lee et al., 2002; Cheng et al., 2003; Joseph D'Ercole and Ye, 2008; Trejo et al., 2008) .\nEvidence suggests that ER and exercise can enhance brain function and may forestall age-related cognitive decline in humans. When the caloric intake of fifty normal elderly subjects was reduced by 30% for 3 months, the performance on memory tests improved significantly compared to two different control diet groups (Witte et al., 2009 ). As recently reviewed by Voss et al. (2011) , epidemiological and controlled interventional trials have demonstrated improvements in cognitive performance in response to regular aerobic exercise in humans. In a study of 1820 adolescents, cognitive performance was significantly better in those engaged in sports compared to those who were less active (Ruiz et al., 2010) . The results of structural MRI studies suggest that the size of several brain regions, including both gray and white matter, is increased by regular aerobic exercise but not by nonaerobic stretching and toning (Colcombe et al., 2006) . The complex cognitive processing of information in the human brain requires the coordinated activation of nerve cell networks in multiple brain regions, and the coincident inhibition of activity in a network called the default mode network (DMN) (Whitfield-Gabrieli and Ford, 2012) . Functional MRI analyses of brain networks in subjects who had spent 1 year in either a group who performed regular aerobic exercise or nonaerobic exercise revealed that aerobic training resulted in greater functional efficiency of cognitive networks including the DMN and the frontal lobe executive network (Voss et al., 2010) . The improved functional connectivity in those who exercised aerobically was correlated with improved performance in tests of executive function.\nA range of cognitive processes may benefit from exercise throughout life, and regular exercise during early life may prevent or delay cognitive decline during late life. Mice that run regularly exhibit improved spatial pattern separation ability, a cognitive process that depends critically upon neurons in the dentate gyrus of the hippocampus (Creer et al., 2010) . Hippocampal neurogenesis may be required for spatial pattern separation and its enhancement by exercise (Sahay et al., 2011) . Exercise can also enhance nonspatial forms of memory as demonstrated in studies of object recognition memory in rats, a process mediated by the perirhinal cortex and hippocampus (Hopkins et al., 2011) . Interestingly, the latter study further showed that rats that had exercised as adolescents and subsequently ceased exercising retained their superior object recognition memory, whereas rats that exercised only as adults rapidly lost their improved object recognition memory within a few weeks of ceasing exercise. This suggests that exercise during a critical period of brain development may foster enhanced cognitive function later in life. Challenging neuronal circuits by exercise and cognitive challenges during this same critical period may provide a ''cognitive reserve'' that protects against deterioration of brain function later in life (Steffener and Stern, 2012) .\nThere are undoubtedly qualitative and quantitative differences in metabolic and physiologic responses to a low-energy flux status (i.e., ER) and a high-energy flux status (i.e., endurance exercise). Data from animal studies indicate that ER can dramatically extend maximal life span and retard aging, whereas exercise has a comparatively little effect on the aging process (Mercken et al., 2012) . Data from clinical studies indicate that, compared to regular exercise, ER may result in more of the same hormonal and physiologic adaptations (e.g., lower core body temperature and lower sex hormones) that typically occur in animals on life-extending ER diets. However, there is considerable overlap in physiological effects of ER and endurance training in humans, including increased insulin sensitivity, reduced central adiposity, and increased heart rate variability. As described in the ensuing sections of this article, both ER and exercise can promote optimal brain function and resistance to age-related diseases, and may do so via both overlapping and complementary mechanisms.\nThe phrase ''That which does not kill me makes me stronger,'' which is attributed to the German philosopher Friedrich Nietzsche, is synonymous with the concept of hormesis (Calabrese et al., 2007) . Numerous adaptive stress-response pathways that mediate hormesis in neurons have been identified. They include signaling cascades within neurons, between neurons, and between glial cells and neurons. Examples of intracellular adaptive stress-response molecules include protein chaperones, antioxidant enzymes, DNA-repair enzymes, and proteins involved in mitochondrial biogenesis. Examples of intercellular adaptive stress-response signals include neurotransmitters, neurotrophic factors, lipid mediators, and gases.\nDuring ER and exercise, many neuronal circuits throughout the brain exhibit greater levels of electrical and synaptic activity than they do in a satiated and resting state (Voss et al., 2010) . Elderly subjects who exercised for 4 months exhibit increased hippocampal blood flow and greater functional connectivity of the hippocampus and anterior cingulate cortex compared to agematched control subjects (Burdette et al., 2010) . Subjects trained to perform a dynamic balancing task exhibit greater frontoparietal cortex network activity that persists for at least 708 Cell Metabolism 16, December 5, 2012 ª2012 Elsevier Inc.\nReview one week after training (Taubert et al., 2011) . Interestingly, functional MRI analysis of neural activity in the brains of human subjects during exploration of a virtual reality environment designed to mimic a foraging task in rodents revealed activation of a large network that includes circuits in the entorhinal cortex; hippocampus; and lateral temporal, parietal, and prefrontal cortices (Doeller et al., 2010). A comparison of brain functional activities in overfed and lean minipigs revealed a relative deactivation of multiple brain regions in the overfed animals, including circuits in the temporal, prefrontal, and insular cortices (ValLaillet et al., 2011). Thus, both ER and exercise result in vigorous activation of neuronal networks in the brain, particularly neurons in the temporal and frontal lobes, whereas these same neuronal circuits are relatively deactivated in individuals who are sedentary and overfed.\nAs is the case with muscle cells during exercise, when neurons are active they experience considerable energetic and oxidative stress as a result of Na + and Ca 2+ influx and the increased demand for ATP to restore transmembrane ion gradients. Most excitatory synapses in the brain deploy the neurotransmitter glutamate, which activates postsynaptic receptors that depolarize the membrane and trigger Ca 2+ influx through N-methyl-D-aspartate (NMDA) receptor channels and voltage-dependent Ca 2+ channels (Figure 2 ). Ca 2+ promotes oxidative stress by increasing mitochondrial superoxide production and by activating nitric oxide synthase to generate nitric oxide. However, Ca 2+ also interacts with specific binding proteins (e.g., calmodulin) and activates kinases such as Ca 2+ /calmodulin-dependent protein kinase 2 (CaMK2) and mitogen-activated protein (MAP) kinases, which mediate adaptive responses of neurons to glutamate receptor activation including the strengthening of synapses and cellular stress resistance. Downstream of CaMKII and MAP kinases in the glutamate signaling pathway are transcription factors involved in neuronal plasticity and survival including An excitatory synapse is comprised of a presynaptic axon terminal with vesicles containing the neurotransmitter glutamate (red) that is released into the synapse in response to Ca 2+ influx resulting from Na + influx-mediated depolarization of the neuron. Glutamate binds to ionotropic a-amino-3-hydroxy-5-methylisoxazole-4-propionate receptors (AMPAR) and N-methyl-D-aspartate receptors (NMDAR) located at the membrane surface of the postsynaptic dendrite. AMPAR flux Na + resulting in membrane depolarization and opening of NMDAR which flux Ca 2+ , as well as opening of voltage-dependent Ca 2+ channels (VDCC). Within the dendrite, Ca 2+ functions as a second messenger to activate multiple signal transduction cascades including one involving Ca 2+ /calmodulin-dependent kinase (CaMK) and the transcription factor cyclic AMP response element-binding protein (CREB). Ligands that activate receptors coupled to cyclic AMP (cAMP) production (R) also activate CREB; examples include serotonin and glucagon-like peptide 1. CREB induces the expression of multiple nuclear genes that encode proteins involved in synaptic plasticity and cell survival including brain-derived neurotrophic factor (BDNF). BDNF mRNA is then transported to the postsynaptic region of the dendrite where it is translated into BDNF protein which is, in turn, released and activates BDNF receptors (trkB) located on the surface of both the post-and pre-synaptic terminals. One prominent signal transduction pathway activated when BDNF binds trkB involves phosphatidylinositol-3-kinase (PI3K) and Akt kinase. Glial cells (astrocytes and microglia) can modulate synaptic plasticity by producing neurotrophic factors such as fibroblast growth factor 2 (FGF2) and glial cell line-derived neurotrophic factor (GDNF), and cytokines such as tumor necrosis factor (TNFa) and interleukin-1b. In the dentate gyrus of the hippocampus, a brain region critical for learning and memory, resides a population of neural stem cells that are capable of self-renewal (promoted by FGF2) and differentiation into neurons (promoted by BDNF) and astrocytes (promoted by bone morphogenic protein 2; BMP2).\nCell Metabolism 16, December 5, 2012 ª2012 Elsevier Inc. 709\nReview cyclic AMP response element-binding protein (CREB), nuclear factor kappa B (NF-kB), and AP-1. Gene targets of one or more of these transcription factors include those encoding BDNF, fibroblast growth factor 2 (FGF2), mitochondrial superoxide dismutase (SOD2), and the DNA repair enzymes (Stranahan and Mattson, 2012) .\nNeurotrophic factors play particularly prominent roles in the adaptive and neuroprotective responses of brain cells to exercise and ER (Cotman et al., 2007; Llorens-Martín et al., 2008; Mattson, 2008) . Studies in rodents show that exercise can induce the expression of BDNF, IGF-1, and VEGF in the hippocampus; GDNF in the substantia nigra and striatum; and NGF in the cerebral cortex. ER (alternate day fasting) also stimulates BDNF and FGF2 production in the hippocampus, cerebral cortex, and striatum. In a study comparing subjects who underwent endurance training for 3 months to more sedentary control subjects, BDNF levels were measured in blood samples taken from both the arterial supply to, and venous return from, the brain; the results suggest that endurance training increases BDNF release from the human brain (Seifert et al., 2010) . By increasing BDNF production, exercise and ER may buffer the brain from untoward stress.\nSeveral transcription regulators that are responsive to neurotrophic factors and reactive oxygen species can be induced in neurons by ER and/or exercise (Figure 3 ). These include cyclic AMP response element-binding protein (CREB), nuclear factor kB (NF-kB), nuclear response factor 2 (Nrf-2), hypoxia inducible factor 1 (Hif-1), and PGC1a (Alberini, 2009; Wareski et al., 2009; ). These transcription factors induce the expression of genes encoding proteins involved in neuroplasticity and cell survival (Figure 3) , including antioxidant enzymes (e.g., superoxide dismutases and glutathione peroxidase); antiapoptotic Bcl-2 family members; glutamate receptor subunits; calciumbinding proteins (e.g., calbindin and calretinin); and cell-adhesion proteins (Mattson, 2008) . These pathways are engaged when neurons experience energetic stress across a range of intensities from the mild stress associated with normal excitation, to the moderate stress during exercise and energy restriction, to the severe metabolic stress caused by a stroke or epileptic seizures.\nThe abnormal accumulation of misfolded self-aggregating proteins in neurons is a feature of normal aging that is greatly exacerbated in Alzheimer's and Parkinson's diseases (see section on neurodegenerative disorders below). Protein chaperones function to prevent protein damage and misfolding, whereas proteins damaged beyond repair are removed by the proteasome and autophagy systems (Rubinsztein et al., 2011) . Levels of the cytosolic protein chaperone HSP-70 and the endoplasmic reticulum chaperone GRP-78 are elevated in the cerebral cortex and striatum of rats and mice maintained on an alternate day fasting diet compared to those fed ad libitum . Multiple enzymes of the plasma membrane redox system, which function to suppress oxidative stress (NADH-quinone oxidoreductase 1, NADH-ferrocyanide reductase, NADH-ascorbate free radical reductase, NADH-coenzyme Q10 reductase, and NADH-cytochrome c reductase), are upregulated in brain cells in response to ER (Hyun et al., 2006) . The usual age-related decline in the level of the DNA base excision repair enzyme APE1 is attenuated in the brains of rats maintained on an ER diet (Kisby et al., 2010). ER can also upregulate autophagy, which can enhance the removal of damaged proteins, membranes, and organelles (Alirezaei et al., 2010) . Rats that ran on a treadmill 5 days/week for 3 weeks exhibited increased expression of HSP72 in their brain cells and increased resistance to ischemia-induced brain injury compared to rats that did not run (Chen et al., 2007) . Similarly, regular exercise upregulates heat-shock proteins in neurons, which is associated with resistance to brain injury in an animal model of stroke (Hu et al., 2009; Liebelt et al., 2010) . Running can also enhance the removal of damaged proteins by the proteasome . Thus, exercise and ER enable neurons to ''cleanse'' themselves of damaged organelles and proteins.\nBest known for its role in the bioenergetic responses of muscle cells to exercise, recent findings suggest that PGC1a is also of fundamental importance in adaptive responses of neurons to the mild energetic stress associated with both exercise and ER (Figure 3 ). Running on a treadmill for 1 hr per day for 8 weeks resulted in upregulation of PGC1a, SIRT1, and the mitochondrial enzyme citrate synthase in many different brain regions (cerebral cortex, hippocampus, cerebellum, midbrain, brainstem, hypothalamus), suggesting a widespread mitochondrial biogenic response to exercise in neural circuits throughout the brain (Steiner et al., 2011) . Treadmill exercise after cerebral ischemia stimulated PGC-1a expression and mitochondrial biogenesis in brain cells of rats (Zhang et al., 2012) , which may contribute to the mechanism by which exercise improves functional recovery in human stroke patients (Luft et al., 2008) . Activation of the Hif-1 and PGC-1a pathways is dependent upon the intensity of the exercise and, in rodents, may be greater in response to forced exercise compared to voluntary exercise (Kinni et al., 2011). ER can also stimulate mitochondrial biogenesis (Lettieri Barbato et al., 2012) . BDNF can stimulate PGC-1a and mitochondrial biogenesis in neurons, and PGC1a plays a pivotal role in the formation and maintenance of synapses (Cheng, A., Wan, R., Yang, J.L., Kamimura, N., Son, T.G., Ouyang, X., Luo, Y., Okun, E., and Mattson, M.P., unpublished data), suggesting key roles for BDNF and mitochondrial biogenesis in the beneficial effects of ER and exercise on neuroplasticity.\nER may protect mitochondria by a mechanism involving the mitochondrial histone deacetylase SIRT3 and upregulation of SOD2 (Qiu et al., 2010) . Whereas ER can prevent age-related hearing loss in wild-type mice, it does not prevent the hearing loss in mice lacking SIRT3 (Someya et al., 2010) . The latter study provided evidence that SIRT3 protects the auditory cells by deacetylating and thereby activating isocitrate dehydrogenase, resulting in an elevation of NADPH levels and an increased ratio of reduced to oxidized glutathione. Interestingly, genomic analysis of DNA from individuals ranging from 20 to 106 years old revealed that a variant of the SIRT3 gene that lacks an enhancer activity is virtually absent in males over the age of 90 years (Bellizzi et al., 2005) , suggesting a potential role for SIRT3 as a longevity determinant in humans. The enhancement of mitochondrial mass and resilience by exercise and ER may also involve mitochondrial uncoupling proteins such as UCP2 and UCP4 (Andrews et al., 2005; Liu et al., 2006) .\nIn addition to brain-autonomous signaling pathways engaged by ER and exercise, factors derived from peripheral tissues may mediate beneficial effects of exercise and ER on the brain. In this regard, muscle (Pedersen and Febbraio, 2012) and adipocytes In response to intermittent bouts of vigorous exercise and periods of energy restriction (ER), several prominent signaling pathways are activated in neurons that engender changes in metabolism, functional and structural plasticity, and cellular stress resistance. Collectively, these signaling pathways optimize brain function, reduce neuronal vulnerability to aging and disease, and enhance recovery from traumatic and ischemic insults. During exercise and ER, activity in many neuronal circuits increases and is mediated by glutamate release from presynaptic terminals, which then activates ionotropic glutamate receptors resulting in Ca 2+ influx. Ca 2+ may also be released from endoplasmic reticulum (EndRet) stores. The Ca 2+ then activates kinases such as Ca 2+ /calmodulin-dependent kinases (CaMK) and CaMK, in turn, enhances the activity of the transcription factor cyclic AMP response element-binding protein (CREB) in the nucleus. CREB can also activated by ligands that bind to cell surface receptors that are coupled to the GTP-binding protein Gs which then activates adenylate cyclase resulting in the production of cyclic AMP (cAMP) and activation of protein kinase A (PKA). Glucagon-like peptide 1 (GLP-1) is an example of a hormone/neuropeptide that activates receptors (R) coupled to cAMP production in neurons. Ca 2+ influx may also lead to the activation of the transcription factor NF-kB in the cytoplasm, resulting in the translocation of the active NF-kB into the nucleus. Exercise and ER also increase signaling via receptors for brain-derived neurotrophic factor (BDNF) and insulin or insulin-like growth factor-1 (IGF-1); activation of these receptors engages two signaling cascades in neurons including those involving phosphatidylinositol-3-kinase -Akt, and extracellular signal-regulated kinases (ERKs). The mild stress associated with exercise and ER can also activate the transcription factors nuclear regulatory factor 2 (Nrf-2) and heat-shock factor 1 (HSF-1) by a mechanism involving mitochondrial reactive oxygen species (ROS) and/or depletion of cellular energy substrates. Moreover, exercise and ER can promote mitochondrial biogenesis (upper left) by a mechanism involving a transcription factor called peroxisome proliferator-activated receptor gamma co-activator-1a (PGC-1a"}, {"section_title": "", "text": "Sensing, Acquiring, and Remembering Energy Sources The brain is the master regulator of energy intake and expenditure, and so it determines whether energy balance is maintained within limits that foster optimal health or deviate by amounts that incite disease. In one way or another, nerve cell circuits in most brain regions are involved in energy acquisition and/or expenditure (Woods, 2009 ). Thus, neurons in the hypothalamus regulate appetite; neurons in the hippocampus and prefrontal cortex encode memories of food sources and motivation to acquire food; and neurons in the motor cortex, basal ganglia, and cerebellum regulate energy use via controlling muscle movements. Energy expenditure (exercise and shivering and nonshivering thermogenesis) is also regulated by the central and autonomic nervous systems (Dishman et al., 2006) . The integration of environmental cues such as the smell or sight of a food source, internal metabolic biochemical and endocrine pathways, decision-making processes, and behavioral responses involved in food acquisition is highly complex and not well understood. In natural environments, mammals typically maintain a neutral energy balance throughout adult life, except under conditions of long-term food scarcity. However, humans in modern societies and rodents in research laboratories are ''unnaturally'' overfed and sedentary, a state of chronic positive energy balance (CPEB) that results in suboptimal health (Martin et al., 2010) .\nBecause of their well-established effects on general health, diet and exercise are topics of daily discussion throughout the world. More than 60% of the populations of many industrialized countries, including the United States and the United Kingdom, are overweight (body mass index > 25) and so are at risk for progression to obesity, and for the development of diabetes, cardiovascular disease, and physical disabilities (https://apps. who.int/infobase). The vast majority of studies of the effects of energy intake and exercise on health have therefore focused on body composition (fat and lean mass/distribution), blood chemistry, and the cardiovascular and musculoskeletal systems. Numerous interventional trials have demonstrated a wide range of health benefits of exercise and/or energy restriction in overweight subjects. For example, controlled daily caloric restriction (Redman and Ravussin, 2011; Weiss and Fontana, 2011) , alternate day caloric restriction (ADCR) (Johnson et al., 2007; Varady and Hellerstein, 2007) and 2 days of caloric restriction each week (Harvie et al., 2011) result in reduced abdominal fat mass, increased insulin sensitivity, and reduced amounts of oxidatively damaged molecules, proinflammatory cytokines, and atherosclerotic lipids in the blood. Individuals who are not overweight also realize improved health when they exercise regularly and eat in moderation.\nEvolutionary Perspective: Necessity Is the Mother of an Inventive Brain and a Fit Body While humans in modern societies have the opportunity to consume food throughout the day and night (ad libitum), our ancestors typically had to compete amongst themselves and with other species for a limited supply of food. In the case of primates, the ability to travel relatively long distances (e.g., tens of kilometers from a family shelter to sites of food sources) conferred a survival advantage for erect (human) runners compared to less efficient apes (Lieberman and Bramble, 2007) . A brain capable of mapping large areas of terrain and the location of resources and hazards, and of communicating such information to others, developed in concert with the ''endurance runner'' phenotype. It may therefore be no coincidence that the most intelligent species also has a very high endurance capacity (Mattson, 2012) .\nAs our species evolved, a survival advantage was conferred on individuals that were cognitively ''sharp,'' physically agile, and energy-efficient during periods of limited resource availability. A consideration of the environments and day-to-day behaviors of our ancestors and us sets the stage for much of the remainder of this article. Early humans foraged within relatively small areas of land, with most of their time spent seeking and consuming plants. They encountered many hazards (weather, predators, physical injuries, and infections), as well as intraspecies competition. Energy intake was relatively low and intermittent, and energy expenditure relatively high. Based upon musculoskeletal and physiological adaptations for locomotor efficiency and body cooling, it has been suggested that endurance running was possible for Homo erectus, but not likely for earlier hominins (Ruxton and Wilkinson, 2011) . More recently (e.g., 10,000 years ago), humans lived in villages with shelter and considerable cooperation among families, mostly focused around hunting, the domestication of animals, the development and fabrication of tools, and agriculture. Languages and mathematics and early educations systems were also being developed. Energy intake was mostly sufficient and energy expenditure high. This view of the metabolic state of our ancestors 5 million and 10,000 years ago is, of course, not based upon direct quantitative data concerning their daily energy expenditure, energy intake, BMI, and other aspects of their energy metabolism. Nevertheless, the fossil record and molecular analyses of artifacts do provide a reasonable basis for concluding that those ancestors were more physically active, and consumed food less frequently and in amounts less than present day man in our modern Western societies. Indeed, just within the past 100 years, there have been dramatic changes in the energy intake (increased) and expenditure (reduced) of most humans in modern societies. The development of effort-sparing technologies for rapid transportation, mechanized agriculture, and food processing, together with the persuasive power of advertisements, has led to the consumption of high-energy density foods and sedentary lifestyles. As described below, brain performance is at a peak level under conditions of intermittent energy restriction and periodic vigorous energy expenditure. The question therefore becomes this: What will be the evolutionary fate of the human brain and body if couch potato lifestyles are passed on from generation to generation? Will engaging in intellectual activities be sufficient to maintain and enhance the neuronal circuits that evolved for the purpose of energy acquisition in harsh environments, even in the absence of the necessities to survive on limited-energy resources and to expend considerable energy to obtain food?\nEnergy Restriction and Exercise Enhance Synaptic Plasticity, Neurogenesis, and Cognition ER and exercise enhance the functional capabilities of the brain via actions on synapses and neural stem cells. The term ''synaptic plasticity'' refers to changes that occur in the numbers, structure, and functional status of synapses as adaptive responses to a range of environmental challenges (Figure 1 ), including those that are voluntary (e.g., problem solving, writing, and competing in sport) and those that are unwelcomed (e.g., a traumatic injury or disease). Synaptic plasticity is believed to be essential for learning and memory (Kim and Linden, 2007) and provides a potential mechanism to preserve and/or restore brain function in the settings of aging and injury (Duffau, 2006) . Long-term potentiation (LTP), an electrophysiological measure of synapse strengthening associated with learning and memory, declines in hippocampal neurons during aging, and this agerelated decrement is ameliorated by daily ER during adult life in rats (Hori et al., 1992) . ER restored ocular dominance plasticity in the visual cortex and recovery from amblyopia in rats (Spolidoro et al., 2011) . ER can also prevent age-related atrophy of the brain. In a study of old rhesus monkeys, stress reactivity was associated with smaller sizes of the hippocampus, amygdale, and prefrontal cortex (measured by MRI-based volumetric analysis), and long-term ER (beginning in early adulthood) resulted in lower-stress reactivity and increased sizes of all three brain regions (Willette et al., 2012a) . The ability of ER to preserve synaptic plasticity during aging is associated with maintenance of youthful levels of N-methyl-D-aspartate (NMDA) glutamate receptors (Eckles-Smith et al., 2000) . Levels of some postsynaptic glutamate receptor subunits and presynaptic vesicleassociated proteins are stabilized during middle and late life in rats maintained on an ER diet compared to those on an ad libitum diet (Adams et al., 2008) . Additional molecular changes that may occur in neurons in response to ER include those involving proteins for mitochondrial function, inflammation, oxidative stress, and Notch and Wnt signaling (Lee et al., 2000; Xu et al., 2007) .\nThe molecular and structural changes that occur in synapses in response to exercise, and their functional consequences, A glutamatergic (excitatory) neuron in the hippocampus, with a long axon (red) and three major dendrites (blue) is shown. During exercise, energy restriction, or when engaged in cognitive challenges, the excitatory neurotransmitter glutamate is released from presynaptic terminals (red) and activates receptors located on postsynaptic spines (black projections on the dendrites). As a result, Ca 2+ influx occurs which then activates signaling pathways that: 1) induce the expression of genes involved in synaptic plasticity and cell survival, including those encoding neurotrophic factors, protein chaperones, and antioxidant enzymes; 2) modify mitochondrial energy metabolism and free radical generation; and 3) trigger Ca 2+ release from the endoplasmic reticulum (ER). The activity and function of glutamatergic neurons is subject to modification by intrinsic interneurons that employ the inhibitory neurotransmitter GABA, as well as by inputs from serotonergic and noradrenergic neurons located in the brainstem and cholinergic neurons in the basal forebrain. The arrows indicate the direction of information flow to and within the glutamatergic neuron.\nare being elucidated. Runner rats exhibit greater short-term potentiation and LTP compared to nonrunner controls (Farmer et al., 2004) . Extracellular recording from CA1 hippocampal neurons revealed that early-phase LTP is impaired in sedentary sleep-deprived rats but is normal in sleep-deprived rats that exercise (Zagaar et al., 2012) . Of note, ''exercising'' neurons without aerobic exercise (by engaging them in intellectual challenges) can also enhance synaptic plasticity (Duffy et al., 2001) .\nNeurogenesis is a process in which neural stem cells cease dividing and differentiate into neurons. The newly generated neurons may then grow axons and dendrites, and form synapses with existing neurons, thereby becoming part of a functional neuronal circuit. The seminal work of van Praag et al. showed that voluntary exercise (wheel running) stimulates neurogenesis in the hippocampus of adult rodents (van Praag et al., 1999) . Electrophysiological recording from newly generated neurons (labeled with a GFP-expressing retrovirus) demonstrated that the new neurons integrate into functional circuits (van Praag et al., 2002) . ER can also increase neurogenesis by enhancing the survival of newly generated hippocampal neurons (Lee et al., 2002) . Exercise and ER may enhance neurogenesis by similar mechanisms involving upregulation of the expression of trophic factors including BDNF, insulin-like growth factor 1 (IGF-1), and vascular endothelial cell growth factor (VEGF) (Lee et al., 2002; Cheng et al., 2003; Joseph D'Ercole and Ye, 2008; Trejo et al., 2008) .\nEvidence suggests that ER and exercise can enhance brain function and may forestall age-related cognitive decline in humans. When the caloric intake of fifty normal elderly subjects was reduced by 30% for 3 months, the performance on memory tests improved significantly compared to two different control diet groups (Witte et al., 2009 ). As recently reviewed by Voss et al. (2011) , epidemiological and controlled interventional trials have demonstrated improvements in cognitive performance in response to regular aerobic exercise in humans. In a study of 1820 adolescents, cognitive performance was significantly better in those engaged in sports compared to those who were less active (Ruiz et al., 2010) . The results of structural MRI studies suggest that the size of several brain regions, including both gray and white matter, is increased by regular aerobic exercise but not by nonaerobic stretching and toning (Colcombe et al., 2006) . The complex cognitive processing of information in the human brain requires the coordinated activation of nerve cell networks in multiple brain regions, and the coincident inhibition of activity in a network called the default mode network (DMN) (Whitfield-Gabrieli and Ford, 2012) . Functional MRI analyses of brain networks in subjects who had spent 1 year in either a group who performed regular aerobic exercise or nonaerobic exercise revealed that aerobic training resulted in greater functional efficiency of cognitive networks including the DMN and the frontal lobe executive network (Voss et al., 2010) . The improved functional connectivity in those who exercised aerobically was correlated with improved performance in tests of executive function.\nA range of cognitive processes may benefit from exercise throughout life, and regular exercise during early life may prevent or delay cognitive decline during late life. Mice that run regularly exhibit improved spatial pattern separation ability, a cognitive process that depends critically upon neurons in the dentate gyrus of the hippocampus (Creer et al., 2010) . Hippocampal neurogenesis may be required for spatial pattern separation and its enhancement by exercise (Sahay et al., 2011) . Exercise can also enhance nonspatial forms of memory as demonstrated in studies of object recognition memory in rats, a process mediated by the perirhinal cortex and hippocampus (Hopkins et al., 2011) . Interestingly, the latter study further showed that rats that had exercised as adolescents and subsequently ceased exercising retained their superior object recognition memory, whereas rats that exercised only as adults rapidly lost their improved object recognition memory within a few weeks of ceasing exercise. This suggests that exercise during a critical period of brain development may foster enhanced cognitive function later in life. Challenging neuronal circuits by exercise and cognitive challenges during this same critical period may provide a ''cognitive reserve'' that protects against deterioration of brain function later in life (Steffener and Stern, 2012) .\nThere are undoubtedly qualitative and quantitative differences in metabolic and physiologic responses to a low-energy flux status (i.e., ER) and a high-energy flux status (i.e., endurance exercise). Data from animal studies indicate that ER can dramatically extend maximal life span and retard aging, whereas exercise has a comparatively little effect on the aging process (Mercken et al., 2012) . Data from clinical studies indicate that, compared to regular exercise, ER may result in more of the same hormonal and physiologic adaptations (e.g., lower core body temperature and lower sex hormones) that typically occur in animals on life-extending ER diets. However, there is considerable overlap in physiological effects of ER and endurance training in humans, including increased insulin sensitivity, reduced central adiposity, and increased heart rate variability. As described in the ensuing sections of this article, both ER and exercise can promote optimal brain function and resistance to age-related diseases, and may do so via both overlapping and complementary mechanisms."}, {"section_title": "Energy Restriction and Exercise Activate Adaptive Stress Responses in Neurons", "text": "The phrase ''That which does not kill me makes me stronger,'' which is attributed to the German philosopher Friedrich Nietzsche, is synonymous with the concept of hormesis (Calabrese et al., 2007) . Numerous adaptive stress-response pathways that mediate hormesis in neurons have been identified. They include signaling cascades within neurons, between neurons, and between glial cells and neurons. Examples of intracellular adaptive stress-response molecules include protein chaperones, antioxidant enzymes, DNA-repair enzymes, and proteins involved in mitochondrial biogenesis. Examples of intercellular adaptive stress-response signals include neurotransmitters, neurotrophic factors, lipid mediators, and gases.\nDuring ER and exercise, many neuronal circuits throughout the brain exhibit greater levels of electrical and synaptic activity than they do in a satiated and resting state (Voss et al., 2010) . Elderly subjects who exercised for 4 months exhibit increased hippocampal blood flow and greater functional connectivity of the hippocampus and anterior cingulate cortex compared to agematched control subjects (Burdette et al., 2010) . Subjects trained to perform a dynamic balancing task exhibit greater frontoparietal cortex network activity that persists for at least one week after training (Taubert et al., 2011) . Interestingly, functional MRI analysis of neural activity in the brains of human subjects during exploration of a virtual reality environment designed to mimic a foraging task in rodents revealed activation of a large network that includes circuits in the entorhinal cortex; hippocampus; and lateral temporal, parietal, and prefrontal cortices (Doeller et al., 2010) . A comparison of brain functional activities in overfed and lean minipigs revealed a relative deactivation of multiple brain regions in the overfed animals, including circuits in the temporal, prefrontal, and insular cortices (ValLaillet et al., 2011) . Thus, both ER and exercise result in vigorous activation of neuronal networks in the brain, particularly neurons in the temporal and frontal lobes, whereas these same neuronal circuits are relatively deactivated in individuals who are sedentary and overfed.\nAs is the case with muscle cells during exercise, when neurons are active they experience considerable energetic and oxidative stress as a result of Na + and Ca 2+ influx and the increased demand for ATP to restore transmembrane ion gradients. Most excitatory synapses in the brain deploy the neurotransmitter glutamate, which activates postsynaptic receptors that depolarize the membrane and trigger Ca 2+ influx through N-methyl-D-aspartate (NMDA) receptor channels and voltage-dependent Ca 2+ channels (Figure 2 ). Ca 2+ promotes oxidative stress by increasing mitochondrial superoxide production and by activating nitric oxide synthase to generate nitric oxide. However, Ca 2+ also interacts with specific binding proteins (e.g., calmodulin) and activates kinases such as Ca 2+ /calmodulin-dependent protein kinase 2 (CaMK2) and mitogen-activated protein (MAP) kinases, which mediate adaptive responses of neurons to glutamate receptor activation including the strengthening of synapses and cellular stress resistance. Downstream of CaMKII and MAP kinases in the glutamate signaling pathway are transcription factors involved in neuronal plasticity and survival including An excitatory synapse is comprised of a presynaptic axon terminal with vesicles containing the neurotransmitter glutamate (red) that is released into the synapse in response to Ca 2+ influx resulting from Na + influx-mediated depolarization of the neuron. Glutamate binds to ionotropic a-amino-3-hydroxy-5-methylisoxazole-4-propionate receptors (AMPAR) and N-methyl-D-aspartate receptors (NMDAR) located at the membrane surface of the postsynaptic dendrite. AMPAR flux Na + resulting in membrane depolarization and opening of NMDAR which flux Ca 2+ , as well as opening of voltage-dependent Ca 2+ channels (VDCC). Within the dendrite, Ca 2+ functions as a second messenger to activate multiple signal transduction cascades including one involving Ca 2+ /calmodulin-dependent kinase (CaMK) and the transcription factor cyclic AMP response element-binding protein (CREB). Ligands that activate receptors coupled to cyclic AMP (cAMP) production (R) also activate CREB; examples include serotonin and glucagon-like peptide 1. CREB induces the expression of multiple nuclear genes that encode proteins involved in synaptic plasticity and cell survival including brain-derived neurotrophic factor (BDNF). BDNF mRNA is then transported to the postsynaptic region of the dendrite where it is translated into BDNF protein which is, in turn, released and activates BDNF receptors (trkB) located on the surface of both the post-and pre-synaptic terminals. One prominent signal transduction pathway activated when BDNF binds trkB involves phosphatidylinositol-3-kinase (PI3K) and Akt kinase. Glial cells (astrocytes and microglia) can modulate synaptic plasticity by producing neurotrophic factors such as fibroblast growth factor 2 (FGF2) and glial cell line-derived neurotrophic factor (GDNF), and cytokines such as tumor necrosis factor (TNFa) and interleukin-1b. In the dentate gyrus of the hippocampus, a brain region critical for learning and memory, resides a population of neural stem cells that are capable of self-renewal (promoted by FGF2) and differentiation into neurons (promoted by BDNF) and astrocytes (promoted by bone morphogenic protein 2; BMP2).\ncyclic AMP response element-binding protein (CREB), nuclear factor kappa B (NF-kB), and AP-1. Gene targets of one or more of these transcription factors include those encoding BDNF, fibroblast growth factor 2 (FGF2), mitochondrial superoxide dismutase (SOD2), and the DNA repair enzymes (Stranahan and Mattson, 2012) .\nNeurotrophic factors play particularly prominent roles in the adaptive and neuroprotective responses of brain cells to exercise and ER (Cotman et al., 2007; Llorens-Martín et al., 2008; Mattson, 2008) . Studies in rodents show that exercise can induce the expression of BDNF, IGF-1, and VEGF in the hippocampus; GDNF in the substantia nigra and striatum; and NGF in the cerebral cortex. ER (alternate day fasting) also stimulates BDNF and FGF2 production in the hippocampus, cerebral cortex, and striatum. In a study comparing subjects who underwent endurance training for 3 months to more sedentary control subjects, BDNF levels were measured in blood samples taken from both the arterial supply to, and venous return from, the brain; the results suggest that endurance training increases BDNF release from the human brain (Seifert et al., 2010) . By increasing BDNF production, exercise and ER may buffer the brain from untoward stress.\nSeveral transcription regulators that are responsive to neurotrophic factors and reactive oxygen species can be induced in neurons by ER and/or exercise ( Figure 3 ). These include cyclic AMP response element-binding protein (CREB), nuclear factor kB (NF-kB), nuclear response factor 2 (Nrf-2), hypoxia inducible factor 1 (Hif-1), and PGC1a (Alberini, 2009; Wareski et al., 2009; ) . These transcription factors induce the expression of genes encoding proteins involved in neuroplasticity and cell survival (Figure 3 ), including antioxidant enzymes (e.g., superoxide dismutases and glutathione peroxidase); antiapoptotic Bcl-2 family members; glutamate receptor subunits; calciumbinding proteins (e.g., calbindin and calretinin); and cell-adhesion proteins (Mattson, 2008) . These pathways are engaged when neurons experience energetic stress across a range of intensities from the mild stress associated with normal excitation, to the moderate stress during exercise and energy restriction, to the severe metabolic stress caused by a stroke or epileptic seizures.\nThe abnormal accumulation of misfolded self-aggregating proteins in neurons is a feature of normal aging that is greatly exacerbated in Alzheimer's and Parkinson's diseases (see section on neurodegenerative disorders below). Protein chaperones function to prevent protein damage and misfolding, whereas proteins damaged beyond repair are removed by the proteasome and autophagy systems (Rubinsztein et al., 2011) . Levels of the cytosolic protein chaperone HSP-70 and the endoplasmic reticulum chaperone GRP-78 are elevated in the cerebral cortex and striatum of rats and mice maintained on an alternate day fasting diet compared to those fed ad libitum . Multiple enzymes of the plasma membrane redox system, which function to suppress oxidative stress (NADH-quinone oxidoreductase 1, NADH-ferrocyanide reductase, NADH-ascorbate free radical reductase, NADH-coenzyme Q10 reductase, and NADH-cytochrome c reductase), are upregulated in brain cells in response to ER (Hyun et al., 2006) . The usual age-related decline in the level of the DNA base excision repair enzyme APE1 is attenuated in the brains of rats maintained on an ER diet (Kisby et al., 2010). ER can also upregulate autophagy, which can enhance the removal of damaged proteins, membranes, and organelles (Alirezaei et al., 2010) . Rats that ran on a treadmill 5 days/week for 3 weeks exhibited increased expression of HSP72 in their brain cells and increased resistance to ischemia-induced brain injury compared to rats that did not run (Chen et al., 2007) . Similarly, regular exercise upregulates heat-shock proteins in neurons, which is associated with resistance to brain injury in an animal model of stroke (Hu et al., 2009; Liebelt et al., 2010) . Running can also enhance the removal of damaged proteins by the proteasome . Thus, exercise and ER enable neurons to ''cleanse'' themselves of damaged organelles and proteins.\nBest known for its role in the bioenergetic responses of muscle cells to exercise, recent findings suggest that PGC1a is also of fundamental importance in adaptive responses of neurons to the mild energetic stress associated with both exercise and ER ( Figure 3 ). Running on a treadmill for 1 hr per day for 8 weeks resulted in upregulation of PGC1a, SIRT1, and the mitochondrial enzyme citrate synthase in many different brain regions (cerebral cortex, hippocampus, cerebellum, midbrain, brainstem, hypothalamus), suggesting a widespread mitochondrial biogenic response to exercise in neural circuits throughout the brain (Steiner et al., 2011) . Treadmill exercise after cerebral ischemia stimulated PGC-1a expression and mitochondrial biogenesis in brain cells of rats (Zhang et al., 2012) , which may contribute to the mechanism by which exercise improves functional recovery in human stroke patients (Luft et al., 2008) . Activation of the Hif-1 and PGC-1a pathways is dependent upon the intensity of the exercise and, in rodents, may be greater in response to forced exercise compared to voluntary exercise (Kinni et al., 2011) . ER can also stimulate mitochondrial biogenesis (Lettieri Barbato et al., 2012) . BDNF can stimulate PGC-1a and mitochondrial biogenesis in neurons, and PGC1a plays a pivotal role in the formation and maintenance of synapses (Cheng, A., Wan, R., Yang, J.L., Kamimura, N., Son, T.G., Ouyang, X., Luo, Y., Okun, E., and Mattson, M.P., unpublished data), suggesting key roles for BDNF and mitochondrial biogenesis in the beneficial effects of ER and exercise on neuroplasticity.\nER may protect mitochondria by a mechanism involving the mitochondrial histone deacetylase SIRT3 and upregulation of SOD2 (Qiu et al., 2010) . Whereas ER can prevent age-related hearing loss in wild-type mice, it does not prevent the hearing loss in mice lacking SIRT3 (Someya et al., 2010) . The latter study provided evidence that SIRT3 protects the auditory cells by deacetylating and thereby activating isocitrate dehydrogenase, resulting in an elevation of NADPH levels and an increased ratio of reduced to oxidized glutathione. Interestingly, genomic analysis of DNA from individuals ranging from 20 to 106 years old revealed that a variant of the SIRT3 gene that lacks an enhancer activity is virtually absent in males over the age of 90 years (Bellizzi et al., 2005) , suggesting a potential role for SIRT3 as a longevity determinant in humans. The enhancement of mitochondrial mass and resilience by exercise and ER may also involve mitochondrial uncoupling proteins such as UCP2 and UCP4 (Andrews et al., 2005; Liu et al., 2006) .\nIn addition to brain-autonomous signaling pathways engaged by ER and exercise, factors derived from peripheral tissues may mediate beneficial effects of exercise and ER on the brain. In this regard, muscle (Pedersen and Febbraio, 2012) and adipocytes (Ahima, 2006) are implicated as sources of neuroactive chemical messengers. So-called myokines that are released from muscle cells in an activity-dependent manner and are known to have neuroprotective and neurorestorative actions in the brain include IGF-1, BDNF, and FGF2. BDNF and IGF-1 can protect neurons against oxidative and metabolic stress and may also promote hippocampal neurogenesis and learning and memory (Mattson, 2008) . FGF2 stimulates the outgrowth of axons and dendrites and the proliferation of neural stem cells. ER and exercise can also increase the production of fatty acids/ketone bodies, which can enter the brain and protect neurons against injury and disease (Maalouf et al., 2009 ). It has also been suggested that yet-to-be-identified ''endurance factors'' released from muscle cells during and after exercise can circulate to the brain and promote neuroplasticity (Kobilo et al., 2011). In response to both ER and exercise, adipocytes release adiponectin (Fontana "}, {"section_title": "Figure 3. Endocrine and Neurochemical Pathways that Mediate Adaptive Responses of Neurons to Exercise and Energy Restriction", "text": "In response to intermittent bouts of vigorous exercise and periods of energy restriction (ER), several prominent signaling pathways are activated in neurons that engender changes in metabolism, functional and structural plasticity, and cellular stress resistance. Collectively, these signaling pathways optimize brain function, reduce neuronal vulnerability to aging and disease, and enhance recovery from traumatic and ischemic insults. During exercise and ER, activity in many neuronal circuits increases and is mediated by glutamate release from presynaptic terminals, which then activates ionotropic glutamate receptors resulting in Ca 2+ influx. Ca 2+ may also be released from endoplasmic reticulum (EndRet) stores. The Ca 2+ then activates kinases such as Ca 2+ /calmodulin-dependent kinases (CaMK) and CaMK, in turn, enhances the activity of the transcription factor cyclic AMP response element-binding protein (CREB) in the nucleus. CREB can also activated by ligands that bind to cell surface receptors that are coupled to the GTP-binding protein Gs which then activates adenylate cyclase resulting in the production of cyclic AMP (cAMP) and activation of protein kinase A (PKA). Glucagon-like peptide 1 (GLP-1) is an example of a hormone/neuropeptide that activates receptors (R) coupled to cAMP production in neurons. Ca 2+ influx may also lead to the activation of the transcription factor NF-kB in the cytoplasm, resulting in the translocation of the active NF-kB into the nucleus. Exercise and ER also increase signaling via receptors for brain-derived neurotrophic factor (BDNF) and insulin or insulin-like growth factor-1 (IGF-1); activation of these receptors engages two signaling cascades in neurons including those involving phosphatidylinositol-3-kinase -Akt, and extracellular signal-regulated kinases (ERKs). The mild stress associated with exercise and ER can also activate the transcription factors nuclear regulatory factor 2 (Nrf-2) and heat-shock factor 1 (HSF-1) by a mechanism involving mitochondrial reactive oxygen species (ROS) and/or depletion of cellular energy substrates. Moreover, exercise and ER can promote mitochondrial biogenesis (upper left) by a mechanism involving a transcription factor called peroxisome proliferator-activated receptor gamma co-activator-1a (PGC-1a). Examples of proteins synthesized from mRNAs upregulated in response to exercise and ER are shown in the region labeled 'protein synthesis' and include: mitochondrial transcription factor A (TFAM); Nrf-2; peroxisome proliferator activator receptor a (PPARa); NAD(P)H:quinone oxidoreductase 1 (NQO1); heme oxygenase 1 (HO-1) ; heat-shock protein 70 (HSP70); BDNF; apurinic/apyrimidinic endonuclease 1 (APE1); Bcl-2; and manganese superoxide dismutase (SOD2). et al., 2010), which promotes b-oxidation and insulin sensitivity in peripheral tissues and may exert neuroprotective actions via AMPK (Qiu et al., 2011) .\nER and exercise result in major changes in endocrine and neuroendocrine systems, a topic reviewed elsewhere (Berggren et al., 2005; Redman and Ravussin, 2009 ). Much of the focus has been on insulin signaling, and the hypothalamic-pituitary system and its peripheral endocrine cell targets (adrenal glands, gonads, and others) and adipose tissue-derived hormones (leptin, ghrelin, adiponectin, and resistin). With regards to neuronal energetics and adaptive stress responses, glucagon-like peptide 1 (GLP-1) is emerging as a hormone with powerful neuroprotective and neurorestorative actions. In response to food ingestion, gut epithelial cells release GLP-1 into the blood, where it acts on liver and muscle cells to increase their sensitivity to insulin (Kim and Egan, 2008) . GLP-1 enters the brain and activates receptors on neurons that are coupled to cyclic AMP production, and cyclic AMP in turn activates CREB resulting in BDNF production ( Figure 3) . Levels of circulating GLP-1 are elevated in response to exercise (Ueda et al., 2009) , and GLP-1 receptor agonists can improve learning and memory performance and may also exhibit anxiolytic and antidepressant actions (Isacson et al., 2011) . Mice lacking GLP-1 receptors exhibit impaired hippocampal synaptic plasticity and impaired learning and memory, demonstrating a critical role for GLP-1 in cognition (Abbas et al., 2009 ). Moreover, GLP-1 and GLP-1 analogs can protect neurons against excitotoxic, metabolic, and oxidative insults, consistent with a potential role for GLP-1 in the neuroprotective effects of exercise and ER.\nA Chronic Positive Energy Balance Impairs Neuroplasticity and Cognitive Function Epidemiological and clinical evidence, and data from studies of animal models, provide abundant evidence that a chronic positive energy balance (CPEB) adversely affects the brain, particularly in the context of advancing age. In a study of 36 healthy adults, a higher BMI was associated with decreased cerebral blood flow in regions of prefrontal cortex involved in executive function, and reasoning (Willeumier et al., 2011) . A diffusion tensor imaging study showed that a high BMI and obesity are associated with reduced white matter integrity in male and female adults (Stanek et al., 2011) . A magnetic resonance spectroscopy analysis demonstrated a highly significant negative correlation of BMI with N-acetylaspartate (an indicator of the metabolic health of neurons) in frontal, parietal, and temporal white matter and frontal gray matter in middle age human subjects (Gazdzinski et al., 2008) . Overweight and obese subjects maintained on ER (low fat or low carbohydrate) for 1year exhibited significantly improved mood, working memory, and speed of cognitive processing compared to their pre-ER baseline performance (Brinkworth et al., 2009) . A CPEB may even adversely affect the brains of individuals who are not overweight; central adiposity is a risk factor for cognitive impairment and probable dementia in normal-weight women (Kerwin et al., 2011) . Genetic factors contribute to CPEB and its adverse effects on the brain. Thus, individuals who are genetically predisposed to obesity because they carry the rs9939609 A allele of the fat mass and obesity-associated (FTO) gene perform more poorly on cognitive tests mediated by the frontal lobes (recall of verbal memories) even in the absence of clinically apparent cognitive impairment (Benedict et al., 2011) .\nIt should be noted, however, that although a CPEB is a risk factor for age-related cognitive decline, long-term underweight in adulthood has also been associated with lower cognitive scores in late midlife (Sabia et al., 2009) . Weight loss late in life is associated with poorer cognitive outcomes (Sturman et al., 2008) , perhaps as a result of underlying disease processes, including AD. The complexity of the issue of body weight and brain function across the life span is highlighted by a study of 2322 participants in the Baltimore Longitudinal Study of Aging. The subjects were followed for an average of 23 years, and the results revealed that both overweight and underweight are associated with the development of cognitive impairment in a sex-and-age-dependent manner (Beydoun et al., 2008) . There may therefore be a window of levels of energy intake and expenditure that promote optimal brain function; an energy balance that results in a BMI between 20 and 24 appears to be optimal for most people eating Western diets. However, it should be noted that in Western societies the majority of individuals with a BMI lower than 20 are not exercising or eating a healthy diet, and have some undetermined chronic inflammatory conditions that increase their risk of death.\nThe numerous beneficial effects of ER on brain health in rodents described above are complemented by data from studies of animal models of CPEB widely used in the neuroscience field, including diet-induced obesity in which wild-type rats or mice are fed a diet high in fats and simple sugars, and genetically modified mice that overeat because they lack functional leptin, the leptin receptor or BDNF. Rats fed diets analogous to the ''fast-food diets'' of humans exhibit impaired hippocampal plasticity and cognitive performance (Stranahan et al., 2008a) . A study of rats showed that the adverse effects of a high-fat diet on an operant-based delayed matching-toposition task were negatively correlated with insulin sensitivity (McNeilly et al., 2011) . However, cognitive impairment caused by a high-fat diet could not be reversed by insulin administration (McNay et al., 2010) .\nAs is the case in other tissues, a CPEB creates an environment in the brain that fosters insidious elevations of oxidative damage and local inflammation. As evidence, leptin receptor mutant (db/db) mice that overeat and are diabetic develop cognitive deficits associated with impaired synaptic plasticity and reduced neurogenesis in the hippocampus (Stranahan et al., 2008b) . The db/db mice exhibit elevated levels of corticosterone, and normalization of corticosterone levels results in a recovery of hippocampal neurogenesis, synaptic plasticity, and cognitive function. Similar to db/db mice, diet-induced insulin resistance in wild-type animals adversely affects cognitive performance by a mechanism involving glucocorticoids (Stranahan et al., 2008b) . Diabetes-induced cognitive deficits can be ameliorated by ER and exercise (Stranahan et al., 2009) . A CPEB may compromise the ability of brain cells to respond to stress adaptively, as indicated by reduced neurotrophic factor signaling, an escalation of oxidative damage, and a chronic inflammatory state (White et al., 2009 ).\nConsumption of a high-fat/high-energy diet for 1 week resulted in impairments of reaction time and attention in cognitive tests in sedentary but otherwise healthy men (Edwards et al., 2011). Longitudinal studies also support a strong association of overweight in midlife and poor cognitive status later in life, with one recent example being a Swedish adoption/twin study of aging (Dahl et al., 2012) . Elderly subjects with diabetes or metabolic syndrome perform worse than controls on the domains of information processing speed and attention and executive functioning (van den Berg et al., 2008) . Some of the detrimental effects of a ''couch potato'' lifestyle on the brain are reversible, whereas others may persist; the duration and magnitude of the CPEB undoubtedly influence the function outcome and underlying pathophysiology. Dietary energy intake and exercise lifestyles that are brain-healthy should be maintained for maximal benefit, because their effects on health indicators reverse rapidly upon transition to a CPEB lifestyle."}, {"section_title": "Lessons from Lifelong Energy Restriction in Nonhuman Primates", "text": "Studies of nonhuman primates have bolstered the evidence that the mechanisms by which energy intake and exercise affect overall health and vulnerability to age-related diseases in rodents are also operative in humans. Much of the data concerning ER in monkeys comes from two major studies of life-long ER (30% reduction in daily calorie intake) that were initiated in young adult rhesus macaques over 20 years ago; one study is at the University of Wisconsin and the other at the National Institute on Aging. Findings from these studies have been reviewed (Ramsey et al., 2000; Ingram et al., 2006) and lead to the general conclusion that ER (with maintenance of nutrition) improves glucose metabolism, suppresses oxidative damage and inflammation, and protects against multiple age-related disorders including cancers, cardiovascular disease, diabetes, and sarcopenia. More recently it was reported that ER reduces deaths from age-related diseases in monkeys (Colman et al., 2009) .\nThe data from studies of the effects of ER on peripheral biomarkers of health and energy metabolism suggest a potential benefit of ER on the brain, and emerging findings support this possibility (Ingram et al., 2007) . In the Wisconsin study of lifelong ER in monkeys, the monkeys on the ER diet had a significant preservation of gray matter volume during aging in several brain regions including the caudate and putamen, the cingulate gyrus, temporal cortex, and dorsolateral frontal lobe (Colman et al., 2009) . Aged monkeys in the ER group exhibited a significantly greater hippocampal volume compared to age-matched monkeys in the control diet group (Willette et al., 2012a) . The latter study further established a positive correlation between insulin sensitivity and gray matter volumes in the frontal and parietal cortices. Analysis of white matter volumes using diffusion tensor imaging revealed preservation of some, but not all, white matter structures by ER; the superior longitudinal and frontooccipital fascicule; the brainstem; and external capsule benefited from ER (Bendlin et al., 2011 ). An additional finding from the Wisconsin cohort of monkeys is that ER results in reduced stress reactivity and preservation of volumes of brain structures involved in emotional control including the prefrontal cortex, amygdala, hippocampus, and hypothalamus (Willette et al., 2012b) . Collectively, the data regarding the effects of ER on the brains of nonhuman primates, though limited, are consistent with findings from animal and human studies that suggest a major beneficial impact of ER on brain structure and stress resistance. Findings described in the next section provide evidence that ER and exercise can also forestall the development of several major neurological disorders and can result in improved outcomes after a stroke or traumatic brain injury."}, {"section_title": "Energy Balance Influences the Vulnerability of the Brain to Injury and Neurodegenerative Disorders", "text": "Each year 15 million people in the world suffer a stroke, of which 5 million die and 5 million are permanently disabled (http://www.strokecenter.org). Traumatic brain injury (TBI) is also a leading cause of death and disability throughout the world. Functional outcome is improved and damage to neurons reduced by ER in animal models of stroke and TBI Mitchell et al., 2010; Rich et al., 2010) . Mice or rats maintained on ER diets prior to experimental stroke or TBI exhibited fewer deficits in motor function (stroke) and cognition (TBI) compared to animals on an ad libitum control diet. Moreover, ER promotes long-term recovery of function over a period of months after experimental stroke (Roberge et al., 2008) or TBI (Plunet et al., 2008) . Enhancement of adaptive cellular stress responses and neuroplasticity is the general mechanism by which ER protects brain cells in these animal models. The neuroprotective factors upregulated by ER include BDNF, fibroblast growth factor 2 (FGF2), the protein chaperones heat-shock protein 70 (HSP-70), and glucose-regulated protein 78 (GRP-78), antioxidant enzymes such as heme oxygenase 1 (HO-1), sirtuin-1, mitochondrial proteins, and proteins involved in DNA repair (Park and Prolla, 2005; Xu et al., 2007; Arumugam et al., 2010; Zeier et al., 2011; Fusco et al., 2012) . On the other hand, levels of inflammatory cytokines and markers of glial reactivity are reduced in the brains of animals on ER diets (Morgan et al., 2007; Arumugam et al., 2010) .\nExercise can also mitigate brain damage and improve the outcome in animal models of stroke and TBI. Rats maintained on a treadmill exercise program exhibit reduced brain damage and improved functional outcome after experimental stroke; the neuroprotective mechanism involves mitochondrial biogenesis (Zhang et al., 2012) . Brain damage is lessened and behavioral deficits ameliorated by exercise in animal models of TBI by a mechanism involving neurotrophic factor signaling and angiogenesis (Griesbach et al., 2007 (Griesbach et al., , 2009 Archer et al., 2012) . Thus, those who exercise regularly are likely to suffer less brain damage and more readily recover from a stroke or TBI.\nAD is contributing greatly to an emerging health care crisis in many industrialized countries. Illustrative is the United States, where over 5 million people have AD and, because of a rapidly expanding aged population, there will be upward of 15 million with AD by 2050. The economic burden of AD is large because patients suffer with the ever-deteriorating symptoms for a decade or more, during which time they usually require constant care for at least 5 years. Multiple structurally and functionally connected brain regions exhibit progressive degeneration and death of neurons in AD, including the entorhinal cortex, hippocampus, basal forebrain, and frontal and parietal cortices.\nAbnormalities that occur in AD, hastened by the aging process, include impairment of adaptive cellular stress responses and neurotrophic factor signaling, oxidative stress, accumulation of extracellular (Ab) and intracellular (Tau) protein aggregates, mitochondrial dysfunction and a cellular energy deficit, Mattson, 2004; Cameron and Landreth, 2010; Kapogiannis and Mattson, 2011) . These pathogenic changes in AD likely begin decades before symptoms appear, highlighting the importance of risk reduction during midlife. Indeed, in a study of patients with dominantly inherited early-onset AD caused by mutations in presenilin-1, the concentration of Ab42 in the cerebrospinal fluid was reduced 25 years prior to expected symptom onset, followed by the appearance of Ab aggregates and brain atrophy 10 years later (Bateman et al., 2012) . Whereas mutations in APP and presenilin-1 can cause early-onset dominantly inherited AD, a mutation in APP that reduces Ab production can reduce the risk of late-onset AD (Jonsson et al., 2012) . If, and to what extent, the latter mutation can counteract the AD-promoting effects of insulin resistance, diabetes, and a CPEB (see next two paragraphs) remains to be determined.\nAs with other major age-related diseases, there is considerable evidence that energy intake and expenditure during adult life influence the risk for AD. Because AD patients typically lose weight early in the disease process, prior to diagnosis, comparisons of body weights in AD patients with age-matched control subjects is problematic. However, individuals who are overweight in midlife are at increased risk for AD (Fitzpatrick et al., 2009; Hassing et al., 2009; Dahl et al., 2012) , with those affected by insulin resistance (de la Monte, 2012) and diabetes (Profenno et al., 2010) being particularly vulnerable. A recent populationbased twin study provided confirmatory evidence that overweight and obesity in midlife predispose to AD . Moreover, overweight patients with mild cognitive impairment (MCI) or AD have significantly lower brain volumes than do their nonobese counterparts (Ho et al., 2010) , suggesting that a CPEB accelerates age-and disease-related deterioration of the brain.\nStudies of AD animal models have shown that energy intake and expenditure can have a major impact on the disease process and cognitive outcomes. The first such evidence came from a study in which it was shown that rats maintained on an alternate day fasting ER diet are resistant to cognitive impairment and hippocampal neuronal degeneration caused by exposure to the amenestic excitotoxin kainic acid (BruceKeller et al., 1999) . Subsequently, it was found that ER can reduce the accumulation of Ab in the brains of APP mutant transgenic mice (Patel et al., 2005; Wang et al., 2005) and old monkeys (Qin et al., 2006) . Moreover, ER beginning prior to the onset of symptoms ameliorates learning and memory deficits in another AD mouse model (APP/PS1/Tau triple mutant mice) (Halagappa et al., 2007) . The latter study showed that whereas both limited daily feeding and intermittent ER (alternate day fasting) prevented cognitive deficits, only limited daily feeding reduced Ab levels; apparently the intermittent ER (IER) diet protected neurons against the cognition-impairing action of Ab. Interestingly, many elderly individuals exhibit extensive Ab deposition (equivalent to that of patients with severe AD) and yet are cognitively normal (Driscoll and Troncoso, 2011) . Future studies may shed light on the possibility that the mechanism by which such individuals ''escape'' AD is similar to the mechanism by which IER protects neurons against Ab toxicity; stimulating adaptive cellular stress responses is one such mechanism (Qin et al., 2008; Stranahan and Mattson, 2012) . In addition, by bolstering neuronal energetics, ketone bodies may contribute to the neuroprotective effects of IER (Maalouf et al., 2009) . In contrast to ER, high-energy diets and diabetes exacerbate brain amyloidogenesis and cognitive deficits in AD mouse models (Ho et al., 2004; Takeda et al., 2010) . Using an ex vivo assay to evaluate insulin and IGF-1 sensitivity in postmortem brain tissue from patients with MCI or AD and age-matched neurologically normal subjects, Talbot et al. (2012) revealed reduced responsiveness to both insulin and IGF-1 in mild cognitive impairment and to an even greater extent in AD. Insulin and IGF-1 resistance were positively associated with oligomeric Ab plaques and were negatively associated with episodic and working memory performance. The mechanisms underlying brain insulin resistance in AD may involve overactivation of glucocorticoid receptors in neurons and impaired neurotrophic factor and stress response signaling (Stranahan and Mattson, 2012) .\nRegular exercise throughout early and midlife may reduce the risk of age-related cognitive impairment and AD (Geda et al., 2010; Buchman et al., 2012) . In addition, exercise programs can enhance cognitive function in subjects at risk for AD, including those with MCI (Heyn et al., 2008; Baker et al., 2010) . A cause-effect relationship between exercise and resistance to AD is suggested by the ability of exercise to retard Ab accumulation and cognitive impairment in mouse models of AD (Cotman et al., 2007) . Exercise can also counteract the adverse effects of a high-energy diet on Ab accumulation and memory deficits in AD mice (Maesako et al., 2012) . Exercise may protect the brain against AD by inducing the expression of BDNF to enhance synaptic plasticity and reduce neuronal vulnerability to oxidative and metabolic stress, enhancing cellular bioenergetics, decreasing Ab production and increasing Ab removal from the brain, and enhancing angiogenesis (Lazarov et al., 2005; van Praag et al., 2007; Gomez-Pinilla et al., 2008; Stranahan and Mattson, 2012 ).\nParkinson's disease (PD) is a progressive fatal movement disorder that involves degeneration of midbrain dopaminergic neurons. Except for rare inherited forms of the disease, the causes of PD are unknown. However, genetic and experimental evidence points to abnormal intracellular accumulation of the a-synuclein protein, associated with dysfunction of mitochondria and the proteasome . As with AD, levels of energy intake and expenditure during midlife may determine if and when PD occurs in some individuals; a CPEB may increase risk (Abbott et al., 2002; Hu et al., 2006; Xu et al., 2010) . In neurotoxin-based rodent models of PD, high-energy diets exacerbate dopamine depletion and neuronal death (Morris et al., 2010) . ER can preserve dopaminergic neurons and reduces function deficits (motor impairment) in mouse and nonhuman primate neurotoxin-based models of PD (Duan and Mattson, 1999; Maswood et al., 2004) . Exercise programs initiated in the early stages of PD can improve quality of life and may slow progression of the disease (Ahlskog, 2011) . Running can ameliorate neurochemical and functional deficits in rodent PD models (Petzinger et al., 2007; Lau et al., 2011) . The beneficial effects of ER and exercise in PD animal models are mediated, in part, by neurotrophic factors including BDNF and glial cell line-derived neurotrophic factor (Maswood et al., 2004) . The impact of varying energy intake and exercise on the molecular pathogenesis of PD (a-synuclein accumulation and mitochondrial and proteasomal abnormalities) remains to be determined."}, {"section_title": "BDNF Signaling in the Brain Mediates Responses of the Cardiovascular and Glucose-Regulating Systems to Energy Intake and Expenditure", "text": "In both animals and human subjects, resting heart rate and blood pressure decrease-and heart-rate variability increases (over periods of days to months)-in response to ER and daily exercise (Iwasaki et al., 2003; Wan et al., 2003) . A relative increase in parasympathetic (acetylcholine) signaling to heart and arterial cells is central to the mechanism by which regular exercise (Shi et al., 1995) and ER (Griffioen et al., 2012) reduce resting heart rate and blood pressure. Rodents maintained on an IER diet exhibit reductions in heart rate and blood pressure and improved cardiovascular stress adaptation (Wan et al., 2003) ; these effects of ER are similar to those observed with endurance training in humans, suggesting shared underlying mechanisms. A recent study showed that long-term ER results in changes in autonomic control of heart rate in human subjects (enhanced parasympathetic activity associated with increased heart rate variability), similar to those observed in rats subjected to IER (Stein et al., 2012) . Limiting energy availability at the cellular level is sufficient to improve indicators of cardiovascular health as demonstrated in rats administered the nonmetabolizable glucose analog 2-deoxy-D-glucose (Wan et al., 2004) , demonstrating that at least some of the beneficial effects of ER and exercise on the cardiovascular system can be induced chemically. Patients with AD, PD, and Huntington's disease (HD) exhibit dysfunction of the autonomic nervous system, which often precedes disease diagnosis, particularly in PD. HD mice exhibit reduced levels of BDNF in several brain regions, which precedes and accompanies progressive degeneration of striatal and cortical neurons; ER can normalize BDNF levels and retard this neurodegenerative process (Duan et al., 2003b) . HD mice also exhibit an elevated resting heart rate that can be normalized by infusion of BDNF into the cerebral ventricles (Griffioen et al., 2011) . Moroever, a-synuclein mutant mice exhibit early autonomic dysfunction, resulting from impaired brainstem cholinergic (parasympathetic) activity, which can be normalized by ER and exacerbated by a high-energy diet (Griffioen et al., 2012) .\nBDNF signaling in the brain can influence peripheral glucose regulation by enhancing insulin sensitivity of liver and muscle cells. Mice with an approximately 50% reduction of BDNF levels (BDNF+/À mice) are hyperphagic and become obese, hyperglycemic, and insulin resistant (Duan et al., 2003a) . Selective complete deletion of BDNF in hippocampal, forebrain, and hypothalamic neurons of adult mice results in obesity associated with large elevations of circulating levels of glucose, insulin, and leptin (Rios et al., 2001) . Subcutaneous administration of BDNF to leptin-receptor mutant diabetic mice results in normalization of blood glucose levels, an effect that persists for several weeks after discontinuation of BDNF treatment (Tonra et al., 1999) . Administration of BDNF, either peripherally or by direct infusion into the brain, increased the hypoglycemic response to insulin in a mouse model of type I diabetes (Nakagawa et al., 2000) . Additional data in the latter study suggest that BDNF signaling in the brain results in improved peripheral glycemic control. ER normalizes plasma glucose and brain BDNF levels in BDNF+/À mice, demonstrating the ability of a dietary intervention to correct the metabolic morbidity resulting from BDNF insufficiency (Duan et al., 2003a) .\nEnergetic Challenge-Based Prescriptions for Brain Health: Possibilities and Barriers Incorporation of intermittent energetic challenges into our daily and weekly schedules should be a guiding principle for achieving optimal brain health. The findings from studies of humans and animal models reviewed above strongly suggest that, if followed, a prescription of IER and regular exercise will improve the health and longevity of the brain and body. Individuals who are overweight and sedentary must reduce their energy intake and engage in regular vigorous exercise in order to improve their brain health and reduce their risk for neurodegenerative disorders. Those of normal weight can expect to optimize the performance of their brain by IER and exercise. There are surely many different variations on the general theme of IER and exercise that will result in improved brain health. Examples of potential prescriptions can be readily incorporated into the work and family life schedules in ways that not only improve (brain) health but also enhance productivity and leisure activities include (1) alternating days of fasting and ad libitum eating, with a daily exercise period; (2) eating only during a short time period each day (e.g., not eating breakfast or lunch) and exercising every other day; and (3) eating in the morning and late afternoon/ evening, and exercising at midday. The impact of such intermittent energetic stress-based regimens on obesity and associated diseases, including neurodegenerative disorders such as AD and PD, could be profound.\nThe conventional ''wisdom'' with regards to the beneficial effects of ER on health and longevity is that an overall reduction in caloric intake is required to accrue the benefits. However, emerging evidence suggests that IER without an overall reduction in calorie intake can improve health and resistance to diseases. For example, it was reported that mice maintained on an alternate day fasting regimen exhibited reduced serum glucose and insulin levels, and resistance of hippocampal neurons to excitotoxic stress, despite maintaining levels of food intake and body weight similar to control mice fed ad libitum (Anson et al., 2003) . Moreover, it was recently shown that timerestricted feeding (TRF) of a high-fat diet without a reduction in daily energy intake protected mice against obesity, diabetes, and the accumulation of fat and inflammatory cytokines (Hatori et al., 2012) . In the latter study, one group of mice was provided with an ''obesogenic'' diet ad libitum, whereas another group was provided the same diet for only an 8 hr period during the active phase of the circadian cycle. Although the mice in the TRF group ate as much food as those in the ad libitum group, they maintained a much lower body weight, and had reduced amounts of body fat. Interactions of signaling pathways involved in the circadian regulation of cellular energy metabolism and adaptive stress responses may mediate the beneficial effects of TRF on body weight control. It will be of considerable interest to understand if and how TRF and IER regimens that do not involve an overall reduction in caloric intake affect brain function and vulnerability to disease.\nWhy have our societies not acted quickly and forcefully to reverse the overt epidemic of metabolic morbidity and its many associated diseases, even as children are afflicted and face lives of extended ill health? The reasons for the increasing number of individuals experiencing a chronic positive energy balance are clear, and yet the solutions to the problem are fraught with resistance from major industries and by reluctance of governments to take charge (Figure 4 ). The promulgation of gluttonous and sedentary lifestyles has resulted from a combination of the following forces: (1) agriculture and food industries that generate sugar-and fat-filled foods, (2) the proliferation of transportation vessels that eliminate the need to walk or ride a bike, (3) the invention of machines to minimize manual labor, (4) computers and an internet that allow many of us to perform our jobs without leaving a chair, and (5) pharmaceutical industries and biomedical research funding agencies that emphasize drug-based cures at the expense of refinement and implementation of primary prevention regimens.\nFood, agriculture, and pharmaceutical industries extol to government officials the benefits of their industry to local economies. The American ''fast-food'' industry netted over 160 billion dollars last year, as did companies that market energy-rich, fiber-, and nutrient-poor foods sold at grocery stores. Pharmaceutical companies have profited most by developing drugs that are taken on a daily basis to relieve the symptoms of chronic disorders that result from overeating and sedentariness. Unfortunately, drug companies have little interest in promoting disease prevention and so pursue a harmful attitude toward health care: ''It's OK that you have developed diabetes, hypertension, cardiovascular disease, arthritis, and a neurodegenerative disorder, because we have pills that can ease your suffering.'' U.S. pharmaceutical companies spend over 200 million dollars annually to lobby congress and support the campaigns of candidates for federal offices. Overcoming the profit-driven forces that antagonize the development of opportunities and incentives for healthy patterns of eating and exercise in daily life is one of the most profound challenges we face as a society (Figure 4) . Equally difficult will be reversing the loss of self-control and discipline of individuals with regards to their own unhealthy CPEB lifestyles. Overeating and obesity can indeed be caused by an addiction to food, as clearly demonstrated by recent functional brain imaging and neurochemical data (Volkow et al., 2011) . Therefore, overweight individuals who are unable to restrict their food intake should be admitted into in-patient rehabilitation centers with the goal of adapting to IER and exercise regimens (Figure 4) .\nThe implementation of prescriptions for intermittent energetic challenges to improve general health and brain health will require determination and an all-out societal effort. Rigorous education of parents and their children, a revamping of medical school training programs, and the development of new standards of care based on primary prevention must occur (Figure 4) . Government intervention will be required to redirect the goals of the agriculture and food industries so that they can profit by producing and marketing fresh fruits and vegetables, and minimally processed whole grain and meat foodstuffs.\nThe successes of biomedical research and pharmaceutical companies in developing surgical procedures and drugs for cardiovascular disease and cancers that retard or cure these diseases are commendable. However, the problem posed by neurodegenerative disorders is fundamentally more technically daunting than the killing of proliferative cells with radiation or drugs that cause DNA damage, or the surgical replacement of a clogged artery with a more normal vessel. How can neuronal circuits involving millions of cells and billions of synapses be restored once they are damaged? Unfortunately, this is unlikely to be accomplished using a drug and, indeed, there are as yet no drugs that can even slow the neurodegenerative process once it has begun. Perhaps someday, stem cell-and neurotrophic factor-based therapies will prove effective in restoring damaged neuronal circuits in the brain. Knowledge gained from biomedical research can provide a workable prescription for optimal brain health (and general health) that should be implemented beginning early in adult life. Effective approaches for intermittent energetic challenges (energy restriction and exercise) must be incorporated into the curriculum at medical schools, and should be practiced by physicians in general practice and specialists who treat diseases associated with a chronic positive energy balance. Interventions would be administered in a manner that results in a high level of compliance. Patients for whom the prescription fails could be referred to inpatient rehabilitation facilities for a sufficient time period for the patient to adapt to a regimen of intermittent energetic challenges. Primary and secondary education of youth should emphasize the importance of intermittent energetic challenges for optimal health, productivity and happiness. Parents should be counseled on their critical role in determining the diet and exercise habits of their children. The government plays multiple roles in promoting optimal brain health of societies through its support of education and biomedical research, and its control of the 'dark, brain-wasting forces' of the food, pharmaceutical, agriculture industries. High energy density addictive fat-and simple sugar-laden foods that are heavily advertised, together with an agriculture industry that dissuades the growing and marketing of vegetables and fruits has resulted in widespread overeating. Because of the development of energy expenditure-sparing technologies (automobiles, mass transit, elevators, computers, etc.), exercise is unnecessary for the vast majority of the population to perform their jobs. The pharmaceutical industry is bolstered by the large market for drugs to treat diseases caused by excessive energy intake and effort-sparing technologies."}, {"section_title": "Medical Education", "text": "In the meantime, pharmaceutical companies should be incentivized to develop agents (natural products or man-made drugs) that mimic the beneficial effects of ER and exercise on health. One such approach would be to identify chemicals that activate adaptive cellular stress-response pathways transiently, thereby enhancing the ability of the individual to function optimally and resist disease. Indeed, preclinical studies have shown that agents that induce a mild transient energetic stress (e.g., 2-deoxyglucose) can protect neurons against dysfunction and degeneration in animal models (Duan and Mattson, 1999) . Perhaps the ''best'' ER mimetic drug so far is rapamycin, a chemical that inhibits mTOR (mammalian target of rapamycin) and mimics ER by suppressing global protein synthesis in favor of selective production of proteins critical for cell survival and plasticity (Inoki et al., 2012) . Rapamycin can extend life span in mice (Wilkinson et al., 2012) and exhibits neuroprotective actions in models of several different neurodegenerative conditions (Boland et al., 2008; Carloni et al., 2010; Spilman et al., 2010) . Rapamycin improves performance in learning and memory tests in young adult mice and prevents cognitive decline in old mice (Halloran et al., 2012) . Interestingly, the latter study showed that levels of serotonin and norepinephrine were elevated in the midbrain of rapamycin-treated mice, changes consistent with antidepressant and perhaps neuroprotective effects of mTOR inhibition. Rapamycin may be particularly effective in counteracting the accumulation of damaged proteins and organelles that occurs in aging and neurodegenerative disorders because, by inhibiting mTOR, both autophagy (Carloni et al., 2010) and proteasomal degradation of ubiquitinated proteins (Chotechuang et al., 2011) are enhanced.\nSeveral naturally occurring chemicals have been identified that can activate neuroprotective adaptive stress-response pathways that are also activated by ER and/or exercise (Son et al., 2010; Jazwa et al., 2011) . Moreover, recent trials in human subjects suggest that certain phytochemicals can indeed activate pathways similar to those activated in response to ER (Timmers et al., 2011) . While finding drugs that precisely mimic the actions of exercise or ER on the brain will be formidable, drugs that affect only one pathway involved in the beneficial effects of exercise and/or ER will likely be valuable for subjects with or at risk for certain disorders associated with sedentary and gluttonous lifestyles. Perhaps cocktails of chemicals can be developed that together more fully mimic the actions of ER and exercise.\nOther drug discovery approaches for primary prevention or early intervention in neurodegenerative disorders include appetite suppressants and agents that improve insulin sensitivity and/or neurotrophic factor signaling. There are many molecular targets that are being pursued for the development of drugs that inhibit food intake including receptors for cannabinoids, serotonin, neuropeptide Y and BDNF. However, as yet such drugs that suppress appetite have been shown to have side effects that preclude their widespread long-term use. An example of a class of drugs originally developed for type 2 diabetes that is now in clinical trials for patients with mild cognitive impairment and early AD are GLP-1 analogs that include Exendin-4/Byetta and Liraglutide. Preclinical studies have demonstrated neuroprotective and neurorestorative therapeutic effects of such long-acting GLP-1 analogs in animal models of diet-induced obesity, AD, PD, HD and stroke (Li et al., 2009 (Li et al., , 2010 Martin et al., 2009; Porter et al., 2010; McClean et al., 2011) . And so, there is optimism for disease-modifying drugs for brain dysfunction caused by a CPEB.\nIn conclusion, there is considerable evidence that intermittent ER and exercise during adult life will reduce the risk for deficits in brain function and neurodegenerative disorders. The cellular and molecular mechanisms by which energy intake and exercise affect neuroplasticity and vulnerability to disease have been partially established and involve either stimulation (IER and exercise) or suppression (overeating and lack of exercise) of adaptive cellular stress response signaling pathways. Optimal brain health may only be achieved by codifying and implementing prescriptions based upon energetic challenges. "}]