[{"section_title": "Financial Management and Portfolio Analysis of Farm and Nonfarm Households", "text": "Household finance is a relatively new field which has recently attracted considerable attention from researchers, policy makers, and individuals. During the last decade, personal financial management predominantly referring to investments in mutual funds and retirement planning has grown in popularity and importance. Optimal asset allocation and portfolio composition of U.S. households have emerged at the forefront of financial research (Shum and Faig, 2006). In response to changing economic conditions and personal preferences, households periodically make adjustments to their asset portfolios. According to aggregate statistics based on the Survey of Consumer Finances, the proportion of stock holdings, business equity, and housing as part of the total asset portfolios for U.S. households has varied significantly over the last decade (Bucks, Kennickell, and Moore, 2006). Individuals find it necessary to educate themselves in the area of personal financial management in order to take advantage of new market products and manage their increasingly complex asset portfolios. Household finance examines questions of how households use financial instruments to achieve their objectives (Campbell, 2006). Several unique features characterize household finance problems: households plan over long but finite horizons, they have non-traded assets such as human capital, and they hold illiquid assets such as housing and real estate. Several studies in the finance literature have shown that most households fail to behave consistently with economic theory when using financial instruments and constructing their investment portfolios (Heaton and Lucas, 2000;Mankiw and Zeldes, 1991;Haliassos and Bertaut, 1995). Financial models predict that households should be exposed to some equity risk, whether public (stock investments) or private (owning a business). However, even among the wealthy households, participation in equity markets is limited and there is a considerable heterogeneity in the share of financial assets held in different asset classes. The limited participation and portfolio heterogeneity are some of the stylized facts of household finance. Household financial management is particularly interesting for farm households. Over ninety percent of the farm businesses are organized as sole proprietorships, establishing a close relationship between the business and the household. As business owners, farm households make joint decisions and asset allocations both on and off the farm. Therefore, examining the portfolio choices of farm households cannot be done without employing a comprehensive framework that considers both on-farm and off-farm asset allocations. There are numerous studies published in the agricultural economics field examining the farm business decisions of farmers, but only a few studies examine their non-farm investments (Mishra and Morehart, 2001;Serra, Goodwin, and Featherstone, 2004). Virtually no studies exist that examine jointly the farm and non-farm asset allocations of farm households. A contribution of this study is to bridge the gap in the literature by examining both the farm and non-farm decision making and asset allocation of farm households using a portfolio approach. The objective of this study is to compare the financial management, asset participation, and portfolio allocation for farm and nonfarm households using two national, representative surveys. In particular, this research will examine how farm and nonfarm households allocate their assets across broad categories such as money market instruments, bonds, equities, real estate, and investments in a private business and how these allocations differ based on the households' wealth distribution. The demographic factors affecting equity investments, including stock holdings and business ownership, will be examined using probit models for the asset participation decision and conditional regression models and quantile regression models for the asset allocation decisions. The results from this study will reveal important insights into the portfolio allocation of farm and nonfarm households."}, {"section_title": "Conceptual Issues and Modeling", "text": "Portfolio allocation refers to the distribution of wealth into various asset classes, including cash, bonds, stocks, real estate, and business equity. According to the efficient portfolio theory, originally developed by Markowitz (1952), investors prefer an efficient portfolio of assets, in other words, a portfolio that can obtain the highest expected return for an acceptable level of risk. The portfolio theory, also known as mean-variance analysis, assumes that investors are risk averse and rational. In addition, business owners are often assumed to be more willing to accept financial risk, and therefore, may have portfolios with different asset composition. Business ownership has seldom been included when studies analyze portfolio allocation of traditional assets such as cash, stocks, bonds, and real estate, because data on business ownership is less available and businesses are more difficult to value (Gutter and Saleem, 2005). One of the strengths of this study is that business ownership is also included when considering the asset allocation of household portfolios. This study will examine the portfolios of assets for farm and nonfarm households. Two primary questions will be considered: the first one is examining how many households participate in these asset markets, and the second question is studying the fraction of assets that the households allocate to each category given that they decide to participate. Probit models will examine the participation decisions and conditional regression models will examine the asset allocation decisions conditional on participation. The analyses will concentrate on exploring the effects of wealth and other demographic characteristics on the participation and asset allocation decisions of households. The asset allocations of household portfolios are examined using conditional regression models and quantile regression models. While OLS regression models describe the mean effects of demographic variables on the portfolio shares of different assets, quantile regression models can detect if these effects are different for households with different holdings of a particular asset. It is expected that the demographic effects for households with largest or lowest holdings of a particular asset may be different thus necessitating the use of quantile regression methods. Koenker and Basset (1978) describe the general quantile regression model as follows: where y i denotes the portfolio share of a particular asset for household i , x i is a vector of demographic explanatory variables, β θ is an unknown vector of regression parameters associated with the θ th quantile (0<θ<100) of the conditional distribution of y i , and e θi, is an unknown error term. The conditional quantile function can be expressed as Thus, the quantile regression estimator ˆ is the solution to the following minimization problem: (3) The coefficient ˆ can be interpreted as the marginal change in the portfolio share of an asset from a marginal change in the x i demographic variable conditional on being in the θ th quantile. This study considers five quantile regressions at the 10 th , 25 th , 50 th , 75 th , and 90 th quantiles of asset holdings. The quantile regressions will show if the average demographic effects are also present for household with low or large holdings of particular assets, in other words, if high equity holding households exhibit similar behavior to their low equity holding peers."}, {"section_title": "Data", "text": "The farm household data are obtained from the Agricultural Resource Management Survey (ARMS), which is conducted annually by the U.S. Department of Agriculture. The nonfarm household data are obtained from the Survey of Consumer Finances (SCF), which is conducted triennially by the Federal Reserve Board. The most recently available 2004 data for the SCF contain information for 4,474 nonfarm households (after excluding farm households) representing 111,380,760 nonfarm households in the U.S. The 2003 ARMS data are used in this study because they include detailed portfolio allocation questions (including holdings in bank accounts, stocks, and bonds). The 2003 ARMS data (the main version of the survey) include 6,048 farm households, representing 2,081,500 farm households in the U.S. The assets for each household are divided into several asset groups using the definitions from the Survey of Consumer Finances (Bucks, Kennickell, and Moore, 2006). Financial assets include cash (cash, checking, savings, and money market accounts), bonds (certificates of deposit, savings bonds, and government securities), stocks (corporate stock, mutual funds, and cash surrender value of life insurance), retirement (IRA, Keogh, 401k, and other retirement accounts) and other financial assets. Nonfinancial assets include houses (primary owner-occupied housing), other real estate (second homes and land), business equity, and durable goods. Assets for farm households are usually grouped into farm and nonfarm assets, but for comparison purposes, they were re-grouped as financial and nonfinancial assets. The definitions of asset classes outlined in the survey questionnaires match fairly well for farm and nonfarm households. The main difference between the SCF and ARMS data is in the treatment of business equity. For farm households, the primary residence and farmland are considered farm assets and as such are included in business equity, while for nonfarm households residence and real estate are not included in business equity. These differences are taken into account when the two types of households are compared."}, {"section_title": "Results", "text": "Descriptive statistics for the two data sets are shown in tables 1 and 2. The tables show the asset allocation and portfolio shares for all households, the participation rates in each asset, and the asset allocation and portfolio shares for the households that participate in a given asset group. Both means and medians are presented for each category. Differences between the mean and the median likely reflect the heterogeneity of households as well as the influence of extreme observations. Unlike using means, medians are not additive in a sense that the sum of the medians of two items for a common population is not generally equal to the median of the sum. Farm households have mean assets of $813,640 and median assets of $512,750, which is higher that the mean assets of $522,359 and median assets of $168,162 for nonfarm households. Nonfarm households generally have higher rates of participation in financial assets than those for farm households. Most households have safe liquid accounts and about a quarter to half of them participate in bonds, stocks, and retirement accounts. The portfolio shares for financial asset groups are relatively low (less than 10%) when all households are considered, and even for participating households, these portfolio shares remain relatively low (not exceeding 20%). Participation in stock markets is higher for nonfarm households (45%) than for farm households (29%). In addition to higher participation rates in public equity markets, stock-based assets have a higher portfolio share for all nonfarm households (6%) than all farm households (2%). Even conditional on participation, stocks have higher portfolio shares for participating nonfarm households (13%) compared to participating farm households (8%). Farm and nonfarm households exhibit different participation and allocation trends with respect to nonfinancial assets. Participation rates in housing are a bit higher for farm households (75%) than nonfarm households (69%), but housing accounts for only 17% of the assets in the portfolios of farm households while it has a dominant share (42%) in the portfolios of nonfarm households. Only 11% of the nonfarm households have businesses, and the portfolio share of business equity is 3% for all nonfarm households. For nonfarm business owners, the portfolio share of business equity is 28%. On the other hand, farm households have 69% of their assets invested in their farm businesses (or 52% if housing is excluded from business equity). Business equity clearly dominates the portfolios of farm households."}, {"section_title": "Wealth Effects", "text": "Wealth is one of the most important household characteristics indicating willingness to take financial risk and/or ability to make investments in diverse assets. Because wealthy households can have overwhelming influence on aggregate statistics, the portfolio choices of households were examined conditional on different levels of wealth. Households were grouped into 10 groups to investigate how participation rates and portfolio shares differ based on their wealth. Following Campbell (2006), the groups are based on the percentile of total assets. For farm households, the least wealthy (10 th percentile) households have $183,383 in assets, the typical, median household has $512,750, and the wealthiest (90 th percentile) group of households has $1,731,101 in total assets. The poorest 10 th percentile, the median, and the wealthiest 90 th percentile of nonfarm households have $4,070, $168,162, and $976,740 in total assets, respectively. These percentile cutoff points indicate that at these corresponding percentiles of the respective populations, farm households are better off in terms of total assets than their nonfarm counterparts. Using groups based on percentile cutoff points emphasizes comparisons based on wealth (from poorest, to median, to wealthiest households) within each of the farm or nonfarm groups. Alternative classification can be constructed where households are assigned to groups with fixed cutoff points of total assets and the trends and major conclusions remain similar. Figure 1 graphically represents the effects of wealth on the participation rates and portfolio shares of households. The horizontal axis shows the percentile distribution of total assets and the vertical axis represents either the fraction of households that participate in a specific asset or the portfolio share allocated to each asset group. Nonfarm households generally tend to show more variation from the poorest to wealthiest groups than farm households, both in terms of asset participation and asset allocation. Safe assets play a dominant role for the poorest nonfarm households: 57% of them use safe liquid assets and these safe assets comprise the largest share in their portfolios (42%). Given that these poorest households have negligible amounts of assets, it is not surprising that most of them do not participate in risky financial markets. Even though standard finance theory suggests that households should invest in at least some amount risky assets if the expected return is positive, it is likely that the fixed costs of participation deter these households from diversifying their portfolios. Real estate, and in particular owner-occupied housing, plays a dominant role for middle-class nonfarm households. For the median group of nonfarm households, 95% of them have real estate, which comprises 74% of their asset portfolios. Both stock and business equity play more important role for richest group of nonfarm households. Participation rates for the richest households increase to 84% for stock equity and 40% for business equity but the portfolio shares of stock equity (11%) and business equity (12%) are still relatively low. Farm households exhibit differences in participation rates from poorest to richest groups, but the variation among farm households of different wealth is lower than the variation for nonfarm families. Participation rates are twice higher for bonds (from 13% to 30%) and for retirement assets (from 27% to 53%) and three times as high for stocks (from 14% to 49%) from poorest to richest farm households. Portfolio shares for bonds (about 1%), stocks (about 2%), and retirement assets (about 4%) are similar for farm households of different wealth. Because farming is a real estate intensive business, farm households have almost universal participation rates in real estate and strong participation rates in housing (about 80%). On average, 57% of farm assets are allocated to real estate. The portfolio shares of real estate are fairly similar across the wealth distribution but the proportion of housing and farmland changes from poorest to richest farm households. For the poorest households, housing has a higher proportion of the real estate holdings (27%) than for the richest households (5%), while this trend is reversed for farmland holdings. The share of business equity is also relatively similar across the wealth distribution (from 74% for the poorest to 66% for the richest farm households). Excluding real estate (residence and farmland), other business equity is also stable at 10% from poorest to richest households. In general, participation rates increase with wealth for financial assets (stocks, bonds, and retirement assets) but are relatively similar for nonfinancial assets (real estate and business equity). The portfolio shares are similar along the wealth distribution for both financial and nonfinancial assets. Participation in equity markets, although emphasized by textbook financial models, is far from universal, even for households with large asset holdings. At the lowest end of the wealth spectrum, only 9% of nonfarm and 14% of farm households invest in stocks, whereas of the wealthiest households, 84% of nonfarm and 49% of farm households participate in public equity markets. As we move across the wealth distribution, an increasing fraction of households participate in equity markets, but this trend is weaker for farm than nonfarm households. These findings of limited participation in public equity markets among the wealthy present a significant challenge to the financial theory and are one of the stylized facts of household finance. Private business equity can substitute for the exposure to risk of public equity, which can explain some of the nonparticipation in public equity markets by wealthy households (Heaton and Lucas, 2000). These substitution effects may also explain the fact that farm households have lower participation rates and portfolio share rates for public equity because they are business owners. Private business owners represent only 10% of the population but hold as much as 40% of the total net worth of the population (Gentry and Hubbard, 2004). Therefore, the financial investments of these households have a disproportionately large influence on the aggregate asset demand and hence on asset pricing."}, {"section_title": "Demographic Effects", "text": "Wealth is not the only household characteristic that may predict its willingness to assume financial risk, by holding public and private equity. Other demographic variables also influence household decisions about participation and portfolio allocation in various assets. The models here examine portfolio choices of risky assets, including stock holdings and business ownership. Probit models are estimated for the participation decisions and conditional regression and quantile regression models are estimated for the portfolio allocation decisions of participating households. Several demographic effects are considered including age, education, marital status, family size, income, and wealth, based on previous studies of household finances (Campbell, 2006;Shum and Faig, 2006;Gutter and Saleem, 2005). Table 2 summarizes the demographic effects on asset participation for farm and nonfarm households. The probit models for the decision to hold stocks show more significant demographic effects for nonfarm than for farm households. For nonfarm households, age and education increase the likelihood of stock market participation and family size reduces the likelihood of having stocks. The results also show a positive wealth effect similar to the findings from the previous section. The positive coefficients for household income and wealth are consistent with the predictions of calibrated versions of normative models of portfolio choice. Generally, the results reported here for nonfarm households are similar to the findings of Shum and Faig (2006) and Poterba and Samwick (1997). Not many demographic factors affect participation in stock markets for farm households. Only education and marital status affect whether farm households invest in stocks. Heads of households are more likely to hold stocks if they have college education or are married. Surprisingly, age, income, and wealth do not affect stock participation for farm households. As in the previous section, farm households show less variation based on demographic characteristics than nonfarm households. A probit model for private business ownership is estimated only for nonfarm households. Because all farm households have a business, a probit model examining whether households own a business will not be feasible to estimate for them. The results for nonfarm households show that age has a hump-shaped effect, reflecting the tendency for younger households to acquire and older households to sell off private businesses. Household heads that have a college education are more likely to own a business while married individuals are less likely to be business owners. Wealthier nonfarm households are more likely to have a business, similar to the findings of Gentry and Hubbard (2004), Milligan (2005), Quadrini (2000), and those from the previous section of this study. The conditional OLS models for portfolio shares of stock and business equity of participating households are presented as the first column of results in tables 3-6. Similar to the probit results for stock participation, the findings indicate that there are fewer significant demographic effects on the portfolio shares allocated to stock assets for farm than for nonfarm households. The only significant demographic variable for the stock holdings of farm households is education; household heads with college education are not only more likely to hold stocks (from the probit model results) but they also tend to have higher proportion of their assets invested in stocks conditional on participation. Other demographic factors do not seem to affect the portfolio shares of stock holdings for farm households. Unlike farm households, demographic variables affect the asset allocation of stock holdings for nonfarm households. The portfolio share allocated to stocks first declines with age and then increases for older households. Households without college education, those that are married, and those having smaller families have larger shares of their portfolios allocated to stock holdings. Economic variables such as income and net worth do not seem to affect the portfolio share of stock investments, when estimated with OLS regression. The portfolio shares of business equity for both farm and nonfarm households are affected by several demographic factors. For farm households, farm business equity has a significantly higher share in the asset portfolios for younger and older households. Farm households with higher incomes tend to have lower portfolio shares allocated to their farm businesses, possibly indicating the presence of off-farm employment. On the other hand, farm households with higher wealth accumulations tend to have higher shares of business equity in their asset portfolios. For nonfarm households, age does not seem to affect the proportion of assets allocated to business equity. Unlike for farm households, income does not affect the portfolio share of business equity for nonfarm households. Nonfarm households with higher net worth tend to allocate more assets to their businesses, consistent with the findings of Gentry and Hubbard (2004) and the results from the previous section. Demographic variables may have different effects on the portfolio shares depending on the position of the household on the portfolio share distribution. Households at the left tail of the distribution of portfolio shares rates are those with low portfolio shares of stock and business equity while households at the right tail of the distribution have high shares of these risky assets. Quantile regression can be used to determine the effects of the demographic variables on the portfolio shares of equity for low-, medium-, and high-equity holding households. With respect to the portfolio shares of stock equity, quantile regression results do not offer further insights into the stock holdings for farm households. While some quantile regression coefficients are significantly different from the OLS coefficients, the coefficients for most variables are still not significantly different from zero. However, some interesting findings emerge for nonfarm households. It seems that most of the significant results in the OLS regressions are driven by households who already allocate large shares of their portfolios to stocks. In other words, the mean effects of the demographic variables produced by the OLS model are strongly influenced by the behavior of the household with the largest portfolio shares allocated to stock holdings. The effects of income and wealth on stock holdings differ for households with low and high stock investments, resulting in insignificant coefficients for the OLS model. For nonfarm households with small shares of stock investments, higher income is associated with an increase in the stock holdings, while this effect is insignificant for households with large shares of stock holdings. Likewise, an increase in wealth produces further increases in stock holdings for nonfarm households with large holdings of stocks, as shown by the positive and significant quantile coefficients for the 50 th , 75 th , and 90 th quantiles. However, for households with lowest stock holdings (the 10 th quantile), wealth has a negative effect on portfolio shares allocated to stocks. Overall, the effects of the demographic variables differ along the quantiles of stock holdings for nonfarm households. In addition, nonfarm households with large stock holdings show dominant influence on the mean effects from the OLS model. With respect to the portfolio shares of business equity, quantile regression results offer further insights into the different effects of the demographic variables depending on the location in the quantile distribution. Some of the mean demographic effects shown by the OLS regression are influenced by households with large shares of assets allocated to business equity. For example, education and marital status of farm households and education for nonfarm households only affects the equity holdings of households with high equity holdings. In addition, income has a negative effect on the share of business investments, across all quantiles of farm households. For nonfarm households with low share of business investments, higher income is associated with an increase in the business holdings. For households with large business investments, this effect is negative, resulting in an insignificant OLS coefficient. Overall, the quantile regression results generally show that the demographic variables (age, college, marital status, family size) do not have significant effects on the portfolio shares of stock or business equity for households with low holdings. Most of the significant demographic effects are for nonfarm households with large shares of public and private equity and for farm households with large shares of business ownership. These results show the overwhelming influence of the households with large holdings on the aggregate, mean statistics."}, {"section_title": "Conclusions and Policy Implications", "text": "This study examines the financial management and portfolio allocation of assets for farm and nonfarm households using the Agricultural Resource Management Survey and the Survey of Consumer Finances data sets. Participation rates and portfolio shares for various asset groups including stock, bond, and retirement accounts, housing, real estate, and business equity are compared for farm and nonfarm households. The results show that the effects of wealth on participation rates and portfolio shares are stronger for nonfarm than for farm households. Probit models for the participation rates and conditional regression and quantile regression models for the portfolio shares allocated to risky assets are estimated. Several demographic effects are considered, including age, education, marital status, family size, income, and wealth. The findings also indicate that, in comparison to nonfarm households, there are fewer demographic factors affecting stock holdings for farm households. The demographic variables have strong effects on businesses equity shares for farm and nonfarm households. The quantile regression results show that most of the significant demographic effects are for nonfarm households with large shares of public and private equity and for farm households with large shares of business ownership. These results also show that the mean effects of the OLS results are strongly influenced by households with large equity holdings. The insights from this study contribute to the understanding of farm household behavior. Some of the stylized facts of household finance, such as the limited participation in equity markets (even among the wealthy) and the heterogeneity of the assets in their portfolios are also confirmed for farm households. In comparison to nonfarm households, farm households tend to participate less in financial assets and more in nonfinancial assets, and show less heterogeneity with respect to their portfolio composition of different assets. It was also shown that the aggregate or mean statistics were overwhelmingly influenced by wealthy households and that these statistics were less representative of the typical, median household. While the behavior of wealthy households is disproportionately important for asset pricing models, household finance is more concerned with the behavior and welfare of the typical household. These trends also hold for farm households. The growing interest in the household finance field, and more specifically, in personal financial management has been driven by the practical interest of individuals seeking optimal allocation of their assets. Financial portfolio management is even more complex for farm households, who have a close financial and decision making interaction between their business and their household. The limited participation by farm households in financial assets such as stock and bond holdings and retirement funds can be explained partially by substitution effects from business equity and real estate investments. Most farm households' assets are held in real estate and business equity, thus, their financial portfolios are not very diversified. The limited participation in risky asset markets and the lack of diversification of risky portfolios are often labeled as investment -mistakes‖ in the household finance literature (Campbell, 2006). Farm households, similar to other households, will benefit from educating themselves in the area of personal financial management in order to take advantage of new financial products and services and manage their complex business-household portfolios.   Note: Standard errors are in parentheses and † and * denote coefficients that are significantly different from the OLS coefficients and zero, respectively, at the 5% significance level. Note: Standard errors are in parentheses and † and * denote coefficients that are significantly different from the OLS coefficients and zero, respectively, at the 5% significance level. Note: Standard errors are in parentheses and † and * denote coefficients that are significantly different from the OLS coefficients and zero, respectively, at the 5% significance level. "}]