[{"section_title": "Abstract", "text": "Socioeconomic and gender group differences in early literacy skills: a multiple-group confirmatory factor analysis approach, Educational Research and Evaluation: An International Journal on Theory and Practice, 21:1, 40-59, DOI: 10.1080/13803611.2015.1010545 To link to this article: http://dx.doi.org/10.1080/13803611.2015.1010545\nTaylor & Francis makes every effort to ensure the accuracy of all the information (the \"Content\") contained in the publications on our platform. However, Taylor & Francis, our agents, and our licensors make no representations or warranties whatsoever as to the accuracy, completeness, or suitability for any purpose of the Content. Any opinions and views expressed in this publication are the opinions and views of the authors, and are not the views of or endorsed by Taylor & Francis. The accuracy of the Content should not be relied upon and should be independently verified with primary sources of information. Taylor and Francis shall not be liable for any losses, actions, claims, proceedings, demands, costs, expenses, damages, and other liabilities whatsoever or howsoever caused arising directly or indirectly in connection with, in relation to or arising out of the use of the Content.\nThis article may be used for research, teaching, and private study purposes. Any substantial or systematic reproduction, redistribution, reselling, loan, sub-licensing, Socioeconomic status and gender are important demographic variables that strongly relate to academic achievement. This study examined the early literacy skills differences between 4 sociodemographic groups, namely, boys ineligible for free or reduced-price lunch (FRL), girls ineligible for FRL, boys eligible for FRL, and girls eligible for FRL. Data on kindergarteners (N = 462) were analysed using multiplegroup confirmatory factory analysis. Early literacy skill differences between boys and girls are more nuanced than previously reported; subsidy status and gender interact. Both boys and girls from high-poverty households performed significantly lower than the girls from low-poverty households in alphabet knowledge, phonological awareness, and spelling. There were gender gaps, with a female advantage, among children from high-poverty households in alphabet knowledge and spelling and among children from low-poverty households in alphabet knowledge. These results highlight the importance of employing methodologically sound techniques to ascertain group differences in componential early literacy skills."}, {"section_title": "Introduction", "text": "One of the most pressing issues in the United States education system is the achievement gap between socioeconomically disadvantaged students and their counterparts (e.g., Brooks-Gunn & Duncan, 1997; Entwisle, Alexander, & Olson, 2007) . For example, the nation's report card on reading reveals substantial disparities between the socioeconomic status (SES) groups where a higher percentage of students from low-SES backgrounds in Grades 4 and 8 scored lower in reading than their counterparts (Lee, Grigg, & Donahue, 2007) . Additionally, the achievement gap has also been linked to gender differences (Entwisle et al., 2007) .\nThe achievement gap begins early (Arnold & Doctoroff, 2003; Chatterji, 2006; West, Denton, & Germino-Hausken, 2000) . Mounting evidence from the national Early Childhood Longitudinal Study Kindergarten (ECLS-K) data suggests that SES predicts the entry-level literacy skills and early reading growth (Chatterji, 2006; McCoach, O'Connell, comprising alphabet knowledge, phonological awareness, and print concept were generally invariant for both male and female students (N = 4,518). However, group mean differences in early literacy skills were not examined.\nGiven the limited research on the differential early literacy achievements between SES and gender groups among kindergarteners, the protracted stability of literacy skills in individuals (Francis et al., 1996) , and the importance of research on the achievement gaps (Gamoran, 2007) , the primary aim of the present study was to ascertain whether measurement equivalence of the early literacy measures between groups exist; after establishing measurement equivalence, the second aim was to examine the group mean differences namely between four groups: boys ineligible for free or reduced-price lunch (FRL), girls ineligible for FRL, boys eligible for FRL, and girls eligible for FRL. Data analysis was conducted using multiple-group confirmatory factor analysis (MGCFA; see Data analysis section for further details) to determine the (un)biased effects of the measures between groups."}, {"section_title": "Theoretical framework Componential skills of early literacy", "text": "According to Snow (2006) , literacy is \"the product of an array of componential skills, all of which are necessary to high-level performance\" (p. 277). A recent meta-analysis (National Early Literacy Panel [NELP], 2008) reported that the following six components of early literacy skills consistently predict later conventional literacy skills in moderate or strong correlations: alphabet knowledge, phonological awareness, rapid automatized naming of letters or digits, rapid automatized naming of objects or colors, writing and name writing, and phonological memory. Similarly, Schatschneider, Fletcher, Francis, Carlson, and Foorman (2004) reported that letter-name and letter-sound knowledge, phonological awareness, and naming speed are the most important kindergarten predictors of reading skills. For the purposes of developing a theoretical framework of early literacy skills, we borrowed Snow's (2006) definition of componential skills and the work of the NELP and Schatschneider et al. on the early literacy predictors of conventional literacy skills. We selected the following early literacy constructs for this study: alphabet knowledge (i.e., letter-name fluency and letter-sound fluency), phonological awareness (i.e., blending and elision), and spelling (i.e., real words and pseudowords). To date, these componential early literacy skills have not been examined in tandem in a multiple-group analysis comprising both SES and gender groups. Adams (1990) suggests that naming the alphabetic letters with accuracy and speed is an index of automatic letter recognition. Accuracy and speed characterize the fluency construct (Speece, Mills, Ritchey, & Hillman, 2003) . Letter-name fluency measured in kindergarten uniquely contributes to word reading (r = .69); it is able to identify 86% of the children who would eventually end up being poor readers in Grade 1 (Speece et al., 2003) . Speece et al.'s (2003) finding corroborates with O'Connor and Jenkins ' (1999) finding that the timed letter-knowledge task is a strong discriminator of good readers versus poor readers. Given that the predictive validity of letter-name fluency measured at the end of kindergarten is most optimal in relation to the substantial reduction in floor effects from the fall to the spring of kindergarten (Catts, Petscher, Schatschneider, Bridges, & Mendoza 2009), letter-name fluency is a more viable measure than letter-name knowledge at the end of kindergarten."}, {"section_title": "Alphabet knowledge", "text": "Contrary to letter-name fluency, there are fewer studies that examine the contribution of letter-sound fluency in early literacy acquisition (Al Otaiba et al., 2010; Fuchs et al., 2001; Ritchey & Speece, 2006) . Ritchey and Speece (2006) demonstrated that letter-sound fluency contributes significant unique variance in word reading and spelling measures at the end of kindergarten above and beyond letter-sound accuracy. In addition, both accuracy and fluency measures of letter sound accounted for 53.9% unique variance in predicting spelling, while the accuracy and fluency measures of letter name contributed 40.6% (Ritchey & Speece, 2006) . Similarly, Al Otaiba et al. (2010) and Ritchey (2008) have shown that letter-sound fluency is a strong predictor of kindergarten spelling with r = .65 and r = .81, respectively. Ritchey and Speece also reported that higher growth rates in letter-sound fluency were related to better performance in reading."}, {"section_title": "Phonological awareness", "text": "Phonological awareness encompasses the ability to detect, manipulate, or analyse sounds in spoken language in varying complexities such as words, syllables, and phonemes (Blachman, 2000; NELP, 2008) . Numerous research studies (e.g., Byrne & Fielding-Barnsley, 1993; Schatschneider et al., 2004; Wagner et al., 1997) , reviews (e.g., Blachman, 2000) , and policy-motivated syntheses (NELP, 2008; National Reading Panel [NRP], 2000) have shown that children's phonological awareness is crucial for the acquisition of subsequent literacy skills. NELP's (2008) synthesis suggests that phonological awareness in kindergarten or earlier is moderately related to decoding (r = .40), spelling (r = .40), and reading comprehension (r = .44). Problems in acquiring phonological awareness in the early stages of literacy acquisition can result in reading difficulties or reading disabilities, which in turn has a cumulative effect in subsequent grades (Blachman, 2000; MacDonald & Cornwall, 1995; Wagner et al., 1997) .\nTwo measures from the Comprehensive Test of Phonological Processing (CTOPP; Wagner, Torgesen, & Rashotte, 1999) were used. The Blending Words subtest assessed the students' ability to orally blend larger to smaller units of words (i.e., compound words, syllables, onset rimes, and phonemes). For example, students were required to blend /c/ /at/ and to respond \"cat.\" The possible range for the Blending Words subtest is 0-20. The Elision subtest assessed the students' ability to delete words, syllables, or phoneme(s) from orally presented words. For example, students were required to say \"meat\" without /m/. The possible range for the Elision subtest is 0-20. The test-retest reliability for both subtests is .88."}, {"section_title": "Spelling", "text": "The relations between phonological awareness, alphabet knowledge, and spelling are well established (e.g., NRP, 2000; Santoro, Coyne, & Simmons, 2006) . Letter-name knowledge, letter-sound knowledge, and phonological awareness impact children's ability to write letters and to spell (Ritchey, 2008) . Alphabet knowledge has been reported to be the strongest predictor of spelling (r = .54; NELP, 2008) . In addition, the relation between spelling and later reading success is also well supported (e.g., Ehri & Wilce, 1987; NELP, 2008) . For instance, NELP (2008) reported that spelling measured in kindergarten or earlier is strongly correlated with conventional literacy skills such as decoding (r = .60) and spelling (r = .78).\nThe present study SES is a persistent correlate of early literacy outcome (e.g., Chatterji, 2006) . However, findings on gender gap in literacy skills are more inconclusive (e.g., Entwisle et al., 2007; Matthews et al., 2009) . Additionally, few studies have examined these two sociodemographic groups simultaneously in the same model. Given these reasons and the importance of establishing measurement invariance in early literacy skill differences between sociodemographic groups (Byrne & Watkins, 2003) , we determined the measurement invariance in early literacy skill differences between boys ineligible for FRL, girls ineligible for FRL, Educational Research and Evaluationboys eligible for FRL, and girls eligible for FRL. We used multiple-group confirmatory factor analysis to achieve this purpose. We also examined the latent means differences once the measurement invariance was established. In summary, we addressed the following questions:\n(1) Are the indicators of alphabet knowledge, phonological awareness, and spelling measured in the same way for boys ineligible for FRL, girls ineligible for FRL, boys eligible for FRL, and girls eligible for FRL? Are the early literacy latent constructs generalizable across these groups? (2) Do the interrelations of the latent factors of early literacy skills vary across the four groups namely, boys ineligible for FRL, girls ineligible for FRL, boys eligible for FRL, and girls eligible for FRL? Are the factor structures of the latent factors more strongly correlated in one group than another? (3) What are the factor mean differences in early literacy skills between boys ineligible for FRL, girls ineligible for FRL, boys eligible for FRL, and girls eligible for FRL?\nThe spelling measure included six decodable real words (dog, man, plug, went, limp, and tree) and four decodable pseudowords (ig, sut, frot, and yilt; Byrne & Fielding-Barnsley, 1993) . Research assistants provided lined answer sheets and instructions saying:"}, {"section_title": "Method Participants", "text": "This study used existing data collected in a larger study of response to early literacy instruction that was conducted with funding from the National Institute of Child Health and Human Development. In this larger study, 10 schools in one school district in a southeastern US city were recruited with help from district personnel to include a sample of diverse sample of students. Specifically, the study focused on improving reading outcomes for students who were considered at risk for reading difficulties because of their socioeconomic status or minority status. The present study involved a sample of 462 kindergarteners from 10 public elementary schools. Parental consents had been obtained during a larger study (Al Otaiba et al., 2011) . The demographics of the participants were consistent with the recruitment for the larger study in terms of demographics: mean age at initial testing (M = 5.56 years, SD = .35); male (54.5%); Black (58.9%); White (31.4%), American Indian, Alaska Native, Asian, Native Hawaiian or other Pacific Islander (1.9%); Multiracial or other (7.8%); and FRL eligibility (69%). The Verbal IQ (M = 90.83, SD = 14.41) and non-verbal IQ (M = 91.61, SD = 11.41) was assessed using the Kaufman Brief Intelligence Test (Kaufman & Kaufman, 2004) . The normal range of IQ has a mean of 100 and standard deviation of 15. About 6.9% of the sample had been retained in kindergarten; student absenteeism was an average of 11 days in the academic year. All the students with special needs (speech/language impairment, 2.4%; specific learning disabilities, 1.8%; and developmental delay, 1.8%) were included in the present study. There were 2.6% of the children (n = 12) with limited English proficiency."}, {"section_title": "Context of the larger study", "text": "Within the larger study, schools were matched on the percent of children who participated in FRL and in whether schools received Title 1 funding (which is a federally funded programme to support schools that serve a high proportion of students with low SES) and were randomized into either treatment or wait-list control conditions during the 1st year of the study (2007) (2008) . Teachers in the treatment group received training on a classwide early literacy instructional programme that helped teachers better differentiate instruction.\nThe programme was Individualized Student Instruction for Kindergarten (ISI-K), which included Assessment to Instruction (A2i) software, ongoing teacher professional development, and classroom support for the teachers (Al Otaiba et al., 2011) . Teachers also received professional development and bi-weekly in-class support. The wait-list control group received more limited professional development, which involved a summer workshop on response to intervention, individualized instruction, and materials from the Florida Center for Reading Research (http://www.fcrr.org). In the 2nd year of the study (2008) (2009) ), all kindergarten teachers from both conditions received the ISI-K training. Thus, all kindergarten teachers in the present study had received treatment; some received 2 years of treatment and others received 1 year of treatment."}, {"section_title": "Measures", "text": "The measures used in the larger study were also used for the present study and included two alphabetic fluency measures, two phonological awareness measures, and two spelling measures."}, {"section_title": "Alphabetic fluency measure", "text": "The Letter Naming Fluency task of the Dynamic Indicators of Basic Early Literacy Skills (DIBELS) measure (LNF; Good & Kaminski, 2002 ) assessed the student's ability to name letters in 1 minute. Each probe consists of 26 randomly ordered uppercase and lowercase letters ordered in an array of 10 by 11 items. The number of correctly named letters was scored. No points were allocated for unnamed letter names after 3 seconds. If the letter sound rather than the letter name was provided, the test administrator requested for the letter name instead of the letter sound. The possible range for the LNF is 0-110. The alternate-form reliability is .99. The AIMSweb Letter-Sound Fluency (LSF; Shinn & Shinn, 2004) subtest assessed the students' ability to say letter sounds in 1 minute. Each probe consisted of an array of 10 by 10 lower-case letters. Testing was discontinued if the child could not produce any correct sounds for the first 10 letters. The possible range for the LSF is 0-100. The alternateform reliability is .90."}, {"section_title": "Educational Research and Evaluation", "text": "I would like you to spell some words. Some are real, and some are made-up words. If you don't know how to spell a word, sound it out and do your best. First, I am going to say the word, then I will use it in a sentence, and then I will say the word one more time. Remember to write the word next to the correct number on your answer sheet. Ready begin.\nEach word to be spelled was read, then a sentence with the word was read, and finally, the word was repeated (e.g., \"dog. I took my dog to the park. Dog.\"). The decodable pseudowords were repeated three times (e.g., \"Next word: sut, sut, sut\"). The possible range for the decodable words is 0-36, while the possible range for the pseudowords is 0-24. The correlation of the spelling scores between the decodable real words and the decodable pseudowords was high (r = .75).\nFRL (i.e., boys ineligible for FRL and girls ineligible for FRL), which was between .61 and .63. The lower factor loadings for CTOPP Elision were further confirmed by the large measurement error variances for CTOPP Elision. The measurement error variances of spelling real words and spelling pseudowords were generally smaller than the other measures, suggesting that these two measures provided larger proportions of variance explained for the groups. All the factor loadings were statistically significant.\nLast, we fixed the boys eligible for FRL as the reference group. The mean differences between the boys eligible for FRL and the girls eligible for FRL were statistically significant on two measures; the girls outperformed the boys in alphabet knowledge (5.45 points, p < .01, d = .34) and spelling (1.78 points, p < .05, d = .31). There was no statistically significant difference between these two groups in phonological awareness.\nwarranted to investigate how constructs that are measured generalize across groups longitudinally and importantly, whether the nuanced patterns in literacy skills in SES-gender groups found in the present study persist over time. Another limitation is the exclusion of letter writing, which was recommended by NELP (2008) as a strong predictor of later literacy skills. There was only one writing construct (i.e., letter writing fluency) from the larger study (Al Otaiba et al., 2010) , and, thus, the two-indicator rule necessary for confirmatory factor analyses was not met (Kline, 2011) . Additionally, there was insufficient data (n = 12) on children with limited English proficiency for group analysis. Future studies should include writing measures such as dictated letter writing (Ritchey, 2008) . In addition, future studies should investigate how classroom management techniques and student's selfregulation interact with literacy skills. Self-regulation has been linked to gender differences; studies show that young boys in the lowest 10% in self-regulation ratings perform worse than girls in the same percentile (Matthews et al., 2009) . Moreover, teachers are more likely to consider boys from low-SES backgrounds as having inattentive issues than girls from low-SES backgrounds (Entwisle et al., 2007) . Finally, although the CFA model was theory driven (i.e., phonological awareness and alphabet knowledge are different but related factors; Hulme & Snowling, 2013; Townsend & Konold, 2010) , the TLI for boys ineligible for FRL that was greater than 1 suggests a probable overfitting. Thus, a replication with larger sample size should be conducted in future studies."}, {"section_title": "Demographics: SES and gender", "text": "FRL was the proxy measure for SES in this study because only children whose families meet the US federal criteria participate. The four grouping variables between FRL and gender were coded as follows: (0 = boys ineligible for FRL, n = 78; 1 = girls ineligible for FRL, n = 65; 2 = boys eligible for FRL, n = 174; 3 = girls eligible for FRL, n = 145)."}, {"section_title": "Procedure", "text": "This is secondary analysis. All measures, except the spelling task, had been individually administered. The spelling task was group administered. Scores from the spring of kindergarten were used in the present study.\nThe students' spelling was analysed using Tangel and Blachman's (1992) developmental spelling rubric (see Al Otaiba et al., 2010 , for details on the scoring procedure). The first author coded the entire corpus of spelled words, and two research assistants who had been trained to code the spelling errors in a related study (Al Otaiba et al., 2010) each coded 50% of the dataset. The inter-rater agreement based on percent agreement on the individual words ranged from 85.1% to 93%; the mean percent agreement of the entire data set was 89.9%. The range of the Cohen's kappa coefficient on the individual words was .76-.90; the mean kappa was .84. Discrepancies were resolved through discussion; the final agreement was 100%."}, {"section_title": "Preliminary analysis", "text": "As a preliminary analysis, we compared the mean differences of the early literacy indicators assessed in spring for kindergarteners whose schools had been cluster-randomized to either 2 years of treatment or to 1 year of treatment using multiple t tests. The results were not significantly different after adjusting for multiple comparisons to control the Type 1 error rate (α = .05) (Benjamini & Hochberg, 1995) ."}, {"section_title": "Data analysis", "text": "Mplus 6.1 (Muthén & Muthén, 1998 was employed for the MGCFA with mean structures to analyse the data with four FRL-gender sociodemographic groups. The indicators for the constructs were as follows: (a) alphabet knowledge: LNF and LSF; (b) phonological awareness: CTOPP Blending and Elision; and (c) spelling: decodable real words and decodable pseudowords. A stepwise approach was used to assess measurement invariance, structural invariance, and factor means (Brown, 2006; Thompson & Green, 2006) . Figure 1 presents the final MGCFA model."}, {"section_title": "Evaluation of measurement invariance", "text": "Step 1 of the test of measurement invariance establishes a general confirmatory factor analysis (CFA) model that fits the individual groups (i.e., boys ineligible for FRL, girls ineligible for FRL, boys eligible for FRL, and girls eligible for FRL). If the model-data fit is adequate for all the groups, then Step 2, which establishes a baseline model without cross-group constraints, is conducted, or else no further analysis is pursued. If the model-data fit is adequate, then Step 3, which is a test of complete measurement invariance and equality of factor loadings and intercepts for the overall group, is conducted. If the model-data fit is inadequate for the baseline model, then there will be no further analysis. A chi-square difference test and a comparative fit index (CFI) difference test are conducted to compare the measurement invariance model (i.e., constrained model) and the baseline model (i.e., unconstrained model). If the chi-square difference test between the two models is not significant, then the invariance of factor loadings and intercepts (i.e., measurement invariance) is supported. However, if the chi-square difference test is significant, the invariance of loadings and intercepts is not supported. A cutpoint of CFI difference test of less than .01 was chosen to decide whether there was a substantial decrease in model fit between the baseline model and the constrained model (Cheung & Rensvold, 2002; Hirschfeld & von Brachel, 2014) .\nAs a first step in evaluating measurement invariance, the model for each of the four groups (i.e., boys ineligible for FRL, girls ineligible for FRL, boys eligible for FRL, and girls eligible for FRL) was individually fitted. Our judgment regarding good model-data fit indices were indicated by the following: (a) non-significant (Browne & Cudeck, 1993) ; and (e) standardized root mean square residual (SRMR) values less than .08 or .10 (Hu & Bentler, 1999) . The models of each of the four groups converged to an admissible solution. The modeldata fits were not statistically significant across all four groups. Table 2 presents the modeldata fit indices for the stepwise approach undertaken. The model-data fit for the boys ineligible for FRL was: χ 2 (6) = 4.94, p = .55, CFI = 1.000, TLI = 1.000, RMSEA = 0, 90% confidence interval (CI) = .00 to .13, and SRMR = .02; the model-data fit for the Note: All values were significant at p < .01 except those marked n ; FRL = free or reduced-price lunch; a n = 78; b n = 65; Educational Research and Evaluationgirls ineligible for FRL was: χ 2 (6) = 6.76, p = .34, CFI = .996, TLI = 0.990, RMSEA = .04, 90% CI = .00 to .17, and SRMR = .04; the model-data fit for boys eligible for FRL was: χ 2 (6) = 9.30, p = .16, CFI = .994, TLI = 0.985, RMSEA = .06, 90% CI = .00 to .12, and SRMR = .02; and the model-data fit for the girls eligible for FRL: χ 2 (6) = 6.79, p = .34, CFI = .998, TLI = 0.995, RMSEA = .03, 90% CI = .00 to .12, and SRMR = .02. These results suggest that the model-data fits for all four groups were adequate.\nSubsequently, a baseline model comprising all the groups with no constraints on the loadings was derived in the second step of the stepwise approach. The baseline model converged to an admissible solution. The model-data fit was not significant: χ 2 (33) = 36.21, p = .32, CFI = .998, TLI = 0.996, RMSEA = .03, 90% CI = .00 to .08, and SRMR = .04. The fit indices revealed very good model-data fit.\nIn the third step, a test of complete measurement invariance on factor loadings (i.e., constrained model) for the overall group was conducted. The model-data fit for the measurement invariance model was excellent: χ 2 (42) = 52.41, p = .13, CFI = .993, TLI = 0.990, RMSEA = .05, 90% CI = .00 to .08, and SRMR = .05. The Satorra-Bentler scaled chisquare difference test between the final measurement model and the baseline model was not significant (Δ S-B χ 2 = 16.12, Δ df = 9), which suggests that complete measurement invariance was established. Similarly, the CFI difference test (Δ CFI) between the baseline model and the constrained model was less than .01. The parameter estimates for the complete measurement invariance model with constrained factor loadings are reported in Table 3 .\nFor the measurement invariance model with constrained factor loadings, we report the unstandardized estimates when comparing across groups because the unstandardized factor loadings are set to equality across groups (Kline, 2011) . Conversely, for within-group comparison, we report the standardized estimates (Kline, 2011) . The factor variances of alphabet knowledge (i.e., LNF and LSF) across both gender groups were substantially larger than the participants who were not eligible for FRL. For example, the mean unstandardized variance for the boys and girls eligible for FRL was 238.62 but 142.04 for the boys and girls ineligible for FRL. The variance for the boys ineligible for FRL on spelling was larger than the other three groups.\nThe standardized loadings on most of the factors were very high (i.e., above .80) except for the factor loading on CTOPP Elision for two groups who were not eligible for Note: AK = alphabet knowledge; LN = DIBELS Letter Name Fluency; LS = AimsWeb Letter Sound Fluency; PA = phonological awareness; BL = CTOPP Blending; EL = CTOPP Elision; SP = spelling; RW = decodable real words; PW = pseudowords; FRL = free or reduced-price lunch; SE = standard error; unstd. = unstandardized; std. = standardized. All parameter estimates, p < .01."}, {"section_title": "Evaluation of structural invariance and latent means", "text": "In this study, we established cross-group constraints between the four groups by fixing the factor covariance to be the same. Because equality of both factor loadings and intercepts was found, the latent means between groups could be compared (Brown, 2006) . Next, an omnibus test of null hypothesis was conducted by fixing each group's factor means to zero (Thompson & Green, 2006) . If the null hypothesis is not rejected, then the factor means between groups are equivalent; no further analysis is required. If the null hypothesis is rejected, one or more factor means differ between groups. One of the groups is fixed as the reference group (i.e., the factor means for that group is fixed to zero), while other factor means are freely estimated. Subsequently, multiple steps are undertaken to fix another factor means to be zero while other factor means are freely estimated to obtain the mean differences between groups per construct (Thompson & Green, 2006) ."}, {"section_title": "Results", "text": ""}, {"section_title": "Descriptive statistics and selection of estimation methods", "text": "The descriptive statistics and correlations for the early literacy outcome measures are presented in Table 1 . Across all measures, the means of the groups ineligible for FRL were higher than the means of groups eligible for FRL. Similarly, the means of girls were also higher than the means of boys for both subsidized and unsubsidized groups. The standard deviations for the groups ineligible for FRL were smaller than the standard deviations of the groups eligible for FRL on the LNF, LSF, and CTOPP Blending Word measures for both boys and girls. In general, there were stronger correlations for within-construct indicators than there were for between-construct indicators. For instance, across the four sociodemographic groups, measures representing alphabet knowledge were more strongly correlated with each other (i.e., an average of r = .74) than they were with other measures; spelling decodable real words and spelling decodable pseudowords were more strongly correlated (i.e., an average of r = .80) than they were with other measures. Within each sociodemographic group, all the measures were significantly correlated, except the correlation between LNF and CTOPP Elision for the girls ineligible for FRL. We also screened the dataset for non-normality, an assumption of maximum likelihood (ML), by visually inspecting the frequency histograms and the SPSS skewness and kurtoses indexes. There was a moderate departure from normality (i.e., skew < 2, kurtosis < 7; Curran, West, & Finch, 1996; Finney & Distefano, 2006) for the following measures: CTOPP Blending and Elision, spelling real words, and spelling pseudowords. Based on both the moderately non-normal distribution and small sample size per group (i.e., n ≤ 250), we chose the Satorra-Bentler (S-B) scaling method as the estimator (Curran et al., 1996; Finney & DiStefano, 2006) . Missing data was coded as \"999\". There were a total of nine missing data patterns across all four groups. The missing data patterns across groups were proportionately similar, which suggests that the missing data were missing completely at random. Thus, full information maximum likelihood was used (Kline, 2011) ."}, {"section_title": "Multiple-group confirmatory factor analysis", "text": "We answered Research question 1 by evaluating the measurement invariance of the latent variables and their respective observed variables; Research question 2 by evaluating the structural invariance; and Research question 3 by evaluating the equality of latent means."}, {"section_title": "Evaluation of structural invariance", "text": "The final step in the stepwise approach is to establish cross-group constraints across all groups. The model-data fit of the cross-group constraint model was good: χ 2 (51) = 61.92, p = .14, CFI = .992, TLI = 0.991, RMSEA = .04, 90% CI = 00 to .08, and SRMR = .09. The Satorra-Bentler scaled chi-square difference test between the final measurement model and the cross-group constrain model was not significant (Δ S-B χ 2 = .09, Δ df = 9). Similarly, the CFI difference test (Δ CFI) between the constrained model and the cross-group constrained model was less than .01. For reasons of parsimony, the simpler model (i.e., model with cross-group constraints) was retained as the final model. Thus, the factor structures between the four groups (i.e., boys ineligible for FRL, girls ineligible for FRL, boys eligible for FRL, and girls eligible for FRL) were the same."}, {"section_title": "Evaluation of latent means", "text": "To evaluate the equality of latent means, first, we conducted an omnibus test of the null hypothesis by fixing every group's factor means to zero (Thompson & Green, 2006) . The null hypothesis was rejected (p < .01), suggesting that one or more factor means differ between groups. Table 4 presents the latent means and the standardized effect sizes for the latent factors of the four sociodemographic groups. To derive the standardized effect size (d ) of the differences between two latent factor means, we divided the latent factor means difference by the square root of the latent factor variance (Hancock, 2001; Thompson & Green, 2006) . First, we fixed the boys ineligible for FRL as the reference group. The results revealed that the girls ineligible for FRL significantly outperformed the boys ineligible for FRL in alphabet knowledge by 6.26 points (p < .01, d = +.54). The former had higher scores in phonological awareness and spelling than the latter, but these results were not significantly different. In comparison to the boys ineligible for FRL, the boys eligible for FRL scored 4.57 points lower in alphabet knowledge (p < .05, d = -.31), 2.05 points lower in phonological awareness (p < .001, d = -.58), and 4.41 points lower in spelling (p < .001, d = -.63). These mean differences were statistically significant. In contrast to the boys ineligible for FRL, the girls eligible for FRL scored 1.48 points lower in phonological awareness (p < .05, d = -.44) and 2.62 points lower in spelling (p < .05, d = -.45).\nNext, we fixed the girls ineligible for FRL as the reference group. When comparing the girls from the two SES groups, the girls ineligible for FRL significantly outperformed the girls eligible for FRL in all three measures: 5.38 points higher in alphabet knowledge (p < . Note: AK = alphabet knowledge; PA = phonological awareness; SP = spelling; FRL = free or reduced-price lunch; Unstd. = unstandardized latent means; SE = standard error; d = standardized latent factor effect size calculated based on guidelines by Hancock (2001) . *p < .05, **p < .01, ***p < .001. For all other unstandardized estimates, p > .05."}, {"section_title": "Discussion", "text": "The primary goal of the present study was to examine the SES-gender group differences in early literacy skills among kindergarteners who attended high needs schools in a southeastern US city. Another equally important goal was to determine whether the end-of-year kindergarten measures comprising alphabet knowledge, phonological awareness, and spelling constructs were measured in the same degree of accuracy for boys and girls who were (in) eligible to receive free/subsidized meals. We also evaluated the structural invariance and equality of latent means between these sociodemographic groups. To our knowledge, no other study has simultaneously examined the variables for measurement and structural equivalence, and the equality of latent means in early literacy skills across SES and gender groups. Additionally, we used more than one early literacy skill measure to compare SES and gender groups (cf. Entwisle et al., 2007) ."}, {"section_title": "Key findings", "text": "The results from this study support our theoretical framework that the latent factors were defined by their corresponding measured variables; alphabet knowledge (LNF and LSF); phonological awareness (CTOPP Blending and Elision); and spelling (decodable real words and decodable pseudowords). Previous research has established that these early literacy constructs and indicators are important determinants of subsequent literacy skills (e.g., NELP, 2008). Furthermore, this study not only confirms that the poverty and the gender gaps in literacy achievement begin early, but the poverty and gender gaps in early literacy skills are more nuanced than previously reported (Chatterji, 2006; Entwisle et al., 2007; Matthews et al., 2009; West et al., 2000) . Using multiple measures and factors, we were able to highlight the specific gaps in componential literacy skills between boys and girls who were from varying SES backgrounds."}, {"section_title": "Measurement invariance across four sociodemographic groups", "text": "In addressing our first research question, we used a relatively sophisticated data-analytic method to rule out the potential measurement invariance in the relations between the measured variables and the latent factors across all sociodemographic groups. This study corroborates a past study by Townsend and Konold (2010) , who found that the preschool measures comprising alphabet knowledge, phonological awareness, and print concepts were equivalently accurate across male and female students. Additionally, we found that there was measurement invariance for all measures across the four sociodemographic groups. Thus, the six observed variables measured their respective constructs in the same way across kindergarteners who were of different gender and socioeconomic status. In other words, the true differences in scores were due to the group differences. The present finding is promising because it demonstrates that the measures used did not differentially estimate the early literacy performance of students from different sociodemographic backgrounds. Structural invariance across the four sociodemographic groups\nThe second research question addressed whether there was structural invariance (i.e., population heterogeneity) between the four groups. We tested for structural invariance by fixing the factor covariances to equality across groups. The results suggest that interrelations did not vary significantly across the four sociodemographic groups. The latent constructs were similarly correlated in one group as in other groups."}, {"section_title": "Latent means differences across the four sociodemographic groups", "text": "The final research question addressed whether there were differences in the latent means across the four sociodemographic groups. Our findings demonstrate that the nuanced gender differences in early literacy skills among kindergarteners relate to FRL. Importantly, our study found that both boys and girls eligible for FRL significantly underperformed girls ineligible for FRL in alphabet knowledge, phonological awareness, and spelling. A similar pattern was found when comparing between the children from high-poverty households and the boys from low-poverty households, except that the girls from high-poverty households were not significantly different from the boys from low-poverty households in alphabet knowledge. Among children from high-poverty households, girls eligible for FRL significantly outperformed boys eligible for FRL in two constructs: alphabet knowledge and spelling. Conversely, among children from low-poverty households, girls ineligible for FRL significantly outperformed boys ineligible for FRL in only alphabet knowledge. These findings demonstrate that the simple approach of comparing SES group differences without simultaneously examining gender differences vice versa misses out on the nuanced interaction between SES and gender. Early literacy achievement gap exists not only between children from low-SES and high-SES backgrounds, but the gender gap also exists for those children who are ineligible for meal subsidies. Thus, this study extends Entwisle and colleagues' findings (2007) that gender interacts with SES much earlier than Grade 2."}, {"section_title": "Instructional implications", "text": "The present study contributes to converging evidence that differences in early literacy skills begin early. The standardized effect sizes suggest that the boys and girls eligible for the meal subsidies are particularly weak in all three constructs: alphabet knowledge, phonological awareness, and spelling. Thus, componential literacy skills should be addressed early. That children from poor families are generally weak in phonological awareness is not surprising (Bowey, 1995; Raz & Bryant, 1990 ). The present study suggests that it is practically important for teachers to consider the vulnerability of boys eligible for FRL in early literacy skills. Furthermore, considering that the aforementioned constructs are important determinants for later literacy skills and based on what we already know about early identification, the protracted stability of literacy skills in individuals, and motivational issues related to later reading success, high-quality early preparation in literacy skills in preschool and at home may help reduce literacy-related difficulties, poverty gaps, and gender gaps."}, {"section_title": "Limitations and future research", "text": "There are several limitations related to this study. The findings are limited to SES-gender group differences in early literacy skills among kindergarteners. A further study is"}, {"section_title": "Funding", "text": ""}]