[{"section_title": "Introduction", "text": "The carbonate system equilibrium is the major buffer mechanism in regulating seawater pH and calcium carbonate saturation state with respect to aragonite (Ω arag ). Anthropogenic carbon dioxide (CO 2 ) emitted to the atmosphere from human activities, primarily fossil fuel burning, increases the amount of CO 2 absorbed by the ocean and leads to ocean acidification (OA, Doney et al., 2009;Orr et al., 2005). In addition to absorption of excess CO 2 , upwelling, eutrophication, and river discharge affect carbonate chemistry in coastal waters and contribute to coastal acidification (Cai et al., 2011;Feely et al., 2008;Vargas et al., 2016;Wallace et al., 2014). Localized and regional acidification of coastal waters is not well understood due to its complexity and limited spatial and temporal observations and model estimates (Hofmann et al., 2011;Strong et al., 2014). The North American East Coast is a passive continental margin that characterized by a broad shallow shelf. The cold Labrador Current and the warm Gulf Stream are two major current systems that affect the shelf water dynamics. The Labrador Current flows southward along the east coast of Nova Scotia and the Gulf Supporting Information: • Supporting Information S1 • Figure S1 • Figure S2 • Figure S3 • Figure S4 • Figure S5 • Figure S6 • Figure S1 • Figure S7 • Figure S8 • Figure S9 • Figure S10 of Maine to the New York Bight (Bailey & Hachey, 1951). It transports the fresher and colder water into the Mid-Atlantic Bight (MAB) (Chapman & Beardsley, 1989) and has low Ω arag and total alkalinity (TA) (Cai et al., 2020). The Gulf Stream flows northward parallel to the coast and separates from shelf water regions near Cape Hatteras. It is warm and salty and has high Ω arag and TA (Cai et al., 2020). It strongly affects the shelf water dynamics along its propagation pathway in the South Atlantic Bight (SAB) (Atkinson et al., 1983;Lee et al., 1991). The CO 2 buffering capacity is low in the Labrador Current but high in the Gulf Stream. Spatial and seasonal variabilities of seawater carbon dioxide partial pressure (pCO 2 ) have been studied in the MAB and the SAB (DeGrandpre et al., 2002;Jiang et al., 2008). The seasonal cycle of pCO 2 follows the seasonal thermal cycle in the SAB (Jiang et al., 2008;Signorini et al., 2013). In the MAB, biological production events partially counteract the thermally induced pCO 2 increase during spring and summer but they do not seriously alter the overall seasonality because stratification inhibits nutrient supply to the surface water (DeGrandpre et al., 2002). Long-term changes of carbonate chemistry have not been studied in the MAB and the SAB, despite their ecological and economic significance (Clonley et al., 2015;Goldsmith et al., 2019). Assessment of the long-term changes of carbonate chemistry variables is essential to understand responses to anthropogenic CO 2 increase. Many continental shelves are hypothesized to be increasing carbon sinks for atmospheric CO 2 as a result of a faster exchange of CO 2 with the ocean interior and increased biological production due to an increase in anthropogenic nutrient inputs (Laruelle et al., 2018). However, other factors can counteract these processes. For instance, the OA signal in the Gulf of Maine is absent in the recent three decades as a result of rapid warming and salinity changes, which have a strong impact on the carbonate system (Salisbury & Jönsson, 2018). It is important to examine the long-term changes in the seasonal-cycle amplitudes of carbonate chemistry parameters because it matters when calcifying species are exposed to calcium carbonate undersaturation (Gruber et al., 2002;Kwiatkowski & Orr, 2018;Sasse et al., 2015). It affects the time of emergence for OA-related parameters. It is the estimated time for OA signal to be greater than its natural variability (Salisbury & Jönsson, 2018;Turk et al., 2019). Studies on the increasing seasonal-cycle amplitudes of carbonate chemistry parameters have recently been performed (Fassbender et al., 2018;Kwiatkowski & Orr, 2018;Landschützer et al., 2018). Based on interpolated monthly sea surface pCO 2 for the open ocean, Landschützer et al. (2017) show that rising ocean temperatures and anthropogenic CO 2 concentration have altered the seasonal-cycle amplitudes of carbonate chemistry parameters that are attributed to warming and decreases in buffer capacity. Long-term monthly data sets are not available for coastal regions such as the MAB and the SAB due to sparsity of pCO 2 observations. To address this issue, we developed algorithms for regional sea surface fugacity of carbon dioxide (fCO 2 ) from 1982 through 2015 using atmospheric CO 2 , sea surface temperature (SST), and sea surface salinity (SSS), which are the most readily available parameters, using a Bayesian-neural-network approach. Note that pCO 2 and fCO 2 are interchangeable with knowledge of temperature, surface atmospheric pressure, and hydrostatic pressure (Orr et al., 2015;Weiss, 1974). In this work, we use fCO 2 because it accounts for the nonideal behavior of CO 2 gas. In addition, the observations used in this work are reported in the format of fCO 2 . The monthly interpolated sea surface fCO 2 is reconstructed from the available monthly atmospheric CO 2 , SST, and SSS. Other carbonate chemistry parameters, such as pH, dissolved inorganic carbon (DIC), and Ω arag , are then calculated using the monthly interpolated fCO 2 and salinity-derived TA. The long-term changes in the annual mean and seasonal-cycle amplitude of carbonate chemistry parameters based on these reconstructed monthly time series data are presented. for the MAB and 355 for the SAB. The number of measurements for each year and the percentage of grid cells with observations is shown in Figures 1b and 1c. Despite the large number of measurements, the number of grid boxes with data is low and it is clear that a robust gap filling method as performed here is critical. This quality-controlled product of surface ocean fCO 2 has an estimated accuracy of better than 5 μatm (Bakker et al., 2016). Monthly interpolated sea surface fCO 2 from 1982 through 2015 is estimated from monthly atmospheric CO 2 , temperature, and salinity. Atmospheric CO 2 data come from CarbonTracker, version CT2017 (http://carbontracker.noaa.gov, Peters et al., 2007), which is a data assimilation system that is built by the National Oceanic and Atmospheric Administration's (NOAA) Earth System Research Laboratory (Peters et al., 2007). It provides CO 2 mole fractions with a time resolution of 3 h and spatial resolution of 1°× 1°for North America and adjacent coastal seas from 2000 to 2015. This CO 2 mole fraction product has an accuracy of 0.1 parts per million (Peters et al., 2007). To extend the temporal coverage back to 1982, we first calculate the average monthly difference between CarbonTracker data and the Mauna Loa CO 2 data (https://www. esrl.noaa.gov/gmd/ccgg/trends/data.html) for each grid box using data during the overlap period (2000-2015). The CO 2 differences are generally large in summer and small in winter (supporting information Figure S1). Spatially, the CO 2 differences are larger in the higher latitudes than that in the lower latitudes (supporting information Figure S1). Then we apply this difference that ranges from −3.9 to 15.8 μatm to other years (1982)(1983)(1984)(1985)(1986)(1987)(1988)(1989)(1990)(1991)(1992)(1993)(1994)(1995)(1996)(1997)(1998)(1999) when the CarbonTracker data are not available. The accuracy of the CO 2 measurements at the Mauna Loa Observatory is generally better than 0.2 ppm. SST data are obtained from the NOAA daily Optimum Interpolation SST (OISST, version 2; Reynolds et al., 2007). OISST is a satellite-derived high-resolution (0.25°× 0.25°) data set with an uncertainty of 0.02°C (Reynolds et al., 2002). The average temperature differences between OISST and SOCAT gridded data are 0.74 ± 1.45°C and 1.57 ± 2.72°C for the MAB and the SAB, respectively. SSS is obtained from the UK Met Office Hadley Center EN4 data set (version 4.2.1, https://www.metoffice.gov.uk/hadobs/en4/). The EN4 data set uses the World Ocean Database 2009 (WOD09) as its main data source (Good et al., 2013). Data from the Global Temperature and Salinity Profile Program since 1990 have been ingested into the EN4 data set (Good et al., 2013). This EN4 data set provides monthly-based 1°× 1°gridded salinity data with uncertainty estimates. The average salinity uncertainties are 0.48 and 0.58 for the MAB and the SAB, respectively. The average salinity differences between EN4 data and SOCAT gridded data are 0.10 ± 0.68 and 0.10 ± 0.85 for the MAB and the SAB, respectively. "}, {"section_title": "10.1029/2019JC015982", "text": "Journal of Geophysical Research: Oceans\nJournal of Geophysical Research: Oceans relationship fitted for the SAB using ECOA-1 data was not used due to the lack of low salinity bottle samples for the SAB during this survey. The average salinity-derived TA differences from the two sets of equations are 5.9 ± 1.9 and 3.6 ± 1.1 μmol kg −1 for the MAB and the SAB, respectively. The salinity-derived TA using new equations are higher than those using previous equations with up to 10.5 μmol kg −1 for the MAB and up to 6.5 μmol kg −1 for the SAB (supporting information Figure S2). This leads to a higher DIC of up to 9.3 μmol kg −1 for the MAB and a higher DIC of up to 5.7 μmol kg −1 for the SAB. The corresponding influences on the calculated pH and Ω arag are much smaller as these parameters are more strongly dependent on fCO 2 . The pH differences vary between −0.0016 and 0.0020 in the MAB and vary between 0.0000 and 0.0011 in the SAB, which are smaller than pH measurement uncertainties. Ω arag differences vary between −0.0102 and 0.0147 in the MAB and vary between 0.0000 and 0.0130 in the SAB. As for seasonal-cycle amplitudes, the influence of using different equations on pH and Ω arag is very small while it is a bit larger on DIC (supporting information Figure S3). Importantly, in terms of long-term trends for all parameters (TA, DIC, pH, and Ω arag ), the usage of different equations has negligible influences as the changes in the long-term trends are smaller than uncertainties (supporting information Table S1). In addition, we compare the carbonate chemistry variables in the MAB and the SAB with the values in the open ocean. We choose two grid cells (at 36.5°N, −71.5°W and 30.5°N, −75.5°W) in the north Atlantic Ocean at the latitudinal ranges of the MAB and the SAB for comparison ( Figure 1a). The open ocean fCO 2 is obtained from the interpolated monthly surface fCO 2 from Landschützer et al. (2017). TA for the open ocean is determined using the locally interpolated alkalinity regression method (Carter et al., 2018). Then pH, DIC, and Ω arag are calculated from fCO 2 and TA using the same approach as for their coastal-ocean counterparts. Seasonal-cycle amplitude for each year from 1982 to 2015 is calculated as the difference between summer (July, August, and September) and winter (January, February, and March) means when the carbonate chemistry variables reach their maximum or minimum values within a certain year following Landschützer et al. (2018). In this work, we use the letter \"A\" to denote the seasonal-cycle amplitude of a carbonate chemistry variable. The average monthly seawater fCO 2 in the MAB generally reaches the maximum in summer and reaches the minimum in winter; thus, the seasonal-cycle amplitude of fCO 2 (A_fCO 2 ) is calculated as In this work, we reconstruct surface carbonate chemistry variables starting from 1982 for two reasons: (1) fCO 2 is very sensitive to temperature (Takahashi et al., 2006) (Figure 1b), respectively, we extrapolated data to 1982 to fully use the available SST data and to provide estimations for carbonate chemistry variables from 1982 to 1990. In addition, the long-term trends during 1991-2015 are provided along with the trends during 1982-2015 in supporting information Table S2.\nOn a decadal scale, seawater fCO 2 increased in both the MAB and the SAB following the increase of atmospheric CO 2 (Figures 4a, 4b, and 4d). The rate of fCO 2 increase in the MAB (17.7 ± 0.7 μatm per decade, Figure 5d) was similar to that in the atmosphere (17.3 ± 0.2 μatm per decade) but higher than that in the SAB (14.0 ± 1.4 μatm per decade, Figure 5d). Correspondingly, pH decreased in both the MAB and the SAB (Figures 4c and 4d). The rate of pH decrease in the MAB (0.019 ± 0.001 per decade, Figure 5f) was higher than that in the SAB (0.013 ± 0.002 per decade, Figure 5f and Table 1). DIC and Ω arag displayed more complicated variation patterns (Figures 4 and 6). The overall DIC trends during 1982-2015 were significant in both the MAB and the SAB (Figure 6d and Table 1). For the MAB, coastal ocean DIC increased at a rate of 10.6 ± 2.2 μmol kg −1 per decade during 1982-2015 ( Figure 6d and Table 1). The overall DIC increase during 1982-2015 in the SAB (12.6 ± 1.3 μmol kg −1 per decade) was faster than that of the MAB, a pattern opposite that of fCO 2 (Figure 6d and Table 1). However, DIC in the MAB displayed different patterns during different time period. There was no significant trend in DIC from 1982 to 2005 in the MAB, but it increased from 2005 to 2015 at a rate of 39.1 ± 8.5 μmol kg −1 per decade (Figure 6d and Table 1). Different from DIC variations, the overall Ω arag decrease rate in the MAB (0.103 ± 0.010 per decade, Figure 6f) was faster than that of the SAB (0.063 ± 0.015 per decade, Figure 6f and Table 1). In the MAB, contrary to DIC increase during 2005-2015, Ω arag was stagnant during this period instead of decreasing caused by anthropogenic CO 2 uptake (Figure 6f and Table 1). Similarly, a recent stagnant in Ω arag decrease from 2005 to 2015 was observed in the SAB (Figure 6f and Table 1). For the open ocean, data from offshore of the MAB and the SAB displayed similar patterns in terms of both seasonal and long-term variations (Figures 5 and 6). Seasonal and long-term variations of carbonate chemistry variables in the open ocean were closer to those in the SAB than those in the MAB (Figures 5 and 6, and Table 1). In addition, Ω arag in the open ocean was much higher (1.14 on average) than that in the MAB (Figures 6e and 6f, and Table 1). Specifically, fCO 2 increased at rates of 14.4 ± 0.5 and 13.8 ± 0.4 μatm per decade in the open ocean at the counterparts of the MAB and the SAB during 1982-2015. \n\nJournal of Geophysical Research: Oceans appears impacted, to a large degree, by the North Atlantic Oscillation, which shares a similar periodicity during 1982-2015 (supporting information Figures S4 and S5) and exerts a strong influence on temperature variation in the North Atlantic (Czaja & Frankignoul, 2002;Visbeck et al., 2001). The long-term changes in the seasonal-cycle amplitudes of fCO 2 and pH in the MAB and the SAB were similar to those in the open ocean, though the climatological seasonal-cycle amplitudes in the coastal ocean were amplified compared to those in the open ocean (Figures 7a-7d). In the open ocean, the seasonal-cycle amplitude of fCO 2 of 42.7 ± 4.4 and 45.3 ± 4.8 μatm on average increased during 1982-2015 at rates of 2.8 ± 0.6 and 2.7 ± 0.7 μatm per decade, respectively, for the open-ocean counterparts of the MAB and the SAB (Figures 7a  and 7b). The seasonal-cycle amplitudes of fCO 2 in the MAB and the SAB of 96.2 ± 8.6 and 66.1 ± 12.1 μatm increased at higher rates of 4.6 ± 1.3 and 4.0 ± 2.0 μatm per decade (Figures 7a and 7b). No significant trends were detected for the seasonal-cycle amplitude of pH in coastal or open oceans (Figures 7c and 7d). This is attributed to the pH being on a log scale. The changes in the seasonal-cycle amplitudes of DIC and Ω arag in the MAB were significantly different from those in the open ocean (Figures 7e-7h). The seasonal-cycle amplitude of DIC of 56.8 ± 19.3 μmol kg −1 increased (not statistically significant, p value = 0.35) at a rate of 3.2 ± 3.4 μmol kg −1 per decade in the open ocean while the seasonal-cycle amplitude of the MAB of 101.0 ± 17.8 μmol kg −1 increased much faster at a rate of 8.9 ± 2.7 μmol kg −1 per decade (p value < 0.001; Figure 7e). At the same time, the seasonal-cycle \nJournal of Geophysical Research: Oceans amplitude of Ω arag in the MAB increased (not statistically significant, p value = 0.11) at a rate of 0.034 ± 0.021 per decade while it decreased slightly (not statistically significant, p-value = 0.92) in the open ocean at a rate of 0.002 ± 0.017 per decade (Figure 7g). The seasonal-cycle amplitudes of DIC and Ω arag in the SAB increased as those in the open ocean, though a significant trend was found only for the seasonal-cycle amplitude of DIC in the SAB (Figures 7f and 7h).\nJournal of Geophysical Research: Oceans increases due to vertical mixing and high DIC below the mixed layer as wind becomes stronger and the mixed layer depth becomes larger. However, to what scales the surface carbonate chemistry variables are affected by subsurface carbonate chemistry dynamics are not discussed here due to the lack of subsurface carbonate chemistry data for spring, fall, and winter for the MAB. In terms of long-term changes of seawater fCO 2 and pH, the in situ fCO 2 and pH are normalized using CO2SYS to the values at 25°to normalize for temperature influence. The temperature-normalized fCO 2 displays similar long-term trends as the in situ fCO 2 in the SAB and its offshore open ocean (supporting information Figure S7 and Table 1), suggesting that atmospheric CO 2 increase is the primary driver of the long-term fCO 2 increase in the SAB. However, for the MAB, the temperature-normalized fCO 2 and pH trends display similar patterns as the in situ fCO 2 and pH but somewhat different rates (supporting information Figure S7 and Table 1), suggesting that other factors, for example, salinity change and mixing, have notable influence on the long-term fCO 2 change in the MAB on top of the influence from atmospheric CO 2 increase. Temperature and vertical mixing have opposite influences on seawater fCO 2 , thus counteracting each other and resulting in a similar increase rate of in situ fCO 2 as that of the fCO 2air . The MAB and the SAB have been identified as CO 2 sinks by DeGrandpre et al. (2002), Jiang et al. (2008), and Signorini et al. (2013). As in situ seawater fCO 2 increase rate in the MAB of 17.7 ± 0.7 μatm per decade is similar to fCO 2air increase rate (17.3 ± 0.2 μatm per decade), the MAB will likely remain to be CO 2 sinks with a similar air-sea CO 2 flux rate in the next few decades. Seawater fCO 2 increase rate in the SAB (14.0 ± 0.7 μatm per decade) is lower than fCO 2air increase rate (17.3 ± 0.2 μatm per decade), indicating that SAB has become a larger CO 2 sink in the last four decades (Laruelle et al., 2018).\nJournal of Geophysical Research: Oceans decade, TA increase fast in the MAB due to the increase in Gulf Stream water mass as the northward shift of the Gulf Stream north wall, which is related to zonal wind variability and North Atlantic Oscillation (Grodsky et al., 2017). Therefore, the stagnation of the Ω arag trend in the recent decade is mainly driven by the larger increase in TA counteracting the effect on-going DIC increase on Ω arag . In the SAB, Ω arag decrease from 1982 to 2005 is mainly driven by the increase in DIC while the decadal change driven by TA is small. Similar to the MAB, the recent Ω arag stagnation in the SAB is driven by the increase in TA though the increase is smaller compared to that of the MAB."}, {"section_title": "fCO 2 Estimation and pH, DIC, and Ω arag Calculation", "text": "Monthly seawater fCO 2 at the equilibrium state (fCO 2air ) is calculated using atmospheric dry air mole fraction of CO 2 (xCO 2 ), SST, and SSS for each 1°× 1°grid box in the MAB and the SAB (Figure 1a). The equilibrium state refers to the condition that the seawater fCO 2 is in equilibrium with the atmospheric fCO 2 at 100% relative humidity and one standard atmospheric pressure, that is, the net CO 2 exchange between atmosphere and seawater is zero. pCO 2 at the equilibrium state (pCO 2air ) is calculated using xCO 2 , temperature, and salinity: where p w stands for water vapor pressure at the equilibrium temperature and salinity. It can be calculated from temperature and salinity according to Weiss and Price (1980): where T is temperature on the Kelvin scale and S is salinity. Then we converted pCO 2air to fCO 2air using CO 2 coefficients from Weiss (1974), where for surface waters fCO 2 ≈ 0.996 pCO 2 . For consistency, we use fCO 2 through the paper from here. Then we model the disequilibrium between the observed seawater fCO 2 and fCO 2air (i.e., ΔfCO 2 ; ΔfCO 2 = fCO 2 − fCO 2air ) using atmospheric CO 2 , SST, and SSS via a Bayesian-neural-network approach, which provides a way to model the nonlinear behavior of the carbonate chemistry variables with probability distribution as weights and has better performance than that of traditional empirical approaches such as the multiple linear regression approach (Bittig et al., 2018;Chen et al., 2019;MacKay, 1995). The input parameters are latitude, longitude, SST, and SSS. These four input parameters are chosen because they are commonly measured with high accuracy. Monthly SST and SSS data available from 1982 to 2015 are used to calculate output with the trained network to fill in SOCAT data gaps. The Bayesian-neural-network approach takes full usage of available observations because it obviates the overfitting problem with regularization coefficients, and thus, a subset of data for the cross validation is not necessary (Neal, 1996). In addition, it exhibits robustness to errors in the input parameters (Aires et al., 2004;Velazco et al., 1997), which is important for this study as the input parameters SST and SSS come from gridded data product with errors (section 2.1). The output parameter is ΔfCO 2 . The feedforward backpropagation network is constructed by two hidden layers with tanh activation functions, which provide the neural network a nonlinear element. The neural network is trained with the Levenberg-Marquardt algorithm (Hagan & Menhaj, 1994). The monthly gridded SOCAT fCO 2 data, along with the corresponding fCO 2air , latitude, longitude, SST, and SSS, have been used to train the network. Two separate training processes have been performed for the MAB and the SAB with 935 and 355 examples in the training data sets, respectively. Based on the trained algorithms, monthly ΔfCO 2 over 1982-2015 is calculated from monthly atmospheric CO 2 , SST, and SSS. Subsequently, monthly fCO 2 is calculated using ΔfCO 2 and fCO 2air according to fCO 2 = ΔfCO 2 + fCO 2air . Monthly pH, DIC, and Ω arag are then calculated from fCO 2 and salinity-derived TA using CO2SYS (Van Heuven et al., 2009) with the first and second dissociation constants of carbonic acid in seawater (K 1 and K 2 ) from Lueker et al. (2000) and borate-to-salinity ratio determined by Uppström (1974). TA is derived from salinity using linear relationships; for the MAB, TA = 46.6 × salinity + (670.6 ± 12.3); and for the SAB, TA = 48.7 × salinity + (608.8 ± 28.2) (Cai et al., 2010). The salinity-TA relationships obtained in Cai et al. (2010) were obtained from high-quality cruise data before 2010 for the entire MAB and the SAB. Changes in the relationship between salinity and TA would affect the estimated TA and thus affect the calculated pH, DIC, and Ω arag . To assess the influence on the results, we applied two different salinity-TA relationships for the MAB and the SAB using more recent observations and then compared the new results with the previous results using salinity-TA relationships from Cai et al. (2010). For the MAB, the new relationship of TA = 48.96 × salinity + 599.54 (n = 185, r 2 = 0.95, p < 0.05) was developed using bottle TA data measured during the first East Coast Ocean Acidification cruise (ECOA-1) that was conducted in 2015, which is an independent data set that was not used by Cai et al. (2010). For the SAB, a new relationship of TA = 46.56 × salinity + 688.24 (n = 892, r 2 = 0.93, p < 0.05) was developed using TA measurements from Cai's lab for the entire SAB shelf from 2006 through 2017. The salinity-TA"}, {"section_title": "First-Order Taylor-Series Deconvolution of Ω arag", "text": "Ω arag refers to the saturation state of seawater with respect to carbonate mineral aragonite, which is the second most abundant mineral form of calcium carbonate in the ocean and is more soluble than the most abundant form, calcite. By definition, Ω arag is calculated as the product of the concentrations of calcium ions (Ca 2+ ) and carbonate ions (CO 3 2+ ) in seawater divided by the stoichiometric solubility product of the aragonite mineral (K sp ). It affects the health of carbonate bearing organisms and has often been used as an indicator for OA (Feely et al., 2008;Harris et al., 2013). To investigate the cause of seasonal and decadal changes in Ω arag , a first-order Taylor-series deconvolution approach has been used following Kwiatkowski and Orr (2018): where ΔΩ arag is the change in Ω arag while ΔDIC, ΔTA, ΔSST, and ΔSSS are corresponding changes in "}, {"section_title": "Results", "text": ""}, {"section_title": "Regional Algorithm Performance", "text": "Figures 2 and 3a and 3b show the comparison between the neural-networkbased fCO 2 estimations and observations. Note that the gridded data at 1°× 1°spatial resolution from the same region (i.e., the MAB or the SAB) have been averaged to represent the values for the MAB and the SAB. Thus, the numbers of points in Figures 2 and 3 are smaller than the numbers of observations used for neural-network training. Statistically, the neuralnetwork-based fCO 2 estimations agree well with gridded observations with a R 2 of 0.83 for the MAB and a R 2 of 0.82 for the SAB. The root-mean-square errors (RMSE) between gridded observations and neural-network-based estimates are 18 and 22 μatm for the MAB and the SAB, respectively. These fCO 2 estimates have lower RMSE of 51% and 19%, compared to previous multiple linear regression work by Signorini et al. (2013) that showed RMSE of 37 and 27 μatm for the MAB and the SAB, respectively. Compared to the MAB, the larger error in the SAB is primarily due to the poor fit of data in the grid box located in shelf regions nearest to the coast of Georgia, where seawater fCO 2 is affected by estuaries that have high CO 2 inputs from rivers and intertidal saltmarshes (Jiang et al., 2008). Figures 3c-3h show the comparison between pH, DIC, and Ω arag estimations and observations. The pH, DIC, and Ω arag estimations are determined from the neural-network-based fCO 2 estimation and salinity-derived TA, while the empirical pH, DIC, and Ω arag data are calculated from the observed fCO 2 and salinity-derived TA. The errors in the neural-network-based fCO 2 estimation and salinity-derived TA lead to errors in pH, DIC, and Ω arag estimations. Overall, pH, DIC, and Ω arag estimations agree well with empirical data with R 2 values of 0.83 (pH), 0.96 (DIC), and 0.94 (Ω arag ) for the MAB and R 2 values of 0.84 (pH), 0.77 (DIC), and 0.92 (Ω arag ) for the SAB. The errors in pH, DIC, and Ω arag estimations are determined following uncertainty propagation routines as described in Orr et al. (2018). In the MAB, the errors for pH, DIC, and Ω arag estimations are 0.020, 9 μmol kg −1 , and 0.09, respectively. In the SAB, the errors for pH, DIC, and Ω arag estimations (0.021, 12 μmol kg −1 , and 0.12) are slightly larger than those of the MAB due to the larger error in the fCO 2 estimates."}, {"section_title": "Seasonal and Decadal fCO 2 , pH, DIC, and Ω arag Variations", "text": "The reconstructed monthly carbonate chemistry variables in the MAB and the SAB from 1982 to 2015 suggest that seasonal variations of carbonate chemistry variables in the MAB were larger than those in the SAB (Figures 4-6). SST reached the maximum values in summer while SSS reached the lowest values during the summer. fCO 2 seasonal variability was consistent with SST seasonal variability, while DIC seasonal variability was consistent with SSS seasonal variability ( Figures 5 and 6). However, fCO 2air seasonal variation pattern was opposite to that of seawater fCO 2 due to the low air CO 2 values in late summer as plants absorb CO 2 through photosynthesis ( Figure 5). Contrary to the seasonal variation patterns of fCO 2 , pH displayed the opposite seasonal variation pattern as that of SST due to the inverse temperature effect on pH ( Figure 5). Contrary to the seasonal variations of DIC, Ω arag displayed the opposite seasonal variation patterns as that of SSS ( Figure 6). Ω arag was highest in summer because both temperature increase and biological uptake lead to an increase in Ω arag . The red diamond symbol represents our estimated fCO 2 . This comparison is based on data from grid boxes where SOCAT gridded data are available and not the average of data from all grid boxes. Note that data from 1982 to 2004 are not presented here because of data paucity (Figures 1b and 1c)."}, {"section_title": "Journal of Geophysical Research: Oceans", "text": "Correspondingly, pH decreased at rates of 0.015 ± 0.004 and 0.013 ± 0.005 per decade; DIC increased at rates of 4.9 ± 2.3 and 8.9 ± 2.0 μmol kg −1 per decade; and Ω arag decreased at rates of 0.067 ± 0.015 and 0.073 ± 0.011 per decade, respectively, in the open ocean offshore of the MAB and the SAB.\nSeasonal DIC variability in the MAB and the SAB are mainly driven by convective mixing and spring-summer biological activity that elevates DIC in winter and accounts for DIC reduction in summer (Signorini et al., 2013). To investigate DIC change on longer time scales, in situ DIC is normalized to salinity 35 using riverine and oceanic end-members for the MAB and the SAB. The interannual variability in the salinity-normalized DIC is influenced by the change in winter mixed layer depth and SST anomalies as in the north Atlantic (Gruber et al., 2002). However, the difference between the in situ DIC and salinity-normalized DIC suggests that the large DIC increase during 2005-2015 is primarily driven by the large increase in salinity as the northward movement of the latitudinal position of the Gulf Stream north wall and the retreat of the Labrador Current (supporting information Figure S7; Grodsky et al., 2017;Thomas et al., 2017)."}, {"section_title": "Variations in Seasonal-Cycle Amplitudes of fCO 2 , pH, DIC, and Ω arag", "text": "In addition to changes in annual means, the seasonal-cycle amplitudes of fCO 2 , pH, DIC, and Ω arag were also changing during 1982-2015 ( Figure 7). Note that seasonal-cycle amplitude (denoted by \"A\" in this paper) was calculated as the difference between summer and winter means. A periodicity of the amplitude of fCO 2 , DIC, pH, and Ω arag at about 5.5 years per cycle was presented in both the MAB and the SAB according to the frequency analysis of detrended and normalized annual anomalies in amplitude during 1982-2015 via the multitaper method (Percival & Walden, 1993;Thomson, 1982). This 5.5-year per cycle periodicity "}, {"section_title": "Discussion", "text": ""}, {"section_title": "The Influence of Atmospheric CO 2 Increase on fCO 2 and pH", "text": "Seasonal and interannual variabilities of carbonate chemistry variables in the open ocean have been studied (Bates et al., 1996;Gruber et al., 2002;Sasse et al., 2015). It has been concluded that the interannual variability of carbonate chemistry variables in the north Atlantic is mainly driven by variations in winter mixed-layer depths and by SST anomalies (Gruber et al., 2002). Seasonal air-sea CO 2 flux has been studied in the MAB and the SAB by DeGrandpre et al. (2002) and Signorini et al. (2013) for time periods 1994 to 2000 and 2003 to 2010, respectively. fCO 2 seasonal variation is most sensitive to temperature change in both the MAB and the SAB (Signorini et al., 2013). Our regional averaged seasonal fCO 2 also varies with SST (supporting information Figure S6). Consequently, seasonal change of fCO 2 in the MAB is larger than that in the SAB because seasonal temperature variation in the MAB is larger. As for pH, it varies inversely with fCO 2 in both the MAB and the SAB (supporting information Figure S6). Therefore, its seasonal amplitude in the MAB is larger than that in the SAB. DIC reaches the highest values in winter when the mixed layer depth is highest. From winter to summer, DIC draws down as results of CO 2 degassing and spring-summer biological activity. DIC reaches minimum in summer when stratification is strongest. From summer to fall, DIC "}, {"section_title": "Atmospheric CO 2 Increase and Mixing Influences on DIC", "text": "To quantify the influence of atmospheric CO 2 increase on the long-term DIC change, the simulated DIC is calculated using the detrended seawater fCO 2 and TA to eliminate the influence of atmospheric CO 2 increase. Then the difference between the interpolated DIC using the neural network approach and the simulated DIC represents the influence of atmospheric CO 2 increase on DIC increase. It is clear that  MAB, the SAB, andthe Open Ocean During 1982-2015 if atmospheric CO 2 increase contributes to DIC accumulation over time (supporting information Figure S8). DIC increase rates due to atmospheric CO 2 uptake are 0.99 ± 0.01 μmol kg −1 year −1 for the MAB and 0.88 ± 0.01 μmol kg −1 year −1 for the SAB (supporting information Figure S8c). On the other hand, the average air-sea CO 2 uptake rates are 1.91 ± 0.22 and 0.75 ± 0.16 mol CO 2 m −2 year −1 , respectively, for the MAB and the SAB (Signorini et al., 2013). These lead to estimated CO 2 uptake of 92.8 ± 10.7 and 48.6 ± 10.4 μmol kg −1 year −1 assuming seawater density is 1,029 kg m −3 and the average mixed layer depths are 20 and 15 m for the MAB and the SAB (Signorini et al., 2013). Thus, comparison of DIC increase rates derived here (0.88-0.99 μmol kg −1 yr −1 ) and from the mean annual air-sea fluxes (48.6-92.8 μmol kg −1 year −1 ) suggests most of the CO 2 uptake via air-sea CO 2 flux is exported to the subsurface water or the open ocean while 1.1% and 1.8% of the CO 2 uptake contribute to surface DIC increase in the MAB and the SAB, respectively. Furthermore, atmospheric CO 2 increase contributes the decrease in buffer capacity that contributes to the increase in the seasonal-cycle amplitude of DIC (supporting information Figure S8d). The change in buffer capacity accounts for 27% and 31% of the total increases in DIC seasonal-cycle amplitudes in the MAB and the SAB, respectively. 10.1029/2019JC015982"}, {"section_title": "The Cause of Seasonal, Interannual, and Decadal Changes in Ω arag", "text": "Using the deconvolution method in 2.3 the seasonal variability in Ω arag is investigated. The derivative values for ΔSST (0.0138 ± 0.0002) and ΔSSS (−0.0256 ± 0.0001) have opposite signs, suggesting the opposite influence on the change in Ω arag . Similarly, the opposite signs in the derivative values for ΔDIC (−0.0098 ± 0.0000) and ΔTA (0.0102 ± 0.0001) suggest the opposite influence on the change in Ω arag . Although the sensitivities for ΔSST and ΔSSS are larger than those for DIC and TA, seasonal Ω arag variability is controlled by changes in DIC and TA to a large extent and to a lesser extent by SST in both the MAB and the SAB (Figures 8a and 8b). While SSS influence on Ω arag through changing carbon system equilibrium constants is negligible (Figures 8a and 8b). This is due to the fact that the changes in DIC and TA are much larger than the changes in SST and SSS while the derivative values are on the same magnitude. For the MAB, DIC influence on seasonal Ω arag variability is the largest compared to the other factors (Figures 8a and 8b). However, in terms of interannual Ω arag variability, TA influence is the largest, indicating that the interannual variability is mainly controlled by physical mixing. On a decadal scale, DIC and TA are the dominant factors that control the long-term changes in Ω arag (Figures 8c and 8d). In the MAB, the decrease in Ω arag from 1982 to 2005 is mainly driven by the increase in DIC and the decrease in TA. However, in the recent "}, {"section_title": "Implications of the Changes in Seasonal-Cycle Amplitude", "text": "The increase in the seasonal-cycle amplitudes of fCO 2 and DIC is mainly due to the increased uptake of anthropogenic CO 2 and associated reduced buffer capacity (Kwiatkowski & Orr, 2018;Landschützer et al., 2018). The greater increase of the fCO 2 and DIC seasonal cycle amplitudes in the MAB can be attributed to the larger CO 2 uptake through air-sea CO 2 flux than those of the SAB (Signorini et al., 2013), which lead to greater increase in seawater fCO 2 and DIC and greater decrease in buffer capacity. As for Ω arag , the increase in its amplitude in both the MAB and the SAB is because of a higher sensitivity to the change in the seasonal amplitude of DIC than that of TA (Kwiatkowski & Orr, 2018). Overall, the seasonal-cycle amplitudes of carbonate chemistry variables are larger in the coastal ocean than those in the open ocean. In the MAB, the average seasonal amplitudes of DIC and Ω arag are higher than those in the open ocean by 160% and 175%, respectively. While the average seasonal amplitudes of DIC and Ω arag in the SAB are higher than those in the offshore open ocean by 52% and 67%, respectively. The differences between the average seasonal amplitudes of DIC and Ω arag in the MAB and those in the offshore open ocean of the same latitudinal range are larger compared to the differences between those in the SAB and the offshore open ocean. The high seasonal variability of carbonate chemistry variables in the coastal ocean suggests a higher degree of vulnerability to extremes in the ongoing OA. In the MAB, surface water Ω arag decreases at a rate that is 1.6 times faster in winter season, when Ω arag reaches the annual minimum, than that in summer when Ω arag reaches the annual maximum. This seasonal asymmetry leads to the increase in seasonal-cycle amplitude of Ω arag in the MAB. This indicates a lower Ω arag in winter season when Ω arag reaches the annual minimum. Besides, the increase of Ω arag seasonal-cycle amplitudes is greater in the MAB than those in the SAB and the open ocean. Thus, the faster increase in the seasonal amplitude of Ω arag will accelerate the emergence of undersaturation in the MAB and exert more stress on coastal carbonate-bearing organisms. The current work takes the advantage of the long-term fCO 2 and SST data in surface waters and focus on addressing the long-term trends of fCO 2 , pH, DIC, and Ω arag and changes in their seasonal-cycle amplitudes in coastal surface waters. The Ω arag is often lower in subsurface or bottom waters during stratification in the summer where most adult shelf-building organisms reside in (Saba et al., 2019)."}, {"section_title": "Conclusion", "text": "Assessments of the long-term changes in seawater carbonate chemistry variables and their seasonal-cycle amplitudes are necessary to understand the responses of seawater carbonate chemistry to anthropogenic CO 2 uptake and to estimate when carbonate-bearing organisms will be exposed to unfavorable calcium carbonate saturation levels. Compared to open OA, coastal acidification is more difficult to investigate due to its complexity and the lack of observations. In this study, we address the coastal acidification problem using the Bayesian-neural-network approach to reconstruct ΔfCO 2 and then calculate other carbonate chemistry variables at a monthly resolution for the MAB and the SAB from 1982 to 2015. The monthly interpolated data suggest that the seasonal-cycle amplitudes of carbonate chemistry variables are larger and change faster in coastal regions, especially in the MAB, than those in the open ocean. This accelerates the emergence of unfavorable conditions for coastal carbonate-bearing organisms. We found that the long-term seawater fCO 2 , DIC, pH, and Ω arag variations in the SAB are primarily controlled by atmospheric CO 2 increase, while carbonate chemistry in the MAB is modified significantly by salinity variations, which is driven by physical processes that bring in different water masses. The seasonal asymmetry in the evolution of long-term change leads to the change in the seasonal-cycle amplitudes of carbonate chemistry variables. Undersaturation will occur first in the MAB where both the seasonal amplitude and the change in the seasonal amplitude of Ω arag 10.1029/2019JC015982 Journal of Geophysical Research: Oceans over time are larger than those of the SAB and the open ocean. The neural-network algorithms for estimating the carbonate chemistry variables in the MAB and the SAB can be used in other coastal regions where enough fCO 2 data exist to train a neural network and it could be added to global ocean models to better capture the changes of carbonate chemistry variables in coastal regions."}]