[{"section_title": "Foreword", "text": "In addition to official NCES publications, NCES staff and individuals commissioned by NCES produce preliminary research reports that include analyses of survey results, and presentations of technical, methodological, and statistical evaluation issues. The Working Paper Series was initiated to promote the sharing of the valuable work experience and knowledge reflected in these preliminary reports. These reports are viewed as works in progress, and have not undergone a rigorous review for consistency with NCES Table of Contents   Page   Foreword   iii  List of Tables   Table  Page   1 Percentage of 1992 high school graduates who took the steps toward 4-year college enrollment, by selected characteristics 7   2Percentage distribution of 1992 high school graduates according to qualification to attend a 4-year college, by selected student characteristics 10 3 Percentage distribution of college-qualified 1992 high school graduates who enrolled in a 4-year college, according to projected persistence and attainment 4 years after high school graduation, by selected student characteristics 19   4Percentage distribution of minimally or somewhat college-qualified 1992 high school graduates who enrolled in a 4-year college, according to projected persistence and attainment 4 years after high school graduation, by selected student characteristics 21 5 Percentage distribution of highly or very highly college-qualified 1992 high school graduates who enrolled in a 4-year college, according to projected persistence and attainment 4 years after high school graduation, by selected student characteristics 22 Percentage of college-qualified 1992 high school graduates who borrowed for their education according to projected persistence and attainment 4 years after high school graduation, by selected student characteristics"}, {"section_title": "24", "text": "Average amount borrowed among college-qualified 1992 high school graduates who borrowed for their education, according to projected persistence and attainment 4 years after high school graduation, by selected student characteristics 25 Percentage of highly or very highly college-qualified 1992 high school graduates who enrolled in a 4-year college, projected to complete the bachelor's degree, and the adjusted percentage after taking into account the covariation of the variables listed in the table 28 Percentage of highly or very highly college-qualified 1992 high school graduates who enrolled in a 4-year college, projected to complete no degree and not be enrolled, and the adjusted percentage after taking into account the covariation of the variables listed in the table  29   11 xii Table  Page   10 Percentage of highly or very highly college-qualified 1992 high school graduates who enrolled in a 4-year college, projected to complete the bachelor's degree, and the adjusted percentage after taking into account the covariation of the variables listed in the table and SAT score   32   11 Percentage of highly or very highly college-qualified 1992 high school graduates who enrolled in a 4-year college, projected to have no degree and not be enrolled, and the adjusted percentage after taking into account the covariation of the variables listed in the table and SAT score 33 B1 Standard errors for Table 1: Percentage of 1992 high school graduates who took the steps toward 4-year college enrollment, by selected characteristics"}, {"section_title": "Introduction", "text": "Research has shown that black and Hispanic students and those with low income or low socioeconomic status (SES) are less likely than other students to enroll in postsecondary education. One reason these groups do not enroll is that they are not prepared for postsecondary education while in high school. However, a recent study of the high school class of 1992 showed that if students are \"college qualified\" and take the steps necessary to enroll in a 4-year college, enrollment rates among these racialethnic and income groups are virtually the same.2 Nonetheless, the question of what happens to these college-qualified students after they enter a postsecondary institution remainsmere access does not necessarily lead to completion.3 This analysis uses data from the first three survey waves of the National Education Longitudinal Study of 1988 (NELS:88/94) and the data from the Beginning Postsecondary Students Longitudinal Study survey and follow-up (BPS:89/90) to examine this question."}, {"section_title": "Borrowing an Analogy", "text": "People have used several analogies to describe the paths students take through high school and college in the pursuit of a bachelor's degree. The analogy of a pipeline has been used by the National Science Foundation to describe the pathway to science, mathematics, and engineering degrees.4 Others have used the pipeline analogy to describe the pathways through high school to entrance into a 4-year college or university.5 The analogy of a trackthe persistence trackhas been used to describe the path that many students take through college.6 Staying \"on track\" in this context means continuing through postsecondary education until one's educational objectives are met. In a recent book, William Bowen and Derek Bok used the analogy of a river to describe the flow of students through the educational system to a 4-year degree and beyond.? They argue that the image of a pipeline brings to mind a system that is more clearly defined and smooth than it actually isespecially to those in the \"pipeline.\" The mental picture of a river, however, captures the reality of the bends and turns in the path to a 4-year degree. Without knowledge of what is around the bendfor example, taking the SATs to get into a 4-year institutionsome students are wrecked on \"hidden shoals or snags\" in the river and fail to reach their goal of a 4-year degree. Throughout this report. the analogy of a river is used to describe the pathway to a 4-year postsecondary institution. The report starts with an analysis of the bends in the river to the point of entry into a 4-year institutionaspiring to a bachelor's degree while in the 10th grade, being academically prepared for college, taking the SAT/ACT, and applying to a 4-year institution. The conceptualization of one juncturebeing academically prepared for collegeis based on previous work with the NELS data. In a recent report on access to 4-year colleges, Berkner and Chavez created a scale that captured students' readiness for college.8 According to their scheme, a \"college-qualified\" student has a minimum high school grade point average of 2.7, a high school class percentile rank of at least 54, a NELS:88/94 composite test percentile score of at least 56, a combined SAT score of at least 820, or a composite ACT score of at least 19. Being \"college qualified\" was shown in that work to be particularly important for college access. To set the context for the analysis of college persistence and attainment, this report briefly reexamines the characteristics of those members of the high school class of 1992 who were deemed college qualified by their academic preparation in high school. The report then explores projected 4-year college persistence rates of 1992 high school graduates who were college qualified, using merged data from NELS:88/94 and BPS:89/90. The next section briefly describes this data set. characteristics of students in the other data set. Each respondent in the NELS data set was matched with a respondent in the BPS data set based on age, sex, raceethnicity, SES, and the characteristics of their first postsecondary enrollment status (e.g., full-or part-time or type of institution). Thus, pairs of respondents in each data set were linked, creating a \"synthetic cohort.\" With the merged data from BPS, the progress of the 1992 cohort of college-qualified students can be inferred through the first 4 years after they first enrolled in a 4-year institution. For example, a black, high-SES NELS respondent who first enrolled in a public 4-year institution full time immediately after high school was matched with a BPS respondent with identical characteristics. This BPS respondent's postsecondary outcomes were then attached to the NELS sample member. Appendix B of this report provides a further explanation of the statistical methods used to create this merged data set. One of the first steps in the process of earning a 4-year degree is preparing to enter a 4-year institution upon graduation from high school. Such a model has been used recently with the NELS data to examine the path through high school to any 4-year college.9 The junctures in this model are as follows: Having aspirations for a bachelor's degree in the 10th grade; Preparing academically for college; Taking college entrance exams; Applying to a 4-year college; and Enrolling in a 4-year college. These junctures are presented in figure 1 for all 1992 high school graduates. Jumping to the last \"bend in the river,\" about 40 percent of the high school class of 1992 had taken all of the steps to enrollment in a 4-year institution including enrolling in a 4-year postsecondary institution by 1994 (table 1 and figure 1). About 34 percent of high school seniors never entered \"the river\" because (for a variety of reasons) they were not striving for this level of education in the 10th grade. Of those who aspired to a bachelor's degree, the most difficult juncture was becoming academically prepared for college (figure 1). About 10 percent of 1992 graduates were no longer on their way to a 4-year institution because they were not minimally qualified for college. (More about this later.) This is in comparison with 3 percent who then failed to take a college entrance exam, 6 percent who did not apply to a 4-year institution, and 6 percent who did not enroll in a 4year institution (even though they had applied). Family income has long been known to be positively associated with educational attainment. It was also associated with successfully navigating the bends in the river to a 4-year college or university. As the level of family income increased, high school graduates were more likely to have passed through each of the steps toward enrollment in a 4-year institution (table 1 and figure 2). Moreover, moving from mere aspirations to being minimally academically 9L. Horn and C.D. Carroll, Confronting the Odds: Students at Risk and the Pipeline to Higher Education  (Washington D.C.: U.S. Department of Education, National Center for Education Statistics, 1997)."}, {"section_title": "17", "text": "Figure 1Percentage of 1992 high school graduates who prepared for enrollment in a 4-year college or university 'The proportion of students at each step is based on those who successfully completed all the preceding steps. 2Risk factors are low SES quartile, average grades of Cs or lower from sixth to eighth grade, changed schools two or more times other than normal progression, lived in a single-parent family, had one or more older siblings who dropped out of high school, or held back a grade before. qualified was more difficult for graduates from low-income families than those from highincome families. About 13 percent of low-income graduates aspired to this level of education but do not become academically qualified (51 percent minus 38 percent) compared with 6 percent of high-income graduates. "}, {"section_title": "Characteristics of Graduates Qualified for College", "text": "As shown above, becoming academically qualified for college was one of the largest obstacles for 1992 high school graduates. Since this was such a big step for many students, this section takes a closer look at which graduates were and were not college qualified. In their report on access to 4-year colleges, Berkner and Chavez created a scale that captures students' readiness for college.10 Judgments about a student's \"academic qualifications\" for college were based on a composite of high school grade point average, high school class rank, 1992 NELS test score performance, combined SAT score, and composite ACT score. Students were categorized as 1) very highly qualified, 2) highly qualified, 3) somewhat qualified, 4) minimally qualified, and 5) marginally or not qualified. At least minimally \"college-qualified\" 1°See Berkner and Chavez, Access to Postsecondary Education for the 1992 High School Graduates. 2o students were those whose highest value on five criteria would put them into the top 75 percent of 4-year college students. Minimum values were a 2.7 GPA, a class rank of at least 54, a NELS:88 composite test percentile score of at least 56, a combined SAT score of at least 820, or a composite ACT score of at least 19.11 A majority (65 percent) of 1992 high school graduates were at least minimally qualified for college. That is, about 35 percent were marginally or not qualified (table 2). About 14 percent were very highly qualifiedmeaning that they were among the top 10 percent of all undergraduate students. The percentage of students qualified for college varied by sex, raceethnicity, parental education level, and at-risk status. Females were more likely than males to be at least minimally qualified for college (68 percent compared with 61 percent). However, similar percentages of males and females were very highly qualified. White and Asian high school graduates were more likely than their black or Hispanic peers to be at least minimally qualified. About 68 percent of white students and 73 percent of Asian students were at least minimally qualified compared with 47 percent of black and 53 percent of Hispanic students. Furthermore, high-income graduates were more likely to be at least minimally college qualified than were their lower income peers, as were graduates with parents with higher education levels compared with those with lower education levels. Eighty-six percent of highincome students and 82 percent of students with a college-educated parent were at least minimally qualified, compared with 52 percent of low-income students and 47 percent of students whose parents did not attend college. White and Asian graduates, graduates from high-income families, and families with high educational levels were also more likely than were their peers without these characteristics to be very highly qualified for college (table 2). About 15 percent of white and 23 percent of Asian graduates were very highly qualified compared with 6 percent of blacks and 8 percent of Hispanics. Students \"at risk\" have traditionally been defined as having those characteristics that have been shown in prior research to increase their risk of dropping out of high schoo1.12 In the present study, students were classified as at risk in the eighth grade if they 1) came from low SES families, 2) had a C average or lower in the sixth to eighth grade, 3) changed schools two or more 11For details of how this variable was created, see appendix A. 12P. Kaufman and D. Bradby, Characteristics of At-Risk Students in N ELS:88 (NCES 92-042) (Washington, D.C.: U.S. Department of Education, National Center for Education Statistics, 1992). times other than normal progression,13 4) lived in single-parent families, 5) had one or more siblings who dropped out of high school, or 6) had been held back a grade. \"For example, normal progression from middle school to high school."}, {"section_title": "22", "text": "Graduates with no risk factors were more likely to be at least minimally qualified than were their peers with one or more risk factors. About 34 percent of those with three or more risk factors were at least minimally qualified compared with 81 percent of those with no risk factors. Similarly, 22 percent of those with no risk factors were highly qualified for college, compared with 3 percent of those with three or more risk factors."}, {"section_title": "Enrollment in a 4-Year Institution", "text": "Overall, about 45 percent of the whole high school class of 1992 enrolled in a 4-year institution by 1994 (figure 3).14 However, there were differences in enrollment rates according to student characteristics. For example: Hispanics were less likely than whites to enroll in a 4-year institution; Low-income students were less likely to enroll than higher income students; Students with more highly educated parents were more likely than others to enroll; and Students with fewer risk factors enrolled at higher rates than those with more risk factors. However, when one looks just at those 1992 graduates who were college qualified and took the necessary steps to enrollthose who took college entrance exams and applied to a 4-year institutionmany of these differences diminish or disappear. For example, among collegequalified students who took the steps to enroll, 77 percent of Hispanics enrolled in a 4-year school compared with a statistically indistinguishable 82 percent of black students and 84 percent of white students. Furthermore, college-qualified students with one or two risk factors enrolled at similar rates as those with no risk factors-87 percent for those with none compared with 83 percent with one and 79 percent with two risk factors. While, among college-qualified students, those with college-educated parents still enrolled at higher rates than those with parents without a college degree, these differences were less striking than the differences shown above among all graduates. For example, about 26 percent of all graduates with parents with a high school education enrolled in a 4-year college, compared with 71 percent of those with parents who had a college degreea 45 percentage-point difference. Among college-qualified graduates, this difference was 14 percentage points-76 percent versus 90 percent.  The previous sections indicated that among students who were \"college qualified\" and took the steps necessary to enroll in a 4-year college, enrollment rates among racialethnic and income groups were virtually the same. Nonetheless, the question of what happens to these college-qualified students after they enter a postsecondary institution remainsmere access does not necessarily lead to completion. Using the combined NELS/BPS data, it was possible to project what would have happened to these college-qualified 1992 graduates after they entered a 4-year college based on the experiences of the BPS cohort. Figure 4 projects postsecondary outcomes for a standard cohort of 1,000 college-qualified 1992 high school graduates who entered a 4-year institution in the 1992-93 academic year. The figure illustrates the projected flow of the high school class of 1992 through the first four years after graduation. For example, of 1,000 1992 high school graduates who entered a 4-year institution in the 1992-93 academic year, 832 continued to be enrolled in the 4-year sector in the 1993-94 academic year. That is, 83 percent stayed \"on the river\" between their first and second academic years. For simplicity of presentation, the findings in this section are discussed as if outcomes of the sample of 1992 high school graduates were actually observed rather than inferred. However, the reader should keep in mind the findings are based on projected data."}, {"section_title": "Persistence", "text": "There are a variety of ways to measure persistence in 4-year colleges and universities.15 In this report persistence is defined as continued enrollment in the 4-year sectorregardless of whether the student was continuously enrolled in the same institution. Measured in this manner, the projected persistence rates for 1992 high school graduates who continued in the 4-year sector from the previous year were quite high. In the first year, 83 percent stayed, 91 percent of those persisted into their second year, and 80 percent of those who persisted into their second year persisted into their third year (figure 4). Five years after high school graduation, 307 of the original 1,000 college-qualified students (31 percent of the total) were still enrolled in a 4-year institution and had not yet earned a bachelor's degree.  Figure 4Projected persistence, degree attainment, and nondegree departure among 1992 high school graduates enrolled in a 4-year institution in the 1992-93 academic year Nondegree Departure Students can stop attending college in a variety of ways. One way is to drop out of the 4year sector without attaining any degree. About 17 percent of the 1992 graduates were projected to have dropped out of the 4-year sector after their first year. Out of the original 1,000 students, 86 transferred to a less-than-4-year institution, 41 stopped out, and 42 left and never returned to postsecondary education (figure 4). By the end of the second year, 9 percent of those who were enrolled the previous year dropped out of the 4-year sector-1 percent of the total transferred downward, 4 percent stopped out, and 2 percent left and did not return. (Out of the original 1,000 students, 12 transferred downward, 38 stopped out, and 21 left and did not return.) By the end of the third year, 16 percent of those who were enrolled the previous year dropped out-5 percent of the initial group transferred downward, 4 percent stopped out, and 3 percent left and did not return. After the fourth year, 8 percent of those who were enrolled the previous year dropped out percent of the original 1,000 students transferred downward, 1 percent stopped out, and 2 percent left and did not return. After four years, 120 of the original 1,000 students (12 percent of the total) were not enrolled in postsecondary education. About 133 students (13 percent of the original total) were enrolled, but not in a 4-year institution, and 96 students (10 percent of the original total) were reenrolled in a 4-year institution."}, {"section_title": "Degree Attainment", "text": "Another reason students stop attending a 4-year institution is that they achieve their degree objectives. After 4 years, a projected 29 percent of the high school class of 1992 who had entered a 4-year institution in the 1992-93 academic year received a bachelor's degree. About 26 percent had received their degree through continual enrollment in the 4-year sector, while another 3 percent received a bachelor's degree after leaving the 4-year sector but then returning (figure 4). As expected, most of the predicted bachelor's degrees were earned in the fourth year-84 percent of the predicted degrees earned by all of the original cohort after 4 years were earned in the last year by students who had been continuously enrolled. Some college-qualified students may have left the 4-year sector after attaining a certificate or associate's degree. About 4 percent of the 1992 high school graduates were projected to have received an associate's degree after 4 years, while 2 percent received some type of postsecondary certificate."}, {"section_title": "Differences Between Non-Hispanic White and Black Students", "text": "Figures 5 and 6 show the flow through their first four years of college separately for black and white students. While the sample size for black students is relatively small and the Figure 5Projected persistence, degree attainment, and nondegree departure among black non-Hispanic 1992 high school graduates enrolled in a 4-year institution in the 1992-93 academic year ESTCOPYAVAILA:LE corresponding standard errors are large, several differences between white and black students are statistically significant. In particular, after four years, black students were more likely than white students to be not enrolled without any degree (18 percent for blacks compared with 9 percent for whites). After four years black students were less likely to have completed a bachelor's degree (14 percent for black students compared with 29 percent of white students). Figure 6Projected persistence, degree attainment, and nondegree departure among white non-Hispanic 1992 high school graduates enrolled in a 4-year institution in the 1992-93 academic year While the overall persistence and attainment rates shown above are of interest in themselves, the main purpose of this report is to examine differences in persistence and attainment rates for college-qualified students with different background characteristics. After 4 years, females were more likely than males to still be enrolled or have a degree-72 percent of males (100 percent minus 28 percent with no degree and not enrolled) compared with 77 percent of females (table 3). Females were also more likely to have earned their bachelor's degree. About 37 percent of females had earned their bachelor's degree after 4 years, compared with 22 percent of males. Black students were more likely than white students to be not enrolled and not have earned a degree after 4 years. About 41 percent of black students who had been college qualified and had enrolled in a 4-year institution in their first year out of high school were estimated to not be enrolled and to have not earned a degree or certificate 4 years later. Black students were also less likely than white students to have earned a bachelor's degree 4 years after entering a 4-year institution. Approximately 13 percent of blacks were estimated to have earned a bachelor's degree compared with 32 percent of whites. t6 Family income was generally not associated with either persistence or degree attainment. However, college-qualified students who had a parent with a college education were more likely to persist and were more likely to receive their bachelor's degree than were students whose parents had no college experience. High school graduates who were more highly qualified for college before entering a 4-year college were more successful once they got there. After 4 years, higher qualified students were more likely to attain a degree or certificate of some kind and were more likely to have earned a bachelor's degree (table 3). Five years after first enrolling in a 4-year institution, lower qualified graduates were more likely to no longer be enrolled without having earned any kind of degree or certificate (table 3). I6The apparent differences between black students and Hispanic and Asian students were not statistically significant. . BEST. COPY AVAILABLE Eighth-grade risk factors had no notable association with either persistence or degree attainment. About the same proportion of college-qualified students persisted and received their bachelor's degree regardless of how many risk factors they had."}, {"section_title": "*, r", "text": ""}, {"section_title": "Highly College-Qualified Students and Minimally Qualified Students", "text": "The findings presented so far considered all students who were at least minimally qualified for college. That is, they had either a minimum of a 2.7 high school GPA, a class percentile rank of at least 54, a NELS test composite of at least 56, a combined SAT score of at least 820, or a composite ACT score of at least 19. A wide range of ability and knowledge is included within this group of at least minimally college-qualified students, from students who were barely qualified for a 4-year college (e.g., they had an SAT of 820) to those who were very highly qualified (e.g., they had an SAT of 1530).17 Differences found in the previous section between groups defined by their parental education and raceethnicity may be due to variability among these groups in their qualifications for college. That is, minimally qualified students may have parents with lower levels of education than those of highly qualified students. This section attempts to control for some of these differences by separating those students who were only minimally or somewhat qualified from those who were highly or very highly qualified for college. Looking at just those students who were minimally or somewhat qualified for college, family income did not seem to be associated with either persistence or degree attainment in this group (table 4). However, white students who were only minimally or somewhat college qualified were much more likely than black and Hispanic students to have earned a bachelor's degree after 4 years-30 percent of whites compared with 12 and 13 percent of blacks and Hispanics, respectively (table 4). Looking at just those students who were highly or very highly college qualified revealed somewhat different patterns (table 5). Highly or very highly qualified students were those students whose highest value on any of the five criteria put them in the top 25 percent of 4-year college students. Minimum values were 1) a minimum high school GPA of 3.6 or higher; 2) a class rank percentile of at least 89; 3) a NELS composite test percentile of at least 90; and 4) a combined SAT of at least 1100 or a composite ACT of at least 25. As with those minimally or somewhat qualified, there was no significant differences in the proportion of low-, middle-, and high-income students who were not enrolled and had no degree after 4 years. However, middle-income students within this group were less likely than  "}, {"section_title": "21", "text": "Table 5-Percentage distribution of highly or very highly college-qualified 1992 high school graduates who enrolled in a 4-year college, according to projected persistence and attainment 4 years after high school graduation, by selected student characteristics The pattern among racial-ethnic groups was also somewhat different for just those students who had been highly or very highly qualified compared with the other groups of students examined above (table 5). While white students who were only minimally or somewhat college qualified were more likely than Hispanic students to have earned a bachelor's degree after 4 years, 5 these differences did not exist among those students who were highly or very highly qualified. About 33 percent of white highly or very highly qualified students had earned bachelor's degrees compared with 34 percent of Hispanics. However, black students who were highly qualified or very highly qualified were less likely than whites or Hispanics to have earned a bachelor's degree (or any degree or certificate) 4 years after enrolling in a 4-year college. About 14 percent of blacks were projected to have earned a bachelor's degree. Four years after first enrolling in a 4-year college, a projected 46 percent of black highly or very highly qualified students were no longer enrolled in college and had not earned any kind of degree or certificate."}, {"section_title": "Student Debt18", "text": "About half of all undergraduate students in the United States receive student financial aid to support their education. Who borrows and the amount they borrow is heavily dependent on the student's enrollment status (full-or part-time), their dependency status (whether they still live with their parents), and the type of institution they attend (e.g., 4-year private, 2-year public). Using the merged NELS/BPS data set, one can project who among the high school class of 1992 received financial aid in their first four years of undergraduate education and the amount that they borrowed. About half of all 1992 high school graduates who enrolled in a 4-year institution borrowed for their education (table 6).19 The proportion that borrowed varied little regardless of whether they finished their education or not. About 51 percent of those who attained a degree after 5 years had borrowed, 57 percent of those who had not received a degree but were still enrolled had borrowed, and about 46 percent of those who were no longer enrolled and had no degree had borrowed. The percentage that received a loan also did not vary greatly by college qualificationsapproximately the same proportion borrowed whether they were minimally qualified or very highly qualified.20 The picture changes somewhat when one looks at the amount that students borrowed for their education (table 7). Four years after high school graduation, those who were projected to have no degree and not be enrolled had borrowed less than those who attained a degree$5,800 compared with $11,200. This may be due to a number of factors, including the type of institution in which the students enrolled, their full-time or part-time status, or their dependency status. While a full understanding of the association of degree attainment and borrowing is beyond the scope of this report, it is informative to look at the amount of debt burden that accrued to students who left the 4-year sector without receiving any type of degree. In particular, highly qualified students ended their initial college career with a larger debt burden that did those less qualified. Of those minimally qualified students who entered a 4-year institution, about 42 percent had taken out a loan and had borrowed an average of about $3,600. Of the 21 percent of highly qualified students who had no degree and were not enrolled (table 3), about 45 percent had borrowed for their education and had borrowed about $8,000.21 21NEB Data Analysis System. 37 Table 7-Average amount borrowed among college-qualified' 1992 high school graduates who borrowed for their education, according to projected persistence and attainment 4 years after high school graduation, by selected student characteristics "}, {"section_title": "Summary of Tabular Results", "text": "The original question posed by this analysis was what happens to college-qualified students once they enter a 4-year institution. Research by Berkner and Chavez had shown that the wellknown differences in college enrollment rates for different groups of students were attenuated when one considered only those students who were qualified for college. The initial portion of this analysis summarized these findings by showing that for college-qualified students there were few differences in 4-year enrollment among students from different racial-ethnic backgrounds or from different families with different income levels. College-qualified students whose parents had a college degree enrolled at rates higher than other students, but the difference was less for college-qualified students than for students as a whole. Furthermore, in analyzing the outcomes of college-qualified students after they enrolled in a 4-year college or university, there appeared to be few differences associated with two factors that are usually correlated with educational outcomes. That is, family income and prior academic risk factors did not seem to be variables associated with either persistence or attainment. However, among all college-qualified students, those with college-educated parents were more likely than other college-qualified students to persist and/or attain a bachelor's degree in 4 years. This makes some intuitive sense if one again imagines the path to a 4-year degree as a river with many bends and twists to it. College-educated parents have already navigated this same river and may be able to help their children see beyond the next bend and keep them on course. Alternatively, students with college-educated parents may have other resources at their command that other students do notsimple parental expectation and encouragement may be one of them. A less intuitive finding was that all college-qualified black students (and even highly qualified black students) were less likely than white peers after 4 years to have received a college degree and were more likely to no longer be enrolled. However, in analyzing these factors associated with persistence and attainment of college-qualified students, the analysis so far looked at each variable or factor individually. Many of the variables presented above are related to one another. For example, parents' education is associated with raceethnicity. Therefore the differences in the persistence and attainment rates between highly college-qualified white and black students shown above may be due to differences in the parental education of black and white students. White students may have been more likely to have college-educated parents than did black students and, as speculated above, this may be to the advantage of white students in their pursuit of a 4-year degree. Therefore, to isolate some of these associations, a multivariate analysis was conducted on these data. The results of this analysis are presented in the next section."}, {"section_title": "26", "text": ""}, {"section_title": "Controlling for Related Variables", "text": "In this section linear regression models are used to determine the net individual influence of each variable examined in the descriptive analysis on the persistence and attainment rates. (See appendix B for details on the multivariate methods used here.) The analysis looked at just two outcomes: 1) nonpersistencedefined as not having any degree and not being enrolled 4 years after high school, and 2) bachelor's degree attainment 4 years after graduating from high school. The sample of students was further restricted to those who were highly or very highly college qualified. The results of this analysis of attaining a bachelor's degree are shown in table 8. The first column shows the unadjusted percentages of at least highly qualified students who had received a bachelor's degree 4 years after high school graduation. These percentages match the percentages originally shown in column 7 of table 5 above. The second column presents the adjusted percentages, for which the variation of all the other variables in the table has been controlled. The italicized row is the comparison group within a row variable. The adjusted percentages differ very little from the unadjusted percentages shown in table 5. Even after controlling for sex, parents' education, parents' income, and number of risk factors present, highly qualified black students were projected to be less likely than white students to attain a bachelor's degree. Table 9 shows the results from the adjustment of the percentages of column 3 in table 5 abovethe percentage of 1992 graduates who, after 4 years, were projected to be no longer enrolled and to have not received any type of degree. The adjusted percentages in table 9 also differ very little from the unadjusted percentages. After controlling for other variables in the table, blacks were also more likely than whites to be out of college and without a degree 4 years after high school graduation. However, even within this group of high and very highly qualified students there was a high degree of variation in \"qualifications.\" These differences may also be the source of the observed differences between black and white projected attainment and persistence rates. To be classified as highly or very highly college qualified, students had only to meet one of five criteria. These criteria were 1) a minimum high school GPA of 3.6 or higher; 2) a class rank percentile of at least 89; 3) a NELS composite test percentile of at least 90; or 4) a combined SAT of at least 1100 or a composite ACT of at least 25. Therefore, a highly qualified student could have "}, {"section_title": "41", "text": "Table 9-Percentage of highly or very highly college-qualified 1992 high school graduates who enrolled in a 4-year college, projected to complete no degree and not be enrolled, and the adjusted percentage after taking into account the covariation of the variables listed in the "}, {"section_title": "4 2", "text": "Controlling for Related Variables been in the top 10 percent of his or her high school class, but still have relatively low SAT scores. For example, within the categories of \"highly qualified\" and \"very highly qualified\" there was significant variation among racialethnic groups in their mean SAT scores (figure 7). Black highly qualified students had an average SAT score 151 points lower than white highly qualified students, while black very highly qualified students had SAT scores 166 points below those of very highly qualified .white students. These differences in qualifications may be confounding the association of raceethnicity with persistence and attainment among highly qualified students. To further control for this variation in academic background, individual SAT scores are added as a control variable in tables 10 and 11 (while not actually presented as a row variable).22  "}, {"section_title": "43", "text": "The percentage of highly or very highly qualified black students projected to have finished a bachelor's degree after 4 years was no longer statistically different from the rate for whites (table 10) (although it was significant at the 0.10 level). However, the percentage of black students projected to no longer be enrolled without obtaining a degree was still significantly higher than the percentage for whites, even after holding individual SAT scores constant (table 11).  "}, {"section_title": "46 Summary", "text": "It is well known that there are overall disparities in the college enrollment rates of students from different socioeconomic and racialethnic backgrounds. Low-income students and underrepresented minority students enroll in 4-year colleges and universities at lower rates than do white students. Research by Berkner and Chavez cited in this report has demonstrated that if students are college qualified and if they take the appropriate steps that lead to enrolling in a 4-year college or university, these differences in enrollment rates diminish. These findings were repeated in the beginning sections of this report. The contribution of this report was to project, to 4 years after high school completion, the persistence and attainment rates for those college-qualified students in the high school class of 1992 who enrolled in a 4-year institution in the 1992-93 academic year. Generally, 4 years later, outcomes were similar for college-qualified students despite initial differences in demographic backgrounds. Among all college-qualified students, those who had a parent with a college degree were more likely to have persisted and to have attained a degree, but this appeared to be the result of the higher overall college qualifications of students whose parents had a college education. Among students who were minimally or somewhat qualified and again among students who were highly or very highly qualified, parental education was not associated with higher projected persistence or attainment rates. The one comparison that stood out in this analysis was the difference between white and black projected persistence and attainment rates. While the statistical methods that were employed were quite simple, none of the statistical controls that were applied to the data had the effect of eliminating these differences. Controlling for parents' education, family income, and the student's SAT scores did not significantly affect this basic finding. This finding does conform to results found by other researchers that even highly qualified black college students graduate at lower rates than their white peers. For example, Vars and Bowen found that in the 11 selective schools they studied, black students at every level of SAT score had lower grades and graduated at lower rates than comparable white students.23 They also found that the performance gap between whites and blacks was greatest for those at the highest SAT score levels. However, because the present study examined projected persistence and attainment rates and the methods used to analyze the data were basically descriptive in nature, this study can only suggest conclusions about actual attainment rates and persistence rates. That our results conform to results found elsewhere should give one confidence that our projections are accurate in the aggregate."}, {"section_title": "48", "text": "the National Education Longitudinal Study: 1988-94 andBeginning Postsecondary Student Study: 1989-90 Linkage Data File Data Analysis System (DAS) (see appendix B for a description of the DAS). These variables were either items taken directly from the NELS or BPS surveys or they were derived by combining one or more items in these surveys. Unless otherwise noted, the variable labels are those appearing in the DAS. Applied to a 4-year institution APP4YR"}, {"section_title": "Glossary Index", "text": "This derived variable describes whether or not a respondent ever applied to a 4-year institution. It is based primarily on student-reported data. Yes Respondent applied to a 4-year postsecondary institution."}, {"section_title": "No", "text": "Respondent did not apply to a 4-year postsecondary institution. Weight for BPS imputed data BPSLNKWT Weight created for the BPS/NELS study where BPS persistence variables are used to project persistence and attainment by NELS participants over a five-year time period."}, {"section_title": "Number of risk factors 1988 BYRISK2", "text": "Number of risk factors 1988. The sum of 6 possible risk factors determined to increase the chances of dropping out of high school after controlling for SES and race/ethnicity. Note that this variable is different from BYATRISK. All of the risk factors were identified in 8th grade with the exception of students having older siblings who dropped out of high school, which was asked in the tenth grade. If a student had missing data for 2 or more risk items, the variable was set to missing. Risk factors are as follows: 1. Low SES (BYSES); 2. Single parent family (BYFCOMP); 3. Older sibling dropped out (F1S94); 4. Changed schools 2 or more times (BYP40) (reported by the parent); 5. Average grades of Cs or lower from 6th to 8th grades (BYGRD68); 6. Repeated an earlier grade (BYS74). For this study, a composite measure of 4-year college readiness or qualification index was developed that uses cumulative academic coursework GPAs, senior class rank, the NELS 1992 test scores, and the SAT and ACT college entrance examination scores. Since admission standards and requirements vary widely among 4-year colleges and universities, the approach used here was to examine the actual distribution of these five measures of academic aptitude and achievement among those graduating seniors who did attend a 4-year college or university. Data sources were available for approximately half (45 percent) of the NELS graduating seniors for four or five of the criteria: class rank, GPA, the NELS test, and ACT or SAT scores or both. For about one-third of the seniors there were only three data sources available because they had no ACT or SAT scores. All of these had NELS test scores, however."}, {"section_title": "None", "text": "In order to identify as many students as possible who were potentially academically qualified for a 4-year college, even if data were missing for these students on some of the criteria, the seniors were classified according to the highest level they had achieved on any of the five criteria for which data were present. The initial classification of the graduating seniors was determined as follows: Very highly qualified: those whose highest value on any of the five;lcriteria would,put them among the top 10 percent of 4-year college students (specifically the NELS 1992 gratifaing'Seniors who enraleiltiritiyear col-50\" leges and universities) for that criterion. Minimum values were GPA=3.7, class rank percentile=96, NELS test percentile=97, combined SAT=1250, composite ACT=28. Highly qualified: those whose highest value on any of the five criteria would put them among the top 25 percent of 4-year college students for that criterion. Minimum values were GPA=3.6, class rank percentile=89, NELS test percentile=90, combined SAT=1110, composite ACT=25. Somewhat qualified: those whose highest value on any of the five criteria would put them among the top 50 percent (i.e.; in the second quartile) of 4-year college students for that criterion. Minimum values were GPA=3.2, class rank percentile=75, NELS test percentile=76, combined SAT=960, composite ACT=22. Minimally qualified: those whose highest value on any of the five criteria would put them among the top 75 percent (i.e., in the third quartile) of 4-year college students for that criterion. Minimum values were GPA=2.7, class rank percentile=54, NELS test percentile=56, combined SAT=820, composite ACT=19. [Those in vocational programs (according to their high school transcript) were classified as not college qualified.] Marginally or not qualified: those who had no value on any criterion that would put them among the top 75 percent of 4-year college students (i.e., all values were in the lowest quartile). Then some adjustments were made for programs of rigorous academic coursework, defined as including at least 4 years of English; 3 years each of science, mathematics, and social studies; and 2 years of a foreign language. Those who had taken a program of rigorous academic courses were moved up into one higher level of qualification: and Those in the \"very highly qualified\" category were moved down into the \"highly qualified\" category if they had not taken the rigorous academic coursework; Student was minimally qualified to attend a 4-year college. Student was somewhat qualified to attend a 4-year college. Student was highly qualified to attend a 4-year college. Student was very highly qualified to attend a 4-year college. For some tables, students were identified as \"college qualified\" if they were other than \"marginally or not qualified\" for the variable CQCOMV2.\nPrivate, for-profit Private, not-for-profit less-than-4-year Public less-than-2-year Public 2-year Private, not-for-profit 4-year Public 4-year Missing, legitimate skip Gender as of 1994 F3SEX Frequencies for this variable were created with F3QWT. 1992 data for gender were preloaded into the CATI instrument and displayed to the interviewer. There were no missing values in the 1992 data and the question was never asked. In a few instances it became apparent to the interviewer that the 1992 value was incorrect and the value was corrected. The hard copy questionnaire did not include this question and 1992 values were used for the hard copy respondents."}, {"section_title": "39", "text": "Ever took SAT/ACT/applied to 4-year college (composite) EXMAPLY2 This variable resolves the inconsistencies in student reporting of where they applied and where they were first enrolled (EXMAPLY1). The specific purpose of this composite variable is to consider type of institution first attended (PSEFIRTY). Students who attended a 4-year institution (as revealed in PSEFIRTY) probably applied to such an institution. Therefore, students who indicated that the first type of postsecondary institution they enrolled in was a 4year institution were considered to have applied to at least one 4-year institution for the purpose of determining the steps students must take in order to attend a 4-year college. First, EXMAPLY2 was set equal to EXMAPLY1. If EXMAPLY1 was equal to2 (student took exam but did not apply) and they indicated that their first type of postsecondary institution was a 4-year institution, EXMAPLY2 was set equal to 1 (took exam and applied). Similarly, if EXMAPLY1 was equal to 4 (student did not take an exam nor did they apply) and they indicated that their first type of postsecondary institution was a 4-year institution, EXMAPLY2 was set equal to 3 (did not take exam but applied). Family income in 1991 F2P74 In 1992, parents were asked, \"What was your total gross family income from all sources before taxes in 1991 (If you are not sure of the amount, please estimate)?\" For purposes of this report, the original 13 income categories were collapsed into three. Low (less than $25,000) Family income was less than $25,000. Middle ($25,000$74,999) Family income was between $25,000 and $74,999. High ($75,000 or higher) Family income was $75,000 or higher."}, {"section_title": "Parents' highest education leve11992 F2PARED", "text": "This composite characterizes the level of education attained by the parent with the highest reported education level. It was constructed using second follow-up parent questionnaire data; data from earlier survey waves were used if data were missing. For purposes of this report, levels of education were collapsed to create three categories. High school graduate or less Highest level of parental education was either high school graduation or less than high school graduation."}, {"section_title": "Some college", "text": "Highest level of parental education was greater than high school and less than 4-year degree. 1992 data for this variable were preloaded into the CATI instrument. The question was asked only in instances where the 1992 value was missing. If it became apparent from responses to other questions that the preloaded value was incorrect, this variable's value was corrected. This question was not asked at all in the hard copy questionnaire and 1992 values were used for these sample members. Sample members with the value of Other were assigned the value -1 for this data file. Frequencies for this variable were calculated with F3QWT. F3RANK_C is a measure of a student's class rank during the last year he or she attended high school. It draws on F2RRANK (class rank for last year attended) and F2RCSIZE (class size for last year attended) from the 1992 transcript data and the 1994 cross sectional weight, F3QWT. It is calculated by dividing the class rank by the class size and subtracting the result from 1. The weighted distribution of these values is determined using F3QWT and percentiles assigned. The valid values of the percentiles ranges from 1-99, with the first 1.5 percent assigned the value 1 and the highest 1.5 percent assigned the value of 99. The value of 99 thus indicates the highest-ranking students and the value of 1 indicates the lowest."}, {"section_title": "Asian or Pacific Islander", "text": "Type of first postsecondary. institution F3SEC2A1 Frequencies for this variable were created with F3QWT. This variable contains the institution type associated with the first institution attended. The primary source is the SECTOR variable in the 1993/94 Integrated Postsecondary Education Data System (IPEDS) data file. SECTOR is recoded to 6 values for this variable. For the few instances where SECTOR is missing, the variable CONTROL from the same file is used."}, {"section_title": "Male Female", "text": "High school GPA (high school transcripts) GPA This variable is the overall grade point average on a 4.0 scale for all courses taken for a grade. It is multiplied by 100 for file purposes. Postsecondary persistence and attainment in academic year 1989-90 P8990 The difference between this variable and PER899OR is that this variable further distinguishes those who attained a certificate/degree in AY89-90 and re-enrolled in PSE later (e.g., in AY90-91, AY91-92, or AY92-93) from those who attained a certificate/degree in AY89-90 and left without re-enrolling. Note: the status of academic year of 1993-94 (PER9394R) was not considered in making this variable. Attained AA in AY89-90+re-enrolled later Attained BA in AY89-90+re-enrolled later Persisted to AY90-91 Downward/delayed transfer in AY89-90 Stopout in AY89-90 Left without return in AY89-90 Attained cert. in AY89-90+no further PSE"}, {"section_title": "54", "text": "Postsecondary persistence and attainment in academic year 1990-91 P9091 The difference between this variable and PER9091R is that this variable further distinguishes those who attained a certificate/degree in AY90-91 and re-enrolled in PSE later (e.g., in AY91-92 or AY92-93) from those who attained a certificate/degree in AY90-91 and then left without re-enrolling. In addition, those identified as not enrolled, downward, delayed transfer, stopout, left, or attained a certificate/degree without further PSE in AY89-90 were coded as \"Skip.\" Note: the status of academic year of 1993-94 (PER9394R) was not considered in making this vari- The difference between this variable and PER9192R is that this variable further distinguishes those who attained a certificate/degree in AY91-92 and re-enrolled in PSE later (e.g., in AY92-93) from those who attained a certificate/degree in AY92-93 and left without re-enrolling. In addition, those identified as not enrolled, downward, delayed transfer, stopout, left, or attained a certificate/degree without further PSE in AY89-90 or AY90-91 were coded as \"Skip.\" Note: the status of academic year of 1993-94 (PER9394R) was not considered in making this vari- The NELS:88/94 and BPS:89/90 linkage file was created to provide a set of variables from the NELS and the BPS datasets that would allow inferences to be made about the students in one dataset, based on the characteristics of students in the other survey. For example, there are high school achievement measures (e.g. qualifications for college) in the NELS survey but there are no long-term postsecondary outcome measures in the NELS survey. BPS data can be used to supplement the NELS data to obtain estimates of these long-term postsecondary outcomes. The two datasets share a fairly extensive set of common variables describing the background characteristics of sample members. These characteristics were used to link students in each of the datasets, thereby creating a type of \"synthetic cohort,\" to provide values for variables missing in the NELS dataset. In a sense, the data on long-term postsecondary outcomes in NELS (due to the censoring of the data 2 years after high school graduation), were treated as a huge missing data problem. These missing data were imputed for the NELS students using multiply imputation methods developed by Rubin, and later expanded upon by Rubin and Little.24 As a first step in this process we created the primary imputation cells from three variables of students' early postsecondary experiences: 1) type and level of first PSE institution; 2) timing of PSE entry (immediate or delayed); and 3) enrollment status (part-time vs. full-time). Within each of these cells, we performed a crosstabulation based on students' sex, race, and socioeconomic status. Because in each imputation cell, a minimal of 5 BPS donors was required for each NELS recipient, it was clear that cells defined by crossing students' sex, race, and SES in most of the primary cells needed to be collapsed in order to reach this requirement. As a result, a total of 67 imputation cells in BPS were created. The imputation was performed through hotdecking procedures in the computer program PROC IMPUTE developed by the American Institutes for Research. In this procedure a NELS student was matched with a BPS student with replacement (WR), and the data on postsecondary outcomes for the BPS student were assigned to the NELS student. This procedure was performed 36 times to capture the measurement error associated with the imputations. A disturbance term was added to the NELS sample weights to reflect this added source of error in the data. This disturbance term inflated the weight (BPSLNKWT) so that the variance component of the estimates associated with the size of the weight was also inflatedaccurately inflating the total variance of the estimate to account for measurement error due to imputation."}, {"section_title": "Accuracy of Estimates", "text": "The statistics in this report are estimates derived from a sample. Two broad categories of error occur in such estimates: sampling and nonsampling errors. Sampling errors occur because observations are made only on samples of students, not on entire populations. Nonsampling errors occur not only in sample surveys but also in complete censuses of entire populations. Nonsampling errors can be attributed to a number of sources: inability to obtain complete information about all students in all institutions in the sample (some students or institutions refused to participate, or students participated but answered only certain items); ambiguous definitions; differences in interpreting questions; inability or unwillingness to give correct information; mistakes in recording or coding data; and other errors of collecting, processing, sampling, and imputing missing data."}, {"section_title": "Data Analysis System", "text": "The estimates presented in this report were produced using the merged data from the National Education Longitudinal Study and Beginning Postsecondary Longitudinal Study (NEB) Data Analysis System (DAS). The DAS software makes it possible for users to specify and generate their own tables from the NEB data. With the DAS, users can replicate or expand upon the tables presented in this report. In addition to the table estimates, the DAS calculates proper standard errors25 and weighted sample sizes for these estimates. For example, table B1 contains standard errors that correspond to table 1 in the text, and was generated by the DAS. If the number of valid cases is too small to produce a reliable estimate (fewer than 30 cases), the DAS prints the message \"low N\" instead of the estimate. All variables in the DAS are integers. To preserve decimal precision for certain variables, values in the DAS have been multiplied by a factor of 10. For example, grade point averages range from 0-400 in the DAS. When averages for such variables appear in this report, estimates and standard errors were divided by the appropriate factor of 10 to restore the original scale. 25The NELS and BPS samples are not simple random samples and, therefore, simple random sample techniques for estimating sampling error cannot be applied to these data. The DAS takes into account the complexity of the sampling procedures and calculates standard errors appropriate for such samples. The method for computing sampling errors used by the DAS involves approximating the estimator by the linear terms of a Taylor series expansion. The procedure is typically referred to as the Taylor series method. 'The proportion of students at each step is based on those who successfully completed all the preceding steps. 2Risk factors are low SES quartile, average grades of Cs or lower from sixth to eighth grade, changed schools two or more times other than normal progression, lived in a single-parent family, had one or more older siblings who dropped out of high school, or held back a grade before. In addition to tables, the DAS will also produce a correlation matrix of selected variables to be used for linear regression models. Included in the output with the correlation matrix are the design effects (DEFTs) for each variable in the matrix. Since statistical procedures generally compute standard errors based on an assumption of simple random sampling, the standard errors must be adjusted with the .design effects to take into account NELS:88/94 and BPS:89/90's complex sample design. (See discussion under \"Statistical Procedures\" below for the adjustment procedure.) For more information about the NEB and other Data Analysis Systems, consult the NCES DAS website (www.nces.ed.gov/das) or its West Coast mirror site (www.pedar-das.org), or contact: Internet address: Aurora_D'Amico@ed.gov"}, {"section_title": "Statistical Procedures", "text": "Three types of statistical procedures were employed in this report: testing differences between means (or proportions), testing for linear trends, and adjustment of means after controlling for covariation among several variables. Each procedure is described below."}, {"section_title": "Differences Between Means", "text": "Most descriptive comparisons in this report were tested using Student's t statistic. Statistical significance was determined by calculating t values for differences between pairs of means or proportions and comparing these with published values of t for two-tailed hypothesis testing, using a 5 percent probability of a Type I error (a significance level of .05).26 Student's t values may be computed to test the difference between estimates with the following formula: Er -E2"}, {"section_title": "Se3", "text": "(1) where E1 and E2 are the estimates to be compared and set and see are their corresponding standard errors. Note that this formula is valid only for independent estimates. When the estimates are not independent (for example, when comparing a total percentage with that for a subgroup that is included in the total), a covariance term must be added to the denominator of the t-test 26A Type I error occurs when one erroneously concludes that a difference observed in a sample reflects a true difference in the population from which the sample was drawn. formula. When comparing the estimate for a total with that of a subgroup, the following formula was used: where p is the proportion of the total contained in the subgroup. ( 2)There are hazards in reporting statistical tests for each comparison. First, comparisons based on large t statistics may appear to merit special attention. This can be misleading, since the magnitude of the t statistic is related not only to the observed differences in means or percentages but also to the number of students in the specific categories used for comparison. Hence, a small difference compared across a large number of students would produce a large t statistic. A second hazard in reporting statistical tests for each comparison occurs when making multiple comparisons among categories of an independent variable. For example, when making paired comparisons among different levels of income, the probability of a Type I error for these comparisons taken as a group is larger than the probability for a single comparison. When more than one difference between groups of related characteristics or \"families\" are tested for statistical significance, one must apply a standard that assures a level of significance for all of those comparisons taken together. Comparisons were made in this report only when p<.05/k for a particular pairwise comparison, where that comparison was one of k tests within a family. This guarantees both that the individual comparison would have p<.05 and that for k comparisons within a family of possible comparisons, the significance level for all the comparisons will sum to p<. 05.27 For example, when comparing males and females only one comparison is possible. In this family, k=1, and there is no need to adjust the significance level. When students are divided into five racialethnic groups and all possible comparisons are made, then k=10 and the significance level for each test within this family of comparisons must be p<.05/10, or p<.005. The formula for calculating family size (k) is as follows: (3) \"The standard that p<.05/k for each comparison is more stringent than the criterion that the significance level of the comparisons should sum to p<.05. where j is the number of categories for the variable being tested. For example, in the case of a variable with five categories such as raceethnicity, one substitutes 5 for j in equation 3: Linear Trends Some comparisons across categories of an ordered variable with three or more levels involved a test for a linear trend across all categories, rather than a series of tests between pairs of categories. Two procedures were used to test the statistical significance of an apparent linear trend, depending upon whether the estimates being examined were proportions (such as percentages) or averages. Linear trends in proportions or averages. When proportions or averages of a continuous variable were examined relative to a variable with ordered categories, Analysis of Variance (ANOVA) was used to test for a linear relationship between the two variables. To do this, ANOVA models included orthogonal linear contrasts corresponding to successive levels of the independent variable. The squares of the Taylorized standard errors (that is, standard errors that were calculated by the Taylor series method), the variance between the means, and the unweighted sample sizes were used to partition total sum of squares into within-and betweengroup sums of squares. These were used to create mean squares for the within-and betweengroup variance components and their corresponding F statistics, which were then compared with published values of F for a significance level of .05.28 Significant values of both the overall F and the F associated with the linear contrast term were required as evidence of a linear relationship between the two variables. Means and Taylorized standard errors were calculated by the DAS. Unweighted sample sizes are not available from the DAS and were provided by NCES."}, {"section_title": "Adjustment of Means to Control for Covariation Among Several Variables", "text": "Tabular results are limited by sample size when attempting to control for the multiplicity of factors that may account for the variation observed between two variables. For example, when examining the average number of credits completed, it is impossible to know to what extent the observed variation is due to socioeconomic status (SES) differences and to what extent it is due to differences in other factors related to SES, such as type of institution attended, intensity of enrollment, and so on. However, if a nested table were produced showing SES within type of institution attended, within enrollment intensity, the cell sizes would be too small to identify the patterns. When the sample size becomes too small to support controls for another level of variation, one must use other methods to take such variation into account. To overcome this difficulty, multiple linear regression was used to obtain means that were adjusted for covariation among a list of control variables.29 Adjusted means for subgroups were obtained by regressing the dependent variable on a set of student and enrollment characteristics. Substituting ones or zeros for the subgroup characteristic(s) of interest and the mean proportions for the other variables results in an estimate of the adjusted mean for the specified subgroup, holding all other variables constant. For example, consider a hypothetical case in which two variables, raceethnicity and SES, are used to describe an outcome, Y (such as the number of credits completed). The variables raceethnicity and SES are recoded into dummy variables: To estimate the adjusted mean for any subgroup evaluated at the mean of all other variables, one substitutes the appropriate values for that subgroup's dummy variables (1 or 0) and the mean for the dummy variable(s) representing all other subgroups. For example, suppose we had a case where Y was being described by raceethnicity (R) and SES (5), coded as shown above, and the means for R and S are as follows: In this case, the estimated mean number of credits is 62.37 and represents the expected outcome for non-Hispanic black students who resemble the average student with respect to the other variables in the model (in this example, SES). It is relatively straightforward to produce a multivariate model using the DAS, since one of the DAS output options is a correlation matrix, computed using pairwise missing values and properly weighted to account for the complex sample design and for nonresponse.\" This matrix can be used by most statistical software packages as the input data for least-squares regression. That is the approach used for this report, with an additional adjustment to incorporate the complex sample design into the statistical significance tests of the parameter estimates (described below). Most statistical software packages assume simple random sampling when computing standard errors of parameter estimates. Because of NELS:88/94 and BPS:89/90's complex sample design, this assumption is incorrect. A better approximation of the standard errors is to multiply \"Although the DAS enables the analyst to estimate regression models, it also limits the choices available. Analysts who wish to use other than pairwise treatment of missing values or to estimate other models can apply for a restricted data license from NCES."}, {"section_title": "56", "text": "each standard error by the average design effect of the dependent variable (DEFT),31 where the DEFT is the ratio of the true standard error to the standard error computed under the assumption of simple random sampling. It is calculated by the DAS and produced with the correlation matrix. 3IThe adjustment procedure and its limitations are described in C.J. Skinner, D. Holt, and T.M.F. Smith, eds., Analysis of Complex Surveys (New York: John Wiley & Sons, 1989)."}, {"section_title": "68", "text": "Appendix CNELS/BPS Merged Data File Methodology Report Overview The National Education Longitudinal Study (NELS:88/94) data set is a rich source of data on the relationship between high school experiences and early postsecondary outcomes. However, the last collection of NELS:88/94 captured the sample members when most of them were only 2 years out of high schoolmuch too early to be able to say much about their eventual postsecondary attainment and persistence. Conversely, the Beginning Postsecondary Students Longitudinal Study and follow-up (BPS:90/94) is a rich source of data on the characteristics of beginning postsecondary students' educational attainment and persistence but has little information about participants' high school experiences. These two data sets share a fairly extensive set of common variables describing the background characteristics of sample members. These characteristics were used in this project to link students in each of the data sets, thereby creating a \"synthetic cohort,\" to provide values for variables missing in the NELS:88/94 data set. In a sense, the data on long-term postsecondary outcomes in NELS:88/94 (due to the censoring of the data 2 years after high school graduation) were treated as a huge missing data problem. These missing data were imputed for the NELS:88/94 students using multiply imputation methods developed by Rubin, and later expanded upon by Little and Rubin.32 The imputation was performed through a hotdeck procedure implemented through the SAS programming language. In this procedure a NELS:88/94 student was matched with a BPS:90/94 student, and the data on postsecondary outcomes for the BPS:90/94 student were assigned to the NELS:88/94 student. This procedure was performed 36 times to capture the measurement error associated with the imputations. A disturbance term was added to the NELS:88/94 sample weights to reflect this added source of error in the data. This disturbance term inflated the weight (BPSLNKWT) so that the variance component of the estimates associated with the size of the weight was also inflatedaccurately inflating the total variance of the estimate to account for measurement error due to imputation. "}, {"section_title": "6 9", "text": "Each of the steps in the creation of this data set is discussed in the following sections."}, {"section_title": "Selection of Sample and Variables for Analysis Sample Selection", "text": "In order to make inferences about the students in each data set, it was important that the respondents drawn from the NELS:88/94 and BPS:90/94 data sets be as close as possible in terms of certain student characteristics, such as age, high school graduation status, and initial Postsecondary Education (PSE) enrollment. For instance, since BPS:90/94 was a cohort of first-time beginning postsecondary students, sample members in the NELS:88/94 were drawn who enrolled in some type of postsecondary education within 2 years after high school graduation. Similarly, the sample of BPS:90/94 respondents had to be restricted to sample members whose age was 22 years or younger as of December 31, 1989, because the age range for sample members in NELS:88/94 had an upper limit of 22 years in 1992, the year that most of them graduated from high school. In addition, since this new data set was based on high school graduates, students in both data sets who did not have a high school diploma, General Educational Development (GED), certification, or equivalent were excluded. Table C1 lists several selection criteria used to select students from the NELS:88/94 and BPS:90/94. Application of these criteria resulted in a total of 5,523 first-time beginning postsecondary sample members from BPS:90/94 and 7,563 high school graduates from NELS:88/94, accounting for 72.4 and 50.7 percent, respectively, of original samples. Table C2 presents the comparison of the selected students from the two data sets based on students' sex, raceethnicity, and age. The weighted proportions of male and female students in the two samples were quite comparable: in each data set, male students account for about 48 percent and female students, 52 percent. When examined by raceethnicity, the proportion of minority students appears higher in the NELS:88/94 sample than in the BPS:90/94 sample: 20 percent in BPS:90/94 compared with 25 percent in the NELS:88/94. This may reflect the fact that minority enrollment in higher education increased significantly between 1990 and 1992. According to The Condition of Education 1996 (p. 144), minority students in U.S. colleges and universities increased from 20 percent in 1990 to 22 percent in 1992 (recall that the BPS:90/94 sample was based on the 1989-90 NPSAS first-time beginning postsecondary education students and the NELS:88/94 sample members were high school graduates in 1992). When examined by age, BPS:90/94 students were older than NELS:88/94 students wereabout 12 percent of BPS:90/94 students were age 20 or older, compared with 2 percent of of 12/31/89 (to match the age range for the NELS:88/94 students in 1992i.e., the year that most students graduated from high school and could start their PSE)."}, {"section_title": "5,523", "text": "Percent of students selected 72.4 The NELS:88/94 began with a nationally representative sample of 1988 eighth graders and followed them up in 1990 when most of them were in 10th grade, in 1992 when most were in 12th grade, and in 1994, 2 years after most graduated from high school. Select high school graduates, i.e., those with a diploma, GED, or equivalent in 1992. Select students who enrolled in some PSE by 1994 (because sample members in BPS:90/94 were all first-time beginning postsecondary students). NELS:88/94 students. This difference was due to the different base samples targeted by the two surveys. BPS:90/94 started with a cohort of individuals beginning their postsecondary studies, regardless of when they completed high school, whereas NELS:88/94 targeted 8th-grade students and followed them through high school and beyond. There are several implications for \"older\" students in BPS:90 /94 they may have delayed their postsecondary education enrollment or could have been held back one or more grades in elementary, middle, or high school. \"Delaying\" and \"holding back\" will have different impacts on the estimated values of high school achievement or postsecondary education attainment; therefore, close attention was paid to these \"older\" students in the imputation process."}, {"section_title": "73", "text": "Variable Selection Table C3 presents the variables selected for linking NELS:88/94 and BPS:90/94 respondents. Variables were selected to assure that they were defined in the same manner or could be recoded so that they were defined as similarly as possible between the data sets. The list includes basic demographic characteristics of students such as sex, raceethnicity, and age, as well as some socioeconomic measures such as parental education, occupation, and various items the family owns. Previous research indicates the importance of students' educational expectations relative to students' achievement and postsecondary outcomes; therefore, this variable was included in the list. In addition, some characteristics that describe students' postsecondary experiences were considered, such as immediate versus delayed enrollment, part-time versus full-time enrollment, type and level of institution, and major field of study for earliest postsecondary education enrollment. Table C4 displays the imputation matrix for this study. The primary imputation cells (columns) were created from the three variables that describe students' early postsecondary experiences: type and level of first postsecondary education institution, timing of postsecondary education entry (immediate or delayed), and attendance status (part-time versus full-time enrollment). In order to make the type and level of the postsecondary education institution comparable between the two data sets, we combined the categories so that the variable had three categories common to NELS:88/94 and BPS:90/94: 1=public 4-year, 2=private not-for-profit 4-year, and 3=public 2-year. There are a total of 12 primary imputation cells. Note that the number of BPS:90/94 students in each cell for private postsecondary education institutions is larger than the number of NELS:88/94 students (see rows 1 and 11 in table C4). However, in each cell for public postsecondary education institutions, the number of BPS:90/94 students is smaller than the number of NELS:88/94 students. Within each of the primary imputation cells, a crosstabulation was performed based on students' sex, raceethnicity, and socioeconomic status (SES). First, the SES variable was categorized into three levels: low SES (less than 25th percentile), middle SES (between 25th and 75th percentiles), and high SES (more than 75th percentile). The results of the crosstabulation indicated that there were too many small cells in the BPS:90/94 data to be managed in later matching procedures. Thus, the race variable was collapsed into two categories: white or Asian, Pacific Islander, and non-Asian, Pacific Islander minority (to collapse within the primary cell rather than across primary cells). Again, small cells were a problem. SES was therefore further collapsed into two categories split at the 50th percentile: low to middle SES (less than 50th percentile) and middle to high SES (equal to or more than 50th percentile). trade school, less-than-2-year college, 2-or-more-year college, bachelor's degree, postgraduate/professional) RFATHED/RMOTHED (less than high school, high school graduate, trade school, less-than-2-year college, 2-or-more-year college, bachelor's degree, postgraduate/ professional) DADOC/MOMOC (marketing, administrative, support,  F2S43 (How far in school respondent thinks she or he will getfrom 1992 survey: less than high school, high school only, less than 2 years of college, more than 2 years of college, trade school degree, less than 2 years college, more than 2 years college, finish college, master's degree or equivalent, Ph.D./M.D./other) EDEXPECT (What is the highest level of education you ever expect to completefrom 1994 survey: some high school, finish high school, vocational/trade-less than 2 years, vocationaUtrade-2 or more years, college-less than Immediate versus delayed postsecondary education enrollment Part-time versus full-time postsecondary education enrollment (earliest institution) Level and control of earliest postsecondary education institution Study major in the earliest postsecondary education institution DELAYENR (derived variable in BPS:90/94 created based on type of students' high school diploma and high school graduation year). FRSTRTFT (for first enrollment status reported by studentbase year survey, 1=full-time and 2=less than full-time) or ATTNST3 (enrollment intensity AY89-90 base year survey, full-time or part-time attendance status over full year; part-time includes students who were full-time in one term and part-time in another from July 1989 to June 1990 full-time in one term CTRL8990 (control of principal institution AY89-90: 1=public, 2=private not-for-profit, and 3=private forprofit) SCHL8990 (level of principal institution AY89-90: 1=4-year institution, 2=2-year institution, and 3= less-than-2-year institution) MAJ8990 (field of study AY89-90: 1=humanities, 2=social and behavioral sciences, 3=life science, 4=physical science, 5=mathematics, 6=computer and information technology, 7=engineering, 8=education, 9=business and management, 10=health, 11=vocational/ technical, 12=other technical/professional) This variable can be constructed based on high school completion date, i.e., the date receiving diploma, GED, and certification (F3HSCPDT), and the earliest postsecondary education enrollment date for valid institutions (PSEFIRDA). \"Delayed enrollment\" students are defined as those who did not enroll in some postsecondary education by spring of 1993. PSEFIRST (enrollment status from the valid postsecondary education institution with the earliest enrollment date: 1=full-time, 2=at least half, less than full, and 3=less than halftime) PSEFIRTY (institution type of the first postsecondary education enrollment: 1=private for-profit, 2=private not-forprofit, less-than-4-year, 3=public less-than-2-year, 4=public 2-year, 5=private not-for-profit, 4-year, and 6=public 4-year) PSEFIRMJ (Major field of study from the valid postsecondary education institution with the earliest enrollment date. NOTE: Study major is combined into four categories: 1) math/science/engineering; 2) humanities/social behavioral science; 3) business/finance/management/vocational; 4) other. SOURCE: U.S. Department of Education, National Center for Education Statistics, 1990 Beginning Postsecondary Students Longitudinal Study Second Follow-up andNational Education Longitudinal Study of 1988 Third Follow-up. "}, {"section_title": "Validation of the Imputation Procedure", "text": "Before imputing all of the postsecondary outcomes for the NELS:88194 respondents, an analysis was run to evaluate the validity of the proposed imputation procedure. Since both NELS:88/94 and BPS:90/94 had persistence and attainment information on their respondents approximately 2 years after entering postsecondary education, this information was used to test the accuracy of the proposed imputation procedure for all postsecondary outcomes. Table C5 presents the definition of 2-year persistence and attainment rates used in NELS:88/94 and BPS:90/94. Substantial effort was made to construct these variables so that they had minimal missing data and were comparable between the two data sets. For comparability, students who persisted were defined as those who enrolled in postsecondary education as of May 1991 (for BPS:90/94 students) or as of May 1994 (for NELS:88194 students) or those who did not enroll but attained some type of degree. For the attainment outcome, two measures were examined: 1) whether a student attained some type of degree including a certificate or associate's degree within the first 2 years of postsecondary education; and 2) whether a student attained an associate's degree. Table C6 presents actual persistence and attainment rates for both BPS:90/94 and NELS:88/94 students and proportions of students according to their timing of postsecondary education enrollment, enrollment status, sex, raceethnicity, and SES in three types of postsecondary education institutions. While the overall persistence rates appear comparable across the two data sets, the attainment rates are notcompared with BPS:90/94 students, NELS:88/94 students appear to have higher overall attainment rates in 4-year public and private institutions, but have a lower rate for attaining associate's degrees in all three types of institutions. It is plausible that the different make-up of students in the two samples contributes to these differences, for the percentages of students according to their postsecondary education experiences and individual characteristics are not equivalent. For example, the NELS:88/94 sample appears to include more minority and low-SES students than the BPS:90/94 sample, whereas the BPS:90/94 sample appears to consist of more students who delayed their postsecondary education and enrolled in postsecondary education on a part-time basis than the NELS:88/94 sample. in attainment in academic years 1989-90 and 1990-91) to determine whether a student attained a certificate or an associate's degree within the first 2 years of postsecondary education. Coding is \"1\" for students who attained a certificate or an associate's degree within the first 2 years of postsecondary education and \"0\" for students who did not attain any degree. Use PER899OR and PER9091R to determine whether a student attained an associate's degree. Coding is \"1\" for students who attained an associate's degree either in 1989-90 or 1990-91 and \"0\" for students who did not attain a degree or who attained a certificate. Use ENR9105 (enrollment status 91/5) and attainment (see above definition) to determine students' postsecondary education persistence. Coding is \"1\" for students who either enrolled in postsecondary education in May 1991 or attained a degree by 1991and \"0\" for students who did not enroll or attain. Use ENRL0594 (enrollment status 94/5) and attainment (see above definition) to determine students' postsecondary education persistence. Coding is \"1\" for students who either enrolled in postsecondary education in May 1994 or attained a degree by 1994 and \"0\" for students who did not enroll or attain.  "}, {"section_title": "Imputation of 2-Year Persistence and Attainment Rates", "text": "The imputation was performed through a sequential hotdeck procedure. First, the BPS:90/94 and NELS:88/94 data were combined into one data set in which 2-year persistence and attainment indicators (1=Yes and O =No) were retained for BPS:90/94 sample members but missing for all NELS:88/94 sample members. Next, one imputation was performed in each imputation cell defined in table 4. Finally, imputed and actual rates were compared. Table C7 presents the results of this imputation. Overall, the imputation for the 2-year persistence rate appears to be more successful than the imputation for the 2-year attainment rate. While the imputed persistence rates appear to be comparable to the actual rates in NELS, particularly for students enrolling in 4-year public and private not-for-profit institutions, the imputed attainment rates are mostly lower than the actual rates across all three types of institutions and the imputed rates for attaining an associate's degree are mostly higher than the actual rates. Recall that there are many cells collapsed in \"delayed postsecondary education\" and \"part-time attendance status\" (see table C4). Therefore, only fulltime students who enrolled in postsecondary education immediately after high school graduation were selected (no cells are collapsed for these students) and one hotdeck imputation for these students was performed. The results are presented in table C8. Again, the conclusions are similar to those derived from table C7. While the imputed persistence rates, whether for totals or broken down by sex, raceethnicity, and SES, appear close to the actual rates across all three types of institutions, the gap between imputed and actual attainment rates persists and appears large. However, the definition for attainment in the two data sets is not strictly comparable. In the NELS:88/94, attainment is a student's self-report of the highest postsecondary degree attained and certificates and licenses are included. In the BPS:90/94, attainment is a derived and retrospective variable indicating whether a student attained some type of degree at the end of academic year 1990-91, and licenses are not included. Therefore, while the imputed 2-year attainment rates are not consistent with actual reported 2-year attainment rates, the overall results of the imputation of attainment and persistence were judged to be of reasonable quality. "}, {"section_title": "Full Imputation", "text": "Since the results above looked reasonable, other persistence and attainment variables were imputed for NELS:88/94 students. A partial list of imputed variables is included below: Enrolled anytime in postsecondary education during academic years 1993 to 1996 Enrolled Not enrolled 2) Month-by-month enrollment status July 1992 to June 1997 Full-time More than half time, less than full-time Less than half time or unknown 3) Ever attended graduate school 4) Ever attended a 4-year institution 5) Ever attended a private for-profit less-than-4-year institution 6) Ever attended a public 2-year institution Level and control where ended first attainment 10) Level and control where received highest degree 11) gLevel and control, last institution Public 4-year Private, not-for-profit, 4-year Private, for-profit, 4-year Public 2-to 3-year Private, not-for-profit 2-to 3-year Private, for-profit, 2-to 3-year Public less-than-2-year Private, not-for-profit, less-than-2-year Private, for-profit, less-than-2-year 12) Number of institutions attended through first attainment 13) Number of institutions attended during 1992-97 14) Persistence and attainment during academic years 1992 to 1996 Attained certificate Attained associate's degree Attained bachelor's degree Persisted to academic year 1993-94 Downward/delayed transfer Stopout Left without return , 74 9 2 While it is well known that hotdeck imputation is a convenient method for providing a fully allocated data set that produces unbiased estimates, it is also known that using just one imputation systematically underestimates the variance of these estimates. To correct for this underestimation, Rubin has suggested using a multiply imputed data set.33 That is, the missing data imputation is repeated a number of times (M). Let 8 be some parameter of interest and ay H,, 1=1,....M are the estimated 8 and their variances for M imputations. Then the combined estimate is: The variance associated with this estimate is the combination of the mean of the within imputation variances (or, alternatively, the variance associated with the first imputation): and the between imputation variance: The total variance (sampling and measurement) of om is: or for the sake of simplicity: In this study, this procedure was used to capture the uncertainty due to measurement error related to imputing data. For example, using the imputation cells defined above in table C4, NELS:88/94 sample member #1 was matched with a BPS:90/94 sample member within the appropriate imputation cell. The BPS:90/94 sample member's postsecondary outcome variables were then attached to NELS:88/94 sample member #1's record. The BPS:90/94 member was returned to the matrix and another random draw for NELS:88/94 sample member #1 was taken from the imputation matrix. This was repeated 36 times. The variance between the 36 imputed 33D. B. Rubin, Multiple Imputation for Nonresponse in Surveys (New York: John Wiley and Sons, 1987), p. 15. 75 93 values for NELS: 88/94 sample member #1 represented the measurement error variance for sample member #1 due to imputing his/her postsecondary outcomes. Separate imputations were conducted for NELS:88/94 students who first enrolled in private 4-year institutions and public 4year institutions. A summary of the results of these imputations is presented in table C9. (Some of the imputed variables are not shown in this table for the sake of simplicity.) The second and sixth columns of this table show the mean of the average of the 36 values imputed for respondents who first enrolled in a private 4-year college or university and in a public 4-year college or university. The third and seventh columns show the variance between imputations. The fourth and fifth show the standard error due to sampling (assuming simple random sampling), and the sampling variance (assuming simple random sampling) for the first mean for those attending private 4-year college or university. The eighth and ninth columns show the analogous data for public 4-year students. The complex standard errors (in columns 11 and 12) were calculated using the computer program SUDAAN, which takes into account the complex nature of the sampling design of NELS:88/94. The total standard errors (the last two columns) are based on equation 1.5 above. The last row of the table show the mean across these columns. "}, {"section_title": "Adjustment for Measurement Error", "text": "In most applications of Rubin and Little's multiply imputation scheme, a completely imputed data set is created M number of times (in most applications at NCES, M=5). Separate analyses are then run on these M data sets and then the variances of the estimates are calculated as in equation 1.5. In the present application of their multiply imputation scheme, the measurement error due to imputation was to be incorporated into an automated Data Analysis System (DAS). Therefore, a more computationally convenient method of incorporating the measurement error due to multiple imputations was needed. Calculating separate analyses based on M complete data sets was considered too computationally laborious and time intensive for the DAS. Instead, the task was accomplished by estimating the total variances as shown in table 8 above and calculating the resulting design effects due to complex sampling and due to measurement error. These parameters were then used to inflate the variance of the weights so that the resulting standard errors were inflated to reflect the added source of error due to multiple imputations. That is, a new weight was created: in which the NELS:88/94 third follow-up weight was \"disturbed\" by a factor normally distributed with a mean of 0 and a variance of E. E is defined as: and D is defined as: where deff,,,,, is the ratio of the design effect due to measurement error (ws) to the design effect due to complex sampling (cs) and deffcs is the design effect due to complex sampling. Separate E and D parameters were calculated for students who first enrolled in 4-year private institutions and students who first enrolled in 4-year public institutions. This disturbance term E was randomly assigned to the third follow-up weight for each case in sequence. For example, respondent S, was assigned a disturbance term to his/her F3QWT as in equation 1.6 above. After assigning the disturbance term, if S,'s weight was less than 1, S, was assigned a value of 1 for his/her weight (to avoid extremely low or negative weights) and S2 had a disturbance term assigned to his/her F3QWT that was the residual of disturbance term of S,. If S, had a new weight greater than 1, then S, had a disturbance term assigned to his/her F3QWT as in 1.6 above. Thus, new weights were calculated for each individual whose variance reflected the measurement error due to imputation. However, given the lower bound of unity for the weights, the disturbance term was ultimately not randomly distributed with a mean of zero. The new weights were therefore adjusted to sum back to the old weights by a simple post-stratification to the sum of the weights for each postsecondary institution type (4-year private, not-for-profit and 4-year public). To check on the results of these calculations, weights were created based on the values of D and E for just the first variable in the list in table 9 (degall2). In this way one could see how well the calculation of variance based on disturbing the weights compared to the actual variances calculated from the spreadsheet. Using BPSLNKWT resulted in standard errors very close to what was estimated in the spreadsheet. For private, not-for-profit 4-year institutions SUDAAN produced a standard error of 0.0618 versus 0.0612 in the spreadsheet, and for public 4-year institutions, 0.0392 versus 0.0429."}]