[{"section_title": "Abstract", "text": "ABSTRACT The use of nurse practitioners (NPs) is one way to address the shortage of physician primary care providers. NP training programs and the number of practicing NPs have increased in the past two decades. However, regulations limiting their scope of practice vary greatly by state. We assessed the impact of state regulations on the increase in care provided by NPs in the United States, using a 5 percent national sample of Medicare beneficiaries. We found that between 1998 and 2010 the number of Medicare patients receiving care from NPs increased fifteenfold. By 2010 states with the least restrictive regulations of NP practice had a 2.5-fold greater likelihood of patients' receiving their primary care from NPs than did the most restrictive states. Relaxing state restrictions on NP practice should increase the use of NPs as primary care providers, which in turn would reduce the current national shortage of primary care providers."}, {"section_title": "I", "text": "ncreasing access to primary care is a key focus of health reform in the United States. Primary care helps patients in decision making, provides opportunities for disease prevention and health promotion, and can engage patients' family and community to help meet the health needs of the patients. 1 States with a higher ratio of primary care physicians to patients have lower Medicare expenditures and lower total and disease-specific mortality. 2 However, since 1998 the proportion of US medical students choosing careers in primary care has dropped from around 60 percent to 20-27 percent. 3, 4 One way to address the shortage of physician primary care providers is with nurse practitioners (NPs). 5, 6 The past two decades have witnessed an increase in NP training programs and the number of practicing NPs.\n7-10 However, states vary greatly in regulating the scope of NPs' practice and in the precision and detail of those regulations. 5 In some states NPs have essentially the same authority to practice that physicians have. Other states require physician supervision and limit NPs' hospital privileges as well as their authority to order tests, make referrals, and prescribe medications. 6, [11] [12] [13] [14] The online Appendix contains (in Exhibits 1a and 2a) 15 a summary of regulations for each state and how they have changed over time. [16] [17] [18] [19] [20] [21] [22] [23] [24] [25] [26] [27] [28] [29] [30] These restrictions may inhibit the spread of care provided by NPs. 31, 32 Previous studies have found an increase over time in both the number of nurse practitioners and the number of patients receiving care from them.\n9,10,33 These studies were based on national health care surveys and included small numbers of NPs. In this article we assess the growth in care provided by nurse practitioners from 1998 through 2010 and how this varies by practice setting, using national Medicare data as well as the number of licensed NPs as reported by state authorities.We were particularly interested in the variation among states in NPs serving as primary care providers. We hypothesized that states with fewer restrictions on NP practice and areas with a lower supply of primary care physicians and physician assistants would have the highest percentage of NPs as primary care providers."}, {"section_title": "Study Data And Methods", "text": "Data We estimated NP care from the 5 percent national sample of Medicare beneficiaries for 1998-2010. We started in 1998, the year Medicare liberalized reimbursement to NPs. Data on the number of NPs by state were based on license records from state boards of nursing."}, {"section_title": "16-30", "text": "Study Cohort We selected Medicare beneficiaries age sixty-five or older with Parts A and B coverage and not in a health maintenance organization (HMO) for the entire twelve months of each year during 1998-2010. Beneficiaries whose original entitlement to Medicare was based on disability or end-stage renal disease were excluded, as were patients with any nursing home stay in a given year.\nProviders We identified individual providers by their Unique Provider Identification Number for 1998-2007 and National Provider Identifier for 2007-10. Provider specialty was based on the Part B claims in the Medicare Carrier files or Outpatient Statistical Analysis files in a given year. We identified the clinical settinginpatient, outpatient, or emergency department-based on the type of evaluation and management billing code in the data sets.\nTo identify the primary care provider, we included only beneficiaries with billing records for two or more outpatient evaluation and management services by a generalist physician (general practitioner, family physician, general internist, or geriatrician) or NP in a given year. Patients were identified as having an NP as the primary care provider if the NP billed for most of patients' evaluation and management services. If a physician and an NP billed the same number of evaluation and management charges in a given year for a given patient, the physician was designated as the primary care provider. For some analyses, we identified patients for whom NPs provided all generalist evaluation and management services during that year.\nState Regulations We initially classified state regulations into three levels: allowing independent practice and prescription authority; allowing independent practice but requiring supervision for prescriptions; and requiring physician supervision for practice and prescriptions. We reviewed any changes in these categories obtained from annual legislative updates [16] [17] [18] [19] [20] [21] [22] [23] [24] [25] [26] [27] [28] [29] [30] from 1998 to 2012 (Exhibit 2a in the online Appendix)."}, {"section_title": "15", "text": "In some analyses we further classified state regulations of NP practice into five categories related to patients' ability to choose an NP: exemplary, partially support, confine, restrict, and severely restrict.\n11-13, 34 The categories were produced by an expert panel, whose members evaluated three dimensions of patients' access to NPs: in governance and education of the NP profession, in providing health care services, and in ability to prescribe medications. We used the 2006 and 2010 ratings 11,13 in our analyses (Exhibit 3a in the Appendix). 35 The numbers of physician assistants per 100,000 residents in each county (the smallest unit of data collection for physician assistants) in 2007 and 2010 were obtained from 2011-12 Area Resource Files, maintained by the federal Health Resources and Services Administration.\nSizes of residential areas were categorized using Rural-Urban Continuum Codes that distinguish metropolitan counties by size and nonmetropolitan counties by degree of urbanization and proximity to metropolitan areas. 36 A comorbidity index for each enrollee, indicating the number of his or her diagnosed conditions, was generated from all claims in the twelve months before each study year and categorized as 0, 1, 2, and ≥3. 37 The percentages of state residents older than age seventy-five, male, nonwhite, with fewer than twelve years of education, or uninsured were obtained from the 2000 and 2010 census data, and primary care physician availability was obtained from the 2006 and 2010 Area Resource Files.\nStatistical Analyses For the years 2006 and 2010, we evaluated the association of patient characteristics with the odds of having an NP as the primary care provider, using hierarchical generalized linear mixed models. The associations between having an NP as the primary care provider and either state regulations or the availability of primary care physicians and physician assistants were also assessed. We treated the variable of states as a random effect to assess how much of the variation in having an NP as the primary care provider was explained by state regulations. We also evaluated the change over time in the percentage of patients with an NP as the primary care provider as a function of state regulations by adding the interaction between year and level of regulation in the model.\nIn addition, we assessed the association of state regulations with the estimated number of NPs per 100,000 state residents in 2006 and 2010, 24 ,28 using a least squares regression model adjusted for population age, sex, race or ethnicity, education, insurance, and primary care physician availability in each state. All tests of statistical significance were two-sided (p < 0:05). Analyses were performed with the statistical software SAS, version 9.2. Maps were constructed using ArcGIS 9.3.\nLimitations Our main analyses assessed NP Medicare charges, not activity. Medicare allows physicians to submit evaluation and management charges for a split or shared visit in which both the physician and the NP perform and document a substantive portion of a face-to-face encounter with the patient. 38 In such situations, the physician rather than the NP would normally submit the charge, because the reimbursement rate for physicians is 15 percent higher than that for nurse practitioners. 39 Thus, measuring only NP charges would tend to underestimate total NP activity. However, we also examined associations between state regulations and the number of NPs licensed in a state, as previously done by others. 40 Finally, some institutions may have policies against NPs' billing independently for their services.\nOur method for identifying patients with an NP as the primary care provider assumed that all evaluation and management charges by NPs and generalist physicians were for primary care\nservices. Approximately 5 percent of NPs in adult outpatient settings are not in primary care, so our method overestimated primary care by NPs. 41 The increasing trend for NPs to receive training and certification in a subspecialty 42 will decrease the availability of NPs as primary care providers. This is analogous to the negative impact that increasing specialization by physicians has had on the numbers of primary care physicians."}, {"section_title": "3,4", "text": "We studied community-dwelling elders with fee-for-service Medicare coverage. Nurse practitioner care may differ for beneficiaries under age sixty-five, those who reside in nursing homes, or those with HMO coverage. Last, we analyzed the number of licensed NPs as a proxy for the number of practicing NPs. This could tend to underestimate the impact of state regulations. "}, {"section_title": "Study Results", "text": ""}, {"section_title": "Growth In", "text": "Nurse Practitioner Care From 1998 to 2010 the proportion of Medicare patients billed by NPs grew 6.2 percentage points for hospitalized patients, 3.3 percentage points for emergency department"}, {"section_title": "Exhibit 1", "text": "The unadjusted and adjusted results show a strong association between the percentage of patients with NPs as primary care providers and the degree of state restrictions. In both years there was more than 2.5-fold difference in the odds of having an NP as a primary care provider between the most and least restrictive states.\nSeveral aspects of Exhibit 4 are worth noting. First, the percentage of patients with NPs as primary care providers increased significantly from 2006 to 2010, for every category of state regulation and every level of physician supply. Second, the supply of primary care physicians in a Hospital Service Area was inversely related to the odds of having an NP as a primary care provider. Third, patients living in counties with the lowest quartile of physician assistants were more likely than patients in other counties to have NPs as their primary care provider. Fourth, the amount of variation in having an NP as a primary care provider (measured as residual intraclass correlation coefficient) attributed to states was 9.5 percent after adjustment for patient and geographical characteristics in 2010; in other words, 9.5 percent of the We also assessed the association of state regulations with the number of nurse practitioners licensed to practice in each state in 2006 and 2010 (Exhibit 5a in the Appendix). 15 The increase in the number of NPs per 100,000 residents between 2006 and 2010 was greatest in states with the least restrictive regulations."}, {"section_title": "Discussion", "text": "Several factors contribute to the current and projected shortage of primary care providers in the United States. These include overall population growth, population aging, an expected large increase in the number of people with health insurance, and a decade-long decrease in the number of medical school graduates choosing primary care as a career.\n3,4 Increasing the role of NPs as primary care providers can be an important approach to increasing primary care capacity."}, {"section_title": "5-8", "text": "The Institute of Medicine, building on a recommendation in its landmark 2001 report Crossing the Quality Chasm, 32 recommended liberalizing state laws regulating the practice of NPs in its 2010 report The Future of Nursing."}, {"section_title": "5", "text": "That report cited resistance by physician professional organizations, particularly state medical boards. It discussed a number of possible steps to make regulations more uniform across states, including attention by the Federal Trade Commission to anticompetitive practices by state medical boards and changing reimbursement policies by Medicare and Medicaid that promote subscribers' choice of provider types.\nThe past decade has seen a slow but steady trend toward liberalization of state regulations of NP practice. [16] [17] [18] [19] [20] [21] [22] [23] [24] [25] [26] [27] [28] [29] [30] One factor driving those changes is that increased availability of primary care providers may reduce overall health care costs.\n2 For example, a 2009 RAND Corporation report commissioned by the State of Massachusetts estimated savings over ten years of $4-$8 billion if the state were to liberalize regulations to allow NPs and physician assistants to independently treat six common primary care conditions. 43 The Affordable Care Act The expanded Medicaid coverage in the Affordable Care Act will affect states differently, depending on their current eligibility requirements for Medicaid and their current supply of primary care providers. 44 States projected to experience the largest need for additional primary care providers include Oklahoma, Georgia, Texas, and Louisiana. In 2010 all of these states, except Oklahoma, were in the two most restrictive categories of regulations on NP practice."}, {"section_title": "13", "text": "Growth And State Regulations The proportion of patients with an NP as the primary care provider and the number of licensed NPs increased most in states with the least restrictive regulations. In additional analyses not presented here, we further divided states into four categories based on whether or not they allowed independent practice and independent prescription authority. States with independent prescription authority had the greatest growth, regardless of the independence of other aspects of NP practice.\nOther Factors A number of other factors partially explain the variation among states in the proportion of Medicare patients with NPs as primary care providers. These include the availability of primary care physicians and physician assistants; the size of urban areas and rural populations; and the race, ethnicity, and sex of the population. However, when those factors were controlled for, states' degree of regulation explained 16.8 percent of the variation in NP care at state level.\nPhysician assistants also serve as primary care providers, under physician supervision. However, fewer than half of them practice in primary care settings. 45 The association between state regulations and having an NP as the primary care provider changed minimally after adjustment for physician assistant supply, which is consistent with other studies. 40 Processes And Outcomes Nurse practitioners undergo different training from general internal medicine or family medicine physicians. Previous trials have shown that NPs in community care settings have comparable outcomes to physicians. [46] [47] [48] [49] [50] [51] However, those trials were conducted in controlled settings with limited patient populations. The comparative effectiveness of NPs versus physicians in primary care must be rigorously assessed in national populationbased data."}, {"section_title": "Conclusion", "text": "The number of Medicare patients receiving care from nurse practitioners rose fifteenfold between 1998 and 2010. State regulations of the scope of NPs' practice, especially prescription authority, have a strong influence on the growth in numbers of NPs and patients receiving primary care from them. Modifying state regulations of NPs' practice is one path to expanding access to primary care. ▪ ◀"}, {"section_title": "2.5-fold", "text": ""}, {"section_title": "Difference", "text": "In both 2006 and 2010 there was more than a 2.5-fold difference in the odds of having an NP as a primary care provider between the most and least restrictive states."}]