[{"section_title": "", "text": "capacity in the four regions of Loss and others (2013)  growth rate of the baseline population, with no fatalities from wind energy facilities λ w growth rate of a population including the turbine mortality rate The methodology is currently applicable to birds and bats, focuses primarily on the effects of collisions with turbines, and can be applied to any species that breeds in, migrates through, or otherwise uses any part of the United States. The methodology assesses species at the national and regional scales and identifies those species potentially in need of more detailed study, as well as those species that are likely at low risk from wind energy development. This approach is fundamentally different from existing methods focusing on impacts at individual facilities. This report supersedes USGS Scientific Investigations Report 2015-5066 by the same authors, which described a preliminary version of the methodology. Following reviews of the preliminary methodology by a panel of external experts, public comments, and additional internal review, the methodology was revised and finalized. The three components of the refined methodology described in this new report rely on publicly available fatality information, population estimates, species range maps, turbine location data, biological characteristics of species, and population models. First, three metrics are combined to determine direct and indirect relative effects from wind energy facilities to generate a list of species scores. Second, a generic population model estimates the expected change in population trend caused by the additive mortality from collisions with wind turbines. Third, the methodology combines an estimate of observed fatalities and an estimate of potential biological removal to assess the possibility of a decrease in population size. The latter two components are quantitative. In a test case, the methodology was used to analyze data for six bird species and three bat species. Components of the methodology are based on simplifying assumptions and require information that, for many species, may be sparse or unreliable or may require further study. These assumptions should be carefully considered when using outputs from the methodology. Increases in the quality of data for fatalities from collisions with wind turbines, species distributions, abundance, and demography will likely improve results for uses of the methodology. The methodology's design identifies and prioritizes a subset of the bird and bat species that may experience populationlevel impacts from collisions with wind turbines, both currently and from future wind energy development in the United States. Results of an assessment using this methodology could focus future research to improve our understanding of those impacts and to guide avoidance and minimization strategies. In addition, this methodology can be used to identify species for more intensive demographic modeling or to highlight those species that may not require any additional research because effects of wind energy development on their populations are projected to be small. The effects of wind energy facilities on nine unidentified species used in the test case described in this report have not been assessed. Their data were simply used to show the application of the methodology to real-world data and the types of outputs it would produce."}, {"section_title": "Introduction", "text": "Recent growth in wind energy generation has led to concerns over the effect of this development on wildlife. Investigations of impacts on birds and bats are conducted at many wind energy facilities, yet there remains a paucity of knowledge regarding the effects on species at the national and regional levels (Arnett and others, 2008;Katzner and others, 2013). The U.S. Geological Survey (USGS) used research, monitoring data, and modeling to develop a probabilistic and quantitative methodology to assess both the current and future population-level consequences of wind energy development on those species of birds and bats that are present in the United States during any part of their life cycle. This report describes the methodology, which is national in scope; each population to be assessed consists of all the individuals of the species that occur in the United States. If data are available, application of this approach at smaller scales, such as a particular region or State, is possible. The methodology specifically addresses whether the fatalities caused by collisions with wind turbines may alter the species population size or trend. The methodology uses current (2014) levels of wind energy deployment and projections of new wind energy in 2025 to estimate and project both current and future effects of wind energy development on birds and bats. The USGS developed this methodology in response to renewable energy initiatives of the U.S. Department of the Interior (DOI), starting with the New Energy Frontier initiative (U.S. Department of the Interior and U.S. Department of Agriculture, 2011) and continuing with the Powering Our Future initiative (U.S. Department of the Interior, 2014). This assessment methodology is a product of interdisciplinary cooperation by USGS and other scientists. USGS scientists studying minerals and energy have decades of experience in producing transparent, thoroughly vetted methods to assess (1) undiscovered resources of conventional and continuous oil and gas, coal, gas hydrates, and minerals and (2) potential geologic carbon dioxide storage resources. Biogeographers, ecologists, and statisticians of the USGS conduct a wide array of applied research on species spatial distributions and population biology with an emphasis on responses to stressors at multiple scales. The assessment methodology described here was developed by a team of researchers bringing this range of experience together to devise an assessment methodology aimed at understanding the effects of wind energy development on birds and bats. As described below, developing the methodology is the first step toward completing a full assessment. The objectives of this report are to describe the methodology, the questions it is intended to address, key assumptions, and how it would be implemented. A test case of nine species is provided as an example of implementation and output. The methodology was developed during a multiyear period. Initially, the authors participated in meetings with stakeholders, including a large kickoff meeting and targeted meetings with industry representatives, conservation organizations, and individual Federal agencies involved in energy and wildlife issues related to wind energy development. From these meetings, three key issues became apparent that influenced the goals for the methodology. First, stakeholders wanted a rapid method to prioritize species in terms of their risk from wind energy generation. Second, they were concerned about both the direct effects of wind energy development caused by collisions and the indirect effects caused by habitat loss and behavioral avoidance of wind turbines. Third, they felt it was most important to understand the population-level consequences of wind energy development on species. Once the general goals of the methodology were defined, various approaches were developed and tested using data from actual species. Methodology and test case discussions with species experts led to refinement of the approaches and to publication of the preliminary methodology as USGS Scientific Investigations Report 2015-5066 (Diffendorfer and others, 2015). Following release of the preliminary methodology, the report was sent for review by an external four-person expert panel. At the same time, it was sent to various stakeholders for comment. Following that review, the report was reviewed internally by two new experts. This new finalized report includes some moderate changes as well as many smaller ones that were suggested in those reviews. Prioritization is no longer performed as a filter limiting only \"high-risk\" species to the quantitative impact analyses. All species are analyzed by all methods. The Monte Carlo-based scoring system for prioritization, developed after suggestions from the first internal review, has been replaced with the original approach of direct scores and breakpoints. Bats have been added to the quantitative test case scenarios. Explanations of the projections of future wind energy buildout have been moved from the body to appendix 2. Summaries of ongoing research were in appendix 1 of the preliminary report; because the results have been published, that content has been omitted from this final report. Summaries of alternative modeling approaches considered have been moved from appendix 2 to appendix 1. Wildlife populations can be described by their size and trend (the increasing, decreasing, or stationary pattern of the population through time), and, thus, \"population-level consequences\" can be defined as changes in a population's size or trend. The determinants of a population's size and trend are numerous and varied, and they differ both across species and across different areas or time periods for the same species. Information on these determinants is unavailable for most species, and overly complex models that require assumptions about many of the inputs may not provide better population analyses than less complex models (Morris and Doak, 2002). This methodology uses three separate approaches to measure potential population-level consequences from wind energy facilities. All of these approaches focus on applicability to multiple species without attempting to describe the nuances of complex population dynamics. The methodology identifies and prioritizes bird and bat species that collide with wind turbines and that may, or may not, experience population-level impacts from current and (or) future wind energy development in the United States. The results of an assessment using this methodology would focus future research to improve our understanding of those impacts and to guide avoidance and minimization strategies. In addition, use of this methodology could inform recommendations of species for more intensive demographic modeling or highlight those species that may not require any additional protection at the current time because effects of wind energy development on their populations appear to be small. The methodology is not intended to supplant the more detailed analyses required to make decisions under the Endangered Species Act (16 U.S.C. 1531 et seq.), the Bald and Golden Eagle Protection Act (16 U.S.C. 668 et seq.), or the Migratory Bird Treaty Act (16 U.S.C. 703-712). This methodology is designed to estimate impacts from wind energy. It should not, in isolation, be used to compare the consequences of wind energy versus other forms of energy production. These types of comparisons can be made only by using the same measure of impact, with unbiased estimation, across multiple types of energy production. Although some comparisons have been made (Harte and El-Gasseir, 1978;Fthenakis and Kim, 2009;Environmental Bioindicators Foundation and Pandion Systems, 2009;Sovacool, 2009;Jones and Pejchar, 2013), the USGS has not developed a methodology of this scope. Using the output from this assessment methodology to compare wind energy impacts on wildlife to impacts from other forms of energy production could lead to biased comparisons unless similar methods of assessment were developed for the other forms of energy. In addition, this assessment does not consider the positive effects wind energy may have on wildlife species by offsetting air pollution, water quality degradation, waste disposal, and global warming produced by burning fossil fuels or producing power from hydroelectric or nuclear sources. Such offsets are difficult to link directly to a species' population size and trend. Research on these topics is required to understand the full costs and benefits of wind energy relative to other forms of energy production."}, {"section_title": "State of Wind Energy Development", "text": "Wind-powered electricity generation has increased significantly over the last decade to 226.5 million megawatt hours (MWh) in 2016, which represents a cumulative installed capacity of 82.2 gigawatts (GW) in the United States by the end of 2016 (American Wind Energy Association, 2017). Wind energy generation represented 37.1 percent of U.S. electricity from renewable sources and 5.6 percent of total net electricity generation in 2016 (U.S. Energy Information Administration, 2017b, table 7.2a). Wind energy is growing at a rapid pace and has overtaken all but conventional hydropower generation for renewable energy sources ( fig. 1)."}, {"section_title": "Research on the Impact of Wind Energy Development on Wildlife", "text": "Electricity is generated from wind-driven turbines, and the physical collision of the turbine blades with birds and bats causes injury and death. Fatalities from collisions are considered \"direct effects\" throughout this report. This report includes barotrauma (damage to body tissue caused by the difference in air pressure around the turbine blade) as collision damage (Baerwald and others, 2008; Grodsky and others, 2011; Rollins and others, 2012). The construction of wind energy facilities, the road networks required to service them, and the energy grid necessary to transport electricity to consumers can also affect wildlife through habitat loss and alteration; moreover, some species avoid areas near turbines (Stevens and others, 2013;Shaffer and Buhl, 2016). Habitat loss and alteration in habitat quality caused by turbine construction, as well as avoidance of turbines or wind facilities by individuals, are considered \"indirect effects\" in this report. This assessment methodology includes both indirect and direct effects in the first component (prioritization of species), and focuses only on direct effects in the other components. Review papers such as those by W.P. others (2001, 2014), National Research Council, Committee on Environmental Impacts of Wind-Energy Projects (2007), Arnett and others (2008), Strickland and others (2011), and Schuster and others (2015) provide thorough summaries of existing research on the effects of wind energy facilities on wildlife. Academic and government scientists, including those from the USGS (Cryan, 2011;Ellison, 2012;Katzner and others, 2013;R.A. Erickson and others, 2015), have conducted research on the effects of wind energy development on wildlife. Works by international authors and agencies show concern for the effects of wind energy facilities outside the United States; see studies by the United Kingdom Joint Nature Conservation Committee (Crockford, 1992), Scottish Natural Heritage (Gill and others, 1996), Council of Europe (Langston and Pullan, 2004), Canadian Wildlife Service (Kingsley and Whittam, 2005), Rydell and others (2010), and Voigt and others (2012). The scientific methods for assessing the effects of wind energy facilities on the population size and trend (the increasing, decreasing, or stable pattern of the population through time) of species over regional or larger areas are still being developed. Conducting a field-based assessment of species over large areas can have considerable temporal, logistical, and funding constraints. For example, monitoring species and collecting detailed demographic data across multiple breeding locations is difficult, labor intensive, and expensive. Monitoring species that are widely dispersed, migratory, and nocturnal presents additional challenges. When needed, individual species can be the subject of highly complex multiyear efforts; examples include research on whooping cranes (Pearse and Selbo, 2012;Butler and others, 2013) and golden eagles (U.S. Fish and Wildlife Service, 2011a, b;Pagel and others, 2013;Johnston and others, 2014;Watson and others, 2014). Likewise, unique species at each wind energy facility can be monitored and assessed for years, but such intensive efforts, although useful for a few species at the facility of interest, do not fully inform us about cumulative impacts across many facilities and are impractical for studying all species and all locations. Assessments of the population-level consequences on bird and bat populations from fatalities caused by collisions with wind turbines are possible and have been done using a variety of methods. In an early example, Morrison and Pollock (1997) performed sensitivity analyses on mathematical models of populations to understand how changes in survival affected population growth rates. They then used these results to evaluate the use of surrogate variables, such as fecundity, in evaluations of wind energy impacts. More recently, W.P. Erickson and others (2014) divided an estimate of the annual fatalities per year by a population estimate for 20 bird species calculated by the Partners in Flight Science Committee (2013). Carrete and others (2009) developed a spatially explicit population model for Egyptian vultures and investigated the role of increased fatalities from wind turbines on population trends. Bellebaum and others (2013) used a model to estimate that fatalities were 3.1 percent of the total population annually for red kites in Germany and used the potential biological removal (PBR) method (see section 2.4.) to estimate a PBR value of 4 percent of the total population, indicating the species may be near a level of mortality that could decrease the population size. In another study of red kites, Schaub (2012) used an individual-based computer simulation of kites to study how the location of turbines might affect kite population trends. In addition, R.A. Erickson and others (2015) used branching process models to consider the impacts of wind energy on local populations of birds and bats. Most recently, Frick and others (2017) used a demographic model based on expert elicitation to suggest that fatalities from wind turbines could reduce the overall population size and viability of the hoary bat (Lasiurus cinereus). When estimating effects at the population level is not possible, prioritizing species by using other approaches can assist those making decisions about wind energy generation and wildlife. In several studies, researchers developed methods for prioritizing birds relative to their potential risk from wind turbines. Some studies targeted marine birds that could be affected by offshore wind energy development. Garthe and Hüppop (2004) used nine factors (such as flight maneuverability, adult survival, and current conservation status) to develop a wind facility sensitivity index. Desholm (2009) ranked 38 marine bird species in terms of their relative abundance and the elasticity of population growth to adult survival. Bright and others (2008)  versus medium) for birds in Scotland by using variables associated with sensitivity to wind facilities obtained from a literature review and combined these values with data from other sources to develop an overall wind energy facilities risk map for birds in Scotland. The preceding paragraphs briefly describe both quantitative and qualitative approaches to assessing wind energy impacts on populations of species. The methods used in these studies vary depending on the species, available data, and goals of the research. Some of the methods used in these studies meet one of three goals elicited from stakeholders (rapid method to prioritize species, determining direct and indirect effects, and estimating population-level consequences), but none of the existing studies meet all three. Furthermore, none of the existing approaches designed to estimate populationlevel consequences were broadly applied to multiple species simultaneously; thus, they do not allow comparisons across species. The assessment methodology described here builds from these previous studies but differs in two ways. First, it includes components that address all three of the assessment goals described by stakeholders, and, second, it is designed to be applied to multiple species."}, {"section_title": "The Assessment Methodology", "text": "The common principles underpinning the USGS methodologies currently in use for assessing undiscovered oil and gas and geologic carbon dioxide storage resources (Schmoker and Klett, 2005;Brennan and others, 2010;Cook, 2011, 2012) have been adopted in this methodology. The terms \"methodology\" and \"assessment\" are used many times in this report and may lead to confusion if not fully understood. It may be helpful to think of a methodology as a single recipe, the data it requires as the ingredients for that recipe, and an assessment as the process of cooking. The assessment is the internally consistent procedure of following one or multiple recipes (methodologies) to produce the assessment result, essentially the finished meal. Methodologies for assessing resources (geological, hydrological, biological, and so on) normally include a step-by-step procedure to use input parameters to calculate an output specific to the resource question. The act of assessing the resource (an assessment) can be as simple as following the methodology as written, or it can require additional planning if there are numerous resources (species, minerals, reservoirs) to be assessed, multiple geographic areas to consider, or a large project team to coordinate. For some methodologies, an implementation document is released to describe the process used to follow the methodology during a specific assessment (Blondes and others, 2013). The USGS is currently tasked only with the completion of the methodology, specifically the authoring of the steps and calculations required to estimate the impacts on volant species from wind energy development. The USGS is not planning to conduct an assessment."}, {"section_title": "Principles", "text": "The USGS methodology described in this report was designed to produce quantitative, probabilistic outputs when possible and to be transparent in process and structure. Similar quantitative and probabilistic approaches are used in conservation biology, applied ecological modeling, and ecological risk assessment (Athreya and Karlin, 1971;Boyce, 1992), and, as described above, for assessing wind energy impacts on wildlife. Quantitative results are the most useful output for an assessment. Numerical results can be analyzed more readily than qualitative results, generally provide a clearer statement of finding, and can best inform decisions. To be informative, a quantitative result must be presented in the context of the level of certainty associated with that result. The methodology described here, like others produced by the USGS, provides both a range of results and an indication of the uncertainty associated with each result. Typically, USGS assessment results are summarized with lower and higher bounds, a median result, and a mean result. A greater spread between lower and higher bounds reflects higher levels of uncertainty. A transparent process helps maintain the consistent application of the method and allows researchers external to the USGS to conduct assessments using the same methods and vet the results. An additional value of this transparency is the ease of improvement through iterative upgrades to the methodology. Methodologies often are revised and modified over time as knowledge and technology improve. For example, the USGS has published numerous revisions to its methodology for assessing continuous (unconventional) undiscovered oil and gas Cook, 2011, 2012). These changes were adopted as significant increases in production of continuous resources and additional data revealed limitations in previous methods. Thus, as studies of the effects of wind energy facilities on birds and bats continue, we anticipate changes in knowledge that will affect this methodology. Because the USGS methodology described by Diffendorfer and others (2015) and revised for this report assesses the effects of wind energy development on multiple species at broad scales, it could certainly be improved through future advances in research and understanding. Finally, in a complex multipart methodology such as the one described here, the various components should be structured and linked to each other to create a cohesive methodology that achieves the designers' goal. For example, the results for each component should be consistent internally, and the components should produce similar results across species. Science activities related to the management of species often require normative or subjective decisions, such as deciding how much risk to a species is unacceptable to society. It is essential that the methodology allow users to recognize when normative decisions are required by policymakers (normally outside the USGS) and clearly demarcate how such decisions affect the structure of the methodology."}, {"section_title": "Assessment Unit", "text": "In general terms, the assessment unit is the entity that the methodology assesses. The results from an assessment are calculated by using the methodology and are presented at the assessment-unit level. In the methodology described here, the assessment unit is any one of the individual bird and bat species that is present in the United States during any part of its life cycle. For birds and bats, species designations and common names follow those in the \"American Ornithologists' Union Checklist of North and Middle American Birds\" (American Ornithologists' Union, 2014) and \"Mammal Species of the World\" (Wilson and Reeder, 2005), respectively. Though the methodology focuses on the population of individuals that intersect with the United States, this may not represent the entire global population of a species. The portion of the total population present in the United States at any time during its life cycle is assessed. For example, a nonmigratory species distributed in the southwestern United States and Mexico is assessed by using that portion of the population that resides in the United States. Alternatively, if all individuals of a neotropical migrant bird species may be found in the United States during a stopover while flying between their more northern breeding habitat and more southern overwintering grounds, then this entire population is assessed. This definition of the assessment unit is made because all of the individuals move through the United States annually and are possibly exposed to wind turbines in the United States. In other words, the assessors consider the impacts of all the wind turbines that exist in a species' range within the United States, including Alaska and Hawaii. Populations in smaller geographic regions within a species' range could be assessed with the same methodology if interest, need, and data were available. However, the methodology is not designed to estimate site-or facility-specific impacts of wind energy development on a local population."}, {"section_title": "Output and Potential Uses", "text": "The assessment methodology produces outputs to address all three of the key issues relevant to stakeholders (a method to prioritize species rapidly, to estimate direct and indirect effects, and to identify potential population-level effects). Regarding prioritization, it produces ranked lists of species based on direct effects (from collisions and barotrauma) and indirect effects (from habitat change and behavioral avoidance of wind turbines) from wind energy development. This qualitative prioritization meets the need to quickly filter bird and bat species with respect to both direct and indirect effects from wind energy facilities. Second, the methodology produces two outputs that address the objective of quantifying population-level consequences from collision fatality (direct effects only). The first is an estimate of the expected change in population trend with the addition of fatalities from turbine collisions based on a demographic population model. The second uses potential biological removal (PBR), which is the maximum number of individuals, not including natural fatalities, that may be removed from a population while allowing that population to reach or maintain its optimum sustainable population (16 U.S.C. 1362 (20)). In this approach, a ratio of the number of animals killed by wind energy over the PBR indicates whether the fatalities from collision with wind turbines, when compared to the potential biological removal, would reduce the equilibrium population size below that set by the PBR. Thus, the demographic model approaches population-level consequences by estimating changes in trend, whereas the fatalities-to-PBR ratio estimates changes in equilibrium population size to address population-level consequences. Given the generalized nature of the methodology, its simplifying assumptions, and the quality of the input data, the output of the methodology should not be considered a definitive estimate of the consequences of wind energy generation on species. Instead, the methodology can be used to compare species in terms of the potential effects of wind energy on populations and to gage the level of the impact that wind energy development may have on a species. Furthermore, the methodology does not include presumptions that wind energy development has negative population-level impacts on species. The methodology can be used (1) to identify species likely to be at high or low risk from wind energy development and (2) to identify species needing further study or more detailed demographic modeling of their responses to wind energy development. The methodology cannot be used to estimate the impacts of individual wind energy facilities on birds and bats."}, {"section_title": "Intended Audience", "text": "USGS assessment results, and the methodologies that produce them, are created with multiple end users in mind. Due to the national scale and numerous assessment units involved, USGS national-scale assessments are typically of greatest use to decision makers, government agencies, and U.S. citizens who need a broad, general understanding of a particular resource. That understanding is based on the summation of individual quantitative results for each assessment unit, but these results should not be confused with site-specific or single-facility impact assessments. Assessments such as environmental impact statements (EISs) that are completed to comply with the National Environmental Policy Act (NEPA) (42 U.S.C. 4321 et seq.) are commonly site specific. The method described here is not related to the siting guidelines established by the U.S. Fish and Wildlife Service (USFWS) for reducing potential wildlife impacts at specific wind energy facilities (U.S. Fish and Wildlife Service, 2012)."}, {"section_title": "Methodology", "text": ""}, {"section_title": "Methodology Overview", "text": "A generalized flowchart of the methodology is presented in figure 2; detailed flowcharts of the components of the process are provided in the applicable sections of this report. For each species (the assessment unit), an assessor will gather data (step 1 in figure 2) and develop a species description that (1) summarizes any studies related to the species' responses to wind turbines, including studies related to the species' response to habitat loss, fragmentation, and roads; (2) includes the sources and reasoning for the model parameter estimates and their distributions, the observed fatality estimates at turbines, any time series of abundance data, and estimates of population size; (3) synthesizes information about the species to define the population being assessed; and (4) includes a species distribution map. Most efforts will be spent amassing species-level information on demographic rates and developing distribution or range maps from available sources such as eBird (Cornell Lab of Ornithology, 2015) or the Global Biodiversity Information Facility Secretariat (2015). This work also could include a formal process for eliciting expert opinion for those species lacking data (Runge and others, 2011;Martin and others, 2012). This information will be presented in both oral and written form to a peer-review assessment panel and modified as warranted. This step provides a layer of review for the data input into the assessment calculations and is common practice in USGS assessments. Once data are collected, all three components will be used. Because each component is independent of the others, their order does not matter. For the species prioritization component, species will be scored with respect to direct effects and indirect effects from wind energy facilities (step 2 in figure 2). The demographic model component estimates a change in population trend caused by fatalities from collisions with wind turbines (step 3 in figure 2). For each species, estimating the population trend may require estimating demographic rates from raw data, performing a meta-analysis from existing studies, or eliciting expert opinion. The PBR model component estimates how close the number of estimated annual fatalities from wind turbines is to the potential biological removal (PBR) by using a ratio (step 4 in figure 2). Step 1: Step 2: Step 3: Step 4: The prioritization component considers only current levels of energy development. The demographic and PBR components consider both current levels and estimates of projected wind energy development in the future. The final outputs from all components of the assessment include the following information: • Species prioritization component: • The qualitative ranking of each species considered relative to other species considered in regard to adverse effects from habitat loss or degradation (indirect-effects prioritization) • The qualitative ranking of each species considered relative to other species considered in regard to adverse population-level consequences from wind energy development (direct-effects prioritization) • Demographic model component: • The estimated change (with uncertainty) in population trend • PBR model component: • The ratio of collision fatalities to PBR with uncertainty Because the assessment outputs will depend critically on factors expected to change through time, some of them quite rapidly (such as the number of installed turbines or a species population size), it may be desirable to reassess some or many species fairly frequently."}, {"section_title": "Species Prioritization", "text": "The first component of the assessment methodology, species prioritization, is designed to rapidly characterize and prioritize a large number of bird and bat species in terms of their potential adverse effects from wind energy facilities. Stakeholders pointed out the need for a means to rate species into broad categories of risk, and this component attempts to meet this need. We emphasize here, and later in the report, that this component is qualitative in nature and does not incorporate the uncertainty associated with the input parameters. International conservation organizations, Federal and State agencies, and others involved in resource management commonly prioritize species by using variables such as current population size, population trend, and known threats. The use of prioritization methods in species management has been studied by conservation biologists, and, although uncertainty exists in the prioritization process (Burgman and others, 1999), risk-based ranking approaches, when combined across assessors, can estimate extinction risk with a 70-to 80-percent success rate (Keith and others, 2004). USGS investigators developed the prioritization component of the methodology based on two earlier studies. Desholm (2009) combined information about exposure (the proportion of a species' total population that moved through the area of a wind energy facility) and the ability of the species to respond to added mortality from wind energy facilities (the elasticity of adult survival). In contrast, W.P. Erickson and others (2014) examined the mortality rates of small passerines at wind energy facilities by dividing estimates of annual fatalities by continent-wide population estimates. The approach described here expands on these ideas by considering impacts beyond single facilities and includes indicators of a species' response to wind energy that focus on both direct and indirect effects of wind energy. While the metrics we developed do not directly measure risk (the probability of a negative event occurring), they follow a risk assessment framework by including (1) exposure (the proportion of the population potentially impacted by wind energy production) and (2) response (a measure of how species may respond to wind energy facilities when exposed). For response, the prioritization includes how a species may respond to fatalities and disturbance caused by wind energy production. This approach has been used in other ecological prioritization efforts (Parker and others, 1999;Andow and Hilbeck, 2004;Regan and others, 2008)."}, {"section_title": "Implementation", "text": "The species prioritization approach generates two lists of species, one for the direct effects and one for the indirect effects of wind energy production. Birds and bats are prioritized separately, so in an assessment, four unique lists are generated by using the combinations of bats and birds plus direct and indirect effects. The detailed flowchart in figure 3 shows that the prioritization component includes four different \"metrics.\" The metrics are potential indicators of population-level consequences from wind energy development. The metrics include (1) the species' conservation status (section 2.2.2.1.), (2) the proportion of annual fatalities caused by wind turbines (FT) (section 2.2.2.2.), (3) the direct-effects index (DEI) (section 2.2.2.3.), and (4) the indirect-effects index (IEI) (section 2.2.2.4.). Figure 3 also introduces the terms \"quantitative metric value,\" \"qualitative metric rating,\" and \"score.\" Following data collection (step 1 in figure 2), assessors produce quantitative measures of these metrics called the \"quantitative metric values.\" When breakpoints (table 1) are applied to these metric values, they are converted to qualitative metric ratings of high, medium, or low effects. These ratings can be compared across metrics and combined, using the example in table 2, to produce prioritization scores that rank species by their relative level of population-level consequences. Metrics are discussed in section 2.2.2. Section 2.2.3. explains how breakpoints are used to convert metric values into high, medium and low metric ratings and how species are scored. Section 2.2.4. addresses applying the prioritization to bat species. Table 1. Example breakpoints that convert species' quantitative metric values into qualitative metric ratings of high, medium, or low relative population-level effects from wind energy production organized by three levels of the caution associated with wind energy production and wildlife decision making. [In the conservation-status metric, 75% means that a species is a \"species of greatest conservation need\" (SGCN) in 75 percent of the States in which it occurs]"}, {"section_title": "Metric", "text": "Example metric value breakpoints at three levels of caution  Step "}, {"section_title": "Prioritization Metrics", "text": "In this section, we describe the metrics used in the prioritization process and the data needed for their estimation. We note that for this particular component of the methodology, we ignore uncertainty around the variables used to estimate the metrics and do not calculate uncertainty around each metric. This disregard of uncertainty emphasizes the point made above, that this component of the methodology is qualitative."}, {"section_title": "Current Conservation Status", "text": "Various organizations have classified the conservation status of many species in the United States for different purposes and with different standards of assessment. The species prioritization component of the USGS methodology uses the conservation status measured at the State level by the proportion of States that listed the species as \"species of greatest conservation need\" (SGCN) in a State wildlife action plan (SWAP) (Association of Fish and Wildlife Agencies, 2011). This metric was selected because SGCNs represent the most recent and comprehensive species status assessments in the United States, as all States participated. Congress required States to identify species with low and declining populations, and these species became the SGCNs for each State. Methods for identifying SGCNs varied across States, but the collective approach was historic in scope, identifying over 12,000 SGCNs (Association of Fish and Wildlife Agencies, 2011). The following quotation from the Association of Fish and Wildlife Agencies (2006, p. 13-14) describes the SGCN process used by States: \"States used a variety of information sources to identify target species, including natural heritage programs and other wildlife occurrence databases, data from other planning efforts and assessments, and input from agency biologists, academics, and other scientific experts. While the selection process included species under state-level programs and formal protection of the federal Endangered Species Act, the effort placed a major emphasis on identifying a broader set of species of concern that would include at-risk species not yet identified by other conservation efforts. States identified wildlife of greatest conservation need based on a variety of criteria: if a species had low populations, or had already been formally identified as a conservation priority, or showed other signs of imminent decline, it was flagged for attention.\" Using the proportion of States in which a species is an SGCN summarizes the level of concern each State identified for a species into a single value across its range. A species listed as an SGCN across 100 percent of the States in which it occurs has been independently identified as a species with a small or declining population in each State's species risk assessment. Furthermore, species with declining or small populations are more vulnerable to additional impacts than species with increasing, stable, or large populations (see Caughley, 1994, for a review)."}, {"section_title": "Proportion of Annual Fatalities Caused by Turbines", "text": "The most obvious impacts of wind energy generation on wildlife are usually fatalities of birds and bats from collisions with turbine blades. Various studies have quantified fatalities at individual wind energy facilities (Smallwood and Karas, 2009;Kitano and Shiraki, 2013), and researchers have projected fatality rates to larger scales (Loss and others, 2013;, as reviewed by Johnson and others (2016). W.P. Erickson and others (2014) divided species-specific fatality estimates by population size to compare mortality rates from turbines across a suite of small passerines. Building off these approaches, the proportion of annual fatalities caused by turbines (FT) compares species-specific fatality estimates from wind energy facilities to annual fatalities from all sources. To calculate FT, the estimate of the number of annual fatalities caused by wind turbines (n) is divided by the product of population size (N) and the adult mortality rate (calculated as 1 minus adult survival, s): Therefore, species with a higher FT value have a higher proportion of their total mortality caused by wind energy facilities. FT may be biased toward higher values if species strongly compensate for turbine mortality with a reduction in mortality from other sources. In general, long-lived species with low mortality rates are more likely to experience additive mortality from anthropogenic sources than short-lived species with inherently high mortality (Péron and others, 2013). The number of individuals killed by wind turbines each year, n, could be directly estimated from fatality studies if these data were available. Currently, direct estimates of fatality from turbine collisions across a species' range are not available for any species. Alternatively, one can coarsely estimate n by multiplying the total avian fatalities from wind turbines by the proportion of estimated fatalities attributed to each species. These types of estimates have been done for birds (Zimmerling and others, 2013; W.P. Erickson and others, 2014) but not for bats. In making these estimates, the researcher assumes that (1) the wind energy facilities chosen for sampling to estimate fatalities are representative of all wind facilities in the United States and (2) the carcasses of species killed by turbine collisions have similar levels of detectability in carcass searches. Both of these assumptions are clearly violated by the available studies, yet no alternative approaches have been developed. Estimating species-specific fatality rates with this approach creates uncertainty and perhaps bias in the assessment output. Bias in the estimates of species-specific fatality rates has not been studied, though it can exist. For example, fatalities in Texas are undersampled relative to the number of turbines installed there. If some species are killed at higher rates in Texas, then without these data, the estimated fatality will be biased low. If estimates of species-specific fatality rates improve, output from the methodology will improve. Total population size, N, is estimated by a number of organizations for birds, but it is very difficult to assess for most species of bats. The Partners in Flight program (Partners in Flight Science Committee, 2013), the midwinter waterfowl survey in the central flyway (Sharp and others, 2002), and the Waterbird Conservation for the Americas program (Kushlan and others, 2002) generate estimates of population size, with uncertainty, for some, but not all, bird species in the United States. If the population size estimates are restricted just to birds resident in the United States, but the fatality data include migratory individuals, FT may be overestimated. Population sizes for bats are difficult to estimate because of their nocturnal behavior, small size, and similar appearances across species. A few cave-roosting species of bats in the United States are monitored at a sufficient number of caves to produce rough estimates of population size (Thogmartin and others, 2012), but bats currently are not systematically monitored in the United States. The North American Bat Monitoring Program (NABat) seeks to address this data deficiency (Loeb and others, 2015; U.S. Geological Survey, 2015). When estimates of population size are not available, rough bounds based on expert judgment may be required (Russell and others, 2014). Note that the survival estimate used when calculating adult mortality should include fatalities from wind energy facilities. If a survival rate does not include fatalities from wind energy facilities, then the estimated fatalities from wind should be added to (1-s)N in the denominator of equation 1. Survival estimates for birds have been reported in several sources. These estimates were published in species-specific demographic modeling papers by the Institute for Bird Populations (Michel and others, 2006) and in \"The Birds of North America\" species accounts (Poole, 2005). Data for bats are sparse, but most bats are long lived, and estimates of survival exist for some species (Barclay and Harder, 2003;McCracken, 2003;O'Shea and others, 2003;Frick and others, 2007; Thogmartin and others, 2012)."}, {"section_title": "Direct-Effects Index", "text": "Data on annual fatalities caused by wind turbines are not always available and may be poorly estimated for some species, making estimates of FT highly uncertain. Beyond relying on just FT, the methodology also uses the direct-effects index (DEI). The DEI is based on the assumption that species with slow life histories and high exposure to wind turbines are more likely than species having fast life histories to have population effects from fatalities caused by collisions. Desholm (2009) made a similar assumption in a prioritization approach designed for use at individual wind farms. To calculate the DEI, the proportion of a species' range that overlaps with wind turbine locations (p) is divided by an index of life-history speed (the ratio of maternity [the number of female offspring per adult female per year, m] to age at first reproduction [a]): For birds, data for maternity and age at first reproduction are in the same sources as data for survival, whereas for bats, they are more difficult to obtain. For birds, maternity could be taken directly from the literature or calculated as the product of the probability a nest produces young, average clutch size, percentage of eggs that hatch, average number of clutches per year, and a presumed 1:1 sex ratio of offspring. The ratio of m/a was developed to account for the known relation between life-history traits and the elasticity of population trend as related to these demographic parameters (Oli, 2004;Stahl and Oli, 2006). For example, the population trend for a species with a ratio of m/a greater than 0.75 is most sensitive to changes in reproductive parameters, whereas the population trend of a species with a ratio of m/a less than 0.25 is most sensitive to survival. Because wind turbine collisions affect survival, m/a should measure the potential sensitivity of species to turbine collisions. Ultimately, m/a is a measure of life-history speed; some species have a low ratio because they have only a few offspring (small m) and delay reproduction (large a), whereas other species have a high ratio because they produce many offspring (large m) and reproduce earlier in their life (often a equals 1). Larger values of the DEI indicate a higher potential population response to collisions, which can be a result of either the presence of many wind turbines in a species' range or the slow life history of the species. Calculating the proportion of a species' range that overlaps with turbine locations (p), requires both a range map for a species and a map of the known locations of turbines. A range map is a geospatial data layer representing the spatial distribution of a species and may show variation in abundance across space or simply the presence or absence of the species. Turbine locations used in testing the USGS methodology were from a national turbine dataset developed by researchers working on this project (Diffendorfer and others, 2014); an expanded dataset has since been released by Hoen and others (2018). For both birds and bats, migration makes defining and mapping the range of a species complex because abundance changes across space and time during different times of the year, and for bats, fatalities increase during migration (Cryan, 2011;Ellison, 2012). Furthermore, some species may funnel into particular geographic regions during migration (Miller and others, 2014), thus increasing the population's exposure to turbines. For birds, breeding-season ranges and distributions of many species have been mapped with the North American Breeding Bird Survey (BBS) data (Sauer and others, 2015). Maps of overwintering locations could potentially be developed using data from the Christmas Bird Count (National Audubon Society, 2015). Maps of year-round distribution, including breeding, migratory, and overwintering areas, could perhaps be developed by using eBird, a citizen-science-based repository of bird locations (Cornell Lab of Ornithology, 2015). Ideally, the resulting maps would be used to integrate the proportion of the population exposed to wind energy facilities over an entire year as an estimate of p. This product does not yet exist and regardless of the final data source(s) used to make distribution maps, the same method must be applied to all species' during prioritization to ensure that the metrics using p are comparable across species. As an example of one way to roughly estimate p, the BBS abundance maps include an estimate of relative abundance in each grid cell (21.475 square kilometers) within the species' breeding range. The relative abundance in each grid cell included in the United States (some species' ranges included Canada) can be multiplied by the area of each grid cell, and then standardized to sum to 1 across all grid cells. Doing so creates an estimate of the proportion of the species' breeding population in each grid cell across the United States that ranges from 0 to 1; see an example in figure 4. The cumulative proportion of the population in grid cells containing one or more turbines is one estimate of p. This approach may overestimate p because isolated turbines may affect only a small portion of the population that is actually located in a grid cell. Conversely, if a grid cell contains a migratory pathway or wintering habitat, then p may be underestimated when based on data from only breeding birds. Furthermore, BBS maps represent the distribution of the species only during their breeding season, not at other times of the year. As noted above, a comprehensive approach for estimating the proportion of the population exposed to turbines annually does not yet exist. Scientists in North America do not yet have a centralized monitoring program for bats (see NABat at U.S. Geological Survey, 2015, and Loeb and others, 2015) or a repository for distribution maps. These species may require distribution modeling or range-map development as part of estimating p, as may some bird species. In addition, because bat fatalities are highest during autumn migration (Arnett and others, 2008;Cryan, 2011), seasonal range maps might be the most useful for modeling p in bats."}, {"section_title": "Indirect-Effects Index", "text": "Apart from, or in addition to, collisions with wind turbines, birds and bats may show population consequences due to disturbance, displacement, and habitat fragmentation and loss (Leddy and others, 1999;Langston and Pullan, 2004;Percival, 2005;Fox and others, 2006). Scientists consider indirect effects to be a potentially serious consequence of wind energy production. For example, Kuvlesky andothers (2007, p. 2490) stated: \"European conservationists generally consider the habitat loss associated with wind farm developments to be a greater threat to bird populations than are collision fatalities.\" This sentiment was repeated by Katzner and others (2013). A number of studies suggest that some bird species avoid turbines at variable distances (Leddy and others, 1999;Stevens and others, 2013). Furthermore, wind energy facilities include roads and transmission lines, both of which can affect species distributions (Forman and Alexander, 1998;Coffin, 2007). Although the population-level consequences caused by indirect effects have not been quantified for most species, information about the natural history of species may help categorize how they would respond to indirect effects. In general, highly specialized species are more sensitive to changes in habitat than generalist species (Swihart and others, 2003;Munday, 2004;Carrascal and others, 2013); in one study of the indirect effects of turbines on wintering birds, only the most specialized species studied (Le Conte's sparrow; Ammodramus leconteii) appeared to be displaced by turbines (Stevens and others, 2013). We developed the indirect-effects index (IEI) to take advantage of the expectation that species that use fewer habitats will be more sensitive to the indirect effects of wind energy facilities; it is calculated as follows: where p, as above, is the proportion of a species' range that overlaps with wind turbine locations and h is the number of habitats used by a species. Information on the number of habitats considered suitable for each species is available from the IUCN's species database (International Union for Conservation of Nature, 2014). The IUCN considers habitats to be geographic areas that include biogeography and latitudinal zonation (for example, boreal forest and subarctic forest). Higher values of IEI indicate a higher potential for population response because a large proportion of the population is exposed to turbines or the species occupies fewer habitats ( fig. 5). Although some combinations of p and h produce similar IEI values, the metric generally increases as the number of habitats declines and (or) the proportion of overlap with turbines increases. "}, {"section_title": "Base imagery from Esri", "text": "Because of stakeholders' concerns, we tried to include a measure of a species' response to indirect effects from wind energy; however, we found that a generalizable and quantitative approach that linked indirect effects to changes in population status was not feasible. In light of this realization, the IEI is estimated and included as part of the indirect-effects prioritization. Species that have high scores for indirect effects may require further scrutiny and research to understand if indirect effects from wind energy facilities do, in fact, occur and have population consequences. The final outputs from prioritization are two scored lists of species: (1) a direct-effects prioritization list with the highest value for the combination of FT and DEI with conservation status and (2) an indirect-effects prioritization list with a value for the combination of IEI and conservation status. A species for which assessors have limited data may appear on only one of the lists until more information is available."}, {"section_title": "Metric Rating Breakpoints and Prioritization Scoring", "text": "To ultimately generate prioritization scores for species, breakpoints that place the quantitative metric values into qualitative high, medium, or low ratings must be developed (table 1). For example, if a species is a species of greatest conservation need (SGCN) in 45 percent of the States in which it occurs and if it has an FT value of 0.05, should it be categorized as high, medium, or low? Selecting this rating scheme can be controversial; the prioritization scores for different combinations of conservation status and turbine effects, as well as the breakpoints for the effects classes, are scientific and policy related. For instance, the criteria from the International Union for Conservation of Nature (IUCN) went through six revisions from 1991 to 2001 (International Union for Conservation of Nature, 2012). Science can help inform "}, {"section_title": "EXPLANATION", "text": "this decision, but ethics, politics, and the legal framework used in decision making will ultimately set the breakpoints. For example, scientific studies indicate that small populations are more likely than large populations to go extinct (O'Grady and others, 2004), but deciding what population size results in a particular conservation status remains a question about values and risk aversion that science, alone, cannot answer. Decision makers, the wind industry, and other stakeholders also have an interest in the breakpoints selected for risk prioritization. A more cautious policy would set low breakpoints for prioritization relative to a less cautious approach. These differences could be important if meeting the breakpoints would result in additional mitigation or management requirements. Setting a low breakpoint may result in a larger list of potentially impacted species than setting a higher breakpoint. As part of an official USGS assessment, particular breakpoints could be used if these were agreed upon by stakeholders, were already used in decision making, or were required by legislation. Because the USGS does not promulgate policy or regulatory actions, and because unique breakpoints have not been identified for species impacted by wind energy, we elected to illustrate example breakpoints for three levels of caution associated with decision making regarding wind energy and wildlife (table 1). This decision reflects differences in the levels of risk aversion across stakeholders. Decision makers and other stakeholders can use results from any particular set of breakpoints depending on their requirements. Producing a prioritization score for a species is the final step in the prioritization component; it follows the metric rating step discussed above. The metric ratings are combined using guidelines in table 2 to produce the scores for both direct effects and indirect effects on species. Using direct effects as an example, the conservation-status metric rating is combined with FT and DEI metric ratings to assign a direct-effects score between 1 and 9. Species are assigned a score based on the maximum value for the combination of conservation status and either FT or DEI. Thus, if a species is \"high\" in FT but \"low\" in DEI, it is assigned the \"high\" rating. This approach rests on the assumption that different stressors and processes can result in multiple pathways to declines in population size. Using just the maximum metric rating for conservation status and direct effects also allows for the prioritization of species for which the model lacks data to estimate all of the metric values. Scoring a species does not require data to estimate all the metrics; instead, effects on a species can be evaluated on the basis of as many of the metrics for which data are available. For indirect effects, the conservation-status and IEI metric ratings are combined to assign an indirect-effects score (table 2). The final output from prioritization would be a relative ranking of species, by a score for direct effects and another score for indirect effects. To produce the prioritization scores shown in table 2, each metric value is placed into a high-, medium-, or loweffect rating. We selected three rating levels for each metric, which generated nine possible scores. Three were chosen because two rating levels did not provide enough resolution (4 scores), whereas four created difficulties when combining the ratings into 4×4 = 16 scores. For example, we could not easily consider how to rate species that had a 1st rating level for conservation status and a 4th rating level for direct effects relative to a species that scored a 2, 2. The approach currently emphasizes direct or indirect effects over conservation status when scoring species. For example, the combination of high direct or indirect effects with medium conservation status is scored higher (8) than its inverse (7) (table 2). Given the goals of the assessment, this scoring system emphasizes the possible effects of wind energy facilities more than a species' current conservation status. Prioritization scores are an initial ranking effort that can be reviewed and modified by experts, decision makers, and regulators."}, {"section_title": "Bats and Species Prioritization", "text": "The prioritization approach described above may be difficult to apply to many bat species because the assessors lack sufficient data to estimate the metrics. At the time of an assessment, data on bat species killed at wind turbines will be collated and a determination will be made on the adequacy of the data to support prioritization. If the data cannot support prioritization, the assessors could make three decisions. First, they could perform the prioritization using professional estimates from bat experts. Second, they could skip the prioritization approach and simply run all bat species through the demographic components. Given the large numbers of bats dying at turbines, this approach may be prudent. Third, the assessors could develop a different prioritization scheme similar to the Western Bat Species Regional Priority Matrix developed by the Western Bat Working Group (http://wbwg.org/matrices/). This matrix ranks the overall conservation risk to bat species in different regions of the Western United States."}, {"section_title": "Demographic Model", "text": ""}, {"section_title": "Background", "text": "Demographic models represent a well-developed set of mathematical tools in both population biology and ecological risk assessment. They can be used to understand the interactions between management actions and population trends (Crouse and others, 1987), compare projected population dynamics under different scenarios (Rose and Cowan, 2003), and investigate the factors and processes contributing to observed population trends (Koons and others, 2005;Thogmartin and others, 2013). Methods and tools for implementing demographic models are well established, including commercial software programs and open-source packages (for example, BatTool described by R.A. Erickson and others, 2014). Furthermore, the behavior of demographic models is well understood, and scientists have developed a framework for using them in risk assessments and population viability analyses (Burgman and others, 1993;Beissinger and McCullough, 2002;Morris and Doak, 2002). The general goal of the modeling used in this methodology is to understand if, and by how much, fatalities from wind turbines across a species' range in the United States affect that species' population trend while incorporating the uncertainties associated with the number of fatalities, the processes driving the demography of the species, and the observed population trend (when available). Although population trend is not the only variable associated with the status of a population, it indicates whether a population is growing or declining and correlates with estimates of extinction risk (O'Grady and others, 2004). Models of biological phenomena must balance generality, precision, and realism because an ecological model cannot simultaneously include high levels of all of these characteristics (Levins, 1966). For this USGS methodology, the demographic modeling approach should be general enough to apply to many species, including those lacking time-series abundance estimates, yet have sufficient realism and precision to produce results capable of indicating risk to the overall population from wind energy development. After considering a number of alternative approaches (see appendix 1), the USGS team developed a method based on simple, generalized population models to compare population trends with and without the addition of fatalities caused by turbines. This component (step 3 in figure 2) is termed the \"demographic model\" throughout this report ( fig. 6). The demographic model includes two steps: (1) estimation of population growth rate in the absence of wind energy facilities and (2) estimation of the change in population growth rate with the addition of fatalities from wind energy facilities."}, {"section_title": "Estimating Population Growth Rate", "text": "The population growth rate is the proportional change in population size from one year to the next. Annual growth rates and associated measures of uncertainty can be calculated with a time series of population size estimates (or a time series of population size indices). Monitoring programs, such as the BBS, routinely estimate population trends using such time series, and the current assessment methodology can use a similar approach to directly estimate population trends for species susceptible to direct impacts from wind energy production. For birds, the methodology uses the population trend data from the BBS and its reported confidence interval from 1970 to 1990. We selected 1990 as the final year to ensure that the trend estimates did not include potential impacts from wind energy facilities. Installed wind energy capacity was 1.2 GW in 1990 (U.S. Energy Information Administration [2017a], sum of reported generating capacities from EIA-860 survey forms for wind-powered electricity generators) and 82.2 GW in 2016 (American Wind Energy Association, 2017). Population trend estimates, with uncertainty, are calculated from BBS using hierarchical log-linear models and have been estimated for about 420 bird species (Sauer and Link, 2011). Although the methodology's default data for trend estimation are from the BBS, for some species, data that produce a better estimate of trend may exist, such as data from the midwinter waterfowl survey in the central flyway (Sharp and others, 2002). During an assessment, the assessors would determine the most appropriate data to use to generate an estimate of population trend with uncertainty. In the absence of empirical estimates of population growth rate, the dominant eigenvalue of a matrix population model is an alternative estimate of population growth rate (Caswell, 2000). Matrix models include assumptions that shape their applicability to particular ecological problems.  These assumptions are well described by a number of authors (Ebert, 1998;Caswell, 2000) and include the assumption that animals can be classified by age, density independence, a stable age distribution, and constant vital rates. The female segment of a population is described by using a stage-structured, post-breeding matrix model with an annual time step for this component of the methodology (Caswell, 2000;Morris and Doak, 2002). The age of first reproduction determines the size (number of rows and columns) of the matrix. For example, species that begin breeding within the first year of life would have a matrix with two rows and two columns, whereas a matrix of four rows and four columns would model species that begin breeding in the third year of life. The values in the first row determine recruitment (new individuals entering the population), and the subsequent rows describe annual survival after birth or hatching and each year thereafter. The second-to-last column represents juveniles that survive and mature to reproductive age and then reproduce before the next year.  Matrix parameters include survival (s, the chance a female survives from one year to the next) and maternity (m, the number of female offspring per female per year). Thus, fecundity is defined as the number of female offspring born to females surviving since the previous year (s j ×m or s a ×m, for juvenile and adult females, respectively). To develop the distributions around s and m, means and variances are taken from (in decreasing order of quality) the literature or available data, professional opinion, data on surrogate species, or an assumed value based upon theoretical expectations. For most species, when data on differential breeding success by age or life stage are not available, a single maternity value will be assumed for all reproductive stages. For both empirical estimates and matrix-based estimates of population growth rate, uncertainty or bias in the estimates of input parameters can introduce uncertainty or bias in the estimated trend. Care must be taken to ensure that estimates are representative of the population occurring in the United States and that they do not include populations already affected by wind energy development. In addition, the estimated population growth rate must be accompanied by some descriptor of the associated uncertainty, which can be estimated directly from time series or propagated through a matrix model by sampling survival, for example, from a beta distribution and maternity from a lognormal distribution."}, {"section_title": "Estimating Change in Population Growth Rate", "text": "To estimate the change in population growth caused by collisions with wind turbines, estimates of fatalities are made and then used to estimate a reduction in the existing population trend. The proposed approach uses the turbine mortality rate (c), which is the annual chance that an individual will die from a collision with a wind turbine. If wind fatalities are assumed to affect all species' stage and age classes at the same rate, then c is the same across all individuals, and an unstructured population model can be used to determine how those fatalities affect the population growth rate. In cases where the turbine mortality rate is known to vary by stage or age class, these values can be directly incorporated into the matrix model. In the absence of density dependence, populations grow exponentially, and the population size of a species is equal to its population size the previous year multiplied by its population growth rate, λ. Mathematically, population dynamics can be written as N t+1 =λN t , where N t is the population size in year t. With the addition of fatalities from wind energy facilities, N t+1 =λN t −cλN t , where cλN t is the number of individuals killed by wind turbines between t and t+1. With minor mathematical rearrangement, N t+1 =(1−c)λN t and the growth rate of a population experiencing a turbine mortality rate of c is equal to the population growth rate without fatalities caused by wind turbines multiplied by (1−c). This population growth rate can be written λ w =(1−c)λ b , where λ w is the growth rate of a population including the turbine mortality rate and λ b is the growth rate of the baseline population, with no fatalities from wind energy facilities. It follows that the change in population growth rate is equal to cλ b . To estimate the change in population growth rate, the turbine mortality rate must first be estimated. Current and projected future (see appendix 2) turbinecollision mortality rate estimates can be calculated by dividing the number of individuals of each species estimated to be killed in turbine collisions each year by the estimated population size. The estimated number of individuals killed by wind turbines each year, n, is described in section 2.2.2.2. For birds, the estimated population size comes from the Partners in Flight Science Committee (2013) and is presumed to span an order of magnitude in precision for total U.S. population sizes for each bird species (Rich and others, 2004;Confer and others, 2008). For bats, uncertainties for population size estimates will be extremely large, mainly because population sizes have not been estimated for most species. To estimate the effects of bird collisions with wind turbines, random samples of population growth rate without fatalities from turbines are drawn from a normal distribution with their mean and standard deviation from estimates described in section 2.3.2. These growth rate estimates could be from the BBS, from another monitoring program, or from the matrix model. Random samples of turbine mortality rate are drawn from a triangular distribution, where the mode is n divided by the Partners in Flight Science Committee's (2013) point estimate of population size, and the endpoints are from the order-of-magnitude uncertainty bounds. The change in population growth rate and resulting expected population growth rate with wind energy production are then calculated for each set of samples by subtracting the turbine mortality rate from the population growth rate, generating distributions for both the change and the expected growth rate with mortality from wind energy facilities. Using the distributions of growth rates with and without fatality from wind energy production, the assessors can estimate the probabilities that the population trend is <1 for both the original growth rate and the growth rate with the effects of wind turbines considered. The output is the change between the probability that the population trend is <1 with fatalities and the probability that the trend is <1 without fatalities from wind energy facilities. In the demographic model component, collision fatalities are assumed to be additive to natural mortality, and awareness of this assumption is critical to interpreting the results. The role of additive versus compensatory mortality on population dynamics is not well understood (Burnham and Anderson, 1984;Nichols and others, 1984). In reality, some species may compensate for wind mortality by means of reductions in other sources of mortality or increased reproduction, whereas others may not. For species that do compensate, the estimates of change in trend will likely be overestimates. Thus, if the estimates of c are not biased low, the results from this component should be considered as estimates of the maximum possible change in population trend caused by the fatalities."}, {"section_title": "Potential Biological Removal and PBR Ratio", "text": ""}, {"section_title": "Background", "text": "Potential biological removal (PBR) is an estimate of the total number of animals that could be killed from any anthropogenic source before a population would decline below a population size deemed sustainable, often considered half of a species' carrying capacity (Wade, 1998). Since its inception, the use of PBR estimates has become a standard approach for managing human-induced deaths of marine mammal species (Taylor and others, 2000). Scientists have studied various details of the approach, such as how it is used to predict risk (Wade, 1998;Milner-Gulland and Akçakaya, 2001), how parameters can be estimated (Niel and Lebreton, 2005;Dillingham and Fletcher, 2008), and how management decisions and assumptions of risk influence PBR assessments (Lonergan, 2011;Moore and others, 2013). O'Brien and others (2017) pointed out limitations to the PBR, suggesting it be used at broad biological scales, such as the national scale used by this USGS assessment methodology. In addition, the PBR and variations of it have been applied to bird species in relation to deaths caused by long-line fishing (Richard and Abraham, 2013), hunting (Runge and others, 2009), and wind turbines (Bellebaum and others, 2013). In particular, USGS and USFWS scientists used the PBR, renamed as the \"potential take limit\" (PTL) following Runge and others (2009), to assess limits on the number of harvested Nearctic birds in Mexico (Johnson and others, 2012). Watts and others (2015) used the PBR to estimate sustainable mortality limits for 35 shorebirds in the western Atlantic flyway. Recently, USFWS scientists used the PBR and demographic models to assess the impacts of anthropogenic threats, including wind energy production, on the population status of bald eagles (Haliaeetus leucocephalus) and golden eagles (Aquila chrysaetos) (Millsap and others, 2016). The PBR is calculated as follows: where r max is the maximum annual population growth rate under optimal conditions, N min is a lower bound on an estimate of the population size, and F is a recovery factor, set by decision makers. In the PBR calculation, r max /2 represents the rate of take (number of individuals harvested, or killed) that maximizes the net productivity of a population when logistic growth is assumed (Wade, 1998). The parameter F is a factor set by decision makers (1) to adjust the value of the PBR to increase the rate of recovery of populations that are too small or (2) to account for uncertainties in the data used to calculate the PBR and to ensure that the PBR is not set too high. Under the Marine Mammal Protection Act (MMPA; 16 U.S.C. 1362(20)), values for F can fall between 0.1 and 1.0. In use, PBRs are calculated on a regular basis and updated based on changes in N min , which are calculated from monitoring. Simulations indicate that populations can be sustainably harvested when losses are limited through the use of regular estimates of the PBR (Wade, 1998;Johnson and others, 2012). In practice, estimated values of the PBR are compared to observed fatality rates. If fatalities are well below the PBR, then a population should remain above an acceptable level. In a study by Richard and Abraham (2013), the ratio of sea-bird fatalities from entanglement during long-line fishing to the PBR was calculated by using Monte Carlo approaches and was called the relative risk; this ratio is called the PBR ratio in this USGS methodology. When the value for the PBR ratio is much less than 1, fatalities are much lower than the PBR and wind energy operations are least likely to decrease population sizes. As the PBR ratio increases, wind turbines are killing a higher fraction of the PBR, and at values at or above 1, the PBR is either met or exceeded by fatalities and the species' population size is expected to decline. The PBR is an estimate of the total number of fatalities from all anthropogenic sources, while the PBR ratio measures just the fatalities from wind energy facilities alone relative to the PBR. The PBR ratio does not include fatalities occurring from other sources. Thus, a species could have a PBR ratio less than 1 and still be over its PBR because individuals die from other causes. The PBR ratio exclusively compares fatalities from wind energy facilities to the PBR, allowing an assessment of fatalities from wind energy in isolation. Currently, both the National Marine Fisheries Service and the U.S. Fish and Wildlife Service calculate PBRs for marine mammal stocks, including cetaceans, pinnipeds, sea otters (Enhydra lutris), polar bears (Ursus maritimus), and West Indian or American manatees (Trichecus manatus). They follow the regularly updated \"Guidelines for Assessing Marine Mammal Stocks\" (GAMMS; National Marine Fisheries Service, 2015) to perform these assessments. The USGS methodology adopts these guidelines because of their historical and current use by the Federal Government and the levels of research and effort used to regularly update them. The maximum annual rate of population growth under optimal conditions, r max , is difficult to estimate because, for most species, observations of populations existing in optimal conditions are rare. Estimates of r max are available for a few species, such as bacteria in petri dishes, species expanding into new areas, or those recovering from a population crash or overharvest (Gedamke and others, 2009). A number of approaches exist to estimate r max (Slade and others, 1998;Millar and Meyer, 2000;Niel and Lebreton, 2005;Gedamke and others, 2007), and the assessment could use any of these depending on the data available for a species. For example, if a bird species has temporal data showing its recovery after reaching a small population size, the methods in Gedamke and others (2007) or Millar and Meyer (2000) might be useful. Runge and others (2009) used the method of Slade and others (1998) to estimate r max for black vultures (Coragyps atratus). Runge and others (2009) assigned probability distributions to input variables and used Monte Carlo simulations to propagate that uncertainty when estimating r max . Ultimately, the final decision on the approach used to estimate r max for a species will be a key undertaking of the assessor and assessment panel. For marine mammals, GAMMS recommends using default values previously developed for groups of species (for example, pinnipeds or cetaceans) in the absence of other compelling data. It may be possible to develop default values for groups of birds and bats on the basis of allometric scaling between body size and life history parameters (Dillingham and others, 2016). As with r max , N min can be calculated by using a variety of approaches that are often dependent upon the data available. In the Marine Mammal Protection Act (16 U.S.C. 1362(27), as amended in 2004), N min is defined as follows: (27) The term \"minimum population estimate\" means an estimate of the number of animals in a stock that-(A) is based on the best available scientific information on abundance, incorporating the precision and variability associated with such information; and, (B) provides reasonable assurance that the stock size is equal to or greater than the estimate. Taylor (1993) and Wade (1998) used simulations to study how setting the lower limit of population size (on the basis of a percentile from the distribution around an average abundance) affected how a PBR could be used to meet conservation criteria. Wade (1998) showed that setting N min to the 20th percentile resulted in 95 percent of simulation runs remaining at or above the target population size and the recovery of populations in simulations where population sizes were started below the target population size. The target population size was defined as the population size that resulted in the \"optimum sustainable population,\" which is defined in the Marine Mammal Protection Act as follows: (9) … the number of animals which will result in the maximum productivity of the population or the species, keeping in mind the carrying capacity of the habitat and the health of the ecosystem of which they form a constituent element. The 20th percentile approach is now recommended by GAMMS and is formalized into a specific equation for calculating N min : where N is an unbiased abundance estimate and CV(N) is the coefficient of variation of the abundance estimate. The term F was originally described as a recovery factor (Wade, 1998), but it more broadly represents management goals and has biological implications (Runge and others, 2009). For example, values of F between 0 and 2 result in PBR values that, if met, will achieve a sustainable population. The resulting sustainable population size will vary with F. The model assumes linear density dependence of the population growth rate versus population size, so at F=0 and 1, the population will equilibrate at carrying capacity (K) and K/2, respectively. As F increases towards 2, fatalities approach r max , and at F=2, the PBR is r max ×N min and theoretically the population size should decline to 0. Thus, values of F near 2, but less than 2, would result in very small equilibrium population sizes, well below the population's carrying capacity. The relation between F and the equilibrium population size is used to set F for particular policy objectives. Under the MMPA, F is restricted to be between 0.1 and 1. This range in F is based primarily on extensive simulation studies of marine mammal populations (Barlow and others, 1995;Wade, 1998) and the management objectives defined in the MMPA. The results of the GAMMS simulation analyses suggest a value for F of 0.1 for stocks considered endangered; 0.5 for stocks considered depleted, threatened, or unknown; and 1.0 for stocks known to be at their target population size, stocks that are increasing, or stocks that are not decreasing and are harvested only by subsistence hunting. This methodology follows the GAMMS suggestions for F with modifications for birds and bats. Endangered species are assigned a value for F of 0.1 to reflect a management objective of recovery. Threatened species, species showing population declines, or species with an unknown population status are assigned a value of 0.5. Species that are not listed, exhibit stable or growing populations, or are not considered overabundant are assigned a value of 1. Finally, overabundant species with management goals directed towards reducing population size are assigned a value of 1.5."}, {"section_title": "Implementation", "text": "To estimate the impacts of fatalities from wind energy production on population size for a species, the users of the assessment methodology will calculate the PBR ratio, which is simply the annual estimated fatalities from collisions with wind turbines divided by the PBR (fig. 7). This ratio is the proportion of the PBR accounted for by fatalities at wind energy facilities. As this value increases from 0, fatalities increase but these do not impact population size independent of other mortality sources; at a value of 1, wind-energy-related fatalities are equal to the PBR. When the PBR ratio is greater than 1, fatalities are greater than the PBR, and the population is expected to decline. The PBR ratio will be estimated by sampling across the uncertainty in the PBR and the uncertainty in estimated fatality to calculate a mean PBR ratio and an accompanying confidence interval. As with the FT metric in the prioritization component (section 2.2.2.2.), the observed number of fatalities is currently calculated by using an approach that does not correct for differences in species detection rates and can cause significant biases in the estimated number of fatalities. The use of these current estimates could lead to unreliable assessment results at the national or regional level. The methodology includes the PBR ratio to allow the identification of species with potentially different impacts from fatalities at wind facilities. However, the broader implications of the PBR ratio for the overall status of a species are critical to consider. A species with a low PBR ratio may still be imperiled because fatalities from other sources push the species above the PBR, or because other processes not measured by the PBR, such as habitat loss, are affecting a species. Thus, the PBR ratio measures only the potential impact of fatalities from wind turbines in the United States on a species, not the effects of other sources of fatality or other effects of wind turbines. As with all models, the PBR is based on a number of assumptions that can affect its applicability to the assessment of the effects of wind energy production on species (O'Brien and others, 2017). The PBR is based on an assumption of density dependence, and the simplistic form of equation 4 specifically is based on linear density dependence. This assumption could be relaxed by using a theta-logistic function for density dependence (Johnson and others, 2012) and could be tailored to specific species if information on the form of density dependence were available. The PBR was developed as a tool to assess take of marine stocks and should be regularly updated to set harvest limits. In the assessment, the one-time estimate of the PBR is a snapshot, or single sample, of a process that may show considerable variation through time. Species populations will likely change from year to year, as will the annual number of fatalities. Thus, users of the methodology assume that the estimated PBR ratio is indicative of long-term averages. During an implemented assessment, a number of activities would occur to improve estimates of the PBR. First, assessors would meet with members of regulatory agencies to better define management objectives and possibly revise the default values of F. Second, as r max is estimated for more species and the range of r max values is better understood, simulation studies similar to those performed during development of the GAMMS recommendations could be performed to determine values of F and N min that would meet established management objectives. Third, a meta-analysis of r max estimates could be conducted to perhaps estimate defendable default values of r max by taxon Figure 7. Flowchart of the PBR model component of the assessment methodology, for which a generalized flowchart is shown in figure 2. GW, gigawatts; PBR, potential biological removal. Step 4: PBR model component or life-history type. Fourth, the nature and shape of density dependence in birds and bats would require study. Most PBR applications assume linear density dependence, and the methodology currently follows this assumption. Additional research on birds and bats could help verify or refine this assumption."}, {"section_title": "Overall Methodology Development and Validation", "text": "As noted in section 1.3., the methodology has a number of elements that should be checked and refined during an assessment. These refinements include establishing guidelines for (1) estimating demographic parameters, including population size, when data are sparse, (2) developing species distribution maps by a common method, (3) estimating species-specific fatalities, and (4) selecting breakpoints for species prioritization. While the USGS developed the methodology, specific approaches were implemented for the test case species described below (section 4.0.) and the future scenarios (appendix 2), but some of the approaches used may not be optimal. For example, the components of the methodology generally produce consistent results across the test case species, but as more species are prioritized and their data are used in the demographic model and PBR ratio components, consistency across the components should be checked. In addition, the results of the demographic and PBR components could be compared with the outcomes of more detailed research as they become available. Customized population models are being developed for several species that would also be assessed with this methodology, including the golden eagle and whooping crane (Butler and others, 2013), and these models could be used to check that the simpler models used in the methodology produced qualitatively consistent results. If consistency declines, modifications may be necessary. Improvement to the methodology through focusing on four key issues would produce results that are more reliable. First, robust, species-specific fatality estimates do not currently exist. The current approach used to estimate speciesspecific fatality rates (section 2.2.2.2.) may produce unknown biases because it does not account for species detectability and does not sample across the geographic distribution of turbines . Second, population-size estimates are poor for most species, particularly bats. The uncertainty around the turbine mortality rate could be decreased considerably with better fatality and population-size information. In addition, by using population estimates derived from breeding bird survey data, but fatality data from both breeding and migratory animals, the turbine mortality rate might be overestimated if birds killed by turbines are not counted in the population estimate. Third, range maps describing a species' relative abundance across space and through time are not currently available for most species. Because these maps would be used to compare species, a consistent method to produce them on the basis of widely available location data (for example, from eBird; Cornell Lab of Ornithology, 2015) would be a valuable contribution to the assessment. Fourth, the methodology would be improved if scientists could develop a greater understanding of the role of additive versus compensatory mortality in birds and bats. Components of the methodology (demographic model, FT, DEI) are based on the assumption that all of the fatalities from wind energy facilities are additive. This assumption may be violated for some species, but assuming that species compensate for fatalities from wind energy essentially means that one assumes that the fatalities from wind energy facilities have little effect on a species. The components of the methodology that assume additive fatality, because they may overestimate impacts, evoke a precautionary assumption when applied to species that compensate for fatalities, and this possibility should be considered when interpreting the results of the methodology. The current methodology does not explicitly take into account minimization approaches, such as curtailment (shutting down turbines at low wind speeds), which has been shown to decrease fatalities of bats (Arnett and others, 2011), nor does it assume that future approaches can decrease fatalities in birds. During an assessment, up-to-date estimates of fatality would be used. If curtailment or other minimization strategies are widely implemented and if data collected during fatality surveys accurately reflect fatalities, then fatality rates used in the assessment should reflect any reductions in fatalities the minimization approaches create. Including minimization strategies in future forecasts could be done but would require additional information related to (1) how many facilities will implement the strategies in the future and (2) the predicted declines in fatalities from these strategies. For example, studies of curtailment indicate how much bat fatalities are decreased, but the number of facilities that will implement curtailment in the future is unknown. In addition, minimization approaches may work only for some species, making it difficult to include these approaches in future forecasts. Finally, during an assessment, the methodology would require input from decision makers at three points in the process where policy decisions are necessary. First, the scoring approach of table 1 is based on our perception of a need to consider the effects of wind energy development ahead of conservation status. This subjective judgement requires external review and possible adjustment prior to an assessment. Second, the breakpoints used in the prioritization process are subjective and require input from an external panel of regulators, members from the wind energy industry, and other stakeholders. Third, the methodology currently uses the guidelines associated with marine mammals as default values for the recovery factor (F) when calculating the PBR (eq. 4). The parameter F is associated with levels of acceptable risk and should be set by regulators, not the USGS. Thus, the USGS will require input from regulatory agencies to determine whether the selected values of F are appropriate."}, {"section_title": "Test Case", "text": "This section describes the methods and results for a set of species run through the methodology as a test case. The results described here should not be considered definitive statements of the impacts of wind energy development. The input data were gleaned from a variety of sources and were not thoroughly vetted as they would be during a formal assessment. Because of the variety of inputs, species names are not reported and details on the sources of input data are purposely vague. The results presented here give readers an example of the output an assessment would produce, but they may not correctly characterize the impact of wind energy development."}, {"section_title": "Introduction", "text": "Data for six avian species were processed through the assessment methodology to demonstrate the required input parameters and the methodology outputs. In addition, three bat species were assessed using the demographic model and PBR components. These species were selected because data were readily available and because analysis of these species may produce a range of results in the assessment. The following section presents test case results from the species prioritization component, the demographic model component, and the PBR model component. The results are shown for three scenarios defined by installed capacity as follows: (1) current (2014) wind energy development (62.3 GW, from American Wind Energy Association, 2014), (2) medium wind energy development for the year 2025 (94 GW), and (3) high wind energy development for the year 2025 (121 GW). See appendix 2 for details on the methods used to develop the scenarios."}, {"section_title": "Data Sources", "text": "Published research, data from resource-management agencies, and reference works were used to develop the parameter values. Conservation-status information was found on websites and in reports of the IUCN (International Union for Conservation of Nature, 2014) and the USFWS (U.S. Fish and Wildlife Service, 2014) and in individual State wildlife action plans (Association of Fish and Wildlife Agencies, 2015). Population size (N) for bird species came from the Partners in Flight Science Committee (2013) and were estimated during the 1990s (Rich and others, 2004). Bat population sizes came from USFWS reports or species status updates. For all species, 20 percent of the population size estimate was used as a rough approximation of N min . Either direct estimates or data used to calculate demographic parameters (survival, maternity, r max , and age at first reproduction) were found in Poole (2005) and Michel and others (2006) for birds or in USFWS reports and species-specific publications (not listed here to keep species anonymous) for bats. For birds, maternity (m) was calculated as the product of nest success, clutch size, hatchability, clutches per year, and presumed equal sex ratios at hatching. If data on hatchability or the number of clutches were lacking, the parameters for them were set to 0.9 and 1, respectively. For birds, the age of first reproduction (a) was presumed to be the first breeding season after fledging unless evidence suggesting otherwise was available. In the prioritization component, the proportion of a species' range that overlaps with the locations of wind turbines (p) was calculated as described in section 2.2.2.3., using North American Breeding Bird Survey relative abundance maps (Sauer and others, 2015) and the USGS wind turbine location data (Diffendorfer and others, 2014). The numbers of fatalities (n) were estimated from turbine mortality data compiled from multiple sources by Loss and others (2013) following the approach described in section 2.2.2.2."}, {"section_title": "Prioritization Results", "text": "Input data, calculated conservation status, and turbinerisk metrics for bird species in the prioritization component are listed in tables 3 and 4. Although the data sources described here may be the same as those used in an actual assessment, a vetting process by an assessment panel would ensure the data were appropriately selected and used. The vetting process was not included in this test case. The prioritization example illustrates the key role breakpoints have on the outputs from the species prioritization component. With the high-caution breakpoints, Birds 3 and 2 had the highest direct-effects scores and every species had a score ≥6, whereas with the low-caution breakpoints, Bird 1 had the highest direct-effects score and most birds had scores of 1. Using the high-caution breakpoints, Bird 3 had the highest direct-effects score of all species because both Percent SGCN and the DEI were categorized as high. Birds 1 and 4 had lower direct-effects scores because their conservation status (Percent SGCN) was low. Bird 5, a habitat specialist with a high conservation status, had the highest indirect-effects score."}, {"section_title": "Demographic Model Results", "text": "Birds 1, 2 and 3 and three bats were analyzed with the demographic model. The input parameters used for demographic modeling are provided in table 5. The analysis was conducted following the process described in section 2.3. Because all the bird species had adequate time-series data from which to calculate an observed trend, and the bats had existing estimates of trend from ongoing research efforts, the matrix model was not used to estimate a baseline population trend. Note that the trend for birds was calculated by using data up to 1990, a date prior to large numbers of turbines being installed. This endpoint may not be appropriate in an actual assessment given potential changes in population status since 1990 due to factors other than wind energy development. The key results of the demographic model component are presented in table 6 for three bird species and three bat species. The decrease in the population trend and the resulting Table 3. Input data for calculated conservation-status, direct-effects, and indirect-effects metrics for the prioritization component of the test case. [Species are anonymized to reduce the chance of inferences being developed prior to full vetting of the input data and the methodology. No., number; SGCN, species of greatest conservation need]  Table 4. Output values of conservation-status, direct-effects, and indirect-effects metrics and the resulting scores using high-and low-caution conservation breakpoints from table 1 for effects from collision fatalities and effects from habitat change from the prioritization approach."}, {"section_title": "Species", "text": "[  Table 6. Results of the demographic model for 2014 and projected levels of wind development for three bird species and three bat species. [The observed population trend, expected population trend with wind energy development, and projected decrease in population trend are reported with 95-percent confidence intervals in parentheses. Installed capacity in gigawatts (GW) for each scenario is as follows: current (2014) scenario, 62.3 GW (American Wind Energy Association, 2014); medium-capacity scenario for 2025, 94 GW; high-capacity scenario for 2025, 121 GW. w/o, without; λ, population growth rate; <, less than. Projected change in probability λ<1 is the difference in the probability of λ<1 without wind energy development versus the probability of λ<1 with wind energy development]  projected trend with additional mortality from wind energy development are reported as means with 95-percent confidence intervals for each of the three scenarios. Finally, the increase in the probability of population growth rate values being less than 1 is reported along with the probability of population growth rate values being less than 1 with wind-facility-related mortalities for each scenario. Bird 1 showed a very small response to fatalities from wind turbines, even in the wind energy development scenarios involving a high installed capacity. Bird 1 ranked relatively high during prioritization because its life-history parameters produced a high DEI (table 4). However, relative to its population size, a small fraction of individuals was projected to be killed (table 5), resulting in small estimates of added mortality and minimal changes in population trend. The projected decline in population trend for Bird 1 ranged from 0.00004 to 0.00008 across current and projected levels of wind energy generation (table 6). Both Bird 2 and Bird 3 had existing long-term declines in population size with observed mean population trends less than 1. Current levels of wind energy facilities had a larger negative effect on Bird 2 (mean decline = −0.012) than Bird 3 (mean decline = −0.003). For Bird 2, with current levels of wind energy facilities, the mean observed population trend was projected to decrease from 0.989 to 0.977, while Bird 3 was projected to decline from a mean of 0.995 to 0.992. As expected, declines in population trend increased with higher levels of wind energy development. For Bird 2, the model also projected large increases in the percentage of population growth rates less than 1 without versus with wind energy development. Like the birds, bats showed different responses to fatalities from wind energy facilities. Bat 2 was predicted to be most impacted by wind energy development, with changes in population growth from nearly stable (1.075) to declining (0.937) at high levels of installed wind energy. Bats 1 and 3, like Bird 1, showed very small responses in population trend with the addition of fatalities from wind energy facilities, even at high levels of increased capacity in the future."}, {"section_title": "Potential Biological Removal", "text": "As with the demographic model, Birds 1-3 and three additional bat species were analyzed by using potential biological removal (PBR) and PBR ratios. An F value of 0.5 was selected for all species. In birds, all three species showed declines or uncertain trends in the last 11 years of available BBS data through 2012Sauer and others, 2015). Of the bats, one showed a negative trend in population size and concerns exist regarding white-nose syndrome for the remaining species. Confidence intervals of 95 percent around PBR were calculated by using the upper and lower confidence intervals on r max , and variation around the total number of annual fatalities. The species showed considerable differences in both the PBR and the PBR ratio (table 7). With F at 0.5, no bird species had a PBR ratio over 1 at current levels of wind energy development (table 7, fig. 8), though the confidence interval overlapped 1 for Bird 2. For Bird 1, under both projections of future wind energy development, the PBR ratio remained low, nearly zero. Bird 2 showed the highest impact from future wind energy, with PBR ratios approaching 1 and then exceeding 1 as installed wind capacity increased ( fig. 8). For Bird 3, PBR ratios remained below 1, but confidence intervals overlapped 1 in both scenarios of future growth. Bat 1 and Bat 3 showed minimal impacts from wind energy development, with PBR ratios near zero at all levels of current or forecasted wind energy development (table 7, fig. 8). Bat 2, however, like Bird 2, showed potential impacts from future wind energy development, with PBR ratios increasing beyond 1 in both medium-and high-capacity scenarios of future wind energy growth. In this test case of the methodology, six bird species were considered in prioritization while three birds and three bats were evaluated with the demographic model and the PBR model. Results for Bird 2 indicated a larger effect than effects on the other species both in potential declines in the population trend and in the PBR ratio. Results for Bird 3 indicated medium levels of potential decreases in trend and a medium to high PBR ratio. Bird 1 showed negligible effects from wind turbines. Bats 1 and 3 showed minimal impacts from wind energy facilities, whereas Bat 2 showed relatively stronger negative effects. Bat 2 showed declines in population growth and PBR ratios approaching and greater than 1, indicating that wind energy development may impact this species."}, {"section_title": "Implications of the Test Case for the Overall Methodology", "text": "The approach outlined here provides a quantifiable and replicable means of prioritizing species on the basis of potential effects and approaches to estimate the impact of adverse effects of wind energy facilities on birds and bats. Output from the methodology (direct-effect indexes, indirect-effect indexes, estimates of the change in population trend for current and future projected wind energy development, and PBR ratio) could be provided for all bird and bat species for which sufficient data have been gathered. This approach relies on the development of new sources of information, such as speciesspecific fatality data and a suite of basic population parameters for the less studied bat species affected by wind energy generation. This approach should be used iteratively, updating subsets of species to accommodate changes in conservation status and new information on demography, range, population size, fatality rates for birds and bats, and changes in the distribution and capacity of installed wind turbines. An example of a potential summary table that includes the major final outputs for the test case species is presented in table 8. Table 7. Parameter inputs and outputs for potential biological removal and PBR ratios at current levels of wind energy development for three prioritized species of birds and three nonprioritized species of bats. [Values in parentheses represent the upper and lower 95-percent confidence intervals. F, recovery factor; N min , minimum population size; No., number; PBR, potential biological removal; r max , maximum annual population growth rate under optimal conditions; PBR ratio, turbine fatalities divided by the PBR]  Figure 8. Graph showing the ranges of PBR ratios when the recovery factor (F) equals 0.5 for three bird species and three bat species at current (2014) levels of installed capacity and for both medium-and high-capacity scenarios for 2025. Each black circle represents the best estimate for the scenario, whereas each colored bar represents the range spanned by the upper and lower confidence intervals. The projected scenarios are as follows, by installed capacity in gigawatts (GW): current (2014), 62.3 GW (American Wind Energy Association, 2014); future medium (2025), 94 GW; future high (2025), 121 GW. PBR, potential biological removal."}, {"section_title": "Species", "text": "The following text includes examples of how the test case outputs provided in table 8 could be interpreted. All statements are limited in scope to the specific set of species evaluated in the test case. Bats were not prioritized, but Bat 2 had the highest measures of adverse population-level effects across all species. The demographic model indicated that the probability the population growth rate would be <1 was about 36 percent with current wind energy capacity and higher with future build out. The PBR ratio for Bat 2 is 0.76 with current wind energy levels, suggesting that current fatalities from wind energy facilities are not greater than the PBR. However, with medium or high wind energy build out, the PBR ratio for Bat 2 climbs to 1.14 and 1.47, respectively, the highest PBR values in the test case and values well over the theoretically sustainable level of 1.0. Bird 2 had the highest direct effects according to its prioritization score of 8. It also had the second highest measure of adverse population-level effects in both the demographic model and the PBR model. The PBR ratio of 0.57 was less than 1, suggesting that current fatalities from wind energy facilities alone are not greater than the PBR; however, the upper limit value of 1.57 is greater than 1, indicating that there is some probability that wind energy fatalities could exceed the PBR. All values increased under the medium and high development scenarios. The results for Bat 2 and Bird 2 do not mean that these species are currently declining because of fatalities from wind turbines. Instead, the available data, when used in the methodology, and given its assumptions, indicate that both Bat 2 and Bird 2 may experience population-level consequences from wind energy generation more than other species evaluated. In contrast to the potentially adverse effects seen in the test case for Bat 2 and Bird 2, some other species-Birds 1 and 3 and Bats 1 and 3-showed little evidence of population-level consequences. They had low PBR ratios and low predicted changes in λ<1, both currently and with the future Table 8. Summary table of the main output values for all components of the methodology: species prioritization, demographic model, and potential biological removal model. [Installed capacity in gigawatts (GW) for each wind energy development scenario is as follows: current (2014) scenario, 62.3 GW; medium-capacity scenario for 2025, 94 GW; high-capacity scenario for 2025, 121 GW. PBR-ratio values are presented as averages, and 95-percent confidence intervals are in parentheses; PBR ratios greater than 1 indicate a decrease in population size. Other terms: NA, not applicable; NM, not modeled; NP, not prioritized (for the test case, bat species were not prioritized); PBR, potential biological removal; PBR ratio, turbine fatalities divided by the PBR; λ, population growth rate] growth scenarios. Results for Bird 3 suggested higher potential impacts than those for the other low-impact species given larger changes in the percentage of population growth rates <1 and PBR ratios that overlapped 1 in both future projections. Results for Bird 5 suggest a different type of impact; it had the highest score (7) for indirect-effect prioritization. This score was caused by the species occurring in only two habitats, resulting in an IEI metric score higher than scores for any other bird species assessed. No studies exist regarding this species' response to wind energy, so additional research would be necessary to conclude if this species is being displaced from wind turbines and if such displacement impacts the species."}, {"section_title": "Conclusions", "text": "The USGS team created an assessment methodology to provide both qualitative and quantitative metrics related to the effects of wind energy development on particular species of birds and bats at the national scale. This work built on a variety of existing quantitative approaches focused on ecological risk assessment to provide a regional to national perspective that will inform decision makers, industry, and the public. The assessment methodology described in the preceding sections is an attempt to develop an approach to quantify the significance of the effects of wind energy development on species population trends. For both the demographic model and the potential biological removal (PBR) model approaches, uncertainty is captured in the input ranges for the model parameters and reflected in the probabilistic assessment output. The test case provided is only an example of the method and is not an official assessment result. As the science of impact research matures, this method may be updated and improved to reflect new knowledge in this rapidly growing field of study. The USGS does not plan to conduct a national assessment of impacts to species. The approaches described here and the resulting output should be considered only for a scientific assessment; they are not designed as a method to develop management strategies related to wind energy development for a particular species. The model produces an estimate, with uncertainty, of the effects on population trends or a PBR ratio from observed fatalities at wind turbines. Decision makers prioritizing species for avoidance, minimization, and mitigation actions might use this information, and they might also include information about the feasibility, probability of success, and cost. This approach should not replace detailed, speciesspecific studies or population models of those species garnering high levels of attention. Furthermore, the approach is not designed to estimate the total capacity levels of wind energy that could be installed across the Nation before species show population declines. Instead, the approach could help inform decisions related to the following: 1. Identification of those species at low risk from wind energy development. 2. Identification of those species that may be at risk from wind energy development. 3. Quantification of the expected decline in population trend for identified high-risk species from current and future levels of wind energy development. Michel, N., DeSante, D.F., Kaschube, D.R., and Nott, M.P., 2006 Miller, T.A., Brooks, R.P., Lanzone, M., Brandes, D., Cooper, J., O'Malley, K., Maisonneuve, C., Tremblay, J., Duerr, A., and Katzner, T., 2014, Assessing risk to birds from industrial wind energy development via paired resource selection models: Conservation Biology, v. 28, no. 3, p. 745-755, accessed January 8, 2015, Evolution, v. 16, no. 12, p. 686-692, accessed January 21, 2015, at http://dx.doi.org/10.1016/S0169-5347(01)02278-9. Moore, J.E., Curtis, K.A., Lewison, R.L., Dillingham, P.W., Cope, J.M., Fordham, S.V., Heppell, S.S., Pardo, S.A., Simpfendorfer, C.A., Tuck, G.N., and Zhou, S., 2013, Evaluating sustainability of fisheries bycatch mortality for marine megafauna-A review of conservation reference points for data-limited populations: Environmental Conservation,v. 40,no. 4,accessed   demographic model A mathematical model used to generate quantitative and probabilistic estimates of impacts to species populations associated with the additional fatalities caused by collisions with wind turbines. direct effects Fatalities from collisions of birds and bats with turbines. In this report, barotrauma is included as collision damage."}, {"section_title": "direct-effects index (DEI)", "text": "In this report, DEI = p/(m/a), where p is the proportion of a species' range that overlaps with the locations of wind turbines, m is maternity (number of female offspring per adult female per year), and a is the age at which females become reproductively mature. fatalities caused annually by wind turbines (n) The estimated number of fatalities per year caused by collisions with wind turbines or barotrauma. To date, n has been estimated by multiplying an estimate of total fatalities across all species by the proportion of the observed fatalities accounted for by a species. species prioritization Qualitative approach to rapidly screen a large number of species and rank them in terms of the relative risk of a population-level consequence from wind energy development. State wildlife action plan (SWAP) Proactive plan, developed as a comprehensive wildlife conservation strategy, that helps to conserve nongame wildlife and vital natural areas before they become too rare and costly to protect. time series A group of data collected sequentially, usually at fixed intervals of time. turbine mortality rate (c) The annual chance that an individual will die from a collision with a wind turbine. volant species Winged species capable of flying."}, {"section_title": "Glossary Appendixes 1 and 2", "text": "Once national projections of additional installed capacity were allocated to each region, the regional capacity values (in gigawatts) were converted to the number of turbines expected to be installed in each region. Current information on the average capacity of turbines (in megawatts) and its trend through time was used to convert regional capacity (in gigawatts) into the number of turbines. A linear increase in average capacity of turbines was assumed on the basis of the rate of increase in average capacity of active turbines installed in each region since 2005 ( fig. 2.2). The projected future regional capacity was then divided by the estimated capacity per turbine to determine the number of installed turbines in each region. Because increasing turbine height correlates with increases in fatalities (Loss and others, 2013), we also modeled the projected height of future turbines. Turbine height is related to turbine capacity ( fig. 2.3). A power function was fitted to the heights and capacities of turbines that were active in each region in 2014. This relation was used to estimate average turbine height based on average capacity (in megawatts) in each scenario. The predicted number of turbines in each region and their associated heights for each wind energy projection scenario were input into the statistical model developed by Loss and others (2013) to estimate the number of annual avian fatalities expected at onshore wind energy facilities in the United States in 2025 and a 95-percent confidence interval (table 2.1). These values differ from those in Loss and others (2013) because we used the USGS turbine dataset (Diffendorfer and others, 2014) when estimating turbine heights and the total number of turbines for each region. Although it would be possible to develop more sophisticated methods relying on distributions of turbine capacities and heights, assumptions about the shapes of these distributions would be speculative. Because estimates produced using mean heights and capacities for turbines installed through July 2013 differed by less than 3 percent from those produced using numbers of turbines of different heights and capacities, the added detail is unlikely to greatly improve the estimates of fatalities. The approach described above is limited in the sense that it does not predict the change in spatial distribution of turbines. For example, if turbine technology changes so that new turbines can be installed in the southeastern United States, the approach cannot predict this change. In this case, species that exist in the southeast that currently do not collide with turbines would not be part of the future forecasts. If forecasts of future wind energy production become more spatially explicit, the assessment could incorporate these predictions into the future forecasts. In addition, applying the forecasted fatalities to the demographic model and PBR includes considerable uncertainty. For example, the approach is based on the assumption that the current status and trend of the species will be the same in 2025 as they are now. This assumption is likely untrue for a number of bird and bat species showing long-term declines. During an assessment, the methods described here may or may not be used. For example, the most up-to-date forecasts of future wind energy trends could be used instead of those provided here. In addition, estimates of fatality from wind energy facilities, and the statistical models underlying these, will likely show improvements. If so, these approaches could be integrated into the methodology.  Diffendorfer and others (2014). Curved lines represent power functions (linear regression on a log-log scale) relating turbine capacity to hub height in each region. R 2 is the coefficient of determination and indicates how well a model fits the data."}]