[{"section_title": "Introduction", "text": "Acute respiratory coronavirus 2 (SARS-COV-2) is the cause of evolving global pandemic coronavirus disease 2019 (COVID-19). 1, 2 Since its emergence, COVID-19 becomes a serious global public health and economic threat. World Health Organization (WHO) has been declared as a pandemic disease on 11 March 2020. 3 It was initially identified in Wuhan, China in December 2019 as a case of pneumonia . Since that, it has spread across the world and reported from almost all countries within a few months. The global total confirmed cases have exceeded 21,107,157, and it killed 785,102 people on 14 August 2020 [Worldmeter] .\nThe first COVID-19 related death was officially reported in Iran on 19 February 2020. 4 As of 11 May 2020, 278,892 confirmed total cases and 6,640 deaths occurred in Iran due to COVID-19 . According to COVID-19 morbidity statistics, Iran was ranked 11th after the United States, Brazil, India, Russia, South Africa, Peru, Mexico, Colombia, Chile, and Spain. 5 The Basic Reproductive Number (R 0 ) which indicates the average number of people infected by each infected case in a susceptible population is an essential concept in the epidemiology of infectious diseases. 6 This figure for the COVID-19 epidemic is 2.8 to 3.8 based on a metaanalysis conducted on Chinese studies. 7 If we consider this number to be 3.5, about 56 million people in Iran as a country with a total population of more than 83 million in the Persian Gulf region will be infected. 8 Moreover, an estimate showed that about 14% of infected cases could have a severe illness, and also 6% of them could be critical cases who require special care. 9 Therefore, if no serious action is taken to reduce the transmissibility of the disease, probably 8 million hospital beds and 3 million special care facilities are required to treat severe cases in Iran.\nDue to the absence of vaccines or drugs for COVID-19, the only effective method to control the disease is public health measures such as social distancing. Social distance measures were implemented in late March 2020 in Iran. Social distancing means reduced movement outside the home. 10 That is used to reduce contacts between people in a community. 11 This measure can delay the peak of the epidemic which could give a chance to the healthcare system to be more prepared to contain pandemic. 9 The National Committee to Combat Corona in Iran decided to close down shopping malls and big markets, sports places, and swimming pools, parks, and museums and even mosques, holy shrines, and Friday prayers. 12 These measures followed by reduced mobility within provinces of Iran. Since social distance has a profound effect on the economic and social condition of the country, assessment of its effectiveness is necessary to support decision-makers. A study in China showed that when social distancing starts with only 1-day delay, 2.41 days will be added to the containment period. 13 However, there is limited evidence on the effectiveness of social distancing measures on the incidence and mortality of COVID-19 in Iran.\nStudies based on data from hospitalized patients showed that the mortality rate of COVID-19 is associated with older age, male gender, and underlying diseases such as diabetes, hypertension. [14] [15] [16] Local forecasts based on different scenarios are crucial to enhance or take new control measures during epidemic. Due to limited evidence on this issue, the current study aimed to investigate the effectiveness of social distancing measures on the trend of morbidity and mortality of COVID-19 in Iran."}, {"section_title": "Materials and Methods", "text": "In the current quasi-experimental study, we used daily data on confirmed cases and death of COVID-19 from Feb 20, 2020, to May 13, 2020. All used data extracted from Our World in Data website that is available at https://ourworldin data.org/coronavirus. The data converted to a proportion (per 100,000 population). Interrupted time series (ITS) model used to assess the effect of social distancing on the incidence and mortality of COVID-19. The ITS is one of the appropriate models that could assess the short-and long-term effects of one or more interventions in quasi-experimental studies. In this model, the dependent variable is measured before and after the intervention. Our data included 84 observations of the deaths and COVID-19 confirmed cases that occurred in Iran during the mentioned period. Although social distancing started formally in the fourth week of March 2020, considering the Incubation period of this infection to better evaluation of the effect of this measure, April 9, 2020, is considered as the starting time of social distancing in our analysis. Finding on the incidence of COVID-19 in the Princess Diamond cruise ship shows that deaths began two weeks after the identification of the Index case. 14 Thus, it is reasonable that one examines the effects of social distancing on mortality and morbidity rates after two-week of implementation. So, deaths and cases occurred before April 9, 2020, were considered as a baseline (control period), while death and cases occurred after April 9, 2020, as an intervention period. Segmented regression model and ITS analysis using Newey ordinary least squares OLS regression-based methods were used to model the under-studied data. The Newey approach estimates the coefficients by OLS regression, but due to possible heteroskedasticity and autocorrelations the Newey-West standard errors are used to handle them. To ensure the estimation of a model that accounts for the correct autocorrelation structure, the Actest, lag (6) were used to investigate autocorrelation and selection of best lags to model estimation. Due to the presence of autocorrelation error terms at lag 1 (P < 0.001) for both incidence and death of data, the primary model adjusted with lag (1). The standard ITS regression model is as follows:\nis the aggregated number of cases/deaths that occurred at each equally spaced time point t, T t is the time since the beginning of the study, X t is a categorical variable representing the intervention (pre-intervention periods 0, otherwise 1), and X t T t is an interaction term. The β 0 represents the intercept. β 1 is the slope of the outcome variable before Table 1 ]. Figure 2 shows the trend of COVID-19 cases occurrence before and after the implementation of social distancing in Iran. The trend of new cases of COVID-19 was increasing before the implementation of social distancing, however, after the implementation of social distancing, the occurrence of new cases is decreasing [ Figure 2 ]. The proportion of COVID-19 deaths at the beginning of the study period is −0.01 [ Table 2 ]. The trend of proportion of COVID-19 deaths was significantly increasing before the implementation of social distancing (9 April 2020) (ß = 0.005 (95% CI = [0.004-0.006]; P < 0.001)). The trend of COVID-19 deaths was significantly decreasing after the implementation of social distancing (ß = −0.07 (95% CI = [−0.10 -−0.05; P < 0.001])). The occurrence of new deaths had a decreasing trend over the time after 9 April 2020 with the coefficient (ß = −0.007 Figure 3 shows the trend of deaths of COVID-19 cases before and after the implementation of social distancing. The trend of new deaths of COVID 19 was increasing before the implementation of the intervention (9 April 2020), but it was decreasing after the implementation of the intervention."}, {"section_title": "Discussion", "text": "The results of the present study showed that social distancing significantly reduced the incidence and mortality of COVID-19 in Iran. Despite the increase in the number of cases before and the early days of social distancing implementation, there was a significant reduction after the implementation. However, a reduction in the occurrence of new COVID-19 cases since April 9, 2020 (after the implementation of social distancing) was steady. This finding is consistent with the incubation period of the infection.\nAn average estimated incubation period of COVID-19 is 5.1 days, and in most cases, the disease detected around the second week of the incubation period. 19 Thus, some cases of the disease might have been infected in the days before the implementation of social distancing, and diagnosed after the implementation of the measure. Therefore, a significant reduction in the incidence of the disease was observed in 1-2 weeks after the implementation of social distancing. The present study retrospectively analyzed the data of the number of confirmed cases and COVID-19 mortality over 84 days.\nThe current study had some limitations. First, during the study period, some variables such as the definition of the case and accuracy of the diagnostic tests may be changed and this could affect the effectiveness of the intervention positively or negatively. Second, some variables such as the level of the population knowledge regarding COVID-19, the extent to which people have access to the health-care system, and their compliance with health principles could affect the effectiveness of social distancing. However, since data on these variables were not available, controlling their role was not possible. Third, unregistered infected individuals are likely to maintain the disease transmission cycle in families 21, 20 which obscure the effectiveness of social distancing.\nDespite the economic, psychological impacts of social distancing measures, 22, 23 its role in containing the pandemic is undeniable. However, social distancing should be implemented with caution and greater sensitivity due to its extreme effect it imposes on the socioeconomic status of a country. Therefore, social distancing and other prevention programs could prevent the mortality and morbidity of Iranians population to some degree. Other measures such as case finding, isolation and contact tracing, encourage people to use a face mask and follow the "}, {"section_title": "Conclusion", "text": "The present study suggests that social distancing could decrease the incidence and mortality related to COVID-19. Thus, it is necessary to continue these measures, because if the government plan to reduce the social distancing measures the occurrence of the next waves of the epidemic will be inevitable. "}]