[{"section_title": "Abstract", "text": "ABSTRACT A significant advance in the onset dates of the South China Sea summer monsoon (SCSSM) is detected around 1993/94: the epochal mean onset date is 30 May for 1979-93 and 14 May for 1994-2008. The relatively late onset during the first epoch is primarily determined by the northward seasonal march of the intertropical convergence zone, whereas the advanced onset during the second epoch is affected by the enhanced activity of northwestward-moving tropical disturbances from the equatorial western Pacific. During 1994-2008, the intraseasonal variability (ISV) over the western Pacific was enhanced during the period from mid-April to mid-May; further, the number of tropical cyclones (TCs), which passed through the South China Sea (SCS) and Philippine Sea during the same period, is about doubled compared with those occurring during 1979-93. This enhanced ISV and TC activity over the SCS and Philippine Sea are attributed to a significant increase in SST over the equatorial western Pacific from the 1980s to 2000s. Therefore, the advanced SCSSM onset is rooted in the decadal change of the SST over the equatorial western Pacific."}, {"section_title": "Introduction", "text": "The South China Sea summer monsoon (SCSSM) is an important component of the Asian summer monsoon because the South China Sea (SCS) is geographically located at the center of the Asian-Australian monsoon system and a joint region of the East Asian monsoon and the western North Pacific monsoon (Murakami and Matsumoto 1994; ). One of the most spectacular features of the SCSSM is its abrupt climatological onset across the entire SCS basin in the middle of May (Lau and Yang 1997; Wang and Xu 1997; Wang and LinHo 2002) . It is accompanied by a reversal of the low-level premonsoon easterly to monsoon westerly over the SCS between 58 and 158N and an enhanced convection activity with rainfall bursts in the northern SCS (108-208N). The SCSSM onset signifies the commencement of the rainy season in eastern Asia (Tao and Chen 1987; Ding 1992 ) and the western North Pacific (Wang and LinHo 2002) . In addition, the interannual variation of the SCSSM has a broad impact on the East Asian weather in boreal summer (Nitta 1987 ) and the Indian Ocean climate variability (Kajikawa et al. 2003) .\nRecently, the interdecadal change of the western North Pacific monsoon, including the SCSSM, has been discussed (Kwon et al. 2005 (Kwon et al. , 2007 . Kwon et al. (2005) found a significant decadal change in the East Asian summer monsoon and its relationship with the western North Pacific monsoon before and after (inclusive) 1994. Yim et al. (2008) found a similar interdecadal change in the long-term integration of a hybrid coupled model simulation and suggested a potential reason for this change. also found that the summer and autumn rainfall has increased over southern China and the northern SCS, but decreased over the central SCS after 1993. They also noted an interdecadal change in seasonality based on the season-reliant empirical orthogonal function (SEOF) analysis. However, the detail of this interdecadal change was not fully explored yet and the possible mechanism remains elusive. In addition, the interdecadal change around 1993/94 was also found in the periodicity and spatial structure of the intraseasonal variability (ISV) over the SCS during boreal summer (Kajikawa et al. 2009 ). This interdecadal change of the ISV would potentially impact on the SCSSM seasonal cycle.\nThese previous results of the interdecadal change in summer mean field and the ISV over the SCS around 1993/94 raise a question-that is, whether this interdecadal change has seasonal dependency. The long-term climate variability or change may affect the SCSSM differently from season to season. Therefore, in this study we examine the interdecadal change in the seasonal evolution of the SCSSM with a special focus on its transition phase, in particular the summer monsoon onset. Our objectives are to 1) detect the interdecadal change in the SCSSM evolution, especially its onset and withdrawal; 2) examine the nature and processes of such an interdecadal change; and 3) determine the potential factors responsible for the change in the timing of SCSSM onset, if any.\nSection 2 describes data used in this study. In section 3, we examine the interdecadal change of the SCSSM evolution and show a significant change in the SCSSM onset date around 1993/94. We examine the different SCSSM onset processes before and after (inclusive) 1994 in section 4. Potential factors to determine the SCSSM onset timing are examined in section 5. Concluding remarks with discussions are presented in section 6."}, {"section_title": "Datasets and method", "text": "We used the daily mean interpolated outgoing longwave radiation (OLR) data from the National Oceanic and Atmospheric Administration (NOAA) satellite for the period 1979 (Liebmann and Smith 1996 as an indicator of tropical convection activity, daily mean wind data from the National Centers for Environmental Prediction (NCEP)-National Center for Atmospheric Research (NCAR) reanalysis project for the period 1949 (Kalnay et al. 1996 , and the monthly mean Hadley Center sea surface temperature (SST) dataset for the period 1979 (Rayner et al. 2003 . The tropical cyclone track data over the western Pacific from the International Best Track Archive for Climate Stewardship (IBTrACS; Knapp et al. 2010) were used for the period 1979-2008. The Lanczos bandpass filter (Duchon 1979 ) was applied to the OLR dataset to extract the intraseasonal signals-10-25-and 30-80-day variations, respectively. Since we have a 30-yr satellite dataset available, we focus on interdecadal change between two epochs: 1979-93 and 1994-2008 in this study. Both the period of 1979-93 and 1994-2008 have 15-yr data samples."}, {"section_title": "Interdecadal change of the SCS summer monsoon onset", "text": "First, we examined the climatological difference of the SCSSM evolution between 1979-93 and 1994-2008 . In this study, we used the daily mean SCSSM circulation index rather than rainfall index to capture large-scale variations. This is also because of the unavailability of daily rainfall data over the ocean. Using a wind circulation index has the advantage of avoiding random noise associated with small-scale rainfall variation. Figure 1 shows the time series of the SCSSM circulation index that is defined as 850-hPa zonal wind averaging over 58-158N, 1108-1208E (Wang et al. 2004 ) during the two epochs. During 1979-93, the SCSSM index turns from negative (easterly) to positive (westerly) in late May, which indicates the mean SCSSM onset time. The index reaches first peak in late June and a second major peak in the middle of August. The index turns to negative in the middle of October, signifying the mean withdrawal date of the SCSSM. In contrast, during 1994-2008 the SCSSM starts from early May and reaches the first peak in the middle of May with the major peak in early August. However, the monsoon withdrawal remains unchanged in the middle of October. Of great interest is that the significant difference of the SCSSM index between the two epochs is mainly seen during early summer, especially in May. The epochal difference of the SCSSM circulation index in July and August is not statistically significant, although seemingly large. The SCSSM during 1994-2008 is also significantly stronger in the middle of September. However no significant difference can be found in the withdrawing of the SCSSM around the middle of October.\nTo detect the interdecadal change of broad-scale seasonal evolution in an extending monsoon area, the time-longitude distribution of the epochal difference in Fig. 2 . Significant westerly wind anomalies in early to middle May are prominent not only over the SCS but also over the northern Indian Ocean. These westerly anomalies are associated with the enhanced convection anomalies over the SCS and Bay of Bengal in early May. The negative OLR anomalies in early to middle May and positive OLR anomalies in early June over the SCS are consistent with the results of the SCSSM circulation index (Fig. 1) . Notable westward propagation of negative OLR anomalies from 1508E to the SCS in early May is also significant. The other westward-propagating negative OLR anomalies from 1008 to 608E are also noteworthy in late April to early May. Most significant convection anomalies are seen only in May, which means the monsoon over the SCS and the Bay of Bengal tends to start earlier in the second epoch than in the first one.\nIt has been described that the climatological abrupt SCSSM onset occurs in the middle of May with longrecord dataset starting from 1950 (Wang et al. 2004 ). The results of the possible interdecadal change between 1979-93 and 1994-2008 in the SCSSM circulation index, OLR, and 850-hPa wind field should be connected with the long-term SCSSM onset date variability. Here, we defined the SCSSM onset date in each year by using the daily mean SCSSM circulation index following previous studies (Wang et al. 2004; Kajikawa et al. 2010) . The onset day is defined as the first day after 25 April that satisfies the following criteria: 1) on the onset day and during the 5 days after the onset day the averaged SCSSM index must be greater than 0 (meaning FIG. 2. Time-longitude diagram of OLR and 850-hPa wind difference between 1979 -93 and 1994 along 108N (1994 minus 1979 . Only those that are significant at a 95% level by Student's t test are plotted. Counter denotes the climatology during 1979-93. The vector unit is 10 m s 21 and the shading and contour interval is 10 W m 22 .\nthat the westerly is steadily established); 2) in the subsequent 20 days, the SCSSM index must be positive in at least 15 days; and 3) the cumulative 20-day mean SCSSM index must be greater than 1 m s 21 (meaning a persistent seasonal transition). Because the large-scale seasonal transition and the connection of southwesterly over the SCS and southwesterly over the Indian Ocean basically occur after late April, we defined the cutoff day as 25 April to eliminate the false detection of the bogus onset. Figure 3 shows the time series of the SCSSM onset date from 1948 to 2008 by using the NCEP-NCAR reanalysis data. Clear interdecadal shift of the monsoon onset date between 1993 and 1994 is seen. The climatological mean onset date during 1979-93 is around 30 May; in contrast, that during 1994-2008 is around 14 May. The difference is about two weeks and this is statistically significant. The interannual variability of the SCSSM onset variation during 1994-2008 is relatively smaller than the previous epoch. Although some other interdecadal variability seems to occur before 1979, we will mainly focus on the interdecadal shift between 1993 and 1994. In addition, both the SCSSM onset in 1979 and the second epoch occur around mid-May, but we define 1979-93 as the first epoch in this study. The interannual and interdecadal change of the SCSSM onset day is consistent with those calculated with pentad mean data as Wang et al. (2004) , whose interannual correlation is more than 0.80."}, {"section_title": "Differences in the onset processes during the two epochs", "text": "To examine the differences in the evolution of the mean SCSSM onset, we calculated the composite of OLR and 850-hPa winds based on the SCSSM onset day in each year for both epochs-1979-93 and 1994-2008 . Figure 4 shows the composite map of the SCSSM onset processes in 1979-93 from 10 days before the onset day.\nAt day 210, an active convection center is located over the eastern Indian Ocean and the Sumatra and Borneo Islands that is accompanied by twin cyclonic circulation to the west of the convections in both Northern and Southern Hemispheres (Fig. 4a) . Westerly wind has maximum speed along the equator at day 210. Easterly wind is robust over the entire western North Pacific (WNP). These active convections gradually move northward with eastward expansion from day 28 to day 22 (Figs. 4b-e) . The developing convection center reaches the Arabian Sea and the Bay of Bengal, and maximum westerly wind axis reaches 108N at day 22. Eventually, the active convection area is abruptly expanded into the southern part of the SCS and the westerly wind penetrates to the SCS at day 0 (Fig. 4f) . The WNP subtropical high is shifted eastward, concurring with the SCSSM onset. The convection over the southern Indian Ocean is weakened along with the SCSSM onset. It is suggested that the SCSSM onset during the period of 1979-93 is primarily associated with a northward migration of the seasonal march of the intertropical convergence zone (ITCZ).\nOn the other hand, the SCSSM onset processes during 1994-2008 are different from the previous epoch (Fig. 5) . Before the onset, the WNP subtropical high extends farther westward than that in 1979-93, with prominent active convection over the equatorial Indian Ocean at day 210 (Fig. 5a ). The convection is more restricted along the equator than that in 1979-93's climatology. Because of the confinement of the convection along the equator, the northern part of the twin cyclonic circulation over the Bay of Bengal is weak. Another convection center is seen over the equatorial western Pacific. The convection over the Indian Ocean moves northward in a similar manner as in the previous epoch from day 28 to day 22 (Figs. 5b-e) . However, this convection is confined only over the Bay of Bengal and is gradually weakened. Of great interest are the convections over the western Pacific that move northwestward and intensify. Eventually, the active convections move into the SCS and the wind direction over the SCS abruptly changes from easterly to westerly at day 0 (Fig. 5f) . Thus, the SCSSM onset during 1994-2008 is affected by the enhanced activity of northwestward-moving tropical convections, which are associated with tropical disturbances, from the equatorial western Pacific. In short, the most prominent difference in the SCSSM onset processes between the two epochs lies in the direction of active convection and the associated low-level westerlies coming into the SCS. Figure 6 shows the timelongitude diagram of the SCSSM onset composite along 108N. It is highlighted that the westward-moving convection clearly affected the SCSSM onset during 1994-2008. The development of the convection over the Arabian Sea and the west side of the Bay of Bengal also differs between the two epochs."}, {"section_title": "Factors responsible for the SCSSM onset variability", "text": "What factors determine the interdecadal change of the SCSSM onset? It is well known that convective instability with near-neutral to unstable temperature profile in the lower troposphere is necessary for the abrupt convection enhancement for the monsoon onset. Meanwhile, the SCSSM has large ISV. The ISV over the SCS has two dominant time scales: one is a 10-25-day variation called ''quasi-biweekly mode,'' and the other is a 30-80-day variation, which is coupled with the eastward-propagating Madden-Julian oscillation (MJO; Madden and Julian 1994) (Kajikawa and Yasunari 2005) . Several studies have discussed the importance of the tropical disturbances and ISV on the triggers of the SCSSM onset. Chan et al. (2002) found the SCSSM onset in 1998 was mainly controlled by the 30-60-day variation. Zhou and Chan (2005) investigated the role of the two types of the ISV-10-20-and 30-60-day variations-in the establishment of the SCSSM and concluded that these two types of the ISV activities interact to cause a weakening of the subtropical high over the western Pacific. Some studies also claimed that the SCSSM onset was frequently triggered by the MJO (Straub et al. 2006; Tong et al. 2009 ). Meanwhile, Mao and Wu (2008) found that the tropical cyclone ''Chanchu'' entering the SCS acted as an immediate trigger for the onset and contributed to the establishment of the SCSSM in 2006. Based on these previous studies, we explore the roles of the thermal precondition, the ISV activity, and the tropical cyclone activity in interdecadal change of the SCSSM onset. troposphere up to 500 hPa is unstable in April but gradually weakening through May during 1979-93. A large potential temperature difference between the two epochs appears around 11 May, which indicates the abruptly enhanced convective anomalies due to the SCSSM onset itself during [1994] [1995] [1996] [1997] [1998] [1999] [2000] [2001] [2002] [2003] [2004] [2005] [2006] [2007] [2008] . No significant difference in the thermal condition over the SCS appears before the SCSSM onset. This implies that the preconditioning for the onset during boreal spring is similar in both epochs at least over the SCS and has little impact on the interdecadal change of the SCSSM onset."}, {"section_title": "b. Intraseasonal variability", "text": "To detect the interdecadal difference of the ISV activity, we calculated mean standard deviations of the 10-25-and 30-80-day filtered OLR during 15 April-15 May, which covers 1 month before the climatological SCSSM onset during 1994-2008. To explore the possible factors that produce favorable conditions for generating tropical cyclones in May during 1994-2008, we calculated the genesis potential index (GPI; Emanuel and Nolan 2004) in May for both epochs. The GPI is a metric that combines 1) large-scale vorticity at 850 hPa, 2) relative humidity at 600 hPa, 3) maximum potential intensity, and 4) wind shear between 850 and 200 hPa. Large value of the GPI indicates the enhancement of tropical cyclone development. The potential intensity is primarily governed by SST and surface relative humidity. Figure 10 shows the GPI in each epoch and the difference between the two epochs. The large GPI value is seen over the western Pacific and the southern Indian Ocean in both epochs. However, a significant difference between the two epochs is clearly found over the western Pacific, especially over the Philippine Sea. The GPI over the western Pacific in 1994-2008 is larger. This is consistent with the fact that more TCs originate over the Philippine Sea (Fig. 9) . We also examined the contribution of each GPI term to the interdecadal change between the two epochs, and found that the primary contributor is 3) the maximum potential intensity, and the secondary contributor is 2) the relative humidity at 600 hPa (figure not shown). This is associated with interdecadal change of the SST, which means that the SST over the western Pacific is warmer in 1994-2008 than 1979-93 (Fig. 11, lower panels) . Interestingly, the warm pool area-the epochal mean SST exceeding 288C in 1979-93-with the SST warming during the two epochs is consistent with the area with the GPI increasing. In addition, the enhancement of the ISV during [1994] [1995] [1996] [1997] [1998] [1999] [2000] [2001] [2002] [2003] [2004] [2005] [2006] [2007] [2008] (Fig. 9) can also accelerate the tropical cyclone genesis (Mao and Wu 2008; Kikuchi et al. 2009 ).\nIn short, no significant interdecadal difference in the convective instability prior to the onset can be found over the SCS, but the following two factors show significant interdecadal difference: 1) the enhanced intraseasonal variability and 2) increased frequency of the tropical cyclones passing through the SCS and Philippine Sea during the second epoch. These provide major triggers for the earlier monsoon onset in 1994-2008."}, {"section_title": "Summary and discussions", "text": "In this study, we found a significant and abrupt interdecadal change in the onset of the South China Sea summer monsoon (SCSSM) onset around 1993/94 (Figs. 1-3) . The climatological mean onset date during 1979-93 appears FIG. 9 . Tropical cyclone tracks that passed through the SCS and/or the Philippine Sea (108-208N, 1058-1308E) in 15 Apr-15 May during (a) 1979-93 and (b) 1994-2008. around 30 May, whereas that during 1994-2008 occurs around 14 May. This 2-week shift of the SCSSM onset date is consistent with the decreased monthly mean OLR in May, although negative (but less significant) OLR anomalies are also seen in April (Fig. 11, upper  panels) . The mean SCSSM onset processes between the two epochs, 1979-93 and 1994-2008 , are also different. The relatively late onset during 1979-93 is primarily associated with the northward seasonal march of the ITCZ, whereas the advanced onset during 1994-2008 is affected by enhanced northwestward-moving tropical disturbances from the equatorial western Pacific. In other words, the most prominent difference in the SCSSM onset process is the direction of active convection coming into the SCS.\nThe possible factors for the interdecadal change of the SCSSM onset were also identified. During 1994 During -2008 The enhanced ISV activity and tropical cyclone genesis are possibly affected by the sea surface warming over the western Pacific. The SST changes over the western Pacific and along the southeast coast of China are quite significant both in April and May, although significant interdecadal change of the convection anomalies is found robustly over the SCS and Philippine Sea only in May (Fig. 11) .\nThe interdecadal change of the GPI is also consistent with the sea surface warming over the warm pool region, especially along the 288C line. Because the convective activity with strong rainfall is normally enhanced over the area with SST exceeding 288C, the sea surface warming over the warm pool region can increase the atmospheric instability and the potential for tropical cyclone genesis. Meanwhile, the spatial pattern of the SST changes from the 1980s to the 2000s is similar to the horseshoeshaped SST warming during La Niñ a events. In theory, the warm anomaly may induce a low-pressure anomaly to the west of the warming itself due to the excitation of ascending Rossby waves. This low-pressure anomaly connects to the low-level convergence, which possibly enhances the two types of the ISV activities as well as synoptic disturbances. In fact, Goh and Chan (2010) pointed out that the SST anomalies in a La Niñ a event can make a favorable condition for the tropical cyclones moving into the SCS. The low-pressure anomaly also produces the effects of the weakening of the WNP subtropical high. Thus, the interdecadal change of the SST warming can advance the SCSSM onset. The interdecadal change of the SCSSM onset corresponds to the seasonal evolution change in the early summer season-May and June ( Fig. 1 and Fig. 2 ). The convective activity over the SCS is suppressed in June during 1994-2008, while that over the southern part of China is enhanced in June (figure not shown). Several previous studies noted the increase of the boreal summer (June-August) mean rainfall over southern China from the 1980s to the 2000s (Ding et al. 2008; Li et al. 2010) . It is suggested that the interdecadal change of the SCSSM in June, which is induced by its onset change, can affect boreal summer mean rainfall variation. also showed westerly wind anomalies during boreal spring (March-May) as an interdecadal change after 1993 (their Fig. 10 ). This may also be affected by the large anomalies in May due to the earlier SCSSM onset. Thus, the interdecadal change of the SCSSM onset can impact the boreal spring and summer mean field over the western North Pacific monsoon and the East Asian monsoon.\nWe found an interdecadal change of the SCSSM onset timing around 1993/94 and suggested the possible factors in this study. However, several interesting questions still remain, such as the detailed processes of the impact of tropical cyclone activity on the monsoon onset. The performance of the state-of-the-art model to simulate this interdecadal change is also of great interest. A deeper understanding of the mechanism of this interdecadal change calls for further studies. Renguang Wu, the editor of the Journal of Climate, and anonymous reviewers for their useful comments. Special thanks are due to Dr. Kazuyoshi Kikuchi in IPRC for technical help with the GPI dataset and lots of useful comments. The authors also would like to thank Prof. Tetsuzo Yasunari in HyARC, Nagoya University for helpful comments. The authors acknowledge support from the International Pacific Research Center. This work is supported by the Global Environment Research Fund of the Ministry of the Environment, Japan (A0902). The second author acknowledges support from National Science Foundation Award AGS-1005599 and APEC Climate Center through an international project (Climate Prediction and its Application to Society)."}]