[{"section_title": "Abstract", "text": "Abstract\nThis article is extracted from the philological-codicological research on the Mushaf Al-Qur' an (codex or \nThe Guarantee of preservation of the Qur'an has in fact been mentioned explicitly by the Allah Almighty: \"Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian. \" (Q.S. 15:9). However, by no means, the efforts of preserving the Qur'an were not done by Muslims. Since the early days of Islamic Development, preservation of the Quran has become a tradition carried out by Prophet Muhammad and the Muslims in the early days of Islam. Writing mushaf Al-Qur' an has become an inseparable part of the efforts in the preservation of the Qur'an by Muslims. The tradition [ 250 ] AL-ALBAB Volume 3 Number 2 December 2014 of maintaining the Qur'an has been performed by Prophet Muhammad and his companions since the early development of Islam. The Messenger of Allah always repeated his recitation of the Qur'an every year with the guidance of the Archangel Gabriel. In addition, the Prophet also appointed several companions to be the katib al-wahyi (writer of revelation), such as Abdullah ibn Tasbit. The reading of the Qur'an over and over again has resulted in the qurra' (memorizer of the Qur'an), while the writing of the Qur'an was done on wooden barks, stone slabs and animal skins has resulted in artifacts that have been collected and written or copied back into the mushaf.\nThe two types of tradition of the Qur'an preservation developed from generation to generation through the dimensions of space and time. Nevertheless, the development of a tradition of writing the Qur'an includes special restrictions for people allowed to rewrite it and restrictions regarding the writing style that serves as a common reference. In the context of Indonesia, the tradition of re-writing or copying the mushaf al-Qur' an has been in practice for a long time and done in various regions across the country. "}, {"section_title": "INTRODUCTION", "text": "The Guarantee of preservation of the Qur'an has in fact been mentioned explicitly by the Allah Almighty: \"Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian. \" (Q.S. 15:9). However, by no means, the efforts of preserving the Qur'an were not done by Muslims. Since the early days of Islamic Development, preservation of the Quran has become a tradition carried out by Prophet Muhammad and the Muslims in the early days of Islam. Writing mushaf Al-Qur' an has become an inseparable part of the efforts in the preservation of the Qur'an by Muslims. The tradition Meanwhile, the research on classical manuscripts in the city of Pontianak (Faizal Amin, 2011) found as many as 15 manuscripts of mushaf Al-Qur' an from the collection of Abdurrahman Husin Fallugah al-Maghfurlahu (hereafter referred to as AHF). The fifteenth mushaf Al-Qur›an manuscripts from the collection of AHF have recently been recorded in the inventory data in conjunction with the findings of other classic texts. In addition, to date there has been no research that is specifically conducted on the mushaf manuscripts from the collection of AHF. Nevertheless, this study was not the first because in 2005 there was a similar research in West Kalimantan conducted by Muhammad Shohib, sponsored by the Research and Development Center of the Ministry of Religious Affairs. The study was conducted in three locations, namely the city of Pontianak, Mempawah Distsrict, Sambas District, and then found thirteen mushaf Al Qur' an. The the thirteen mushaf are kept separately by individuals as many as 3 manuscripts, the Regional Office of the Ministry of Religious Affairs 2 manuscripts, the Kadariah Palace Pontianak 3 manu-scripts, the State Museum Pontianak 4 manuscripts, and the Islamic boarding school 1 manuscript (Fadhal AR. Bafadhal dan Rosehan Anwar, 2005 : 169-196) . Therefore, an analysis on the 15 mushaf al-Qur' an from collection AHF is relevant to complement the historical data of the mushaf al-Qur' an writing in West Kalimantan.\nIn the context of Indonesia, the effort of research on the mushaf al-Qur' an has actually been carried out by the Research and Development Center of the Ministry of Religious Affairs in [2003] [2004] [2005] . The research on the mushaf themed \"the History of Mushaf Al-Qur' an in Indonesia\" was carried out in 18 provinces and have successfully inventoried 241 mushaf. There were five research findings from the study of 241 mushaf , namely: (1) first, the condition of the manuscripts of the Qur'an that are found is generally poorly-preserved, so much of the paper of the manuscript was already damaged and eaten by termites and very difficult to read. (2) only a small portion of the manuscripts found are written with the Rasm Utsmani. The rest are written with imla'i Rasm. (3) all manuscripts contained errors and deficiency in writing the text of the verses, but there is a direct repair effort by adding a sentence on the outer edge of the pages of the text, or in between the lines, but some has yet to be fixed. (4) the calligraphy used in the manuscripts of the mushaf is simple, but all of the script is fairly consistent, as seen from the font size, density, as well as the style. (5) the illumination on the mushaf found is generally on the Ulumul Qur' an, Nisful Qur' an and Khatmul Quran, on the heading of the surah ('unwan), and on the edges of the page, especially for signs of Juz, Nisf, Hizb, Mid Hizb and so on.\nBased on the findings of research on mushaf done by the Research and Development Center of the Ministry of Religious Affairs in 2003-2005, the oldest was written in 1585 AD from Ambon. The16th century was the early development of the mushaf writing in Indonesia. Islamic scholars (ulama) in various other places in Indonesia probably also did the same, because the texts of ancient Qur'an are also found on other islands; Java, Nusa Tenggara, Sumatra, Kalimantan and Sulawesi as the data above shows.\nResearch on mushaf conducted by the Research and Development Center of the Ministry of Religious Affairs indicated that the writing of the mushaf Al Qur' an in Indonesia has begun since four centuries ago. The oldest mushaf is thought to be written by a cleric of al-faqih al-Salih 'Abdul Baqi Afifudin ibn ‹Abdullah al-›Adni, in 1585 AD in Wapanwe, Kaitetu, and by a person named Nur Cahya (1590 AD) who completed the writing of the mushaf in the mountain of Wawane, Ambon. The 16th century was the early development of the mushaf writing in Indonesia. Some an-cient manuscripts of the Qur'an are also found in Java, Sumatra, Sulawesi, Kalimantan, West Nusa Tenggara, Bali and so on. Until now there has not been a monograph book describing the history of the mushaf writing from time to time. Similarly, little is known about the writers and places where the mushaf were written. Specifically, this paper will be limited to a discussion about the two main issues, i.e. the: first, physical description of the 15 manuscripts of the mushaf Al Qur' an from the collection of AHF in Pontianak, which includes physical condition, material they were made of, the completeness of the writing, and the time of the making; second, the origin of the 15 manuscripts of the mushaf Al Qur' an from the collection of AHF in Pontianak, which includes the writers, initiators and supporters of the writing the mushaf in West Kalimantan."}, {"section_title": "ABDURRAHMAN HUSIN FALLUGAH AND WEST KALIMANTAN MANUSCRIPT", "text": "Born in the city of Pontianak on February 5, 1966 AD or on Saturday the 14 th day of Syawal 1385 AH, AHF was a descendant of the Arabs who originated from the region of Hadramaut. His father was Husin ibn Salim ibn Ahmad, while his mother was Jamilah bint Ahmad ibn Ali Saewad. If traced to his family lineage, hence the name AHM was Abdurrahman ibn Husin ibn Salim ibn Ahmad ibn Salim ibn Ahmad ibn Muhammad ibn Umar ibn Fallugah. AHF had five siblings, but one of them died in infancy. AHF was married to a woman named Anita Ahmad Ali Attamimy and had five children named: Sirkafi, Fizraivi, Devwirvi, Laza Delvi, Zad Syarafi. AHF died in 2010 in Pontianak at the age of 46. His remains were buried in the Kampung Arab in the Mambausshafa boarding school complex he built.\nHis father died when he was nine years old. Based on his father's will, AHF traveled to East Java to study YAPI Boarding School in Bangil, Pasuruan. In 1983, after six years of studying there, he won a scholarship to continue his studies in Syria. However, his departure to Syria was canceled due to the unrest in the border area of the country. Finally, AHF decided to return home to Pontianak. In the same year, AHF continued learning from some leading scholars in West Kalimantan. Al-Habib Ibn Saalih AlHaddad, Shaikh Abdurrani Mahmud and Ustadz Thoyyib Saman alMaghfurlahum were among the great scholars in the city of Pontianak from whom AHF learnt Islam. AHF also had a chance to learn from Sheikh Ramadan and together they established Khulafaurrasyidin Boarding School.\nSince he was young, AHF was one of the people who paid attention to and loved to collect classic manuscripts. According to his wife, Anita Ahmad Ali Attamimy (interviewed June 2012), he had spent a lot of money to get the classic texts that he was interested in. AHF had traveled from the regions of Aceh on the island of Sumatra to Java to hunt for classic manuscripts. Similarly, he did the same thing to trace the whereabouts of the manuscripts in Kalimantan region, especially in West Kalimantan.\nIn addition to hunting for classic manuscripts, AHF also often gained the trust of the community to preserve manuscript collection. With the charisma as a da›i (Islamic preacher) and his background, AHF often received gifts in the form of classic texts or manuscripts from people or members of the majlis ta'lim (gathering for the study of Islam). In general, they voluntarily handed over a collection of classic texts belonging to their family to AHF because they believed he could make the texts more useful to Muslims. It is also because their generation could no longer understand texts written in Arabic or Malay with Jawi or Arabic script. They also believed that by handing over the classical manuscripts to AHF, the text will be well preserved. In addition, the physical form of the classic texts were generally made of \"low quality paper» which will only make their home look dirty, but if discarded they believe it will bring bad luck, natural disasters or misfortune for themselves or family members who have inherited it. This is another reason why AHF had a large collection of classic texts or manuscripts."}, {"section_title": "DESCRIPTION OF THE MUSHAF FROM THE COLLECTION OF AHF", "text": "The description of the codicological data of the mushaf manuscripts from the collection of AHF is based on the results of observation of softcopy version in the form of digital photographs that I obtained. Several notes on a copy of the manuscript made by AHF on a piece of paper were also used to add information in the colophon. In addition, I also used information from interviews with Anita Ahmad Attamimy, the wife of AHF. Due to limited space for describing the entire codicological data, Table 1 "}, {"section_title": "PHYSICAL STATE OF THE QUR'AN MANUSCRIPT OF AHF", "text": "Linguistically, the word mushaf (plural masa hif) is synonymous with 'book' . Terminologically, in daily definition, the word mushaf usually understood as the Holy Book of Muslims. So al-mushaf al-syarif means the Glorious Qur›an. A Mushaf is a copy of God›s revelation (Qur›an) in the form of written sheets of paper. In fact, a mushaf can be in the form of sheets that are incomplete due to missing or corrupted. The definition of mushaf also includes additional notes in a one-page form that deals with the main verse recitation of the Qur'an. Nevertheless, the tafsir book is not included in the notion of mushaf. Thus, the definition of mushaf in this research is a copy of the Qur›an as a whole, which includes the text of verses (nas), illumination (decoration around the text) and other physical aspects such as the paper, size of the paper, binding, etc.\nAll the mushaf manuscripts examined in this research belong to the late AHF. Overall, there were 21 copies. There were 15 copies of the mushaf written in full 30 juz, while 6 others were incomplete. When preliminary research was conducted in October 2011-June 2012, all manuscripts had yet to be recorded, and nor had they been digitized. However in September 2012, when I was attending the training of the Philological Research Method Short Course in Jakarta for three months (July -September 2012), all mushaf al Qur' an from the collection of AHF had been photographed digitally by Mr. Zarkasyi, an employee at the Lajnah Pentashih al-Quran under the Research and Development Agency of the Ministry of Religious Affairs. This then resulted in the constraints on the continuation of the process of collecting research data because the entire collection of manuscripts of AHF could only be accessed through one person related to the family members and appointed with specific requirements. Since then I could no longer access the manuscripts of mushaf Al Qur' an from the collection of AHF directly. I lost the opportunity to do direct observation of the manuscripts. I only received digital photographic data so that a large part of the data collected was obtained through digital photography only.\nUntil to this research was carried out, all hard copy manuscripts of the collection of AHF were located at the home of Anita Ahmad Ali Attamimy, the wife of the late AHF. Meanwhile all soft copies of the digital photographs kept by two persons in two places, i.e. Mr. Zarkasyi in Bait al-Qur' an Museum in Jakarta and Mr. Arief Rachman in Pontianak. Mr Zarkasyi re-coded all the manuscripts of the mushaf al Qur' an owned byAHF with ARF-01through ARF-21. However in my opinion, the code ' ARF' is not suitable since it does not correspond to the initials of the name of the AHF and could give rise to misunderstandings about the actual owner of the manuscripts. ' ARF' is closer to the initial \"Arief Rachman\" as compared to \"Abdurrahman Husin Fallugah\" or \"Abdurrahman Fallugah\". Therefore, I chose to use the code AHF to record and describe the physical condition of the manuscripts in this research.\nOverall, the physical state of 15 texts from the collection of AHF is still quite good and complete. Thread and glue were used in the binding process with cover made of animal skin and blackish-brown colored paper. Of the 15 copies of the mushaf, one of them presumably does not belong to AHF. According to Anita Ahmad Attamimy, AHF's wife, the fifteenth mushaf Al Qur' an manuscripts were borrowed by a Singaporean. All the mushaf were taken tohis country to be photographed digitally. However, it turns out there was one mushaf returned to Anita that does not belong to AHF. Therefore the manuscript was stored separately by Anita Ahmad Attamimy because it would be exchanged by the Singaporean who took hold of the mushaf belonging to AHF.\nThe average size of the mushaf is 32 x 24 cm, while the size of the text in average 19 x 12 cm. the manuscripts in average have 618 pages with several blank pages; some even have10 blank pages without any script like AHF-01. The average number of lines is15 per page, except on three manuscripts coded AHF-12 AHF-13, and AHF-14 where there are 13 lines per page. On the illuminated pages of the Qur'an, the number of lines is between 6 to 7 lines per page.\nThe manuscript materials can be classified into three kinds, namely local paper, European paper and animal skin. The local paper material consists of some sort of degree of smoothness and gradation. The researcher has not conducted laboratory test specifically to determine the type and age of paper used. The European paper material can be identified from the watermark and countermark that can be seen if the sheet of paper is seen through. For example, the mushaf Al Qur' an coded AHF-09 uses paper type of Pro-Patria with a code 'DCC' .\nThe complete data for new research can present two pieces of codicological description of the 21 manuscripts of mushaf Al Qur›an from the collection of AHF. It was due to my limitation as a researcher to get the whole data of the digital softcopy made by Zarkasy, an employee of the Lajnah Pentashih al-Quran under the Research and Development Agency of the Ministry of Religious Affairs. I was not allowed by the family of AHF to examine the physical manuscripts directly. Therefore, I chose two pieces of manuscripts to the best of my ability. The two mushaf Al Qur›an were the ones codes AHF-01 and AHF-09.\nThe second selection was based on several considerations. First, the information on the colophon mentions that the author or the copyist of the mushaf is a person from Sambas and it was written in Sambas. Therefore an attempt to describe the existence of \"the mushaf al-Qur' an Manuscripts of West Kalimantan\" in this research can be carried out despite obstacles mentioned earlier. Second, the page display of the manuscripts, especially on the illuminated parts, both mushaf have similarities. Third, although both of these manuscripts have similarities to each other, they also have striking differences. The AHF-01 has a lot of marginalia, both containing notes about passages written at the time of copying or writing or other explanations related to a verse or surah in the Qur›an.\nIn addition to both manuscripts, I could not get data about the exixtence of watermark or countermark on the paper, thick lines and thin lines, thick line distance, number of thin lines, total number of sheets, folded sheets, number of pages, size of paper, and size of the text in the manuscript as I did before all pages were photographed digitized. This has caused the description of the codicology of the manuscripts from the collection of AHF to be incomplete, especially for the purpose of providing data for making a catalog. Fourteen out of fifteen manuscripts I gathered have colophons on the last pages before the back cover. One manuscript that does not have a colophon the one coded AHF-05. The information found in it generally only mentions the name of the copyist and time or year of completion. There are two manuscripts that mention the origin and place where the texts were copied from. The colophon in the mushaf coded AHF-01 says that the manuscript was copied in Sambas on Saturday the 2nd day of Muharram 1083 AH or on Saturday April 30, 1672 AD. The manuscript was written by H. Al-Haafiz Muhammad Anwar asSambasy. Meanwhile the colophon in the mushaf Al Qur›an coded AHF-08 mentions that the manuscript was completed in Sambas by Haji al-Haafiz AlAsh'ari on 2nd day of Safar 1072 AH or on Tuesday 27th September 1661 AD. On each page there are text frames in the form of thick and thin lines. The thick line is on the outer side made of three thin lines combined with the red color to the outer edge and two black lines. The thin lines are made with black color and spaced in such a way to form a frame and with pale yellow color. All the mushaf manuscripts in the PNRI catalogare entitled al-Qur'an or AlQur'an al-Karim. The manuscripts under this title 65 pieces, namely A.46, A.47, A.48, A.49, A.50, A.51a-e, A.52a-k, A.53a-k, A.54a-e, A.205, A.214, A.221, A.265, A.269, A.270, A.271, A.272, A.568a, A.575, A.584, A.600, A.613, A.616, A.618, A.619, A.628, A.630, A.632, A.633, A.635, A.641, A.642, A.645, A.646, A.647, A.648, A.650, A.663, A.680, A.694, A.700, A.733, A.734, A.735 However, some of them turns out to be not the mushaf. The manuscript ML.41 is a translation of the Qur'an without verse texts. While the ML.116 is a translation or concise interpretation of the Qur'an; the verse texts are written in red, while the translation is written in black ink, written continuously, one after another. As for the manuscript ML.290, it is not the Qur'an, but the book of Sihahal Jauhary.\nExplicitly, I did not find a single title of the 15 manuscripts of the mushaf Al Qur›an from the collection of AHF. Based on its content, I gave the name of the Al-Quran Al-Karim. The texts in the 15 mushaf from the collection of AHF were written or copied in full, comprising 30 juz and 114 surah. There are a number of texts which even are equipped with a prayer text written on the final page after surah al-Nas.\nMeanwhile in the PNRI catalog, the mushaf Al Qur›an which was given the title of Al-Quran and Al-Qur›an al-Karim are not sorted, among which some have 30 juz in full, some have only have a few surah. However, a description of the existing number of pages will be useful for researchers as they can predict whether a manuscript is complete with 30 juz or not. A complete mushaf usually contains about 450 pages or more. The mushaf under the title Al-Qur›an that have pages fewer than this amount can be quickly judged as incomplete. For example, manuscripts of the Qur'an coded AW (Abdurrahman Wahid), totaling 12 manuscripts, all of which use paper made from bark. Manuscripts that seem to originate from the pesantren quoted from the Qur'an, generally in the first part only have about 200 pages or fewer. So is the case with other 27 manuscripts, they simply contain text passages of the Qur'an which are less than 30 juz/114 surah.\nMore detailed information -as suggested by T.E. Behrend in the preface of his book-found in the two catalogs of special old Arabic manuscripts. The two catalogs contain a more detailed description of the Arabic-language , including the manuscript of the Qur'an. Manuscripts of the Qur'an in the catalog of van den Berg published in «Pars Altera», the second part of this catalog was written by van den Berg himself, i.e. the manuscripts A.46, A.47, A.48, A.49, A.50, A.51a-e, A.52a-k, A.53a-k, A.54a-e. In his classification, van den Berg put the Qur'an on the first order amongst the branches of science, such as tafsir, Hadith, history, mysticism, theology, and law.\nIn van Ronkel catalog, which in terms of data of collection is a continuation of the catalog made by van den Berg, the manuscripts related to Al-Quran (all 71 manuscripts) are sub-classified into five categories, namely (1) Qur'an 30 juz in full [8 manuscripts]; (2) the passages of Surah [27 manuscripts]; (3) the Qur'an accompanied by translation [2 manuscripts]; (4) tajwid [9 manuscripts]; and (5) tafsir AlQur' an [25 manuscripts] . This catalog can quickly help researchers who deal with the study of the Qur›an, because the classification and the description are quite clear. Van Ronkel put classification related to the Qur'an at the first order amongst the classification of other science branches i.e. Hadith, theology, law, history and biography, a variety of sciences, philology, poetry, and stories.\nOne thing that is important but not found in the mushaf manuscript collection of AHF is verse number and page number of the mushaf. If you don't have good memory, then there is no other way to find a verse in the mushaf except by counting the sequence from the first verse. The only sign that is used to distinguish one paragraph with the next is a sign of a yellow or gold circle, or a plain circle at the end of each sentence. In the meantime, to distinguish one page with the other, it can be seen by looking at the previous paragraph or sentence connection. The other easy way is to look at the translation, but not all manuscripts have this feature. If ever the translation is found in a manuscript, then usually not all pages have them.\nThe absence paragraph numbering and page numbering on the mushaf is very common and it also occurs in manuscripts of Al-Quran mushaf from other provinces in Indonesia. The tradition of numbering the paragraphs and pages in the mushaf Al Qur' an in Indonesia probably began at the beginning of the 20 th century (Ali Akbar, 2005: 105) .\nAnother interesting thing found in the mushaf of AHF collection is the marginalia, i.e. special note made by the copyist of mushaf. The text in the note was written on the margin, the bottom, right-hand and left-hand margin.\nThe note sometimes describes a range of qira' at and Hadith or story around the fadilah or the virtue of reading a verse or surah in the Qur›an. In addition, marginalia are also used to record the missing passages in the manuscript page. This is a regular phenomenon in the tradition of writing/copying mushaf AlQur›an in Indonesia. According to the results of the research on the mushaf of the Qur'an conducted by Research and Development Center of the Ministry of Religious Affairs in [2003] [2004] [2005] , that all manuscripts contained errors in writing the text paragraphs. The errors indicate that the writing of the text paragraphs of the mushaf was not through a process of pentashihan. These errors were corrected directly by adding words at the outer edge of the page of text, or in between the lines, and some were not fixed.\nMarginalia notes are also commonly used to signify variation on reading the Qur'an. As we know, the Qur'an can be recited using a number of different methods. Generally, in Indonesia, people use the Qira' at Hafs for reading. There are several other types which are also known in the Islamic world, for example Qira ' at Warasiy, Qira' at Qunbul, Qira' at Nafi', Qira' at Qalun, and so on. If seen from the aspect of recitation, the mushaf manuscripts from the collection of AHF are written by using Qira' at Hafs. The word ‫‪is‬ملك‬ written as ‫مالك‬ intended for ishbat alif after mim; the word ‫اط‬ ‫صر‬ is pronounced ‫ص‬ (sad); the word ‫عليهم‬ with kasrah on ha' and sukun on mim jama'; the word ‫هدى‬ ‫'‪ha‬فيه‬ kinayah is provided with regular harakat kasrah anf not pronounced with silah; the word ‫يؤمنون‬hamzah mufrad is provided with sukun meaning it should be pronounced tahqiq; and the word ‫ا‬ ‫كفو‬ after fa' comes waw while other than hafs variation, it is written ‫ا‬ ‫كفؤ‬ written with a hamzah."}, {"section_title": "ORIGIN OF THE COLLECTION OF AHF'S MUSHAF", "text": "There is no authentic written data that explains the origin of all the mushaf from the collection of AHF. The interviews with Anita Ahmad Ali Attamimy (June 2012), the wife of AHF provided information that during his lifetime, AHF was fond of collecting classic texts. With the charisma and the background of his leadership, AHF frequently received gifts in the form of a number of classic texts from community members or members of his majlis ta›lim. In addition, AHF also traveled from Aceh of Sumatra to Java to hunt for manuscripts. According to Ms. Anita Ahmad Ali Attamimy, AHF also often purchased old manuscripts for his own collection. In addition, AHF also did some maintenance to and made notes on the mushaf. However, his work could not be completed as he died in 2010.\nEven though the 15 manuscripts that I found, all have colophons and/ or notes made by AHF, due to the limitation of the existing data sources, I could not get information about the initiators and supporters of the copying process. However, it can be assumed that there was close link between the author of the mushaf and the ruling sultanate. The sultans were thought to advocate the copying of the mushaf al-Qur' an, in addition to Islamic scholars, students, and proponents of the Islamic religion in the past. It is based on the findings of a large number of mushaf written in the past, and most of which were in the possession of the family of the sultanate.\nWhat's interesting is that there is one mushaf coded AHF-07 whose colophon mentions that it was jointly written by Sheikh Abdul Manan and his students. It is also the case with the illumination and rubrication. I assume that the picture ornament on the mushaf must have been made by an illuminator separately and not by the author or the copyist. It can also be seen from the blank pages commonly found in the section before and/or after pictures of the illumination."}, {"section_title": "CONCLUSION", "text": "Based on the description of data on 15 manuscropts of mushaf Al Qur›an from the collection of AHF, in this section I would like to present the findings to answer the research questions. First, to answer the questions about the physical description of 15 manuscripts of mushaf collection of AHF in Pontianak, it can be described that in general the condition quite well preserved. There are several manuscripts that have suffered damage, for example, lost sheets at the beginning and at the end parts of the manuscript, some of the paper is torn and the ink has already faded, the binding is no longer is good state, and other damages resulting from a lack of care. There are 6 manuscripts in the collection that were not included in this study that have suffered serious damage, including missing pages and the text verses no longer intact.\nIn fact there appears to be an effort of the owner or the heirs to take care of the mushaf such as using paper patch or overlay the torn page with transparent plastic tape. However, due to the possible lack of technical knowledge about the care or preservation of the manuscript, the attempt to fix the damage only caused further damage to the manuscript. What's interesting is there is an effort made by AHF to inventory his collection by making a note on a piece of paper inserted in the musahf manuscript of the Qur'an. Nevertheless, the data need to be re-examined because the paper sheet belonging to one manuscript might sometimes be inserted into another.\nIf seen from material used, the mushaf manuscript collection of AHF were made of paper and animal skins. These materials were derived from the local paper and some from Europe. With regard to the completeness of the manuscript collection of AHF, 15 of them are complete manuscripts consisting of 30 juz covering 114 surah, while 6 of them -which were not included in this study-were incomplete. Second, to answer the question about the origin of the 15 manuscripts of the mushaf collection of AHF in Pontianak, it can be concluded that there is a manuscript that originated from West Kalimantan. The description found on the colophon written in Jawi script of Malay clearly mentions that the manuscript was written in Sambas by a person (persons) originating from the region of Sambas, one of the Districts in the northern part of the coastal area of West Kalimantan. Meanwhile, the colophon on some other texts also mentions that its author carried al-Qadry name, but it was uncertain if it was written by a person from Pontianak. This is because there is a manuscript that originated from outside West Kalimantan, i.e. Aceh which is described in the Arabic text of the colophon. There is also a script of colophon written in the Pegon character of the Javanese language which is presumed to have come from Central Java. Among the writers/copyists, there was a person who originated from West Kalimantan.\nWith regard to the initiators and supporters of the writing or copying of the mushaf manuscripts in West Kalimantan, I shared the ideas of Muhammad Shohib (2005: 193) who argued they were the nobles of the Kingdom because as individual collections, many of the mushaf in West Kalimantan are found among the royal family. This phenomenon is interesting because West Kalimantan had a number of Islamic kingdoms in the form of Sultanates that accomplished a lot of achievements but have yet to be revealed by history."}]