[{"section_title": "Abstract", "text": "A number ofpublic school districts in the United"}, {"section_title": "Introduction", "text": "In the 50 years since the Brown v. Board of Education' decision, public school racial desegregation efforts have been a prominent feature of many urban school districts in the United States. However, the use of race-conscious school assignment policies has become more controversial over the last decade. Both mandatory and voluntary school desegregation plans have been increasinglyand, in some cases, successfully--challenged in the courts and in public debate. As a result, many school districts have been seeking \"race-neutral\" methods to maintain some racial diversity in their schools.\nGiven the uncertainty of the future legal status of race-conscious school assignment policies, researchers and educational policymakers This research was supported by a Spencer Foundation/National Academy of Education Postdoctoral Fellowship and a grant from the NCES/AERA Research Program to the first author. We thank Claudia Galindo for research assistance and four anonymous reviewers for their excellent suggestions. All errors remain our responsibility.\nare looking more closely at race-neutral school assignment mechanisms-such as socioeconomic integration-for achieving the historical goals of race-based school desegregation: equalizing educational opportunity and avoiding racial isolation. Socioeconomic integration plans are attractive for several reasons. First, there is wide consensus among researchers that concentrated poverty influences future educational attainment, potential earnings, and societal liabilities such as welfare dependency. In addition, because race and class overlap so closely, some contend that mixing students by economic status will also produce acceptable levels of racial integration (Chaplin, 2002; Kahlenberg, 2001) . However, it is not clear how much racial desegregation can be attained using solely income-based school assignment policies; nor is it clear how contingent racial integration may be on the specifics of such income-based policies. Previous work on this question has been limited, offering some useful benchmarks for potential impacts of incomebased integration on racial integration across larger geographic units, such as counties and metropolitan areas (Chaplin, 2002) , and providing infonnative case studies of specific districts undergoing changes in student assignment policies (Flinspach & Banks, 2005) .\nIn this article, we build on this work by investigating the extent to which race-neutral incomebased integration plans would produce ancillary racial integration, particularly in large urban school districts, where racial segregation tends to be high. We compute upper and lower bounds on the possible and probable levels of racial segregation that might result from several types of income-integration policies. We find that the range of possible racial segregation consistent with income integration is quite wide, and depends largely on the size of racial income disparities within a given district and on the operational definition of income integration embodied in a given plan. Specifically, income-integration plans that use continuous or quasi-continuous measures of socioeconomic status (such as actual income) and require strict income balance across schools ensure higher levels of racial integration than do plans that rely on dichotomous income measures (such as poverty status or free and reduced-price lunch eligibility) or that require only approximate income balance among schools. In general, given current levels of racial income 50 disparities in the United States and practical constraints on income integration plans, we find that income integration does not guarantee any reduction in racial school segregation-very high levels of racial segregation are possible under any practical income-integration policy.\nIn addition, we examine patterns of racial and economic segregation (both residential and schooling) in urban areas and conduct simulations to estimate the impact on racial segregation of an income-integration plan. These simulations yield lower bounds on the probable levels of resulting racial segregation which, in conjunction with data on residential racial segregation patterns, suggest little ancillary racial integration would result from income-integration policies, except in districts with already low levels of racial segregation. Taken together, these results indicate that, although income-based integration may be a worthwhile goal in itself, it cannot be assumed that income-based integration plans will necessarily lead to racially desegregated schools.\nIn Section I of this article we discuss the background and rationale for the current interest in economic integration policies, and review prior evidence on their effects on racial segregation. In Section 2, we describe analyses to compute upper and lower bounds on the possible and probable levels of racial segregation under several variants of income integration policies. Section 3 concludes."}, {"section_title": "Background: Why Income-Based School", "text": "Assignment Policies?\nThe move to socioeconomic integration plans has been motivated by both the legal and policy context surrounding school desegregation, as well as by an extensive body of literature on the effects of racial and socioeconomic school composition on educational outcomes. Highprofile legal challenges to school assignment policies that include race-and an increasing reluctance among school boards and other policymakers to use race in school assignment policies-have led many school districts to consider more race-neutral measures in designing student assignment plans. The factor most commonly used as a proxy for race is socioeconomic status, which many argue may have advantages over race-based school desegregation in both the courts and in public opinion (Kahlenberg, 2001 ).\nIn recent years, mandatory (court-ordered) efforts to maintain racial integration at the K-12 level have met increasing resistance from school district officials and from judges who wish to end the courts' longtime federal oversight of school desegregation plans. In addition, voluntary efforts to promote racial balance across schools through race-based school assignment plans have faced opposition from school leaders, policymakers, and the public. Despite recent federal court decisions in Lynn, Massachusetts, and in Seattle, Washington, 2 that have supported the right of districts to implement voluntary desegregation plans for the purposes of integration and for promoting diversity, the legal future of race-conscious student assignment plans is far from certain.\n3 The K-12 implications of the Grutter v. Bollinger 4 Supreme Court decision on the use of race in college admissions are equally uncertain. Although Grutter clearly suggests the state has a compelling interest in promoting racial diversity in educational settings, and that race-conscious policies can be used to do this-so long as they are \"narrowly tailored\" 5 -Grutter's relationship to school desegregation policies has not yet been tested by the Supreme Court.\nWhile the legal questions surrounding the use of race in K-12 voluntary school assignment plans remain unresolved, many school districts are already turning toward socioeconomic school desegregation plans as a viable race-neutral method of school assignment. These include school districts in La Crosse, Wisconsin; Wake County, North Carolina; San Francisco, California; and Cambridge, Massachusetts. Many of these districts are also gaining considerable attention over their unique assignment plans. Recent media reports attribute test score gains in Wake County to socioeconomic integration (Finder, 2005) , although it is not clear that there is sufficient evidence of a causal warrant for this claim.\nThere are several arguments that underlie support for socioeconomically based desegregation plans over race-based plans. Some policymakers and researchers argue that socioeconomic factors are more reliable indicators of student and school performance than race. This implies that achieving socioeconomic integration will benefit students perhaps more than achieving racial integration (Gottlieb, 2002; Rumberger & Palardy, 2002) . In addition, because race and social class are strongly correlated in U.S. society, some con-"}, {"section_title": "Implications of Income-Based School Assignment Policies", "text": "tend that mixing students by economic status will also ensure acceptable levels of racial integration, thus providing students with the benefits of both racial and socioeconomic diversity (Chaplin, 2002; Kahlenberg, 2001) .\nIn the most comprehensive examination of socioeconomic desegregation, Kahlenberg (2001) outlines three main limitations of race-based desegregation efforts. First, he argues, race is becoming more of a legal liability than an advantage, as courts have become more receptive to Fourteenth Amendment challenges to race-based school desegregation policies. Second, he posits that it is social class composition-not racial composition-that determines school quality. And third, Kahlenberg contends that organizing efforts around improving educational opportunities for all is more effective when inclusive of Whites and middle-class parents, specifically, that \"middle-class parents will use their political weight to bring greater equality of resources\" (p. 83). Kahlenberg writes, \"IT]he primary goal of socioeconomic integration is improved educational achievement; economic balance is merely the means to that end\" (p. 111). He does not, however, argue that racial isolation is irrelevant; in fact, he contends that one of the benefits of socioeconomic integration is its capacity to reduce racial isolation.\nThe idea of socioeconomic integration is not new. Since the Coleman report in 1966, considerable research has examined the relationship between socioeconomic status and educational achievement (Coleman et al., 1966) . Such studies consistently find a sizable relationship between school composition and educational achievement and attainment-in other words, in addition to individual family background, a school's socioeconomic context is strongly related to students' educational outcomes (Anyon, 1997; Coleman et al., 1966; Entwisle, Alexander, & Olson, 1997; Mayer. 2002; Natriello, McDill, & Pallas, 1990) . As a result, socioeconomic segregation between schools can contribute to lifelong educational (and economic) inequality.\nAlthough research on the role of race and racial integration has been far less definite in its conclusions, it has nevertheless pointed to some important benefits that can accrue in the desegregated or diverse schooling environment. Some of these benefits are directly connected to the socioeconomic integration rationale. For example, previous studies suggest that part of what has made racial integration policies effective in increasing educational opportunities and in improving student outcomes is the access to the different social networks present in the integrated school or classroom versus segregated minority schools (Wells & Crain, 1994) . In addition, there is evidence from the school desegregation literature that desegregated schooling environments enhance African American students' educational attainment (Boozer, Krueger, Wolkon, Haltiwanger, & Loury, 1992) , and occupational aspirations (Dawkins & Braddock, 1994 ).\nYet, important racial and ethnic diversity benefits exist that are independent of income and that may be lost without some attention to racial composition. In a recent study that disentangles race from socioeconomic effects, Hanushek, Kain, and Rivkin (2002) find that, net of individual and peer socioeconomic background effects, higher Black enrollment has a negative effect on mathematics achievement, and that these effects are stronger for higher-ability Blacks than for lowerability Blacks or for White students. Moreover, these findings persist when controlling for differences in school quality and the achievement of peers in the school and classroom. Rivkin (2000) , however, does not find persistent effects of school racial composition on Blacks' educational attainment or earnings, when controlling for other individual and contextual effects. Racial and ethnic diversity also appears to produce social benefits in domains other than achievement scores and educational attainment. These benefits include the ability to interact with members from racial and ethnic groups different than one's own (Kurlaender & Yun, 2003; Schofield, 1995) , the promotion of cross-racial friendships and peer groups (Hallinan, 1998; Hallinan & Williams, 1989) , and the ability to think more critically about societal and democratic issues (Duncan, Boisjoly, Levy, Kremer, & Eccles, 2003; Gurin, Dey, Hurtado, & Gurin, 2002) . Moreover, there is evidence that racial segregation is self-perpetuating, and that school desegregation can break the cycle of societal racial isolation (Wells & Crain, 1994) . Thus, the social benefits of integrated or diverse schooling environments can accrue not only to minority students, but also their White peers.\nDespite these positive findings, the research on the benefits of racial integration remains contested and empirically unclear, in large part be-52 cause it is difficult to disentangle racial composition effects from other socioeconomic and school quality factors that impact educational processes. That said, enough evidence suggests the positive benefits of racial integration that it is worth examining whether socioeconomic integration necessarily produces racial and ethnic integration.\ngration regime? The answer will depend on several factors: (1) the strength of the association between race and income; (2) the particulars of the policies defining socioeconomic integration (e.g., How is income measured? How much income balance across schools is required? What other socioeconomic factors are considered?); (3) the relationship between racial and income residential segregation in a school district; (4) the factors determining school assignment (e.g., distance to school, transportation costs, parental preferences or choice); and (5) the effect of the income-integration policy on families' decisions whether to move into or out of a school district and whether to enroll their children in public or private schools.\nWe begin by addressing a simpler questionwhat level of racial segregation is possible under a socioeconomic integration regime?-because the answer to this question places upper and lower bounds on the primary question. In addition, our analysis simplifies the issue by focusing on a stylized version of a socioeconomic integration policy that relies solely on income, rather than a broader range of socioeconomic factors, in school assignment. Following this, we use two different strategies to address the question of what level of racial segregation is likely under an income-integration regime, and then discuss the implications of our results for school assignment policies.\nFor the purposes of this article we define perfect income integration (or desegregation) as the condition in which each school in a district has the same income distribution as the district overall. This definition of income desegregation corresponds to the \"evenness\" definition of racial integration (Massey & Denton, 1988) .9 In practice, however, it would be administratively and practically unrealistic for school districts to require all schools to have exactly identical income distributions, both because districts typically do not have access to data on families' exact incomes, and because of the administrative and logistical difficulties of such a school assignment policy. A more practical approach, for example, would be for districts to use data on families' poverty status or free and reduced-price lunch eligibility (rather than exact income data) and to require that all schools have poverty or free and reducedprice lunch eligibility rates that fall within some relatively small range-say, ±10% or ±20% of the overall rate of total district enrollment (as is the case in Cambridge and in La Crosse, for example). In the analyses that follow we consider the implications of both the \"ideal\" (complete income integration) and the more practical (approximate integration) types of income integration.\ncal concerns make attaining perfect income balance across schools impractical. In practice, school districts seeking to achieve income integration are likely to require some approximate level of income integration, typically by requiring that each school have a poverty rate within some (relatively narrow) range of the overall district poverty rate. Given this, we next consider the level of racial segregation possible under a policy that requires only approximate income integration.\nThese analyses quantify the extent of racial segregation that is possible, in principle, under several types of income-desegregation regimes and a range of racial income-distribution patterns. Next we address the issue of what level of racial segregation is probable under such conditions.\n\nmain unchanged (or even increase, though this would be likely only in districts that currently have racial integration policies in place that would be discontinued under an income-integration policy) from current levels in districts that implement income-based integration plans. Moreover, Figure 4 shows that, even at White-Black income ratios much higher than those present in U.S. cities, income-integration policies would not guarantee low levels of racial segregation. In sum, income-integration policies provide little or no guarantee of reductions in racial segregation. Under any practical income-integration regime, high levels of racial segregation are, in principle, possible, unless race and income were far more highly correlated than they are in fact. Nonetheless, the results illustrated in Figure 4 are upper bounds on the level of possible racial segregation; obtaining these levels of segregation would certainly require some level of raceconscious school assignment policy. In the following section, we compute lower bounds on the level of racial segregation that is probable under an income-integration regime."}, {"section_title": "Current Income-Based School Assignment Plans", "text": "The first school district to implement a socioeconomic desegregation plan was La Crosse, Wisconsin, which adopted its plan-based exclusively on students' free lunch eligibility-in 1992. La Crosse is a small, predominately White district. Although the 1990s brought an influx of southeast Asian immigrants, today the school district is about 15% minority (predominantly Hmong and Laotian refugees). Only about 3% of students are Black, Latino, or Native American (Kahlenberg, 2001) . The relative homogeneity of La Crosse's student enrollment makes it difficult to assess whether the socioeconomic-based plan has produced racial desegregation across schools, though a simple survey of the racial composition across schools of similar average socioeconomic status suggests that it has not. For example, in 2002-2003, Asian (the largest minority group) enrollment shares across the district's 11 elementary schools ranged from a low of 5% in some schools to a high of 40% in others. 6 Other school districts are developing more complicated methods for determining students' socioeconomic status and for assigning students to schools. In 1999, Wake County, North Carolina, removed the consideration of race from the district's school assignment plan in favor of a socioeconomic and test-score-based assignment plan. Wake County determines socioeconomic status based on neighborhood characteristics, as opposed to individual characteristics, and has mapped out more than 700 \"neighborhood zones\" to classify students for assignment purposes (Silberman, 2002) . Under this plan, no school may have more than 40% of students from poor neighborhoods (as defined by aggregate neighborhood free and reduced-price lunch eligibility) and no more than 25% of students scoring below grade level on standardized tests (Jones, 2002; Silberman, 2002) . A preliminary evaluation of the policy suggests that adoption of the classbased plan may have initially led to an increase in I racially identifiable schools (those with greater than 45% or less than 15% minority studentsthe guideline used under the previous race-based desegregation plan), but that this increase has stabilized in subsequent years (Flinspach, Banks, & Khanna, 2003) .\nIn San Francisco, which has been under a school desegregation consent decree 7 for 2 decades, the school board several years ago adopted a socioeconomic integration plan based on a \"diversity index.\" The move followed a contentious lawsuit in which a group of parents sued the district for restricting admission of Chinese students into the competitive magnet schools despite higher exam scores. 8 The diversity index used for student assignment includes information on the following: free and reducedprice lunch eligibility; public housing assistance; low achievement as measured by scoring below the 30th percentile on the Stanford 9; limited or non-English proficient; prior school's California Academic Performance Index; home language if other than English; and residence (Flinspach, Banks, & Khanna, 2003; Kahlenberg, 2001) . However, since the diversity index functions as part of a choice system, it only helps to assign students to schools that have more students wanting to attend than the school has seats (Community Advisory Committee on Student Assignment, 2005) . Thus, the index does not address segregation in any schools with vacancies, which include many of the city's most segregated schools. Because the assignment process in effect is relatively new, it is too soon to tell whether it will sustain the racial and ethnic desegregation levels achieved under the former race-based plan, but preliminary descriptive information suggests that it has not. In 1998-1999, the last year of the consent decree, 64% of San Francisco schools were in compliance with the racial desegregation standard of the decree; by 2002-2003, 2 years after the start of the socioeconomic integration plan, only 52% of San Francisco schools were racially integrated, as measured by the same standard (Flinspach, Banks, & Khanna, 2003; O'Keefe, 2005 ).\nAn additional variant of income-based school assignment is used in the Cambridge, Massachusetts, public school district, which began in 2001 to use income in addition to race to determine school assignments (Fiske, 2002) . The new policy does not remove race from consideration in Implications of Income-Based School Assignment Policies school assignments, but reduces its relative importance in assigning students to elementary schools. As with the income-based plans in place in Wake County and San Francisco, it is too soon to tell whether this plan will sustain the racial integration attained under the prior policy, which relied more heavily on race.\nThese plans represent a trend in student assignment toward using socioeconomic factors in place of race (or in place of using race alone) in school assignment policies designed to establish diverse schools. Although the approach and implementation of such plans vary across districts, they share a common emphasis on socioeconomic factors (especially family income and factors related to income, such as free and reduced-price lunch eligibility, neighborhood poverty, and public housing assistance). To date, however, there is little empirical evidence on the implications of such school assignment policies for racial segregation. Our goal in this article is to provide some analysis that will be helpful in determining the implications of such policies, as well as to provide some guidelines that may aid educational policymakers in identifying optimal incomebased policies."}, {"section_title": "Prior Research on the Impact of Economic Integration on Racial Segregation", "text": "Some researchers claim that decreases in socioeconomic segregation will necessarily lead to decreases in racial segregation due to the high correlation between income and race (Chaplin, 2002; Kahlenberg, 2001 ). Chaplin's (2002) study, however, is the only systematic study to test this assertion empirically, and so is worth examining in some detail. Chaplin's study begins by computing the overall racial segregation among all public schools in the United States, and then asks how much this figure would be reduced through raceneutral income-integration policies. Chaplin' s operational definition of income integration requires that no school have more than 50% of students eligible for free or reduced-price lunch. This is a relatively weak income integration requirement, because it would allow some schools to remain poverty-free, while other schools would have as many as 50% poor students.\nChaplin finds, first, that even if all racial segregation within every district were completely eliminated, overall racial school segregation in the United States would be reduced by only 7-11%, depending on which race groups are considered (Chaplin, 2002, Table 2 ). This is because most U.S. school segregation results from betweendistrict differences in the racial composition of student populations rather than from uneven patterns of within-district assignment to schools (Reardon, Yun, & Eitle, 2000) . Next, Chaplin finds that if the minimum number of students were reassigned-without regard to race or transportation distances-within each district to create, where possible, schools with fewer than 50% poor students, then overall racial school segregation would be reduced by only 1-4%, depending on which race groups are considered (Chaplin, 2002, Table 2 ). While this represents a very small fraction of all racial school segregation, it is a nontrivial proportion of the within-district portion of school segregation. Finally, Chaplin asks what would happen to racial integration if income integration were implemented across metropolitan areas, rather than districts. This would involve the transfer of some poor students from districts with poverty rates greater than 50% (where students could be reassigned in such a way that all schools would have poverty rates less than 50%), to schools in other districts with poverty rates below 50% (and corresponding transfers of nonpoor students in the opposite direction). Under this scenario, Chaplin finds that overall racial segregation would be reduced by 5-15%, again depending on the racial group involved (Chaplin, 2002, Table 2 ).\nChaplin's study is informative, but also leaves a number of important questions unanswered. First, the study does not indicate what happens to racial segregation in individual districts. Since income-integration policies are most likely to be enacted at a district level, we (and district officials) would like to know the potential effects of income integration on racial integration within individual districts as well as on national patterns. Chaplin's approach averages over all types of districts-large and small; urban, suburban, and rural; poor and nonpoor, racially diverse and homogeneous-and so is uninformative regarding the local conditions under which incomeintegration policies might produce some ancillary racial segregation.\nSecond, Chaplin's operationalized definition of income integration is both too weak and too strong. It is too weak because, in practice, districts are likely to require somewhat more stringent income integration than the 50% poverty rate maximum (though perhaps not too much more stringent-Wake County, for example, has a 40% maximum enrollment from high-poverty neighborhoods). Thus, Chaplin's method may underestimate the potential impact of income integration on racial segregation. On the other hand, his operational definition is too strong, because interdistrict income-integration policies are unlikely to be widely adopted; thus his within-district results are far more plausible than those that rely on inter-district student assignments. Finally, even Chaplin's within-district estimates certainly overstate the impact of income integration on racial segregation because they depend, as he notes, on the assumption that the reassignment of poor and nonpoor students within a district is random. In practice however, as we discuss below, in large urban and county-wide school districts, transportation distances make it impractical to assume a random reassignment of students among schools; students would likely be reassigned to schools nearer their residence. In a district with substantial racial residential segregation, this will result in students of the same race being disproportionately reassigned to the same schools, resulting in higher levels of racial segregation than Chaplin estimates.\nChaplin's paper is useful, however, in that it sets lower bounds on the levels of overall (national) racial segregation that might result under district-and metropolitan-level incomeintegration plans. These lower bounds are quite high, suggesting little overall racial dividend from income-integration policies. Nonetheless, it may be that income integration produces substantial racial integration in some types of districts or under some types of operationalized policies.\nIn addition to Chaplin's study, a case study of socioeconomic integration in two districts suggests that the impacts of new socioeconomic integration policies may in fact lead to increased racial segregation or, at best, leave it unchanged (Flinspach, Banks, & Khanna, 2003) . Specifically, in San Francisco, preliminary evaluation suggests that the plan has led to an increase in racial and ethnic segregation, while in Wake County the income-integration policy appears to have initially produced a slight increase in racial segregation that has subsequently leveled off. (Flinspach, Banks, & Khanna, 2003) . In several years, trend data from these and other districts will shed more light on these outcome patterns.\nOne additional source of potential evidence on the likely effect of a race-neutral income policy on racial outcomes comes from the research on income-based admissions policies in higher education. Kane (1998) , for example, finds that classbased affirmative action does not provide a reliable substitution for race-conscious admissions policies. His conclusion is based in large part on a relatively simple empirical observation that success in enrolling more Black students using classbased admissions policies depends on the ratio between poor White and Black students in the upper tail of the achievement distribution. Although there are some parallels from this work to the K-12 school integration context, the problem is substantively different. The extension of these findings to socioeconomically based school desegregation policies relies on the overlap between race and class in the middle of the income distribution, not the tails. In addition, there are not a finite number of spots in a school district, so the challenge is how to allocate seats to all students most efficiently. These differences suggest that very different outcomes may be possible in school assignment versus college admissions. A better parallel for Kane's higher education work in K-12 school assignment might be choice or magnet programs that rely on socioeconomic factors to allocate a finite number of spots in desirable schools to students of different racial groups, a situation that is beyond the scope of this article.\nGiven the relatively thin nature of the empirical and analytic evidence regarding the likely effects of income integration on racial segregation, this article investigates the possible effects of income integration in large, diverse school districts-the type of district where racial segregation is generally most pronounced-and investigates the conditions under which such policies might produce substantial ancillary racial benefits. Moreover, we focus solely on within-district income-integration policies, as these are the most practical approach to income integration, Kahlenberg's (laudable) call for interdistrict income-integration policies notwithstanding (Kahlenberg, 2001 )."}, {"section_title": "Determining the Effects of Income Integration on Racial Integration", "text": "What level of racial segregation is likely to occur under a race-neutral socioeconomic inte-"}, {"section_title": "Measures of Segregation", "text": "Throughout this article we limit our analyses to the case of segregation between two groups (e.g., between Black and White students). The extension to the multigroup case is more mathematically complex, but not likely to lead to substantively different conclusions.\n1 0 We measure segregation in this article using an easily interpreted measure of two-group segregation, the normalized exposure index (denoted V). The normalized exposure index measures the gap between the observed exposure level of one group to another and the exposure level that would occur in a situation of perfect integration, where \"exposure\" is defined as the average proportion of the second group in the schools attended by students of the first group. Formally, V between groups m and n is defined as\nwhere 7c, is the proportion of group n in the district and ,P, is the exposure of group m to group n, defined by:\nwhere ] indexes schools, 7uj is the proportion of group n in schoolj, and tmj and Tm are the number of students of group m in schoolj and the district, respectively. The normalized exposure index V has a minimum of 0, obtained if and only if ,Pn = 71n, which can occur only in the case of perfect racial integration-if each school has the same proportions of group n as in the total district enrollment. The index has a maximum of 1, obtained only in the case of complete segregation-when no student of group m attends a school with any students of group n.I This index has been widely used in the racial school segregation literature, under a variety of names (Clotfelter, 1999 (Clotfelter, , 2001 Clotfelter, Ladd, & Vigdor, 2003; Coleman, 56 Hoffer, & Kilgore, 1982 ; see also Farley, 1984; James & Taeuber, 1985; Steams & Logan, 1986 ). We will refer to it here as the normalized exposure index (denoted 1) to suggest its relationship to the exposure index.\nAlthough a number of other measures of segregation are available in the literature (James & Taeuber, 1985; Reardon & Firebaugh, 2002) , we use the normalized exposure index both because it is easily interpreted and because the mathematics of our analysis turn out to be far simpler when we use this index rather than other measures, such as the dissimilarity and information theory indices. As a measure of the evenness of the distribution of two racial groups among schools, V is highly correlated with the dissimilarity index D (r10.96) and with the information theory index H (1-0.98) in school and residential segregation studies (Massey & Denton, 1988; Reardon, 1998; Reardon & Firebaugh, 2002) , and is a more mathematically appropriate index than the more commonly used dissimilarity index (because it responds more appropriately to changes in the distribution of students among schools than does D) (Reardon & Firebaugh, 2002) . Given the almost exact correspondence between V and H, we use the guidelines similar to those given by Reardon and Yun (2001; 2003; to interpret the levels of V. A value of Vabove 0.50 is considered extremely segregated (this corresponds roughly to levels of.D above 0.70, close to what Massey and Denton (1989) require as part of their definition of \"hypersegregation\"). Such a value means that, on average, Black students attend schools with only half the percentage of Whites we would expect given the composition of a school district (and vice versa).1 2"}, {"section_title": "The Range of Racial Segregation Possible Under Income-Integration Regimes", "text": "The range of racial segregation possible under an income-integration regime depends primarily on the strength of the association between race and income. For example, if poverty status were perfectly correlated with race (i.e., if all Blacks were poor, and no Whites were poor), then complete income desegregation would necessarily entail complete racial desegregation-if each school had the same proportion of poor students, each would have the same racial proportions as well. Conversely, if income or poverty status were uncorrelated with race (i.e., if the Black and White income distributions were identical), then complete income desegregation could (in principle) be achieved even while maintaining complete racial segregation-all schools could be monoracial yet have identical income distributions. In the intermediate (and more realistic) case, where income distributions differ by race, but overlap considerably, some racial segregation (but perhaps not complete racial segregation) would be possible even under complete income integration.\nIn addition, the range of racial segregation possible under an income-integration regime will depend on how income desegregation is defined and operationalized. First we consider the (unrealistic) case in which a school district has information on each family's actual household income and where an income-desegregation policy requires all schools to have identical income distributions. This scenario, while unrealistic, yields the lowest possible upper bound on the range of possible racial segregation levels, because it uses complete information on incomes and requires perfect balancing of racial distributions across schools.\nGiven that school districts are unlikely to obtain actual income data from families, we next consider the range of racial segregation levels that are possible if a school district uses a dichotomous measure of income-such as poverty status or free and reduced-price lunch eligibilityin an income-desegregation plan. If the poverty threshold is set at a very low or very high income level, then almost all students will fall into the same income category, and an incomedesegregation policy will put virtually no constraint on school enrollment patterns. In such a case, any level of racial segregation is possible, since the poverty status indicator will be uncorrelated with race. If, however, the poverty threshold is set at some point in the middle of the income distribution, poverty status may be more or less correlated with race (depending on where the poverty threshold is set relative to the racial income distributions), and so income desegregation will necessitate some level of racial desegregation. We show in this article how to determine the location of the optimal poverty thresholdthe threshold that minimizes the maximum possible racial segregation.\nWhen using a dichotomous measure of income such as poverty status, administrative and logisti-"}, {"section_title": "Computing upper and lower bounds on possible racial segregation", "text": "Suppose students are assigned to schools in the following way: first, White students are assigned to schools in such a way that (1) the number of White students in each school is the same; and (2) the White income distribution within each school is the same across all schools. Next, the same procedure is followed for each racial group. Now each school will have the same racial composition and the same income distribution; hence the district will show perfect racial and income integration. Because this procedure is possible regardless of the racial composition or income distribution within a district (see a formal proof in Appendix A), the lower bound on the level of racial segregation possible under complete income integration will always be 0. But what is the upper bound? How much racial integration is required in order to obtain income integration?\nTo answer this, we undertake the following thought exercise. For simplicity, we consider a population made up of only Black and White students, though the method can be generalized to multiple groups. Suppose we have a population whose racial composition and race-specific income distributions are illustrated by Figure 1 . In this figure, the White income distribution is described by the area shaded light gray; the Black income distribution is described by the area shaded in dark gray. The sum of these distributions-the total income distribution is described by the heavy black line (note also that the Black income distribution is also described by the area between the heavy black total income distribution line and the light gray White income distribution area). In this figure-which corresponds roughly to the actual Black and White income distributions in the United States, although our discussion is independent of the distributional parameters used hereBlack incomes are, on average, considerably lower than White incomes. Now suppose we attempt to assign students to schools in such a way as to produce maximum racial segregation, subject to the constraint that each school has the same income distribution. For illustration, suppose that the school district consists of four identically sized schools. To maximize racial segregation, we attempt to assign only White students to the first school, except where there are not enough White students in some part of the income distribution (see Figure 2) . In this way, we produce a school (school 1 in Figure 2 ) that enrolls one-fourth of the student population, has an income distribution that mirrors the population distribution, and has the maximum number of White students possible. We repeat this process in the next school, drawing students from the remaining student population; this school (school 2 in Figure 2 ) also enrolls one-fourth of the student population, has an income distribution that mirrors the population distribution, and has the maximum number of White students possible (among the students remaining). We repeat this process until all schools are filled. This assignment process will produce a set of schools with perfect income integration, but maximal racial segregation (For a more formal treatment of the mathematics of computing the maximum possible racial segregation, see Appendix B).\nThe assignment mechanism described in Figure 2 is, by definition, a race-conscious mechanism. It is possible, however, that a similar pattern of school assignment could result from a race-blind assignment mechanism. Suppose we have a city in which the Black and White public school student populations are completely residentially segregated from one another-all Black students live nearer to one another than to any White student. Moreover, suppose that the Black income distribution is lower than the White income distribution, but that within each racial group there is little or no residential income segregation--each Black and White neighborhood has an income distribution that matches the overall Black or White income distribution, respectively. Finally, to minimize transportation costs, suppose we will try to assign each student to the nearest possible school to his or her home, subject to the constraints of the income-desegregation requirements.\nSuch a situation will result in the maximum possible racial segregation consistent with the income-desegregation policy, because most Black and most White students will attend schools in their own (racially isolated) neighborhoods. To see this, consider the following recursive school assignment process: we begin with one schoolsay, in a White neighborhood-and assign to it students from local neighborhoods, attempting to construct a student body with the same income distribution as the whole population. If there are not enough students from the local neighborhood in some part of the income distribution, we assign additional students from a nearby neighborhood, always subject to the constraints of the income-desegregation policy. To the extent that only White students live nearby, this school will be entirely White, unless there are not enough White students at the lower end of the income distribution to create income balance within the school, in which case, we will assign Black lowincome students from other neighborhoods to the school to fill out the income distribution within the school. We repeat this process for each school in turn, again attempting to fill the income distribution of the school with local students, unless there are not enough local students in some part of the income distribution, in which case we assign students from other neighborhoods to fill out the income distribution. We continue this process until all students are assigned to schools. Because of the strong correlation between race and location, coupled with the assignment mechanism favoring short transportation times, the resulting segregation patterns will be similar to those described in Figure 2 , despite the fact that race is not used in school assignment. Thus, the maximum possible racial segregation is, in principal, obtainable even in the absence of a race-conscious assignment mechanism, though the likelihood of obtaining such patterns will depend in practice on the extent of residential racial and economic segregation in a region. We return to this point below."}, {"section_title": "Computing the maximum possible segregation when income is measured dichotomously", "text": "In the above example, we have assumed a continuous income variable (and hence a smooth income distribution density function), but the analysis applies equally well to the case in which income is measured dichotomously (above or below poverty threshold, for example). In this case, the income distribution density function will be given by a step function rather than a smooth curve. The case where income is measured dichotomously is of particular interest, because school systems generally do not have access to exact-or even approximate-family income data for their students. However, they generally "}, {"section_title": "150,000", "text": "150,000 m have free and reduced-price lunch eligibility status data, and may use this dichotomous indicator of income to categorize students in an income integration plan.13\nWhen income is measured dichotomously, the maximum possible segregation (as measured by the normalized exposure index, V) is given by the following simple formula (see Appendix C):\nv.= = -1C , -K-I-(3 So the maximum possible segregation, as measured by the normalized exposure index, depends simply on the difference in poverty rates between Blacks and Whites. It does not depend on the racial composition of the school enrollment. This provides a simple, easily computed measure of the extent of maximum possible segregation.14 Moreover, Equation 3 implies that segregation levels can be quite high unless there are dramatically different poverty rates between the racial groups in question. For example, consider a district with a White poverty rate of 0.20 and a Black rate of 0.50-a sizeable poverty gap. Even given this substantial race difference in poverty rates, Equation 3 shows that a district could assign students to schools in such a way that all schools had equal proportions of poor students, yet the district would still have an extremely high racial segregation level of V= 0.70."}, {"section_title": "Computing the optimal poverty threshold", "text": "Given that it may be administratively much simpler for school districts to base an incomedesegregation plan on a simple dichotomous income indicator rather than on a continuous income variable, does it matter what income cutoff point is used? And, if so, what income cutoff is optimal-what income/poverty threshold yields the minimum value of the maximum possible segregation described in Equation 3?\nIntuitively, a poverty threshold that produces the strongest association between race and dichotomous income will be optimal. Such a point will be near the middle of the income distribution, since a threshold at the high or low end will result in both Blacks and Whites falling primarily into the same income category. Figure 3 illustrates the relationship among the Black and White income densities and the optimal poverty threshold.\" 5 Note that the optimal poverty threshold given these typical (gamma-shaped) Black and White income distributions falls roughly midway between the Black and White mean incomes (see Appendix D). Moreover, note that the maximum possible racial segregation is relatively insensitive to the choice of a poverty threshold as long as the threshold is between the mean incomes of the groups. This finding implies that, in choosing where to set a poverty threshold for an incomeintegration policy, districts can optimize the racial balancing effects of the policy by selecting a poverty threshold in the broad range between the White and Black mean income for their district."}, {"section_title": "Computing Racial Segregation Under Imperfect Income Desegregation", "text": "Because it may be administratively or practically unreasonable to require that all schools have exactly the same proportion of students below some defined poverty threshold, we next consider the case where an income-integration policy requires only imperfect income balance across schools. In general, relaxing the constraint of perfect income balance will-all else being equal-allow for higher levels of racial segregation. In particular, we consider the case where the proportion of the total student enrollment below the poverty threshold is it, and where an incomedesegregation policy requires each school to have a poverty rate within ±d of 7rj, so that for each school j, ;it-di <rpj:< 7,t + d. Appendix C indicates that the maximum possible racial segregation obtainable under such an income-desegregation policy is given by\nwhere As we have shown above, the maximum possible racial segregation consistent with an incomeintegration policy depends in part on the race- Poverty Threshold (dollars)"}, {"section_title": "FIGURE 3. Maximum possible racial segregation, by poverty threshold (based on ECLS-K estimates of 1998 Black and White income distributions in urban districts).", "text": "specific income distributions, as well as the specifics of the income-integration policy. For information on actual race-specific income distributions among the families of public school students in large school districts in the United States, we rely on several sources of data. First, we examine data from the Early Childhood Longitudinal Study-Kindergarten Cohort (ECLS-K)-a nationally representative sample of kindergarten students in the 1998-1999 school year (National Center for Education Statistics, 2001)-to describe the income distributions among White and Black public school students' families in both urban and suburban school districts. Second, we examine 2000 Census data to determine the range of White-Black income ratios across communities in the United States, because the ECLS-K distribution estimates are national averages, but do not provide good estimates of the variation across districts. ECLS-K data show that in cities and suburbs, the national mean White income is approximately 2.1 times the mean Black income (mean 1998 White and Black incomes were $52,100 and $24,600 in urban districts and $68,100 and $31,700 in suburban districts, respectively).1 7 In addition, Census 2000 data show that WhiteBlack household income ratios in central cities and suburbs range from roughly 1.0 to 2.0.18 These figures suggest the extent of variation across communities in White-Black income ratios, although they are not exactly comparable to the ECLS-K figures because they are based on the average incomes of all White and Black households (including those without children), whereas the ECLS-K estimates are based on the average family incomes of White and Black public school students. Based on these figures, in our results below we report estimates of possible racial segregation for places with White-Black income ratios ranging from 1.0 to 3.0, although there appear to be few places where the White-Black income ratio among public school students' families is greater than 2.0. Figure 4 illustrates the relationship between the White-Black income ratio and the maximum possible racial segregation (as measured by V) under four types of income-integration regimes: perfect income integration using complete income information; perfect income integration using an optimal poverty threshold; and approximate integration using an optimal poverty thresh- old and poverty rates of ±10% and of ±20%. Note that under each type of income-integration policy, the maximum possible value of V is insensitive to the racial composition of the district. First we report the maximum possible segregation under income-based school assignment policies where income is treated continuously. As we expect, at White-Black income ratios close to 1.0, racial segregation may be quite high. At an income ratio of 2.1, roughly the national WhiteBlack income ratio observed in the ECLS-K public school data, V has a maximum possible value of 0.56, meaning that complete income balance across schools could be achieved even while Black and White students attended schools with only an average of 44% as many members of the other group as in the overall district enrollment. This is a nontrivial level of segregation; in fact it is higher than the segregation levels in most urban school districts in the United States.\nUnder a policy that uses a dichotomous income (poverty) measure, the income threshold that produces the lowest possible maximum level of segregation (given the Black and White income distributions derived from the ECLS-K data above) is roughly $35,000 (see Figure 3) .\nConveniently, this corresponds roughly to the income cutoff for reduced-price lunch eligibility status for a family of four in 2000.19 At this optimal dichotomization point, an income-integration policy guarantees roughly 25% less racial integration than would a policy using continuous measure of income-at a White-Black income ratio of 2.1, the maximum possible racial segregation under a dichotomous income measure would be 0.66, compared to 0.56 using a continuous income measure. Figure 4 also illustrates the loss of efficiency that comes from allowing schools to vary somewhat in their poverty rates. Allowing school poverty rates to vary by ±10% of the district mean guarantees very little racial integration, while allowing them to vary by ±20% guarantees no racial integration, except in districts with extremely high racial income disparities. Finally, we note that the loss of efficiency that comes from allowing approximate income integration is greater than the loss that comes from using a dichotomous rather than a continuous income measure.\nThe results shown in Figure 4 suggest that it is possible, in principle, for racial segregation to re- "}, {"section_title": "-------------", "text": ""}, {"section_title": "Estimating Probable Levels of Racial Segregation Under an Income-Integration Regime", "text": "The preceding analyses determined the maximum possible racial school segregation under various conditions. In general, the results indicate that, under conditions typical of large school districts in the United States and under practical incomedesegregation policies, achieving income desegregation guarantees little to no racial integration-in other words, income-integration policies would place only a very high upper bound on the level of possible racial segregation. This is not to say, however, that no racial integration would result from an actual income-desegregation policy. We employ two strategies to provide plausible estimates of the lower bound of probable levels of racial integration that would be obtained under race-blind income-integration district policies. First, we examine patterns of racial and socioeconomic residential segregation in large U.S. cities. Second, we conduct simulations, starting with patterns of racial and socioeconomic school composition in large U.S. districts, to determine the effect that income integration would have on patterns of racial school segregation. While neither approach is definitive, both approaches are informative regarding the probable effects of income-integration policies on racial segregation patterns."}, {"section_title": "The relationship betvveen racial and income residential segregation", "text": "The actual level of racial segregation likely under an income-desegregation policy will depend not only on the particulars of the policy but also on the degree of residential racial and income segregation within a school district, because racial school desegregation will be more likely under an income-integration regime in a district where income segregation is high but racial segregation is low. Conversely, in a district where residential racial segregation is high but where the level of income segregation within each racial group is low, income integration among schools could be achieved largely by having students attend schools in their own (racially segregated, but economically diverse) neighborhoods, and so would be unlikely to produce significant racial desegregation as a by-product.\nTo see this, imagine a district composed of four stylized types of households-poor White households, poor Black households, nonpoor White households, and nonpoor Black households. If the poor White and Black households are near each other and far from nonpoor households, then a number of students will have to travel to relatively distant neighborhoods (some of which are predominantly White and some of which are predominantly Black) to achieve income balance across schools. Under a race-blind policy, this will likely lead to substantial racial integration, since poor Blacks will be equally likely to attend school with nonpoor White students as with nonpoor Black students, and vice versa. If, however, poor and nonpoor Black households are near each other, and far from both poor and nonpoor White households, then an efficient transportation system that attempted to minimize the distance that students travel to school would likely result in many poor and nonpoor Blacks attending school together and many poor and nonpoor Whites attending school together. In this case, income integration might be achieved without producing substantial racial desegregation.\nA more formal consideration of these spatial dynamics and their impact on school socioeconomic and racial integration patterns is beyond the scope of our analyses here. We can, however, get a rough sense of how the relationship between racial and income residential segregation might impact the probable level of racial segregation under a race-neutral income-desegregation policy by examining existing patterns of racial and income segregation in U.S. cities. Research consistently shows that income disparities between racial groups do not fully explain patterns of racial segregation; racial segregation is quite high even among households with similar income levels (see, for example, Clark & Ware, 1997; Darden & Kamel, 2000; Farley, 1995 Farley, , 2003 . As aresult, economic segregation levels are typically substantially lower than racial segregation levels, both within racial groups and in the total population (Massey & Fischer, 2003 ). An examination of data from the 2000 Census illustrates this pattern in U.S. urban areas ( Figure 5 ). Figure 5 shows the relationship between racial (Black-White) segregation and within-race income segregation in the 228 metropolitan area central cities with at least 5% Black population in 2000. Although racial segregation is high in many of these cities, with an average of 0.31 (recall that 0.50 is considered extremely segregated), residential income segregation (here measured as the segregation between those with household incomes above and below $35,000)20 is quite low in comparison, averaging 0.12 for Black households and 0.09 for White households. In all U.S. cities with high levels of Black-White segregation, income segregation within racial groups is low. This suggests that a race-neutral income-desegregation policy would be able to achieve income balance across schools without substantially reducing racial segregation. The evidence of high racial segregation among households with similar incomes likewise limits the potential of income-integration plans to reduce racial school segregation. While the theoretical range of possible racial segregation levels that could obtain under a race-neutral income-desegregation regime is, in general, quite broad, the most probable result in districts with high levels of racial residential segregation and low levels of residential income segregation would be patterns of school enrollment that mirrored these residential patterns."}, {"section_title": "Simulated racial segregation under income-integration regimes", "text": "Our second approach to estimating the likely level of racial segregation that would result from an income-integration policy relies on actual school enrollment data as a basis for simulating the patterns of enrollment that might result from * Black o White income-integration policies. While these estimates are useful, it is important to note that these are lower-bound estimates (and probably implausibly low), since they rely on race-neutral reassignment of poor and nonpoor students among schools, without regard for patterns of residential segregation and home-school distances and transportation costs.\nWe adopt a simulation approach similar to that used by Chaplin (2002) . Like Chaplin, we examine racial and economic enrollment patterns among schools and simulate the race-neutral reassignment of students among schools under an income-integration constraint, and then compute the resulting racial segregation obtained. Our approach differs in several key ways from Chaplin' s, however. First, Chaplin's definition of economic integration required that no school have more than 50% of students eligible for free or reduced-price lunch, whereas our \"evenness\" definition (Section 2.1) requires that all schools have poverty rates identical (or at least close) to those of their district as a whole. Ours is thus a much more stringent income-integration requirement. Second, because his definition of integration was impossible to meet in districts with greater than a 50% poverty rate, Chaplin in these cases simulated economic integration among schools over larger geographic areas than districts, such as counties or entire metropolitan areas. Because both racial segregation and racial income disparities are generally greater over such large areas than within individual districts, Chaplin's approach will tend to yield estimates suggesting more substantial racial desegregation effects of economic integration than will ours. For both practical and political reasons, however, we consider it unlikely that economic integration would be implemented on a scale larger than an individual school district, and so would argue that our estimates more plausibly represent the extreme of what is possible in any foreseeable immediate future. Finally, we report resulting levels of within-district racial segregation, whereas Chaplin reports resulting levels of overall racial segregation across the United States.\nWe use data from the Common Core of Data (CCD) (National Center for Education Statistics, 2003) from 89 of the 1100 largest school districts in the United States in the 2001-2002 school year (11 of the largest districts were missing reduced-price lunch eligibility data) to estimate Implications of Income-Based School Assignment Policies a lower bound on the level of racial segregation. Using data on the poverty (measured by free and reduced-price lunch eligibility status) rate and racial composition of each school, we estimate the White and Black poverty rates for each district and compute upper and lower bounds on the level of racial segregation possible (1) under income integration requiring perfect poverty rate balance, and (2) under income integration requiring approximate (±10% of district poverty rate) balance.\nWe make the simplifying assumption that the White and Black poverty rates in each school are the same as the overall school poverty rate-in effect, we assume that race and poverty status are not correlated within each school (although they may be in the district).\n2 1 This enables us to estimate the White and Black poverty rates in each district, which yields estimates of the maximum possible racial segregation under an incomesegregation regime (from Equations 3 and 4). We then determine whether the poverty rate within a given school is above or below the district poverty rate and compute the number of poor or nonpoor students in each school who would need to exchange places with (nonpoor or poor, respectively) students in another school to produce a level of economic integration commensurate with the income-integration regime (perfect or approximate balance). We assume that any poor and nonpoor students transferring out of a school will be proportionately divided between racial groups within that school, and that students transferring in will be racially mixed in proportion to the pool of poor and nonpoor students available in the district to transfer in (the pool consists of those who have transferred out of other schools). This approach simulates a racially proportionate reassignment of students among schools to achieve income balance. Details of the simulation method appear in Appendix E.\nFollowing this simulated reassignment, we compute the racial segregation level in the district. This will be a lower bound on the level of racial segregation likely following income integration because the racially proportionate reassignment does not take into account residential segregation and transportation efficiency. In a district with substantial racial residential segregation but little within-race income segregation, the reassignment of students among schools will mirror residential patterns (to the extent possible under the income-segregation constraints): Black students will be more likely to be assigned to predominantly Black schools, and vice versa.\nWhen we compare the existing White-Black segregation levels in these 89 districts with the White-Black segregation levels obtained from a simulated racially proportionate reassignment of poor and nonpoor students among schools, it appears that racial segregation could be reduced substantially under an income-integration policy (Figure 6 ). However, just as the upper-bound estimates of possible segregation are likely much higher than would be achieved in practice, these simulation estimates are likely much lower than would result in practice, for several reasons. First, the racial segregation levels illustrated in Figure 6 represent what we would expect if: (1) the minimum possible number of students were reassigned among schools, and (2) if school reassignment patterns were proportionate to the racial composition of the available reassignment pool. The latter is not likely, particularly in the school districts with high levels of racial segregation, because these high levels of racial segregation result, in large part, from high levels of racial residential segregation. As evident in Figure 5 , however, districts with high levels of residential racial segregation uniformly have low levels of within-race income segregation; in these\n0.0-districts, any reassignment plan that attempts to minimize distances traveled will reassign many Black and White students to schools relatively nearby. As a result, the racial integrating effect of the income-desegregation policy is likely to be far less than that illustrated in Figure 6 . Our simulation also certainly underestimates resulting racial segregation in districts with existing racial desegregation plans. In these districts, if the income-integration policy replaces the racial desegregation policy, then the \"baseline\" patterns of school enrollments used in the simulation are inappropriate, as they are only the baseline under the racial desegregation plan. A more realistic baseline would be school assignments that mirrored neighborhood patterns. If these are highly segregated (as they would likely be in districts that had school desegregation court orders), then the effects of an income-integration policy would be weaker, for the reasons described above. In fact, the only type of district for whom the lowerbound estimates shown in Figure 6 might occur in practice would be districts with low levels of residential racial segregation and no racial desegregation plan. But such districts tend to have low levels of school racial segregation in the first place, so the ancillary racial integration benefits of an income-integration policy are likely to accrue primarily where least needed. "}, {"section_title": "Conclusion", "text": "Our primary goal in this article was to examine the extent to which-and under what conditions-income-based school assignment policies might guarantee racial school integration. Our analysis shows that even under the most stringent form of income-based integrationschool assignment based on exact family income levels-and assuming that income balance is achieved completely, income integration does not guarantee even a modest level of racial desegregation. The only situation in which income integration would necessarily produce racial desegregation is if the White and Black income distributions were far more different than they are in fact.\nMoreover, our analyses show that the extent of racial integration guaranteed by an incomeintegration policy is very sensitive to the way in which income integration is defined in practice. For a given pattern of Black and White income distributions, a policy that required perfect income distribution balance, with income measured by a continuous variable, would produce the greatest guarantee of some ancillary racial integration. Such a policy is impractical, both because school districts do not have access to exact family income and because perfect balance among schools is an unreasonable goal for a school district. Under most racial desegregation plans, school districts have typically required schools to have racial compositions that fall within some moderate range of racial composition. It is likely that districts pursuing incomebased desegregation will do the same. Our analyses show, however, that the less strictly a plan ensures perfect income balance, the weaker its likelihood of ensuring any substantial racial integration.\nNot only are districts unlikely to achieve perfect income balance, they are unlikely to be able to use a continuous income measure for school assignment. Dichotomous measures, however, are somewhat weaker guarantors of racial segregation than continuous measures. If school districts based school assignment on a simple dichotomous indicator of socioeconomic status, such as poverty status or free and reduced-price lunch eligibility status, socioeconomic integration would guarantee even less racial integration than would socioeconomic desegregation based Implications of Income-Based School Assignment Policies on a continuous income measure. We also demonstrate that the extent to which school assignment based on a dichotomous income indicator will guarantee racial desegregation depends on the income level at which the distribution is dichotomized. Based on these analyses, we suggest that if districts use a dichotomous measure, the optimal choice of a poverty threshold will be a point on the income distribution somewhere between the mean Black and White income levelsa point that turns out to be conveniently close to the federal reduced-price lunch eligibility threshold, the income measure most readily available to school district officials. Nonetheless, the primary thrust of our analyses is to show that a raceblind income-based school assignment policy is unlikely to ensure even modest levels of racial desegregation. Unless the White-Black mean income ratio is greater than 3-a ratio that is not found in any U.S. city-using a dichotomous income measure will not guarantee a segregation level lower than 0.50, which is an extremely high level of segregation. This is not to say that racial and income desegregation are incompatible. In fact, it is always possible-in principle-to achieve both complete racial and socioeconomic integration under any income-integration regime. But the clear implication of our analyses is that racial integration is not guaranteed by a raceneutral income-integration policy.\nOur analyses here focus on the possible and probable effects of within-district incomeintegration policies in large urban districts. Absent income reassignment options that rely on inter-district or metropolitan transfers to achieve regional income balance among schools, the effect on racial school desegregation is likely to be extremely limited. It may be that the adoption of inter-district transfer policies coupled with income integration would lead to greater racial school desegregation, particularly if income and race are more highly correlated among districts than within districts. Yet, the same set of limiting conditions-residential segregation patterns, in particular, and transportation distances and cost-would likely influence the potential racial desegregation resulting from such a policy. Additional analyses would be necessary to determine the likely effects of inter-district income integration policies.\nOne might ask whether a socioeconomicintegration policy that used multiple socioeco-nomic factors-including, perhaps, parental education, neighborhood poverty rates, public housing assistance-as well as other factors, such as prior achievement and English proficiency, might produce greater ancillary racial integration than a strictly income-based policy. Although a full analysis of the implications of a multiple factor policy is beyond the scope of this article, one can guess at the likely results: multiple factors are better than a single factor to the extent that the multiple factors are collectively more highly correlated with race than income alone, although the extent of improvement will likely depend strongly on the specifics of the policy. In general, we would expect that a policy that required exact balancing among schools on multiple factors, each of which was partially correlated with race (net of the other included factors), would guarantee lower levels of racial segregation than would the use of an income measure alone. However, a multiple factor policy may not guarantee much, if any, additional racial integration if only approximate balance among schools were required, since even mildly inexact balance substantially diminishes the guarantee of racial integration.\nThe second goal of this article was to estimate the probable level of racial integration that might result from a race-neutral income-integration policy. Examination of residential racial and income segregation patterns in U.S. cities suggests that whereas racial desegregation is a possible result of an income-desegregation policy, it is not a probable outcome, given the low levels of residential income segregation relative to levels of residential racial segregation in most cities. While our lower-bound estimates of the racial integration effect of income integration suggest the possibility of substantial ancillary racial integration impacts, these impacts are likely to be substantial only in districts with low levels of racial segregation relative to income segregationdistricts, in other words, where racial segregation is not sufficiently high to be a pressing concern in the first place. In fact, the patterns of racial and income segregation in urban areas in the United States strongly suggest that transportation policy may be the strongest determinant of whether income-integration policies result in significant racial integration. In a district that guaranteed free and efficient transportation for all students to any school in the district, and that used parental choice or a lottery in conjunction with an income-integration constraint, school enrollment patterns would be potentially only weakly constrained by residential segregation patterns. (The primary constraint would be due to parental or student preference for nearby schools, but this might be offset by preferences for quality schools, which may not always be nearby;,see, for example, Hastings, Kane, & Staiger, 2005.) In such a case, we would expect racial segregation patterns under an income-integration regime to look much more like our lower-bound estimates shown in Figure 6 . In the absence of strong transportation and choice or lottery mechanisms to counter residential segregation patterns, however, an incomeintegration regime is likely to result in many students attending schools relatively near their homes in racially segregated neighborhoods.\nFinally, it bears repeating that none of our analyses are meant to suggest that income desegregation among schools might not have substantial positive benefits for students. Socioeconomic integration may be quite valuable in its own right, regardless of its racial impacts. Our findings simply indicate that income and race cannot stand as proxies for one another in school integration policies. Absent some substantial decline in racial residential segregation, race-neutral assignment policies are unlikely to produce significant racial school desegregation. "}, {"section_title": "(Al)", "text": "To verify that it is always possible to achieve both complete racial and complete income desegregation in the schools, we enroll tmj = 7tmtj students of each race m in each school j (so that iumj = 7 cm for all m andj) such that the income dis-tribution of these students is the same as that of the total population of students of race m, that is, Dmnj(l) = m(/). Now the total income distribution of schoolj will be identical to the income distribution of the population:\nLikewise, the racial composition of each schoolj will be identical to that of the whole population, so we will have perfect integration by both race and income. Note that this result does not depend on the racial composition, the income distribution, or the relationship between the two. Complete racial and income integration are mathematically compatible for any population, regardless of the relationship between race and income."}, {"section_title": "Appendix B: Computing Maximum Possible Racial Segregation", "text": "We next determine the pattern of school enrollments that yields the maximum possible level of racial segregation consistent with perfect income integration. Let ID(I) and OWb(I) denote the White and Black income-density functions, respectively. Perfect income integration requires the income distribution in each school to be (tIT)O(I). To produce maximal racial segregation, we assign students as follows: 2 2 in the first school, we assign only White students, except in regions of the income distribution where there are not enough White students to make the income distribution in the school match that of the population. In these regions, we assign as many White students as we can, and then fill the remaining part of the income distribution with Black students. We repeat this for each subsequent school, drawing from the remaining pool of students.\nFormally, we let cj denote the cumulative total enrollment of schools 1 throughj; and we define ij to be the point on the income distribution such that T for allj = 1, .... , J -1 (in addition, we define io = 0 and ij = +-). Now the above assignment mechanism will yield enrollments of Black (bj) and White (wj) students in schoolj given by First, note that if 7t -d < 7rp < 7tbp < it + d, then we can obtain complete racial segregation under the income-integration constraints simply by assigning all Black students to one school and all White students to another. In the case where TCWp < u -d, < 7c + d < nb, however, some racial integration will be required under the income constraints. To achieve maximum segregation in this case, we construct three school populations as follows."}, {"section_title": "2", "text": "Y We first assign to school 1 all poor Whites and enough nonpoor Whites to obtain a poverty rate of 7t -d. This school will be 100% White, with total enrollment tj = Tn,7cw,/(rp -d). Second, we assign to school 2 all nonpoor Blacks and enough poor Blacks to obtain a poverty rate of;p + d. This school will be 100% Black, with total enrollment t 2 = TRb( 1 -nb,)/(I -,p--d). Assign all remaining Blacks (who will all be poor) and Whites (who will all be nonpoor) to the third school. This school will have Thc(7p -d -nýp)/ (7t -d) White students and Tb(n•bp -n, -d)l\nThis arrangement of students will give the maximum possible segregation while maintaining income integration, because there is one allWhite school with as many Whites as possible given the income constraints, one all-Black school with as many Black students as possible, and one school with the remaining students. Defining tuting the racial counts from the three schools into Equation 1 yields\nTo minimize the maximum possible segregation given by Equation 3, we need to find the point Ip on the income distribution where the quantity l7cbp -np I is maximized. The poverty rate 7tcp for a group m is simply the proportion of the population of group m with incomes below I, so we have \nand\nThis expression equals 0 (and so Equation 3 is minimized), when the cutoff point Ip satisfies\nNote that the optimal income cutoff does not depend on the proportions of Whites and Blacks in the population."}, {"section_title": "Appendix E: Simulating Student Reassignment", "text": "Let wi, bi, and tj indicate the number of White, Black, and total students enrolled in school i, respectively. Let 7;,pi, Tcbj , , and itc , indicate the White, Black, and total poverty rate in school i, respectively. Let 7up indicate the overall poverty rate among students in the district. In order that each school have the same poverty rate as that of the district, we transfer xi poor students out of school i, and transfer xj nonpoor students into school i, where\nNote that xi will be positive (meaning that poor students are transferred out and nonpoor students are transferred in) for schools with Icp , > nIp, and negative (meaning the opposite) for schools with Tcpi < Itp. Let XP and X, indicate the total number of poor and nonpoor students, respectively, that are transferred among schools, and let X,p, X,ý, Xbp, and Xb,, indicate the total numbers of White and Black poor and nonpoor students transferred. Assuming that poor and nonpoor students to be\ntransferred out of a school are selected proportionately to their racial composition (as we would expect under a race-neutral policy), and if we assume a 0 correlation between race and poverty within each school (i.e., n,,pi = itbpi = itcp), then these total counts of transferring students are given by\nThe poor students transferred out of schools with an initial excess of poor students make up the pool of students available to transfer into schools that had a deficit of poor students initially, while the nonpoor students transferred out of schools with an initial deficit of poor students make up the pool of students available to transfer into schools that had an excess of poor students initially. If these pools of students are reassigned to other schools in proportion to the racial composition of the available pool, then the number of White and Black students in each school after the transfer process is completed will be wi and b,:\nbicy requI-res o bly ap xim bala ifn thi lgip\nWe compute the racial segregation following reassignment using the new racial compositions of each school (wý and bD).\nIn the case where an income-integration policy requires only approximate balance, the logic of the simulation is similar, though with one complication. We must exchange enough poor and nonpoor students among schools so that for each Implications of Income-Based School Assignment Policies school 1i7c-7c, k< d. However, in a given district the minimum total number of poor students who must transfer out of schools with an excess of poor students will not necessarily equal the minimum total number of nonpoor students who must transfer out of schools with an excess of nonpoor students. 24 In this case, we transfer additional poor or nonpoor students (depending which group requires more transfers out) out of schools until the total number of poor and nonpoor transferring students are equal. Specifically, we find the minimum value of 7t, and the maximum value of 7t. such that it, -d!< n• <i • <t it, < It, + d and that defining xi as For a more detailed discussion of recent legal developments in public school desegregation policy, see Ma and Kurlaender (2005 Ed.2d. 203 (1987) ). an employment case dealing with a remedial affirmative action plan. That framework requires an examination of (1) the necessity of the policy, (2) the burden of the policy on innocent third parties, (3) the efficacy of race-neutral alternatives, (4) the duration of the policy, (5) the flexibility of the policy, and (6) the relationship of numeric goals to the relevant population. Subsequent cases have modified this framework to better address the distinct issues raised in the education context (Ma & Kurlaender, 2005) . Some examples of measures of evenness are the dissimilarity index (D), the information theory index (H), and the normalized exposure index (V) (see also James & Taeuber, 1985; Massey & Denton, 1988) .\nIONote that in the two-group case, for mathematical simplicity and without loss of generality, we compute all racial proportions as if there were no other students in the schools. Thus, in each school and in the population, the proportions of Whites and Blacks sum to 1.\n\"INote that Vis symmetric with respect to m and n:\nit does not matter whether we derive it from the exposure of m to n or the exposure of n to m. 12 0f the 101 large (20,000+ enrollment), predomi- Apart from the difficulties in getting families to report actual income to school districts, asking them to do so may create a kind of \"moral hazard\"--an incentive for nonpoor families to report lower than actual incomes, since reporting a lower income reduces the probability that a student (particularly a nonpoor student living in a low-poverty neighborhood) would be assigned to a school far from his or her home in order to achieve income balance across schools. 14 If we use a different measure of segregation, such as the dissimilarity index or the information theory index, the maximum segregation level does depend on the racial composition of the school enrollment, but only very weakly. 15 The Black and White income densities shown here are based on data from the Early Childhood Longitudinal Study-Kindergarten Cohort (National Center for Education Statistics, 2001); see Section 2.2.5 for more detail.\n- 16 Strictly speaking, Equation 4 holds exactly only if the student population is 50% Black and 50% White (see Appendix C). Additional analyses (not shown) indicate that, if the racial composition is different than this, Equation 4 underestimates the true V1, and so is a conservative (i.e., low) estimate of the maximum possible racial segregation under this type of income-desegregation plan. 17 Moreover, for all four distributions (White and Black city and suburban school students' families) the median income is about 0.8 of the mean income, which corresponds to shape and location parameters for a gamma distribution in each case of x= 1.56 and 72 S= (0.64) x (mean income), respectively. In all of our subsequent analyses we assume both the Black and White income distributions have this common shape, as it simplifies computations. Additional sensitivity analyses to examine the sensitivity of our results to different shape parameters of the gamma distribution suggest that decreasing the standard deviation of income by 10% (which corresponds to an increase in (X of roughly 20%) reduces the maximum possible racial. segregation obtained under complete income integration by 0.05-0.07 points, as measured by V. 1 8 Across central cities, the mean White-Black income ratio is 1.51, with a standard deviation of 0.23; across suburbs, the mean ratio is 1.43 with a standard deviation of 0.21."}, {"section_title": "19", "text": "Students are eligible for free or reduced-price lunch if their family income is less than 130% or 185% of the poverty threshold, respectively. In 1998, the poverty threshold for a family of three was $13,133; for a family of four the poverty threshold was $16,588. These correspond to reduced-price lunch eligibility thresholds of $24,296 and $30,688. The optimal dichotomization point in 1998 (which we use in our analyses here) was $34,700, roughly twice the poverty threshold for a family of four. Figure 3 indicates that our results would be relatively insensitive to changes in the dichotomization point as long as the point is between the mean Black and White incomes, so using the reduced-price lunch eligibility threshold as a dichotomization point is both administratively practical and produces near-optimal results (relative to other dichotomization points). 2 0The results here are insensitive to the choice of a poverty threshold. We also computed income segregation using a wide range of other poverty cutoffs, from $10,000 to $100,000, and in each case obtained very similar results. 21 Chaplin (2002) examines the plausibility of the assumption that the within-school correlation between race and poverty is 0. While he finds some discrepancy between CCD and Census data on poverty rates, his simulation results (which are similar in method to ours) are insensitive to alternative plausible assumptions about the correlation of race and poverty within schools. Thus, we assume a 0 race-poverty correlation within schools.\n22The following derivation relies on several assumptions. First, we assume that all schools in the system are the same size (tj = t for all j). While this is unlikely to be true, it matters little in general. If schools have different sizes, then the order in which we fill the schools will matter, and we can get different levels of segregation from the above procedure. Simulations (not shown) indicate that if there are 20 or more schools of roughly the same order of magnitude in size, the maximum obtainable segregation does not depend on the number or sizes of the schools. In districts with fewer schools, differences in the sizes of schools may matter, but in general, large urban school districts have far more than 20 schools.\nSecond, we assume schools can enroll fractions of persons, since bj and wj need not be integers. Nonetheless, in a district with even a modest number of students, rounding to integers will make a negligible difference in the computed segregation levels.\nThird, we assume the income distributions for each racial group are relatively simple-in particular, we have assumed that for each schoolj, a single income point ij is defined by Equation B 1. This would, for example, be true if (D. and (Db define unimodel distributions with the mode of (D. greater than that of Ob, which is realistic given patterns of income distribution in the United States.\nFourth, we describe here an approach for computing the maximum possible segregation between two racial groups. The method could be adapted to apply to multiple groups, however, if groups were ordered from highest average incomes to lowest, and we filled schools beginning with the highest income group, followed by the next highest, and so on. This would, in general, yield the maximum possible racial segregation for a given set of income distributions.\n23Because segregation is not changed if a school is divided into two or more schools, each with identical compositions as the original school (James & Taeuber, 1985; Reardon & Firebaugh, 2002) , this approach generalizes to any school system with three or more schools. 2To see this, consider the case where d = 0.2 and a district has an overall poverty rate of 7t = 0.15; in this case, there can be no schools with an excess of nonpoor students, though there may be schools with an excess of poor students (i.e., schools where 7c, > 0.35). Thus, there will be poor students who must leave highpoverty schools, but there will be no available slots for them vacated by nonpoor students in low-poverty schools. "}]