[{"section_title": "Abstract", "text": "Background: School neighborhood food environment is recognized as an important contributor to childhood obesity; however, large-scale and longitudinal studies remain limited. This study aimed to examine this association and its variation across gender and urbanicity at multiple geographic scales. Methods: We used the US nationally representative Early Childhood Longitudinal Study-Kindergarten cohort data and included 7530 kindergarteners followed up from 1998 to 2007. The Census, road network, and Dun and Bradstreet commercial datasets were used to construct time-varying measurements of 11 types of food outlet within 800-m straight-line and road-network buffer zones of schools and school ZIP codes, including supermarket, convenience store, full-service restaurant, fast-food restaurant, retail bakery, dairy product store, health/dietetic food store, candy store, fruit/vegetable market, meat/fish market, and beverage store. Two-level mixed-effect and clusterrobust logistic regression models were performed to examine the association. Results from analyses within 800-m straight-line buffer zones of schools were more consistent with our theory-based hypotheses than those from analyses within 800-m road-network buffer zones of schools and school ZIP codes."}, {"section_title": "(Continued from previous page)", "text": "Conclusions: National data in the USA suggest that long-term exposure to the food environment around schools could affect childhood obesity risk; this association varied across gender and urbanicity. This study has important public health implications for future school-based dietary intervention design and urban planning.\nKeywords: Body mass index, Obesity, Overweight, Children, School neighborhood, Food environment, Obesogenic environment"}, {"section_title": "Background", "text": "Obesity prevalence has substantially increased among adolescents worldwide over the past 35 years [1] [2] [3] [4] [5] . Childhood obesity is associated with a number of serious health risks that can persist into adulthood [6] . Given the growing attention to the effects of food environments on childhood obesity, defined as \"the availability, affordability, convenience, and desirability of various foods\" surrounding individuals [7] , a large number of studies have been undertaken to examine the relationships between residential food environment and adolescents' weight status [8, 9] . For example, some cross-sectional studies showed that adolescents tended to have higher weight status if they had higher access to fast-food restaurants [10, 11] and convenience stores [12, 13] or lower access to grocery stores [14, 15] , supermarkets [16] [17] [18] , and full-service restaurants [10, 18] .\nSchool is a key site for effective obesity intervention and control [19] , as adolescents spend a large portion of their day in school. Some previous studies found that the school neighborhood food environment was correlated with adolescents' weight status at different levels [20] [21] [22] . For instance, the presence of a convenience store within an 800-m buffer of the school was associated with a higher overweight rate among the students [21] . However, nearly all existing evidence has been from cross-sectional and also local studies, which could lead to some mixed findings. For example, the presence of fast-food restaurants near schools was only associated with higher obesity risk at an individual level [20] instead of at a school level [21] . To the best knowledge of the authors, there have been few longitudinal, large-scale studies designed for examining the association between school neighborhood food environment and children's weight status, with the dynamics between food environments and children's weight status taken into consideration. In addition, previous studies have suggested that gender-and urbanicity-specific differences in the association may exist due to various dietary and physical activity patterns [19, [23] [24] [25] . This, however, was not found in school neighborhoods and also has not been examined in a longitudinal context. All these limitations warrant further research and investigation.\nThis study used nationally representative samples from the USA to examine (1) temporal changes of school neighborhood food environments between 1998 and 2007, (2) the longitudinal association between school neighborhood food environments and children's weight status, and (3) the variation of the association across gender and urbanicity. Analyses were conducted at multiple geographic scales (800-m road-network buffer, 800-m straight-line buffer, and school ZIP code) to test the sensitivity of results and show the influence of choosing different geographic analysis units on the association. Findings of this study will deepen our understanding of how the structure of food environments in the vicinity of schools may affect children's weight status, and help to inform future school-based childhood obesity interventions and urban planning in the USA and worldwide."}, {"section_title": "Methods", "text": ""}, {"section_title": "Study design and study sample", "text": "This study used the nationally representative data from the US Early Childhood Longitudinal Study-Kindergarten (ECLS-K) cohort, which was designed to examine child development under the sponsorship of several US federal government agencies, including the National Center for Education Statistics. The ECLS-K cohort includes about 22,000 kindergarteners from over 1200 schools in 1998-1999, and 9440 of them were successfully followed up until their 8th grades (2007) [26] . Data collected in 1998-1999 (baseline, hereafter referred to as the 1998 wave) and 2007 (the last follow-up survey) were analyzed. The study included only the students who had complete basic sociodemographic information and measured body mass index (BMI) and had attended the school in the contiguous USA (Alaska and Hawaii excluded) during 1998-2007."}, {"section_title": "Outcome variables", "text": "Children's body weight and height were measured twice during interviews, using a digital scale (Seca model 840, Seca North America West, Chino, CA) recording to the nearest 0.1 kg and a stadiometer (Shorr Productions LLC, Olney, MD) recording to the nearest 0.1 cm, respectively. The two weight measurements were averaged if they differed < 2.3 kg (i.e., 5 lbs), and the two height measurements were averaged if they differed < 5.08 cm (i.e., 2 in.) [27] . The BMI (in kg/m 2 ) for each child was calculated by dividing body weight by squared height. Obesity was defined as gender-age-specific BMI ≥ 95th percentile of the 2000 CDC Growth Chart, while overweight (including obesity, hereafter called overweight/ obesity) was ≥ 85th percentile [28] ."}, {"section_title": "Exposure variables", "text": "The Dun and Bradstreet (D&B) commercial datasets in 1998 and 2007, including all food outlets (points of interest) with geographic coordinates, were used to characterize the food environment surrounding the schools that ECLS-K children attended in 1998 and 2007. According to the hierarchical Standard Industrial Classification (SIC) codes (Additional file 1: Table S1 ), 11 categories of food outlets were extracted from D&B datasets and included in the analyses: supermarket, convenience store, full-service restaurant (eating places excluding fast-food restaurants/stands), fast-food restaurant/stand, retail bakery, dairy product store, health/dietetic food store, candy/nut/confectionery store, fruit/vegetable market, meat/fish market, and beverage store.\nThe density of each category of food outlets (per km 2 ) in 1998 and 2007 was separately calculated within three types of geographic units in which food environments have been associated with child weight status [29] : (1) 800-m straight-line buffer, by creating a circular buffer zone with a radius of 800 m centered on each school; (2) 800-m road-network buffer, where it covers 800 m to travel from any point on the boundary of the buffer zone (normally in an irregular shape) to the school along the shortest path on the basis of national road network datasets; and (3) school ZIP code, extracted from the year 2000 US ZIP code boundaries. The changes in each variable from 1998 to 2007 were calculated by subtracting the density in 1998 from the density in 2007 in the school neighborhood, with each sample labeled as one of the three categories for each variable: decreased (negative change), constant (no change), and increased (positive change). After a data screening, several categories of food outlet around many schools were sparse or absent. For more meaningful analyses and interpretation of model coefficients, as well as an easy comparison among the three scales of analyses, all samples were divided into absence (density = 0) and presence (density > 0) groups based on the density of each type of food outlet.\nConsidering the degree of healthiness of the food available in each type of food outlets, we hypothesized that the increased exposure to supermarket, full-service restaurant, health/dietetic food store, fruit/vegetable market, and beverage store was associated with lower weight status, while the increased exposure to convenience store, fast-food restaurant, retail bakery, dairy product store, candy store, and meat/fish market was associated with higher weight status."}, {"section_title": "Covariates", "text": "Child-level covariates included age, gender, race/ethnicity (white, black, Hispanic, Asian, and others), socioeconomic status (SES), parental education, and urbanicity. Children's SES was delineated into four categories based on their parents' report of their household annual income: ≤ $30,000, $30,000-50,000, $50,000-75,000, and > $75,000. Parental education was determined based on the parent who had the higher education level, recoded as four categories: high school and below, vocational/ tech/college, bachelor's degree, and graduate degree. The urbanicity of the school's location was either urban (urbanized areas of ≥ 50,000 inhabitants) or non-urban (small towns of < 50,000 inhabitants and rural)."}, {"section_title": "Statistical analysis", "text": "First, χ 2 tests (for categorical variables) and t tests (for continuous variables) were conducted to identify significant disparities in children's sociodemographic characteristics and weight status and the food environment in school neighborhoods between genders. McNemar's tests (for categorical variables) and paired t tests (for continuous variables) were used to examine the significance of the changes in child weight status and food environments during 1998-2007.\nGiven the nested data structure (i.e., children within schools), two-level mixed-effect and cluster-robust logistic regression models were performed to estimate the associations of the changes in school neighborhood food environments during 1998-2007 with children's BMI and weight status (i.e., overweight/obesity and obesity only) in 2007, respectively. The school-level random intercept represented the variation of BMI (or weight status) among children across schools. All models were adjusted for children's baseline age, gender, race/ethnicity, SES, parental education, urbanicity, BMI (or weight status), and exposures to school neighborhood food environments. We also fitted separate models to examine the potential variation in these associations by gender and urbanicity.\nAll spatial operations and analyses were conducted in ArcGIS (Version 10.4.1, Esri, Redlands, CA), including the construction of food environment measures at different scales in Geographic Information Systems (GIS). All statistical analyses were performed using Stata 14 (College Station, TX), with sampling weight and complex survey design incorporated to compensate for non-response (loss to follow-up) and unequal probabilities of selection at each sampling stage [9, 30, 31] . In the main text, we showed the results from the analyses conducted within 800-m straight-line buffer zones, compared these results with those from the analyses conducted within 800-m road-network buffer zones and school ZIP codes (Additional file 1), and discussed all the results."}, {"section_title": "Results", "text": ""}, {"section_title": "Sample characteristics", "text": "Our final analytical sample included 7530 children, which had no significant differences from those excluded ones in terms of the distribution of children's sociodemographic characteristics and weight status (Additional file 1: Table S2 ). At baseline in 1998, the mean age of the included children was 6.2 years, with boys slightly older than girls (p = 0.012) ( Table 1 ). The baseline weight status was similar between genders, with a mean BMI of 16.4 kg/m 2 and the prevalence of overweight/obesity and obesity being 26.6% and 11.3%, respectively. The significant increases that occurred during 1998-2007 in mean BMI (from 16.4 to 22.9, p < 0.001) and prevalence of overweight/obesity (from 26.6% to 35.5%, p < 0.001) and obesity (from 11.3% to 19.5%, p < 0.001) also occurred in boys and girls separately. In 2007, girls had developed a significantly higher BMI than boys on average (23.2 vs. 22.6, p = 0.013), but boys had a marginally higher prevalence of obesity than girls (21.0% vs. 18.0%, p = 0.062).\nDuring 1998-2007, the numbers of food outlets in all types within school buffer zones had increased (p < 0.05). Full-service restaurants, supermarkets, and fast-food restaurants increased more than other types of food outlet. No gender differences were found in the exposure to any type of food outlet both in 1998 and 2007 (Table 2) ."}, {"section_title": "Associations of school neighborhood food environments and child BMI", "text": "A higher BMI was observed among the children who attended schools with an increase of convenience stores in neighborhoods during 1998-2007 (β = 0.39, p < 0.05), especially among girls (β = 0.50, p < 0.05) and urban schoolchildren (β = 0.41, p < 0.05), compared to their counterparts who experienced a constant density of convenience stores in their school neighborhoods over the 9-year period ( Table 3 ). The children who attended schools with a decrease of dairy product stores in neighborhoods also showed a higher BMI (β = 0.86, p < 0.05), especially boys (β = 1.86, p < 0.001) and urban schoolchildren (β = 0.92, p < 0.05). These effects of dairy product stores on child BMI were consistent with the results from the analyses within 800-m road-network buffer zones (Additional file 1: Table S3 ).\nThe effects on child BMI of the changes in some other types of food outlet in school neighborhoods were found at different scales of analyses. For example, within 800-m road-network buffer zones, a higher BMI was found in urban schoolchildren who had experienced an increase of full-service restaurants in their school neighborhoods (β = 0.41, p < 0.05), in boys with an increase of convenience stores (β = 0.44, p < 0.05) and a decrease of fruit/vegetable markets (β = 1.85, p < 0.05), and in girls with the increase of fast-food restaurants (β = 0.70, p < 0.01) and meat/fish markets (β = 1.05, p < 0.05) (Additional file 1: Table S3 ). Consistently, the decrease of meat/fish markets was also associated with lower BMI in girls (β = − 0.74, p < 0.05) within school ZIP codes, where, in addition, the decrease of health/dietetic food stores was associated with the increased BMI (β = 0.49, p < 0.05), especially in girls (β = 0.94, p < 0.01) and non-urban schoolchildren (β = 1.50, p < 0.01) (Additional file 1: Table S6 )."}, {"section_title": "Associations of school neighborhood food environments and child weight status", "text": "The longitudinal associations of the changes in school neighborhood food environments with child overweight/ obesity risk were mainly found in non-urban schoolchildren and girls (Table 4 Table S7 ) and within 800-m road-network buffer zones around schools (Additional file 1: Table S4 ), respectively. The higher obesity risk was associated with the increase of fast-food restaurants in urban schoolchildren (OR = 1.27 [95% CI = 1.02-1.59]) and of convenience stores in girls (OR = 1.41 [95% CI = 1.09-1.82]) and non-urban schoolchildren (OR = 1.60 [95% CI = 1.10-2.33]) ( Table 5 ). The increase of full-service restaurants was related to lower obesity risk in boys (OR = 0.74 [95% CI = 0.57-0.95]). Consistently, the decrease of full-service restaurants was related to higher obesity risk in boys (OR = 1.45 [95% CI = 1.01-2.09]) within 800-m road-network buffer zones around schools (Additional file 1: Table S5 ). The schoolchildren who had experienced the decrease of dairy product stores showed the higher obesity risk (OR = 1.68 [95% CI = 1.07-2.65]), especially boys (OR = 2.92 [95% CI = 1.58-5.40]) and urban schoolchildren (OR = 1.67 [95% CI = 1.07-2.61]), which were also observed within 800-m road-network buffer zones around schools (Additional file 1: Table S5 ). The girls exposed to the increase of dairy product stores consistently showed the lower obesity risk (OR = 0.71 [95% CI = 0.51-0.98]). In addition, schoolchildren exposed to the decrease of meat/fish markets showed the lower obes- Table S8 )."}, {"section_title": "Discussion", "text": "This is a large-scale longitudinal study using nationally representative data from the USA to investigate the relationships between school neighborhood food environments and children's weight status at three geographic scales. We found that (1) increased exposure to convenience stores and meat/vegetable markets in school vicinity was mainly associated with schoolchildren's higher weight status, and increased exposure to fast-food restaurants, health/dietetic food stores, candy stores, and fruit/vegetable markets was associated with their higher Children were classified as overweight and obesity if their sex-age-specific body mass index (BMI) ≥ 85th and 95th percentiles of the 2000 CDC Growth Chart, respectively Italicized numbers indicate statistical significance p < 0.05 weight status only in some gender-and urbanicityspecific subgroups; (2) increased exposure to dairy product stores in school vicinity was mainly associated with schoolchildren's lower weight status, and increased exposure to full-service restaurants and beverage stores was associated with the lower weight status only in some gender-and urbanicity-specific subgroups; (3) findings from the analyses within 800-m straight-line buffer zones of schools were more consistent with our theory-based hypotheses than those from the analyses within 800-m road-network buffer zones of schools and school ZIP codes. Given the previous limited and mixed findings at different local scales [20, 21, 29] , it is imperative to conduct a large-scale study to deepen our understanding of the roles of different food venues around schools in the obesity epidemic. Most of the previous studies have focused on common food venues (e.g., supermarkets, grocery store, fast-food restaurants) [20] [21] [22] 29] . It has been suggested that simultaneously accounting for multiple types of healthy and unhealthy food outlets could yield more precise estimates of health effects than when considering only a small number of dimensions of the food environment [32] [33] [34] [35] . Some types of food outlet are sparsely distributed in the USA and even more sparsely in school vicinity, such as retail bakery, fruit/vegetable market, candy store, and dairy product store. Hence, the All models were adjusted for age, gender, race/ethnicity, socioeconomic status, parental education, and urbanicity. Italicized numbers indicate statistical significance (*p < 0.05, **p < 0.01, ***p < 0.001) associations between those food outlets and child obesity have been little examined in local studies due to insufficient study samples and/or variability in exposure to such food environments. Given the increasing trend of all those types of food venue over the 9-year period across the country, understanding their association with population weight status, although possibly confounded to some extent, is important for urban and land-use planning in the future. In addition to adding new knowledge to this field, as many food items are provided in more than one type of food outlet, including those sparsely distributed food All models were adjusted for age, gender, race/ethnicity, socioeconomic status, parental education, and urbanicity. Italicized numbers indicate statistical significance (*p < 0.05, **p < 0.01, ***p < 0.001) outlets (i.e., controlling for these variables) may in turn produce more reliable evidence on the associations between common food outlets and obesity risk. Most types of food venue provide a variety of foods, both healthy and unhealthy. Candy, for example, provided in supermarkets (normally considered as a healthy venue), would be classified as unhealthy when housed in a separate venue. With candy stores and other types of food outlet providing supermarket food categories included in our models, the commonly accepted association between greater access to supermarkets and higher weight status was not found in this study. Likewise, the venues classified as convenience stores may also provide healthy options, and the food variety in convenience stores is more varying across regions than in supermarkets (usually chain stores). Therefore, more local studies with the involvement of field validation are needed to investigate the relationships between some types of food venue and child obesity. In addition, the actual food acquisition and consumption should be somehow considered to elucidate unknown pathways from food environments to child weight status. The association between less access to dairy product stores and schoolchildren's higher weight status found in this study, for example, may be partly attributed to compensatory eating behaviors, which in particular matter in the regions where food is scarce [19] . Some gender-specific associations might be attributed to different social or eating behaviors, which, however, need more ancillary data to substantiate these links. For example, only girls with increased exposure to candy stores showed higher overweight/obesity risk. Additionally, fruit/vegetable markets are usually available in a more mobile form, which may take place only during certain times of a day on certain days of a week (e.g., a farmer's market). Previous studies have reported failure of on-site validation for this category [36] . Due to our national study design, we were only able to conduct a visual validation in Google Maps for a limited sample of records, during which we either failed to find fruit/vegetable stands. Also, availability is not equal to consumption. These reasons may underlie some of the counterintuitive findings of this study, including the positive association between the exposure to fruit/vegetable markets and health/dietetic food stores and children's overweight/obesity risk in non-urban regions. Thus, these results should be interpreted with caution.\nAn important advantage of undertaking this study at multiple geographic scales is to inform future studies that finding of food environmental research at one scale may not be sufficient, due partly to the uncertain location of schools (or individuals) within ZIP codes. Results from the analyses within school road-network buffer zones were not best aligned with our theory-based hypotheses, which further implies that GIS-based objective measures of food environments may not substitute for other types of measures, such as the perceptions of the neighborhood food environment, which could represent how individuals perceive their surroundings and consequently make decisions on how they actually interact with the surroundings. For example, the ecological momentary assessment (EMA) [37] , where individuals are prompted to answer short surveys on their smartphone about the decision-making process related to a health behavior at a specific moment in time, is a commonly used methodology in spatial lifecourse epidemiology to complement objective measures of built and food environments [38] .\nThis study has some limitations that highlight desirable future research directions. First, the classification of food venues needs to be refined. Due to the limited number of children relative to a wide range of food outlets of interest, we did not differentiate many detailed categories of food outlets represented by six-digit or eight-digit SIC codes. This prevented us from discriminating the effects of distinct types of food outlet falling under one main category, such as seafood and pizza restaurants in full-service restaurants and tea and soft drinks in beverage stores (Additional file 1: Table S1 ). However, simply using six-digit or eight-digit SIC codes cannot easily solve this problem, as a six-digit category still includes both healthy and unhealthy venues, and a venue in an eight-digit category still provides both healthy and unhealthy food. More work is needed to untangle these complexities, e.g., the inclusion of household surveys and individual purchasing and consumption data [19] .\nSecond, the accuracy of the D&B data needs more ground-truthing work or virtual/remote assessment tools to validate it. In addition to changes in geographic locations, some entities might have experienced changes in primary markets or become closed during our 9-year study period. Therefore, some non-spatial information, such as business start-ups and failures, should be recorded in D&B datasets in better quality than currently, and hence be used to construct more robust indicators of food environments. In addition, despite no significant differences in sociodemographic characteristics and weight status between the included and excluded schoolchildren and no evidence showing that lost to follow-up is not random, the findings of this study should be generalized to the entire US young population with caution. Different multiple imputation methods will be used to deal with missing data and compare with the findings of this study in future efforts.\nThird, in addition to using pre-defined administrative or geographic units, the \"school neighborhood\" boundary needs to be delineated with consideration of the routes and ways of commuting between home and school. By doing so, individual exposure to the food environment around schools could be measured more accurately [39] [40] [41] . The food environment and relevant regulations within schools should also be considered, which could possibly help to explain students' purchasing, consumption, and compensatory eating behaviors [19] . We are also aware that children's realistic interactions with food environments in the vicinity of their schools may be affected by age, home-to-school distance, availability of school lunch programs and on-campus vending machines, and school bus and after-school programs. Therefore, this study was limited by the unavailability of individuals' residential addresses and school food-related policies.\nFinally, we only focused on the effect of school neighborhood food environments without intention to be inclusive with all potential predictors added in. The results should be interpreted with caution as the significant relationship is not free of potential estimation issues due to possible omitted variables and measurement errors in the models, which, however, is impossible to completely avoid in regression analysis."}, {"section_title": "Conclusion", "text": "This study revealed the relationships between school neighborhood food environments and children's BMI and obesity risk over a 9-year follow-up period in a US nationally representative study. It suggests the potential benefit of improving food environments around schools for preventing childhood obesity. Three national spatial datasets (food outlet, road network, and ZIP code boundary) were processed to match with national survey data, which is an exemplary study in spatial lifecourse epidemiology [38] . It has important public health implications in terms of both school-based dietary intervention design and urban planning for the future (e.g., considering effects of the spatial configuration of various food outlets in school neighborhoods on children's dietary behaviors and weight status and interventions to be developed). Survey and consumer purchasing data, as well as school environments and policies, could be integrated into future research to unravel the mechanisms of how school neighborhood food environments affect individual and family purchasing behaviors. "}]