[{"section_title": "INTRODUCTION", "text": "We need to build a future in which our factories and workers are busy manufacturing the high-tech products that will define the century… Doing that starts with continuing investment in the basic science and engineering research and technology development from which new products, new businesses, and even new industries are formed."}, {"section_title": "President Barack Obama, February 2012", "text": "Our Nation's economic growth depends on our capacity to educate, innovate, and build. Long-term national investments in basic and applied research and development (R&D) play an important role in the flow of market-based innovations through a complex system that leverages the combined talents of scientists and engineers, entrepreneurs, business managers and industrialists. These funds have led to everything from small entrepreneurial initiatives to growth in high technology industries with the concomitant employment of millions of workers. The large impact on employment results from innovation impacts not only in high tech enterprises, but also other industries that benefit from increased capabilities and productivity. Mutually reinforcing and complementary investments in R&D by both private and public sectors work in concert to support the development, production, and commercialization of new products and processes. Between 2008 and 2009, business R&D investment in the U.S. declined from $259 to $247 billion ( Figure  1). That decline, coupled with increased hiring of R&D workers outside the U.S. by U.S.-based multinational corporations ( Figure 2), 1 represent unfavorable indicators for business sector participation in U.S R&D. Since business investment fosters innovation in high growth, high salaried, high technology industries, these shifts in business R&D participation could have profound implications for the vitality of the U.S. national \"innovation ecosystem.\" 2 Investment in R&D is not the only factor that affects the rate of and capacity for innovation. Public policies, including monetary policy, tax policy, standards, procurement, regulatory policy, the availability of a skilled technical workforce, and market access are also important in establishing an environment that fosters innovation. Given this critical time in our Nation's economic trajectory, careful consideration of our portfolio of innovation policies-including R&D investment practices and public policy-is needed to foster national prosperity and to increase national access to the global economy. In this policy companion to Science and Engineering Indicators 2012 we discuss the innovation ecosystem and the role of R&D in fostering innovation; explore the complementary roles of the private and public sectors; and offer key findings for stakeholders to consider. This ecosystem is nurtured by not only R&D but also includes education and the ability to build/implement technology. Although the connection is strong among R&D investment, innovation, economic growth and job creation, it is also complex."}, {"section_title": "HOW R&D FOSTERS INNOVATION", "text": "America leads the world because of our system of private enterprise and a system that encourages innovation. And it's important that we keep it that way. See, I think the proper role for government is … to create an environment in which the entrepreneurial spirit flourishes…the Government can be a vital part of providing the research that will allow for America to stay on the leading edge of technology…I think we ought to encourage private sector companies to do the same, invest in research."}, {"section_title": "President George W. Bush, April 2004", "text": "Innovation has long been recognized as an important driver of economic growth. Empirical research and surveys of business activities show that innovation leads to new and improved products and services, higher productivity, and lower prices. As a result, economies that have consistently high levels of innovation also tend to have high levels of growth (Atkinson and McKay 2007). Total national investment in R&D includes investments by the Federal Government, states, colleges and universities, and the business and non-profit sectors. In 2009, the U.S. proportion of R&D to gross domestic product (GDP) was about 2.9%. This ratio has ranged from 1.4% in 1953 to a high of nearly 2.9% in 1964 and has fluctuated in the range of 2.1% to 2.8% in the subsequent years. 3 The business sector's predominant role in funding R&D began in the early 1980s, when its support began to exceed 50% of all U.S. R&D funding. The business sector share of R&D steadily increased over the next 20 years, reaching a high of 69% in 2000. Since 2000, however, this decades-long trend of increasing private sector R&D was interrupted as the relative share of private investment declined following the 2001-2002 recession, and again after the 2008-2009 recession. The 2009 business R&D share of the U.S. total was 62%."}, {"section_title": "The Many InTerdependencIes of a naTIonal InnovaTIon sysTeM", "text": "Adapted from: OECD. Managing National Innovation Systems, 1999. National investment in basic and applied research and development importantly contributes to the flow of market-based innovations in ways that can be characterized as an \"innovation ecosystem.\" Innovation is defined as the introduction of new or significantly improved products (goods or services), processes, organizational methods, and marketing methods in internal business practices or in the open marketplace (OECD/Eurostat 2005). R&D and other intangible investments such as investments in software, higher education, and worker training are key inputs driving innovation. The term \"ecosystem\" emphasizes complexity of the innovation process -one that is highly dynamic, has many interdependencies, and is always evolving. Business sector investment focuses largely on development, directing almost 80% of its R&D resources toward development, compared to only 13.9% toward applied research and an estimated 5% towards basic research in 2009. 4 Development funding generally supports incremental rather than transformative innovation. Transformative innovation is more likely when basic research leads to quantum steps in expanding knowledge or through synergies when progress in multiple areas of science or technology complement each other to provide new composite capabilities. Here the Federal Government plays a critical role, accounting for 53% of all U.S. basic research funding, compared to 22% for the business sector. These investments in basic research create the building blocks for innovation by creating a transformative knowledge base upon which the private sector can draw. The Federal Government also spurs innovation by making direct and indirect investments throughout the innovation ecosystem and enacting policies that foster pre-competitive collaboration between the various stakeholders, including businesses, universities, and other public and private entities, 5 such as the Small Business Innovation Research (SBIR) program, and the recently established National Science Foundation (NSF) Innovation Corps (I-Corps) program. These collaborations are critical not only to increased innovation but also to national economic growth and job creation. In our increasingly interconnected and globally competitive world economy, unleashing innovation is an essential component of a comprehensive economic strategy. As global competition erodes the return to traditional practices, the key to developing more jobs and more prosperity will be to create and deploy new products and processes. Executive Office of the President, A Strategy for American Innovation, 2009. Investment in R&D is not synonymous with innovation. Many firms introduce new products without R&D. 6 However, it is possible to demonstrate the relationship between the amount of investment in R&D and product and process innovation for a broad cross-section of industries. Figure 3 compares an index of industry innovation rates with industry R&D intensities 7 for several key industries 8 between 2003 and 2007. The index is created by adding the number of product and process innovations for each industry in a National Science Foundation (NSF) database and plotting this index against the R&D intensity for each industry. 9 A positive correlation is evident, underscoring the importance of R&D intensity as a major policy variable. The vertical dashed red line indicates the minimum ratio of R&D to sales that typically qualifies an industry as R&D intensive. Ten of the seventeen industries fall below this minimum. Over time, these industries may become increasingly less competitive and provide fewer jobs and lower rates of pay (Tassey 2011). The relationship between R&D and innovation is highly complex. Figure 4 illustrates a simplified linear model of the interplay of R&D investment strategies using a series of iterative steps linked by learning and feedback -steps that flow both \"downstream\" from research to design and development, and \"upstream\" from the development and design to research. As shown, innovation does not necessarily require progression through all steps in a successive, linear fashion, but rather there are multiple \"entry points\" to this process. Overlap and redundancy increase the chances that an innovative idea will be funded to bring the idea from the invention stage to release as a new product or process in the marketplace. "}, {"section_title": "PRIVATE SECTOR INVESTMENT IN THE INNOVATION PROCESS", "text": "Businesses, operating in a competitive global market system, have numerous advantages in the creation and implementation of useful new ideas. With the rise of a technology-based approach to the production of new goods and services, the organization of high-tech business in the U.S and globally has changed. Today, innovation within the U.S. involves a complex network of firms -large and small -often working collaboratively and sustained in part by Federal, state, and local government efforts to encourage innovation and economic development. The results of the recent Business R&D and Innovation Survey (BRDIS) sponsored by NSF suggest that companies that perform or fund R&D have a far higher incidence of innovation than companies without R&D activity. However, only a small number of U.S. businesses perform R&D (47,000 or about 3%). 10 Businesses vary across industry and size in \"R&D intensity\"-that is, the ratio of domestic R&D performed and paid for by the company to domestic net sales. In 2008, the ratio across all businesses within the scope of BRDIS was 3.0% overall, 3.5% for manufacturers, and 2.2% for companies in nonmanufacturing industries. 11"}, {"section_title": "U.s. BUsIness r&d and InnovaTIon sUrvey", "text": "To better understand and measure how R&D is conducted in today's innovation-and global-based economy (NRC 2005), NSF and the U.S. Census Bureau launched a new Business R&D and Innovation Survey (BRDIS). BRDIS expands on R&D data collected by its predecessor, the Survey of Industrial Research and Development, to cover (among other areas) global R&D funding or expenses by U.S.-located businesses, and introduces preliminary innovation and intellectual property questions. Business views about investing and performing basic research involve considerations about the appropriability of successful S&T results, commercialization risks, and uncertain longer-term investment returns. As noted above, businesses allocated the overwhelming majority of their R&D funding to applied research (13.9%) and development (79.4%) in 2009. 12 However, involvement in basic research can help boost human capital generally, attract and retain expert talent, absorb external knowledge, and strengthen innovation capacity. Businesses that invest most heavily in basic research are those whose new products are most directly dependent upon ongoing scientific and technological advances, such as pharmaceuticals and the scientific R&D service sectors. 13 Leading companies in highly competitive industries typically see R&D as essential for retaining and sustaining their leadership. The need for R&D may not be seen as critical to companies in less competitive industries. 14 There are, of course, many reasons why a firm might underinvest in R&D. For example, there may be a concern over a lengthy interval between R&D investment and the appearance of a commercial product in the market; the outcomes of a firm's previous R&D investments might not have proven to be technically sufficient; or the capital requirements for R&D investment are excessive (Link and Scott 2011). As central research budgets are reduced, many firms use their researchers to assimilate generic technologies from external sources, that is, they create inward spillovers from other company, government, or university sources, as opposed to conducting breakthrough research (Tassey 2005). Even in highly competitive industries, some companies may focus their efforts on reducing costs or targeting niche markets while taking advantage of the innovations that emerge from the R&D of others."}, {"section_title": "The role of prIvaTe eqUITy and relaTed fUndIng", "text": "Private equity (PE) refers to the holding of stock in private companies that are not quoted on a stock exchange (PrivCo 2011). PE investment generally refers to a leveraged buyout or other substantial investment typically exceeding $10 million made by private equity firms (Lerner, Sorenson and Stromberg 2008;Pitchbook 2011). PE growth is defined as \"minority equity investments in later-stage to mature companies made by private equity funds\" and does not include venture capital funding (Pitchbook 2011). PE investment is likely to occur after a business has already demonstrated success in the market, and primarily allows the firm to raise capital for expansion (PrivCo 2011). As Figure 5 indicates, PE growth was about 21% of total PE investment in 2000, but dropped to 4% in 2005, probably due to the \"dot-com\" bust. Angel and venture capital are special types of equity finance, typically for young, high-risk and often hightechnology firms. "}, {"section_title": "Angel Investment", "text": "Angel investors, or business angels, are wealthy individuals with experience in creating new companies (Organisation for Economic Co-operation and Development (OECD) 1996; Branscomb and Auerswald 2002;PrivCo 2011). Angel investment is viewed as the most likely revenue source for early-stage start-ups (PrivCo 2011), and the majority of angel groups prefer to invest in high-tech industries such as medical devices, software, and biotechnology. 15 In the entire U.S. economy, between 24% to 28% of early stage technology development is funded by angel investors (Branscomb and Auerswald 2002). Most important, however, may be the relationship between angel investment and the growth of innovative companies. A recent study showed that firms that received angel funding are somewhat more likely to survive for at least 4 years, and that angel funding is positively related to the likelihood of subsequent external investment (Kerr, Lerner and Schoar 2010). Because angels like to be heavily involved in the company, the majority of angels have been found to be within 50 -100 miles of their investment (OECD 1996)."}, {"section_title": "Venture Capital Investment", "text": "Venture capital is defined as equity or equity-linked investments in young, privately held companies. The investor is a financial intermediary who typically takes an active role in advising the firm (Kortum and Lerner 2000). Venture capital investment occurs at a later stage than angel investment, and venture capitalists seek to gain returns on their investment in the form of an initial public offering (i.e., sale of stock) or company sale (PrivCo 2011). Figure 6 shows the amount of venture capital invested in S&T industries, as well as the ratio of first round venture capital investment to total investment. A higher ratio generally implies that, as a whole, firms are making riskier investments. Investment in these S&T industries decreased during 1988-1991, 2000-2003, and 2007-2009, consistent with periods of U.S. recession. First round investment peaked in 1995 accounting for almost half of venture capital investment and began to fall throughout the early 2000's recession to levels comparable with those in the 1980's."}, {"section_title": "venTUre capITal InvesTMenT and The eMergence of sIlIcon valley", "text": "ntrepreneurial ecosystems cannot be jump-started solely by the availability of researchers, capital, or modern nfrastructure. Through the 1960s and 1970s, policymakers typically recognized large corporations as the ominant model for organization, deemphasizing the role of small firms and entrepreneurs -cementing n east coast/west coast cultural dichotomy in manufacturing and other technology start-ups. From the 960s, however, Silicon Valley cultivated its own organic environment in which young engineers (including .S. educated foreign nationals) shared life experiences and an outside industry perspective deviated from hat scholars had previously attributed to an \"east-coast\" model focused on mass-production and vertically ntegrated corporations. Finding its roots in the economic volatility through the 1970s and 1980s, the ilicon Valley upstarts proved to be more successful adapting to evolving markets and technological advances. e supporting infrastructure of the region sprang from initial venture capital (VC) investments in the first ave of successful entrepreneurs who in turn invested in start-ups of friends and colleagues.  "}, {"section_title": "PUBLIC SECTOR AND THE INNOVATION PROCESS", "text": "By leveraging resources across the Federal Government and building on regional strengths, we'll improve business opportunities, enhance our Nation's global economic competitiveness and create sustainable, 21st century jobs."}, {"section_title": "Secretary of Commerce Gary Locke, 2010", "text": "Although pathways of innovation cannot be predicted, government policies have evolved that support diffusion of knowledge and deployment of new technologies as well as research and discovery. These strategies include direct and indirect investments in basic and applied R&D and human capital development, and enacting policies that foster innovation by facilitating government/academic/non-profit and industry collaborations, promoting technology transfer, and creating favorable tax, regulatory, and visa policies (Alic, Mowery and Rubin, 2003)."}, {"section_title": "federal sUpporT for InnovaTIon", "text": ""}, {"section_title": "R&D Investments", "text": "The U.S. Government supports the Nation's R&D system through various policy tools. The most direct is Federal funding of R&D. Federal support for U.S. R&D spans a range of broad objectives. In 2009, defense was the largest of the R&D budget functions, accounting for 55% of the total. Defense-related funding emphasizes advanced technology and major weapon systems development (Figure 7), while funding by nondefense agencies largely supports basic and applied research. Though in 2009 the private sector funded 62% and performed 71% of all U.S. R&D, the Federal Government remains by far the prime source of funding for basic research. In 2009, the Federal Government accounted for about 53% of all funding for U.S. basic research, 42% of applied research, and 21% of development support. Federal funds to the academic sector provided $31.6 billion (nearly 58%) of the $54.9 billion spent on academic R&D in 2009. Federal funds accounted for $7.1 billion, about 40%, of the $17.5 billion spent on R&D by other nonprofit organizations. 16 Academic R&D supported by Federal investments is linked to innovation. For example, the number of citations to peer-reviewed literature on the cover pages of issued U.S. patents point to the impact of academic R&D on U.S. innovation. 17 Values for this indicator increased sharply in the late 1980's and early 1990's (Narin, Hamilton and Olivastro 1997), due in part to developments in U.S. patent policy, industry growth and maturation, and legal interpretations, as well as increased patenting activity by academic institutions. 18 Citations to articles authored in the industry, nonprofit, and government sectors have lost share of patent cover page citations, largely due to an increase in articles from academia, which grew from 58% to 64% of the total citations to U.S. articles between 1998 and 2010. 19 Of the five broad fields of science and engineering (S&E) that accounted for virtually all patent citations to U.S. academic articles, increased shares of academic citations were notable in engineering (from 46% to 63%) and physics (from 43% to 66%)."}, {"section_title": "Strategies for Innovation", "text": "The success of Federal innovation policies in the post-World War II period is largely due to support for multiple alternatives and potentially diverging pathways. This is especially evident in computing and electronics, where R&D funding flowed through multiple and often-competing agencies, enabling entrepreneurs in academia and industry to pursue a broad range of competing technologies. Policies other than direct R&D investment also impacted innovation in commercial aircraft and electronics. Both the regulation of commercial air transport and the deregulation of telecommunications encouraged privatesector investments in new technology. Likewise, military procurement fostered innovation in electronics and aerospace. Individual firms with complementary expertise, (e.g., Semiconductor Manufacturing Technology Consortium (SEMATECH)), may not have banded together without a permissive antitrust policy, while strict antitrust enforcement under quite different circumstances encouraged technology-based startup firms to enter other sectors (Alic, Mowery, and Rubin 2003; Block 2011)."}, {"section_title": "governMenT-IndUsTry cooperaTIon", "text": "e Semiconductor Manufacturing Technology Consortium (SEMATECH) is a well-known and robust xample of an American government-industry cooperation model. This research collaboration was partially unded by the Government to help U.S. semiconductor firms develop improved manufacturing process echnology in order to better compete internationally. s the consortium grew, the research agenda changed from a \"horizontal\" to a \"vertical\" collaboration between ember companies and shifted its research agenda to strengthening the semiconductor manufacturing quipment industry. EMATECH differed from other contemporary international consortia in Japan and Europe in both scope nd composition. In Europe, ESPRIT and Alvey, for example, were both decentralized in terms of their esearch agendas and their organizational infrastructure. Other consortia models have varied in terms of the umber of participants and the nature of relationships among stakeholders. ver time, SEMATECH evolved to satisfy members' competitive concerns. This change enabled flexibility, hich resulted in positive outcomes for member firms and improved technological outputs. SEMATECH s often touted as a successful model of government support for early-stage technological development. owever, SEMATECH has been criticized for falling short of its larger goals by focusing too narrowly on ear-term results. Nevertheless, SEMATECH does illustrate a unique model of mission-specific government rograms and offers important lessons in effective consortium management and research flexibility. Dertouzos et al. 1989;Grindley et al. 1994;Block 2011; and Negoita 2011. "}, {"section_title": "Technology Transfer Strategies", "text": "Federal technology transfer refers to the various processes through which inventions and other intellectual assets arising from Federal laboratory R&D are conveyed to outside parties for further development and commercial applications. In the late 1970s, concerns emerged over the availability of federally funded academic research for the benefit of the national economy. Since the 1980s, several U.S. policies encouraged cross-sector R&D collaboration and technology transfer, including policies reflected in the Bayh-Dole and the Stevenson-Wydler Acts of 1980. 20 These include formal mechanisms for transferring knowledge arising from federally funded and performed R&D, the transition of early-stage technologies into the marketplace, and promoting R&D and innovation by small or minority-owned businesses. 21 Six agencies continue to account for most of the annual total of Federal technology transfer activities: Department of Defense (DOD), Health and Human Services (HHS), Department of Energy (DOE), National Aeronautics and Space Administration (NASA), Department of Agriculture (USDA), and Department of Commerce (DOC). Most agencies engage in all of the transfer activity types to some degree, but there are differences in the emphases. Some agencies are more intensive in promoting patenting and licensing activities, including HHS, DOE, and NASA; some place greater emphasis on transfer through collaborative R&D relationships, such as USDA and DOC. 22 "}, {"section_title": "R&D/R&E Tax Credits", "text": "Governments may stimulate business R&D through tax incentives -allowances, exemptions, deductions, or tax credits -each of which can be designed with differing criteria for eligibility, allowable expenses, and baselines. 23 In the U.S., Federal tax incentives for qualified business R&D expenditures include a deduction under Internal Revenue Code section 174 (C.F.R. Title 26) and a research and experimentation (R&E) tax credit under section 41. 24 The R&E tax credit provides an incentive to firms to undertake new research that involves technical risks (not business risk) by giving them a credit for expenses related to those new activities against the taxes they owe.  "}, {"section_title": "sTaTe sUpporT for InnovaTIon", "text": "State governments are eager to promote commercial activities, both to increase employment and to grow their state economies. 25 Historically, the primary modes of investment have been public financing, tax relief, and other forms of subsidies to attract new plants and keep existing ones from moving out of state. Successful, world-class companies are located in virtually every state in the U.S.: 39 states are home to at least one Fortune 500 company (U.S. Department of Commerce 2012)."}, {"section_title": "Clusters of Innovation 26", "text": "One strategy that drives state and regional economic development is the formation of innovation clusters (Porter 2001). State-based and regional innovation clusters are geographic concentrations of firms and industries that do business with each other and have common needs for talent, technology, and infrastructure. Such clusters draw on the expertise of local universities and related institutions, which serve as centers of innovation and drivers of regional growth, as illustrated in Figure 9. Innovation clusters build on the unique strengths of a region rather than trying to copy other regions. 27 Examples include the life-sciences clusters found in the Raleigh-Durham and in the Pittsburgh/Akron/Cleveland regions, and the information technology/aerospace cluster found in Seattle/Tacoma/Olympia region. "}, {"section_title": "R&D Expenditures", "text": "Total state R&D expenditures are small in relation to national government expenditures. For example, total \"other government\" (of which state government is a subset) expenditures for \"university and college\" R&D performers were $3.7 billion in 2009, compared to Federal expenditures of $31.6 billion for such academic R&D performers in the same year. 28 In FY 2009, the Federal Government provided 58% of the $54.4 billion of academic spending on R&D. 29 Federal obligations for research funding declined 2.3% from 2004 levels, despite a short-term increase through the American Recovery and Reinvestment Act, and are projected to decline 2.5% from 2009 to 2010. 30 States are thus increasingly motivated to experiment with a variety of plans for nurturing science-based innovations, with the expectation of leveraging these Federal funds (Branscomb and Auerswald 2002). The presence of a State Science Advisor State Office of Science and Technology, State Academy of Science, or State Science and Technology Council often fosters the development of initiatives involving science and technology for local and regional economic development (National Academies, 2008). As the Table below indicates, R&D is concentrated in only a few states. In 2008, the 10 states with the largest R&D expenditure levels accounted for about 62% of U.S. state-based R&D expenditures: California, New Jersey, Texas, Massachusetts, Washington, Maryland, New York, Michigan, Pennsylvania, and Illinois. California alone accounted for 22% of the U.S. total, exceeding each of the next three highest states by about a factor of four. 31 "}, {"section_title": "fUndIng and hIgher edUcaTIon", "text": "American research universities have been a model of innovation throughout the world, addressing complex economic, social, scientific, and technological problems (Cole 2010). Universities contribute to the quality of the economic infrastructure in a state or region by developing knowledge-linking activities that enhance the commercialization of new technologies, support organizational and community change, and assure the production of competent workers and professionals (Walshok 1997). Between 2002 and 2010, state funding for the Nation's top 101 public research universities decreased by 10% after adjusting for inflation. 32 Coupled with the negative impacts of national economic conditions on education and research at both public and private universities (Ehrenberg 2007), trends in state and national funding for research universities are a source of concern for the innovation ecosystem. Although state funding for most major public research universities decreased, enrollment and university costs increased. As a result, state funding per student declined significantly, and the cost of education that must be covered by other funding sources increased substantially. "}, {"section_title": "WORKFORCE DEVELOPMENT AND KNOWLEDGE DIFFUSION", "text": "A vibrant community of scientists, technologists and entrepreneurs is needed to assure the flow of knowledge and information throughout the innovation ecosystem. Government financial support for education and training enhances the formation and growth of that workforce infrastructure. The S&E workforce 33 has shown sustained growth for nearly 60 years. The number of workers in S&E occupations grew from about 182,000 in 1950 to 5.4 million in 2009. This represents an average annual growth rate of 5.9%, much greater than the 1.2% growth rate for the total workforce older than age 18 during this period. Workforce growth in S&E occupations from 2000 to 2009 was slower than in the two preceding decades. Nonetheless, at 1.4% annually, it exceeded the rate (0.2%) for the general workforce. Industries vary in the proportion of S&E workers in their total workforce. Recent BRDIS survey data show that companies located in the U.S. that performed or funded R&D domestically or overseas employed an estimated 27.1 million workers worldwide in 2009. 34 The domestic employment of these companies totaled 17.8 million workers, including 1.4 million domestic R&D employees. Domestic R&D employment accounted for 8% of companies' total domestic employment. 35 "}, {"section_title": "federal InvesTMenT In s&e Workforce developMenT", "text": "The Federal Government plays a substantial role in preparing the S&E workforce. It was the primary source of financial support for 18% of full-time S&E graduate students in 2009. 36 Most Federal financial support for graduate education is in the form of research assistantships (RAs) funded through grants to universities. RAs are the primary mechanism of support for 72% of federally supported full-time S&E graduate students. Fellowships and traineeships support 21% of full-time S&E graduate students. Undergraduate students, graduate students, and postdoctoral fellows who do not directly receive Federal support may still reap the educational and training benefits of performing research in a laboratory receiving Federal funds or learning from faculty researchers at the cutting edge of their fields."}, {"section_title": "sTanford echnology enTUre rograM", "text": "In July 2011, the National Science Foundation awarded a five-year, $10 million grant to the Stanford Technology Ventures Program (STVP) to launch a national center based at Stanford University for teaching innovation and entrepreneurship in engineering. The new national center addresses the critical need for innovative and entrepreneurial engineers across the United States by teaching students to reduce barriers to innovation, understand customers and develop scalable business models. The goal of STVP is to catalyze a wave of change in undergraduate engineering education in the U.S. The new initiatives made possible through the center are intended to inspire students across the country to envision possibilities and create viable and innovative products, services and processes for lasting positive economic and societal impact. NSF Press Release 11-150 \"Engineering Innovation Center Brings Together Tools to Launch Future Entrepreneurs,\" 2011."}, {"section_title": "T v p federal vIsa polIcy for The s&e Workforce", "text": "Foreign born workers constitute a considerable proportion of the labor force in S&E occupations, and both the number and share of foreign born workers have been increasing. For example, the foreign born share of the total academic employment of U.S. S&E doctorate holders increased from 12% in 1973 to nearly 25% in 2008, and reached particularly high proportions in engineering (46%) and computer sciences (51%). However, immigration of scientists and engineers to the U.S. has declined during the recent economic downturn. 37 One indicator of new foreign born S&E workers joining the U.S. workforce is the number of temporary work visas issued by the U.S. Government in visa classes for high-skilled workers. The largest classes of these temporary visas declined during the recent economic downturn, after several years of growth. Data for 2010, however, suggest that this period of decline may be short lived. The previous period of decline in the use of these visas occurred during the milder recession in the earlier part of the 2000s, and these declines were unevenly experienced across visa categories ( Figure 10). A second indicator is the rate at which foreign born recipients of U.S. doctoral degrees remain in the U.S. after earning their degree (i.e., \"stay-rates\"). At the time of doctorate receipt, three-quarters of foreign recipients of U.S. S&E doctorates, including those on both temporary and permanent visas, plan to stay in the U.S., and about half have either accepted an offer of a postdoctoral position or are continuing employment in the U.S. 38 "}, {"section_title": "FINDINGS AND CONCLUSIONS", "text": "National investment in R&D remains strong in the U.S. However, the recent downturn in research support by the private sector, coupled with government budget constraints at all levels (which may allow for little growth in public sector R&D budgets) are reasons for concern. Although R&D is not synonymous with innovation, companies that perform or fund R&D have a far higher incidence of innovation than companies without R&D activity and employ a large number of relatively well-paid workers -both in science and engineering and other occupations. This analysis has identified other potential sources of weakness in our complex innovation ecosystem. Venture capital funding remains strong but volatile, having peaked in 2000 with some evidence of growth in late-stage but not in early-stage financing. State strategies to stimulate economic development have proven successful in many states. However, current fiscal conditions for most states bring into question the ability of states to continue activities that foster innovation at the same levels as in the past. The Federal portfolio of innovation policies is broad, ranging from direct investment in basic and applied R&D and human capital development to tax, regulatory, and visa policies that foster innovation. The decline in private sector funding during the most recent economic downturn, coupled with the observed increase in hiring of R&D workers in other countries by U.S. based multinational corporations, underscores the need for continued and enhanced active involvement by government in nurturing S&T-based innovation in the private sector -and thereby also increasing employment in relatively well paid high technology industries in this country. The National Science Board found the following: 1. Businesses and industries that perform R&D exhibit a greater likelihood of innovation. Though very few businesses conduct R&D (3%), the private sector accounts for the majority of R&D performed in the U.S. (71% in 2009). 2. Basic and applied R&D that the private sector is unlikely to support sufficiently requires sustained, direct funding by the Federal Government to create a knowledge base of potentially transformative ideas that are critical building blocks of innovation. 3. Investments in R&D by the private sector may decrease during times of economic distress. The Federal Government has increased its own R&D investments during the last two economic downturns, whichthough not directed for that purpose -countervailed industry declines in the early and late 2000s. 4. Public funding is essential to sustaining the excellence of public research institutions that play a significant role in the U.S. innovation system. However, state funding for public research universities decreased between 2001 and 2009 while enrollment and university costs increased. As a result, funding per student declined significantly and the cost of education that must be covered by other funding sources has increased substantially."}, {"section_title": "5.", "text": "Federally funded academic R&D is instrumental in creating and sustaining a world-class higher education system that prepares the next generation of American scientists and engineers and also attracts and trains high ability international students, researchers, and faculty. 6. Appropriate visa policies enable the attraction and retention of the best and brightest foreign born students, faculty, researchers and S&E workers. R&D-based innovation has long been a pillar of the U.S. economy, contributing importantly to the Nation's wealth, employment, security, and general quality of life. Federal policies have been and will continue to be critical to a strong innovation ecosystem. With growing international competition in high technology industries, the need for continued and enhanced public efforts to strengthen national R&D-based innovation is clear."}]