[{"section_title": "", "text": "This report uses data from the Baccalaureate and Beyond (B&B) and Beginning Postsecondary Student (BPS) studies to examine the early labor force experiences of postsecondary education participants who graduated or left without a degree or certificate; their borrowing for postsecondary education; and, if they borrowed, their repayment status and the debt-burden implied by their income and repayment obligations. The B&B data, collected in 1994, are used to examine the experiences of 1992-93 bachelor's degree recipients approximately one year after they graduated. The BPS data are used to track the experiences of another group of recent labor market entrants: individuals who began their postsecondary education in 1989-90 and whose last enrollment ended by December 1992. This group is referred to below as the \"noncompleters and associate's degree or certificate recipients\" or the \"nonbaccalaureate group.\""}, {"section_title": "Employment/Unemployment", "text": "The vast majority (87 percent) of 1992-93 bachelor's degree recipients were employed in April 1994 (table 7). About three-quarters (76 percent) were working only, and 11 percent were combining work and further education. The rest were enrolled for further education and not employed (7 percent) or neither working nor enrolled (6 percent). Eighty-one percent of the noncompleters and associate's degree or certificate recipients were employed in April 1994 (table 9). The rest were unemployed or out of the labor force. The average April 1994 annualized salary for the bachelor's degree recipients was $22,100 ($24,200 for those working full time); the average 1993 earnings for the nonbaccalaureate group were $16,600 (tables 13 and 14). Some experience with unemployment during the first year after graduation was not uncommon for bachelor's degree recipients: 29 percent had been unemployed for at least one month (table 15). Their April 1994 unemployment rate was 4.5 percent. Among the nonbaccalaureate group, about one-third had experienced some unemployment, but their unemployment was measured over a longer time period than the bachelor's degree recipients (since 1989) (table 16). The unemployment rate for this group in April 1994 was 4.7 percent."}, {"section_title": "HIGHLIGHTS", "text": ""}, {"section_title": "Borrowing for Undergraduate Education", "text": "About one-half (49 percent) of the 1992-93 bachelor's degree recipients borrowed from some source (including family or friends as well as through student loan programs) to finance their undergraduate education' (table 18). Among those who borrowed, the average amount was $10,200. Graduates of private, not-for-profit institutions borrowed more, on average, than graduates of public institutions ($12,800 versus $8,700). Overall, 43 percent of the noncompleters and associate's degree or certificate recipients borrowed from some source for their postsecondary education, and 25 percent borrowed through student loan programs (table 19). The average amount borrowed through student loan programs was $4,200. For students who last attended a public 2year institution, the borrowing rate through student loan programs was 10 percent and the average amount borrowed was $2,700. Bachelor's degree recipients' immediate career plans appear unrelated to borrowing, but borrowing may be an obstacle to immediate enrollment in graduate school (tables 22-28)."}, {"section_title": "Loan Repayment and Debt Burden", "text": "About one year after graduating, 63 percent of bachelor's degree recipients had no undergraduate debt, either because they had never borrowed or because they had repaid their loans; 29 percent were required to make loan payments; and the remaining 8 percent still owed money but were not required to make payments in 1994 (table 29). Among the noncompleters and associate's degree or certificate recipients, 16 percent were making payments (table 30). For 1992-93 bachelor's degree recipients who were repaying their loans in 1994, the average monthly payment was $136, which averaged 9 percent of their April 1994 salary (tables 31 and 33). Thirty-one percent of those in repayment were paying less than 5 percent of their monthly income; 38 percent were paying 5 to 9 percent; 15 percent were paying 10 to 14 percent; and 16 percent, were paying 15 percent or more (table  33). Those with the lowest salaries (less than $15,000) had the greatest average debt burden (15 percent). Bachelor's degree recipients whose debt burden exceeded 15 percent were more likely than those with debt burdens of under 5 percent to be living with parents or relatives (table 38). The nonbaccalaureate group were less burdened with debt. Their monthly payments averaged $76, and three-quarters had monthly payments amounting to less than 10 percent of their monthly income (tables 32 and 34). The average was 8 percent. Percentage of 1989-90 beginning postsecondary students whose last enrollment ended by December 1992 who borrowed for undergraduate education, who took out student loans, and average amount of student loans, by selected student and institutional characteristics  Table  Page   20 Percentage distribution of 1992-93 bachelor's degree recipients who borrowed according to the amount still owed for their undergraduate education and average amount owed by those who still owed, by selected student and institutional characteristics: 1994 56"}, {"section_title": "21", "text": "Percentage distribution of 1989-90 beginning postsecondary students whose last enrollment ended by December 1992 and who borrowed according to the amount still owed, and average amount owed, by selected characteristics: 1994"}, {"section_title": "22", "text": "Percentage of 1992-93 bachelor's degree recipients who reported that various factors were important to them in determining the type of work they planned to do in the future, by borrowing status and amount borrowed for undergraduate education: Percentage of 1992-93 bachelor's degree recipients working full time in April 1994 who were saving money and the percentage saving for various reasons, by selected student characteristics: 1994   Percentage distribution of 1989-90 beginning postsecondary students according to the year their last spell of enrollment ended by 1994 degree status and, for noncompleters, initial degree objective Percentage distribution of 1992-93 bachelor's degree recipients who borrowed for their undergraduate education and average amount borrowed, by time to complete degree 50 Percentage of 1989-90 beginning postsecondary students whose last enrollment ended by December 1992 who took out loans, by last institution attended and source of loan  Percentage distribution of 1989-90 beginning postsecondary students whose enrollment ended by December 1992 and were making payments on student loans according to amount of monthly payment in spring 1994"}, {"section_title": "INTRODUCTION", "text": "While students enroll in postsecondary education for many reasons, most expect earning a degree or certificate to give them an advantage in the labor market in terms of their employability and salary, both immediately and in the long run. Because postsecondary students invest a considerable amount of time and money to obtain these credentials, it is important to learn about their labor market experiences after they graduate or when they leave without graduating. What kinds of jobs do they get? How much money do they earn? What are their experiences with unemployment? If they have borrowed to finance their education, what are the financial and other implications of this borrowing after they leave postsecondary education? Can they afford to pay back their loans without undue hardship? How does borrowing affect their further education and lifestyle choices? These questions are addressed in this report.\nHow much debt is too much? This question has been debated by legislators, policymakers, and members of the postsecondary community for more than a decade.4 Without disputing the fact that loans provide students who otherwise would not have the resources to go to college a way to invest in their future, much concern has been expressed about student debt levels and whether the growing dependence on loans is creating serious problems for the borrowers and for society. One set of concerns. centers on whether students are in danger of defaulting, a situation that has financial consequences for the students themselves, the institutions they attend, and the loan programs through which they have borrowed. A second set of concerns relates to the possibility that the prospect of borrowing and heavy debt may discourage students (especially minorities and others who are traditionally underserved) from enrolling in postsecondary education or cause them to drop out before they reach their educational goals. A third set of concerns focuses on how debt affects students' postgraduation plans. That is, does it prevent them from continuing their education to the next level, entering a field that is socially beneficial but not necessarily well paying (such as teaching), or buying a home or car or forming a family at approximately the same time as their peers without education loans to repay? This report uses data collected by the National Center for Education Statistics (NCES) to examine the experiences of postsecondary education participants who have recently graduated or dropped out. The rest of this section describes the data and the characteristics of the groups included in the analysis. The next section .describes their early labor force experiences, including how many were working, their occupations, their earnings, and their experience with unemployment. This is followed by a description of their borrowing and its impact on their career choices and plans for graduate school. The next section addresses loan repayment and the debt burden implied by borrowers' current income and repayment obligations and reported information about other aspects of their financial circumstances. A conclusion summarizes the major findings. Appendix A contains a glossary describing each of the variables used in the analysis, and appendix B provides details on the data and methodologies used. 4See, for example, Janet S. Hansen, Student Loans: Are They Overburdening a Generation? (New York: College Entrance Examination Board, 1987); W. Lee Hansen and Marilyn S. Rhodes, \"Student Debt Crisis: Are Students Incurring Excessive Debt?\" Economics of Education Review 7 (1), 1988, 101-112; and Keith Greiner, \"How Much Student Loan Debt Is Too Much?\" Journal of Student Financial Aid 26 (1), 1996, 7-16.\n\n\ntion of associate's degree recipients, however: 34 percent. The other 66 percent either finished in 1993 or 1994 or continued on at another institution after earning their associate's degree. The analysis group includes 59 percent of the 1989-90 beginning postsecondary students who had not received any type of award by spring 1994that is, those who had dropped out before January 1993 and had not returned by the spring of 1994. Table B.2 (appendix B) shows the percentage distribution of the analysis group according to selected characteristics.  Table 5-Percentage distributions of 1989-90 beginning postsecondary students according to selected characteristics for all students, students included in the analysis, and students not included in the analysis for this report \n\n\n"}, {"section_title": "BACKGROUND", "text": "The questions related to borrowing and debt burden have become particularly pressing in light of recent dramatic increases in borrowing. Over the past two decades, borrowing has become an increasingly common way for undergraduates to finance their education. In 1990-91, for example, 65 percent of federal grant, loan, and work-study aid was awarded in the form of loans, compared with 39 percent 20 years earlier.1 In the 1992-93 academic year, borrowing through the Federal Family Education Loan (FFEL) program totaled $14.9 billion.2 With the introduction of unsubsidized Stafford loans for students not meeting the need criteria for subsidized loans, higher maximum loan limits, and changes in need analysis authorized by the Higher Education Amendments of 1992, borrowing grew suddenly and dramatically. In the 1993-94 academic year, the FFEL loan volume was $19.0 billion. In 1994-95 and 1995-96, federal loan volumes (which then included Ford Direct loans as well as FFEL loans) continued to increase, to $22.3 billion and then $24.4 billion.3 1Laura Greene Knapp, Borrowing for College in 1989-90 (Washington, DC: The College Board, 1992), 1. 2The College Board, Trends in Student Aid: 1986to 1996(Washington, DC: The College Board, 1996. 3U.S. Department of Education, Budget Services, table prepared for the FY 1998 President's Budget. Loan volumes refer to net commitments (loans actually dispersed) and exclude consolidated loans."}, {"section_title": "DATA", "text": "The analysis uses the Baccalaureate and Beyond Longitudinal Study (B&B) and the Beginning Postsecondary Student Longitudinal Study (BPS). Both of these studies were derived from the National Postsecondary Student Aid Study (NPSAS), a comprehensive, nationwide study of students enrolled in all types of postsecondary institutions. To this date, four administrations of NPSAS have been completed (1986-87, 1989-90, 1992-93, and 1995-96). B&B provides information on the education and work experiences of approximately 11,000 NPSAS:93 participants who received a bachelor's degree during the 1992-93 academic year (July 1992 through June 1993). The analysis for this report is based on information collected through NPSAS:93 and the B&B First Followup (B&B:93/94), which was conducted in 1994. BPS provides information on the experiences of 8,000 students in NPSAS:89 who entered postsecondary education for the first time in 1989-90; this group was followed up in the spring of 1992 (BPS:90/92) and again in the spring of 1994 (BPS:90/94). Appendix B contains additional information on NPSAS, B&B, and BPS. For the analysis of the BPS data, the sample was limited to individuals whose last spell of enrollment ended no later than December 1992 (approximately three and a half years after they started). The sample was limited in this way because studying debt burden requires information on both monthly loan payments and monthly income. BPS survey respondents were asked to report the amount of their monthly loan payments in the spring of 1994, but only their annual (rather than monthly) incomes. The last year for which individuals were asked to provide income data was 1993. Although dividing respondents' 1993 annual income by 12 provides a credible estimate of their monthly income in spring 1994, an accurate picture of debt burden can be obtained only if the income data apply to a period after students have graduated or dropped out. For this reason, only students whose last spell of enrollment ended before January 1993 were included in the analysis described in this report. Bachelor's degree recipients were excluded from the analysis of the BPS data, because all except those who finished in less than four years (5 percent of the bachelor's degree recipients5) would have still been enrolled in 1993. Since the number of 1989-90 beginning postsecondary students who finished a bachelor's degree in less than four years was relatively small, and to avoid confusion between the different B&B and BPS bachelor's degree populations, bachelor's INTRODUCTION degree recipients were excluded from the parts of the analysis that used the BPS data. However, bachelor's degree seekers who dropped out before January 1993 and did not return were included. Where possible, this analysis uses B&B:93/94 and BPS:90/94 to answer similar questions about the early labor force experiences of recent graduates with different types of awards, their borrowing as undergraduates, and the financial implications of that borrowing. However, these two studies have different orientations: B&B:93/94 focuses on the experiences of bachelor's degree recipients during the first year after they graduate, while BPS:90/94 focuses on their persistence, progress, and attainment from when they initially entered postsecondary education. Consequently, the questions asked of survey participants differed, and direct comparisons of their experiences were not always possible."}, {"section_title": "1992-93 BACHELOR'S DEGREE RECIPIENTS", "text": "In the 1992-93 academic year, 1.2 million individuals earned a bachelor's degree in the United States.6 About two-thirds of them (65 percent) received their degree from a public institution (table 1). Slightly more than half were female in both public and private, not-for-profit institutions (table 2). Eighty-three percent were white, non-Hispanic. Black, non-Hispanics; Hispanics; and Asian/Pacific Islanders accounted for another 5 to 6 percent each, and the remaining 1 percent were American Indian/Alaskan Natives.? Table B.1 (appendix B) shows the percentage distribution of 1992-93 bachelor's degree recipients according to various characteristics.  \nIn 1994, approximately one year after they graduated, the vast majority (87 percent) of the 1992-93 bachelor's degree recipients were employed, even if they were continuing their education. About three-quarters (76 percent) were working only, and 11 percent were combining work and further education. The most common method of finding out about their job was a referral from family, friends, or professors. Those working full time had an average annualized salary of about $24,200 from their primary April 1994 job. Some undergraduate majors seem to lead to better paying jobs than others. Specifically, graduates who majored in business and management, engineering, mathematics, or science had considerably higher salaries than those who majored in humanities or social sciences. The April 1994 unemployment rate for 1992-93 bachelor's degree recipients was 4.5 percent. Some experience with unemployment in the first year after graduating was not uncommon: 29 percent had been unemployed and looking for work for at least one month. Although older undergraduates (30 years or older) as a group were less likely than younger ones (24 years or younger) to ever be unemployed, they were more likely to have been unemployed for 9 months or more. About one-half (49 percent) of the 1992-93 bachelor's degree recipients had borrowed from some source .(including relatives or friends as well as through student loan programs) to help finance their education. The average total amount borrowed from all sources was $10,200. Graduates of private, not-for-profit institutions were more likely to have borrowed and to have borrowed more, on average, than graduates of public institutions. The B&B data provide no evidence that graduates' career choices were related to borrowing if they were working. However, SUMMARY AND CONCLUSION borrowers were less likely to enroll immediately in graduate school or other postsecondary education, even when other student and institutional characteristics were taken into account. In 1994, 29 percent of all 1992-93 bachelor's degree recipients were required to make payments on their education loans. For those making payments, the average monthly payment was $136, or about 9 percent of their April 1994 monthly salary. The graduates with the greatest average debt burden (15 percent) were those with salaries less than $15,000. As monthly debt burden increased, graduates reported spending less on other items, such as housing, auto loans, and other noneducational debt, but larger outstanding loans did not appear to limit spending on these items. Marrying did not appear to be related to debt burden, but graduates whose debt burden exceeded 15 percent were more likely than those with lower debt burdens to be living with parents or relatives. Whether or not a graduate was saving did not seem to be related to debt burden, but whether or not it affected the amount saved is unknown."}, {"section_title": "1989-90 BEGINNING POSTSECONDARY STUDENTS", "text": "Among all those who began their postsecondary education in 1989-90, 26 percent had earned a bachelor's degree by spring 1994that is, within five academic years of the time they were first enrolled (figure 1 and table 3). Another 11 percent had earned an associate's degree, and 13 percent had earned a certificate. The remaining half had not earned any award by this  time.8 The group selected for analysis for this report was naturally quite different in terms of attainment because it excluded anyone who was enrolled after December 1992. Among the analysis group, 69 percent were nonattainers as of 1994, 22 percent were certificate recipients, and 9 percent were associate's degree recipients (figure 1). Of the nonattainers, 62 percent had last attended a public 2-year institution (table 4). To place the analysis group in the context of the entire BPS population, table 5 shows selected characteristics of the entire BPS population, those included in the analysis, and those not included. Compared with other beginning postsecondary students, those in the analysis group were more likely to be 20 years or older when they began postsecondary education, to be black, non-Hispanic, and to have last attended a public 2-year or private, for-profit institution. Overall, the analysis group represents 43 percent of the BPS population. Figure 2 shows, for each group of attainers and for nonattainers, what proportion were in the analysis group. The analysis group includes 72 percent of all beginning postsecondary students who received certificates by 1994. About 60 percent of all those who received certificates did so within two years of beginning their postsecondary education. The analysis group does not include as great a propor-8See U.S. Department of Education, National Center for Education Statistics, Descriptive Summary of 1989-90 Beginning Postsecondary Students: 5 Years Later, NCES 96-155, by Lutz K. Berkner, Stephanie Cuccaro-Alamin, andAlexander C. McCormick, Larry Bobbitt, project officer (Washington, DC: 1996), for more information on the 1989-90 beginning postsecondary students."}, {"section_title": "IMPLICATIONS OF RECENT INCREASES IN BORROWING FOR THIS ANALYSIS", "text": "Unfortunately, the impact of the dramatic increase in borrowing that started in 1993-94 is not captured in this analysis of the B&B:93/94 and BPS:90/94 data, because the students included in the analysis had either graduated or left school by then. To get some idea of how cumulative borrowing for bachelor's degree recipients has changed with the recent aggregate increases in loan volume, the cumulative borrowing of the 1992-93 bachelor's degree recipients was compared to the cumulative borrowing of the 1995-96 fourth-and fifth-year seniors (assuming they would be the 1995-96 graduates). Because the student-reported data for NPSAS:96 are not yet available, it is not possible to determine how the percentage of students who borrowed changed between 1992-93 and 1995-96. However, it is possible to examine changes in the average amounts borrowed by students who participated in federal student loan programs (which most borrowers do). The 1992-93 bachelor's degree recipients who graduated from public 4-year institutions and who participated in a federal student loan program borrowed an average of $10,100 from all sources (federal, state, institutional, family, and other) for their undergraduate education (table  6). Three years later, in 1995-96, fourth-and fifth-year seniors at public 4-year institutions who participated in a federal student loan program borrowed an average of $12,800 in federal loans for their undergraduate education, about $2,700 (or 27 percent) more than the 1992-93 bachelor's degree recipients who graduated from public 4-year institutions borrowed from all sources. At private, not-for-profit institutions, the increase in the average amount borrowed between 1992-93 and 1995-96 was approximately $1,200 (from $13,800 to $15,000, about 6 percent). Because students at private, not-for-profit institutions were more likely than those at public institutions to take out institutional loans in 1992-93 (2 percent versus less than 1 percent),9 the average amount borrowed through federal loan programs in 1995-96 may understate the total amount borrowed at private, not-for-profit institutions more than it does at public institutions. , 1992-93 [National Postsecondary Student Aid Study], NCES 95-202, by John Tuma and Sonya Geis, Andrew G. Malizio, project officer (Washington, DC: 1995), 90. Table 6-Percentage distribution of students participating in federal student loan programs with any loans  in 1992-93 and federal loans in 1995-96 according to total amount borrowed and average  amount borrowed for undergraduate education   Less  $20,000  than   $5,000-$10,000-$15, Data are not yet available on borrowing from all sources for the 1995-96 seniors, and the B&B data for 1992-93 bachelor's degree recipients do not distinguish among amounts borrowed from different sources. Thus, it is impossible to make an exact comparison of cumulative borrowing. However, because some federal loan program participants borrow from other sources as well, the increases reported here understate the true increases over the three-year period. Despite the difficulty of making exact comparisons, it appears safe to conclude that the amounts bor-INTRODUCTION rowed have increased substantially, at least at public 4-year institutions. Among 1992-93 graduates of public institutions, for example, 7 percent of federal loan program participants borrowed $20,000 or more for their undergraduate education from all sources, while 14 percent of their 1995-96 counterparts borrowed this amount in federal loans alone. Because of this major increase in borrowing, one can expect that the 1995-96 bachelor's degree recipients will face larger loan payments than their 1992-93 counterparts did. Their debt burden might also increase, depending on their salaries."}, {"section_title": "9U.S. Department of Education, National Center for Education Statistics, Student Financing of Undergraduate Education", "text": ""}, {"section_title": "EARLY LABOR FORCE EXPERIENCES", "text": "Approximately one year after they graduated (in spring 1994), most of the 1992-93 bachelor's degree recipients were in the labor force, even those who were continuing their formal education. The 1989-90 beginning postsecondary students whose last enrollment ended by December 1992 were also recent entrants into the labor force. All of this group had been out of school for at least a year by spring 1994, and some had been out for as many as four years, depending on the length of their program or, if they did not complete their program, when they left.1°T his section describes the early labor force experiences of these individuals from a number of perspectives. Specifically, it examines their employment rates, occupations, and earnings in the spring of 1994, and their experience with unemployment since completing or leaving their academic programs. For the bachelor's degree recipients, it also describes whether and how they combined further education with employment. (None of the beginning postsecondary students in the analysis group were still enrolled at this point, although overall 13 percent of those who began their postsecondary education in 1989-90 were still enrolled.11) Particular attention is paid here to how the early labor force experiences of these individuals varied with the type of institution attended, undergraduate major, and personal characteristics such as gender, age, and race ethnicity.\nLike the 1992-93 bachelor's degree recipients, noncompleters and associate's degree and certificate recipients were recent entrants into the labor force in spring 1994. Comparisons of the EARLY LABOR FORCE EXPERIENCES  employment rates of the two groups must be made with care, however, because the nonbaccalaureate group being analyzed here excludes anyone enrolled after December 1992, while many of the bachelor's degree recipients were combining school and work. Comparing the nonbaccalaureate group only to bachelor's degree recipients who were not enrolled shows a considerably higher employment rate for bachelor's degree recipients than for the nonbaccalaureate group (92 percent compared with 81 percent) (tables 8 and 9). Employment rates for the noncompleters and associate's degree or certificate recipients differed by gender, with higher employment rates for males than females (86 percent compared with 77 percent). Some of the 23 percent of females who were not employed were unemployed but available and looking for work, and some were not in the labor force. Other characteristics associated with higher employment rates were first enrolling in postsecondary education at age 19 or younger (rather than older); being in the highest (rather than lowest) socioeconomic status (SES) quartile in 1989-90; having last attended a public or private, not-for-profit institution (rather than a private, for-profit institution); and having attended a 2year (rather than less-than-2-year) institution last (table 9).\n\npercentage in any other occupation (8 to 11 percent). One possible explanation is that some graduates who lined up teaching jobs for the fall did seek, but were unsuccessful at finding, short:term employment until school started; or, if they graduated before June, they may have had trouble finding anything except for the summer. :Although the 1992-93 bachelor's degree recipients who graduated in the summer or fall of 1992 .had been in the labor market longer than spring 1993 graduates, they were not any more likely to have been unemployed. However, among those who had been unemployed, summer 1992 graduates were more likely than later graduates to have been unemployed for more than nine months, reflecting their longer time in the labor market. Information on the unemployment experiences of the nonbaccalaureate group is more limited. Data are available on whether they were ever unemployed between 1989-90 and spring 1994;_but not on whether they had been unemployed since they graduated or left postsecondary education. About one-third of the group experienced at least one spell of unemployment between 1989-90 and spring 1994 (table 16). For those who had been unemployed, the average total number of months of unemployment was 10. There is some apparent variation in the unemployment experiences of the nonbaccalaureate group by student and institutional characteristics. For example, noncompleters who last attended private, for-profit institutions appear to be more likely to have been unemployed than noncompleters who last attended other types of institutions, and engineering, mathematics, or science majors appear to be less likely than those with other majors to have been unemployed. However, small sample sizes make it impossible to determine whether the differences are real or simply statistical artifacts.\nThose with either an associate's degree or no award were more likely than those with a certificate to find their jobs within a month (84 percent and 78 percent compared with 67 percent). However, this should not be interpreted to mean that it is more difficult to find a job with a certificate than with no award. Some of those who left without completing a degree or certificate may have left because they had obtained a job and therefore would have experienced no delay between enrollment and employment In addition, some from all of these groups may have been already working at the job while enrolled and therefore also would have experienced no delay. It should also be kept in mind that the \"no award\" group includes individuals with a mixture of postsecondary educational experiences that could range from a month at a less-than -4year institution to three and a half years at a 4-year institution. Consequently, some individuals with no award could have much more postsecondary education than those with a certificate, which might make it easier for them to find a job. Certain student characteristics were associated with relatively greater ease in finding a job. For example, males were more likely than females to find a job within a month. Also, white, non-Hispanics were more likely than black, non-Hispanics to find a job within a month, and black, non-Hispanics were much more likely to have taken more than 12 months to do so. Finally, those in the highest SES quartile were more likely than those in the lowest quartile to find 1 their job within a month, and those in the lowest quartile were the most likely to take more than 12 months."}, {"section_title": "EMPLOYMENT", "text": ""}, {"section_title": "Employment and Enrollment Among Bachelor's Degree Recipients", "text": "In April 1994, about one year after they graduated, the vast majority of 1992-93 bachelor's degree recipients were employed (figure 3 and table 7). Seventy-six percent were working only, and another 11 percent were combining education and work. The remaining 13 percent were about evenly divided between enrolling only and neither working nor enrolling. The group that 10Figure 2 shows the last year of enrollment separately for noncompleters, associate's degree recipients, and certificate recipients. 11U.S. Department of Education, National Center for Education Statistics, Descriptive Summary of 1989-90 Beginning Postsecondary Students: 5 Years Later, 3. was neither working nor enrolled included individuals who were unemployed (but looking for work) or not in the labor force (not employed and not looking for work).  What 1992-93 bachelor' s degree recipients were doing in April 1994 varied with their gender, age, and undergraduate major. Gender differences were relatively minor. Males were slightly more likely than females to be enrolled only, but a relatively small proportion of bachelor' s degree recipients were in this category (7 percent). Age differences were more notable. Graduates who were 24 years or younger when they received their degree (that is, those who started college relatively soon after graduating from high school and attended mostly full time without any long breaks in attendance) were considerably more likely than those who were 25 to 29 years old when they graduated to be enrolled for further education in April 1994. Work/enrollment patterns varied by undergraduate major, but not by the type of institution attended. Business and management majors were the most likely to be working only, and those who majored in engineering, mathematics, or science were the most likely to be enrolled only. Graduates of public and private, not-for-profit institutions had similar work/enrollment patterns. Borrowing for undergraduate education may discourage graduates from immediately enrolling for further education unless they are working as well. Borrowers (about half of all bachelor's degree recipients, table 18) were less likely than nonborrowers to be enrolled only, but the two groups were about equally likely to be combining school and work. Borrowers were slightly more likely than nonborrowers to be working only."}, {"section_title": "Full-Versus Part-Time Employment for Bachelor's Degree Recipients", "text": "Distinguishing between full-and part-time employment allows one to take a closer look at how graduates are participating in the labor market and how they are combining work and further education (table 8). Among those who were working only, the vast majority (89 percent) were working full time. Whether the remaining 11 percent who were working part time were doing so by choice or because they could not find full-time employment is unknown. The graduates combining enrollment and work were about equally divided between working full and part time. Their employment status was related to their enrollment status. Among those who were enrolled full time, more than half (59 percent) were in the labor force as well: 17 percent working full time, 33 percent working part time, and 9 percent unemployed but looking for work. Among those who were enrolled part time, all but 9 percent were also in the labor force, and about two-thirds were working full time. As indicated in the previous section, borrowing as an undergraduate may encourage employment rather than enrollment only. However, it does not necessarily encourage full-time employment. In fact, the proportions of borrowers and nonborrowers who worked full time were about the same. As was the case with the bachelor's degree recipients, the vast majority (81 percent) of the 1989-90 beginning postsecondary students whose last enrollment had ended by December 1992 were employed in April 1994 (table 9 and figure 4). The remaining 19 percent were either unemployed or not in the labor force. Among associate's degree recipients, 86 percent were employed; among noncompleters, 81 percent; and among certificate earners, 80 percent. However, small sample sizes make it impossible to determine whether the apparent higher employment rate of associate's degree recipients is real or simply a statistical artifact."}, {"section_title": "OCCUPATIONS Bachelor's Degree Recipients", "text": "In April 1994,20 percent of employed 1992-93 bachelor's degree recipients were in business and management occupations, 26 percent were in professional occupations, and 18 percent were in administrative/clerical occupations (table 10).12 The rest were teachers (12 percent), in sales and service occupations (11 percent), or in \"other\" occupations (14 percent). As would be expected, undergraduate majors and occupations one year after graduation were related. For instance, business and management majors were more likely to be in business and management than most other occupations,13 while graduates majoring in engineering, mathematics, or science were more likely to report professional or \"other\" occupations than any other occupation. Among humanities and social science majors, about equal proportions were in business and management, professional, and administrative/clerical occupations (21 to 23 percent). 12The glossary in appendix A contains a description of the occupations included in each category. 13The difference between business and management and administrative/clerical is not statistically significant. "}, {"section_title": "40", "text": "Although the enrollment of women in higher education has grown over the past several decades to the point that women now constitute a majority,14 men and women tend to be employed in different occupations when they graduate. Among the 1992-93 bachelor's degree recipients, men were more likely than women to be in business and management and in sales/service occupations, while women were much more likely than men to be teachers or hold administrative/clerical/support jobs (table 10).15 Age and occupation appear related. For example, bachelor's degree recipients 30 years or older were more likely than those 24 years or younger to be in professional occupations and less likely to be in administrative/clerical/support or sales/service occupations. This pattern may reflect greater employment experience either before or during postsecondary education enrollment. Borrowers and nonborrowers had similar occupational patterns."}, {"section_title": "How Bachelor's Degree Recipients Found Their Jobs", "text": "The discussion here is limited to 1992-93 bachelor's degree recipients who were employed full time to help clarify how graduates embarking on a career find their jobs. The most common way the graduates found out about their jobs was through a referral from family, friends, or professors, with 35 percent finding their jobs this way (table 11). Another 19 percent found their jobs through a want ad, and 10 percent found them through a campus placement office. Job search methods and types of jobs (in terms of salary and occupation) were related. For example, graduates whose jobs paid $25,000 to $34,999 per year were more likely than those whose jobs paid less than $20,000 to have found them through the campus placement office or an employment agency. In contrast, graduates with jobs in the $15,000 to $19,999 per year range were more likely than those with higher paying jobs to have found them through want ads. Similarly, graduates with sales/service jobs were more likely than those with professional jobs to have found them through want ads. 141n fall 1970, women made up 41 percent of enrollment in higher education, and in fall 1992, 55 percent. See U.S. Department of Education, National Center for Education Statistics, Digest of Education Statistics 1996, NCES 96-133, Washington, DC: 1996 15The early labor force experiences of female bachelor's degree recipients will be examined in detail in a forthcoming report, Young Women in the Labor Force. Among the noncompleters and associate's degree or certificate recipients, 25 percent had clerical jobs in the spring of 1994; 20 percent had craftsman/repair, laborer, or machinist jobs; 16 percent had management/administrator positions; and 16 percent had service occupations (table 12). The rest had sales or \"other\" positions. Associate's degrees and certificates appear to lead to different types of occupations. As an example, those with a certificate as their highest award were much more likely than those with an associate's degree to have craftsman/repair, labor, or machinist positions, while those with associate's degrees were much more likely than those with certificates to be managers or administrators."}, {"section_title": "EARLY LABOR FORCE", "text": "As with the bachelor's degree recipients, the occupations of the nonbaccalaureate group were strongly related to gender. Among males, approximately half were in either blue-collar occupations (craftsman/repair, labor, or machinist) or managerial/administrative positions (33 percent and 20 percent, respectively). Among females, 38 percent held clerical positions and 21 percent worked in service occupations. Similar percentages of males and females had professional and sales occupations (5 percent to 6 percent in each case). Also, as with bachelor's degree recipients, borrowers and nonborrowers were no different in terms of their occupations."}, {"section_title": "EARNINGS", "text": "Annual Salaries of Bachelor's Degree Recipients Table 13 shows the annualized salaries for 1992-93 bachelor's degree recipients from their primary job in April 1994 (separately for all bachelor's-degree recipients, those employed full time, and those employed part time). The primary job was defined as the job for which the most hours were worked. If the hours were the same for more than one job, the one with the highest salary was considered the primary job. This discussion focuses on those employed full time based on the belief that the salaries of this group most accurately portray the immediate economic prospects of bachelor's degree recipients after graduation. This full-time employed group constitutes the majority of the 1992-93 bachelor's degree recipients (73 percent) (table 8). One could argue that some bachelor's degree recipients may be able to find only part-time work and that this should be reflected in any discussion of the economic outcomes of college graduates. However, among those working part time are many who are enrolled as well as working and therefore not necessarily working in a     career-oriented job. In addition, some (whose number cannot be determined) may be working part time by choice rather than because they could find only part-time work. Finally, graduates were asked to report on only one job. Consequently, the amount of time and earnings of anyone holding multiple part-time jobs simultaneously in April 1994 would have been understated. Although the salaries of the graduates who are employed full time are not representative of all bachelor's degree recipients, they do provide a useful indicator of what a graduate who enters the labor market full time can expect to earn."}, {"section_title": "43-EARLY LABOR FORCE EXPERIENCES", "text": "The average annualized salary for 1992-93 bachelor's degree recipients working full time in April 1994 was about $24,000 (table 13 and figure 5), with approximately two-thirds earning between $15,000 and $35,000. The average annualized salary for full-time workers varied with gender and age and also by major field of study, April 1994 occupation, and type of institution attended.  "}, {"section_title": "BEST COPY AVAILABLE", "text": "Among the full-time employed, the average annual salary was higher for males than females ($26,400 compared with $22,300), reflecting, at least in part, the malefemale occupational differences described above. Average annual salary increased with age, from $22,200 for those 24 years or less when they graduated to $25,400 for those 25 to 29 years old and $32,000 for those 30 years or older. This pattern may reflect older graduates' greater lifetime experience in the work force and in higher paid occupations (table 8). Some undergraduate majors, at least initially, seem to lead to better paying jobs than others. However, it is important to keep in mind that beginning salary differences may not persist over the long term as experience and performance become more important than undergraduate education in determining labor market success. Full-time employed bachelor's degree recipients with undergraduate majors in business and management, and in engineering, mathematics, or science earned considerably higher average annual salaries ($27,000 and $27,200, respectively) than did those who majored in humanities or social sciences ($21,300). Bachelor's degree recipients in business and management and in professional occupations in April 1994 had higher average salaries than their peers in teaching; administrative, clerical, or support; or sales or service occupations. The average annual salary was about $2,000 more for a bachelor's degree recipient who graduated from a private, not-for-profit institution than for one who graduated from a public institution. This pattern has no straightforward explanation, but may reflect a number of interacting factors. Regional economic differences might contribute (private, not-for-profit institutions are more common in some parts of the country than others), as might occupational differences (for example, bachelor's degree recipients from private, not-for-profit institutions were slightly more likely than those from public institutions to have business and management occupations, which pay more than many other occupations). Differences in family backgrounds might also contribute to salary differences, especially since, as indicated above, 35 percent of all bachelor's degree recipients found their jobs through referrals from family, friends, and professors (table   11)."}, {"section_title": "Earned Income of Noncompleters and Associate's Degree or Certificate Recipients", "text": "The average 1993 earned income for noncompleters and associate's degree or certificate recipients was $16,600 (table 14 and figure 6). This includes both full-and part-time employees, and employees who worked only part of the year because they were out of the labor force or unemployed for part of the year. Because no one in this group was enrolled at any time during  1993, none would have worked only part of the year because of enrollment. The average earnings of the individuals in the nonbaccalaureate group were similar regardless of degree or certificate attainment. However, this does not necessarily mean that an associate's degree or certificate has no immediate effect on earnings. Indeed, earnings vary with other factors as well, such as gender, raceethnicity, age, occupation, and time out of school, and many of these factors are interrelated. Associate's degree earners are likely to have been out of school less time than certificate earners or noncompleters, and those employed most recently may have lower salaries. It is also important to remember that the associate's degree earners in the analysis group may not be representative of associate's degree earners in general, because they represent only 34 percent of all beginning postsecondary students who earned associate's degrees by 1994. Average 1993 earnings were higher for males than females and for white, non-Hispanics than black, non-Hispanics. In addition, those who began postsecondary education when they were 20 years or older earned more in 1993 than those who began when they were younger than EARLY LABOR FORCE EXPERIENCES 20 years, perhaps reflecting greater lifetime work experience or different occupations. Average earnings varied with the amount of time spent out of school as well, which again may reflect additional work experience or different occupations. For instance, those who had not been enrolled since the 1989-90 academic year had average 1993 earnings of $18,100, while those whose last enrollment ended by December 1992 had average 1993 earnings of $13,400. Those who had attended a public 2-year institution rather than a private, for-profit institution last also earned more. Average earnings were also related to individuals' primary occupation. Those in the craftsman/repair, labor, or machinist; manager/administrator; and professional categories earned an average of around $20,000 in 1993, while those with clerical occupations earned an average of $14,000 and those in service occupations, $12,200. Individuals in sales occupations had earnings that were in between, averaging $16,900. Those who majored in engineering, math, or science appeared to have earned more than those in other fields, but only the difference with respect to business and management was statistically significant. Comparing the Earnings of Bachelor's Degree Recipients with the Earnings of Noncompleters and Associate's egree or Certificate Recipients With an average annualized salary of $22,100 based on their primary April 1994 job, the bachelor's degree recipients appear to have been doing better financially than the noncompleters and associate's degree or certificate earners, whose average earnings for 1993 were $16,600 (tables 13 and 14). Because full-and part-time employment cannot be distinguished for the nonbaccalaureate group, no direct comparison of full-time employment is possible. In comparing the earnings of the two groups, it is important to keep in mind the difference in how earnings were reported. Noncompleters and associate's degree or certificate recipients reported their earnings for calendar year 1993. How many different jobs they held, whether or not they were ever unemployed, and whether or not they worked full or part time all or part of the year are all unknown. The bachelor's degree recipients, in contrast, reported their April 1994 salary for their principal job, which was then annualized to estimate annual earnings. The number of hours they worked per week was taken into account, so part-time employment is reflected. However, no periods during which they were unemployed or out of the labor force were factored into this estimate of annual earnings. Moreover, some of the bachelor's degree recipients may have worked for part of the year at different salaries or they may have held multiple jobs simultaneously."}, {"section_title": "54", "text": "In summary, the bachelor's degree recipients' annualized salaries provide a good indication of their current earning power for their principal job, but may not accurately represent what they earned during the past year. In contrast, the noncompleters and associate's degree or certificate recipients' 1993 earnings represent what they actually earned over the past year; however, for anyone who was not working for a period of time or who recently changed jobs, they do not provide a very accurate picture of their current earning potential. The different types of employment information collected in the B&B and BPS studies reflect their different purposes and make comparisons between the two groups difficult."}, {"section_title": "EXPERIENCE WITH UNEMPLOYMENT", "text": "Another important aspect of labor force experienceand one that affects the ability to repay student loansis unemployment. A person without a job but who is looking and available for work is considered to be unemployed. The unemployment rate for a particular group depends on their skills, abilities, and experience relative to the types of jobs available in their geographic area. A group's experience with unemployment can be examined from a number of different perspectives, including the unemployment rate at a particular time, how long any spells of unemployment last, and how long it takes to find a job."}, {"section_title": "Unemployment Rates in April 1994", "text": "In April 1994, 4.5 percent of all 1992-93 bachelor's degree recipients were unemployed (table 15). Those who pursued graduate study had a higher unemployment rate than those who did not (6.7 percent compared with 4.1 percent). No other apparent differences among subgroups were statistically significant. The April 1994 unemployment rate for the nonbaccalaureate group (4.7 percent) was similar to that of the bachelor's degree recipients (table 16). Among the nonbaccalaureate group, females had a higher unemployment rate than males (6.0 percent versus 3.1 percent). In addition, those who last attended a private, for-profit institution had a much higher unemployment rate than those who last attended a 4-year private, not-for-profit institution (8.2 percent versus 1.4 percent). No other apparent differences among subgroups were statistically significant.   To place these rates in context, the unemployment rate for the civilian noninstitutional population 25 to 44 years of age was 5.3 percent in January 1994. Taking into consideration education, the January unemployment rate was 2.9 percent for college graduates 25 to 64 years old (including those with graduate degrees) and 5.0 percent for those with some college, but less than a bachelor's degree.16"}, {"section_title": "Periods of Unemployment", "text": "Some experience with unemployment in the first year after graduating appears to be not unusual for bachelor's degree recipients. Twenty-nine percent of the 1992-93 bachelor's degree recipients had been unemployed for at least one month since graduating (table 15). The percentages were similar for graduates of 4-year public and private, not-for-profit institutions and did not vary according to undergraduate major. No meaningful gender or racialethnic differences were found in terms of spells of unemployment for bachelor's degree recipients, but there were some interesting age differences. Bachelor's degree recipients who were more than 30 years old when they graduated were less likely than younger graduates to have been unemployed since graduating. This may reflect a longer time in the work force prior to graduation. In addition, older students are more likely than younger students to work full time while enrolled.17 Therefore a greater proportion of older students may have continued with the same job or employer when they graduated. At the same time, however, graduates 30 years or older were more likely than graduates 24 years or younger to have been unemployed for 9 months or more, suggesting that the older group may include more individuals with more severe employability problems. Broad occupational categories and relatively small sample sizes in some categories make meaningful differences in graduates' periods of unemployment difficult to detect. Graduates with administrative, clerical, or support or teaching occupations were more likely those with business and management or professional occupations to have been unemployed. Most notable among the occupational differences was the relatively high percentage of teachers reporting three to four months of unemployment (18 percent), which was considerably higher than the 16U .S. Bureau of the Census, Statistical Abstract of the United States 1996. Washington, DC: 1996DC: , 413, 415. 171n 1989 "}, {"section_title": "Time to Find a First Job", "text": "How long it takes to find a job upon leaving school is another aspect of experience with unemployment. About three-quarters (76 percent) of the 1989-90 beginning postsecondary students who left postsecondary education or attained an associate's degree or certificate by December 1992 (and subsequently worked) found their first principal job within a month of graduating or leaving postsecondary education (table 17). Those who attended 4-year or public 2-year institutions were more likely than those who attended private, for-profit institutions to find a job within a month.  "}, {"section_title": "60", "text": ""}, {"section_title": "RROWING FOR UNDERGRADUATE EDUCATION", "text": "In 1992-93, the average annual cost of attending a postsecondary institution full time (including tuition, fees, and living expenses) was $19,500 at private, not-for-profit 4-year institutions and $11,100 at public 4-year institutions. Attending a public 2-year institution cost somewhat lessan average of $9,400but attending a private, for-profit institution cost an average of $15,000.18 When these annual costs are multiplied by the number of years attended, the amounts can be substantial. To help cover these costs, many students borrow, either through a student loan program or from relatives or friends. This section describes the debt incurred by 1992-93 bachelor's degree recipients and 1989-90 beginning postsecondary students whose last enrollment ended by December 1992 to finance their undergraduate education and how much they still owed in 1994. It also examines the extent to which their career choices and, for bachelor's degree recipients, their further education, are related to borrowing."}, {"section_title": "AMOUNTS BORROWED", "text": "The 1992-93 bachelor's degree recipients were asked to report the total amount they had borrowed to finance their undergraduate education and to include the amounts borrowed from all sources, including relatives and friends as well as student loan programs. The beginning postsecondary students were also asked if they had borrowed from any source, but were asked only about the amounts borrowed through student loan programs. Consequently, care must be exercised in comparing the amounts borrowed by the two groups. Also important to keep in mind when comparing the two groups or making comparisons among subgroups is that student loan programs limit.both annual and total borrowing, which may reduce the variation in the amounts borrowed by students at different types of institutions and with different financial circumstances."}, {"section_title": "BORROWING FOR UNDERGRADUATE EDUCATION", "text": "Bachelor's Degree Recipients Overall, about one-half (49 percent) of all the 1992-93 bachelor's degree recipients borrowed at some point during their undergraduate education, including borrowing from relatives and friends as well as through student loan programs (table 18 and figure 7). The average total amount borrowed from all sources was about $10,200. Tuition is higher, on average, at private, not-for-profit institutions than at public ones. Reflecting this higher tuition, graduates of private, not-for-profit institutions were more likely than graduates of public institutions to have borrowed (54 percent compared with 46 percent) and borrowed more, on average ($12,800 compared with $8,700). About one out of five graduates of a private, not-for-profit institution borrowed at least $20,000. The longer bachelor's degree recipients took to get their degrees, the more likely they were to have borrowed (59 percent of those who took six years or more to complete their undergraduate education borrowed, 50 percent of those who took from four to six years, and 41 per- cent of those who finished in four years or less). However, those who finished in four years or less borrowed more, on average ($11,000), than those who took more than six years to finish ($9,300). This may reflect, at least in part, the fact that graduates of private, not-for-profit institutions (who borrowed more, on average, than their peers at public institutions) were more likely to finish in four years or less (65 percent compared with 34 percent).19 In addition, some of those who took six years or longer to finish may have taken longer because they were working and using their earnings to reduce the amount they needed to borrow. Although some bachelor's degree seekers who start at 2-year public institutions rather than 4-year institutions may do so in order to reduce the total cost of obtaining their degree, 1992-93 bachelor's degree recipients who started at public 2-year institutions were actually more likely than those who started at public 4-year institutions to borrow at some point during their undergraduate education, and they borrowed about the same amount, on average. Those starting at 2year institutions may have been more likely to borrow at least in part because they took longer to complete their postsecondary studies (27 percent took more than six years, compared with 13 percent of those who started at public 4-year institutions).\"Lo They may also have had greater overall financial need (which is related primarily to family income and the cost of the institution attended). In other words, they may indeed have started at a 2-year institution to keep their costs down, but then had greater need than the average public 4-year student when they later transferred to a 4-year institution. The fact that bachelor's degree recipients who started at 2-and 4year institutions borrowed similar amounts in total may reflect, at least in part, the fact that student loan programs limit the amounts borrowed.\n"}, {"section_title": "Noncompleters and Associate's Degree or Certificate Recipients", "text": "Overall, 43 percent of the noncompleters and associate's degree or certificate recipients reported borrowing from some source (including family and friends) for their undergraduate education, and 25 percent reported borrowing through a student loan program (table 19 and figure  8). The variation by type of institution was substantial. For example, 61 percent of those who last attended a private, for-profit institution borrowed through a student loan program, compared with 10 percent who last attended a public 2-year institution. The average amount borrowed through student loan programs ranged from $2,900 at public 2-year institutions to $6,200 at private, not-for-profit 4-year institutions. The likelihood of borrowing and the average amount borrowed through student loan programs also varied by degree attainment. Those who left postsecondary education with no degree were the least likely to take out a student loan (19 percent, compared with 43 percent of certificate earners and 34 percent of associate's degree recipients). This pattern might reflect a shorter time or intensity of enrollment for at least some noncompleters: for example, students who enrolled only in 1989-90 were less likely to borrow than those who enrolled longer. It also might indicate less commitment to postsecondary education and less willingness on the part of noncompleters to borrow. Variation among noncompleters reflects the costs associated with the type of institution students last attended. Those who left a public 2-year institution were the least likely to have BORROWING FOR UNDERGRADUATE EDUCATION \nBy spring 1994, many of the noncompleters and associate's degree or certificate recipients in the analysis group who had borrowed through student loan programs had been out of school for several years. Consequently, the borrowers in this group were more likely than the bachelor's degree recipients to no longer owe any money (23 percent, table 21, compared with 17 percent,  table 19). Another 61 percent of the nonbaccalaureate group owed less than $5,000, and the remaining 16 percent still owed $5,000 or more (table 21). Among noncompleters, differences in the percentages no longer owing by type of institution last attended were not statistically significant. \nThe nonbaccalaureate group was less burdened with debt than the bachelor's degree recipients. About three-quarters of the nonbacCalaureate group were using less than 10 percent of their monthly earned income to repay their student loans (table 34 and figure 13). The average was 8 percent. Small sample sizes preclude making statistically reliable comparisons among subgroups.  Because the data for this group do not include monthly earned income for spring 1994 (the time for which payment information applies), monthly income was calculated by dividing the reported 1993 annual earned income by 12. This assumes that the nonbaccalaureate group's monthly earned income in spring 1994 was the same as their average monthly earnings in 1993. While not ideal, this is the best measure available."}, {"section_title": "69", "text": "borrowed through a student loan program (8 percent, compared with 29 percent of those who last attended a 4-year institution and 54 percent of those who last attended a private, for-profit institution). Associate's degree recipients borrowed more, on average ($6,300), through student loan programs than those who earned certificates ($4,200), reflecting the longer time they were enrolled. Among those who did not complete their studies, borrowers took out student loans averaging a total of $3,600."}, {"section_title": "AMOUNTS OWED BY BORROWERS IN 1994", "text": "Bachelor's Degree Recipients By 1994, 17 percent of 1992-93 bachelor's degree recipients who had borrowed as undergraduates no longer owed any money (table 20). In some cases, they may have paid off the loan (possibly with help from their parents or others), while in others they may have had the loan forgiven (especially if the loans were from parents or other relatives). Not all of these loans were necessarily paid back or forgiven after graduation; some may have been paid back or forgiven while the graduate was still enrolled. Another 28 percent of 1992-93 bachelor's degree recipients who had borrowed as undergraduates owed less than $5,000, and 26 percent owed between $5,000 and $9,999. The remaining approximately 30 percent owed $10,000 or more. Among those who still owed, the average amount owed was $9,000. (Among all borrowers, the average total amount borrowed was $10,200, table 18.) As one would expect, those from groups that tended to borrow more as undergraduates also tended to owe more a year after graduation. Borrowers who graduated from private, not-forprofit institutions borrowed more, on average, than borrowers who graduated from public institutions ($12,800 compared with $8,700, table 18). Similarly, among those who owed in 1994, graduates from private, not-for-profit institutions owed more than graduates of public institutions ($11,300 compared with $7,800, table 20). Graduates of private, not-for-profit institutions were much more likely than graduates of public institutions to owe more than $10,000. 70 Table 20-Percentage distribution of 1992-93 bachelor's degree recipients who borrowed according to the amount still owed for their undergraduate education and average amount owed by those who still owed, by selected student and institutional characteristics: 1994 Amount of undergraduate debt still owed Average amount owed "}, {"section_title": "BORROWING AND CAREER CHOICES", "text": "Many worry that students who borrow to finance their education might have to be more concerned than those do not borrow about factors such as a good starting salary, a job's income potential, and job security, thus limiting their career choices. Bachelor's degree recipients were asked some questions in the B&B survey that can help shed some light on this issue. First, they were asked whether various factors (including financial ones) were important to them in determining the type of work they planned to do in the future. Second, they were asked if their April 1994 job was related to their degree, and if not, why they took the job. If they were feeling pressured by their loan obligations, one might expect borrowers to be more concerned than nonborrowers about financial factors in choosing a career and to be more likely to take jobs unrelated to their degree for financial reasons. The responses of bachelor's degree recipients to these questions provide no evidence that borrowers are making career choices differently than nonborrowers. The 1992-93 bachelor's degree recipients were asked whether various factors were important to them in determining the type of work they planned to do in the future. Two factors very relevant to their ability to repay their loans were \"good income potential\" and \"job security.\" Borrowers and nonborrowers were about equally likely to indicate that these were important to them (table 22). However, both borrowers and nonborrowers were more likely to indicate that \"interesting work\" and \"intellectual work\" were important to them than they were to indicate that job security was important. Overall, 55 percent of 1992-93 bachelor's degree recipients reported that their job in April 1994 was closely related to their degree, and 20 percent reported that it was somewhat related (table 23). The remaining 25 percent reported that their job was not at all related. Nonborrowers were slightly more likely than borrowers to have an unrelated job (26 percent to 24 percent), although there is no obvious reason why this would be so. Among graduates who took jobs that were unrelated to their degree, borrowers were not any more likely than nonborrowers to take a job for financial reasons. Among bachelor's degree recipients whose April 1994 job was not at all related to their degree, 22 percent said their main reason for taking the job was that it was the only one they could find, and 25 percent said the pay was better than that in other jobs (table  24). The percentages of graduates who took jobs for these reasons were similar for borrowers and nonborrowers.   Beginning postsecondary students were also asked about the importance of various factors in determining the kind of work they planned to be doing, but, in contrast to the bachelor's degree recipients, borrowers and nonborrowers were different. To virtually all the noncompleters and associate's degree or certificate recipients included in this analysis, job security and permanence were important in determining the kind of work they planned to do for most of their lives (88 percent said these factors were \"very important\" and another 11 percent said they were \"somewhat important\") (table 25). However, those who had taken out student loans were more likely than those who had not to rate them as \"very important\" in determining their future work (92 percent compared with 86 percent). Direct comparisons between the baccalaureate and nonbaccalaureate groups must be made with caution because different questions were asked in the two studies. Nevertheless, there was no evidence that career choice was related to borrowing for bachelor's degree recipients, but some limited evidence that it might be for the nonbaccalaureate group."}, {"section_title": "BORROWING AND PLANS FOR GRADUATE SCHOOL", "text": "Bachelor's degree recipients immediate career choices do not appear to be related to borrowing. However, borrowing does appear to have some effect on whether they enroll in graduate school right away, with borrowers slightly less likely than nonborrowers to apply to graduate school (27 percent versus 31 percent) (table 26). Bachelor's degree recipients who said that they had considered applying to graduate school but then had not applied were asked the primary reason they had not applied. Ten percent of those who had borrowed as undergraduates said that having too much undergraduate debt was their main reason for not immediately enrolling in graduate school (table 27). Five percent of those who borrowed less than $5,000 gave this reason, but 20 percent of those who borrowed $20,000 or more did so. Another roughly 20 percent of those who borrowed gave other financially related reasons for deciding against graduate school: 12 percent said graduate school cost too much, was not worth it, or they could not afford it; 6 percent said they had too much other debt; and 3 percent said they could not get enough financial aid. Those who had not borrowed were slightly less likely to give \"cost too much\" and \"too much other debt\" as their main reasons deciding against graduate school. Additional possible evidence of a negative relationship between undergraduate borrowing and subsequent graduate or other postsecondary enrollment was the earlier finding that nonborrowers were more likely than borrowers to be enrolled only, while the two groups were about equally likely to be combining work and enrollment (table 7). These findings, however, do not take into account the relationships between either further enrollment or undergraduate borrowing 77 and various student and institutional characteristics. Examining how enrollment and undergraduate borrowing are associated without considering these relationships may provide misleading results. Several statistical methods are available to examine the relationship between two variables while holding other variables constant. Here, a linear a regression model was used to describe the relationship between immediate enrollment for further education and undergraduate borrowing while adjusting for the covariance of independent variables.21 The dependent variable was defined as the percentage of 1992-93 bachelor's degree recipients who were enrolled for graduate or other postsecondary education in April 1994. They might have been enrolled only or both working and enrolled. The independent variables included gender, raceethnicity, age when they received their degree, whether or not they borrowed from any source for their undergraduate education, type of institution from which th6y graduated, undergraduate major, and grades (GPA). The results of the multivariate analysis are displayed in table 28. The negative impact of undergraduate borrowing on immediate graduate or other postsecondary enrollment was confirmed. Among 1992-93 bachelor's degree recipients, borrowers were less likely than nonborrowers to be enrolled in graduate or other postsecondary education in April 1994. This relationship held regardless of whether they borrowed less than $5,000 or $5,000 or more. The B&B data, because they were collected only one year after graduation, do not permit any examination of longer term effects. However, because the 1995-96 NPSAS includes graduate students of all ages, it will be possible to use these data to examine the relationship between undergraduate borrowing and timing of graduate enrollment. 21See appendix B for a detailed discussion of the technique used in this section. "}, {"section_title": "LOAN REPAYMENT AND DEBT BURDEN", "text": "Most student loan programs require borrowers to begin repayment six months after they leave school, although repayment can be deferred for a variety of reasons. For example; payments can be deferred if the borrower is enrolled in postsecondary education at least half time, is unemployed, is participating in a qualifying service program such as the Peace Corps, or. has an approved hardship (e.g. medical or financial). The terms for loans from families or friends are negotiated by the parties involved. Repayment schedules for these loans may be formal or informal, and some borrowers may even have their loans forgiven. The first part of this section describes the repayment status of the bachelor's degree recipients and noncompleters and associate's degree or certificate recipients and the amounts of their monthly paymentsfor all education loans for the former group and for student loans for the latter. Understanding the extent to which education loan payments impose a financial burden on borrowers requires knowing something about the financial circumstances of the borrowers as well as the size of their payments. Therefore, this' section also examines the amount of the payments in relation to other aspects of borrowers' financial circumstances, such as earnings, other expenses, and, if married, their spouse's educational debt. To complete the picture, this section also looks for links between borrowing and lifestyle choices that might indicate that education loan payments are burdensome. Specifically, it examines whether students who borrow marry later or live at home more often than those who do not borrow, and whether or not they are less able to save for major items such as a house or further education.\nBecause 84 percent of the nonbaccalaureate group as a whole was not making payments on student loans, this group appears to be to be more debt free in 1994 than bachelor's degree recipients (63 percent of whom were debt free at this time, table 29), but the comparison must be made with caution. Data on bachelor's degree recipients' repayments apply to loans from all sources, while data on the nonbaccalaureate group's repayments applies only to loans made through student loan programs. If only loans through student loan programs were included in calculating the percentage of bachelor's degree recipients who had no debt, the percentage probably would be greater than 63 percent. However, because very few bachelor's degree recipients borrowed from relatives or friends (only 4 percent of those who owed in spring 1994 had these loans22), excluding these loans would make little difference. Thus, it seems safe to conclude that the nonbaccalaureate group was more debt free. Among the noncompleters and associate's degree or certificate recipients owing money on student loans in spring 1994, 82 percent were making payments on their student loans; of those who were not repaying their loans, 45 percent were not employed in April 1994.23 The rest could have had hardship or service deferments or been in default. Because none from this group had been enrolled since December 1992, none would have still been in the enrollment grace period for federal loans.\nFamily and friends sometimes help borrowers repay their loans. In spring 1994, 13 percent of the nonbaccalaureate group who were making payments were receiving help from relatives or friends, but the vast majority (87 percent) were making payments on their own. Whether or not an individual was receiving help was related to the family's socioeconomic status (SES): 7 per-23U.S. Department of Education, National Center for Education Statistics, 1990 Beginning Postsecondary Students Longitudinal Study-Second Follow-up, (BPS:90/94), Data Analysis System. LOAN REPAYMENT AND DEBT BURDEN cent of those in the lowest SES quartile were receiving help, compared with 17 percent of those in the two middle quartiles. Similar percentages of those owing less than $5,000 and $5,000 to $9,999 received help: 13 percent and 11 percent, respectively.24\nIn summary, then, large debt burdens appear to be a problem particularly for those with very low salaries (less than $15,000) or high loan amounts (more than $10,000). For example, 41 percent of the former group and 30 percent of the latter had debt burdens of 15 percent or more, much greater proportions than found among those with higher incomes or lower levels of debt. Because students who attend private, not-for-profit institutions tend to borrow more than those who attend public institutions, the former were more likely to have debt burdens of 10 percent or more.\n"}, {"section_title": "REPAYMENT STATUS Bachelor's Degree Recipients", "text": "The majority of 1992-93 bachelor's degree recipients (63 percent) had no debt a year after graduating, either because they had never borrowed or because they had repaid their loans (table 29 and figure 9). Another 8 percent owed money but were not required to make payments at the time, either because they were en rolled at least half time, were in the grace period, had a deferment because :of unemployment or hardship, or had taken loans only from family or friends and were not being required to make payments. Overall, 29 percent of all 1992-93 bachelor's degree recipients were required to make loan payments in 1994. Because repayment can be deferred as long as a borrower is enrolled in postsecondary education at least half time, the percentage of bachelor's degree recipients required to make loan payments varied with their enrollment status. Among 1992-93 bachelor's degree recipients who were not enrolled for further education in spring 1994, 32 percent were required to make loan payments, and among those enrolled part time, 22 percent were required to do so. Although most student loan programs do not require borrowers who are enrolled full time to make payments, 7 percent of such borrowers did in fact report making or owing payments. These payments might have been on loans from families or from sources other than student loan programs; they might have been voluntary repayments; or students enrolled full time in spring 1994 might have started making payments earlier, when they were not enrolled at least half time and either had not requested or not yet received a deferment. Overall, 16 percent of the noncompleters and associate's degree or certificate recipients were making payments on their student loans in spring 1994; the remaining 84 percent either had not taken out a student loan or had paid back their loans (table 30). Noncompleters were less likely than associate's degree or certificate recipients to be making payments."}, {"section_title": "PAYMENT AMOUNTS", "text": "A borrower's monthly payment for student loans depends on the size of the loan and the interest rate at which the loan was made. The Stafford Loan program, the most commonly used undergraduate loan program, calls for a 10-year repayment schedule, with a minimum monthly payment of $50. If, for example, a student borrowed $1,000 or less at 8-percent interest, the monthly payment would be $50. For a $5,000 loan at that interest rate, the monthly payment would be $61, and for a $10,000 loan, $120. As indicated above, payments on loans from relatives and friends are negotiated by the lender and borrower. For the analysis of loan repayment and debt burden that follows, individuals whose monthly loan payments were more than 50 percent of their monthly salary were excluded. For individuals in this category, reported payments were examined along with the amount of their loan and the amount they would have been paying if their loan carried an 8-percent interest rate. In almost every case, the reported payment greatly exceeded the expected amount (and sometimes even exceeded their salary). While many individuals pay back their loans more quickly than is required, it did not seem credible that they would voluntarily increase their payments to the point that they were spending more than half their monthly salary to repay their loans. Because including such individuals greatly increases the average, excluding them from the analysis seemed to make sense. About 60 percent of the 1992-93 bachelor's degree recipients who were in repayment were paying between $50 and $150 per month on loans from all sources (including relatives and friends), with an average payment of $136 (table 31 and figure 10). Reflecting the greater average amounts borrowed at private, not-for-profit institutions, bachelor's degree recipients from these institutions had higher average monthly payments than their counterparts who graduated from public institutions ($163 per month compared with $121).  "}, {"section_title": "E5", "text": "For almost three-quarters of the noncompleters and associate's degree or certificate recipients, monthly payments on their student loans were less than $100 (table 32 and figure 11). Those with certificates were paying an average of $71, those with an associate's degree an average of $102, and those with no degree or certificate were paying an average of $73. When comparing the average amounts being paid by bachelor's degree recipients and by noncompleters and associate's degree or certificate recipients and the relative percentages of each group paying $150 or more per month (figures 10 and 11), it appears that bachelor's degree recipients have much greater loan payments. In making such comparisons, it is important to remember that payment amounts for bachelor's degree recipients include payments on loans from all sources, while the payment amounts for the nonbaccalaureate group include only payments on loans made through student loan programs. However, a relatively small proportion of bachelor's degree recipients had loans from family or friends outstanding in 1994. This makes it reasonably safe to assume that payments on such loans make up a minor proportion of bachelor's \"71 BEST COPY AVAIIILA 1:' 86 LE degree recipients' payments, and that they do indeed have much higher payments than the nonbaccalaureate group.. Table 32-Percentage distribution of 1989-90 beginning postsecondary students whose last enrollment ended by December 1992 who were in repayment according to monthly student loan payments and average amount of payment, by selected student and institutional characteristics: 1994 Amount owed on student loans Less than $5,000 "}, {"section_title": "LOAN PAYMENTS AS A PERCENTAGE OF MONTHLY EARNINGS", "text": "As indicated above, understanding the extent to which education loan payments impose a financial burden on borrowers requires knowing something about the financial circumstances of the borrowers as well as the size of their payments. The most straightforward way to measure debt burden is to compute loan payments as a percentage of monthly income. In this analysis, salary data from B&B and earnings data from BPS are used as proxies for income. If borrowers have other sources of income, their debt burden will be overstated here. However, it seems unlikely' that students who borrowed to finance their undergraduate education would have significant amounts of nonearned income only a few years after graduating or leaving school."}, {"section_title": "8?", "text": "At what point does debt burden become excessive? No consensus has developed, largely because of the need to make subjective judgments about what percentage of their income new graduates should be expected to allocate to repaying their student loans. For example, should we be concerned that a borrower cannot afford buy a house or a new car as soon as a nonborrower? Nevertheless, several studies have suggested that debt burden beyond 10 to 15 percent may be excessive. One study conducted by Westat, Inc. recommends accepting 10 percent as a defensible threshold because mortgage lenders generally expect a family's non-housing debts not to exceed 10 percent.25 Hansen and Rhodes suggest that manageable debt burden varies with income, and propose a range from 10 percent to 15 percent.26 A recent analysis by Greiner starts with 12 percent, based on guidelines established by the Department of Housing and Urban Development in 1989 that state that total debt should not exceed 41 percent of income, and that mortgage payments should not exceed 29 percent.27 That leaves 12 percent for automobile, credit card, and student loans. If one argues that graduates should not expect to buy a home or new car immediately after graduating, 12 percent for student loans appears defensible. Factoring in the results of a survey of borrowers' perceptions of debt burden causes Greiner to propose 8 percent as an appropriate alternative. Contributing to this debate is beyond the scope of this analysis, but knowing what others have proposed as excessive provides a context within which to view the debt burden of the groups studied in this analysis."}, {"section_title": "Bachelor's Degree Recipients", "text": "For about two-thirds of the bachelor's degree recipients in repayment in 1994 and employed full time, loan payments amounted to less than 10 percent of their April 1994 monthly salary. Thirty-one percent were paying less than 5 percent, and 38 percent were paying 5 to 9 percent (table 33 and figure 12). Sixteen percent were paying 15 percent or more, with the average at 9 percent. Debt burden is related to salary and amount of debt. A low salary or high debt, or both, Could cause an individual to have a high debt burden. Among the 1992-93 bachelor's degree recipients, the average perCentage of monthly salary devoted to repaying loans decreased as salary increased, as one would expect. Graduates making less than $15,000 per year were devoting an average of 15 percent of their salary for loan payments, while those making $15,000 to 19,999  "}, {"section_title": "89", "text": "per year were paying an average of 9 percent and those making $25,000 to $34,000 were paying 6 percent. As the amount owed increased, so did the average monthly payment. Loan payments amounted to an ,average of 6 percent of their monthly salary for graduates who owed less than $5,000, 9 percent for those who owed $5,000 to $9,999, and 13 percent for those who owed $10,000 or more. Graduates of private, not-for-profit institutions who were repaying loans were using an average of 10 percent of their monthly salary for this purpose, compared with 8 percent for graduates of public institutions. This difference reflects the greater average amount of borrowing among students at private, not-for-profit institutions, as graduates of private, not-for-profit institutions had slightly higher average salaries, on average, than graduates of public institutions (table 13)."}, {"section_title": "OTHER INDICATORS OF DEBT BURDEN FOR BACHELOR'S DEGREE RECIPIENTS", "text": "While the ratio of loan payments to monthly earnings is probably the most important indicator of debt burden, it is not the only one. Aspects of a borrower's financial circumstances other than earnings can also affect the financial burden of the payments. For example, a borrower who had a nonworking spouse who also had student loan debt would probably find paying 9 percent of his or her monthly earnings in loan payments much more of a burden than would a borrower who had a working spouse with no loan debt. This section looks at two other indicators of debt burden for bachelor's degree recipients: monthly payments for other expenses and spouses' debt burdens. No comparable information is available for the nonbaccalaureate group."}, {"section_title": "Monthly Payments for Other Expenses", "text": "While complete details of the 1992-93 bachelor's degree recipients' financial situations are not available, data were collected on how much graduates were paying per month for some major expenses: mortgages, rent, auto loans, and other noneducational debt (credit cards, for example). The average for these was about $650 per month (table 35). As one might expect, graduates with higher monthly salaries had higher monthly expenditures for these items. In addition, as loan payments used up an increasing proportion of graduates' monthly salary, payments for these expenses generally decreased. However, the total amount owed for undergraduate debt and monthly expenses did not appear to be related. Monthly expenses for the items listed above were similar for borrowers and nonborrowers and did not increase with the total owed. In other words, while higher present loan payments (as a percent of monthly income) may hamper current spending on other items, the existence of outstanding loans does not seem to. Those who had borrowed but no longer owed (that is, who either repaid their loans by 1994 or had them canceled) had higher expenses than those who had never borrowed at all."}, {"section_title": "Spouses' Borrowing for Education", "text": "The burden of a graduate's loan payments may be compounded if the graduate has a spouse with outstanding loans as well, depending on the spouse's income. However, relatively few bachelor's degree recipients were in this position. About 9 percent of 1992-93 bachelor's degree recipients who owed money in 1994 had a spouse who also owed money for his or her education). The average amount owed by spouses with education debt was about $8,300, similar to the average $9,000 owed by the 1992-93 bachelor's degree recipients (table 20) "}, {"section_title": "BORROWING AND LIFESTYLE CHOICES", "text": "Also of interest to policymakers is understanding how students' borrowing to finance their undergraduate education may later influence their lifestyle. Borrowing might affect decisions about marrying and living at home, and might also affect the ability to save money for purposes such as a house or further education."}, {"section_title": "Marriage", "text": "Marrying in the first year after graduation was not related to the existence of outstanding loans. Overall, .7 percent of all 1992-93 bachelor's degree recipients married between the time they graduated and 1994, with the percentages similar for borrowers and nonborrowers (table  36). Those with the highest monthly education loan payment to salary ratio were just as likely as those with lower ratios to marry between graduation and 1994. "}, {"section_title": "Living Arrangements", "text": "About one-quarter (27 percent) of 1992-93 bachelor's degree recipients were living with parents or relatives in April 1994 (table 37). The likelihood of doing so was related to age, salary, and debt burden. Younger and lower income graduates were more likely to be living with parents or relatives. One-third of those who were 24 years or less when they received their bachelor's degree were living with parents or relatives in April 1994, compared with 20 percent of those 25 to 29 years old and 3 percent of those 30 years or older. One-third of those with salaries less than $20,000 were living with parents or relatives, a considerably greater proportion than among those making $25,000 or more. In addition, those with monthly education loan payments amounting to 15 percent or more of their monthly salary were more likely than those with payments amounting to less than 5 percent of their monthly salary to be living with parents or relatives (35 percent compared with 22 percent). Table 37 also shows the living arrangements of graduates who were 24 years or less when they received their bachelor's degree. Among those in this age group whose education loan payments amounted to 15 percent or more of their April 1994 salary, 40 percent were living with parents or relatives."}, {"section_title": "Saving", "text": "About three-quarters of all 1992-93 bachelor's degree recipients who were working full time in April 1994 were saving money: 30 percent were saving to buy a home, 21 percent for further education, 24 percent for retirement, 13 percent to buy a vehicle, and 34 percent for a \"rainy day\" (table 38). Those earning $35,000 or more were more likely to be saving than those earning less than $15,000. Debt burden and the likelihood of saving were generally unrelated. Among bachelor's degree recipients making loan payments, between 71 and 77 percent of those working full time were saving, regardless of the percentage of their monthly salary devoted to education loan payments. Those paying 15 percent or more of their salary for education loan payments were more likely than those paying less than 5 percent to be saving for further education (28 percent compared with 16 percent). The amount saved may have been related to debt burden, but B&B participants were not asked about the amounts they saved.   "}, {"section_title": "SUMMARY AND CONCLUSION", "text": "For two groups-1992-93 bachelor's degree recipients and 1989-90 beginning postsecondary students whose last enrollment ended by December 1992this analysis has examined early labor force participation, borrowing, and the financial and other implications of this borrowing after graduating or leaving postsecondary education. This section summarizes the major findings for each group."}, {"section_title": "1989-90 BEGINNING POSTSECONDARY STUDENTS WHOSE LAST ENROLLMENT ENDED BY DECEMBER 1992", "text": "As with the bachelor's degree recipients, the vast majority of this group (81 percent) were employed in April 1994. Characteristics associated with higher employment rates were being male, first enrolling in postsecondary education at age 19 or younger, being in the highest SES quartile in 1989-90, having last attended at public or private, not-for-profit (rather than private, for-profit) institution, and having attended a 2-year public (rather than less-than-2-year) institution. The average 1993 earned income for this group overall was $16,600. However, there were differences by gender, raceethnicity, occupation, and type of institution attended, all of which are interrelated. The April 1994 unemployment rate for this nonbaccalaureate group-4.7 percent was similar to that of the bachelor's degree recipients. About.three-quarters of the beginning postsecondary students who left postsecondary education or attained an associate's degree or certificate by December 1992 found their jobs within a month. Those who attended a private, for-profit institution were less likely than those who attended 4-year or public 2-year institutions to find their job within a month."}, {"section_title": "101", "text": "Overall, 43 percent of the nonbaccalaureate group borrowed from some source, and 25 percent borrowed through student loan programs. The average amount borrowed ranged from $2,900 at public 2-year institutions to $6,200 at private, not-for-profit institutions. Those who left postsecondary education without a degree or certificate were the least likely to have borrowed through a student loan program. Borrowers were more likely than nonborrowers to report that job security and permanence were very important factors in determining the type of work they planned to do for most of their lives. In spring 1994, 16 percent of the noncompleters and associate's degree or certificate recipients were repaying student loans. For three-quarters of those repaying loans, their debt burden was less than 10 percent; the overall average was 8 percent.  July 1992to September 1992October 1992to January 1993andFebruary 1993 to June 1993. Degree-granting institution SECTOR_B SECTOR_B refers to the type of institution that granted the bachelor's degree to respondent. Institutions were categorized by level, control, and, for 4-year institutions, whether or not they granted PhDs. See the entry for \"First postsecondary institution\" for more detail on types of institutions. Three categories of degree-granting institutions were distinguished in this report: Public 4-year PhD granting and non-PhD granting. Private, not-for-profit, 4-year PhD granting and non-PhD granting. Other Public less-than-2-year; public 2-year; private not-for-profit, less-than-4-year; private for-profit less-than-2-year; and private for-profit, 2-years-or-more."}, {"section_title": "Employment status April 1994 EMPLOY22", "text": "Indicates employment status in April 1994. Respondents were asked about their job history since graduation, including the number of jobs they had held, the beginning and ending dates of the jobs, whether they were employed full or part time in each job, if they had been looking for work (and if so, if they had received unemployment benefits), and if they were not working, the reason. Based on the job history information, monthly indicators were constructed characterizing the monthly employment status of each respondent as: employed full time; employed part-time; unemployed with benefits; unemployed without benefits; and out of the labor force. A job was considered full-time if the respondent reported working 35 or more hours per week. For respondents with multiple jobs, the respondent was considered employed full time if any job they held that month was a full-time job. If they worked at two or more part-time jobs, they were considered part time even if their hours totaled 35 or more per week. Respondents who were not working but looking for work were considered unemployed. For this report, the unemployment categories (with and without benefits) were combined because almost no respondents were receiving unemployment benefits. Respondents categorized as out of the labor force were those who were not available for work and not looking for work."}, {"section_title": "Employment/enrollment status April 1994 ENREMP22", "text": "Indicates enrollment status in April 1994. Indicates the respondent's enrollment and employment status in April 1994. ENREMP22 distinguishes between full-and part-time enrollment. For this report, four categories were used: enrolled (full or part time) and employed; enrolled (full or part time) and not employed; employed and not enrolled; neither employed nor enrolled. BEST COPY AVAILABLE 95 1 0 9 APPENDIX AGLOSSARY Enrollment status April 1994 ENROL22 Indicates enrollment status in April 1994. Respondents were asked about enrollment in any education after receiving their bachelor's degree and the dates of enrollment. Based on these dates, monthly enrollment indicators were constructed with the following values: not enrolled; enrolled full time; and enrolled part time."}, {"section_title": "First postsecondary institution FSCTYPE1", "text": "This variable indicates the type of institution the respondent first attended. Itwas created by looking for the first postsecondary enrollment after high school that lasted three months or longer. Institutions attended before high school graduation were eligible if enrollment continued after high school graduation. The first institution may or may not be the institution that awarded the bachelor's degree. Public 4-year Private, not-for-profit (independent) 4-year Public 2-year Other A publicly controlled institution operated by publicly elected or appointed officials who control the institution's programs and activities, and that grants bachelor's degrees, including doctorate and nondoctorate-granting institutions. An institution controlled by an independent governing board and incorporated under section 501(c)(3) of the Internal Revenue Code and that grants bachelor's degrees, including doctorate and nondoctorate-granting institutions. A public institution, primarily community colleges, with programs at least 2 years in length awarding certificates and associate's degree but not bachelor's degrees. For this report includes private, not-for-profit less-than-4 year; public less-than-2-year; and private, for-profit institutions. Private-for-profit institutions are postsecondary educational institutions that are privately owned and operated as profit making enterprises. These institutions include career colleges and proprietary institutions. Gender RSEX B&B:93/94 respondents were asked their gender only if this information was missing from NPSAS and not obvious during the interview. Respondents were categorized as male or female GPA (4.0 scale) NORMGPA NORMGPA is the normalized grade point average fit to a 4.0 scale, based on student transcripts. Respondents were categorized into two groups: GPA was less than 3.0; and GPA was 3.0 or above."}, {"section_title": "How found April 1994 job AJBOBT_", "text": "Respondents were asked how they found out about their April 1994 job. They could report more than one method. A yes or no response was recorded for each of 14 methods. This report includes the methods reported by more than 5 percent of the respondents."}, {"section_title": "110", "text": "Referred by family, friends, professors AJBOBTO1 Want ad AJBOBTO2 Campus placement office AJBOBTO3 Explored possible job opportunities through interview AJBOBTO4 Employment agency AJBOBTO5 Advancement in company where previous employed AJBOBTO6 Income and dependency level INCOME The source of income for dependent students is their parents or guardians; the source of income for independent students is their own assets or earnings including those of their spouse if they are married. Incomes refer to 1991 income and were derived from three sources: institutional records, parental reports, and student reports (in priority order). Job characteristics important in determining future work"}, {"section_title": "CHOICE_", "text": "Respondents were asked what factors were important to them in determining the type of work they planned to do in the future. A yes or no response was recorded for each of 14 factors. This report included factors that had \"yes\" responses from at least 30 percent of the respondents. Good starting income"}, {"section_title": "CHOICE02", "text": "Good income potential"}, {"section_title": "CHOICE03", "text": "Job security"}, {"section_title": "CHOICE04", "text": "Interesting work"}, {"section_title": "CHOICE06", "text": "Intellectually challenging work"}, {"section_title": "CHOICE07", "text": "Interaction with people"}, {"section_title": "CHOICE09", "text": "Marital status in April 1994 MARSTAT This variable was created using the marital status from NPSAS:93 and reported changes to determine respondent's marital status in April 1994. Categories included: married; divorced; separated; widowed; never been married; or living together in marriage-like relationship. These were grouped into two categories for this report: married or cohabit as married; and never married, divorced, separated, or widowed."}, {"section_title": "Married between 1993 and 1994 MARICH01", "text": "This variable registers any change in marital status between 1993 and 1994. The percentage who said they went from being divorced, separated, widowed, never married, or living together in a marriage-like relationship to being married is identified in the table. Monthly education loan payment as percent of monthly income EDPCT Monthly education loan payments divided by monthly income. See entry for \"Monthly education loan payments.\" Monthly income (MOINC) was calculated by dividing the April 1994 annual salary by 12. EDPCT was also used to calculate average ratio of loan payments to monthly income. When this variable was used in a table or a figure, the table or figure included only respondents with a value of 50 percent or less on EDPCT."}, {"section_title": "ti", "text": "Monthly education loan payments ALLOWE Respondents who were repaying education loans reported the total amount they paid each month. This variable was also used as an average. When this variable was used in a table or figure, the, table or figure included only those whose value for EDPCT was 50 percent or less."}, {"section_title": "Monthly loan payment status ALLOWE2", "text": "This variable describes whether respondents were paying off education loans in 1994, and if not, the reason why not. It was derived from ALLOWE."}, {"section_title": "Payments required", "text": ""}, {"section_title": "No payments required", "text": "No undergraduate debt"}, {"section_title": "Months of graduate study", "text": "Respondent was required to make monthly payments. Respondent was not making monthly payments because he/she had already paid back his/her loans or had deferred loan repayment. Respondent was not making monthly payments because he/she did not take out a loan."}, {"section_title": "ENRLGRAD", "text": "Total number of months of graduate study since bachelor's degree completion. Enrollment may have been full or part time. Graduate study was defined as being in a master's, doctoral, or first professional degree program. Two categories were defined for this report: none; and one or more."}, {"section_title": "Noneducational expenses OTHOWE", "text": "Total amount respondent paid each month on mortgage, rent, auto loan, and any other noneducational debt. This variable was used to compute an average. When this variable was used in a table, the table included only those whose monthly expenses for these items were less than $2,500."}, {"section_title": "Number of months unemployed UNEMPMOS", "text": "The variable was created using the monthly employment indicators. \"Unemployed\" is defined as not working and seeking employment. The variable measures the total number of months unemployed since graduation."}, {"section_title": "Number of schools accepted", "text": "Among respondents who applied to graduate school, the Primary reason for not applying to graduate school ACCEPTED number of schools at which they reported being accepted."}, {"section_title": "REASNAP", "text": "If the respondent did not apply to graduate or professional school, and had considered it, the respondent indicated the primary reason for not applying from among the following choices: "}, {"section_title": "Reason for saving money SAVING_", "text": "Respondents who reported saving money (see entry for \"Saving money\") were asked to respond yes or no for nine different reasons. This report included those for which more than 10 percent responded \"yes.\" Purchase of a home Relationship between April job and degree AJOBRELT Indication of how closely related respondents' primary April 1994 job was to their field of study. See entry for \"Annual salary at April 1994 job\" for definition of \"primary job.\" Three options were offered: closely related; somewhat related; and not at all related."}, {"section_title": "Respondent applied to graduate school", "text": "Indicates whether a respondent ever applied to a graduate school (yes/no)."}, {"section_title": "Saving money EVERAPP SAVINGS", "text": "Respondents were asked if they were saving money for any reason. Positive values on this variable were used to identify the percentage of respondents who were saving money for any reason. Time from postsecondary entry to bachelor's degree BATIME2 Represents the number of months between the date the respondent began postsecondary education and the date of bachelor's degree receipt. If a respondent was missing either date, BATIME2 was set to missing. In a few cases, the value for BATIME2 was less than 30 months; these cases were excluded. BATIME2 was calculated for only those students receiving their first bachelor's in 1992-93. For this report, three lengths of time were distinguished: 4 years or less; more than 4, up to 6 years; and more than 6 years."}, {"section_title": "Total undergraduate debt still owed UNDGROWE", "text": "Respondents who borrowed for their undergraduate education were asked to report the amount they still owed as of interview date."}, {"section_title": "Where living April 1994 WHERELIV", "text": "The respondent was asked in what type of housing he/she was living on April 1, 1994. The options provided were: own house or apartment; with parents or relatives; school-owned housing; employer-provided residence; sorority/fraternity house; or other type of housing. For this report, the last four types were grouped into \"other.\" PART II: BPS VARIABLES Academic year last enrolled LASTENR The last academic year in which the student was enrolled. Age when began postsecondary education AGE8990 AGE8990 indicates the respondent's age when he or she first began postsecondary education. Amount owed on student loans DRVOWEAM Amount the student owed on loans borrowed through student loan programs as of spring 1994. The variable was also used as an average."}, {"section_title": "Average duration of unemployment spells (months) MEANDUR", "text": "The average number months a respondent's spells of unemployment lasted. This variable was derived by dividing the total number of months a respondent was unemployed by the total number of unemployment spells."}, {"section_title": "Average monthly loan payment SFAVGPAY", "text": "For students who reported repaying loans as of spring 1994, the variable represents the average monthly loan payment they had made. When this variable was used in a table, the table included only those whose educational debt burden was 50 percent or less (see EDPCT)."}, {"section_title": "Borrowed for education EVERBOR", "text": "Positive values on this variable were used to identify the percentage of students who borrowed from any source, including family or friends, for undergraduate education."}, {"section_title": "Control of last institution OFCOLAST", "text": "Control of last institution. Aggregates level and control of institution according to control."}, {"section_title": "Public", "text": "Private, not-for-profit Private, for-profit A postsecondary educational institution operated by publicly elected or appointed school officials in which the program and activities are under the control of these officials and that is supported primarily by public funds. A postsecondary educational institution that is controlled by an independent governing board and incorporated under Section 501(c)(3) of the Internal Revenue Code. A postsecondary educational institution that is privately owned and operated as a profit-making enterprise. These institutions include career colleges and proprietary institutions. Respondent's highest degree attained by spring 1994 was an associate's degree. Respondent's highest degree attained by spring 1994 was a bachelor's degree. When this variable was used as a row, the tables included only those whose last spell of enrollment ended by December 1992 and excluded those who attained a bachelor's degree by that date. In those tables, the variable is labeled \"Highest degree attained by December 1992.\" Importance of job security and permanence SCJOBSEC Respondents were asked \"How important are each of the following incentive factors [in determining the kind of work you plan to be doing for most of your life]?\" \"Job security and permanence\" was one of the listed incentive factors. Respondents answered in one of the following ways: not important; somewhat important; or very important."}, {"section_title": "Level and control of last institution OFCOLAST", "text": "Combined level and control of last institution attended. See entries for \"Control of last institution\" and \"Level of last institution.\" Categories used in this report include: Public 4-year; private, not-for-profit 4-year; public 2-year; private, for profit; and other (public less-than-2-year, private, not-for-profit less-than-2-year, and private, not-forprofit 2-to 3-year)."}, {"section_title": "Level of last institution OFCOLAST", "text": "Level of the last institution attended."}, {"section_title": "4-year", "text": "An institution that offers 4-year baccalaureate degrees. These institutions may or may not also offer master's, doctoral, or first professional degrees in one or more programs as the highest degree awarded. APPENDIX AGLOSSARY 2-year An institution whose program of study results in an award or degree below the baccalaureate level, and is at least 2 years but less than 4 years in duration. These institutions include many community and junior colleges. Less-than-2-year An institution whose normal program of study is less than 2 years in duration. Major during last enrollment spell MAJLAST Students' major field of study during last spell of enrollment in a postsecondary institution. Student majored in health, a vocational/technical area, or another technical/professional field. Months after leaving PSE before obtained first principal job TIME2FJ Variable represents the number of months between the students' last enrollment and when they obtained their first principal job. Students who obtained a job immediately after postsecondary education were coded as 0. Students who never worked were coded as missing on this variable."}, {"section_title": "Primary occupation in 1993 OCCUP93", "text": "Occupational category of principal job in 1993."}, {"section_title": "Clerical", "text": "Craftsman/repair, laborer, or machinist Manager/administrator Professional Sales Service Other Raceethnicity BPSRACE This variable was created by combining two items in which respondents reported their race (American Indian/Alaskan Native, Asian, black, white, other) and whether or not they were of Hispanic origin. See entry for \"Raceethnicity\" in Part I for a more detailed description of race."}, {"section_title": "Receiving help with payments SFREHELP", "text": "Positive values on this variable were used to identify students who were receiving help with repaying student loans from parents, relatives, spouse, friends, or employers."}, {"section_title": "APPENDIX B-TECHNICAL NOTES AND METHODOLOGY BACCALAUREATE AND BEYOND STUDY", "text": "The Baccalaureate and Beyond Longitudinal Study (B&B:93/94) tracks the experiences of a cohort of college graduates who received a bachelor's degree during the 1992-93 academic year. It will document this group's experiences in the areas of further education and degree completion, employment, public service, family formation, and other adult decisions for a period of 12 years. B&B:93/94 will provide data that can be used to assess the outcomes of postsecondary education, including graduate and professional program access, labor market experience, and rates of return on investment in education. Participants in the 1993 National Postsecondary Student Aid Study (NPSAS:93) who received their bachelor's degree between July 1992 and June 1993 form the base sample for the B&B study. Approximately 12,500 NPSAS:93 respondents were identified as eligible for the first followup survey, which was conducted between July 1993 and December 1994 (roughly one year after participants' graduation). Approximately 1,500 members of this initial sample were determined to be ineligible at the time of the followup interview, and about 900 others were not interviewed (usually because they could not be located or refused to participate), generating a final sample of 10,080 college graduates. An overall response rate of 92 percent was achieved for the first followup. The survey's methodology report provides additional detail on this survey.' NPSAS:93 was the third administration of the National Postsecondary Student Aid Study (earlier administrations were in 1986-87 and 1989-90). NPSAS was designed to include students enrolled in all types of postsecondary education, and includes students in public; private; not-for profit; and private, for-profit institutions at the 4-year, 2-year, and less-than-2-year levels. NPSAS:93 included a stratified sample of approximately 50,000 students (about 90 percent 'U.S. Department of Education, National Center for Education Statistics, Baccalaureate andBeyond Longitudinal Study: 1993/94 First Follow-up Methodology Report, NCES 96-149, by Patricia J. Green, Sharon L. Meyers, Pamela Giese, Joan Law, Howard M. Speizer, andVicki Staebler Tardino, Paula Knepper, project officer (Washington, DC: 1996).    "}, {"section_title": "EST COPY AVAILA LE", "text": "Comparisons were made in this report only when 13,5_ .05 /k for a particular pairwise comparison, where that comparison was one of k tests within a family. This guarantees both that the individual comparison would have p5. .05 and that for k comparisons within a family of possible comparisons, the significance level for all the comparisons will sum to 1)5.. 05.5 For example, in comparing the percentages of males and females who were enrolled in postsecondary education only one comparison is possible (males versus females). In this family, k=1, and the comparison can be evaluated without adjusting the significance level. When students are divided into five racialethnic groups and comparisons between all five groups are possible, then k=10 and the significance level of each test must be .05/10, or p5 .005. The formula for calculating family size (k) is as follows: k=./(.1 -1) 2 where j is the number of categories for the variable being tested. In the case of raceethnicity, there are five racialethnic groups (Native American /Alaskan Native; Asian/Pacific Islander black non-Hispanic; Hispanic; and white, non-Hispanic). Thus, when substituting 5 for j in equation 2, one gets the following formula:"}, {"section_title": "Adjustment of Means", "text": "Tabular results are limited by sample size when attempting to control for additional factors that may account for the differences observed between two variables. For example, when examining the percentages of those who were continuously employed, it is impossible to know to what extent the observed variation is due to SES differences and to what extent it is due to differences in other factors related to SES, such academic ability, raceethnicity, and so on. However, if a nested table were produced showing SES according to levels of academic ability by raceethnicity, the cell sizes would be too small to identify the patterns. When the sample size becomes too small to support controls for another level of variation, one must use other methods to take such variation into account. 5The standard that p < .05/k for each comparison is more, stringent than the criterion that the significance level of the comparisons should sum to p < .05. For tables showing the t statistic required to ensure that p < .05/k for a particular family size and degrees of freedom, see Olive Jean Dunn, \"Multiple Comparisons Among Means,\" Journal of the American Statistical Association 56: 52-64. ."}, {"section_title": "APPENDIX B-TECHNICAL NOTES AND METHODOLOGY", "text": "To overcome this difficulty, multiple linear regression was used to obtain means that were adjusted for covariation among a list of control variables. Adjusted means for subgroups were obtained by regressing the dependent variable on a set of descriptive variables such as gender, raceethnicity, SES, and so on. Substituting ones or zeros for the subgroup characteristic(s) of interest and the mean proportions for the other variables results in an estimate of the adjusted proportion for the specified subgroup, holding all other variables constant. For example, consider a hypothetical case in which two variables, age and gender, are used to describe an outcome Y (such as completing a degree). The variables age and gender are recoded into a dummy variable representing age and a dummy variable representing gender: (3) To estimate the adjusted mean for any subgroup evaluated at the mean of all other variables, one substitutes the appropriate values for that subgroup's dummy variables (1 or 0) and the mean for the dummy variable(s) representing all other subgroups. For example, suppose we had a case where Y was being described by age (A) and gender (G), coded as shown above, and the means for A and G are as follows: In this case, the adjusted mean for older students is 0.325 and represents the expected outcome for older students who resemble the average student across the other variables (in this example, gender). It is relatively straightforward to produce a multivariate model using B&B and BPS data, since one of the output options of the DAS is a correlation matrix, computed using pairwise missing values.6 This matrix can be used by most commercial regression packages as the input data to produce least-squares regression estimates of the parameters. That was the general approach used for this report, with two additional adjustments described below to incorporate the complex sample design into the statistical significance tests of the parameter estimates. Most commercial regression packages assume simple random sampling when computing standard errors of parameter estimates. Because of the complex sampling design used for the B&B and BPS survey, this assumption is incorrect. One can get a better approximation of its standard errors by multiplying each standard error by the average design effect of the dependent variable (DEFT),7 where the DEFT is the ratio of the true standard error to the standard error computed under the assumption of simple random sampling. It is calculated by the DAS and produced with the correlation matrix. 6Although the DAS simplifies the process of making regression models, it also limits the range of models. Analysts who wish to use a procedure other than pairwise treatment of missing values or to estimate probit/logit models can apply for a restricted data license from NCES. "}]