[{"section_title": "What Did the Study Find?", "text": "The projected impacts of climate change in 2030 vary widely both across climate scenarios and across regions within a single scenario, primarily due to the direction and magnitude of precipitation changes. Farmers' ability to alter crops, rotations, and production practices enables them to lessen the impact of changes in local weather, resource conditions, and price signals. Redistributing production across regions can greatly mitigate the impact of climate change on national agricultural markets. Such redistribution, however, will alter land use and environmental quality. Key fi ndings (with ranges expressed across different climate scenarios) include: • National acreage changes when farmers adapt are relatively small across climate change scenarios (from 0.2 to 1.0 percent compared with the baseline), although acreage changes vary considerably by region. Crop acreage and planting patterns in the Corn Belt and Northern regions, in general, are less sensitive to climate change than in Southern regions, where yield changes have a wider range across crops (for example, acreage changes in the Delta region range from -9.8 to 5.0 percent). Acreage changes indicate considerable capacity in the agricultural system to reallocate crop production in response to shifting conditions. • Although climate change leads to higher prices for corn and soybeans under hotter, drier scenarios as a result of considerably lower national yields, adaptation to climate change dampens the rise in prices for most commodities. • Aggregate national returns to crop production decline with the increasing severity of the climate change scenario. The same trend holds for the Corn Belt, which accounts for over half of all returns to U.S. fi eld crop production. The complex interaction between regional yield changes, markets, and production options-combined with the Corn Belt's large production-creates a larger absolute impact than in other regions, although the percentage decline in returns is smaller than in other regions. Changes in returns vary in the other regions, however, with no direct correspondence to the magnitude of the scenario's temperature and precipitation change. This is due to shifts in the economic attractiveness of crops in regions other than the Corn Belt. • Aggregate impacts of climate change on net returns to crop farmers range from an estimated increase of $3.6 billion to a loss of $1.5 billion per year, under the four climate change scenarios. Spread and redistribution of agricultural pests may reduce these returns by $1.5 billion to $3.0 billion. • Regionally, crop sector impacts from climate change are likely to be greatest in the Corn Belt, with annual losses ranging from $1.1 billion to $4.1 billion across scenarios. Heightened damage from crop pests could lead to additional losses of $400 million to $600 million in that region. Economic effects in other regions may be positive or negative, depending on how well crop rotation and tillage practices accommodate changes in temperature and precipitation and how market-mediated prices change for predominant regional crops. Drought-tolerant varieties increase returns nationally and in regions that plant them, indicating that further development of drought-tolerant varieties could be benefi cial under a wide range of adverse climate changes. • Changes in crop production result in and refl ect changes in crop prices. Soybean markets may be particularly sensitive, with estimated price effects ranging from -4 to 22 percent. Corn prices are estimated to change between -2 and 6 percent, while wheat prices are estimated to decline across all four scenarios. Shifting agricultural pest populations cause the price range to widen and crop prices to increase for all crops except cotton. The availability of drought-tolerant crop varieties is estimated to reduce prices. • Climate change is projected to slightly increase aggregate natural resource and environmental impacts from U.S. agricultural production, although local effects may be more signifi cant. Cropland area is projected to expand 0.2-1.0 percent, while nitrogen fertilizer losses are projected to grow 1.4-5.0 percent. Rainfall-related soil erosion changes range from -0.9 to 1.2 percent above baseline levels. The disproportionate change in nitrogen loss to water relative to acreage expansion refl ects changes in regional crop distribution, input use, and the varying impacts of changes in production practices. This report focuses on how crop farmers will adapt to changing climate conditions and how extensively changing pest pressures and emergent technologies such as drought-resistant crops might alter the benefi ts of adaptation. While interactions between the crop and livestock sectors are included in the analysis, changes in the livestock sector are not the focus of the report. Consumers will likewise be affected by adjustments in both the crop and livestock sectors. Livestock producers will see changes in the prices they pay for feed, and retail food prices will adjust to commodity price changes. Our climate change analysis focused on the yield-related impacts associated with increased average temperatures, regional changes in average precipitation, increased carbon dioxide concentration in the atmosphere, the expanded incidence of pests, and the market-mediated price impacts that arise from regional shifts in crops and practices. Model limitations precluded analysis of yield impacts from the potential increase in extreme weather events, nor could"}, {"section_title": "Introduction", "text": "Agricultural production has always been closely linked with, and vulnerable to, trends in weather. As a result, agricultural production enterprises and practices have adapted to local climatic conditions, and farmers have developed strategies for responding to local weather variability. Corn farmers in the Corn Belt push back planting dates in response to a wet spring, for example, and may switch to soybean production if persistent wet weather delays corn planting excessively. During extremely dry periods, farmers in the Plains States may increase moisture-conserving tillage practices, such as no-till, ridge-till, and mulch-till (Ding, 2009). Local strategies for weather adaptation are based on years of producer experience and farming-system research specifi c to regional conditions. The range of local weather conditions that has shaped the current structure of domestic agricultural production, however, is changing in response to broad shifts in general climatic conditions across the country and around the world. General climatic conditions have adjusted slowly throughout the 20th century, with global average temperature increasing 1.3 degrees Fahrenheit (°F) (IPCC, 2007). As atmospheric concentrations of carbon dioxide (CO 2 ) have increased, the rate of temperature increase appears to be accelerating, and recent climate models predict further warming trends over time that may have a signifi cant impact on local temperature and precipitation patterns. Agricultural productivity, and the degree to which other inputs (such as fertilizer, pesticides, and irrigation) are needed to augment production, depend a great deal on local climate conditions. Increases in average temperature, changes in precipitation patterns, and increases in the frequency of extreme weather events would signifi cantly alter the local production environment through the distribution of crop yields, crop acreage planted to different crops, reliance on dryland and irrigated production systems, and the geographic range and severity of pest outbreaks. Changes in water availability for crop production will be an important factor affecting regional agricultural production. Shifting precipitation patterns in combination with warming temperatures may increase water scarcity in some regions, intensifying competition for water currently used in agriculture. In other areas, increased soil-moisture availability may increase opportunities for agricultural production. Agricultural systems respond to the changing production environment associated with climate change through the process of adaptation. The Intergovernmental Panel on Climate Change (IPCC) defi nes adaptation as the \"adjustment in natural or human systems in response to actual or expected climatic stimuli or their effects, which moderates harm or exploits benefi cial opportunities\" (IPCC, 2007). Agricultural systems adapt to climate change at a number of levels, from national-level investments in agricultural research and development, climate forecasting, or infrastructure to behavioral adjustments of individual farm households. Smit and Skinner (2002) organize agricultural adaptation options within four interdependent categories (table 1): • Technological developments, • Government programs and insurance, • Farm production practices, and • Farm fi nancial management. Types and examples of agricultural adaptation options"}, {"section_title": "Technological developments", "text": "Crop development: • Develop new crop varieties, including hybrids, to increase the tolerance of and suitability of plants to temperature, moisture, and other relevant climatic conditions. Weather and climate information systems: • Develop early warning systems that provide daily weather predictions and seasonal forecasts. Resource management innovations: • Develop water management innovations, including irrigation, to address the risk of moisture defi ciencies and the increasing frequency of droughts. • Develop farm-level resource management innovations to address the risk associated with changing temperature, moisture, and other relevant climatic conditions."}, {"section_title": "Government programs and insurance", "text": "Agricultural subsidy and support programs: • Modify crop insurance programs to infl uence farm-level risk management strategies with respect to climate-related loss of crop yields. • Modify subsidy, support, and incentive programs to infl uence farm-level production practices and fi nancial management. Private insurance: • Develop private insurance to reduce climate-related risks to farm-level production, infrastructure, and income. Resource management programs: • Develop and implement policies and programs to infl uence farm-level land and water resource use and management practices in light of changing climate conditions."}, {"section_title": "Farm production practices", "text": "Farm production: • Diversify crop and livestock types and varieties to address environmental variations and economic risks associated with climate change. • Change production intensity to address environmental variations and economic risks associated with climate change. Land use: • Use alternative fallow and tillage practices to address climate-related moisture and nutrient defi ciencies. Irrigation: • Implement irrigation practices to address the moisture defi ciencies associated with climate change and reduce the risk of income loss due to recurring drought."}, {"section_title": "Timing of operations:", "text": "• Change farm operation timing to address the changing duration of growing seasons and associated changes in temperature and moisture."}, {"section_title": "Farm fi nancial management", "text": "Crop insurance: • Purchase crop insurance to reduce the risks of climate-related income loss."}, {"section_title": "Crop shares and futures:", "text": "• Invest in crop shares and futures to reduce the risks of climate-related income loss. Household income: • Diversify household income to address the risk of climate-related income loss. Source: Adapted from Smit and Skinner, 2002 While adaptation may take many forms throughout the farm economy, this report focuses specifi cally on the potential for adaptation at the fi rst level of response-farmer behavior. Adapting to changing conditions is nothing new for farmers; they regularly adapt to changes in crop demand, new technological developments, farm policy provisions, land development pressure, and, most signifi cantly, weather variability. Changes in individual farmer behavior in response to climate change may include, but are not limited to, growing different crops or crop varieties; adjusting planting and harvest dates; altering input use, such as applied fertilizers, pesticides, and water; adopting new production methods; expanding planted acreage; or abandoning farming altogether. How individual farmers respond to changing conditions is a function of each farmer's location, resource endowment, economic incentives, and knowledge of alternatives. While farming enterprises are likely to adapt in some way to shifting climate conditions, the costs and benefi ts of adaptation may vary considerably depending on the farm's location, the crops grown, and other factors that differ across operations. Similarly, regional impacts of changing climate will not be homogeneous; some regions may see an improvement in crop growth potential, while others may face declining productivity (see box, \"Climate Change Impact on Yields\"). An analysis that focuses exclusively on the average effect of climate change on national production, commodity and food prices, and agricultural trade would mask important regional differences. Climate change that alters the relative profi tability of regional crop production may redistribute production and resource allocations across regions, with potentially signifi cant implications for producer income, resource use, and environmental quality. Assessing the potential impact of climate change on the U.S. agricultural sector requires the ability to differentiate among regional impacts and allow for adaptive behavior that results in shifts within and across production regions in response to changing climate regimes. Historically, genetic enhancement-the combination of biological research, plant breeding, and genetic resources-has played a key role in maintaining and improving agricultural productivity. As agriculture adapts to global climate change, however, genetic combinations that are optimal for current growing environments are unlikely to be optimal for future growing environments. Adaptive genetic enhancement of traits, such as drought and heat tolerance, may offer critical assistance to producers' long-term response to the challenges of climate change. The extent to which changing weather patterns will impact the distribution and severity of pests (Hatfi eld et al., 2008) and invasive species (USDA, 2010a) may also infl uence adaptive decisionmaking strategies in the short and long term. Increased pesticide and herbicide use is one possible response (Bridges, 1992;Joyce et al., 2008). Genetic manipulation of crops to better resist pest and disease infestation is another. Crop distribution may also change, with production of vulnerable crops moving to less risky regions. Fully characterizing the potential agricultural impact of climate change means assessing how crop distributions, yield impacts, and the costs of prevention and control might be affected by regional temperature changes and precipitation levels and associated shifts in agroecological systems. There are several pathways through which the changing conditions associated with climate change are likely to infl uence crop growth and development."}, {"section_title": "Increasing Temperatures", "text": "The impact of increasing temperatures on crop growth will depend on how climate change shifts local temperatures relative to the optimal temperature range for the crop varieties growing in that region. Research suggests that crops may be particularly sensitive to temperature extremes during the reproductive phase, when pollen viability and seed setting are vulnerable to high temperatures (USCCSP, 2008). Higher average temperatures may also result in accelerated crop maturity, as optimal air temperatures for growth occur earlier in the season, which can result in less seasonal growth and lower yield potential. Temperature also has an important effect on crop water demand. Increased crop water requirements under a warming climate may place greater demands on available soil moisture and irrigation water supplies. Actual water demand will depend on other climatic factors as well, including fi eld humidity and shifts in solar radiation caused by changing cloud cover and aerosol concentrations."}, {"section_title": "Changes in Local Precipitation Patterns", "text": "A signifi cant body of research has addressed the impact of climate change on water resources (NWAG, 2000;Thomson et al., 2005;IPCC, 2007;USCCSP, 2008;USDOI, 2011). While General Circulation Models (GCMs) predict a wide range of future precipitation patterns for the United States, some projected precipitation trends have emerged more consistently than others from the modeling literature. Annual precipitation has been projected to increase over much of the Eastern United States and across the middle-tohigh latitudes of the Central and Western United States. 1 In contrast, potential precipitation declines are projected for the Southwest, Central Mountain region, Southern Plains, and Delta region, with the direction of precipitation change less evident across the Southeastern United States and Central Plains. Changes in total precipitation are also projected to be accompanied by interseasonal shifts in the timing of precipitation, with a larger share of precipitation falling in the winter months and smaller amounts in the summer."}, {"section_title": "Increasing Atmospheric Carbon Dioxide (CO 2 )", "text": "Crop yields have been observed to increase with increasing levels of atmospheric CO 2 , though yield response differs by crop. Yield increases associated with increasing CO 2 arise through two pathways: increased rates of photosynthesis and reduced water loss through transpiration. Research suggests that rising CO 2 concentrations that limit plant transpiration through the stomata could help mitigate the increase in crop water stress experienced as a result of higher temperatures (Izaurralde et al., 2003). The transpiration effect (the magnitude of which depends largely on soil moisture levels) operates in all crops. Impacts on crop yields via the photosynthetic pathway, however, operate only in a subset of plants. Plants have two different metabolic pathways for photosynthesis-C 3 and C 4 -but only the C 3 photosynthetic pathway responds to increased atmospheric CO 2 . C 3 crops are therefore projected to have a higher yield response to increased atmospheric CO 2 than are C 4 crops. Among the REAP model's major fi eld crops, only corn and sorghum are C 4 plants; other major crops, such as wheat, soybeans, and cotton, are classifi ed as C 3 crops and therefore are more likely to respond positively to increased atmospheric CO 2 . 2 The U.S. Climate Change Science Program (USCCSP, 2008) reported that a doubling of CO 2 increased estimated yields by approximately 4 percent for corn, 0-8 percent for sorghum, 44 percent for cotton, and 34-38 percent for soybeans. Actual responses to increasing atmospheric CO 2 will depend upon whether crop growth is constrained by other stressors, such as nitrogen or water limitations."}, {"section_title": "Changing Patterns of Pests and Disease", "text": "Changes in the geographic distribution of crop pests and diseases (Hatfi eld et al., 2008) and invasive species (USDA, 2010a;Mooney and Hobbs, 2000;Ziska et al., 2010) as a result of climate change are expected to increase yield losses and management costs. In general, weed species are expected to benefi t more than crop species from increasing temperatures and CO 2 concentration levels, and crop species less able to adapt to changing climatic conditions are expected to be more susceptible to attack by pests. Although the shift in range of particular pests and invasive species will vary, with some expanding and others contracting (Bradley et al., 2009), climate change is expected to lead to a northward expansion"}, {"section_title": "Climate Change Impacts on Crop Yields", "text": "1 These projections are generally consistent with higher levels of recorded precipitation over the latter half of the 20th century (USCCSP, 2008). 2 The quantitative impacts of increased CO 2 on yield are still being discussed in the literature. Most results come from greenhouse or open-top chambers in the fi eld, with only a few experiments conducted through FACE (free-air carbon dioxide enrichment) methods, which may provide results more representative of actual fi eld conditions (Lobell and Burke, 2010)."}, {"section_title": "Continued on page 5", "text": "Individual farmer decisions, when aggregated to the national level, will have consequences on agricultural markets through production levels, trade, and prices and on resource use that affects environmental quality. Production adjustments may involve changes in aggregate land under cultivation; regional cropping pattern shifts, including movement of crops into areas not historically cultivated; changes in the distribution of regional crop rotations; and changes in tillage practices and fertilizer use. This study explores the regional and national implications of such farm-level adjustments for agricultural markets and environmental quality and the net effect of such adjustments on the projected impact of climate change on U.S. crop production."}, {"section_title": "Scope of the Research", "text": "Our research focused on how the crop sector might respond to climate change, specifi cally: • How might farmers adjust land-use and land-management decisions when faced with a new production regime shaped by climate change, and what are the implications for regional expansion and contraction of cropland? • How might negative impacts, such as higher prices to consumers, lower incomes for farmers, and intensifi cation of environmental consequences, be reduced or eliminated through adaptation to climate change? • How might changes in climate and the geographic distribution and severity of pest and disease outbreaks affect crop production and prices for major U.S. fi eld crops? of many damaging pests and diseases. Furthermore, herbicide use and associated costs are expected to increase, not only because of increases in pest pressure, but also because herbicides generally become less effective as temperatures and CO 2 levels rise (Kiely et al., 2004). Control costs and crop losses as a result of weeds, insects, and diseases are therefore expected to increase, especially in northern regions where U.S. fi eld crop production is concentrated."}, {"section_title": "Changes in Soil Fertility and Erosion Rates", "text": "For many years, researchers have speculated that the higher temperatures associated with climate change could accelerate the decomposition of organic matter in the soil, making soil less fertile and quicker to release CO 2 and nitrous oxide (N 2 O) from the soil. As far back as 1938, scientists recognized the importance of soil organic matter to maintain soil productivity and access to plant-available nitrogen and observed an empirical relationship between decreased soil organic matter and increased temperature and/or decreased precipitation (Albrecht, 1938). Recent fi eld research has corroborated that differential impacts of temperature on soil organic compounds may mean that warmer temperatures shift soil molecular carbon composition toward forms of carbon less accessible to plants (Feng et al., 2008). Increased soil erosion may also contribute to soil fertility losses in a warming world. Climate change may impact erosion rates through a number of possible pathways, including increased intensity of rainfall events, shifting incidence of precipitation from snowfall to rainfall, changing soil organic structure, and changes in residue or litter cover due to changing yields, cultivation practices, and decomposition rates."}, {"section_title": "Changes in Climatic Variability and the Incidence of Extreme Events", "text": "Climate modeling assessments also point to an increase in precipitation variability, including increases in extreme weather events, as a potential result of a warming climate. Risk of fl ood damages are likely to rise in basins projected for higher annual runoff or rapid early-season snowmelt runoff (USDOI, 2011). Greater frequency and intensity of storm events would likely increase the potential for pollutant runoff. Evidence also points to increasing drought frequency and severity, particularly across the central and southern tier regions of the United States (USCCSP, 2008;Strzepek et al., 2010). • What impact might advances in crop research and development have on the farm production environment? • How might the response of crop production to climate change impact soil and water quality? We explored climate change's impacts on crop production and the potential for, and possible constraints to, adaptive behavior that addresses those impacts. Our quantitative modeling analysis then empirically examined the implications of altered climate regimes on production patterns and market conditions projected to occur by the year 2030. The quantitative methodology consisted of three phases: • PHASE I: The Environmental Productivity and Integrated Climate (EPIC) model linked projections of future climate conditions to crop yields and other biophysical indicators. Since future climate projections are highly uncertain, we employed climate projections from several models to capture a range of possible climate outcomes. • PHASE II: The Regional Environment and Agriculture Programming (REAP) model was fi rst used to examine regional crop and livestock production, input use, cropping practices, economic returns, and environmental quality based on projected USDA market and production conditions under constant climate conditions (i.e., no climate change). REAP was then used to examine how production, market, and environmental measures behave under the climate change scenarios. To isolate the effect of adaptation, we examined two initial cases assuming climate change: one where farmers are not allowed to adapt by adjusting crop acreage or production practices, and a second where farmers can choose crop acreage, rotation, and tillage in response to climate-induced changes in crop yields. • PHASE III: We refi ned the adaptation case explored in phase two to consider two important issues that may affect behavioral outcomes under climate change. One case estimated possible changes in costs and yields due to a shift in the geographic distribution and severity of pest outbreaks. A second case introduced changes to yields that might result from research and development supporting crop genetic resources for drought tolerance. This research focused on agricultural production in the United States. Our purpose was to illustrate possible regional impacts of climate change within the United States and to explore the potential for existing and proposed production technologies both to mitigate negative impacts and to take advantage of benefi cial impacts of regional shifts in relative crop yield. We recognize, however, that ecosystems across the globe will be affected by climate change, putting additional pressure on international markets and agricultural production systems worldwide through changes in commodity demand, trade patterns, and broader economic conditions. This study does not explicitly incorporate international market changes caused by climate change into its analysis. While REAP's strength lies in the specifi cation of crop production detail for major commodity crops, the model's structure also allows for a limited set of adaptation behaviors within the livestock sector. The model permits livestock producers to change what they feed livestock in order to minimize costs under the new price regimes associated with climate change. The fl exibility of such changes, however, is limited to a pre-existing spectrum of historically observed diet options. New grains, feed meals, and feed combinations that historically have not been used are not included in the set of livestock diet options. Furthermore, the impacts of climate change on the livestock sector are limited to those experienced indirectly through feed markets and increased competition for pasture land; the model does not capture the direct impacts of climate change on livestock productivity and production costs, such as those associated with climate control costs for confi ned livestock production (Key and Sneeringer, 2011). While livestock supply and demand is included in the model, results for the sector are not reported. We fi rst established a baseline scenario that assumes the current climate will prevail through 2030. The \"no climate change scenario\" establishes a baseline pattern of rotation acreages that meets a projected set of yield, production, price, and acreage measures under a set of \"current\" weather conditions, as measured by an average of weather conditions between 1950 and 2000. To measure the impact of climate change on those production patterns, we considered four analytical cases that refl ect differing scopes of potential climate change impact and behavioral response, as shown in table 2. These cases will be described more fully as they are introduced in the report. While not exhaustive, the cases illustrate the implications of different elements of climate change impact and potential opportunities for adaptation across a range of climate change scenarios. Each REAP model region includes a set of available crop rotations that are implemented using one of up to fi ve tillage practices. The combination of region, rotation, and tillage practice is referred to as a production enterprise and represents the basic unit of crop production economic activity in the REAP model. A selection of regionally appropriate production enterprises was derived for each REAP region from 1997 National Resources Inventory (NRI) data. When REAP solves for agricultural production patterns under changed climate, technology, or policy conditions, acreage in each region is distributed among production enterprises based on an assessment of relative rates of return arising from differences in yields, costs, and returns and is further constrained by acreage distribution parameters that capture historically observed patterns of production. (For more information on the REAP modeling framework, see Appendix A.)"}, {"section_title": "REAP Baseline", "text": "To construct a baseline against which to compare the impacts of climate change, REAP's pattern of production enterprises was calibrated to projected agricultural production conditions for 2030, assuming constant climate conditions based on climate variables calculated as a monthly average over 1950-2000(Hijmans et al., 2005. This \"no climate change\" baseline scenario assumes that technology and market conditions will continue to change at historical rates and holds the suitability of a given region to produce crops constant according to a baseline set of weather conditions. Technology and market condition projections in 2030 were extrapolated from USDA's annual agricultural production and market indicator projections (USDA, 2010b). The USDA projections include estimates of planted and harvested acreage, anticipated crop yields, trade volumes, and market prices to 2030 (table 3). The projections assume that agricultural policies remain constant and that improvements in crop yields grow at a fi xed rate. Yield estimates for the baseline case were calculated by fi rst running EPIC under the \"current\" weather conditions. EPIC yields were then adjusted, using a crop-specifi c adjustment factor, to meet projected average yields for 2030 to capture assumptions about exogenous increases in crop productivity. The baseline projections do not consider the likelihood of shocks to agricultural production from extreme weather or changes over time in other economic conditions, such as energy prices, incomes, or exchange rates that might affect exports, imports, or input prices."}, {"section_title": "Characterizing the Study's Climate Projections", "text": "There are various sources of uncertainty associated with generating estimates of future local weather conditions suitable for agricultural production impact analysis. Most signifi cant among these are: • The rate at which carbon and other greenhouse gases (GHG) are expected to be emitted into the atmosphere in the coming decades; • The effects of that GHG accumulation on climate dynamics and core average climate variables, such as temperature, precipitation, and relative humidity; and • Our capacity to downscale geographically coarse average climate projections into local projections for temperature, precipitation, and other variables that refl ect daily weather changes across a fi ner spatial and temporal scale. The IPCC Special Report on Emissions Scenarios (SRES) addressed the fi rst source of uncertainty. The report defi ned several emissions scenarios that refl ect different sets of assumptions about global population change, technology adoption, energy use, and macroeconomic conditions. The uncertainty surrounding carbon dynamics and climate response is refl ected by a wide array of models that attempt to project future climate trends. These models-general circulation models (GCMs)-differ from one another in the numerical methods used, as well as in the spatial resolution at which climate projections are made. As a result, different models may vary considerably with respect to predictions of the magnitude and direction of precipitation and temperature change for given points or regions. Each of the IPCC scenarios represented an estimated future path of CO 2 emissions that can be used as emissions input data into a GCM. Atmospheric CO 2 levels are an important driver of many long-term climate phenomena, so the various emissions scenarios result in different long-term climate projections. This analysis used climate projections derived from a single emissions scenario-the SRES A1B emissions scenario-which was designed to refl ect \"very rapid economic growth,\" \"the rapid introduction of new and more effi cient technologies,\" and a balanced portfolio of energy sources that included both fossil fuels and renewable energy technologies (IPCC, 2007). The SRES A1B emissions scenario represented a middle ground between other illustrative scenarios. Because this research focuses on an analysis year (2030) that occurs prior to signifi cant divergence in emissions levels across the different scenarios, sensitivity analysis of results across the different emissions scenarios was not considered a high priority. In contrast, the signifi cant variability across GCM results using a single emissions scenario suggested a need to explore climate projections across a number of models to capture a range of possible climate impacts arising from a single projected path of emissions. \"Downscaling\" refers to the process of translating the large-scale climate information that emerges from GCMs into fi ner temporal and spatial resolution. There are several methods available for downscaling GCM output; the downscaled data used in this study were generated by Jones, Thornton, and Heinke (2009). Each of the four datasets represents output from a different GCM running the SRES A1B emissions scenario (table 4). For more information on the climate projections and how the downscaled data were aggregated to regions suitable for the REAP analysis, see Appendix B. Figure 2 shows the variation in mean annual maximum temperature and precipitation change between the base period and 2030 for each of the four climate projections across REAP regions. The Model for Interdisciplinary Research on Climate (MIROC) represented the most extreme change from the base period, in that it demonstrated the largest temperature increase and the most negative precipitation change. The Commonwealth Scientifi c and Industrial Research Organisation (CSIRO) and Max Planck Institute's ECH scenarios represented the mildest change projections; both predicted a similar range of temperature increases across REAP regions, but the ECH scenario predicted slightly wetter conditions relative to the CSIRO projections. The Centre National de Recherches (CNR) projection was highly variable in both temperature increase and precipitation change across the REAP regions and represented a moderate national projection in terms of the severity of climate change predicted among the scenarios considered. While the magnitudes of shifts in maximum temperatures differed across GCMs, regional patterns of temperature impact were somewhat similar (fi g. 3). The models generally projected the most moderate temperature increases in the West and Southeast and more signifi cant temperature impacts in the Midwest and Northeast. That pattern of impact was roughly consistent with a composite of multiple IPCC model simulations generated for North America, which projected temperature increases from approximately 1 degree Celsius (ºC) in the Southeast to more than 2 ºC in northern Canada, with intermediate values over the rest of the contiguous United States (USCCSP, 2008). In contrast to the consistent pattern of relative temperature impacts, there was little consistency in precipitation-change projections across GCMs Table 4 General circulation models adopted for use in this study (fi g. 4). Some regions exhibited an increase in precipitation according to some models and a decrease in precipitation according to others. A few regions demonstrated a consistent direction of impact across models; the Pacifi c Northwest exhibited an increase in precipitation across all models, while the Texas/Louisiana region exhibited a decline in precipitation across all models. Nevertheless, even regions with a consistent direction of impact exhibited a wide range of estimated magnitudes across GCMs. Because there is no basis with which to assign probabilities to climate outcomes predicted across GCMs, crop yield impacts, adaptation potential, and aggregate system impacts were calculated and presented independently for each of the illustrative climate projections."}, {"section_title": "Quantifying Climate Change Impacts on Crop Yields", "text": "Climate change is expected to impact crop growth and development through a number of pathways (see box, \"Climate Change Impacts on Crop Yields,\" p. 4). In this analysis, climate change impacts on crop yields were estimated using EPIC-a fi eld-scale biophysical model that uses a daily time step to simulate crop growth, soil impacts, hydrology, nutrient cycling, and pesticide fate under various cropping systems (e.g., tillage, crop rotation, soil and nutrient management) and weather scenarios. A random weather generator built into EPIC uses the average monthly climate information derived from the GCMs-minimum daily temperature (TMIN), maximum daily temperature (TMAX), and precipitation (PRCP)-to generate daily temperature and precipitation patterns for simulated crop growth in each REAP region.  To represent a range of possible weather scenarios associated with each GCM's set of average monthly estimates, simulation results were run 10 times for 20 years, using a different random weather seed for each run. Results from the fi rst 10 years of each run (a total of 100 years) were discarded to minimize the impact of initial soil conditions on yield and environmental impact estimates. Results from the remaining 100 years were used to calculate the average yield and environmental impact results associated with each production enterprise. Because variability estimates for future weather cannot be derived from either the original or the downscaled GCM climate output, weather variability-and therefore the incidence of extreme weather events-was held constant in this analysis across the baseline and future weather scenarios. For each production enterprise, EPIC was used to calculate a set of yield and environmental impact measures associated with region-specifi c weather assumptions and four sets of regional soils differentiated by highly erodible, non-highly erodible, with tile drainage, and without tile drainage. To calculate the impact of the climate change scenarios on crop growth in each region, the crop growth parameters and geophysical process parameters used in EPIC's simulations were held constant across the estimates generated using the baseline climate conditions and the projected climate conditions emerging from the GCMs. In moving from the baseline to the climate change projection scenarios, however, we assumed that ground-level CO 2 concentrations increased from 381 parts per million (ppm) in the baseline to 450 ppm across GCM projections. EPIC calculated the impact of the increased atmospheric CO 2 effect using a nonlinear plant response equation with crop-specifi c parameters (see Appendix C for a more detailed discussion of the impact of increased atmospheric CO 2 levels in this analysis). The only other variables that differed between the baseline and the climate change yield estimates were the TMIN, TMAX, and PRCP variables."}, {"section_title": "Quantifying the Impacts of Climate Change and Adaptation Behavior Using REAP", "text": "Climate-induced changes in agricultural production were assessed by substituting into REAP the yield and cost estimates for production enterprises that were estimated in EPIC using new, regionally variable climate conditions associated with climate projections. Yield estimates were again adjusted (by the same crop-specifi c adjustment factor) to account for exogenous increases in productivity up to 2030. Because climate change affects crops and regions differently, the relative productivity and economic value of regional production enterprises will change under the projected climate scenarios. Production enterprises that are economical under one climate regime may not be economical under another. Our analysis showed that in each climate change scenario, several historically established crop rotations were no longer economical to employ, possibly because the enterprise was marginally economical in the baseline and was sensitive to climate-induced changes in yield or price. Another economic driver may be that changes in other crop yields and/or prices make them more favorable to produce and force out crop rotations that do not experience improved yields or increased prices. Optimizing agricultural production levels and patterns under projected climate conditions produced a new pattern of production enterprises that refl ected changes in regional production levels, including shifts among crops, crop rotations, tillage used, and expansion or contraction of cropland."}, {"section_title": "Quantifying the Additional Impacts of Pest Distribution Change", "text": "Pests and diseases reduce crop yields through several means. Weeds often reduce yields by competing for external resources. Generally, there are few genetic sources of host plant resistance to weeds, with the exception of parasitic weeds that invade the roots of crop plants. Host plant resistance to insects is more common in fi eld crops, and host plant resistance is even more important in fi eld crops for many plant diseases, particularly fungal diseases. Whether measured in pounds of active ingredient or in pesticide costs, herbicides are the most widely used chemicals in U.S. fi eld crop production. Insecticide use has been common in corn and cotton. Fungicide use is quite low in fi eld crops, although it is much higher in fruits and vegetables (Osteen and Livingston, 2006;Padgitt et al., 2000). Global climate change, at least in terms of average annual temperature, will have the effect of making production conditions in northern U.S. regions more similar to production conditions in southern regions. In southern regions, problems with pests, especially weeds-the most important type of crop pest in terms of pesticide expenditures and yield losses-are much more severe (Bridges, 1992). In this analysis, the assumption of a temperature change-induced migration of pest costs and impacts was used to estimate the potential additional pest-related impacts on yield losses and production patterns associated with changing climate conditions. Our analysis assumed that temperature is an important factor driving changes in the geographical distributions of pests and invasive species. This was a reasonable assumption for many biological organisms because average temperatures during winter months are important determinants of overwintering survival rates and because average annual temperatures are correlated with average temperatures during winter months (Hatfi eld et al., 2008). Changes in precipitation patterns also guide changes in the distribution of pests and invasive species. Estimating the direct impact of precipitation changes with consistency, however, was beyond current modeling capacity. We instead focused on estimating the direct effect of average annual temperature changes, while accounting for annual weather variation over time and space. We began by estimating quadratic relationships between average annual temperature and latitude for the REAP crop production regions for 2000 and 2030 based on CNR, CSIRO, ECH, and MIROC temperature projections. These estimates were then used to estimate the percentage shift in each region's latitude centroid-the latitude at the center of the region-associated with the respective temperature change projections. Those percentage shifts were used to characterize the extent of each region's southward movement in latitude-temperature space (see Appendix D for more information). We then used Agricultural Resource Management Survey (ARMS) 1 data for barley (2003), corn (1996, 2001, 2005), cotton (1997, 2003, 2007), oat (2005), rice (2000, 2006), sorghum (2003), soybean (1997, 2002, 2006), and wheat (2004) producers to estimate linear relationships between real pesticide expenditures per acre and latitude for each crop, while accounting for weather variation over time and 10 USDA National Agricultural Statistics Service (NASS) crop production regions. 2 The estimates from this model were combined with the estimates used to characterize the southward movement of the REAP regions in latitude-temperature space (Appendix D, Generally, both yield loss and pesticide use increase with pest pressure (Livingston, Carlson, and Fackler, 2004;Hatfi eld et al., 2008). Because observations on yield loss due to pests are not available in the ARMS data, percentage yield-loss impacts were specifi ed as a constant multiple of the percentage pesticide-expenditure impacts. The constant multiple was the elasticity of yield loss with respect to pesticide applications (0.97), which was based on estimates of a yield-loss function for cotton reported by Livingston et al. (2007). While the elasticity of yield loss with respect to pesticide applications likely varies by crop-as well as over time, as new pesticides and genetically engineered (GE) crop varieties become available-we used the estimate for cotton to specify yield-loss impacts for all crops because cotton was the only U.S. crop for which reliable yield-loss estimates due to pests were reported. This method implicitly assumes that the shares of pesticide expenditures and yield losses associated with domestic and invasive pests, and the rate of introduction of new invasive species, would not change during 2000-30 relative to 1996-2007. These assumptions were necessary because information was not available to determine the allocation of pesticide expenditures across both pest categories in the ARMS data and because impacts of climate change on invasive species introductions are diffi cult to predict. Estimates suggest that with changes in the distribution of pest populations for each climate-change scenario, pesticide expenditures and yield losses would increase for barley, corn, oats, sorghum, soybeans, and wheat; decline for cotton; and remain fairly constant for rice (table 5). The estimates 1 ARMS is a joint project of USDA's Economic Research Service and the National Agricultural Statistics Service. Visit http://www.ers.usda.gov/ Briefi ng/ARMS/ for more information and to download summary statistics based on these data. 2 Observations on average annual temperature and precipitation were not available in the ARMS data; therefore, we used a time index and NASS production-region fi xed effects to account for annual weather variation over time and space. We used the results reported in appendix table 6 to specify the pesticide-expenditure and yieldloss impacts used in the analysis. suggest that the largest impacts would occur in oats, which could experience increases in pesticide expenditures between 6 and 13 percent (for CSIRO and MIROC, respectively). The least deleterious impacts would occur in corn, which might experience increases in pesticide expenditures between 2 and 5 percent (for CSIRO and MIROC, respectively)."}, {"section_title": "Quantifying the Impacts of Drought-Tolerant Varieties", "text": "To complement the analysis of adaptive behavior of agricultural producers, we analyzed a case that represents the potential for technical change to provide additional adaptation opportunities and the implications of those opportunities on the magnitude or pattern of climate change impacts. There are many promising avenues of research on plant genetics, soil management, and inputs to production that may lead to advances that mitigate climate change impacts. We did not attempt to describe all the possible benefi ts of such research. We considered an illustrative case that introduces varieties for selected crops that can maintain yields under conditions of reduced precipitation, so-called \"drought-tolerant\" varieties, thereby reducing yield losses due to climate change for some crops in regions with low precipitation.  Livingston et al. (2007)."}, {"section_title": "Quantifying the Agricultural Impact of Climate Change and the Potential for Agricultural Adaptation", "text": "Applying information about the yield impact of climate change across projected production patterns in the United States is a straightforward, if naïve, approach to estimating the potential economic impact of climate change. This method assumes an unrealistic future in which farmers' yields and returns are affected by climate change, but farmers fail to adapt their production decisions to changing climate conditions. Nevertheless, illustrating just such a scenario allows us to visualize regional and crop differences in the biophysical impacts of climate change and, as described later, to differentiate changes that take place in the agricultural sector due to biophysical impacts from those resulting from dynamic behavioral adaptation. We fi rst illustrate a \"no adaptation\" case and then provide the results of a more comprehensive assessment of climate change impacts, incorporating the impacts of farmer adaptation decisions in determining production and price patterns under changed climate conditions. A comparison between the \"no adaptation\" and \"adaptation\" cases illustrates the benefi ts of adaptation."}, {"section_title": "Climate Impact Analysis: No Adaptation", "text": "\"No adaptation\" case results were derived by putting new yield numbers into REAP but prohibiting the model from adjusting projected 2030 baseline acreage, tillage, or rotation allocations to crop production activities in response to the new climate-adjusted yields. REAP then used the baseline (i.e., no climate change) production patterns, together with the adjusted yield and environmental impact information, to calculate crop production, farmer income, price impacts, and environmental impacts under each future climate scenario. Note that, for this case, REAP eliminated farmer adaptation but retained the fl exibility to adjust the livestock sector, most notably with respect to its demand for feed grains, in response to changed production and price patterns. Changes in national productivity by crop due to climate change, assuming no adaptive behavior on the part of farmers, are shown in fi gure 5. These crop yield averages refl ect the average impact of climate change on individual production enterprises (i.e., region/rotation/tillage combinations) weighted by the amount of crop acreage in that production enterprise, which remained constant across the climate projections in this case. Several interesting climate effects on crop productivity are evident here. Climate change impacts were most negative for corn and soybean productivity, though the least extreme scenario (ECH) produced an increase in crop yields for both. Several other crops experienced crop productivity increases for some or all of the scenarios, though the yield increases associated with the more extreme climate change scenarios (MIROC and CNR) were generally lower than those associated with the milder scenarios (ECH and CSIRO). While the impact of any temperature increase was generally negative, positive crop productivity impacts can arise both from benefi cial precipitation changes (increases in water-constrained regions) or from the CO 2 fertilization effect projected when atmospheric carbon dioxide concentrations increase from 381 to 450 parts per million (ppm). For several crops, the latter positive effects outweighed the negative temperature-related losses for some or all of the projected climate projections. 3 Aggregating crop productivity impacts at the national level, however, masked considerable variability in both crop productivity by region under the baseline and in regional impacts on productivity under the climate change scenarios. Disaggregating the results for corn to the level of the farm production region produced the results shown in fi gure 6. While the productivity results for the Corn Belt drove the pattern of national averages shown in fi gure 5 (because the Corn Belt accounts for 53-56 percent of U.S. corn production under these scenarios), there were regional differences in corn's response under a given climate scenario. In some regions, one or both of the milder climate change scenarios actually increased corn yields. Furthermore, corn production increased under even the extreme climate scenarios in the minor cornproducing regions of the Pacifi c and Mountain States and the Southern Plains region. A portion of corn production in those regions is irrigated and, therefore, less sensitive to precipitation losses from climate change but also mildly responsive to carbon dioxide fertilization gains. In a situation with fewer interacting parts, price results might mirror productivity results; when national average crop productivity decreases (increases), the price of that crop increases (decreases) (fi g. 7). Since crop and livestock markets are integrated, however, this simple dynamic did not play out for several crops and climate scenarios. Because corn prices go up in every scenario, there was always an incentive to substitute away from corn in livestock diets, which has implications for the price of other grains and feed meals. The signifi cant corn price increases in the CNR and MIROC  scenarios, in particular, appeared to pull up soybean, oat, sorghum, and barley prices, despite fi eld productivity increases for some of those crops. Productivity, and therefore supply, of oats increased under every scenario, but prices also increased under all but the ECH scenario. Similarly, barley's substitutability with the other feed grains in livestock diets led to increased The productivity impacts illustrated in this section refl ect only EPIC's yieldchange calculations based on changing climate conditions, while the price impacts refl ect a limited set of interacting demand-and-supply forces across agricultural sectors. Projecting potential climate change impacts on the crop sector, however, requires a more comprehensive analysis to capture how farmers may respond to biophysical impacts in their production decisions. In the following sections, we discuss how farmers might adapt to the biophysical impacts of climate change and the implications of such production adjustments for aggregate crop production, prices, agricultural acreage, and a suite of environmental indicators under changing climate regimes."}, {"section_title": "Climate Change Impacts When Farmers Adapt Crop Rotations, Tillage, and Land Use", "text": "The economic value of planting specifi c crops in each region changed in response to the new production conditions, since yields and costs did not change uniformly in magnitude or direction for all regions in our scenarios. In some regions, adaptation to climate change resulted in reduced planted acreage, while planted acreage in other regions increased. Regional production effects refl ected both changes in yield and planted acreage. Differences in production levels, coupled with demand response to substitute crops, in turn drove changes in crop prices. The combination of changes in acreage, yield, and price infl uenced the degree to which farm revenues responded in a region. In this section, we report results from the REAP model that describe the economic and environmental impacts of the climate change scenarios on U.S. crop production, taking into account how farmers may adjust their crop and tillage decisions. The results are shown relative to the baseline projection (assuming no climate change) for U.S. agriculture in 2030."}, {"section_title": "Regional Shifts in Planted Acreage for Selected Crops", "text": "Each of the four climate change scenarios demonstrated a small increase in total planted acreage compared with baseline acreage levels, though there is variability in the direction of acreage change by region (fi g. 8). The total acreage change, though relatively small compared with the baseline acreage, was composed of changes in the acreage planted to individual crops. The individual crops showed a much wider range across climate change scenarios, following differences in productivity and regional redistribution (table 6). Corn acres increased in all scenarios, refl ecting the decline in corn yields (see fi g. 5) and the need for additional acreage to compensate. Response of other crops varied by scenario, with the ECH and CSIRO scenarios showing a reduction in wheat acres that corresponds to the larger wheatyield increases in these scenarios. Soybean acres declined in the CNR and MIROC scenarios; despite higher soybean prices, acreage decline likely refl ects a decrease in the relative returns to soybean production arising from the signifi cant yield decline under the warmer climate scenarios. The corresponding corn price increase in the MIROC scenario keeps soybean acres from declining further as soybeans are often produced in rotation with corn, particularly in the Corn Belt.  Changes in total regional planted acres from \"no climate change baseline\" See table 4 for the sources of the CNR, CSIRO, ECH, and MIROC models. Source: USDA, Economic Research Service calculations.\nAdaptation includes the various strategies farmers use to adjust their production decisions (e.g., shifts in crops or crop rotations) in response to absolute and relative changes in yield and management costs. Figure 14 illustrates the redistribution of planted acreage that resulted from adaptation for this analysis. In most region/scenario combinations, adaptation led to an increase in corn acreage (fi g. 15). Failing to adapt (no adaptation case) restricted the supply of corn, which led to higher consumer prices. When farmers are permitted to adapt, they respond to high corn prices by changing production in favor of corn. Thus, farmer behavior can moderate climate change impacts on production by diverting productive resources to crops whose loss most negatively impacts other farm-sector stakeholders.\n"}, {"section_title": "ECH MIROC CSIRO CNR", "text": "5.9% to 8.5% 3.3% to 5.9% 0.7% to 3.3% -2.0% to 0.7% -4.6% to -2.0% -7.2% to -4.6% -9.8% to -7.2% Even though total U.S. acreage planted increased in all scenarios, no individual region showed an increase in planted acreage across all scenarios. While the variation in total acreage change was small across scenarios from a national perspective, the regions showed different degrees of response. Acreage in the Corn Belt was the least sensitive to climate change, with total changes ranging from -2.7 to 1.4 percent. In contrast, the Delta region showed a range of change between -9.8 and 5.0 percent. The sensitivity to change refl ects the capacity of the region to economically shift to a different crop mix, indicating crop and production practice substitution possibilities and the larger regional yield changes relative to the national changes for each crop. Figures 9-11 illustrate the change in planted acreage by climate change scenario for the three major fi eld crops (corn, wheat, and soybeans). As with the national total, corn acreage in the Corn Belt was the least sensitive (-1.3 to 1.1 percent). For each of the other regions, at least one scenario demonstrated at least a 10-percent change in acreage from the baseline. The Southern Plains increased corn acreage in all scenarios, with the Delta and Pacifi c regions reducing corn acres in all scenarios. Changes in regional planted corn acres from \"no climate change baseline\" See \nThe Corn Belt also showed the smallest change in wheat acres (0.4 to 2.4 percent). The Lake States and Corn Belt increased wheat acres in all scenarios; all other regions showed both increases and decreases across scenarios. Climate change induced soybean acres to move into the Northern and Southern Plains (see fi g. 11). Once again, the Corn Belt showed the smallest range in soybean acreage change (-5.6 to 0.8 percent); by contrast, change in soybean acres in the Delta region ranged from -19.2 to 11.4 percent. Corn acreage increased in the combined Northern regions (Corn Belt, Lake States, Northern Plains, and Northeast) in all scenarios, while corn acres in the combined Southern regions (Appalachian, Delta, Southeast, and Southern Plains) declined in the ECH and CSIRO scenarios and increased in the CNR and MIROC scenarios. The same relationship holds for wheat acres. Taken as a group, the Southern regions were more sensitive to weather-induced yield change than were the Northern regions. This trend was indicative of the larger range in EPIC-derived yields in the Southern regions under the climate change scenarios. Changes in regional planted wheat acres from \"no climate change baseline\" \n\n\n5.9% to 8.5% 3.3% to 5.9% 0.7% to 3.3% -2.0% to 0.7% -4.6% to -2.0% -7.2% to -4.6% -9.8% to -7.2%\n33.0% to 46.2% 19.8% to 33.0% 6.7% to 19.8% -6.5% to 6.7% -19.7% to -6.5% -32.9% to -19.7% -46.1% to -32.9% Table 12 Direction of change in returns to crop production from \"no adaption case\" to \"adaptation case,\" by region in acreage in all scenarios, suggesting that climate change adaptation induced crop production to shift into areas and production practices with greater water-quality impacts. Climate change-induced crop reallocation, however, signifi cantly reduced nitrogen loss in the Pacifi c and Mountain regions while resulting in substantial increases in the Southern Plains and mixed impacts in other regions (fi g. 16). Even the more extreme scenarios showed regions where nitrogen loss declined, despite a 1.8-to 3.6-percent increase in losses nationally (table 13). Regional impacts on soil loss to water erosion followed a similar pattern to that of nitrogen loss (fi g. 17), although the national change in the erosion measure was similar to, not greater than, the national acreage change.\nAn increase in pest prevalence uniformly reduced yields across all crops (except cotton and, to a lesser extent, rice) in all regions. Thus, while the climate change scenarios described in the previous section showed some regions with yield increases for some crops, increased pest presence eliminated some, if not all, of those yield increases and reduced even further the projected yields that declined under climate change. The geographic and crop-specifi c nature of pest impacts led to differing implications for regional crop production. Table 14 shows the national outcome on total acreage for select crops when farmers account for yield and cost effects from increased pests. All scenarios showed an increase in total acreage planted to compensate for the yield reductions from increased pests. The two higher temperature-change scenarios-CNR and MIROC-exhibited the largest acreage impact. For soybeans, there was a general decrease in acreage, except in the highest temperature-change scenario. Regional acreage changes varied for select crops. Pest changes reduced acreage for all crops in the Corn Belt, whereas other regions had a mixed response (fi g. 18). Corn acreage increased in all regions except the Corn Belt, where acreage remained fairly constant (fi g. 19). Wheat acreage changes varied regionally, with acreage declining generally in the North Central United States and increasing in the West and Southwest (fi g. 20). Wheat became more important in the Southeast in the CNR and MIROC scenarios. Soybeans shifted away from the Corn Belt and into the Northern and Southern Plains in all scenarios (fi g. 21).\nNote: The Pacific region's acreage change was greater than 10 percent in ECH, CSIRO, and MIROC. See table 4 for the sources of the CNR, CSIRO, ECH, and MIROC models. Source: USDA, Economic Research Service calculations.\n7.0% to 8.5% 5.6% to 7.0% 4.2% to 5.6% 2.7% to 4.2% 1.3% to 2.7% -0.1% to 1.3% -1.6% to -0.1% to the climate conditions because of the relatively smaller temperature range across climate scenarios compared with other regions.\n\n\n"}, {"section_title": "ECH MIROC CSIRO", "text": "\n\n\n\n"}, {"section_title": "CNR", "text": "\nreturns increased signifi cantly in all scenarios. Returns to other crops varied by scenario. Returns in the Corn Belt mimicked changes in precipitation and temperature, whereas returns in other regions did not necessarily mirror the same trend (table 9). The more extreme scenarios generally led to lower returns, but not for all regions. Nationally, the milder scenarios led to an increase in returns, whereas the more extreme scenarios led to a decline in returns. From the perspective of crop returns, the Southern Plains was the most robust, even though the regional change in acreage was large compared with other regions. This result refl ects the relatively higher returns to cotton production under climate change, and the ability of farmers in the Southern Plains region to reallocate production resources to minimize the regional impact on profi tability.   \n-13.1% to -9.2% -9.2% to -5.2% -5.2% to -1.3% -1.3% to 2.7% 2.7% to 6.6% 6.6% to 10.6% 10.6% to 14.5% scenario, and the results were compared with the climate change scenario results for the case where additional pest impacts were not considered, allowing us to examine the additional contribution of climate change-induced pest pressure to potential changes in agricultural production and commodity markets. Change in total U.S. planted acreage and select environmental measures from \"no adaptation case\" to \"adaptation case\"  Regional change in sheet and rill erosion from \"no adaptation case\" to \"adaptation case\" See \n\n-2.2% to -1.5% -1.5% to -0.9% -0.9% to -0.2% -0.2% to 0.4% 0.4% to 1.1% 1.1% to 1.8% 1.8% to 2.4%"}, {"section_title": "Changes in Crop Prices and Regional Farm Revenue", "text": "Crop price changes were highly scenario-specifi c, although there were some features common to the results. The CNR and MIROC scenarios led to higher corn and soybean prices than under the baseline, whereas the CSIRO and ECH scenarios generally resulted in lower prices (except for a small price increase in soybeans in CSIRO) (table 7). Corn and soybean yields were lower in the CNR and MIROC scenarios in all regions, while the CSIRO and ECH scenarios showed increased yields in some regions. Wheat prices declined in all scenarios. Wheat and corn prices were generally less sensitive to changes in climate than soybean prices, mainly as a result of smaller projected sensitivity of wheat yields to temperature and rainfall and the poor substitutability between wheat and corn in the diets of livestock within REAP. While REAP's existing diets refl ect feed combinations that historically have been used in the livestock sector, signifi cant feed price changes may induce changes within the livestock sector in popular diet combinations. Our analysis did not capture that dynamic. Climate change reduced returns to corn in all scenarios relative to the baseline, although less so in the higher temperature/precipitation change scenario, where price increases helped support producer revenue (table 8). Because of the positive effect of climate change on cotton yields, cotton  \nAlthough national welfare (the sum of economic benefi ts to consumers plus benefi ts to producers) increases when farmers have the fl exibility to adapt, the benefi ts of adaptation differ across regions and between consumers and Regional change in total nitrogen loss to water from \"no climate change baseline\" See table 4 for the sources of the CNR, CSIRO, ECH, and MIROC models. Source: USDA, Economic Research Service calculations. -10.3% to -5.5% -5.5% to -0.7% -0.7% to 4.1% 4.1% to 8.9% 8.9% to 13.7% 13.7% to 18.5% 18.5% to 23.3%\nAdditional pest pressure resulted in price increases compared with the \"adaptation case\" without pest effects for all crops (except cotton) (table 15). Corn and soybean price changes were greater than the changes in wheat price in all scenarios. Regional and national returns to crop production were also affected (table 16). Additional increased pest pressure reduced returns from the adaptation-only level in all scenarios. The magnitude of the changes in returns associated with additional pests increased as the scenarios became more extreme, indicating that additional pests compound the temperatureand precipitation-induced yield changes as climate diverged from current conditions. In the Corn Belt, the impact of additional pests was insensitive  4.8% to 6.0% 3.7% to 4.8% 2.6% to 3.7% 1.5% to 2.6% 0.4% to 1.5% -0.7% to 0.4% -1.8% to -0.7% Regional change in planted corn acres from 2030 climate change scenarios as a result of changes in pest distribution"}, {"section_title": "24.0% to 31.2%", "text": "16.8% to 24.0% 9.6% to 16.8% 2.4% to 9.6% -4.8% to 2.4% -12.0% to -4.8% -19.2% to -12.0%"}, {"section_title": "Changes in Environmental Outcomes", "text": "Shifts in crops and production practices as a result of climate-induced changes in crop yields will have an infl uence on the environmental impacts associated with agricultural production. Changes in total acreage, in tandem with the redistribution of crop rotation/tillage practices, will affect regional soil and water quality through nutrient loss and soil erosion. Increases in environmental impacts caused by acreage expansion in one region may not be offset by acreage decreases in other regions, resulting in aggregate national increases in water quality impacts. Table 10 depicts the changes in nitrogen loss (leaching and runoff to ground and surface water) and rainfallrelated soil erosion (specifi cally sheet and rill erosion) compared with the baseline, along with the change in U.S. planted acres. Total nitrogen lost to water (measured as nitrogen deep percolation and runoff at the fi eld edge) increased in all scenarios, which follows from the general increase in acreage nationally. Increased nitrogen loss was not uniform across the country, with the MIROC scenario resulting in the most widespread changes (fi g. 12). The Corn Belt, Northern Plains, and Southeast regions all increased nitrogen lost to water in all scenarios. Soil lost to water erosion also increased in all but the ECH scenario, and this measure was generally less sensitive to climate scenario than the measure for nitrogen loss to water (table 10). Changes in the Corn Belt and Northern Plains dominated the national erosion change, as a result of shifts in crop rotation and tillage and an increase in planted acres (fi g. 13).\nSee table 4 for the sources of the CNR, CSIRO, ECH, and MIROC models. Note: Figure 14 is identical to figure 8 because production acreage is fixed in the \"no adaptation case\" at the level of production acreage in the \"no climate change baseline\". Source: USDA, Economic Research Service calculations.\nIncreased pest pressure on yields generally resulted in an increase in nitrogen losses to water (fi g. 22), a consequence of the increase in planted acreage required to make up for the lower yields. Soil lost to water erosion also increased in response to the increased acreage planted (fi g. 23). The impact of pests on soil erosion is generally less than on nitrogen loss, evident by the range of change over the scenarios. Nitrogen loss ranged from -15 to 15 percent over the climate change scenarios, whereas the range of soil erosion impacts was less (-3 to 10 percent), with the Northern Plains and Mountain regions showing an increase in all scenarios.    -14.7% to -10.4% -10.4% to -6.2% -6.2% to -2.0% -2.0% to 2.2% 2.2% to 6.5% 6.5% to 10.7% 10.7% to 14.9%"}, {"section_title": "How Farmer Adaptation Affects Measured Impacts of Climate Change", "text": "In the no-adaptation case, farmers did not adjust production decisions in response to changes in expected yields across crops. As a result, regions may overplant crops whose returns have declined relative to other potential crops, while underplanting crops that have become relatively more profi table. In the adaptation case, in contrast, farmers adjusted their land use, crop rotations, and tillage regimes in response both to changes in climate and adjustments in market conditions resulting from climate effects. Below, we examine how incorporating farmer adaptive response to climate change affects measured economic and environmental impacts. "}, {"section_title": "Figure 13", "text": "Regional change in sheet and rill erosion from \"no climate change baseline\" See table 4 for the sources of the CNR, CSIRO, ECH, and MIROC models. Source: USDA, Economic Research Service calculations. -44.2% to -35.7% -35.7% to -27.2% -27.2% to -18.7% -18.7% to -10.2% -10.2% to -1.7% -1.7% to 6.8% 6.8% to 15.3% Table 11 Price difference from \"no adaptation case\" to \"adaptation case,\" by crop  Table 13 illustrates the consequences of adaptation with respect to selected environmental measures when compared with the fi xed-acreage, no adaptation case. The percent increase in nitrogen loss was greater than the change Regional change in total acreage, from \"no adaptation case\" to \"adaptation case\""}, {"section_title": "Figure 15", "text": "Regional change in corn acreage from \"no adaptation case\" to \"adaptation case\" See table 4 for the sources of the CNR, CSIRO, ECH, and MIROC models. Note: Figure 15 is identical to Figure 9 because corn acreage is fixed in the \"no adaptation case\" at the level of corn acreage in the \"no climate change baseline\". Source: USDA, Economic Research Service calculations."}, {"section_title": "Impact of Changes in Pest Prevalence on Crop Production Under Climate Change", "text": "Our initial REAP analyses of the climate change scenarios considered only the crop-yield differences resulting from changes in prevailing precipitation, temperature, and carbon dioxide concentration. Additional cost and yield implications of changes in pest prevalence (weed, insect, and plant disease) are likely to occur with climate change. Costs and yields were modifi ed for each climate change Regional change in nitrogen loss to water from \"no adaptation case\" to \"adaptation case\" See table 4 for the sources of the CNR, CSIRO, ECH, and MIROC models. Source: USDA, Economic Research Service calculations."}, {"section_title": "Figure 23", "text": "Regional change in sheet and rill erosion from 2030 climate scenarios as a result of changes in pest distribution See table 4 for the sources of the CNR, CSIRO, ECH, and MIROC models. Source: USDA, Economic Research Service calculations. -3.2% to -1.3% -1.3% to 0.6% 0.6% to 2.6% 2.6% to 4.5% 4.5% to 6.4% 6.4% to 8.3% 8.3% to 10.2%"}, {"section_title": "Lessening the Impact of Climate Change Through Technical Change: Targeting Crop Breeding for Adaptation to Climate Stress", "text": "We previously considered the regional effects of temperature and precipitation changes on crop yields, and then examined how potential shifts in the geographic distribution of pests and diseases might further impact crop yields and farmer adaptation decisions. We now consider how technical changes provide additional adaptation opportunities and the implications of those opportunities on land use, crop production, commodity markets, and environmental quality. We fi rst analyzed current crop genetic research addressing particular production constraints accompanying climate change, particularly heat, drought, and pests/diseases. We then designed and analyzed a case exploring the potential effects of new drought-tolerant crop varieties on the likely impacts of climate change."}, {"section_title": "Adoption of Plant Varieties With Greater Tolerance to Climate Change-Related Stresses", "text": "Plant genetic resources might be used as an adaptation strategy in a number of ways: • One crop species may simply replace another in response to changing growing conditions within a region. Existing crop varieties may also be used in new locations as conditions change. • New varieties can be developed by plant breeders to improve tolerance to heat, drought, and pests/diseases, using classical breeding techniques, molecular methods (e.g., genetic engineering), or some combination of the two. These new plant varieties may also respond better to other adaptive management technologies, such as those related to irrigation and tillage (Rosenzweig and Hillel, 1995). Some changes in genetic resource use may come from individual farmers using existing resources and technologies. Development of new crop varieties and many other technological advances will require the involvement of the formal agricultural research system. Various institutions, both public and private (including gene banks and plant breeding research stations), are pioneering the use of existing varieties in new locations, developing new varieties, and testing the effi cacy of new varieties in conjunction with other adaptive strategies."}, {"section_title": "Potential Adaptive Benefi ts From Genetic Resource Use", "text": ""}, {"section_title": "Heat Tolerance", "text": "Tolerance to temperatures (extreme heat or cold) is a complex trait governed by multiple genes that involve a number of physiological traits and metabolic pathways. At present, few public and private sector research resources have been devoted to developing heat-tolerant crop cultivars. Hatfi eld et al. (2008) discussed the role of \"failure temperatures\" above which yields for different crops fall to zero. In a recent review, Wahid et al. (2007) concluded that \"there are a few examples of plants with improved heat tolerance through the use of traditional breeding protocols,\" but that \"the success of [the] genetic transformation approach has been thus far limited. The latter is due to limited knowledge and availability of genes with known effects on plant heat-stress tolerance, though these may not be insurmountable in the future.\" Advances are being made in heat-tolerance research, however. A number of studies supported genetic variability for heat tolerance in important fi eld crops and suggested particular selection criteria that might enhance breeding for heat tolerance (e.g., Maestri et al., 2002;Martineau et al., 1979;Radin et al., 1994;ur Rahman et al., 2004;Reynolds et al., 1994). Other researchers have focused on targeted changes in plant metabolism, such as improved photosynthetic performance at higher temperatures (Parry et al., 2011). Nevertheless, the combination of long research lags and limited research investment suggests that the probability of substantial development of commercially viable heat-tolerant crops by 2030 is relatively low."}, {"section_title": "Carbon Dioxide Responsiveness", "text": "Evidence suggests that a portion of crop yield gains in the past may be attributed to yield response to increasing atmospheric CO 2 (McGrath and Lobell, 2011). Plant breeders may have inadvertently selected for response to CO 2 fertilization, which raised the question of whether breeders might wish to select for greater response deliberately. Ziska et al. (Ziska and Blumenthal, 2007;Ziska, 2008;Ziska and McClung, 2008) suggested that: • In some cases, newer varieties did not appear to be more responsive to atmospheric carbon dioxide fertilization than older varieties of the same crop; • Some genetic variability for this trait-response to atmospheric CO 2did exist within cultivated species or wild relatives; and • The relative ease of incorporating such a trait may vary by crop."}, {"section_title": "Pests and Diseases", "text": "The fi rst generation of genetically engineered (GE) crops for commercial use was bred specifi cally to control for pests (particularly insects) and disease as well as to improve herbicide tolerance. Herbicide-tolerant crops introduce a genetic element into weed control by making the crop tolerant of herbicides, such as glyphosate, which are then used to control weeds. As a result, using GE crops has reduced pesticide use (Fernandez-Cornejo and Caswell, 2006). Genetic engineering for disease resistance has also been explored (Mourges et al., 1998;Punja, 2001) but, to date, a disease-resistant GE crop has not been commercialized. A great deal of money has been invested in both public and private research for disease/pest-tolerant or resistant crops. As a result, creating an adaptive genetic resource may reduce some of the negative impacts of the disease/ pest landscape likely to accompany climate change. For example, different forms of herbicide tolerance incorporated into crop varieties may be part of the management response if weeds become a more signifi cant problem (Duke and Powles, 2008). New threats may also emerge with climate change. Weeds may compete increasingly with crops if their growth is more responsive to CO 2 fertilization than the crop, or diseases may expand their ranges as alternate hosts also expand their range (e.g., soybean rust). Violent storms may have aided the spread of rust spores, fi rst from Asia to Africa, then to South America, and fi nally to the United States. The farm sector's fi rst line of defense typically has been fungicides, with potentially large increases in fungicide use tempered by changes in cropping patterns . 4 USDA coordinated early soybean rust surveillance and warning networks that also reduced the impact of the disease (Roberts et al., 2006)."}, {"section_title": "Drought Tolerance", "text": "Drought tolerance, like heat tolerance, is a complex genetic trait. Over the past half century or more, \"selection for high yield in stress-free conditions has, to a certain extent, indirectly improved yield in many water-limited conditions\" (Cattivelli et al., 2008). U.S.-grown corn is one example of this phenomenon, where more than 50 years of selection in multi-environment trials has increased grain yield under drought conditions (Campos et al., 2004). Selection for yield stability may have played some role in improving performance under stress conditions. Attempts to improve drought tolerance directly through conventional plant breeding date back to the 1970s, if not earlier. More recently, molecular and genomic analyses identifi ed gene networks that may be important in drought stress (Shinozaki and Yamaguchi-Shinozaki, 2007). In applied breeding, seed companies have increased their efforts to develop droughttolerant crops, particularly corn, and several companies have placed new, conventionally bred drought-tolerant hybrids on the market. Large seed companies are also using transgenic 5 means to develop drought-tolerant crops. The fi rst transgenic drought-tolerant corn hybrids received regulatory approval in 2011, which will be followed by extensive fi eld testing in late 2012; these hybrids may be marketed as early as 2013, pending regulatory approvals. 6 These hybrids may have been altered with genes from bacteria that regulate metabolic pathways for cold shock response; in plants, they may regulate pathways for other stresses, such as drought (Castiglioni et al., 2008). Potential yields from transgenic drought-tolerant corn were shown to increase by approximately 10 percent under managed stress environmental testing, and up to 15 percent under dryland conditions in environments where the average control yield was about 78 bushels/acre (Castiglioni et al., 2008). Alternatively, Edmeades (2008) hypothesized that drought-tolerant corn had the potential to improve every 5 years over a 20-year period based on a combination of conventional selection, marker-aided selection, and a new transgenic event. Edmeades calculated yield improvement above a base yield of 48 bushels/acre to refl ect conditions in some developing countries. These research assumptions projected a tripling of yield over 20 years. Such estimates might be used as the rough basis for lower and upper bounds on achievable improvements in drought tolerance over a given period."}, {"section_title": "Current Research Emphases", "text": "Several of the physical factors that accompany climate change can infl uence crop yields, and both genetic and management adaptations to these physical factors have the potential to change yield response. The impacts of increasing atmospheric CO 2 , increasing temperatures, and variable precipitation on pest/ disease incidence and temperature-and water stress-related yield impacts are both complex and uncertain. A number of public agricultural research projects have addressed crop tolerance to heat, drought, and pest/disease infestations, as reported in USDA's Current Research Information System (CRIS) (table 17). Based on project counts from USDA's CRIS, relatively little research has been done on crop adaptation to higher temperatures. 7 A great deal of research has focused on pests and diseases and the potential for host plant resistance. Private-sector companies have invested a great deal of resources into GE crops, particularly for insect resistance or herbicide tolerance (HT). Genetically engineered HT, particularly to Roundup, is widely used in U.S.grown soybeans, corn, and cotton, and the bacterium Bacillus thuringiensis, or Bt, is used for insect resistance in corn and cotton. Genetically engineering crops for drought tolerance is still at various phases of research development, depending on the crop, but several companies do have conventionally bred drought-tolerant corn varieties on the market. The level of heat tolerance research by private seed-biotechnology companies is unknown, since at present they do not include this trait in reported research pipelines."}, {"section_title": "Impact of Adopting Drought-Tolerant Crop Varieties", "text": "Drought-tolerant crop varieties are a good example of an adaptive genetic response to climate change with likely impact by 2030. We assumed patterns for the potential impact of drought-tolerant varieties for four major crops on nonirrigated land: • Corn: Drought-tolerant varieties increased yields on nonirrigated land by 15 percent in all areas where annual precipitation was less than 700 millimeters (mm) and nonirrigated yields in 2010 were less than 80 bushels per acre (bu/acre). 7 Total fi nancial resources devoted to each project were not, in general, publicly available. • Wheat: Drought-tolerant varieties increased yields on nonirrigated land by 10 percent in all areas where annual precipitation was less than 625 mm and nonirrigated yields in 2010 were less than 50 bu/acre. • Soybeans: Drought-tolerant varieties increased yields on nonirrigated land by 10 percent in all areas where annual precipitation was less than 700 mm. • Cotton: Drought-tolerant varieties increased yields on nonirrigated land by 10 percent in all areas where annual precipitation was less than 900 mm. The relative yield increases for wheat, soybeans, and cotton were assumed to be less than that for corn, since a drought-tolerant trait will soon be deployed in corn. Drought-tolerant varieties of wheat, soybeans, and cotton are in earlier stages of development. Also, no advances in drought tolerance were assumed for crops other than these four. Yield increase assumptions for drought-tolerant corn varieties were based on current experimental results reported by Castiglioni et al. (2008). In the absence of similar experimental results for wheat, soybeans, and cotton, lower percentage yield increases were assumed for REAP regions where lower yields and precipitation totals were both operative. Figure 24 shows the regions where the drought-tolerant varieties are planted in the scenario analyzed. Several factors suggest that these yield increments might be conservative if improved drought tolerance is commercialized within the next few years and then widely adopted. First, additional research might enhance potential yields beyond 10-15 percent in low-moisture environments. Second, depending on how well drought-tolerant varieties perform relative to other varieties under better moisture conditions, some drought-tolerance traits might be introduced into varieties for higher rainfall areas, as insurance against less favorable production conditions in some years. The threshold assumption currently defi ning water-stressed regions concerns annual precipitation; a more sophisticated analysis would consider precipitation and soil moisture conditions during crucial periods of the growing cycle. Our analysis compared variables of interest, such as crop area and crop prices, between scenarios in which farmers had adapted crops, rotations, and production practices with the availability of drought-tolerant varieties and scenarios in which they had made these adaptations without drought-tolerant varieties. 8 Tables 18 and 19 indicate aggregate acreage and price changes within each climate change scenario. In each instance, estimates from the introduction of drought-tolerant varieties were compared with results without drought-tolerant varieties within the context of that particular climate change  scenario. Including drought-tolerant varieties reduced total planted acreage across all the scenarios. Corn acreage increased in all scenarios, as did soybeans, except for in the MIROC scenario; wheat acreage decreased in all scenarios due to improved productivity in major wheat-producing regions (table 18). The change in acreage was less sensitive to the climate scenario than in other cases examined. The introduction of drought-tolerant varieties reduced prices for corn, soybeans, wheat and cotton in all scenarios, with wheat showing the biggest reduction (table 19). Prices changed for these crops in the same direction from the baseline in all scenarios; prices that went up in the adaptation case went up less with drought tolerance and prices that declined were further reduced with the adoption of drought-tolerant varieties. Price changes for other crops varied by crop and scenario. Net returns for all scenarios (table 20) increased for the United States as a whole compared with the adaptation scenario without drought-tolerant varieties. The Northern and Southern Plains regions benefi ted from the introduction of drought-tolerant varieties, but returns were reduced in the Corn Belt, which does not plant drought-tolerant varieties under any scenario. The change in returns was consistent across climate change scenarios, indicating that drought tolerance could be benefi cial under a wide range of adverse climate changes. Impacts on acreage from the introduction of drought-tolerant varieties were more distinct at the regional level than at the national aggregate level. The only region that showed an increase in total acreage under all scenarios was the Northern Plains. Acreage moved from other western regions; regions east of the Mississippi River showed little change in acreage (fi g. 25). The impacts of introducing drought-tolerant varieties were most apparent when examining crop production by region. With a few exceptions, corn, wheat, and soybean production shifted from the eastern half of the country to the drier Plains and Mountain regions. These changes were seen only at the margin; the Corn Belt region, for example, remained the largest producer of corn and soybeans. The addition of drought-tolerant varieties does not lead to signifi cant corn production redistribution, even under the more extreme scenarios (fi g. 26); corn is not a major crop in the regions where droughttolerant varieties are planted, and the yield benefi t in those regions is not suffi cient to allow corn to compete signifi cantly with other crops, or other regions. Wheat production increased in the Northern Plains with the introduction of drought-tolerant varieties, but decreased in the Southern Plains as a result of declining prices (fi g. 27). Soybean production increased slightly in the Northern Plains and Southern Plains with the introduction of droughttolerant varieties (fi g. 28). One environmental variable-nitrogen loss to water-showed little change at the national level. Nitrogen loss improved in the Northern Plains, even as total acreage increased (fi g. 29). Production in the region moved from continuous to multi-crop rotations, which tend to have lower nutrient loss. Slightly reduced acreage led to a decrease in nitrogen lost to water in the eastern regions. Acreage in the Southern Plains increased in crop rotations that had higher nitrogen losses, leading to increased overall nitrogen losses for the region. The pattern of regional change in sheet and rill erosion is similar to that of nitrogen losses to water.  2.0% to 3.6% 0.4% to 2.0% -1.2% to 0.4% -2.8% to -1.2% -4.4% to -2.8% -6.0% to -4.4% -7.6% to -6.0%"}, {"section_title": "Figure 26", "text": "Regional change in corn production from 2030 climate change scenarios with introduction of drought-tolerant varieties Results describe the change relative to the 2030 climate change scenario without the addition of drought tolerant varieties. See table 4 for the sources of the CNR, CSIRO, ECH, and MIROC models. Source: USDA, Economic Research Service calculations. 10.4% to 16.4% 4.5% to 10.4% -1.4% to 4.5% -7.3% to -1.4% -13.3% to -7.3% -19.2% to -13.3% -25.1% to -19.2%"}, {"section_title": "Figure 27", "text": "Regional change in wheat production from 2030 climate change scenarios with introduction of drought-tolerant varieties Results describe the change relative to the 2030 climate change scenario without the addition of drought tolerant varieties. See table 4 for the sources of the CNR, CSIRO, ECH, and MIROC models. Source: USDA, Economic Research Service calculations. 13.1% to 17.7% 8.5% to 13.1% 3.9% to 8.5% -0.7% to 3.9% -5.3% to -0.7% -9.9% to -5.3% -14.6% to -9.9%  3.5% to 4.4% 2.7% to 3.5% 1.9% to 2.7% 1.0% to 1.9% 0.2% to 1.0% -0.7% to 0.2%  "}, {"section_title": "ECH", "text": "\n"}, {"section_title": "Conclusions", "text": "The biophysical impacts from climate change on crop growth are both complex and uncertain. Although temperature increases associated with climate change are widely expected to lower crop yields, shifting regional precipitation patterns may either increase or decrease yields. There has also been considerable debate over the likely impacts of increasing atmospheric CO 2 concentrations on plant growth. Our analysis suggests that the possible negative implications of climate-induced yield effects on crop prices, farm revenue, and food supply can be mitigated somewhat by farmers' ability to adapt to changing climatic conditions through crop production decisions, technologies used, and the regional allocation of land. There also may be increased environmental impacts associated with expansion of cropland. Changes in pest distribution exacerbate production and revenue losses. Nationally, acreage in crop production was fairly robust to climate change in the sense that aggregate acreage changes across scenarios (compared with the baseline projection) tended to be relatively small (less than 1 percent), whereas the range for individual regions was typically greater than the national range. This fi nding refl ects the fl exibility of the U.S. farm sector to respond to changing resource and market forces, resulting in production reallocations that minimize the aggregate disturbance to commodity supply and demand. In this analysis, available adaptation strategies included changing crops, crop rotations, and tillage types, as well as expansion or contraction of crop production acreage. Without additional pest impacts, mild climate change led to a reduction in crop prices; more extreme climate change resulted in price increases in some crops, most notably for soybeans and corn. Adaptation led to an increase in crop production, in general, though even with adaptation corn and soybean production declined under the more extreme climate projections. Total acreage in U.S. fi eld crop production increased in all climate change scenarios, although variations in yield changes across scenarios did not necessarily translate into acreage expansion in all regions. Corn and cotton were the only crops that increased acreage in all scenarios. Higher temperature and atmospheric carbon dioxide concentrations raised cotton yields considerably in every region where cotton was grown. The increase in supply, together with relatively elastic demand, caused cotton prices to drop precipitously, facilitating enough increase in demand to actually expand acreage even though existing acreage was already more productive. The corn yield effect was small relative to other crops across the scenarios, but high demand for corn raised corn acreage to compensate for lost yields. Corn acreage increased relatively more in regions where corn was not the predominant crop. Crop distributions in the Corn Belt and the Northern regions, in general, were less sensitive to climate change than in the Southern regions. Price and production changes contributed to shifting regional returns to crop production. Returns in the Corn Belt, where much of the Nation's fi eld crop production is concentrated, declined under all climate change scenarios in proportion to the severity of projected change. Farm returns nationally, however, increased under the two milder climate projections, with losses in the Corn Belt compensated for by increased returns in other regions as a result of changes in price and production patterns. Our fi ndings suggest that, for regions outside the Corn Belt, changes in crop returns did not necessarily correspond to the general magnitude of the temperature and precipitation change of the scenario. Changes in relative productivity both across crops and within crops across regions, together with the resulting market-mediated price impacts, appeared to be the primary determinant of how any given region fared under changing climate conditions. Extending the climate impact analysis to consider projected increases in pest-related yield and associated control costs showed that such impacts led to expanded planted acreage in all crops except for soybeans. Increases in pest prevalence reduced yields across all crops (except cotton and rice), but the differentiation of impacts by region and crop led to regional differences in acreage response. Corn production expanded in all regions except the Corn Belt, while wheat became relatively more important in the Southeast and soybeans shifted into the Northern and Southern Plains. Increased pest management costs meant a decline in farmer returns, though higher crop prices under the extreme climate scenarios partially offset increased control costs, with a greater impact on farmer returns in the hottest, driest scenarios. Since prices go up, producer losses are not offset by consumer gains, implying that consumers would be worse off. Research is underway to generate adaptation options for climate change by introducing crop varieties that are tolerant to environmental stresses such as drought and high temperatures. Such developments will depend on technological opportunities, as well as on investments in research over time. We modeled one particular example-the introduction of drought-tolerant varieties of corn, wheat, soybeans, and cotton-that resulted in 10-to 15-percent higher yields in drier but nonirrigated environments. Within each climate change scenario, introduction of drought-tolerant varieties resulted in a slight reduction in crop prices. With a few exceptions, drought-tolerant varieties led to small shifts in corn, wheat, and soybean acreages from the eastern half of the United States into the Plains or Mountain States, where drought-tolerant varieties were introduced. In contrast to the additional pest-pressure case, lower producer returns in many regions were complemented by lower prices, benefi ting consumers. Under most scenarios, changes in environmental indicators of soil and water quality generally followed acreage changes. Environmental impacts were also sensitive, however, to changes in production practices. Under several scenarios, the shift in nitrogen loss to water was proportionately larger than the total increase in cropped acreage, indicating an increase in production intensity for regions where more severe environmental impacts were observed, although soil loss to water erosion was commensurate with acreage change. The results for the pest-pressure and drought-tolerance cases have been presented as changes relative to the climate change adaptation scenarios, rather than as changes from the baseline. This was done to show that the range of climate projections had an infl uence in determining how factors, such as biotic impacts (i.e., pests) and technological advancements, will ultimately affect U.S crop production patterns and the environmental consequences associated with them. An alternative way to consider the results is to compare the scenario results for each case directly to the \"no climate change baseline.\" Rather than capturing the contribution of differences in crop yields between climate change scenarios, comparison with the baseline provides a measure of the composite effects of climate change plus the changes in production environment introduced in each case. Table 21 illustrates the changes in prices and returns from the climate change scenarios with respect to the \"no climate change baseline.\" The table indicates a consistent pattern corresponding to the climate change scenarios. In all cases, the ECH and CSIRO scenarios led to lower aggregate crop prices than under the \"no climate change baseline,\" whereas the more extreme CNR and MIROC scenarios led to higher aggregate crop prices. Similarly, crop returns followed the same trend. In the more extreme scenarios (CNR and MIROC), higher crop prices were generally paired with lower returns (compared with the \"no climate change\" baseline). Changes in relative profi tability within and across regions resulted in lower returns in the Corn Belt across all scenarios in the adaptation, pest-presssure, and drought-tolerance cases. Environmental consequences generally increased across all scenarios for all cases (table 22). Increases in the environmental measures were largely the result of an expansion in total planted acres under the climate change scenarios, with some contribution from redistribution of crop production between regions with different soil and water characteristics. For nitrogen loss to water, the percent change in the indicator value was generally greater than the percent change in acreage, suggesting both intensifi cation of agricultural production through increased fertilizer use and redistribution of crop production to regions and rotations more susceptible to nutrient losses. In aggregate, changes in soil lost to water erosion were more moderate than those for nitrogen loss, with the percentage change in erosion impacts often less than the change in acreage overall. Regional erosion impacts varied widely, however."}, {"section_title": "Analysis Limitations and Future Research", "text": "In exploring the implications of climate change for U.S. fi eld crop production, our analysis focused on the yield-related impacts associated with increased regional average temperatures, varied regional changes in average precipitation, increased carbon dioxide concentration in the atmosphere, the expanded incidence of pests, and the market-mediated price impacts that arise as a result of decentralized impacts and adaptive responses. The GCM results used to drive our climate change projections did not allow us to estimate changes in the variability of daily temperature and precipitation, but other studies suggest that changes in volatility of weather parameters-including increased incidence of extreme weather events-may also be a signifi cant driver of yield and impact changes (Isik and Devadoss, 2006). By capturing only changes in average maximum daily temperature, minimum daily temperature, and precipitation, our EPIC results may underestimate the full yield impacts expected from changes in those climate conditions. Furthermore, direct yield impacts represent only a partial, if important, subset of the climate change elements likely to impact farmers. Other atmospheric factors-such as ground-level ozone, which is expected to increase in tandem with increasing CO 2 emissions-may have signifi cant agricultural  4 for sources). The \"no climate change\" \"\"…baseline crop returns in REAP were $43 billion. The \"no adaptation\" case assumes climate change affects crop yield but that farmers' land allocations and cropping practices do not adjust. The \"adaptation\" case allows farmers to adjust their crop rotations, tillage practices, and land allocation decisions in response to how the climate change affects crop yield and resulting market conditions. The \"pest damage\" case considers the additional effects of changes in the distribution of crop pests resulting from climate change and how this affects crop yields and pest control costs. The \"drought-tolerance\" case assumes that drought-tolerant crop varieties of corn, wheat, soybeans, and cotton become available and provide another option for how farmers can adapt to climate change. It does not include damages from changes in pest populations. See table 2 for a complete discussion of the REAP analysis cases.  table 4 for sources). The \"no adaptation\" case assumes climate change affects crop yield but that farmers' land allocations and cropping practices do not adjust. The \"adaptation\" case allows farmers to adjust their crop rotations, tillage practices, and land allocation decisions in response to how the climate change affects crop yield and resulting market conditions. The \"pest damage\" case considers the additional effects of changes in the distribution of crop pests resulting from climate change and how this affects crop yields and pest control costs. The \"drought-tolerance\" case assumes that drought-tolerant crop varieties of corn, wheat, soybeans, and cotton become available and provide another option for how farmers can adapt to climate change. It does not include damages from changes in pest populations. See Table 2 for a complete discussion of the REAP analysis cases. impacts and may infl uence the incentives and constraints that farmers face in responding to a changing climate. The potential impacts of climate change on the supply and costs of agricultural inputs-such as land, energy, fertilizer, water, and labor-would also affect relative returns to different types of production and would possibly create region-specifi c constraints on the adaptive strategies available to farmers. Such considerations were beyond the scope of this analysis. Moreover, our research focuses on the potential for adaptation within the U.S crop sector, with a particular emphasis on major fi eld crops. We did not consider specialty crops-fruits, vegetables, nursery crops, and other specialty crops-which account for an important share of the value of U.S. agricultural production. We recognize, however, that climate change can have an important bearing on resources supporting specialty crop production as well. The model did consider livestock sector impacts through changes in feedgrain markets, although we did not capture the full range of substitution of feed ingredients that may occur due to climate change. Nor did we explicitly model the effects of climate change on animal productivity and other aspects of livestock management costs. Our analysis also was limited in the range of adaptation strategies available to farmers that could be examined within the existing modeling framework. REAP evaluates adaptation strategies related to changing crop patterns and practices, but existing production enterprises in the model did not allow for other farm-level adaptation strategies, such as changing harvesting and planting dates or the timing and magnitude of applied irrigation or fertilizer. Such strategies are common responses to weather variability and will be an important element in farmers' adaptation responses. The potential for, and constraints to, expanding irrigated acreage and water use may be a particularly signifi cant factor in adaptation strategies where there is already significant competition for water resources, such as in the Western United States. REAP does not currently allow for an analysis of shifting irrigation patterns within U.S. agriculture; however, such modifi cations are underway and will inform ongoing ERS research related to climate adaptation. predictions of what the future climate will be like in any place. They are projections of possible future climate, and should be treated with considerable caution. There is a great deal of variability between different climate models, between different greenhouse gas emission scenarios, and between different downscaling methods.\""}, {"section_title": "Aggregating Climate Data to REAP Regions", "text": "The downscaled climate data covered the coterminous United States. Most of the points corresponded to land unsuitable to agriculture, such as mountain ranges, urban areas, or bodies of water. Much of the United States is rangeland that is not in use and is unlikely to be used in the near future for crop agriculture. Since we required a single average weather value representative of each region to derive crop yield estimates, it was important that the values refl ected conditions that were representative of conditions in agricultural areas. Nonagricultural data points can bias weather characteristics and alter the performance of the crop-growth simulation. The downscaled weather data were confi ned to agricultural production areas by overlaying National Land Cover Database (NLCD) results for cultivated crops and pasture/hay categories onto the REAP regions (Homer et al., 2004). Average monthly values for maximum temperature and precipitation and minimum temperature were computed from agricultural land within each REAP region (see fi g. 1 for a map of the REAP regions). Appendix fi gure 1 reveals the magnitude of carbon dioxide fertilization impact by crop, as well as the relative impact of temperature change versus precipitation change in the presence of carbon dioxide fertilization. As expected, carbon dioxide fertilization alone (CNR_JUST_CO 2 ) resulted in crop productivity increases for all crops relative to the baseline case (appendix table 2). The aggregate numbers masked differences in carbon dioxide fertilization impacts across regions. Appendix table 3 illustrates those differences for corn and soybeans. A comparison of CNR_T_Base_P and CNR_P_Base_T results illustrates the relative impact of temperature change versus precipitation change on biophysical impacts, when averaged nationwide and in the presence of the carbon dioxide fertilization effect. For some crops, the precipitation change associated with the CNR scenario actually increased productivity relative to carbon dioxide fertilization alone; that dynamic was seen for rice and silage, for instance. Silage, with concentrations of production in the Northeast and Lake States regions, benefi ted from the increased precipitation in those regions associated with the CNR projection. 2 Applying the temperature changes associated with the CNR model (CNR_T_Base_P) almost always decreased productivity relative to the carbon dioxide fertilization only case (CNR_JUST_CO 2 ). There was very little temperature impact on barley and hay, and cotton yields increased signifi cantly with the temperature increase. Cotton yield's positive response to temperature change was not consistent with the literature and possibly was a result of a disparity between the optimal temperature for leaf and 2 Rice reacts counterintuitively; with production concentrated in the Delta region, rice thrives despite lower precipitation levels. Because rice is heavily irrigated, one could imagine little reaction to precipitation change, but a positive yield change seems an unlikely result. We are currently improving our treatment of rice irrigation and its interaction with REAP's soil types for future analyses with a more sophisticated focus on water resources. vegetative growth (37º C) and the optimal temperature for cotton boll growth (25-26º C). The EPIC analysis did not capture a decline in harvest index at the higher temperature and therefore translated higher biomass production at higher temperatures into higher yields. The aggregate crop productivity impacts at both the regional and national level are weighted averages of what is occurring at the fi eld scale for each of REAP's production enterprises, so the magnitude of change is not necessarily representative of what happens for any single rotation. The results for corn production in the Corn Belt, for instance, are an average of what would happen to corn yields in a continuous corn rotation and in a corn/soybean rotation (among others). Because the yield impacts of any single element of climate change are dependent on other factors in the crop production system, particularly water and nutrient constraints, those impacts vary signifi cantly across production enterprises for the same crop within a single region. temperature occurred using the CSIRO temperature projections. Except for the lower latitudes, average annual temperatures for the CNR, CSIRO, and ECH climate projections were between base year levels and MIROC temperature projections. The largest increases in average annual temperature below roughly 29°N occurred using the CNR temperature projections. The simulated southward movement of each REAP region's latitude centroid implied by the OLS estimates is reported in appendix table 5. These fi gures represent the estimated southward shift of each region in latitude-temperature space. Empirical estimates that relate latitude to real (2006 US$) pesticide expenditures were applied to each region's adjusted latitude to predict percent changes in expenditures and yield losses in 2030 relative to 2000."}, {"section_title": "Pesticide Expenditures and Latitude", "text": "Phase 2 Agricultural Resource Management Survey (ARMS) data collected at the fi eld level from barley (2003), corn (1996, 2001, 2005), cotton (1997, 2003, 2007), oat (2005), rice (2000, 2007), sorghum (2003), soybean (1997, 2002, 2006), and wheat (2004) producers were used to estimate a relationship between the natural log of pesticide expenditures per acre, a constant, a time index, regional fi xed effects, and a separate latitude coeffi cient for each crop. 1 The time index was included to account for annual weather variation during 1996-2007. National Agricultural Statistics Service (NASS) production-region fi xed effects (not REAP region fi xed effects) were included in the regression to account for spatial variation in weather and production possibilities. 2 The dummy variable for the Corn Belt was excluded. 3 Separate coeffi cient estimates were obtained for each crop by adding independent variables equal to the product of the fi eld's latitude and the crop dummy variables. 1 Pesticide expenditures, which include payments for herbicides, insecticides, and fungicides, were converted to real (2006 US$) expenditures using the Bureau of Labor Statistics (2010) producer price index for pesticides and other agricultural chemicals. 2 In another version of the model, separate annual dummy variables were included for each NASS production region to account for annual weather variation by region and over time more completely. Because the adjusted coeffi cient of determination was slightly lower in that version of the model and because the estimation results were very similar, we used the results reported in appendix table 6 to specify the pesticide-expenditure and yieldloss impacts used in the analysis. 3 Note that the REAP regions are subsets of the major production regions included in the regression."}, {"section_title": "Appendix figure 2", "text": "Quadratic relationships between average annual temperature and latitude centroid for the base year and for the climate models in 2030 Average annual temperature (degrees Celsius) See  Figure 4 displays the location of these regions."}]