[{"section_title": "Abstract", "text": "Alzheimer's disease (AD) is a commonly known and widespread neurodegenerative disease which causes cognitive impairment. Although in medicine and healthcare areas, it is one of the frequently studied diseases of the nervous system despite that it has no cure or any way to slow or stop its progression. However, there are different options (drug or non-drug options) that may help to treat symptoms of the AD at its different stages to improve the patient's quality of life. As the AD progresses with time, the patients at its different stages need to be treated differently. For that purpose, the early detection and classification of the stages of the AD can be very helpful for the treatment of symptoms of the disease. On the other hand, the use of computing resources in healthcare departments is continuously increasing and it is becoming the norm to record the patient' data electronically that was traditionally recorded on paper-based forms. This yield increased access to a large number of electronic health records (EHRs). Machine learning, and data mining techniques can be applied to these EHRs to enhance the quality and productivity of medicine and healthcare centers. In this paper, six different machine learning and data mining algorithms including k-nearest neighbours (k-NN), decision tree (DT), rule induction, Naive Bayes, generalized linear model (GLM) and deep learning algorithm are applied on the Alzheimer's Disease Neuroimaging Initiative (ADNI) dataset in order to classify the five different stages of the AD and to identify the most distinguishing attribute for each stage of the AD among ADNI dataset. The results of the study revealed that the GLM can efficiently classify the stages of the AD with an accuracy of 88.24% on the test dataset. The results also revealed these techniques can be successfully used in medicine and healthcare for the early detection and diagnosis of the disease.\n296"}, {"section_title": "INTRODUCTION", "text": "Neurodegenerative, continuous deterioration of neurons, diseases are usually considered as a group of disorders that damage the working competence of the human nervous system intensely and progressively (Scatena et al., 2007) . Alzheimer's disease (AD) is the key public health concern throughout the world and one of the most widespread neurodegenerative disorder (Small, 2005) . The AD is a cureless disease because it has no diagnosis and treatment methods to slow its progression or stop its onset (Unay et al., 2010) . The median survival duration of the patients suffering from AD has been estimated to be only 3.1 years for the initial diagnosis of the probable AD, and a https://orcid.org/0000-0002-0608-9515 only 3.5 years for the initial diagnosis of possible AD (Wolfson et al., 2001) .\nThe frequency of AD occurrence is becoming more common in late life, especially the people at the age of greater than 65 are at high risk (Cummings et al., 2014) . At present, there are approximately 44 million victims of AD dementia throughout the world. If the breakthroughs fail to identify the prevention and diagnosis of the AD, it is expected to be increased to a number of more than 100 million by the year 2050 (Association et al., 2013; Touhy et al., 2014) . During the AD, degeneration of the brain progresses with time. Therefore, the patients suffering from the AD should be categorized into different subgroups, depending upon the stage of the disease. This division is critical because the patients at different stages of the AD are required to be treated differently, and the same medication cannot be used for all of them (Gamberger et al., 2017) . For that purpose, the classification of different stages of the AD can be very helpful for the treatment of symptoms of the disease to improve the patient's quality of life.\nThe use of computing resources in healthcare departments is continuously increasing and it is becoming the norm to record the patient data electronically that was traditionally recorded on paper-based forms. This yield increased access to many electronic health records (EHRs) but 80% of the data is unstructured. As a result, the processing of the unstructured data is challenging and difficult using database management software and other traditional methods. Machine learning and data mining tools and techniques can be applied to these EHRs to enhance the quality and productivity of medicine and healthcare centers (Alonso et al., 2018) . Data mining or knowledge discovery is the practice of finding the unknown and useful patterns from many pre-existing datasets. Such patterns are used to understand the historical dataset, to classify new data and generate summaries of data. In this way, data mining helps in the discovery of the deeper patterns in data, as well as classify or group records on the basis of similarities or dissimilarities between them (Sumathi and Sivanandam, 2006) .\nSince the last few decades, data mining has been extensively used in many areas such as marketing, retail, banking, stock market prediction, and medicine and healthcare, etc. (Agarwal et al., 2018; Canlas, 2009; Thenmozhi and Deepika, 2014; Yang et al., 2018) . The algorithms used for data mining can be applied to group different subjects based on the similarities in their attributes (Eapen, 2004) . Many studies (Soni and Gandhi, 2010; Dipnall et al., 2016; Ni et al., 2014 have shown that machine learning, and data mining techniques have been significantly used in medicine and healthcare research. The application of data mining in medicine helps in the efficient prognosis of several diseases, understanding the classification of disease, specifically in neuroscience, and biomedicine. The main aim of this research work is to apply machine learning and data mining techniques on the Alzheimer's Disease Neuroimaging Initiative (ADNI) dataset to classify the different stages of the AD. Moreover, the sub-objective of this research work is to identify the most distinguishing attribute for each of the different stages of the AD among ADNI dataset."}, {"section_title": "DATA", "text": ""}, {"section_title": "Data Description", "text": "In this research work, the dataset has been collected from The Alzheimer's Disease Prediction of Longitudinal Evolution (TADPOLE) challenge which is available at https://tadpole.grandchallenge.org. It is the dataset recorded from the North American individuals, who participated in ADNI. ADNI is the multicentre study aimed to improve the clinical, genetic, biochemical, and imaging biomarkers for early diagnosis of the AD. A standard set of procedures and protocols is followed during ADNI data collection, to avoid any inconsistencies in the data (Weiner et al., 2013) . The TADPOLE data has been recorded for both male and female participants, including mild cognitive impairment subjects, old aged individuals, and AD patients. The data contain records of participants' examination carried out at 62 different sites, at different monthly intervals, ranging from baseline (i.e. 0 months) to 120 months, from July 2005 to May 2017."}, {"section_title": "Data Exploration", "text": "The original TADPOLE dataset contains 1,907 attributes for 1,737 participants. On the basis of diagnosis, these participants have been divided into five different classes namely Cognitively Normal (CN), Early Mild Cognitive Impairment (EMCI), Late Mild Cognitive Impairment (LMCI), Subjective Memory Complaint (SMC), and Alzheimer's Disease (AD). The number of participants and their examination records for each of the five stages of AD included in the TADPOLE dataset are illustrated in Table 1 . "}, {"section_title": "Data Pre-Processing and Feature Selection", "text": "In this research work, a subset of TADPOLE dataset has been used. The examination records of 530 participants (106 participants from each AD stage) have been selected out of 1,737 participants, to perform experiments using different data mining algorithms for the classification of five different stages of the AD. In data mining techniques, the completeness of data is very critical for precise modeling. While the TADPOLE dataset contains a lot of sparseness. Therefore, we have selected only those attributes, which have maximum data coverage. An attribute will have complete data coverage if it will have a value for all the 12,741 instances of examination records. But, there are only 41 attributes, out of 1,907 attributes, which have a value for more than 10,000 instances of examination records. Furthermore, an analysis has been carried out to remove redundancy from the 41 attributes having enough data. There are 6 attributes in the TADPOLE dataset, that indicate the time of participant's examination, including EXAMDATE (date of examination), EXAMDATE_bl (date of first examination), M (months of examination, to nearest 6 months as continuous), Month (months of examination, to nearest 6 months as a factor), Month_bl (fractional value of months of examination), and VISCODE (participant's visit code, indicating months of examination). As all these attributes indicate the time of the participant's examination. In this way, only one attribute namely VISCODE has been selected for indicating the participant's examination date, and all other five redundant attributes have been removed. Similarly, the dataset contains two attributes for the participant's identification, including RID (participant Roaster ID) and PTID (Participant ID). The attribute PTID has been removed from the dataset to avoid redundant IDs. After data analysis and pre-processing, 28 attributes have been selected for this investigation.\nThese attributes are divided into three categories. The first category is demographics attributes which include the general quantifiable characteristics of participants. The second category is cognitive assessment attributes which include the attributes representing the cognitive behavior of a participant. For that purpose, different cognitive assessment tests are carried out and scores are assigned to the participant based on their cognitive abilities. Finally, the third category is clinical assessment attributes which include the significant biomarkers of the AD. These attributes have been recorded after the clinical examination of all participants. The list of demographic, cognitive assessment and clinical assessment attributes with their description that have been extracted for analysis is illustrated in Table 2 , 3 and 4, respectively. "}, {"section_title": "Data Partitioning", "text": "The dataset is divided into a training dataset (70% of the entire dataset) and test datasets (30% of the entire dataset). According to this division, the 2,164 examination records are used for training of the data mining models, and the 927 examination records are used for model testing. The data counts of training and test dataset after pre-processing are given in Table 5 . It illustrates that all the five classes have a different number of examination records. Because in TADPOLE dataset, the number of examination records is not the same for all participants. "}, {"section_title": "METHODOLOGY", "text": "In this research work, six different machine learning and data mining algorithms including K-nearest neighbors (K-NN), decision tree (DT), rule induction, Naive Bayes, generalized linear model (GLM) and deep learning algorithm are applied on ADNI dataset in order to classify the five different stages of the AD. In this investigation, rapidminer studio, one of the famous data mining tools, is used for implementing all these algorithms."}, {"section_title": "K-Nearest Neighbours (K-NN)", "text": "K-nearest neighbor algorithm is a simple data mining technique used for both classification and regression problems. K-NN classification algorithm assigns an object to a specific class based on the majority classes of its K neighbors. The value of K, a positive integer, defines the number of neighbors to be considered for polling (Zhang and Zhou, 2005) . In this analysis, the value of K is set to 11 which is selected using the trial and error method."}, {"section_title": "Decision Tree (DT)", "text": "The decision tree algorithm is a predictive modeling technique commonly used for classification in data mining, statistics, and machine learning applications. It classifies the dataset by computing the information gain values for all attributes of a dataset. The leaf nodes in a tree denote a class label while the branches to these leaf nodes denote the combination of input variables that lead to those class labels (Shahbaz et al., 2013) ."}, {"section_title": "Rule Induction", "text": "The rule induction is a data mining algorithm, in which a pruned set of rules is extracted from the training data, based on maximum values of information gain. The rules are in the form of 'if-then' statements (see Appendix B). Rule sets have an advantage over decision trees, as they are simpler to comprehend and can be represented in first-order logic (Stepanova et al., 2018) ."}, {"section_title": "Naive Bayes Algorithm", "text": "The Naive Bayes algorithm is one of the data mining and machine learning classification technique which is based on the Bayesian theorem. It used to find the probability of an attribute based on other known probabilities that are related to the attribute. It uses Gaussian probability densities for data modeling (Thomas and Princy, 2016) ."}, {"section_title": "Generalized Linear Model (GLM)", "text": "The generalized linear model (GLM) is a supervised machine learning approach used for both classification and regression problems. It is an extension of traditional linear models. GLM classifies the data based on the maximum likelihood between attributes. It performs parallel computations and is an extremely fast machine learning approach and works very well for models with a limited number of predictors (Guisan et al., 2002) ."}, {"section_title": "Deep Learning", "text": "Deep learning models are one of the machine learning techniques. It is based on the multilayer feedforward artificial neural networks, which are vaguely inspired by the working of the biological nervous system or the human brain. In this investigation, a deep neural network with two hidden layers is trained using backpropagation learning algorithm. The detailed working of deep neural networks is given in (Levine et al., 2018) . The schematic representation of the proposed methodology is illustrated in Figure 1 . "}, {"section_title": "Model Evaluation -Confusion Matrix", "text": "The performance of the classifier is usually evaluated using a confusion matrix. It is a specific table which is used to presents the true classes and classifier predicted classes and illustrates the type of errors made by the classifier. Confusion matrix for binary classification (class '0' and class '1') is shown in Fig.  2 . There are four different terminologies used in the confusion matrix which are given as follows:  True Positive (TP) means classifier predicted positive ('1') and it is true ('1').  True Negative (TN) means classifier predicted negative ('0') and it is true ('0').\n False Positive (FP) means classifier predicted positive ('1') and it is false ('0').  False Negative (FN) means classifier predicted negative ('0') and it is false ('1'). Accuracy, precision, and recall are the important performance metrics that are calculated from a confusion matrix for a classification model.\nAccuracy means how often the classification model correctly classifies the data samples?\nPrecision is the number of TP classes over the sum of both the TP classes and FP classes."}, {"section_title": "= +", "text": "(2)\nRecall is the number of TP classes over the sum of both the TP classes and FN classes.\n(3)"}, {"section_title": "RESULTS AND DISCUSSIONS", "text": "In this investigation, all the classification models are trained with the 10 folds cross-validation of models on the training dataset. Cross-validation is performed with the training dataset, to avoid overfitting of the models. The performance of the classifiers is evaluated using the unseen test dataset. The classification accuracy of the classifiers during the validation period and the test period is illustrated in Table 6 . respectively. It can also be observed that the results obtained on test data are quite close to the results obtained from cross-validation period. This shows that the developed models are not overfitted during their training period. From the decision tree and rule induction models, it has been observed that the most distinguishing attribute for the five stages of the AD is the CDRSB cognitive test, as it appears at the top of the decision tree. The most distinguishing clinical assessment attribute is the volume of the whole brain, whereas the most distinguishing demographic attribute is the age of the patient (see Appendices A and B). The detailed results obtained by applying the generalized linear algorithm during the test period is illustrated in Table 7 .\nIt can be observed that generalized linear model correctly classified most of the unseen instances of AD, CN, EMCI and LMCI classes, with the class recall of 100.00%, 94.44%, 90.62%, and 86.01% respectively, and class precision of 100.00%, 89.16%, 98.12%, and 79.45% respectively. The results of the SMC class show misclassification of testing instances. It can be observed from the above table that 25 out of 93 instances of SMC class have been misclassified with the CN class. This is because the patients belonging to SMC class have very similar values of clinical assessment attributes as those who belong to CN class. As well as, 28 out of 243 instances of the LMCI class have been misclassified as EMCI. This is because the attribute values of EMCI and LMCI classes overlap with each other."}, {"section_title": "CONCLUSION AND FUTURE DIRECTIONS", "text": "Machine learning, and data mining techniques are very helpful in medicine and healthcare studies for early detection and diagnosis of several diseases. The results of the research work illustrate that accuracy of the GLM is 88.24% for the test period. The results also indicate that the most distinguishing attributes for the different stages of AD include the CDRSB cognitive test among the cognitive assessment attributes, the volume of the whole brain among the clinical assessment attributes and age of the patient among the demographic attributes. Furthermore, the results proved that the machine learning, and data mining techniques can be successfully used in the early detection, prediction, and diagnosis of several diseases. The accuracy of the AD stages classification could be further improved by increasing the number of instances for EMCI and SMC classes so that the model can be trained with sufficient and balanced data for all classes."}]