[{"section_title": "Abstract", "text": "Abstract\n(1) the IBL science course developed in the study is now used as a professional development course for in--service primary teachers and is embedded into the curriculum of pre-service primary teacher education, (2) Inclu-S-ed was the basis for two new research studies, and (3) participating in Inclu-S-ed represented professional development for the lecturers involved."}, {"section_title": "Introduction", "text": "The Bologna Process in higher education, set forth by the European Commission, stipulates that education across Europe should be incorporated into a common reference framework of bachelor's, master's, and doctoral programmes (European Commission, 2015) . This means, among other things, a distinction between level 6 (professional bachelor's programmes) and level 7 (master's degrees). In Flanders (Belgium), level 6 education is primarily situated at universities of applied sciences (Hogescholen), while level 7 education takes place at research universities. Academic staff members at these research universities are predominantly evaluated on their level of teaching and research. In the terms of Schimank and Winnes (2000) , the research universities are situated in the Humboldtian system where there is a unity of teaching and research. Although universities of applied sciences also have a research obligation, it should involve applied research and is usually undertaken in cooperation with relevant industries. In practice, however, this means that most staff members are burdened with teaching obligations, while research is concentrated in a few dedicated faculties.\nIn Flanders, the departments of integrated teacher education for nursery, primary, and lower secondary education are all situated at level 6. In a recent effort to reform teacher education programmes, the Ministry of Education specifically highlighted the need for research (Crevits, 2016) . In this way, the classic research-teaching nexus, which has been a continuing topic of debate within research universities for several decades, is now also entering the realm of universities of applied sciences with professionally oriented bachelor programmes (see, e.g., Lopes, Boyd, Andrew, & Pereira, 2014; Robertson & Bond, 2005) . The basic idea behind the research-teaching nexus, and subsequently the aforementioned ministry order, is that staff members who are conducting research raise the level of undergraduate instruction by bringing research results and attitudes into the classroom. However, conflicting empirical evidence exists on this issue. In a meta study conducted by Marsh (1996, 2002) , no correlation was found between faculty research and teaching quality. Because the majority of the studies in this analysis were based on student perceptions, Galbraith and Merrill (2012) replaced the student evaluation of teaching effectiveness with results on a standardized test (so-called \"learning outcomes\") and found a positive correlation at one university. Their results were later questioned by Malcolm (2014) on the basis of definitional and conceptual challenges for this type of study.\nAlthough clear evidence of a positive correlation between research output and effective teaching is missing, this does not mean that faculty members and students cannot benefit from linkages between the two activities. Introducing students to the newest findings in their field can inspire a sense of wonder and interest and is often rather a pedagogical choice (Healey, 2005; Mägi & Beerkens, 2016) . It is clear that this is not possible for all fields. For example, in sciences where there is a hierarchical build-up of knowledge, the most recent findings usually only can be introduced at the end of an education programme (see, e.g., Prince, Felder, & Brent, 2007) . In social sciences such as teacher education, however, new insights and didactic approaches can and should be introduced at the start. At the same time, staff members and institutions have a societal obligation to teach the state-of-the-art of their subject. In this sense, conducting research gives legitimacy to the programmes and keeps the course content, especially in social sciences, up to date.\nIn this article, we will look at various ways in which results in education research can be transferred to teacher education programmes and institutions as a whole. We will use a small-scale study in the third grade of primary school concerning inquiry-based learning (IBL) as a case study to demonstrate how, with few research resources, a varied scale of benefits can be obtained.\nIn the following section, we will first develop a framework which highlights the various processes within a teacher education department. Then, the research study's methods and results are presented. Finally, the implementation of these results within the department and their relation to the developed framework is discussed in the conclusion."}, {"section_title": "A framework for research integration", "text": "In the Flanders region of Belgium, as in many other regions and countries, a university of applied sciences has a threefold mission. Education, research, and community service are the three pillars of which every publicly funded education institution should consist. The institutions are primarily funded based on student numbers, although these funds have not always followed the increase in students over the past decade. For this reason, education is the pillar which obviously receives the most attention. High-quality education is thought to attract more students, so a great deal of effort is put into organizing small-group teaching, time for coaching sessions, and so on. In addition, teaching and teaching-related activities receive the most attention in the practical organization of the departments. Most of the academic staff at universities of applied sciences are almost entirely engaged with these obligations (Vogel, 2009) .\nPerforming research faces further obstacles at universities of applied sciences. Since most of these institutions historically originated in institutes of higher vocational studies, they lack a tradition of research (Kyvik & Lepori, 2010) . Staff members were selected because of their teaching qualities and relevant expertise in their field, not because of their research capabilities.\nThere simply was no need for such capabilities one or two decades ago. This lack of tradition, together with limited funding, makes it difficult to construct stable research groups over a large period of time. A second, and more fundamental, obstacle to research at these institutions is a lack of interest among the non-research community. In general, the students are more practically oriented and more interested in tips and tricks about their future profession than in new research results. The teaching staff is usually burdened with tasks and considers high-quality teaching to be more fundamental than research, while general administrators do not always see the benefit of research outcomes. In recent years, with the introduction of a new generation of staff, a \"research drift\" has emerged at universities of applied sciences, with a greater focus being placed on research (Kyvik & Lepori, 2010) .\nCommunity service, while promoted by the government as one of the key pillars, is not structurally funded. The actions put forward here have to be self-financed. These actions include taking part in the public debate on relevant issues (climate change, health care, etc.), building up the nation's or region's cultural and societal heritage (museums, hospitals, professionalization courses for field experts, etc.), and creating patents and start-ups in innovative and cutting-edge industries (Chatterton, 2000; Guenther & Wagner, 2008) . Translating this to the situation at a teacher education department, the focus is on public debate and the professionalisation of in-service teachers. Due to the specific target group, with most schools having a limited professional development budget, the actions within this pillar are scarce.\nDespite the aforementioned obstacles, we constructed a framework to describe an education department's threefold mission, starting from small scale research results (Fig. 1) . Figure 1 . Framework for including research in a teacher education department."}, {"section_title": "LIEVEKE HELLEMANS, STEFAN HAESEN", "text": "Every research study starts with a preconceived idea or belief. This idea either comes externally (e.g. from existing literature) or from contact with the workplace. In this sense, education can sometimes deliver input to the research process, or even be its subject. The initial idea is transferred into a research project. In the context of universities of applied sciences, where research is applied and related to the content of the education programmes, a quadruple result can be achieved. First, conducting research is an ideal professional development activity for the lecturers. Here, we assume, as is often the case, that the researcher is to a certain extent also a teacher. Activities such as reading literature, applying it to a specific context, posing research questions, and acquiring an attitude of inquiry are all characteristics which are attributed to a good teacher and high-quality teaching. Second, by performing research related to the education programme, it is possible to directly translate the results into courses. As mentioned above, recent innovative methods from the workplace are highly valued by students, especially in the social sciences and professional bachelor programmes. In this sense, research can lead to a direct enrichment of the curriculum. A third application of research results can be found in community service. Professionals in the field are also interested in recent and demonstrated innovations and are prepared to pay for professional development courses. For example, in-service teachers can attend courses on blended learning or new language methods for secondlanguage learners. The final application of research results is to the research itself. By conducting research, an institute generally and lecturers specifically build up the necessary skills, tradition, and network to apply for future funding. New ideas and questions generated by one research project form the germ of the next.\nIn the next section, we will describe a small research study within a teacher education department. We will highlight the rationale of the project and present a brief overview of its most relevant results. In the final section, we will relate these results to the presented framework.\nWe could find no statistical correlation between the home language and the starting level of motivation, nor between the language that is spoken with parents and the change in pupil motivation in the four facets. There was no statistical difference in the starting motivation level between boys and girls who speak another language at home. From these results, we can conclude that this IBL course did not violate various cultural beliefs and experiences of the pupils."}, {"section_title": "The Inclu-S-ed study", "text": "Inclu-S-ed stands for Inclusive Science education. The objective of this intervention study was to ascertain whether IBL has an effect on the knowledge and motivation of 11-12-year-old pupils with differing socioeconomic status (SES).\nThere are different indicators of SES employed in the academic literature. They focus on such various dimensions as parental occupation, household income, parents' highest educational qualifications, family social resources, and home language. In the Flanders educational system, pupil SES is calculated based on the mother's educational qualifications and the home language. Since the latter carries more weight and the mother's educational qualifications as reported by children is not reliable, we used home language of the children as a measure of SES.\nWith globalization now a fact, learners bring different languages into the classroom. Results from the Trends in International Mathematics and Science Study show that students who speak a language other than the school language at home have lower scores in science than pupils whose native language is the school language (Martin, Mullis, Foy, & Hooper, 2016) . The same study showed a positive relationship between a school's science achievement and SES as well as between pupils' attitudes towards science and their science achievements. Pupils' motivation for science varies over their school career. According to Osborne, Simon, and Tytler (2009) , there is a drop in motivation around the age of 14. The SECURE study, in which our university of applied sciences participated, reported a decrease in motivation between 8 and 11 (Sokolowska et al., 2014) . It is therefore important to engender an interest in science among young people at early ages.\nPupil motivation for science can be achieved in several ways: Milne (2010) suggested that a sense of wonder, arising from aesthetic experiences, should be the starting point for inquiry in primary science. Rukavina et al. (2012) showed that motivational classroom experiences with demonstrations, applications, and practical hands-on experiments develop a positive attitude towards science. Lavigne, Vallerand, and Miquelon (2007) showed that an approach based on self-determination motivates students for science. Self-determination theory is based on the leading principle that humans actively seek opportunities to grow, enrich their potential, and fulfil their needs for autonomy, competence, and social relatedness instead of passively waiting for their environment to influence their lives (Ryan & Deci, 2002) . Therefore, people act based on three fundamental psychological needs: the need for autonomy (i.e., the desire to be in control of one's own actions, to be self-initiative), the need for competence (i.e., the desire to have an effect on one's environment, to obtain positive results), and the need for social relatedness (i.e., the desire to be accepted and appreciated by significant others) (Ryan & Deci, 2002) . These principles can be excellently implemented via IBL, since in IBL the student is the central figure in the learning process. The student is actively engaged and the process focuses on questioning, problem solving, and critical thinking in groups.\nThe idea for the Inclu-S-ed study came from the aforementioned literature regarding problems faced in diverse classrooms combined with a question raised during the SECURE study in which we participated: how can we increase motivation for science among 11-12-year-old pupils? This lead to the following two research questions for the Inclu-S-ed study. First, is there a difference in learning outcomes between students with low and high SES after a short intensive IBL science course? Second, what kind of changes in motivation for science are experienced by students with low and high SES after a short intensive IBL science course?\nThe IBL science course was developed using the inquiry framework of Cuevas, Lee, Hart, and Deaktor (2005) . This framework consists of five consecutive steps: questioning, planning, implementing, concluding, and reporting. We expanded this framework with two extra steps. At the start, we added a serendipity phase in which free exploration of the materials stimulated the children to ask questions and state problems, giving them more autonomy. At the end, we added a reflecting step, which was used as a metacognitive tool. This latter step was added because Dejonckheere, Van de Keere, and Tallir (2011) have shown that 11-year-old children who were taught to design a scientific experiment together with metacognitive support outperformed those who did not receive such support.\nThe course consisted of 4 lessons lasting 75-100 minutes. Each lesson dealt with a different topic about energy: electricity (lesson 1), wind power (lesson 2), water power (lesson 3), and solar power (lesson 4). The course was developed to promote pupils' initiative and responsibility in conducting inquiry, as teachers gradually reduced their level of guidance. The inquiry framework as described above served as a well-structured guideline for implementation: in lesson 1 nearly all of the seven steps were teacher-driven, while in lesson 4 nearly all of the steps were learner-driven (Table 1) . The study was conducted in four primary schools in Antwerp Province (Belgium). The education language at school was Dutch. A total of 67 fifthand sixth-grade pupils, 41 of them female and 26 male, participated in the study. The home language of 22 of the participants was Dutch, while for 45 pupils the home language differed from the school language. Using a pre-and post-design, pupils were assessed for knowledge of the IBL process by solving a hypothetical problem and for their motivation for science by completing a questionnaire. These instruments are described below. Further, six pupils in each class, three with low SES and three with high SES (according to the teacher), were selected for closer study. These pupils were observed during the lesson series by a researcher with the aim of measuring the level of commitment of the selected pupils. At fixed moments in each lesson, the pupils were scored using the five-point involvement scale of Laevers (1994) . After the lesson series, interviews were conducted with these selected pupils. These were short interviews, based on the classroom observations and completed problems and questionnaires. The additional information gathered in the interviews was used to illustrate and put into perspective some of the results."}, {"section_title": "Motivation for science education and science in general", "text": "To assess pupils' motivation for science, the participants completed an 18-item questionnaire assessing the importance of four types of motivation based on Tuan, Chin, and Shieh (2005) : motivation because of the value of science (\"I think that science is important because I can use it in my daily life or thinking\"), extrinsic motivation, intrinsic motivation, and motivation due to the learning environment (\"I am willing to participate in a science course because the content is exciting and changeable\"). Items were rated on a 4-point Likert scale from 1 (totally disagree) to 4 (totally agree) and recalculated into a 10-point scale.\nComparing the motivation of the pupils before and after the course, there was a decrease in all four measures of motivation. Only the decreases in motivation due to the value of science and extrinsic motivation were significant (p-values of 0.005 and 0.015, respectively). Caution is due here: for three of the elements of motivation, the value of science, intrinsic motivation, and the learning environment, the average in the pre-test was very high. Therefore, even with the decreases we could say that the pupils retained a high level of motivation. Several studies have shown that motivation for science increases through IBL (Depaepe, De Corte, & Verschaffel, 2010; Hmelo-Silver, 2004 ). However, Dejonckheere, Van de Keere, Tallir, and Vervaet (2013) found a significant drop in enthusiasm for science after a program of eight IBL sessions. They suggested that students might need more involvement in identifying research questions. In our study, we tried to measure the degree of six learners' involvement at fixed moments in each lesson using the five-point scale of Laevers (1994) . It seemed very difficult to perform this in an objective manner. It was not the scaling as such, but determining which moment in the lesson was the right one and what factors influenced the children's involvement. In general, it can be said that the children's involvement was high throughout the course, with nearly all values greater than 3, which is in line with the high levels of motivation that we measured before and after the course. There seemed to be some differences in involvement among lessons. Pupils were very eager to do experiments with electricity (in lessons 1 and 4), while enthusiasm was the lowest during lesson 2 (wind power) and in the middle during lesson 3 (water power). This suggests that the given subject also plays a role in involvement (Sjoberg & Schreiner, 2010) . Although the course ended with a lesson with very high involvement, this seemed not to lead to increased motivation in the children after the course. Abrahams (2008) found that practical work initially leads to a situational interest in science but cannot generate long-term deep interest and motivation for science. He also stated that situational interest should be raised often on a regular basis. It takes years before a stable attitude develops and lasts deep within a person."}, {"section_title": "Knowing the IBL process", "text": "To assess knowledge of scientific inquiry, pupils solved one of two piloted hypothetical problems. One involved the evaporation of water in a fish tank and the other the height of a tulip stem in relation to the size of the bulb. Both cases had an equivalent difficulty level and involved two parts.\nIn part 1, the pupils had to determine the order of steps in the theoretical research paradigm to solve the problem, i.e. what the problem is (problem posing), what an answer to the problem could be (hypotheses), what experiment could be used to find the answer to the problem (experiment design), and what should be concluded from the experiment results (conclusion). Fig. 3 shows that after the four inquiry-based lessons the pupils showed a significant (p = 0.032) improvement in knowing the consecutive steps of an inquiry. (2006), who stated that pupils can adapt from a teacher-driven approach towards a learner-driven approach over the course of four lessons. During the course, we saw that after a series of four IBL lessons pupils could set up their own research. In the first lesson, the pupils were eager to create an electric circuit during the serendipity phase, when they were just exploring the materials without any focused aim. After this phase, they asked what they should do. In the fourth lesson, where pupils could direct their own research, they were again to make an electric circuit, this time including a solar panel. In this lesson, however, we saw that most of the pupils first thought about what they wanted to investigate. The serendipity phase served their fanciful experiments. They were very creative in thinking up experiments during this fourth lesson: although the teachers had provided all kinds of materials so that the main experiments related to solar power could be carried out, the materials proved insufficient for all of the devised experiments. These observations suggest that pupils improved their scientific research skills."}, {"section_title": "This is in line with De Vaan and Marell", "text": "In the second part of assessing knowledge of scientific enquiry, the pupils were asked to fill in the specific steps for one of the two piloted cases under consideration. This means they had to provide answers to the research questions they had put in order in part 1. The lesson series caused no improvement in answering the research questions. This might be due to the fact that answering theoretical questions in a theoretical scientific inquiry is too abstract for 11-12-year-old children. It seems that even in a practical setting it is difficult for children of that age to answer research questions, as shown by the following observation during the IBL course. In the last lesson, the pupils had to make a poster presentation of the performed experiments combined with their conclusions from the investigations. The challenge was to formulate on the poster how to get as much energy as possible out of a solar panel. Although pupils conducted relevant experiments with the solar panels and lamps, such as varying the angle of incidence of light, varying the light distance, and varying the light intensity, this was not always reflected in their poster presentations. One group presented the conclusion that solar panels should be placed in the desert. When the teacher asked how they knew this, it seemed that it was a preconception. The pupils could not explain the link with the performed experiments. From this observation, it can be said that it is still difficult for children to leave out their preconceptions and make conclusions strictly from their own experiments.\nIf we distinguish between pupils who speak another language at home and those who only speak the education language of Dutch, there were no differences in knowledge of the IBL process in the pre-test conditions (before the start of the lesson series) either as measured by putting the research questions in order or as measured by answering the research questions. After the IBL course, however, there was a significant (p = 0.039) difference in improvement in answering the research questions between these two groups. The Dutch-speaking pupils slightly improved, while the pupils who speak another language at home slightly worsened.\nFinally, none of the measures of knowing the IBL process were correlated with gender in the four measures of motivation, in the pre-test condition, or when the change between the pre-and post-tests was calculated."}, {"section_title": "Benefits of the Inclu-S-ed study", "text": "Based on the results and observations of the Inclu-S-ed study, we conclude that it seems possible to improve pupils' scientific research skills with a series of four IBL science lessons. However, long-term deep interest and motivation for sciences can only be generated if IBL science lessons are given on a regular basis for years. This strengthens our idea that it is important to teach pre-service and in-service teachers how to deal with IBL (Windschitl, 2003) . For this reason, the IBL science course developed in this study is now used as a professional development course for in-service primary teachers. In this six-hour course, teachers experience the general framework of IBL and try out hands-on activities. The IBL course constructed in the project is also embedded into the curriculum of pre-service primary teacher education in an IBL course.\nThese courses for pre-and in-service teachers are enriched with anecdotes from the Inclu-S-ed study, such as the aforementioned creative experiments set up by pupils and the poster presentation of their preconceptions. Anecdotes are a powerful tool in education since they offer students a way to identify with the teacher. They give credibility to the course content due to the knowledge the teacher gained from first-hand experience. Moreover, because of their previous classroom experience, through internships or the workplace, recalling anecdotes stimulates discussion and reflection among students in comparing various experiences (Loughran, 2002; Shrigley & Kobala, 1989) .\nThere is another anecdote regarding the atmosphere within a group of pupils, known as the group dynamics. During the Inclu-S-ed study, one group of four pupils in one class argued during the first two lessons, despite attempts by the teacher to minimize this and encourage experiments. In the third lesson, there was no more arguing and the group stated at the end of this lesson, \"Teacher, we did a lot of experiments!\" The teacher reflected with the children that this was thanks to the good group dynamics during this lesson. At that moment, these pupils' learning performance was much higher, as seen BENEFITS OF A SMALL RESEARCH STUDY FOR TEACHER EDUCATION... in the fact that they wanted to share their results during the discussion phase of the lesson. This observation fits perfectly within self-determination theory. In addition, the learning performance of individual pupils within a group is greatly affected by group composition. In the pilot study, we changed the group composition in one class over the course of the four lessons. It was clear that pupils with great scientific interest could be obstructed by group members that were not interested and visa versa. Based on the aforementioned arguments, it is obvious that within IBL, where collaborative learning is important, group composition is crucial for pupil learning outcomes (Lyle, 1996) . In some cases, it might even be more important than the teacher, the materials, and all the rest. These insights are examples of specific details which are appreciated highly by the pre-and in-service primary teachers during the courses.\nIn this study, there was no correlation between pupils' cultural background and their motivation for science. However, sometimes it is not the case that the motivation is missing, but that pupils with low SES might have a low self-image and/or not be culturally allowed to ask critical questions. This was shown in one of the interviews. A pupil with low SES was intrinsically interested in science but had very low self-esteem. He did not understand the case of the tulip bulbs because he did not know what a tulip bulb was. The interviewer asked the pupil why he did not ask for an explanation. He answered that he was not smart. When the interviewer explained to the pupil that a tulip bulb could be compared to an onion and that a flower can grow from both bulbs, the pupil was very interested. He wanted to test this for himself at home. The interviewer replied that, since he was so interested in science, he might think about a career in science. The pupil repeated that he was not smart enough and that his career would involve sitting at a cash register.˝It seemed that this IBL course did not change this pupil's low selfesteem. This insight is also passed to pre-and in-service primary teachers and forms the starting point for classroom discussions about the role and effectiveness of educational programs.\nDuring the Inclu-s-ed study, new questions and ideas emerged among the researchers. In a follow-up study, we investigated the motivation of children (12 years old) in a STEM lower-secondary school. We could confirm that long-term deep interest and motivation for science hardly decreased in these children who had five hours of STEM activities per week during one year (De Smet & Hellemans, in preparation) .\nAs we saw above, language is an important issue for science lessons in general, but especially when pupils speaking another language at home are involved in the classroom. In this study, we could see a difference in answering LIEVEKE HELLEMANS, STEFAN HAESEN the research questions between Dutch-speaking pupils and pupils who speak another language at home. Care should be taken to use understandable language. In another follow-up study, we investigated how we can improve this study's results by taking language more into account (Schutjes, in preparation) .\nOur starting point was a preconceived idea, a belief (see, e.g., Biesta, 2010) , that IBL is a way of teaching worth investigating and that both knowledge and motivation are valuable indicators of learning success. This idea was transferred into a research study. We chose an interventional study. Due to the nature and scale of the study, the results are only exemplary (Biesta, 2010) but nevertheless give rise to a broad variety of applications. With this study, bridges were built between the three pillars of education, community service, and research (see Fig. 1 ): (1) the IBL science course developed in the study is now used as a professional development course for in-service primary teachers and is embedded into the curriculum of pre-service primary teacher education, (2) Inclu-S-ed was the basis for two new research studies, and (3) participating in Inclu-S-ed represented professional development for the lecturers involved and in this way enriched teaching quality. Castelijns and Vermeulen (2017) stated that the smaller the gap between the researcher and the end user is, the greater the knowledge utilization of the research outcomes can be. This might be the key factor in the rather great benefits from the Inclu-S-ed study at various levels, since the researchers were also end users. In this way, we have broadened the scope of the research-teaching nexus beyond the individual teacher and looked for other opportunities research can provide for an institution (Malcolm, 2014) . The inclusion of the project results into the curriculum are a pedagogical choice, wherein IBL as the topic and method reflects the research attitude desired to be enhanced within students, cf. the various ways research and teaching can be linked (Healey, 2005) . This pedagogical choice requires that the teacher teaches as she or he preaches. As Mägi and Beerkens (2016) have shown, researchers are more likely to use IBL methods within their teaching. Participating in this project offered professionalization for the researcherteachers for their teaching methods. On the level of the professionalization of in-service teachers, this project offered evidence-based course material. In this way, it gave credibility to its content and practical usefulness and thus enhanced its chances of implementation by course attendants (Ratcliffe et al., 2005) . Since the research tradition at Flemish universities of applied sciences is rather new (Kyvik & Lepori, 2010) , in general stable lines of research still have to be created. In this regard, the Inclu-s-ed study was a starting point for two follow-up projects within the department."}, {"section_title": "Conclusion", "text": "This paper addressed through a particular case study the emerging researchteaching nexus within universities of applied sciences. Although the results are only exemplary, they highlight the various possibilities research within a vocational higher education setting can offer a department (Rowley, 2002) . In addition to the benefits which can be obtained in the suggested framework, difficulties were also encountered, as discussed above. Because all of the researchers were only involved in the project part-time, while teaching was their main activity, the time spent on the project was a serious issue. All of the project members experienced a lack of dedicated time for their work on the project in their weekly schedules. During the project, its existence and relevance was hardly noticed by colleagues at the department. After the results were implemented at the various levels, the project became a benchmark and was subsequently used in other projects. All of this suggests that research within a teacher education department at a university of applied sciences has its place and merits but needs the necessary support to grow."}]