[{"section_title": "Abstract", "text": "Several epidemiologic studies have examined with diverging results the relationships between circulating levels of insulin-like growth factors (IGF) and of IGF-binding proteins (IGFBP) and prostate cancer risk. We assessed the association of prediagnostic plasma levels of IGF-I, IGF-II, IGFBP-2, and IGFBP-3 and subsequent occurrence of prostate cancer in a case-control study nested in the SU.VI.MAX trial. The SU.VI.MAX study was a primary prevention trial testing a daily supplementation with low-dose antioxidant vitamins and minerals in male and female middle-aged volunteers in France. One hundred prostate cancer cases were diagnosed among 4,855 SU.VI.MAX participants over a 9-year follow-up period. For each case, four age-matched controls were selected randomly. Frozen baseline plasma samples were used to measure IGF-I, IGF-II, IGFBP-2, and IGFBP-3. Conditional logistic regression was used to assess the association between these four biochemical markers and prostate cancer risk. After controlling for the intervention group in the trial and the other IGF axis variables, the odds ratios and 95% confidence interval (95% CI) comparing the upper quartile to the baseline quartile were 1.83 (95% CI, 0.85-3.95), 1.05 (95% CI, 0.35-3.18), 0.79 (95% CI, 0.39-1.58), and 0.42 (95% CI, 0.12-1.52) for IGF-I, IGF-II, IGFBP-2, and IGFBP-3, respectively. More suggestive associations for IGF-I and IGFBP-3 were observed with advanced and aggressive cancers. Our results are consistent with those of some previous prospective studies and suggest that IGF axis variables are not long-term predictors of the occurrence of prostate cancer. (Cancer Epidemiol Biomarkers Prev 2005;14(9):2269 -72) "}, {"section_title": "Introduction", "text": "Insulin-like growth factors-I (IGF-I) and IGF-II are peptide hormones involved in the regulation of cell proliferation, differentiation, and apoptosis. Six IGF-binding proteins (IGFBP) modulate the bioavailability of IGFs (1) . Several epidemiologic studies have examined the relationships between circulating levels of IGFs, principally IGF-I, and of IGFBPs, principally IGFBP-3, and prostate cancer risk (2, 3) . The reviews point to a positive association with prostate cancer risk for IGF-I and a negative association for IGFBP-3 (3, 4) . Yet the examination of the eight prospective studies, in which measurements were made on blood samples collected years before the occurrence of prostate cancer, shows mixed results and suggests that IGFs may be associated with advanced disease (5) (6) (7) (8) (9) (10) (11) (12) . To minimize the influence of clinical and preclinical prostate cancer on plasma IGFs and IGFBPs levels, we conducted a prospective case-control study nested within the cohort of male participants to the SU.VI.MAX trial and assessed the relationship between baseline plasma levels of IGF-I and IGF-II and of IGFBP-2 and IGFBP-3 and the occurrence of prostate cancer over a 9-year follow-up period (13, 14) ."}, {"section_title": "Materials and Methods", "text": "Study Population. The SU.VI.MAX study is a large population-based, double-blind, placebo-controlled, randomized trial designed to assess whether supplementation with antioxidant vitamins and minerals (120 mg vitamin C, 30 mg a-tocopherol, 6 mg h-carotene, 100 Ag selenium, and 20 mg zinc) every day during 8 years could reduce the incidence of cancer and ischemic heart disease in middle-aged men and women (13) . At enrollment, all SU.VI.MAX participants had a physical examination and anthropometric measurements done by study nurses and physicians. They completed baseline questionnaires on personal habits, diet, smoking, and physical activity. During the follow-up, subjects were requested to complete a monthly questionnaire on health events. Screening tests were done every other year as part of the SU.VI.MAX study: Papanicolaou smear and mammograms for women and fecal occult blood test for all subjects over 45 years. No screening measure directed to prostate cancer was part of the SU.VI.MAX trial. At enrollment and at the last visit before the end of follow-up, a fasting venous blood sample was obtained. Plasma aliquots were immediately prepared and stored frozen either in liquid nitrogen for the baseline samples or in biofreezers at À80jC for the final samples.\nThe population for the present study is based on the 5,141 men randomized in the SU.VI.MAX trial. Three participants who had prostate cancer at enrollment, 104 men who withdrew from the trial in the 4 days following randomization, and 179 men without baseline plasma sample were excluded. Total prostate-specific antigen (PSA) was measured blindly by immunoassay (Roche Diagnostics, Indianapolis, IN) using a specific antibody with a highly sensitive technique on all 4,855 samples collected at baseline and on all 3,780 samples collected at the end of follow-up (14, 15) Nested Case-Control Study. For each of the 100 prostate cancer cases, four men were randomly selected among the participants of identical age and without prostate cancer diagnosis by the end of follow-up. The study population is thus formed by 100 sets of one case and four age-matched controls. The baseline plasma samples were used to measure four variables in the IGF axis: IGF-I, IGF-II, IGFBP-2, and IGFBP-3. IGF-I was measured by chemiluminescent immunoassay on an Immulite analyser (DPC, Los Angeles, CA) and IGF-II by immunoradiometric assays (DSL, Webster, TX) using two specific antibodies with one labeled with iodine-125 (16, 17) . With these methods, there is no interference by the IGFBPs. IGFBP-2 was measured by RIA (DSL) and IGFBP-3 was measured on the Immulite analyser (DPC; refs. 17, 18). According to the manufacturers, both serum and plasma with heparin are acceptable for these assays except for IGF-II and IGFBP-2. However, measures on serum and plasma samples were highly correlated. For IGFBP-2, our studies have confirmed the reported significant negative bias for heparin plasma compared with serum (18) . Observed values for IGF-II in our study are expected to be lower than in other studies using serum. All measurements were made in duplicate and conducted blindly without knowledge of any participant information in the biochemistry laboratory of the Centre Hospitalier Universitaire de Québec (Dr. P. Douville). IGF and IGFBP measurements were conducted all at once in the same laboratory between Statistical Analyses. The participants' baseline characteristics were compared between the cases and the controls using Student's t tests or m 2 tests. For the main analyses, continuous variables were converted into ordered categorical variables using the quartiles among controls as cutoffs. Conditional logistic regression was used to estimate odds ratios (OR) for prostate cancer associated with each level of the biochemical markers with their 95% confidence interval. These models were also used to control for confounding. To compare our results with those from previous reports, final regression models included one or more of the following covariates: intervention group in the trial, IGF variables, smoking, body mass index, and alcohol intake. Confounding by age was controlled by matching. Linear trend for the association between IGF variables and prostate cancer was evaluated by including categorical trend variables in the models. Similar analyses were done according to cases' characteristics: PSA < 4 Ag/L or PSA z 4 Ag/L, Gleason grade <7 or z7, time from enrollment to diagnosis <7 or z7 years. In these analyses, the original sets comprising one case and his four controls were preserved. All statistical tests are two sided. These analyses were done using the PHREG procedure in Statistical Analysis System (Cary, NC)."}, {"section_title": "Results", "text": "The median duration of follow-up was 6.8 years for the cases and 9.0 years for the controls. Of the 100 cases, 29 were diagnosed within the first 5 years and 23 were discovered because of PSA screening conducted for the study at the end of the trial. Most patients had localized disease and were treated by radical prostatectomy. Two cases had metastatic cancer at the time of diagnosis. Gleason grade was <7 for 54 of 94 patients (Gleason grade was not available for six cases). The baseline characteristics of the 100 cases of prostate cancer and 400 controls are presented in Table 1 . Having been randomized to the supplementation arm of the trial was associated with a moderately, nonsignificant, reduced risk of prostate cancer (OR, 0.87; 95% confidence interval, 0.55-1.35). Therefore, arm assignment in the trial was included in all multivariate models to control potential confounding from the intervention. Table 2 presents the associations with prostate cancer risk of the four variables from the IGF axis. The results of three regression models, which differed by the potentially confounding variables included, are presented. The observed associations were consistent across models. A statistically significant association was observed in the multivariate models for the third quartile of IGF-I with ORs of 2.20 and 2.73 depending on the model. The ORs associated with the fourth quartile of IGF-I were always lower than those associated with the third quartile. The ORs associated with quartiles 2 to 4 of IGF-I were always >1, but the trend never reached statistical significance. In the crude analysis, the second quartile of IGFBP-3 was associated with a statistically significant increased OR for prostate cancer, but the association was no longer significant in the multivariate models. Compared with their respective reference baseline quartile, the upper quartiles of IGF-I and IGFBP-3 tended to be associated with prostate cancer, positively for IGF-I and negatively for IGFBP-3, but these associations did not reached statistical significance. Neither IGF-II nor IGFBP-2 was associated with prostate cancer risk. Table 3 presents the odds ratios associated with baseline levels of IGF-I and IGF-II and IGFBP-2 and IGFBP-3 obtained in regression models including all IGF variables and intervention arm in the trial for subgroups of cases. Stronger positive associations were observed for IGF-I for cases with PSA z 4, Gleason grade of z7, and for those diagnosed early in the follow-up than for the others. Similarly, stronger negative associations were present for IGFBP-3 for cases with these characteristics than for the others."}, {"section_title": "Discussion", "text": "We prospectively assessed the relationships between baseline plasma levels of IGF-I, IGF-II, IGFBP-2, and IGFBP-3 and prostate cancer risk through multiple regression models adjusting for several potential confounding factors. Overall, we found no evidence of clear and meaningful relationships between IGF axis variables and prostate cancer risk. However, the results suggest that IGF-I and IGFBP-3 could be associated with prostate cancer when cases are more aggressive or advanced.\nThese results contrast with the initial report by Chan et al. showing a strong positive association between plasma IGF-I and prostate cancer risk in the Physicians' Health Study (19) . However, a subsequent report by these investigators indicated that the association was limited to advanced cancers and to tumors diagnosed in the pre-PSA era (5) . Similarly, the positive association initially reported by Stattin et al. between plasma levels of IGF-I and prostate cancer (20) was mainly observed in the original study group and among younger men (7). Only one (8) of the six other published studies based on prospective cohorts showed a positive association between baseline IGF-I level and prostate cancer risk (6, (8) (9) (10) (11) (12) . In contrast, most casecontrol studies (3, 4, 21, 22) reported a positive association between IGF-I levels and prostate cancer and higher levels of IGF-I among cases than among controls. These data suggest that the positive association between IGF-I and prostate cancer risk reported by previous investigators may have been a consequence of the presence of prostate cancer, either clinically recognized or at an advanced preclinical stage. Our results for subgroups of cases provide suggestive evidence in support of this situation.\nThe relationship between IGBPB-3 and prostate cancer was examined in seven prospective studies (5, (7) (8) (9) (10) (11) (12) . A negative association was observed for advanced cases in the Physicians' Health Study (5), whereas a positive association was reported by Stattin et al. in their original study group (7) . All other prospective studies provided evidence of a lack of association between levels of IGFBP-3 and prostate cancer risk (8) (9) (10) (11) (12) . The results of the case-control studies were inconsistent, with most of them showing no significant association.\nIGF-II was studied in two prospective studies with diverging results. In the Baltimore Longitudinal Study of Aging, Harman et al. observed a strong inverse association between serum IGF-II levels and prostate cancer risk (8) , whereas no association was present in the Physicians' Health Study (19) . A recent casecontrol study reported a positive association between IGF-II and prostate cancer (22) , whereas another one showed no evidence of a relationship (21) . Early case-control studies reported higher levels of IGFBP-2 in patients with advanced metastatic prostate cancer (23, 24) , but no association was observed for screen-detected cases in a recently published casecontrol study (22) . Only one prospective study has investigated the relationship between IGFBP-2 and prostate cancer risk showing evidence of no association (20) . Our study was similar in its design to that conducted by Woodson et al. among men participating to the AlphaTocopherol and Beta-Carotene study (10) . Similarly, we found no evidence of a clear association between the baseline level of any of the four IGF variables studied and the occurrence of prostate cancer over a 9-year prospective follow-up. Overall, the results of our study and the published data suggest that IGFs and IGFBPs are not involved in the etiology of prostate cancer but that their plasma levels could be influenced by the presence of prostate cancer. "}]