[{"section_title": "", "text": "associated with producing certain products together rather than separately. The learning curve slopes downward or leads to cost reductions when average cost declines as output increases over time. The subsequent discussion focuses on sources of cost economies rather than the current structure of U.S. agriculture. A discussion of the current structure of U.S. agriculture and definitions of farm size categories can be found in Box 1. In capital-intensive industries or industries for which fixed costs represent a significant proportion of total cost, economies of scale are often evident (Rasmussen). In production agriculture, increases in farm size often lead to reductions in family and operator labor as well as machinery and building investment per unit of output. For example, for Illinois Farm Business Farm Management (FBFM) crop farms, machinery investment per acre was $640 per acre for 1,000 acre farms, $590 per acre for 2,000 acre farms, and $540 per acre for 3,000 acre farms in 2015 (Zwilling and others). In production agriculture, technology adoption can foster economies of scale and competitive advantages for a couple of reasons. First, early adopters of technology often reap above average net returns. Second, in an industry with rapidly changing technology such as production agriculture, firms that do not adopt technology become increasingly inefficient. The production frontier for production agriculture, which represents the relationship between output and input, is rapidly shifting upward (Mugera and others). If firms adopt technology that is several years old because of size or capital constraints, their relative position may fall increasingly short of the production frontier. Another potential source of economies of scale are advantages associated with buying inputs or selling outputs in relatively large quantities (specifically, pecuniary economies of scale). As farms grow, they may be in a position to purchase seed, fertilizer, agricultural chemicals, and machinery for a lower per unit price and more effectively negotiate land rental arrangements. In addition, larger farms may be in a better position to negotiate with grain and livestock buyers. Even small differences in input or output prices can make a large difference in production costs and profits. Using key personnel more effectively may also provide a cost advantage for larger farms. As farms expand, operators and key"}, {"section_title": "Box 1", "text": ""}, {"section_title": "Structure of U.S. Agriculture", "text": "A recent paper by Hoppe and MacDonald categorizes both the percentage of acres operated and the value of farm production by farm size. Small family farms have a gross cash farm income less than $350,000, midsize family farms have a gross cash farm income from $350,000 to $1,000,000, and large family farms have a gross cash farm income exceeding $1,000,000. Nonfamily farms refer to any farm where the operator and persons related to the operator do not own a majority of the business. Large family farms make up only 2.9 percent of total farms while operating 23 percent of acres and generating 42.4 percent of the value of production. Hoppe and MacDonald note that production has been shifting to larger farms for many years. In 2015, family and nonfamily farms with gross cash farm income over $1,000,000 accounted for approximately one-half of the value of farm production in the United States; in 1991, these farms accounted for only onethird of the value of farm production. In addition, the midpoint size for cropland in 1982 was approximately 600 acres, while the midpoint size in 2012 was approximately 1,200 acres. According to the Agricultural Resource Management Survey, in 2015, 69 percent of all farms had a profit margin below 10 percent. For farms with $1,000,000 to $5,000,000 in sales and greater than $5,000,000 in sales, only 36 percent and 26 percent of farms, respectively, had profit margins below 10 percent. personnel have the opportunity to specialize. For example, larger farms may have an individual responsible for technology adoption, financial management, crop production, or personnel management. In contrast, on small farms, the operator may not be fully employed. On midsize farms, the operator or operators may wear many hats, and it is therefore more likely for some important strategic decision or area of responsibility to \"fall through the cracks.\" Besanko and others discuss several sources of diseconomies of scale. We examine these sources in the context of production agriculture. First, labor costs per worker are often positively related to firm size. In the production agriculture context, a larger farm may have to hire someone with expertise in financial management or personnel management. If the benefits from hiring this person do not outweigh the extra cost, then profit will not increase. Second, larger farms sometimes spread specialized resources too thin. This can be a problem on a rapidly growing farm. Indeed, we have certainly seen cases where one of the key farm operators or employees is spread especially thin. In these instances, it is important to bring in personnel to help relieve the managerial pressure. Third, bureaucracy can become a problem in larger firms. Most farms are not at the scale where bureaucracy is problematic. However, organizationspecifically, how duties and responsibilities are divided between operators and key employees-can be contentious on larger farms. Another possible source of diseconomies of scale in production agriculture is related to the timeliness of operations. As farms expand, it can become difficult to ensure that operations occur in a timely fashion. This is particularly true when farms expand rapidly. In these situations, farms may not have the necessary machinery or personnel in place for the first year or so. Careful strategic planning with regard to farm resources can help mitigate this issue. As indicated previously, economies of scope exist when it is possible to produce outputs together rather than in separate firms. The classic example in production agriculture is producing crops and livestock on the same farm. In general, empirical research suggests that economies of scope are larger for smaller farms, as smaller farms produce multiple outputs (such as crops and beef ) to use operator labor, machinery, and equipment more efficiently (Langemeier). Learning curves are prevalent in manufacturing, and occur when average cost per unit produced declines with output over time. As a manufacturing firm becomes more familiar with producing a product, the cost per unit rapidly declines. In production agriculture, technology adoption is associated with a learning curve. Larger farms have a potential advantage, because they have more units with which to \"try out\" the new technology. In addition, larger farms are often beta testers of new technologies developed by agribusinesses, giving them an early look at how a specific technology may work on their farm. The learning curve is often related to production costs. However, producing specialized products can also require (or benefit from) learning. For example, a farm familiar with producing popcorn will probably find it easier to negotiate contracts to produce waxy corn, white corn, or non-GMO corn. Table 1 lists key drivers influencing future consolidation. This table represents an updated version of a figure contained in Boehlje and others. Each of the drivers is briefly discussed in the following subsections. It is important to note that many of the drivers are inter-related."}, {"section_title": "II. Key Drivers Influencing Consolidation", "text": ""}, {"section_title": "Capital and land market access", "text": "Larger farms have two advantages in terms of access to capital and the land market. First, financial performance tends to be relatively higher for larger farms (Hoppe and MacDonald). Relatedly, larger farms tend to have better recordkeeping systems and are more likely to produce accrual financial statements. Second, larger farms retain higher earnings due to their relatively higher financial performance and lower payout ratios (that is, lower operator withdrawals as a percentage of profit). Due to their enhanced ability to purchase machinery and equipment-and in many instances hire additional labor-larger farms are often better positioned to rent additional farmland. According to Hoppe, larger farms also tend to have multiple operators and multiple generations, creating more of an incentive to expand the operation (Hoppe).  Key Drivers Influencing Consolidation"}, {"section_title": "Cost economies", "text": "Larger farms will continue to exploit scale economies in the future due to differences in technology use and pecuniary economies associated with higher selling prices and lower purchasing prices. Pecuniary economies will be related to the volume of inputs purchased and the enhanced opportunities to participate in specialized production contracts or alliances associated with changes in the value chain. Many large farms are already engaging in at least one specialized crop or livestock enterprise, making it easier for them to explore other contract opportunities or strategic alliances."}, {"section_title": "Government payments and limits", "text": "Government payments pertaining to conservation, crop programs (for example, the Agriculture Risk Coverage-County program), dairy programs, and crop insurance enhance income and mitigate downside risk. Depending on the program, the government places limits or restrictions on the parties that can receive payments as well as the amount of the payments themselves. Payment limits typically have a greater effect on larger farms than they do on small and midsize farms. However, a small or midsize farm may face restrictions in some instances due to the amount of nonfarm income they earn."}, {"section_title": "Managerial resources", "text": "As farms continue to grow, capital needs increase, risk management becomes increasingly important, and technology adoption-particularly of labor-saving technologies-has a greater influence on competitive advantage. Because large farms often have multiple operators and generations, they are more likely to have individuals with the pertinent skills in key areas (for example, financial management, risk management, and technology adoption) and to assign point people to these key areas."}, {"section_title": "Off-farm employment opportunities", "text": "Employment opportunities vary across the country, but in general are available to farms of all sizes. Small and midsize farms tend to garner a large portion of their income from off-farm employment (Hoppe and MacDonald). These opportunities often make it possible for small and midsize farms to engage in production agriculture."}, {"section_title": "Profitability and growth focus", "text": "Values and goals often differ by farm size and whether the operators are part-time or full-time operators. Due to economies of scale and lower withdrawals as a percentage of profit, larger farms have more retained earnings that can be used to reinvest and grow the farm business. Midsize farms often do not have sufficient retained earnings after withdrawals to grow the farm business. Small farms, which are often operated by part-time operators, typically have motivations other than profit, and thus do not focus as much as larger farms on profitability and growth. Boehlje indicates that both economies of scale and managerial motivations are critical to explaining farm growth and consolidation. The author notes that consolidation and concentration is a \"natural\" phenomenon. Economies of scale provide an impetus for farm growth. However, economies of scale are not the sole driver of farm consolidation. In addition to lower per-unit costs, larger farms also have higher output levels and higher profits. The use of these higher profits is as important in understanding the growth of successful farms as economies of scale. Withdrawals to business owners account for a higher percentage of small and midsize farms' annual profits compared with larger farms. Larger farms have lower payout ratios and higher retained earnings which can be used to reinvest in the business (in other words, larger farms have faster growth rates). In essence, larger farms have more \"natural\" growth potential because of their higher levels of retained earnings. Organic or internal growth is a traditional approach to expansion in production agriculture. In this approach or business model, farms acquire assets and add them to the current business. Boehlje describes seven additional business models that producers can use: mergers and acquisitions, franchising, strategic alliances, service provider, asset or service outsourcing, entrepreneur, and investor. Many of these seven additional types of business models are relatively new options for agricultural producers. If adopted, these alternative business models could dramatically change the structure of U.S. agriculture."}, {"section_title": "Risk", "text": "Many risk instruments, such as hedging, forward pricing, crop insurance, and contracts, are available to most farms. However, larger farms are more likely to use these instruments, as they can assign a point person to assess risk management options. Effective use of risk instruments increases a farm's ability to obtain credit and expand their operation. The increasing use of contracts to produce specialized products will mitigate risk in the production agricultural sector. However, to the extent that contract use varies among farm size categories, the trend toward more contract use will create important differences in price risk exposure."}, {"section_title": "Technology", "text": "Production agriculture has been substituting capital for labor for decades. Chart 1 illustrates trends in output growth, input growth, and total factor productivity, while Chart 2 illustrates trends in labor, purchased inputs, and capital from 1948 to 2013 (USDA-ERS). On average, output growth (1.52 percent per year) was almost entirely due to total factor productivity growth (1.47 percent per year). Over the 1948 to 2013 period, labor use declined 2.22 percent per year, purchased  20 1948 1952 1956 1960 1964 1968 1972 1976 1980 1984 1988 1992 1996 2000 2004 2008 2012 Output growth Input growth Total factor productivity  1948 1952 1956 1960 1964 1968 1972 1976 1980 1984 1988 1992 1996 2000 2004 2008 2012 Labor Capital Intermediate goods Index Index input use increased 1.26 percent per year, and capital use decreased 0.18 percent per year. Purchased or intermediate inputs include feed and seed, energy, fertilizer and lime, pesticides, and purchased services. Capital inputs include durable equipment, buildings, land, and inventories. The decline in capital use is due to the decline in land used for production. It is important to note that in most of the relevant research, capital includes both capital assets (for example, equipment, buildings, and land) as well as purchased inputs. Another way to think about the large change in output growth (1.47 percent) in relation to the small change in input growth (0.05 percent per year) is that farms are obtaining increasingly higher output levels for the same level of inputs. In other words, the production frontier is shifting upward. Mugera and others illustrate the large shift in the production frontier for a sample of farms from 1993 to 2010. Due to their inability to keep up with the farms on the production frontier, many of the sample farms saw their relative efficiency decline over the 1993 to 2010 period. Despite adopting new technologies, these farms are falling further behind their counterparts. The upward shift in the production frontier will almost certainly continue. Indeed, many individuals suggest we are on the cusp of another technology revolution (see, for example, Brynjolfsson and McAfee). This second machine age will expand our use of robots, artificial intelligence, and data analysis. Baily and others discuss technological innovations that are going to transform manufacturing. These transformations, which include industrial robotics, 3-D printing, and big data (see Box 2) will also have important ramifications for production agriculture. Large farms are well positioned to adopt new technologies. As noted previously, large farms tend to have higher profit margins and retained earnings, increasing the speed with which they can adopt new technologies with benefits that exceed their costs. Larger farms also have the ability to assign one or more individuals specifically to the adoption of new technology. Going forward, robotics and big data will require additional managerial expertise. Small and midsize farms, which are typically operated by sole proprietors, will find it more difficult to reallocate time towards the adoption of these new technologies."}, {"section_title": "Box 2", "text": "Robotics, 3-D Printing, and Big Data Robotics (specifically, automation), 3-D printing, and big data are likely to revolutionize technology in the near future. Baily and others contend that these innovations may be large enough to have significant effects on manufacturing productivity. Similar arguments can be made for production agriculture. Chui and others indicate that automation, at least in the next decade, will not necessarily eliminate entire occupations. However, automation is likely to affect portions of almost all jobs. The authors identify three groups of occupational activities: those that are highly susceptible to automation, less susceptible to automation, and least susceptible to automation. Highly susceptible technologies include data processing and predictable physical work. Least susceptible technologies include personnel management and decision-making, planning, and creative tasks. At least a portion of the activities in production agriculture fit into the categories of data processing and predictable physical work. Robotic milking systems offer one example of a technology that is expanding in agriculture. Salfer and others estimate that there are over 35,000 robotic milking systems worldwide. The adoption of these systems is being driven by productivity enhancements and labor savings. 3-D printing also has important implications for production agriculture. 3-D printers will allow machinery dealers and producers to rapidly manufacture spare parts. This technology will likely change how we think about manufacturing batch size and inventories, and will allow parts to be just-in-time, which could substantially reduce machine downtime. The use of big data tools in production agriculture will likely influence the nature of competition and inter-firm relationships (Sonka). Value is expected to be created through the application of tools to measure and monitor activities; data analytics, which"}, {"section_title": "Value chain alliances", "text": "Moving from commodity production to more differentiated products will create opportunities for farms of all sizes. Changes in the value chain will give producers a broader set of production choices. Producing differentiated products should enhance income and mitigate risk to the extent that producers capture a portion of the additional value associated with these products. Many differentiated products start out requiring small acreages or small animal numbers. However, as the demand for a differentiated product expands, the product tends to become \"commoditized.\" Economies of scale and managerial resources will likely improve the relative position of larger farms when it comes to growing products for reconfigured value chains."}, {"section_title": "III. Reconfiguring the Value Chain", "text": "Competitive advantage can result from product differentiation or from being a low-cost producer (Besanko and others). A low-cost producer, as the term implies, strives to have below average per unit costs while receiving at least average product prices. A farm pursuing product differentiation, on the other hand, strives to obtain above average per unit product prices while maintaining a cost structure that is at least average. The previous discussion focused on production costs-a warranted emphasis, given the historical importance of being a lowcost producer to a farm's competitive advantage. However, the current reconfiguration of the value chain is going to place an increasing emphasis on product differentiation."}, {"section_title": "Box 2 (continued)", "text": "can integrate and analyze data from multiple sources; and the creation of data sources that can help mitigate detrimental environmental effects. Incentives will be in place for producers to create big data system alliances with both input suppliers and first handlers of agricultural products. In addition, big data is helping reconfigure the value chain, creating opportunities for farms to add value to their products. One of the major changes in the food and agribusiness sectors that is affecting farms is the restructuring or reconfiguring of the value or supply chain. Restructuring affects the linkages among activities and processes from genetics and breeding through input manufacturing and retailing, production handling and processing, and food wholesaling and retailing to final consumers. In the past, production agriculture has been dominated by commodity production. But a significant trend in today's agriculture is the development of differentiated products, with some of that differentiation occurring within the farm gate. The traditional supply chain took standard farm crop and livestock products, performed numerous processes, and then moved the final products to a retailer or food supplier. In this system, much of the work to produce the characteristics that food consumers wanted was done by businesses past the farm gate: after the farmer, products went to the local grain elevator who then shipped it to the processor who delivered the commodities. As consumers have increasingly demanded more unique or differentiated food products-some of which have been developed before the processing stage, such as organic food, or the use of appropriate animal treatment or welfare practices-multiple and often more complex value chains have been developed to transform the production inputs into consumer food products. More tightly aligned supply chains facilitate product differentiation, and the opportunity to differentiate incentivizes chain formation. The need for diversity, exacting quality control, and flow control taxes the ability of open commodity markets to effectively coordinate production and processing. Traditional open markets increasingly encounter difficulties conveying the full message concerning attributes of a product and characteristics of a transaction. Where open markets fail to achieve the needed coordination, other options such as contracts, alliances, vertical integration, or joint ventures will be used. The transition to this new business model has occurred to a large degree in the poultry, pork, beef feeding, and dairy industries, and it is increasingly occurring in the crop industries (for example, vegetable and seed production, white corn, waxy corn, organic or non-GMO corn and soybeans, and high oleic acid soybeans). What are the implications of these structural changes to farms? First and most obviously, the business model for participating in these more tightly aligned value chains will be different than for traditional commodity production. Producers will need to be more responsive to customer demand and expectations, provide better documentation of what processes and inputs they are using, emphasize quality as much quantity, and be more precise in their production activities to biologically manufacture specific attribute raw materials for particular endusers (rather than just \"growing stuff\"). Some consumers will want to know more about the grower, the inputs used in production, and the processes employed. Technology is increasing the likelihood that the supply chain can offer this detail in a cost-effective manner. Technology has increased the precision of farming as it moves down through the supply chain. Management information systems will improve communication among all links in the value chain. Producers will need to be careful in their choice of buyers and suppliers to make sure they are participating in a value chain that is sustainable in the long run and provides acceptable rewards while sharing the risks of agricultural production. Producers will have a different and, in many cases, broader set of choices than in traditional commodity production. Specifically, they have the potential to participate in value chains that produce differentiated products and to capture some of the additional value that is created in these markets. However, they also will likely need to be larger in scale to \"count\" to their buyer and to be responsive to their buyers' expectations. In addition, they must always be searching for new opportunities-almost all differentiation is commoditized over time as initial higher margins decline-so producers are now on an additional treadmill of constantly assessing new product or service opportunities to offer, much like the historical technology treadmill of what new technology or production processes to use in traditional agriculture."}, {"section_title": "IV. Implications for Agribusinesses", "text": "What do the dramatic changes in the structure of production agriculture mean for agribusiness input suppliers and product purchasers? How will the farm customer base change in the future in terms of size, resource control, and buying and selling behavior? How might the customer segments be characterized in terms of size, numbers, and volume produced? How might attributes such as price, service, convenience, and product performance be considered and valued in the producer's purchasing and selling behavior? And how will these structural changes affect the marketing strategies of product purchasers and input manufacturers and distributors? We attempt to address these questions in the subsequent discussion."}, {"section_title": "Customer relationships", "text": "Suppliers and buyers will face a much less homogeneous customer base in the future. Individual accounts will vary not only in size, but also in product and service requirements. As a whole, customers are likely to be more focused, informed, and business-savvy. In addition, tighter vertical linkages from alliances, partnerships, and ownership will expand and complicate the traditional definition of the customer. Complex business relationships and \"teams\" at different ends of the marketing channel could have similar effects. Key accounts will be vitally important, making customer loyalty extremely valuable. Efforts that build loyalty by rewarding the most valuable customers will likely pay high dividends. Customer loyalty cards are a means to this end, and we might expect similar strategies to appear within wholesale markets. Trust will be ever more important in both business and customer relations. Indeed, trust is a prerequisite for the tighter vertical and horizontal relationships we foresee between firms, and it is an important part of the process of building and maintaining customer confidence in a safe food supply."}, {"section_title": "Products and services", "text": "Farms will increasingly expect and demand total solutions to their unique business problems. The focus will be not only on agronomic or nutritional responses to crop and livestock production problems, but also on systems solutions to crop and livestock profitability. The fundamental issue will be whether a particular supplier provides a total system solution or only selected components of that solution. In addition, if only selected components are provided, the customer will more than likely expect recommendations for the other components as well as advice on the compatibility (or lack thereof ) between the components provided and those obtained elsewhere. A total system approach will likely involve suppliers offering a broader product or service package or increased business linkages between component products and service providers. Moreover, increasing customer expectations will likely increase demand for customized products and specialized inputs. The rate of change and pace of innovation in new products and services and product and service packaging will be rapid. More non-traditional services will be identified and provided. Innovation in services and packaging may be more rapid than product innovation. Information and the conversion of data to profitable decisions will likely be at the core of many service innovations. Risk reduction may become part of the product package through the more prevalent use of warranties and guarantees. Contracts may play a role here: much like fee-based contract growing of hogs or poultry, net income per acre contracting of grain production is possible. In addition, input suppliers may increasingly offer product marketing as part of their product or service package. For example, a specialized package of inputs for producers of specialty crops and livestock might include some type of marketing contract or linkage to assure producers an outlet for their product."}, {"section_title": "Pricing strategies", "text": "Expect a more informed and demanding customer base to lead to competitive price pressures. Pricing strategies that create loyalty will be ever more important, pricing strategies that reduce (or share) risk will likely be embraced, and contractual pricing of products and services will likely become more common. In addition, pricing strategies that transfer risk to third parties might also become more common. Such strategies allow customers to lock in costs in advance while transferring the price volatility to retailers who might be better positioned to transfer or manage them. Expect less pricing based on each transaction, and more pricing based on \"lifetime\" service. Finally, expect innovative pricing arrangements such as technology fees to become increasingly common."}, {"section_title": "Distribution strategies", "text": "The flow of raw materials, products, and information across the marketing channel will become more efficient, increasing the pressure on the \"middleman\" or distributor. Dealers and distributors may need to find new ways to add value to remain viable business entities. A potential new role is that of a \"deal maker\" between the producer and the other parts of the marketing channel. Direct selling from the manufacturer to the producer will likely increase. Relationships in the channel may be based more on pay-for-service arrangements, where specific players are compensated for the functions they perform and no more. Better inventory management and control will lead to significant cost savings and be expected of all businesses in the industry. The internet and electronic data interchange will play a major role in tightening linkages across the channel."}, {"section_title": "Communication strategies", "text": "Technology continues to make communication easier across geographic boundaries. Storing and collecting information about the marketplace and individual customers has also become easier over time. Customer databases will continue to grow into the future, providing greater opportunities for direct marketing of products and services. The internet presents global marketing opportunities while simultaneously introducing global competition from distant firms. Electronic data transfer and the extremely rapid movement of information will make managing communications more challenging: problems will still be \"coffee shop talk,\" but when producers can circulate opinions over the internet, the whole world becomes the coffee shop. Communication strategies in general will be far more tailored and make heavy use of databases and electronic communication technologies. Personalized messages and messaging technology will allow individual messages to be delivered to individual customers. Communication with end-users will stretch firms to become familiar with a new set of decision processes, and highly technical sales abilities such as engineering, chemistry, or food sciences will be key to success with these targets. Team-based selling and field marketing concepts (local responsibility and authority) will be even more prevalent given the changing producers and customers."}, {"section_title": "V. Conclusions and Implications", "text": "In this article, we examine the most likely drivers of consolidation in the next few years and discuss the implications of changes in the structure of production agriculture for agribusinesses. Key drivers influencing farm consolidation include capital and land market access, cost economies, government payments and limits, managerial resources, off-farm employment opportunities, profitability and growth focus, risk, and value-chain alliances. Current trends in these key drivers favor continued farm consolidation. Due to anticipated changes in technology and production practices, required managerial expertise, and the value chain, production agriculture is in the midst of a major transformation. Forces driving this transformation are many and widespread including increased quality, safety and traceability demands of food processors and consumers; implementation of information and process control technologies that facilitate biological manufacturing of crop and livestock products; adoption of technologies and business practices that exploit economies of scale; increased use of leasing and other outsourcing strategies to foster growth and expand options for resource control; and wider adoption of contracting, strategic alliances, and cooperative business models to facilitate more effective and efficient vertical coordination with buyers and suppliers in the production/distribution value chain. Both the crop and livestock sectors are changing from an industry dominated by smaller, family-based, relatively independent firms to an industry dominated by larger businesses more tightly aligned across the value chain. We focus on factors leading to consolidation in production agriculture and the implications of this consolidation for agribusinesses. For several reasons, farms of various sizes will likely continue to exist even absent constant returns. These reasons include firm-household relationships; family-furnished resources; constant costs and labor techniques; expectations of returns, capital limitations, and size; and exposure to uncertainty (Heady). Many of these reasons are still as important today as they were in the early 1950s. Many small farms are willing to earn low returns and secure income from other sources. In addition, numerous small farms, particularly those with younger operators, have long-run expectations of becoming larger and thus lowering per-unit costs. Finally, the nature of small farms' capital/labor ratios and debt levels makes at least a portion of these farms very resilient to downturns."}]