[{"section_title": "Abstract", "text": "Background The incidence of colorectal cancer following a normal colonoscopy in the Medicare population is not known. Methods A 5% national sample of Medicare enrollees from 1996 to 2005 was used to identify patients undergoing complete colonoscopy. A colonoscopy not associated with any procedure (e.g., biopsy, polypectomy or fulguration) was defined as a negative colonoscopy. Patients with history of inflammatory bowel disease, colorectal cancer or death within 12 months of colonoscopy were excluded. A multivariable model was constructed to evaluate the factors associated with a new diagnosis of colorectal cancer in the period from 12 to 120 months following the negative colonoscopy. Results Among 200,857 patients (mean age 74 years, 61% female, 92% White) with a negative colonoscopy, the incidence of colorectal cancer was 1.8 per 1,000 personyears. The incidence rate for matched follow-up periods decreased from 2.0/1,000 person-years for patients undergoing colonoscopy during 1996-2000 to 1.2/1,000 person years during [2001][2002][2003][2004][2005]. Multivariate analysis revealed a significant regional variation in the incidence of colorectal cancer following a negative colonoscopy. The incidence was higher in patients [85 years, males and patients who underwent a negative colonoscopy by a non-gastroenterologist or endoscopist in the lowest volume quartile. On stratified analyses, endoscopist volume was a significant predictor for non-gastroenterologists only. Conclusions The specialty and experience of the endoscopist are significant predictors of the incidence rate of colorectal cancer in Medicare patients with a negative colonoscopy."}, {"section_title": "Introduction", "text": "Colonoscopy is a unique screening tool which not only helps in detection of early stage cancer but also allows for detection and removal of pre-cancerous lesions, thus lowering the incidence of colorectal cancer. A sharp increase in its use was noted when Medicare began providing universal coverage for screening colonoscopy in 2001 for its beneficiaries aged 50 years and above [1] [2] [3] [4] . This increase has translated into detection of more early-stage colorectal cancers [4] .\nRecently, there has been interest in studying the risk of developing colorectal cancer after a normal colonoscopy. A population-based study done in Manitoba, Canada, showed a 30-40% reduction in incidence of colorectal cancer after a negative colonoscopy and the reduction in risk persisted for more than 10 years [5] . The risk of subsequent colorectal cancer after a colonoscopy is dependent on patient-, endoscopist-and procedure-related factors. These factors may vary regionally, leading to variation in the incidence rate of colorectal cancer after a colonoscopy.\nWe investigated the incidence of colorectal cancer following a colonoscopy in a 5% random national sample of the Medicare population. The aims of our study were to describe the cumulative incidence of colorectal cancer over time in patients who had undergone a negative colonoscopy and to describe the patient, procedure and endoscopist characteristics which influence the incidence rate."}, {"section_title": "Methods", "text": ""}, {"section_title": "Data Source", "text": "We used Medicare claims and enrollment data for the period 1995-2006 to obtain a 5% random national sample of beneficiaries. Beneficiary demographic characteristics (age, gender and race), region and zip code of residence, monthly eligibility, Health Maintenance Organization (HMO) membership and coverage under Parts A (hospital stays) and B (physician and outpatient facility services) were obtained from the Medicare enrollment file. Medicare Part A data (MEDPAR File) include inpatient claims with diagnoses and procedures (coded in ICD-9-CM) for all inpatient stays submitted by acute care facilities. Medicare Part B data include claims for facility-based outpatient services (Hospital Outpatient Standard Analytic File) and claims for physician and other medical services covered under Part B (Physician/Supplier File). Data on education and income were obtained from the 2000 Census and urban/rural status was categorized using Rural-Urban Continuum Codes developed by United States Department of Agriculture."}, {"section_title": "Study Cohort", "text": "Patients [66 years who underwent colonoscopy during 1996-2005 were identified from Medicare claims. For patients with multiple colonoscopies, the first colonoscopy during 1996-2005 was considered the point of entry in the study cohort and was named the index colonoscopy. A colonoscopy with no associated procedure (e.g., biopsy, polypectomy or fulguration) was defined as a negative colonoscopy. Patients with a negative colonoscopy who were members of both Medicare Parts A and B and without HMO membership in the 12 months prior to the index colonoscopy were included. Excluded were patients with: a colonoscopy billed as an incomplete procedure; diagnosis of inflammatory bowel disease or colorectal cancer; colon resection within 3 months of the index colonoscopy; or death or loss of coverage within 12 months of the index colonoscopy. These criteria were chosen to exclude patients with conditions associated with increased the risk of colorectal cancer and to ensure availability of follow-up data in the Medicare files. Patients were also excluded if a repeat colonoscopy with any procedure (biopsy, polypectomy or fulguration) was performed within 3 months of the index colonoscopy. The study cohort was followed starting 12 months after the index colonoscopy until patients were diagnosed with colorectal cancer, died or the study period ended (31 December 2006). The incidence rate of colorectal cancer in the study cohort was calculated as the number of colorectal cancers developed divided by the person-years of follow-up. Colorectal cancers diagnosed during the first year after a colonoscopy were not included to avoid including colorectal cancers seen during the colonoscopy. The underlying assumption was that the diagnosis of colorectal cancer in the Medicare claims data may have been delayed for few months after a colonoscopy even if the lesion was noted during the colonoscopy."}, {"section_title": "Predictors", "text": "We classified our study cohort by patient, procedure and physician characteristics to estimate the impact of these factors on the incidence of colorectal cancer after a negative colonoscopy. Patient characteristics included age, sex, race (classified as White, Black or other), place of residence (divided into nine major regions of the United States), type of area of residence (rural, metro or non-metro urban), median income and education levels in zip code of residence divided into quartiles. The physician performing the colonoscopy was identified using the Unique Physician Identification Number (UPIN) on the physician claim for the colonoscopy. Physician factors included specialty of the endoscopist performing the index colonoscopy (classified as gastroenterologist, surgeon or general physician) and the volume of colonoscopy procedures performed by the endoscopist during the year prior to the index colonoscopy. Endoscopists were classified into quartiles based on the volume of colonoscopies performed on Medicare patients. Procedure-related factors included location of procedure (hospital, ambulatory surgical center or office). It is difficult to distinguish between screening and diagnostic colonoscopies in the Medicare database [6] . The percent of all Medicare colonoscopies with a screening code in 2001 was only 4.6%. This increased to 12.7% by 2005. In reality, an estimated two-thirds of all colonoscopies are performed for colorectal cancer screening [7] . Hence, we included colonoscopies billed as either screening or diagnostic."}, {"section_title": "Statistical Analysis", "text": "Colorectal cancers were identified in the Medicare database using an algorithm which included a colorectal cancer diagnosis in any position in the patient data file from an inpatient admission or a colorectal cancer diagnosis plus colorectal cancer surgery, chemotherapy or radiation procedure in an outpatient clinic or physician office [8] . The number of colorectal cancers that developed 12-120 months after the index colonoscopy and the person-years of follow-up by each patient formed the numerator and denominator, respectively, for estimating the incidence rate of colorectal cancer. Colorectal cancers proximal to the splenic flexure were classified as rightsided cancers. We separately estimated the incidence rate for patients undergoing colonoscopy during 1996-2000 and 2001-2005 to study the effect of change in Medicare coverage of screening colonoscopy. To standardize the follow-up periods for the two groups, the incidence of colorectal cancer following a negative colonoscopy for patients undergoing colonoscopy during 1996-2000 was calculated until 2001. A Kaplan-Meier curve was plotted to estimate the rate of development of colorectal cancer during follow-up. The cumulative incidence of colorectal cancer was also calculated from the Kaplan-Meier curve. The association between predictor variables and risk of colorectal cancer was initially evaluated with a log-rank test. A multivariate Cox proportional hazard model was built to evaluate the impact of each predictor independently on the incidence of colorectal cancer after a negative colonoscopy. Variables included in the model were age, race, sex, median zip code income, region, rural/urban residence, place of service (hospital, office and ambulatory center), specialty of endoscopist (gastroenterologist, generalist or surgeon or other) and volume of colonoscopies performed on Medicare patients. Hazard ratios with 95% confidence intervals (CI) were calculated for each predictor. In general, gastroenterologists undergo training for longer duration in performing colonoscopy than surgeons and those in other specialties. Hence, we evaluated the interaction between endoscopist volume and specialty. To study this further, we performed stratified analysis between endoscopist volume by specialty and incidence rate of colorectal cancer following a negative colonoscopy. All analyses were performed using SAS v.9.2 (SAS, Cary, NC). Table 1 details the characteristics of the 200,857 patients who underwent a negative colonoscopy during [1996] [1997] [1998] [1999] [2000] [2001] [2002] [2003] [2004] [2005] and met the study inclusion criteria. Median age was 74 years, 61% were female and 92% were classified as White. A majority of colonoscopies were performed by gastroenterologists (55%) and in hospital-based facilities (62%)."}, {"section_title": "Results", "text": "The incidence of colorectal cancer after a negative colonoscopy increased with age and was higher in males (Table 1) . Those residing in the New England region had the highest incidence and those in the Mountain region had the lowest. The incidence was lower for gastroenterologists compared to surgeons and general physicians. Endoscopists in the highest quartile of volume of colonoscopies during the year prior to the index colonoscopy had the lowest incidence rate. Figure 1 shows the cumulative incidence of colorectal cancer starting 1 year after a negative colonoscopy: 0.4% at 3 years, 0.8% at 5 years and 2.3% at 10 years. The overall incidence rate of colorectal cancer was 1.8/1,000 person-years in the study cohort. Around 39% of colorectal cancers following a colonoscopy occurred in the right colon compared to 34% in the left colon; 27% were unspecified. We compared the incidence rate of colorectal cancer during 5 years following a negative colonoscopy for the period before We then performed a multivariable analysis to identify characteristics associated independently with a subsequent diagnosis of colorectal cancer in patients with a negative colonoscopy ( Table 2) . Patients [85 years and males were more likely to develop colorectal cancer. Residents of the Mountain and Central regions had lower rates compared to residents of the coastal regions. Patients who underwent a negative colonoscopy by endoscopists in the highest quartile of volume of colonoscopies had the lowest incidence of subsequent colorectal cancer. In this model, there was a significant interaction (chi-square = 21.32, P \\ 0.001) between volume and specialty of the endoscopist; therefore, we performed stratified analysis to study the interaction between specialty and experience of the endoscopist (Table 3 ). For gastroenterologists, there was no significant association between volume of colonoscopies and incidence rate of colorectal cancer ( Table 3 ). The incidence rate of colorectal cancer following a negative colonoscopy was highest for non-gastroenterologists in the lowest volume quartile."}, {"section_title": "Discussion", "text": "The incidence rate of colorectal cancer following a negative colonoscopy in our study was 1.8/1,000 person-years. This incidence rate must be interpreted in the light of a few considerations. First, patients in the study cohort have a variable follow-up period during which the outcome of interest was measured. For instance, patients who underwent colonoscopy in 1996 were followed for 9 years, while patients who underwent colonoscopy in 2001 had 4 years of follow-up. Second, the patients undergoing colonoscopy before and after universal coverage implementation in 2001 differed in their risk profile. Medicare reimbursed colonoscopy before 2001 for patients with symptoms or high risk of colorectal cancer because of family history. Since July 2001, Medicare reimbursed screening colonoscopy for patients at average risk of developing colorectal cancer [9] . Thus, the overall incidence rate following a negative colonoscopy is an estimate obtained from two groups of patients with different risk profiles. We compared the incidence rate in these two groups using a comparable follow-up period. The incidence among patients undergoing colonoscopy during 1996-2000 was 2.0/1,000 person-years. The incidence rate (1.2/1,000 person-years) among patients who underwent a negative colonoscopy during 2001-2005 was lower and more representative of the risk of developing colorectal cancer following a negative colonoscopy in average risk patients. One important fact to consider in interpreting the incidence rate of colorectal cancer following a negative colonoscopy is that we did not know the indications of the colonoscopy. Ideally, the incidence rate of colorectal cancer following a negative colonoscopy should be obtained from patients at average risk who underwent their first screening colonoscopy. Many patients in our study population could have undergone index colonoscopy for surveillance for polyps. This can influence the results in either direction. Because of their tendency to form polyps, these patients may be more likely to develop polyps in the future, hence more likely to develop cancer. On the other hand, since these patients underwent a previous colonoscopy with polypectomy, their pre-malignant lesions have been removed making them less likely to develop colorectal cancer during follow-up. The distinction between screening and diagnostic colonoscopy also becomes important. Patients undergoing colonoscopy for symptoms which could indicate cancer would be more likely to be found to have cancer than Fig. 1 Incidence of colorectal cancer in patients with negative colonoscopy. The cumulative incidence was 0.4% at 3 years, 0.8% at 5 years and 2.3% at 10 years of follow-up in patients with negative colonoscopy [5, [10] [11] [12] [13] [14] [15] [16] [17] . A population-based study from Canada followed patients with a negative colonoscopy for 14 years and reported an incidence rate of colorectal cancer of around 1.1 per 1,000 person-years in patients with a negative colonoscopy [5] . Another US study of 715 patients who underwent colonoscopy during 1989-1993 and were followed until September 2007 showed an incidence rate of 0.77 per 1,000 person-years. In this study, colorectal cancers found in the initial 2 years after a colonoscopy were not included [10] . The incidence rate in our study as calculated from patients undergoing colonoscopy during 2001-2005 (1.2 cancers per 1,000 person-years) is similar to these studies. The difference in incidence rates could be related to different follow-up periods used in these studies. This rate is still higher than that reported in some studies where no colorectal cancers were found during follow-up after a negative colonoscopy [12] [13] [14] . One reason for this difference may be that factors controlled for in research studies may not be controlled for in the community setting. In these studies, the quality of examination as reflected from the high cecal intubation rate may be very good and their estimates may not be representative of community practice [12, 14] . The other reason for higher incidence rate of colorectal cancer in our study may be the higher median age of our study population compared to other studies [5, 12, 13] .\nColonoscopy is an operator dependent test. The quality of examination and therefore the protective effect are directly related to the ability of the endoscopist to closely examine all portions of the colon. In our study sample, gastroenterologists did the highest number of colonoscopies, followed by surgeons and then general physicians. Those examined by gastroenterologists had the lowest rate of subsequent colorectal cancer following a negative colonoscopy. This is probably because gastroenterologists undergo more dedicated training in colonoscopy compared to physicians in other specialties in the United States. These results are similar to those from prior studies which also found a lower incidence of colorectal cancer in patients who underwent a colonoscopy by a gastroenterologist [18] [19] [20] [21] . In our study, we found endoscopist volume of colonoscopies to be an important predictor of incidence rate of colorectal cancer following a negative colonoscopy for nongastroenterologists but not for gastroenterologists. This is also probably attributable to the higher level of training of gastroenterologists in colonoscopy. These results are at variance with Canadian studies showing no association between volume and incidence rate of colorectal cancer following a negative colonoscopy [20, 21] . In these studies, the volume distribution by endoscopist specialty differed from our study cohort as surgeons performed most of the procedures, making comparison difficult.\nOne explanation for development of colorectal cancers following a negative colonoscopy can be technical failure leading to suboptimal examination, either because of poor preparation, incomplete cecal intubation or failure to detect pre-cancerous lesions between the folds [18, 22, 23] . These are underlying factors for variation among endoscopists. The other explanation can be due to biological factors that can lead to rapidly progressive adenoma-cancer sequence [24] . In our study, we found statistically significant regional variation in the incidence of colorectal cancer following a negative colonoscopy. We could not find any specific pattern of variation to explain these results. This variation is likely due to a combination of patient-and endoscopistrelated factors which may vary by region. More studies are required to confirm these results and to determine the underlying mechanisms explaining this variation.\nOur study has several limitations. First, we used an administrative database and had no access to the colonoscopy reports. Procedure details (e.g., quality of bowel preparation, actual findings, withdrawal time) were not available. Second, the administrative database could not indicate when polyps were not removed because of contra-indications like anticoagulation. Such a procedure would have been counted as a negative colonoscopy in our study. Third, the location of colorectal cancer was not known for around 27% of patients. Hence, we could not study any associations of predictors with incidence of proximal and distal cancers separately. Finally, the association between experience of endoscopist and rate of colorectal cancer was based on colonoscopies performed on only Medicare-covered patients.\nIn conclusion, the present study shows a significant regional variation in the incidence rate of colorectal cancer in Medicare patients undergoing a negative colonoscopy and a higher risk in patients who underwent a colonoscopy by a non-gastroenterologist. The results of our study confirm those of previous studies which showed the importance of endoscopist specialty in performance of colonoscopy. This report also shows that experience, as in any other procedure, improves outcome and is likely more important for endoscopists who perform less procedures or undergo less training.\nConflict of interest Authors have no conflicts of interest."}]