[{"section_title": "Introduction", "text": "The \"buy local\" movement was brought to the attention of the American public and perhaps fueled by popular literature such as The Omnivores Dilemma, Fast Food Nation, and Slow Food Nation, where traditional or \"old world\" food preparation and growing methods are praised and large-scale monoculture farming is scolded. The USDA has further inflated the attention on local foods through its \"Know Your Farmer, Know Your Food\" initiative, which focuses on assisting beginning farmers and ranchers in achieving economic sustainability through higher-value direct-toconsumer sales. The \"buy local\" movement, like many, has a plethora of its own buzz words; locavore, farm-to-table, and foodie are just a few examples. The question is, what exactly is a locavore and why might it be important? Locavore, per the Oxford Dictionary (2014) is \"A person whose diet consists only or principally of locally grown or produced food.\" No further description of the persons or why they choose to buy local foods, nor the definition of local, is given. This publication offers a few insights into the \"buy local\" movement, specifically the type of people (the \"face\") who purchase specialty or differentiated (local, organic, grass-fed, natural, etc.) food products, the rationale behind their purchases and their pricing (the \"value\") expectations."}, {"section_title": "Who Buys Local Food?", "text": "Consumer demand for local foods is demonstrated by the extreme growth in the number of farmers markets around the country, which increased by 364% from 1994 to 2013 (USDA-AMS, 2013). Additionally, community supported agriculture programs (CSAs), first established in the 1980s, have grown to over 6,000 (Local Harvest, 2014). In the 2007 Census of Agriculture (USDA, 2007), 12,549 farms reported they sold products through CSA programs. While local food consumers tend to be well educated younger adults (25-45), at higher income levels, single or with one or two children at most, the demographic profile varies by product type and region. Their underlying concerns, such as food safety and diet/health, the environmental impact and/or sustainability of agricultural production, or their aim to sustain local agriculture and farmland, or support local business are the main motivators behind their demand for local foods (Vogel and Low, 2011). For example, local food provides consumers the opportunity to purchase high quality foods, often rated by consumers as fresher, more flavorful, with enhanced shelf life. Direct interaction with farmers provides the opportunity to learn about farming practices, which engenders trust in food safety and quality, as well as the environmental impact of the practices used. Similarly, consumers often seek organic or natural foods and are more trusting of individual farmers than large stores. Consumers also have the opportunity to purchase unusual or heirloom varieties, which may be difficult to find due to feasibility of long-distance shipping or lack of demand needed for traditional grocery outlets. Finally, some consumers feel that there is the potential to reduce fossil fuel usage and greenhouse gas emissions by choosing local foods over conventionally-sourced crops."}, {"section_title": "Do Consumers Pay More for Local Foods?", "text": "The straight answer is yes, some consumers do pay more for locally-grown foods. While the premiums consumers are willing to pay differ greatly by product and region, they demonstrate an upward trend over time. More importantly, even in the recent economic recession (2008-2012) the demand for and pricing of local foods continued to grow. In the Intermountain West, pricing premiums for locally labeled fresh fruits and vegetables range from 20 to 80% depending on the product (Curtis, Gumirakiza, and Bosworth, 2014). Unusual varieties, such as heirlooms or popular seasonal selections like melons, tend to bring the highest premiums. For meats, premiums for locally-sourced cuts range from 15 to 60% and are highest for beef cuts and pork products. For packaged products, like cheese and ice cream, premiums range from 15 to 35% (Bosworth, Bailey, and Curtis, in press)."}, {"section_title": "Where Is Local Food Offered?", "text": "While farmers markets, CSAs, and farm stands are the traditional direct local food outlets, commercial channels, such as box stores, national and local grocery stores, and restaurants now carry local foods. The National Grocery Association (2012) Consumer Panel found that the availability of locally grown produce and other local packaged foods were major influences on grocery shopping decisions as 87.8% of respondents rated local food availability as \"very or somewhat important,\" with 45.9% indicating \"very important.\" The need for \"more locally grown foods\" was the second most desired improvement among surveyed grocery shoppers at 36.6%, just under \"price/cost savings.\" Almost 30 percent of grocery shoppers said they would consider purchasing food elsewhere if their preferred store doesn't carry local foods. Only 5% indicated they shop for local foods at big-box retailers and 15% at national supermarkets. Larger grocery chains, such as Wal-Mart, Kroger, and Supervalu have incorporated local foods into their long-term strategies (A.T. Kearney, 2013). Wal-Mart plans to increase the share of locally grown produce to 9% in the U.S. and 30% in Canada by 2015 and Supervalu buys between 25 and 40% of its produce from local suppliers (A.T. Kearney, 2013). However, consumer distrust of large grocery chains is strong, which has paved the way for retailers such as Whole Foods and Trader Joe's, who specialize in local, organic, and natural foods. The demand for local foods in restaurants is also growing. The National Restaurant Association's (2013) Restaurant Industry Forecast reported that seven out of 10 consumers surveyed were more likely to visit a restaurant offering locally produced items, and six out of 10 said inclusion of local foods on the menu is a key attribute when selecting a restaurant. The forecast also cited locally sourced meats and seafood, locally grown produce, and environmental sustainability as a culinary theme were in the top four menu trends nationwide. As a result, restaurants often highlight their local products and the growers they source from on their menus and websites."}, {"section_title": "What Is the Economic Value of Local Food?", "text": "According to the USDA Census of Agriculture (2007), direct-to-consumer food sales accounted for only .4% of total agriculture sales and 5.5% of U.S. farms. But, the growth rate of direct food sales was twice that of total agricultural sales (105% vs. 48%) and increased threefold from 1992 to 2007 ($404 million to $1.2 billion). Another source (USDA-ERS, 2008), the Agricultural Resource Management Survey, estimated local food sales to be much larger at $4.8 billion in 2008 (or 1.6% of total agricultural sales), which included intermediate sales of local food to grocers, restaurants, institutions, and food service. The contribution of local food sales to the total food economy varies substantially by region, primarily due to differences in products offered, the geographic proximity to farming areas, and population density. For example, between 1992 and 2007, local food sales grew three times faster in the Far West and Rocky Mountain regions (Vogel and Low, 2011). Fresh fruits, vegetables, and nuts dominate local food sales, and thus, areas where the growing conditions favor their production see strong sales. The value of local foods is highest in metropolitan areas, where farmers markets and farms are near a large urban population center. Overall, the value of local food sold is highest in the Northeast and the West (A.T. Kearney, 2013)."}, {"section_title": "Conclusions", "text": "The \"buy local\" food movement continues to grow, but the form of its expansion has shifted from summer farmers markets and fresh produce to the development and availability of processed local foods such as jams, salsas, chips, cheese. Winter and year-round farmers and local markets are also expanding as consumers look to purchase local foods in the off-season. For example, both Salt Lake City and Denver have several winter markets. Fresh products at these markets often include produce grown in hoop houses or using other season extension techniques, as well as stored, frozen, and processed products."}]