[{"section_title": "Results", "text": ""}, {"section_title": "Discussion", "text": ""}, {"section_title": "Conclusion", "text": ""}, {"section_title": "References", "text": ""}, {"section_title": "Introduction:", "text": "Globally, fish production has increased steadily over the last five decades at a rate exceeding that of human population growth so that in 2012 mean World per capita fish consumption was estimated at 19.2kg compared with 9.9kg in the 1960s (FAO, 2014). This increase is generally seen as beneficial from a health perspective with fish consumption providing an important source of high quality protein, essential fatty acids and micronutrients (Kawarazuka, 2010). In many poorer regions where fish represents a significant portion of consumed animal protein, and where diet in general may lack diversity, the contribution of fish to overall nutrition may be especially significant (Belton et al., 2014, Thilsted, 2013. While total global fish production has continued to increase, the proportion supplied by capture fisheries has remained largely static since the late 80's onwards with increased production accounted for by the dramatic growth in the aquaculture sector which was estimated at 42.15% of total fisheries production in 2012 (FAO, 2014). Inland fish production represents an increasingly large proportion of total global fisheries production; 33.86% in 2012 compared with 28.43% in 200728.43% in (FAO, 2014. As with total global production the growth of the inland fishery sector is largely accounted for by a rapidly expanding aquaculture sector representing 78.32% of global inland fisheries production in 2012 (FAO, 2014), with pond culture of warm water fish species playing the largest role (Dugan et al., 2007). As well as providing an important source of food, aquaculture makes significant economic contributions in many regions and provides income and employment for an increasingly large number of people. It is estimated that around 16.5 million people are involved in aquaculture worldwide, with approximately 16 million of these in Asia (FAO, 2012). As well as those directly involved in aquaculture production there will be many more individuals whose livelihoods are at least partially connected to the aquaculture sector via the supply of goods and services such as: transportation, ice making, feed production and marketing. Overall, it is estimated that more than 100 million people depend on aquaculture for a living, either as employees in the production and support sectors or as their dependants (FAO, 2012). There is now a very strong consensus that the earth has experienced a significant warming trend during the 20th century, especially the second half, and continuing to the present time with an average global temperature increase in the region of 0.72°C for the period 1951-2012(IPCC, 2013. There is also strong agreement that this trend is at least partly a result of human driven increases in greenhouse gas concentrations (Cook et al., 2013, IPCC, 2013. It is likely that we are committed to at least some further warming as a function of the thermal inertia of the oceans and ice sheets (IPCC, 2013) and, as green house gas concentrations continue to increase steadily, some degree of additional warming seems inevitable. It is important to note that while warming is often discussed as a global average, change is not evenly distributed spatially. In general there is a tendency for greater than average warming over land areas with considerable variability both regionally and seasonally (IPCC, 2013). While there is less agreement among the current generation of climate models over precipitation regimes compared with those for temperature, patterns of precipitation are also projected to change with some areas becoming dryer while others become wetter (IPCC, 2013). Although aquaculture systems are to varied extents managed and controlled, with the possible exception of indoor recirculating systems they are dependent on local environmental and climate conditions (Kapetsky, 2000). Climate related drivers of change for aquaculture systems can largely be considered as: changes in temperature of inland water or sea surface waters (Hanson andPeterson, 2014, Ficke et al., 2007), changes in oceanographic variables such as currents and waves, changing sea levels and associated inland salination (Nguyen et al., 2014), changes in solar radiation, changes in the availability of fresh water (Hanson and Peterson, 2014), and changes in the frequency and / or intensity of extreme events (Handisyde et al., 2006, De Silva andSoto, 2009). These changes can have physiological impacts via changes in growth, development, reproduction and disease, ecological impacts through changes to organic and inorganic cycles, predation, ecosystem services, and operation impacts such as species selection, site selection, sea cage technology etc. (Handisyde et al., 2006). Potential relationships between changing climate and aquaculture are summarised in Table1. Given the uncertainties about future development and data limitations, broad-scale assessments of vulnerability to climate change often aim to rank areas by showing relative differences between them in terms of vulnerability rather than trying to quantify results. As well as providing useful tools for decision makers in their own right, broad assessments of vulnerability may also provide useful starting points for guiding further and more detailed research in specific areas.While such assessments for aquaculture are surprisingly uncommon, Doubleday et al. (2013) provides an example of a regional vulnerability assessment that is focused specifically on the aquaculture industry and used a two stage assessment process in conjunction with a consensus of expert opinion to rank 7 aquaculture species in terms of climate change-related risk for south-eastern Australia. To date, there have beenvery few attempts to investigate the spatial component offisheries related vulnerability to climate change at the global scale. Handisyde et al. (2006)  This working method of assessing vulnerability in relation to climate change was implemented in the Intergovernmental Panel on Climate Change third assessment report (McCarty et al., 2001) with similar approaches being applied in a range of vulnerability studies (e.g. Allison et al., 2005, Allison et al., 2009, Cooley et al., 2012, Metzger et al., 2005, O'Brien et al., 2004. Rather than representing data at the national level using only a simple numerical index the current assessment makes use of a GIS to represent and combine data spatially using a series of raster grids. Along with allowing for easy visual interpretation of results and intermediate stages of the vulnerability assessment, the use of gridded data within a GIS also enables the combination of data that are available at varied resolutions while maintaining as much detail as possible. Data in the current assessment represent local conditions and are best viewed as an indicator of vulnerability to direct impacts on aquaculture as a result of climate change. Ways by which climate changewillindirectly impactaquaculture may be subtle, complex and hard to identify or quantify, operating at a range of scales from local to global. It is likely that in many cases community level studies will probably be needed to unpick the pathways involved (Handisyde et al., 2006). That said, given that analysis is strongly dependent on metrics of sensitivity (per capita aquaculture production quantities and value) and adaptive capacity (with these components also represented in isolation in the current study it could be suggested that the indication of nations where aquaculture production is especially significant and where adaptive capacity is low may also provide some indication of countries where indirect impacts may be significant and further investigation may be warranted."}, {"section_title": "Study extent and data selection", "text": "The study area was global in extent with spatial data represented on a latitude-longitude grid at 10 arcminute resolution (approximately 18.6km at the equator). The first priority when selecting data was its availability and consistency across all areas. In practical terms this limited selection to those data sets that are already available with global coverage. Such data are often available at limited spatial resolution which in many cases means at the national level. A second priority for data selection and the modelling process was that it should be as focused as possible with a moderate number of relevant indicators. Global indices of vulnerability have received criticism for lacking such focus (Füssel, 2010, Gall, 2007 and while use of a large number of broad ranging indicators may seem attractive in terms of inclusivity and give the impression of a more 'sophisticated' modelling process, it is worth considering that as the number and scope of indicators is increased their individual power and focus is typically reduced.The third priority when selecting indicators of exposure to climate change for the current assessment was choosing those likely to be generally applicable across a broad range of aquaculture practices. In view of this indicators relating to temperature, water availability and the potential impacts of extreme events were considered most appropriate. While climate related changes in salinity are likely to be minimal in the context of offshore mariculture, for inland culture in costal and estuarine areas changes in salinity may be important. Unfortunately, good quality data relating to salinity in coastal areas is lacking at the local level let alone at the global scale and thus is omitted from the current study. Changes in pH in response to increasing levels were also excluded from the current study, again due to data limitations but also as it was viewed as an issue for certain subsections of marine aquaculture, notably bivalve production (Gazeau et al., 2007, Narita et al., 2012), and thus more applicable to studies focusing on this sector and specific locations. Details of all data sets used in the current assessment are provided in Table 2. Countries included in the current assessment were those where data were present for all indicators. In practice this was dictated by the indication of any amount of production for the given culture environment in the FishStat database (FishStatJ, 2013). The total number of countries included for each culture environment were; 167 (freshwater), 69 (brackish), and 73 (marine). Apart from projected changes for surface air temperature and precipitation, data representing current conditions were used meaning that current aquaculture-related vulnerabilities were assessed in relation to potential future climate changes. For more specific and localised assessments of vulnerability with access to a greater range of high quality data it may be possible to produce future projections for a wider range of indicators. In the case of the current assessment, and notably in relation to aquaculture trends and to a large extent adaptive capacity, the view was taken that attempting to extrapolate future scenarios over a time period relevant to climate change is likely to introduce considerable inaccuracies into the modelling process and that the use of current indicators in association with future climate scenarios provides the best proxy when comparing vulnerability at a broad scale (Adger and Kelly, 1999, Vincent, 2004, Allison et al., 2009)."}, {"section_title": "Overview of model structure", "text": "The model followed a hierarchical structure where a range of indicators were combined to represent the sensitivity, exposure and adaptive capacity components (described elsewhere in this document as sub-models) which were then combined to indicate vulnerability (Fig 1). It should be noted that not all inputs are necessarily used at any one time with the choice of inputs and weightings (level of influence within the model) varying depending on the culture environment being evaluated, e.g. fresh, brackish or marine. Full details of layer combinations and weightings are provided in Tables 3 (freshwater aquaculture), 4 (brackish water aquaculture), and 5 (marine aquaculture)."}, {"section_title": "Data standardisation", "text": "In order for indicators to be combined they must be transformedto a common scoring system. For the current assessment the majority of the input data sets were in the form of a continuous numeric series, for example increase in temperature in degrees centigrade. All data were standardised to a continuous scale from 0-1 with higher numbers representing greater vulnerability, lower adaptive capacity, greater exposure, or greater sensitivity. In terms of the modelling process and interpretation of results this effectively represents a continuous series as opposed to a number of distinct classes. Details of how data were standardised for all variables used are provided in Table 6."}, {"section_title": "Sub-model construction", "text": ""}, {"section_title": "Sensitivity", "text": "Sensitivity in the context of the current assessment aims to indicate the significance of aquaculture to people within a country and thus how sensitive their livelihoods may be to impacts on the aquaculture sector. Aquaculture production is considered on a per capita basis so total population size of countries does not influence the analysis. Two metrics are included in the sensitivity sub-model: aquaculture production quantity (kilograms per capita excluding aquatic plants) and aquaculture production as a percentage of GDP (again excluding aquatic plants). Quantity of aquaculture products per capita aims to represent the physical size of the aquaculture sector within a country. While the type, scale, and intensity of aquaculture operations will be significant it is assumed that, in general, nations with a high per capita production of aquaculture products are likely to have a greater percentage of their population whose livelihoods' are either directly linked to aquaculture production, or indirectly linked through the supply of goods and services to the industry. Viewing aquaculture production as a percentage of GDP gives an indication of aquaculture's importance to the economy. Aquaculture's contribution to the economy will not only be dependent on the scale of aquaculture production within a country in terms of physical quantity but also on the relative value of aquaculture products being produced and the overall size of the national economy. In richer countries it is likely that not only will aquaculture make a smaller contribution to overall wealth, but people are more likely to have economic alternatives and thus be more able to adapt to potential impacts and change. This issue is further addressed within the adaptive capacity sub-model in the current assessment in terms of per capita GDP. National level statistics for aquatic animal production quantities (tonnes) and values (US dollars) were obtained from Fisheries Department of the Food and Agriculture Organization of the United nations via the FishStat database (FishStatJ, 2013). Data were also sorted by culture environment which are defined by the FAO as: freshwater, brackish or marine. For both quantity and value statistics, data for the three most recent years available (2008 to 2010) were averaged with the aim of reducing the effect of the inter-annual fluctuation that is seen, especially in countries with lower levels of production. Figures for GDP for the same 2008 to 2010 period were obtained from the World Bank (World_Bank, 2013) while population data for the same period were obtained via the United Nations population division (UN_Population, 2013)."}, {"section_title": "Exposure", "text": "Exposure to climate change in the context of the current assessment can be viewed as the relative extent of change between locations rather than an attempt to quantify actual changes. Future changes in annual mean surface air temperature and precipitation are considered while water balance (precipitation minus actual evaporation) is used as a proxy for current water availability. Population density is also included in the exposure sub-model based on the assumption that in areas with higher population densities the potential impacts of climate change may be increased through mechanisms such as increased requirements for resources such as water (Murray et al., 2012), and greater environmental pressure e.g. through increased pollution. As a proxy for future risk from such events the frequency of past climate extremes in the form of cyclones, drought and flood events is used in the exposure sub-model based on the assumption that any increases in the intensity or frequency of these extremes is likely to be significant in areas where they are already common (Handisyde et al., 2006, Islam andSado, 2000). Data from an increasingly large number of climate models are now available and when operating at the global scale the combined results from an ensemble of climate models typically show greater skill in reproducing the spatial details of climate when compared to a single model (Fordham et al., 2011, IPCC, 2007, Pierce et al., 2009, Reichler and Kim, 2008. For the current assessment gridded global data for projected changes in annual mean surface air temperature and precipitation levels were obtained at 2.5 degree resolution using MAGICC/SCENGEN (version 5.3.v2) (Wigley, 2008). MAGICC is a software package that integrates a number of coupled gas-cycle, climate and ice-melt models. It allows for the exploration of projections for: average global surface air temperature, greenhouse gas concentrations and average global sea level change under a wide range of green house gas emission scenarios. The global average warming scenarios generated by MAGICC are fed into SCENGEN where libraries of observed climate data are used along with the CMIP3 (Meehl et al., 2007) data base of climate model outputs generated for the IPCCs fourth assessment report (IPCC, 2007) to generate spatially explicit change scenarios. The key advantage of using the MAGICC/SCENGEN package in the current studyis that it removes the influence that differences in sensitivity between Atmosphere-Ocean General Circulation Models (AOGCM) would have when constructing patterns of change. While the CMIP3 ensemble of AOGCM results contains outputs from 24 models only 20 of these are available for selection in SCENGEN due to the availability of necessary variables. For the current assessment all 20 AOGCMS were selected in SCENGEN for the pattern scaling process. The global mean warming used to drive SCENGEN was 2°C based on a year 1990 base point. Multiple warming scenarios were not considered relevant to the current assessment as the aim is to show relative differences between global areas, rather than quantify vulnerability in relation to a given amount of warming, and the spatial distribution of results from SCENGEN change in a largely linear way in relation to overall mean surface air temperature change."}, {"section_title": "Adaptive capacity", "text": "Adaptive capacity in the current assessment was based on the United Nations Human Development Index (HDI) (Malik, 2013). The HDI represents a globally complete and consistent data set that is based on the combination of health (life expectancy at birth), education (combination of mean years of schooling and expected years of schooling) and living standards (gross national income per capita). All components within the HDI are transformed to a 0-1 scale before being combined by calculating the geometric mean of the three components. Füssel 2010 Vulnerability assessment:model component combination and weightings Handisyde et al. (2006) conducted an evaluation of global aquaculture vulnerability to climate change that incorporated spatial data and was also based on the concept that vulnerability is a function of sensitivity, exposure, and adaptive capacity. The authors used weighted arithmetic means to combine data and the resulting sensitivity, exposure, and adaptive capacity sub-models. A similar approach was taken by Allison et al. (2009) for capture fisheries although in that case all variables had equal weightings. One potential drawback of averaging a large number of variables is that the power of each individual variable is reduced. In terms of assessing aquaculture vulnerability using mostly national level statistics, a key issue is the distinction between areas producing very little and large amounts of aquaculture products on a per-capita basis. In the case of Handisyde et al. (2006) some areas with little aquaculture production were indicated as vulnerable due to scoring highly in terms of exposure and adaptive capacity indicators. If the aim is to evaluate where any aquaculture-related livelihoods may be at risk then this is not an issue but if the aim is to highlight areas where greatest overall impact on livelihoods is likely when they are viewed as a whole then there are limitations. In order to address the above issues in the current assessment considerable emphasis was placed on the sensitivity component based on kg per capita production of aquatic species and contribution to GDP. In practice this means that countries where aquaculture production is very low are indicated as being significantly less vulnerable and in these cases the sensitivity component of the model becomes much less relevant. In these cases studying the outputs of the adaptive capacity and exposure sub-models in isolation can provide useful insights into potential vulnerability that are not affected by overall scale of aquaculture production. A further potential improvement in the current assessment when compared with Handisyde et al. (2006) is the use of a continuous scale (0 to 1), rather than 5 discreet classes, allowing for greater differentiation between areas in terms of vulnerability and its contributing components. All weightings were assigned by the authors after consultation with a focus group consisting of a range of experts within the Institute of Aquaculture, Stirling. Details of weightings used for the freshwater, brackish water, and marine assessment are given in Tables 3 to 5. The use of a geometric mean for the final combination results in very low values exerting a greater influence on the final output. In practice this means that countries where aquaculture production is very low are indicated as being significantly less vulnerable. This approach was considered appropriate based on the assumption that higher levels of aquaculture production within a region are likely to be at least partially associated with a greater number of livelihoods being either directly or indirectly linked to the sector and/or greater levels of dependence for both food and income. Vulnerability results were aggregated in order to produce national averages and allow ranking nations using the following procedures; for freshwater gridded vulnerability values were averaged over the entire land area of each country. For brackish water vulnerability values were a averaged over land area within 50km of the coast. For mariculture vulnerability values were average over each countries coastal waters for an area extending 50km offshore. This is potentially valuable when considering nations where aquaculture production is currently low as a national average but where an indication of vulnerability is needed for those who are involved in the sector. It may also be possible that countries where aquaculture is less significant will be less able, or prepared, to invest in adapting to impacts on production. In terms of vulnerability related to freshwater aquaculture, Asia with its large aquaculture sector features strongly with Vietnam indicated as the most vulnerable country followed by Bangladesh, Laos, and China. Within the Americas Belize, Honduras, Costa Rica and Ecuador appear most vulnerable.Uganda is indicated as the most vulnerable country in Africa followed by Nigeria and Egypt (Fig 2). It is worth noting that while African countries are ranked quite low in the overall vulnerability assessment due to relatively low levels of aquaculture production many are indicated as having very low levels of adaptive capacity (Fig 11). For brackish water production Vietnam again has high vulnerability scores as does Ecuador. Egypt with its aquaculture production within the Nile delta and Thailand with its significant brackish water production of crustaceans also feature strongly (Fig. 3). When considering adaptive capacity alone ( to suggest that future studies should consider separating inland and marine fisheries. Taking the above recommendation into consideration data for these environments were extracted from the FAO FishStat database (FishStatJ, 2013). However, distinctions between these categories are not always clear and decisions taken by those reporting on production will have an influence, especially in the case of fresh and brackish water where there is a continuum between the two environments. It is worth noting that the bulk of production listed as taking place in brackish water is of crustaceans while for fresh water it is of cyprinids suggesting that the environmental distinctions are likely giving a reasonable indication of the type of aquaculture taking place in many cases. While there will be situations where both inland and coastal ponds could be affected by changes in temperature and precipitation leading to water quality and availability issues, the effects of cyclones and associated storm surges are most likely to affect coastal regions and pose a threat to brackish and marine aquaculture. It is also worth noting that the accuracy of reporting of aquaculture production is likely to vary between countries with both over and under reporting being a possible issue. For potential future vulnerability assessments being conducted at the national, or particularly sub-national level, it may be practical to pursue other data sources although errors in reporting at the farm level would be difficult to address in anything other than extremely detailed and localised investigations. For a global assessment, such as the current one, the view is taken that aquaculture production data available via FAO FishStat (FishStatJ, 2013) provides the most complete and consistent source, and can be viewed as a useful indicator. The application of higher resolution gridded indicators of exposure in combination with national level indicators of sensitivity and adaptive capacity raises the issue of how to combine data at differing resolutions. One approach would be to represent climate change data as national averages effectively removing the spatial element of the current assessment beyond that of ranking at the national level. Such an approach is defensible in terms of methodology and has been used in previous vulnerability assessments including those investigating the vulnerability of fisheries-related livelihoods to climate change (Allison et al., 2005, Allison et al., 2009. A key drawback of working at the lowest resolution is that valuable information contained within the higher resolution data may be lost. This can be illustrated using a hypothetical example of a large country with projected decreases in precipitation over half the country while an increase is projected over the other half. While these changes may be significant in terms of factors such as water availability, floods and droughts, when considered as an average over the entire country they may largely cancel each other out resulting in very little or no indicated change. This said, combining spatial data at different resolutions is not without potential issues which have been reviewed by Gotway & Young, (2002). In the context of the current study the smoothing effect that accompanies the low resolution, national level data used to indicate sensitivity and adaptive capacity removes the heterogeneity that will exist within countries. This results in the higher resolution exposure component being combined with sensitivity and adaptive capacity values that are limited to representing a national average rather than the spatially variability that will exist."}, {"section_title": "Issues of multi-resolution data combination can perhaps be considered of most concern", "text": "when results are represented as spatially detailed maps without adequate explanation of how they were derived and in which context they should be applied. In the case of the current study the sensitivity and adaptive capacity components are weighted more strongly than the exposure component. The result is a global indication of vulnerability where the biggest differences are seen between countries with sub-national variability being relatively small. While keeping the points outlined above regarding the combination of multiple resolution data in mind and accepting the limitations of national level data, it is suggested that the outputs from the current assessment are best viewed as a valuable global overview of potential aquaculture vulnerability that primarily operates at the national scale but where the inclusion of the higher resolution exposure data provides additional useful information at the sub-national scale as to where physical effects of a changing climate may be felt most strongly. For tropical areas of central and south-east Asia where much aquaculture takes place projected warming over land is in line with or only slightly above the global average with greater increases projected as one extends further north into China. Vietnam stands out as scoring highly for vulnerability across all three culture environments as well as scoring highest in terms of freshwater aquaculture where the production of catfish (Pangasianodon hypophthalmus, Pangasiidae) in the Mekong delta area has seen substantial growth in recent years. Nguyen et al. (2014) modelled the impact of sea level rise related salinity change and flood events on in the Mekong delta and suggest that some areas currently involved in the production of Pangasianodon hypophthalmus may be negatively impacted. Many of the countries indicated as vulnerable in relation to fresh and brackish water production are located within the tropics where much aquaculture production is derived from relatively shallow ponds, and where potential changes in temperature regimes and water availability may pose risks. Higher average temperatures will result in an increasing number of very hot days or heat waves when compared to current conditions. This in turn may result in direct thermal stress of cultured animals especially where they are near the limits of their range. While average higher temperatures may not be fatal for species nearing the upper limits of their ideal temperature range they may reduce profits though changes in feeding behaviour and feed intake (Hevrøy et al., 2012) or bioenergetic performance and feed conversion ratios (Handisyde et al., 2006, De Silva andSoto, 2009). Increased risk of disease for aquaculture species may also be an issue associated with increasing temperatures in some areas (e.g. Callaway et al., 2012, De Silva and Soto, 2009,Handisyde et al., 2006. While the current model associates vulnerability with increasing temperatures, an approach that has been adopted in previous studies (Allison et al., 2009, Handisyde et al., 2006, there will also be situations where increasing temperatures enhance production of certain species through mechanisms such as: improved growth rates, longer growing seasons, and increased primary productivity (Bell et al., 2013, Lorentzen, 2008. In the present model where the aim is to investigate non-specific climate-related vulnerability of all aquaculture, it is suggested that relating temperature increase to vulnerability is still the best use of the data. However for future studies with a narrower focus in geographic range and culture species, there may be the opportunity to consider both positive and negative impacts on aquaculture performance. This point can be further illustrated by looking at Norway, the country indicated most vulnerable in the current model in terms of mariculture production despite having a high level of adaptive capacity. Norway's high vulnerability sore is a consequence of very high per-capita production and above average increases in projected ocean surface air temperature. However it has been suggested that increasing sea temperature within the region may enhance growth performance and thus production, especially in more northern areas (Lorentzen, 2008) although it is worth noting that the analysis is based on temperature dependent growth models and does not consider other potential impacts such as disease (Callaway et al., 2012). The AOGCM ensemble incorporated within the MAGICC/SCENGEN package suggests a general trend for increased precipitation over central Asia and China while very little change or slight increases are projected for south East Asia. East Africa is expected to see increased precipitation while a decrease is projected for the Mediterranean, North Africa and Southern Europe. Decreases in precipitation are also projected for Central America and Eastern Brazil. Decreasing water availability has the potential to negatively affect aquaculture through mechanisms such as: reduced water quality leading to increased levels of stress in culture organisms and potentially disease, greater competition for water use from other sectors, and changes in salinity (Handisyde et al., 2006, Ross et al., 2009. A general trend for reduced water availability may potentially enhance the effect of short term weather extremes such as heat waves which in themselves are likely to be more extreme in a climate with a higher average temperature. Both diurnal temperature variability of surface water and temperature stratification in aquaculture ponds can be substantial while diurnal variability is notably reduced at relatively modest depths of 80 to 100cm (Culberson andPiedrahita, 1996, Losordo andPiedrahita, 1991). During a series of informal interviews conducted by the authors with fish and shrimp pond farmers in Bangladesh (2008) it became clearthat high temperature and drought were viewed as a single problem with the reasoning that when water is scarce temperatures tend to be high and that it is reduced water levels in ponds that allow temperature to have an impact on cultured organisms as there is little chance for them to move to cooler deeper water. The present assessment associates reduced water availability, in terms of precipitation change and current water balance, with vulnerability for inland aquaculture. An accepted limitation of the model is that these variables are considered on a per grid square basis with no mechanism for lateral flow between cells and thus flow accumulation within water courses. Parish et al. (2012) has argued that the use of a simple per grid cell approach to water availability as opposed to more complex routed runoff models can be valid as it allows use of easily available data sources, such as runoff values, taken directly from AOGCMs. A similar point of view is adopted here in terms of the use of MAGICC/SCENGEN where only precipitation, surface air temperature, and air pressure data are available. While a significant amount of aquaculture will rely on ground and surface water that will be involved in inter-cell drainage, there is also much, possibly belonging to poorer smaller scale aquaculture producers, that is at least partially dependent on localised runoff and rainfall. The range of indicators of exposure to climate change that were available at the global scale for marine aquaculture were more limited with only ocean surface air temperature change and cyclone data being used. Changes in primary productivity may also become significant, and as previously highlighted in relation to increased temperatures, bothpositive and negative consequences may result depending on area, current patterns, and local ecosystems (Blanchard et al., 2012, Brown et al., 2010, Chassot et al., 2010. With this in mind areas indicated as being most vulnerable in the current assessment should be viewed as high priorities for more detailed investigation where it is possible that both positive and negative implications for aquaculture may be found depending on the species and culture system being considered. Accurate modelling of potential impacts on marine culture systems may need to take place at a more localised scale using high resolution data to try to account for variables such as local variations in current, temperature and primary productivity. In some areas there are significant inter-annual variations associated with processes such as El Niño/La Niña-Southern Oscillation which will also need to be considered by extending investigations over longer time periods and / or for a range of scenarios. A further significant potential impact for marine aquaculture related directly to increasing atmospheric carbon dioxide levels as opposed to changing climate is ocean acidification. From an aquaculture perspective the most obvious threat is to growth and survival rates for species forming calcareous structures such as the shells of bivalve molluscs (Gazeau et al., 2007, Narita et al., 2012. Cooley et al. (2012) assessed vulnerability of nations to ocean acidification impacts on mollusc production, both wild and aquacultured, based on: contributions to the economy and dietary protein (sensitivity), time until a modelled transient decade where water conditions are significantly altered so that current levels of mollusc harvest cannot be guaranteed (exposure), and adaptive capacity. While not addressed specifically in the present model, ocean acidification is a global issue where the extent of impacts for aquaculture will be strongly related to culture species as well as localised ecosystems and water conditions. Future research could potentially apply the approach used in the current assessment but with the sensitivity component adjusted to focus on species most likely to be affected by lowered pH and the exposure component adjusted to indicate areas where pH is already lower. With reference to all three culture environments the current study, being global in scope, was significantly constrained in terms of data availability but can be considered as a strong starting point for understanding the spatial distribution of aquaculture related vulnerability to changing climate at the global scale. Further work within this area should certainly be encouraged.The investigationof the interaction of individual climate variables with aquaculture production may be valuable but is likely to be best suited to more localised studies where specific aquaculture practices, species, and localised environmental conditions can be considered. There is likely to be significant scope for the application of spatial data when modelling climate change interactions at the national and sub-national scale where a greater variety of data may exist with improved accuracy and resolution. There have been a number of attempts to model aquaculture pond temperature in relation to climate variables either though energy balance approaches (Cathcart & Wheaton, 1987;Losordo & Piedrahita, Nath, 1996) or via regression (Wax & Pote, 1990). The refinements of such approaches in combination with the application of data generated by future climate modelling community is another potentially valuable research area along with efforts to predict likely changes in water availability, salinity and quality for aquaculture. While direct effects of climate change on aquaculture are obvious targets for investigation future efforts to understand less direct interactions should also be strongly encouraged with changes to feed supplies, the supply of other goods and services, and competition with other users of resources such as water being possible areas of importance. Finally while understanding the mechanisms and locations of aquaculture related vulnerability to climate change is vitally important there will also be areas of opportunity and adaptation if appropriatespecies and culture systems can be matched to a changing pattern of environmental conditions. In this respect future modelling using spatial data should be seen as especially valuable."}, {"section_title": "Conclusion:", "text": "The current assessment improves on the only previous global evaluation of vulnerability of aquaculture related livelihoods to climate change (Handisyde et al., 2006).A notable advancement is theapplication of a more sophisticated set of climate change projections in the form of a multi-model ensemble of data obtained using the MAGICC/SCENGEN package. Improvements are also made in along with changes in data processing via the use of a geometric rather than arithmetic meanto reduce the likelihood of countries with very small aquaculture sectors (low sensitivity) being considered as highly vulnerable in situations where metrics for exposure and adaptive capacity scored highly. To complement this approach the impacts of exposure and adaptive capacity were also considered in isolation to provide insight into where vulnerability may exist irrespective of national aquaculture industry size. Such a view may be especially useful when considering areas with emerging aquaculture industries that may be expected to develop significantly in the future. Due to their substantial aquaculture industries a number of Asian countries, Vietnam, Laos, Bangladesh, and to a lesser extent China, were considered most vulnerable to impacts on freshwater aquaculture production. Vietnam along with Ecuador was also considered highly vulnerable in terms of brackish water production. Norwegian mariculture was indicated as most vulnerable to climate change despite being one of the world's most highly developed countries. Chile, another nation with relatively high levels of development also scored highly. The results in the case of Norway and Chile were influenced by the extremely high Allison, E., Adger, W., Badjeck, M.-C., Brown, K., Conway, D., Dulvy, N., Halls, A. & Perry, A. 2005. Effects of climate change on the sustainability of capture and enhancement fisheries important to the poor: analysis of the vulnerability and adaptability of fisherfolk living in poverty. Final Technical Report. Allison, E. H., Perry, A. L., Badjeck, M. C., Neil Adger, W., Brown, K., Conway, D., Halls, A. S., Pilling, G. M., Reynolds, J. D. & Andrew, N. L. 2009. Vulnerability of national economies to the impacts of climate change on fisheries. Fish and fisheries, 10, 173-196. Tables: Table 1. Potential impacts of climate change on aquaculture systems(farmed species and surrounding ecosystems) and production. (Adapted from: Handisyde et al., 2006)."}, {"section_title": "Drivers of change", "text": "Impacts on culture systems, both positive (+) and negative (-). Likely pathway: d = direct impacts, i = indirect impacts, di = both direct and indirect impacts. Operational impacts, both positive (+) and negative (-)."}, {"section_title": "Sea surfacetemperature changes", "text": " Increase in harmful algal blooms that release toxins in the water and produce fish kills (-  LandScan 2008 data (Oak_Ridge_National_Laboratory, 2008) Actual evapotranspiration (mm per year) Raster grid (30 arcminutes) (Fisher et al., 2008) Precipitation (mm per year) Raster grid (10 arcminutes) CRU CL2 (New et al., 2002) Projected     Table 6. Details of data standardisation to a common 0 -1 scoring system."}, {"section_title": "Variable Standardisation details", "text": "Aquaculture production quantity (kg per capita) Aquaculture production data were standardised to values ranging from 0 to 1 using a linear relationship where 0 represents areas with no aquaculture production and 1 equates to the area with highest production. The one exception was for mariculture where the Faroe islands which are the largest per capita producers of mariculture products were excluded as complete data needed for other areas of the model were not available."}, {"section_title": "Aquaculture production value (percentage of GDP)", "text": "As above"}, {"section_title": "Human Development Index (HDI)", "text": "All values were standardised over the range 0 to 1 using an inverse linear relationship so that the country with the lowest HDI value receives a new value of 1 and the one with the highest HDI value receives a new value of 0. Population density Population density data were standardised using a linear relationship so that areas averaging more than 1000 people per square km were given a value of 1 and areas indicated as having no population were given a value of 0."}, {"section_title": "Projected temperature change", "text": "Temperature change data were standardised to values ranging from 0 to 1 based on a linear relationship between 3 standard deviations below and above the mean increase. For the fresh and brackish water models the mean value was derived from all land areas between 60 o S and 60 o N. For the marine model the average increase was obtained using a 20km buffer around all land areas between 60 o S and 60 o N. The 60 o north and southcut off was applied to exclude high latitude areas that are projected to warm significantly more than other areas but are generally insignificant in aquaculture terms."}, {"section_title": "Projected precipitation change", "text": "Projected precipitation change data were standardised to values ranging from 0 to 1 based on a linear relationship between 3 standard deviations above and below the mean value that was calculated over all land areas used in the assessment. This results in areas with the greatest projected decrease in precipitation being given the highest score and thus making the greatest contribution to vulnerability."}, {"section_title": "Cyclone risk", "text": "International Best Track Archive for Climate Stewardship (IBTrACS) data describing the number of cyclones that have occurred in a given area over the last 40 years were standardised to values ranging from 0 to 1 using a linear relationship with a value of 0 being assigned to areas with no recorded cyclones and 1 being assigned to the area with the highest number of recorded cyclones."}, {"section_title": "Flood risk", "text": "The Aqueduct Global Maps 2.0 flood occurrence data were already scaled from 0 to 5 with 5 representing areas with highest occurrence of flood events. The data were rescaled using a linear relationship over the range 0 to 1."}, {"section_title": "Drought risk", "text": "The Aqueduct Global Maps 2.0 drought occurrence data were already scaled from 0 to 5 with 5 representing areas with highest occurrence of drought events. The data were rescaled using a linear relationship over the range 0 to 1. Water balance Water balance was calculated as precipitation minus actual evaporation. Water balance values were standardised using a linear relationship so that areas with a water balance of 0mm per year receive a score of 1 while areas with 1000mm or more per year received a value of 0. 2 For brackish water vulnerability values were a averaged over land area within 50km of the coast. 3 For mariculture vulnerability values were average over each countries coastal waters for an area extending 50km offshore. ** = countries appearing in the top 20 for all three culture environments. * = countries appearing in the top twenty for two of the three culture environments.               "}]