[{"section_title": "INTRODUCTION", "text": "This report is based on final data from two Federal surveys. The first is the U.S. Department of Education's Integrated Postsecondary Education Data System (IPEDS) Completions Survey conducted annually by the National Center for Education Statistics (NCES). The second is the Survey of Earned Doctorates, conducted annually for the National Science Foundation (NSF) and five other Federal agencies. In addition, population data on various age groups for tables 56-58 were obtained from Current Population Surveys conducted by the Census Bureau. Each source is described in more detail in the following sections. Data from the Completions Survey were used to report the number of bachelor's and master's degrees. The data on doctoral degrees in this report were derived from the Survey of Earned Doctorates, which surveyed all individuals earning research doctorates, rather than from the Completions Survey, which surveyed the institutions awarding the doctorates. The Survey of Earned Doctorates data were preferred because the data provided by individuals are more specific with respect to the field of specialization and are less prone to errors in data reporting and data entry than are the data provided in aggregates by institutions. Furthermore, doctorate data provide 100 percent coverage for data by field and sex of individual recipients, whereas institutional data are subject to imputation for nonresponse. For a comparison of reporting on doctoral degrees in the Completions Survey and the Survey of Earned Doctorates, see National Science Foundation, Science and Engineering Doctorates: 1960-91, NSF 93-301, Detailed Statistical Tables (Washington, DC, 1993."}, {"section_title": "BACHELOR'S AND MASTER'S DEGREE DATA", "text": "In the Completions Survey, data are collected on all degrees conferred between July 1 and June 30 from the universe of accredited institutions of higher education in the 50 states, the District of Columbia, and the U.S. territories and outlying areas. The survey forms are filled out by institution administrative personnel. The data are collected according to sex of recipient and field of study. In 2000, the final universe of institutions granting bachelor's or higher level degrees was 2,425. Each year between 1966 and 2000, institutional responses to these surveys exceeded 85 percent. Imputations for nonresponse were based on the previous year's response 5 for an institution, if available. For bachelor's degree data, 0.3 percent were imputed and for master's degree data, 0.6 percent were imputed. Because the data in this report include those for institutions in the U.S. territories, they may differ from numbers published by NCES that relate only to the 50 states and the District of Columbia and their field groupings. Data on degrees by field of study were collected according to the Classification of Instructional Programs, developed by NCES. Four field classification systems were used during the 1966-2000 period. (See \"Current Classification Schemes.\") DOCTORAL DEGREE DATA In the Survey of Earned Doctorates, information is collected during the period of July 1 of one year to June 30 of the next from all persons who have fulfilled the requirements for a research doctorate. The survey is funded jointly by NSF and five other agencies: the U.S."}, {"section_title": "Department of Education, the National Institutes of", "text": "changes in field classifications and evolving fields of study. Data for the earlier years are presented as consistently as possible with the classification schemes of fields of study, which show the Completions (for bachelor's and master's degrees) and the Survey of Earned Doctorates field codes (for doctorate degrees) used in this report (beginning in section Cpage 73)."}, {"section_title": "SECTION B.", "text": ""}, {"section_title": "DETAILED STATISTICAL TABLES", "text": ""}, {"section_title": "11", "text": "LIST OF TABLES -= Detailed national data were not released for the academic year ending 1999 by the    233 11,813 19.0 16,853 2,520 13.0 195,888 107,667 35.5 50,034 17,230 25.6 14,199 3,454 19.6 1979 193,247 109,915 36.3 46,614 17,612 27.4 14,128 3,744 20.9 1980 191,215 113,480 37 ,783  707,350    1,062,151  329,094  64,705  13,425  2,776  42,369  46,451  54,018  105,350  733,057   1,107,997  337,675  62,187  13,678  2,728  40,194  48,783  58,893  111,212  770,322    1,150,072  355,265  61,941  13,875   3,201   39,889  54,193  64,033  118,133  794,807   1993  1,179,278  366,035  62,705  14,188  3,503  39,433  59,621  67,251  119,334  813,243    1,183,141  373,261   63,012  14,655  3,868  39,185  65,268  69,768  117,505  809,880    1,174,436  378,148  63,371  14,897  4,478  38,620  71,470  72,601  112,711  796,288   1996  1,179,815  384,674  63,114  15,396  4,457  37,621  78,469  73,828  111,789  795,141   1997  1,186,589  388,482  62,352   15,264  4,466  38,116  82,500  74,734  111,050  798,107   1998  1,199,579  390,618  60,914  15,273  4,321   39,768  85,079  74,457  110,806  808,961   1999   -----------2000  1,253,121  398,622  59,536  14,580  4,047  49,123  83,148  74,654  113,534  854,499 KEY: -= Detailed national data were not released for the academic year ending 1999 by the National Center for Education Statistics."}, {"section_title": "NOTE:", "text": "See section C for specific fields that are included in each category.   196 24,541 11,657 47,257 175,191 1968 359,747 165,200 37,464 14,602 2,105 15,243 27,175 13,791 54,820 194,547 1969 412,865 189,272 41,270 15,962 2,633 17,915 31,190 16,758 63,544 223,593 1970 453,605 204,528 44,433 15,547 3,008 18,593 33,747 19,067 70,133 249,077 1971 478,423 209,318 44,887 15,317 3,179 17,488 34,712 21,117 72,618 269,105 1972 503,631 216,422 45,219 14,161 3,560 17,466 36,514 23,267 76,235 287,209 1973 521,534 225,090 46,203 13,826 3,842 17,543 40,908 25,110 77,658 296,444 1974 530,907 223,652 42,550 13,686 4,055 16,851 45,174 25,849 75,487 307,255 1975 508,424 210,741 38,979 12,990 4,050 14,729 46,937 24,333 68,723 297,683 1976 508,549 205,570 37,473 13,280 4,124 14,071 48,168 22,987 65,467 302,979 1977 499,121 198,805 39,313 13,560 4,479 13,241 47,339 20,692 60,181 300,316 1978 491,066 195,888 43,769 13,453 4,709 12,815 44,852 18,517 57,773 295,178 1979 481,394 193,247 48,588 13,358 4,695 13,249 41,994 16,649 54,714 288,147 1980 477,750 191,215 52,858 13,285 4,693 14,439 38,931 15,590 51,419 286,535 474,336 190,977 56,654 13,137 5,028 16,672 35,265 14,447 49,774 283,359 477,543 193,624 59,185 12,737 5,254 19,966 33,222 13,756 49,504 283,919 483,395 194,380 63,018 11,586 5,450 22,802 31,132 13,228 47,164 289,015 486,750 199,150 65,424 11,175 5,991 27,893 29,108 12,949 46,610 287,600 486,660 203,402 66,326 11,434 5,715 32,985 28,172 12,815 45,955 283,258 490,143 204,743 65,682 11,088 4,722 35,920 27,488 12 ,691   47,152  285,400   485,003   199,981  63,021  10,792  3,629  34,871  26,168  13,399  48,101  285,022   481,236  191,549  59,375  9,673  2,707  32,112  24,550  13,584  49,548  289,687   487,566  189,338  56,759  9,777  2,380  29,682  23,852   14,291   52,597  298,228   495,867  189,082  54,732  9,106  2,001  27,184  24,050  15,399  56,610  306,785   508,952  189,328  52,522  9,253  1,946  25,700  25,007  16,155  58,745  319,624   525,395  195,779  52,305  9,289  2,177  25,693  27,473  17,130  61,712  329,616   537,536  200,315  52,724  9,424  2,453  25,483  30,439  18,029  61,763  337,221   537,061  202,284  52,609  9,588  2,665  25,397  33,347  18,749  59,929  334,777   531,146  202,217  52,421  9,605  2,954  25,066  35,915  19,638  56,618  328,929    528,000  203,341  51,798  9,694  2,972  24,857  39,100  19,965  54,955  324,659   525,282  201,471  50,882  9,382  2,924  25,324  39,967  19,491  53,501  323,811   525,714  200,221  49,575  9,279  2,722  26,670  40,235  19,057  52,683  325,493    -------2000  536,158  197,669  47,320  8,590  2,430  33,045  36,726  17,540  52,018  338,489   KEY: -= Detailed national data were not released for the academic year ending 1999 by the National Center for Education Statistics.\nSee section C for specific fields that are included in each category.    4,582  847  18,765  22,375  31,794  41,791  393,864   542,605  133,483  10,188  4,371   801  16,595  21,679  34,663  45,186  409,122   566,284  140,012  9,973  4,319  775  15,185  22,401  38,619  48,740  426,272   599,045  148,347  9,665  4,425  782  14,494  23,776  42,738  52,467  450,698   624,677  159,486  9,636  4,586  1,024  14,196  26,720  46,903  56,421  465,191   641,742  165,720  9,981   4,764  1,050  13,950  29,182  49,222  57,571  476,022   646,080  170,977  10,403  5,067  1,203  13,788  31,921  51,019  57,576  475,103   643,290  175,931  10,950  5,292  1,524  13,554  35,555  52,963  56,093  467,359    651,815  181,333  11,316  5,702  1,485  12,764  39,369  53,863  56,834  470,482   661,307  187,011  11,470  5,882  1,542  12,792  42,533  55,243  57,549  474,296   673,865  190,397  11,339  5,994  1,599  13,098  44,844  55,400  58,123  483,468    ----------2000  716,963  200,953  12,216  5,990  1,617  16,078  46,422  57,114  61,516  516,010   KEY: -= Detailed national data were not released for the academic year ending 1999 by the National Center for Education Statistics.\nSee section C for specific fields that are included in each category."}, {"section_title": "SOURCE: Tabulated by National Science Foundation/Division of Science Resources Statistics; data from Department of Education/National Center for Education Statistics: Integrated Postsecondary Education Data System Completions Survey", "text": "BEST COPY AVAILABLE.   -= Detailed national data were not released for the academic year ending 1999 by the National  -= Detailed national data were not released for the academic year ending 1999 by the National  -= Detailed national data were not released for the academic year ending 1999 by the National    -= Detailed national data were not released for the academic year ending 1999 by the National BEST COPY AVAILABLE          -= Detailed national data were not released for the academic year ending 1999 by the National Center -= Detailed national da a were not eleased for the academic year ending 1999 by the National Center  -= Detailed national da a were not released for the academic year ending 1999 by the National Center   "}, {"section_title": "214", "text": ""}, {"section_title": "53", "text": "BEST COPY AVAILABLE   -= Detailed national da a were not eleased for the academic year ending 1999 by the National Center for Education Statistics."}, {"section_title": "NOTES:", "text": "See section C for specific fields that are included in this field of study.    -= Detailed national data were not released for the academic year ending 1999 by the National Center for Education Statistics.\nSee section C for specific fields that are included in this field of study. Details may not sum to totals because of missing information on gender for some recipients.  -= Detailed national da a were not eleased for the academic year ending 1999 by the National Center for Education Statistics.\nSee section C for specific fields that are included in this field of study.   -= Detailed national data were not released for the academic year ending 1999 by the National Center for Education Statistics.\nSee section C for specific fields that are included in this field of study.    -= Detailed national data were not eleased for the academic year ending 1999 by the National Center   -= Detailed national data were not eleased for the academic year ending 1999 by the National Center for Education Statistics.\nEngineering technologies are instructional programs that prepare individuals to support and assist engineering and related professionals or to independently provide such services. Programs stress specialized, practical knowledge related to the mathematical, scientific, or technical aspects of engineering and related sciences. Detailed national data were not released for the academic year ending 1999 by the National Center for Education Statistics. Details may not sum to totals because of missing information on gender for some recipients.  = Detailed national data were not released for the academ'c year ending 1999 by the National Center for Education Statistics. First-professional degrees are defined as those that require at least 6 years of college work for completion and 2 years of pre-professional training.  -= Detailed national data were not released for the academ c year ending 1999 by the National Center for Education Statis ics. First-professional degrees are defined as those that require at least 6 years of college work for completion and 2 years of pre-professional training. Health fields include: Chiropractic, Dentistry, Medicine, Optometry, Osteopathic Medicine, Pharmacy, Podiatry, and Veterinary Medicine.  = Detailed national data were not released for the academic year ending 1999 by the National Center for Education Statis ics. First-professional degrees are defined as those that require at least 6 years of college work for completion and 2 years of pre-professional training.   (703) 292-8183 The Foundation provides awards for research and education in the sciences and engineering. The awardee is wholly responsible for the conduct of such research and preparation of the results for publication. The Foundation, therefore, does not assume responsibility for the research findings or their interpretation. The Foundation welcomes proposals from all qualified scientists and engineers and strongly encourages women, minorities, and persons with disabilities to compete fully in any of the research and education related programs described here. In accordance with Federal statutes, regulations, and NSF policies, no person on grounds of race, color, age, sex, national origin, or disability shall be excluded from participation in, be denied the benefits of, or be subject to discrimination under any program or activity receiving financial assistance from the National Science Foundation. Facilitation Awards for Scientists and Engineers with Disabilities (FASED) provide funding for special assistance or equipment to enable persons with disabilities (investigators and other staff, including student research assistants) to work on NSF projects. See the program announcement or contact the program coordinator at 703-292-8636. The National Science Foundation has TDD (Telephonic Device for the Deaf) capability, which enables individuals with hearing impairment to communicate with the Foundation about NSF programs, employment, or general information. "}]