[{"section_title": "", "text": "vii 8. CONCLUSION ........................................................................................................................... APPENDICES A. TABLES ..................................................................................................................................... B. FIGURES ................................................................................................................................... BIBLIOGRAPHY ............................................................................................................................ "}, {"section_title": "viii", "text": ""}, {"section_title": "LIST OF TABLES", "text": ""}, {"section_title": "INTRODUCTION AND BACKROUND", "text": "Interest in large coastal inundation events has increased in the northeastern United States since Hurricane Sandy caused upwards of 50 billion dollars in damages (Sullivan and Uccellini, 2012). Coastal flooding augmented by rising sea level presents one of the primary risks to quickly growing urban coastal population centers (IPCC, 2014 and references therein). Despite increasing research on coastal flooding in the northeastern U.S. (e.g. Sweet et al., 2013;Brandon et al., 2014;Lopeman et al., 2015), the true return period for Hurricane Sandy-like flooding events in Boston, MA, the largest city in New England remains relatively unknown. This, despite research showing that average annual economic losses due to flooding in Boston could reach up to $793 million by the year 2050 (Hallegatte et al., 2013). Uncertainty related to extreme flood frequency for Boston is in part because tide gauge data does not extend back far enough to capture the true range of flood conditions possible in the city. The shortness of this instrumental record makes it difficult to obtain statistically accurate return periods for extreme flood levels or to evaluate the skill of extreme flood probabilities derived solely from numerical simulations (Irish et al., 2011). While Boston is vulnerable to tropical cyclones (TCs), extratropical cyclones (ETCs) have historically been the dominant flooding mechanism for the city (Table A1). A more thorough explanation of ETCs is provided in the subsequent section but to summarize, ETCs derive their energy via horizontal temperature gradients more common to the northeast, while tropical cyclones derive their energy via the condensation of evaporated vapor from warm ocean water common to the tropics. ETCs are the primary mechanism of flooding for much of New England because they are more frequent in the area, and generally affect the region over multiple days, increasing the likelihood of a storm surge occurrence during the regions relatively large high tide (e.g. Kirshen et al., 2008;BRAG report, 2016). However, despite ETC's flood dominance for Boston, climatic controls on ETC activity are relatively unknown (Vose et al., 2014). In Boston, digitized hourly water level data is available from the National Oceanic and Atmospheric Administrations (NOAA) back to 1921 (here-in referenced as the modern instrumental record). However, additional data on flooding exists prior to 1921 in the form of unanalyzed historical tide-gauge data, flood tables and first-hand flood accounts (e.g. Talke and Jay, 2013;Talke et al., 2014). The digitizing of these paper records allows for the temporal extension of extreme flood occurrences back decades to centuries before the modern instrumental record and the potential for assessing the sensitivity of ETC activity to past climatic change. However, substantially greater uncertainty is associated with these earlier flood accounts, and in-turn they require careful vetting prior to their integration with modern instrumental data sets. Furthermore, Boston's shoreline and harbor has experienced a number of major coastal modifications in recent centuries that have the potential to impact flood magnitudes observed within historically compiled tide gauge records for the city (Fig. B1). Flood reconstructions external to the harbor would provide the opportunity to assess changes in flood frequency beyond the impacts of man-made modifications to Boston Harbor. However, historical tide gauge data is extremely limited for sites directly external to the harbor, placing significant restrictions on our ability to deconvolve the climatic vs. geomorphic drivers of any observed change in flood frequency observed in Boston Harbor proper. Storm deposits preserved in coastal sediments provide a natural and independent verification of past floods additional to existing tide gauge and historical storm accounts (Wallace et al., 2014). This emerging science of paleotempestology has been employed successfully to describe flood frequency over significantly longer time scales than modern observations can provide (e.g. Woodruff et al., 2013;Wallace et al., 2014;Donnelly et al., 2015), and allows for the placement of modern flood events of record in relative context to ancient storm events impacting a region prior to the modern instrumental record (e.g. Brandon et al., 2014). Further, for highly modified shorelines like Boston, sedimentary flood reconstructions can be developed along less developed nearby coastlines in order to assess changes in storm flood frequency beyond the influence of man-made harbor alterations. Historical and sedimentary archives have contributed significant insight into the dominant processes controlling tropical cyclones over the last few millennium (e.g. Donnelly et al., 2015 and references therein). However, limited work has been done in applying these techniques to assess potential climatic links to ETC variability as applied herein. Buynevich and FitzGerald (2003) were the first to develop a record of ETC-driven overwash deposition from the sediments of coastal ponds in Maine. This was followed by additional reconstructions of ETC related flooding based on relict beach scarps and overwash deposits preserved in beach sediments in Saco Bay (Buynevich et al., 2004) and Castle Neck, Massachusetts (Dougherty et al., 2004). Buynevich et al., (2007) used subsurface imaging and optically stimulated luminescence (OSL) to identify and date relict beach scarps corresponding to storm-induced erosion at Hunnewell Beach in Maine. The study identified five scarps associated with ETC-linked flood events in the last 2000 years (including a modern storm scarp caused by the Blizzard of 1978), and is the first study to employ sedimentological flood records to assess return intervals of ETCs. Further, the study provided initial evidence of a period of increased storm activity to Maine during the past 500 years preceded by a quiescent period lasting approximately 1000 years, and possibly driven by a reorganization of the North Atlantic Oscillation (NAO) regime. Another study from the Boston area by Besonen et al. (2008) interpreted graded beds in a laminated lake (Lower Mystic Lake) as being derived from intense hurricane precipitation rather than ETC driven floods. The proxy record was employed to provide a pre-historic reconstruction of extreme rainfall for the area with trends that suggest hurricane induced rains might have been more frequent in the first half of the last millennium. In this thesis I compile historical flood data for Boston Harbor and compare them to an independent sedimentary reconstruction of flooding external to the harbor. The main goals of the study are to: 1) assess and improve on the current extreme flood return period estimates for Boston, 2) evaluate the potential impacts of man-made modification on extreme flood frequency in Boston Harbor, and 3) extend sedimentological work on climatically driven changes to ETC related flooding south to the Boston region. I begin with a review of the current state of knowledge on climatic influences on ETCs and a detailed description of Boston Harbor. I then provide a detailed assessment for historical floods of record for Boston based on extended tide gauge records and additional historical accounts. Historical assessments are followed by the methodology and results for an independent sedimentological reconstruction of flooding from Bartlett Pond, a small coastal pond located approximately 60 km south of Boston. This is followed with a discussion on the consistency between the current extreme flood return periods for Boston and those derived from the longer historical and sedimentological datasets developed in this study, as well as an assessment for the potential ETC climatic significance of trends observed within these longer storm reconstructions."}, {"section_title": "REVIEW ON EXTRATROPICAL STORMS", "text": "Extratropical cyclones (ETC) are frontal, cold-core, low pressure systems that obtain their energy primarily through the interaction of cold and warm air masses. ETCs form primarily at midlatitudes and account for the majority of cyclone activity in the United States (Vose et al., 2014). These storms, which can occur at any time of year but are prevalent during the colder months, are driven by the horizontal temperature contrasts in the atmosphere. When affecting New England or the Mid-Atlantic states these storms are often referred to as Nor'easters for the northeast-blowing winds that accompany them in this region. Recently there has been an increased focus looking at possible changes in extratropical cyclone activity due to anthropogenic climate change. These studies have been based both on reanalysis data and Global Circulation Models (GCM) (Ulbrich et al., 2009 and references therein). However, the studies have had mixed results and evidence for frequency changes over the past century have been inconclusive (Vose et al., 2014). In turn, significant uncertainty remains for how ETCs might respond to future climate change. While increased arctic surface warming could lead to a decreased temperature gradient in the northern hemisphere (leading to decreased potential energy for extratropical systems), there is some evidence in climate models for local reduced warming south of Greenland which may complicate this effect (Bengtsson et al., 2009). Conversely, temperature gradients in the high troposphere are expected to increase, which would theoretically strengthen these systems (Colle et al., 2015). There is additional evidence that the North Atlantic Oscillation (NAO) (Hurrell 2002;Talke et al., 2014) and El Nino Southern Oscillation (ENSO) (Hirsch et al., 2001) may play significant roles in the intensity, track, and duration of extratropical storms, which further adds to the uncertainty of the future behavior of these storms. Bernhardt and Degaetano (2012) noted that when a negative NAO phase coincided with a positive ENSO phase, ETCs were generally weaker, but moved slower, increasing flooding and erosion. Additionally, Wang et al. (2001) noted that positive phases of NAO corresponded with a poleward shift of Atlantic ETCs."}, {"section_title": "CHAPTER 3 BOSTON HARBOR", "text": "Boston Harbor is located in Massachusetts Bay and within the Gulf of Maine. The bay is tidally-dominated with minimal freshwater input (Signell and Butman, 1992). The harbor has a mean tidal range of 2.9 m. Spring tidal ranges generally exceed 3.6 m and the neap tidal range is typically less than 2.2 m. Tides are semidiurnal with tidal asymmetry resulting in a mean tidal level (defined as the arithmetic mean of mean high water and mean low water) that is roughly 0.04 m lower than MSL (defined as arithmetic mean of hourly water level observations). Boston Harbor is characterized by a complex coastline geometry. Partially drowned glacially derived drumlins represent local topographical highs within the harbor (Rosen et al., 1993;Newman et al., 1994). Wave induced erosion of these drumlins supplies sediment to sand and gravel bars that often connect to neighboring drumlins in direction of littoral transport (Himmelstoss et al., 2006;Hughes et al., 2007;Maio et al, 2012). Two of these drumlin bar and spit complexes define the outer limit of Boston Harbor; Winthrop Peninsula and Deer Island to the north and Nantasket Peninsula to the south. Numerous other drumlin/bar systems are scattered within the harbor proper with additional drumlin/bar peninsulas defining the inner bays of Dorchester, Quincy and Hingham (Fig. B2). An inner Boston Harbor is also often defined both by Governors Island which was reclaimed to form the artificial Logan Airport peninsula just behind the Winthrop Peninsula, and Castle Island, a drumlin island that was reclaimed to form the Marine Park peninsula that now directly connects to South Boston (Fig. B2). Bathymetry in Boston Harbor is relatively shallow with water depths generally less than 5 m. This is with the exception of deeper drowned glacially-derived drainage channels between drumlin complexes as well as man-made 10-15 m deep navigation channels from the outer harbor entrance to the inner harbor of Boston and through Hingham Bay to the Weymouth Fore River (Fig. B2). Following European colonization in 1630 CE the shoreline of Boston has experienced continual modifications. Alterations began gradually with the creation and slow expansion of solid wharfs by early settlers in the 17th and 18th centuries (Rawson, 2009). This was followed by filling smaller coves and ponds in the early 1800s. More massive reclamation projects include: 1) the filling of South and Back Bays in the mid-to-late 1800s ( Fig. B1), 2) the damming of the Charles andMystic rivers between 1909 and1910, and3) the building and continued expansion of Logan Airport following 1920."}, {"section_title": "CHAPTER 4 BOSTON'S HISTORICAL/INSTRUMENTAL FLOOD RECORD", "text": ""}, {"section_title": "Modern Instrumental Record", "text": "Flooding caused by storms is commonly described in terms of three common metrics: peak water level, storm tide, and storm surge. Storm surge is the rise in water level due solely to a storm's wind and drop in atmospheric pressure. Storm tide is the rise in water due to storm surge and astronomical tides. Finally, peak water level is the water level observed in reference to a defined datum and includes the compounding influences of changes in mean sea level (MSL), astronomical tides, and storm surge. Return period for storm surge and storm tide are commonly quantified by a generalized extreme value (GEV) model fit to the peak annual surge or storm tide as described by Zervas (2013). For our analysis we employ MATLAB's GEV fit following methodologies laid out in Embrechts et al., (1997) and Kotz and Nadarajah, (2000).  (Kirshen et al., 2008), necessitated the evacuation of 23,500 people to temporary shelters and flooded more than 1,000 homes (Glass et al., 1979 "}, {"section_title": "Extended Tidal Data from the Charlestown Naval Yard", "text": "In the Boston area, Talke and Jay (2013) have identified tidal data from the Charlestown Naval Yard (Fig. B1) covering 1847-1876and 1902-1911last investigated by Shureman (1928 and Freeman (1903). These records were obtained from the Coast and Geodetic Survey Archives  (Shureman, 1928). Freeman (1903) noted that by 1857 there were accounts that the space between stones in the dry dock wall had expanded due to the action of frost, and likely would have added some gradual error to the water level measurements taken from using the tide scale. The issue of spacing between stones was investigated by Freeman in 1903 and again by Shureman in 1928, and it seems likely that the error caused by frost widening did not exceed 1-2 inches (2.5-5 cm). From 1857 -1860, the measurements were moved about 400 feet east from the dry dock scale but were measured using the same method. On May 28 th , 1861 a box gauge was installed in a location near the dry dock entrance and measurements were continued in this way until 1866. In 1867 a self-registering gauge replaced the box gauge and measurements continued using this gauge until 1876. In 1902 an automatic tide gauge was again installed by the public works department of the navy yard and continued operation until 1911. Additionally, a set of extreme water level data covering the time period from 1825 to 1833 was obtained from the Loammi Baldwin archives found at the MIT library archives. These measurements were made during the construction of the dry dock at the Charlestown Naval Yard. The data described previously has been digitized by Dr. Stefan Talke of Portland State University. The raw data were quality assured using manual inspection, 'conditional formatting' in excel to identify anomalous data, as well as differencing to identify non-physical jumps in water level. The Van De Casteele test was applied to determine whether there were any timing errors. Qualitative research describing events such as newspaper articles and letters were also used to assess quality of the record. By taking the average annual high and low water levels from this data, and averaging the two, the mean tidal level (MTL) for a given year was calculated. By subtracting this mean tidal level from the highest water level recorded for any given year, we were able to calculate the highest annual storm tide. It should be noted that this does not represent a complete set of high water levels, as some days are missing. This could possibly lead to an under accounting of extreme high water levels. This data is also slightly different from the modern instrumental tide record because it is relative to MTL at the time of the event rather than mean sea level (MSL). At Commonwealth Pier No. 5, for 1983 to 2001 the average height of MTL below MSL has been 3.6 cm. Additionally, while the data from Commonwealth Pier No. 5 was taken hourly, the data here was taken at (or around) the highest water level. NOAA 6-minute water level data for Boston are available since 1996 with the highest water level since 1996 in April 16 th 2007 providing an example for potential differences between instantaneous and hourly water observations. Peak water level for the 2007 event is 1.7 cm higher within the 6-minute water level than the hourly data (2.607 m compared to 2.624 m). which had the highest wind occurring during the rising tide, was noted as having the highest water levels seen since April 16 th 1851 (described below). Two persons were drowned in the flood, and the storm was estimated by local newspapers to have caused 5 million dollars in damages (Wilson, 1909)."}, {"section_title": "Minot Ledge Lighthouse Storm of 1851", "text": "On  (Caldwell, 2002). However, on the night of April 16 th 1851, only 3 years later, in the midst of a powerful storm, the light from the lighthouse disappeared from view. The following day, as the skies cleared there was no sign of the lighthouse. Of the two assistant lighthouse keepers' stationed at the lighthouse, Joseph Antoine's body washed ashore in Nantasket, and Joseph Wilson managed to reach Gull Rock, nearby, but later died of exhaustion and exposure (USCG)."}, {"section_title": "Historical Accounts", "text": "Secondary records of significant flood events prior to 1847 were compiled by Stefan The 20 year ago storm mentioned is most likely a storm in 1723 described in the following subsection. Ludlum (1963) also records the following quote from the Boston Post Boy: \"some vessels that got loose were drove ashore higher up than was ever known before.\" The 1743 storm is scientifically significant because Benjamin Franklin, in Philadelphia, had wished to observe the scheduled eclipse of the moon, but was prevented by the cloud cover from this storm. He later wrote to his brother assuming he too had missed the eclipse, but learned that the eclipse had been seen in Boston, but clouds had arrived later. Franklin correctly surmised that the storm in Philadelphia and Boston must have been the same, traveling up the coastline. This observation is generally regarded as the first progress in trying to understand storm behavior (Ludlum, 1963). Mean sea level in 1743 was calculated to be 44.594 cm +/-4.71 cm below 2014 levels (~1.51 m above Boston Base). Subtracting this from our account of the 1743 storm, we wind up with a range of possible storm tides from 3.015 m to 3.11 m above MSL, with a median value of 3.062 m above MSL."}, {"section_title": "1723", "text": "An extremely high water level appears to have occurred on February 24 th 1723. This flood may be the event of record for many parts of New England, including Boston. Perley (1891) wrote that at Plymouth, the water rose three to four feet (~0.9 m -~1.2 m) above the highest water marks recorded there. Perley also states that the News-Letter of Boston said that the flooding in Boston \"looked very dreadful,\" and that the flooding was 20 inches (0.5 m) higher than had ever been recorded there before. In Salem, he notes that the tide flowed back for several miles and people had to seek safety in trees. Rev. Cotton Mather, infamously known for his support of the Salem witch trials, also wrote an extremely detailed account of the storm (Mather, 1724), describing water levels that \"raised the tide unto a height which had never been seen in the memory of man among us,\", and rose \"two or three feet above the famous long wharf, and flowed over the other wharves and streets to so surprising a height, that we could sail in boats from the southern battery.\" The reverend also described regions of damage including \"many acres of marsh ruined, being either torn up through the rage of the water, or covered with the sands from the road.\" The Boston Newsletter following the storm stated that the tide rose to a height of 16 ft (4.9 m) (Peterson and Goodyear, 1964). As this value is likely in reference to the spring low water datum, we can compare it to the Charlestown dry dock datum resulting in water levels of approximately 14. Mather provides one of the few accounts we have of that storm (described in Ludlum, 1963 Jarvinen (2006) shows very little flooding in the Boston area ( Fig. B5), and supports the 1723 storm as the more significant flood event for the region."}, {"section_title": "CHAPTER 5 SEDIMENTARY METHODS", "text": ""}, {"section_title": "Field Site", "text": "In order to verify and extend flood reconstructions beyond the historical record, sediment cores were collected from Bartlett Pond in Manomet, Massachusetts (Fig. B6). Bartlett Pond is a small (0.13 km 2 ) back-barrier pond located ~60 km south of Boston Oceanographic conditions for the region are classified as mixed-energy, tide-dominated, with a mean tidal range of approximately 2.7 m and mean off-shore wave heights of roughly 1.0 m (Fitzgerald and Van Heteran, 1999). Three rows of homes exist on and behind the barrier's natural dune. Small stone revetments built after 1952 help protect these homes from flooding and may limit overwash into the pond following construction. The relatively small size of embayments in the region and limited meso-tidal range results in relatively small tidal prisms that is typically insufficient to maintain stable tidal inlets (Fitzgerald and Van Heteran, 1999). However, a small artificially stabilized outlet does now cut through White Horse Beach draining excess fresh water from Bartlett Pond into Cape Cod Bay. Bartlett Pond sits on the terminal end of Beaver Dam Brook, a small stream that drains the ~12 km 2 Beaver Dam Watershed. Rainfall infiltrates coarse stratified drift in the watershed relatively quickly which leads to a relatively low peak discharge for Beaver Dam Brook (Ries 1994). A 2014-2015 survey is consistent with this assessment, showing a mean annual flow for the year of roughly 0.5 m 3 /s and a peak discharge of less than 1.4 m 3 /s for the year (Casey Kennedy -USDA-ARS, unpublished data). Higher discharge events may have occurred in the past during the springtime release of flood water from cranberry bogs upstream of Beaver Dam Brook during their operation from the early 1900s up until 2010 (Hare, 2015)."}, {"section_title": "Methods", "text": "A bathymetric survey of Bartlett Pond was conducted using a Lowrance Mark-4 Fishfinder (Fig. B6). Based on this survey, three primary sediment cores were collected in a shore-normal transect using a modified Vohnout-Colinvaux piston corer (Baranes et al., 2015;Woodruff et al., 2015). The most distal sediment core was labeled BAP7, the most proximal, BAP8, and the core located in-between these two, BAP6. Note core numbers 1-5 represent preliminary short cores collected prior to the main field campaign. In order to determine sediment characteristics of different sediment sources to the pond, small surface samples were also taken using an Eckman dredge from: 1) the beach abutting Bartlett Pond, 2) from the pond itself, and 3) from the small stream flowing into the pond. Additional surface samples were taken from endmember sites near Bartlett Pond in order to compare how various degrees of terrestrial and/or marine inputs may be reflected in the Bartlett Pond cores (Fig. B7). Following collection, all of the samples were transported to the University of Massachusetts (Amherst, USA) where they were refrigerated at 4 °C until analysis. The cores were split lengthwise and described. X-radiographs and 500-µm-resolution depth profiles of relative elemental abundances were obtained from the split core halves and surface samples with a nondestructive ITRAX X-ray fluorescence (XRF) core scanner (Croudace et al., 2006). The cores were scanned using a Molybdenum (Mo) tube operating at 30 kV and 55 mA and a 10 second sampling period. In order to eliminate any biasing due to changes in sediment density or grain size along the core length, elemental abundances are presented both as peak area integral, and peak area integral normalized by total photon counts per second of each spectrum (element peak integral / kcps) (Bouchard et al., 2011). The surface samples collected from the stream, pond, and beach (PSS8, PSS2, and PSS11 respectively) were first visually inspected under a light dissecting microscope for characterization and then run on the XRF core scanner as discrete samples following methods similar to Woodruff et al. (2015). Stable carbon isotope ratios were measured on all of the finegrained surface samples to characterize the degree of marine/terrestrial influence. The samples were acidified twice using 12 mL of 10% HCl to remove any inorganic carbon. They were then centrifuged for 10 minutes @ 2500 rpm one hour after each acidification, with the acid then pipetted off. Samples were washed 3 times with deionized water, which was centrifuged and pipetted off. The stable carbon isotope ratios of these acidified samples were then measured at Amherst College using a Picarro G2201-I cavity ring-down spectrometer following combustion in a Costech ECS 4010 Elemental Analyzer. Stable carbon isotope ratios of 11 sub-samples from the primary core site (BAP6, see Fig B6 for location) were measured in the same manner to determine if significant changes in sediment provenance could be detected. Sandy deposits were visually identified from BAP6 and sub-sampled at 1 cm depth intervals, while background sedimentation was sampled every 3 cm. Each sample was wet sieved with a 32 µm sieve, followed by a 63 µm sieve, with any macro-organics pipetted off. Coarse percentage (> 63 µm and > 38 µm) was obtained by measuring the dry mass of material retained in each sieve compared to the dry mass prior to sieving. Additionally, the top 190 cm were sub-sampled at 3 cm resolution for loss-on-ignition (LOI) analysis of organic content using the methods described by Dean (1974).  (Pennington et al., 1973). A depth profile of the relative abundance of bulk lead (Pb) in BAP6 was used to identify the core depths that corresponded the initial rise in heavy metals associated with the industrial revolution (1850-1900) and a subsequent drop in Pb due to the removal of lead from gasoline in 1974 (Kemp et al., 2012). Sub-samples were also taken for pollen analysis in between sand deposits to identify the depth corresponding to the increase in grassland weeds associated with European style clearance (~1650 -1700) (Parshall et al., 2003). Opaque spherules were also counted to identify a rise in opaque spherules that has been associated with the increase in industrial activities corresponding with the industrial revolution (Clark and Patterson, 1985). Samples were processed by Dana MacDonald at the University of Massachusetts -Amherst using standard techniques described by Faegri and Iverson (1989). Pollen was identified and counted to >120 arboreal grains (trees and shrubs) from these sample. To extend ages below settlement, five radiocarbon dates were obtained from BAP6 from small terrestrial macrofossils (i.e. leaves, seeds and the smallest of twigs). Radiocarbon ages were converted to calendar years using the IntCal13 radio-carbon calibration curve (Reimer et al., 2013). Age probability distributions between age controls were obtained using the Bayesian age-depth modeling methods employed by Brandon et al. (2014) and Woodruff et al. (2015). The technique randomly generates a large number of possible age curves using randomly drawn ages weighted with probabilities from radio-carbon derived distributions.  Fig. B10 shows the three primary cores taken from Bartlett Pond. BAP8, BAP6, and BAP7 with sediment depths of 0 to 311 cm, 506 cm, and 173 cm, respectively. The top of each of these cores was made up of a watery, light brown, organic rich upper layer extending down ~20"}, {"section_title": "Core Lithology", "text": "cm from the sediment-water interface. In each of the cores this was followed by a darker brown organic rich gyttja layer. These muddy layers were interbedded with either clean or muddy sand/silt layers. Below 4.9 meters BAP6 transitioned from brown gyttja to a darker unit of more organic rich sediments. Relative to background sediments, interbedded sand/silt layers were higher in density, and anomalously coarse (% > 63 μm). These event layers also had higher Rb/kcps values, and were 4 times lower in organic concentrations relative to the mud and gyttja units they were in interbedded in (5% vs. ~20% LOI) (Fig. B11). Stable carbon isotope ratios of the eleven BAP6 background sediment sub-samples are presented in (Fig. B12) and ranged from -25.79 ‰ to -29.40 ‰. These values all fall within the range of values described by Lamb et al. (2006) for terrestrial POC (-25‰ to -33‰). The upper portion of BAP6 (from the sediment water interface to 221 cm), which encompasses all of the sandy layers described below, had ratios ranging from -26.82‰ to -28.44‰. Below this portion of the core, at 340 cm, the stable carbon isotope ratio is slightly more enriched in C 13 , with a ratio of -25.79‰. This is followed by a ratio of -26.97‰ at 486 cm -487 cm, and finally a depletion in C 13 at 502 cm -503 cm, with a ratio of -29.40‰ that corresponds to the darker organic unit below 490 cm in BAP6. Fig. B13 shows the results for the modern age constraints obtained from BAP6. An initial rise in Cs 137 associated with the 1954 CE onset for atmospheric bomb testing appears at 33 cm, with the 1963 CE peak in atmospheric testing observed at 18.5 cm. A drop in lead is also observed above 17 cm and is chronologically consistent with the drop in bulk lead associated with the removal of leaded gas in 1974. Likewise, an initial rise in bulk lead is observed at 80 cm that is likely associated with the onset of the industrial revolution dating to between 1850 and 1900."}, {"section_title": "Age Model", "text": "An additional drop in lead is also observed within a coarse grain deposit between the depths of 50 and 60 cm depth (Fig. B10), and is consistent with this coarser material's low affinity for heavy metal adsorption relative to the finer grained mud it is inbedded in (Owen and Sandhu 2000). There is an initial rise in sorrel (Rumex sp. L.) and grasses (Poaceae) in the pollen data at a depth of 116 cm, followed by a more pronounced rise detected in ragweed (Ambrosia sp. L.) and grasses (Poaceae) directly above the two sandy deposits between 98 and 115 cm. This likely indicates that a depth near the base of the lower of those two deposits corresponds with land clearance related to the arrival of European farming in Manomet dating to between 1650 and 1700. The industrial-related rise in opaque spherules occurs at a depth of 80 cm which is in agreement with the observed cotemporaneous rise in bulk lead at roughly the same depth. The six C 14 samples obtained within deeper sediments at BAP6 are all chronologically consistent (Table A2), with the lowest C 14 date indicating that the 5-meter-long BAP6 core represents ~3000 years of sedimentation. The age model for BAP6 generated from these constraints is presented in Fig. B14, revealing a ~4 mm/yr sedimentation rate for the most recent part of the core extending down 116 cm from the sediment water interface. This is followed by a much slower deposition rate of ~0.5 mm/yr extending from 116 cm to 126 cm, and below 126 cm with a relatively consistent rate of 1.5 mm/yr for the rest of the core."}, {"section_title": "Deposits", "text": "Thirteen individual sandy deposits were identified in BAP6 using density, coarse analysis, and Rb content (Fig. B11). The age probability distributions from our age model for each of these deposits identified are presented in (Fig. B15), with deposit numbers increasing with age. The most recent deposit (Deposit 1) at between 15 cm to 17 cm falls above the 1963 CE peak in Cs-137 and below the 1975 drop in bulk lead. Only a minor increase from background in density, coarseness, and Rb is observed in the deposit, which is consistent with modern anthropogenic modifications to the barrier decreasing overwash potential (Fig. B11). Below these deposits event layers dropped in density (Fig. B14) and became less distinguishable from background sedimentation. substantially lower and the pond was farther away from any marine influence. An apparent enrichment in C 13 at 340 cm -341 cm may also indicate a slightly greater marine influence than present potentially during initial marine inundation of the pond. In comparison to these deeper sediments, the upper 250 cm of BAP6 are found to have stable isotope carbon ratios ranging from -26.82‰ to -28.44‰. The narrow range of these values and their similarity to those measured from terrigenous rather than open marine end-members suggest that there have not been significant sustained breaches to the barrier over the period where event deposits are assessed (Fig. B7, Fig. B9). However, two relatively significant changes in sedimentation should be noted in the BAP6 core. From the sediment water interface to 116 cm depth, a sedimentation rate of approximately 4 mm/yr is apparent from our age model. From 116 cm in depth the 126 cm there is a slower rate of sedimentation of 0.5 mm/yr, and below 126 there appears to be a relatively consistent rate of 1.5 mm/yr. The slower rate of sedimentation between 116 cm and 126 cm occurs immediately prior to Deposit 7 with a lower bound of 115 cm. The slower rate of sedimentation bracketed by these depths could represent an erosional unconformity in our record. The cause of the rise in sedimentation that occurs from the sediment water interface to 116 cm is more unclear. LOI and grain size analysis indicate an increase in organics and finer grains during this interval and suggest that this rise in sedimentation is caused by an increased flux of fine grained and organic material. The rise in sedimentation happens directly after the land clearance signal identified in our pollen analysis. This may suggest that increased erodibility of the watershed resulted an increase in nutrient and washload to the pond and in turn the observed rise in sedimentation due to organic production and fine-grained trapping. Fig. B15 shows the relationship between the age distributions derived from our age model for the lower depth of each overwash deposit and the most extreme tides identified for the Boston area over the last ~200 years. Deposit 1 between 15 cm to 17 cm appears to be associated with the Blizzard of 1978. This deposit shows up as anomalously small compared to earlier deposits, likely due to the armoring of the barrier following 1952. Anthropogenic alteration of a barrier system limiting the preservation of overwash deposits has been noted in previous studies, and is one of the limitations of these kind of sedimentary records (e.g. Wallace et al., 2014). Deposit 2, 3 and 4 beginning at 61 cm, 85 cm and 88 cm respectively have median ages that correspond well with extratropical storms identified in 1909, 1851, and 1830, respectively. Deposit 5 and 6 beginning at 95 cm, and 100 cm have median ages that are slightly younger than storms identified in 1786 and 1743, but with an overall age distribution that bound these two storms. Deposit 7 is the thickest deposit in our record, and has a median age very near to 1723. The thickness of this deposit supports accounts of this storm's particularly high flood intensity."}, {"section_title": "GEV Analysis of Flooding in Boston", "text": "As stated previously, the currently published return period for the Blizzard of 1978, the largest flood recorded in Boston in the modern instrumental record, is approximately once every 200 years when assessed using generalized extreme value statistics (https://tidesandcurrents.noaa.gov). Using digitized historical accounts and tide gauge data we have identified six additional storms with magnitudes of or greater than the 1978 event since 1723. The probability of having seven events with a return period of 200 years occurring over a 293-year time period can be calculated using Equation 1 (Gray and Odell, 1973) where n is the period of observation (293 years), x is the number of occurrences (7), p is the annual probability of the event occurring in any given year (0.5%), and q is the annual probability of the event not occurring (99.5%). Using these values, we find that there is a 0.06% chance of having seven events with a recurrence interval of 200 years happen in a 293-year period. However, using a 293-year period of observation represents the minimum possible period of observation for these storms, and therefore represents the minimum chance of having so many events occur in this period. Using a longer period of observation of 400 years may represent a more conservative estimation of the probability of these occurrences as we do not have any recordings of such significant flooding back to initial colonization. Equation 1 yields a 0.34% chance of having 7 events with a 200-year recurrence interval in a 400-year period. Another conservative estimation would be to use a period of observation one year less than the last significant event recorded in 1723. By using this window (292 years) with 6 observed floods, we still find only a probability of 0.30%. A probability of approximately 0.34% seems unrealistically low and likely indicates that the true exceedance return period of the 1978 storm tide is significantly shorter than 200 years. Using strictly the unbiased data, it appears that the return period is more likely closer to 60 yrs (i.e. 7 events in 400 yrs). If correct, this would indicate that the true annual exceedance probability for a 1978-like flood event for Boston is likely over 3 times greater than current estimates based on GEV derived statistics on the modern instrumental record."}, {"section_title": "Harbor Alterations", "text": "The merging of pre and post-1900 Boston water level data to improve the accuracy of current return period storm tide statistics assumes that our new 1700-to-present time series for flooding is one whose statistical properties have remained constant through time (i.e. statistical stationarity). However, geomorphic changes to the harbor and potential shifts in storm climatology might make this assumption incorrect. Dredged navigation channels and land-filling projects have been observed to produce tide altering affects in harbors similar to Boston (DiLorenzo et al., 1993;Shi et al., 2011). The changes in friction and resonance properties due to local, anthropogenic alterations of the bathymetry of Boston Harbor may therefore have altered both astronomical tides and the storm surge response within the harbor (e.g. Talke et al., 2014). Astronomical tidal waves and storm surges are both long-period, shallow water waves that should have similar responses to changes in harbor geomorphology (Talke et al., 2014). (obtained by this study and NOAA respectively) and the unbiased ~55 yr period obtained flood when employing the extended historical storm tide data set ( Fig. B16). However, unknowns still remain about the changes in tide levels identified by Talke et al., and require further investigation."}, {"section_title": "Ramifications for Flood Frequency", "text": "Potential changes in storm climatology must also be assessed in order to test the assumption of statistical stationarity applied when combining the modern instrumental records and the longer historical records to reassess flood return periods for Boston. The modern instrumental record shows very little correlation between ETCs and recent climatic variations (Vose et al., 2008). However, the sedimentary record of flooding allows for the identification of events prior to the limits of written records and can test ETC's sensitivity to climatic change observed during past climatic regimes including the Little Ice Age between 1400-1700 AD and the Medieval Warm Period between 950-1250 AD (Mann et al., 2009). Figure B17 shows an increase in event frequency following the 1723 event, and possibly a small decrease in event frequency in the modern period following the 1851 event. However, the interpreted erosional unconformity between approximately 1500 and 1700 AD prevents an assessment for how the frequency of events may have changed during the Little Ice Age. The increase in sedimentation rate following 1723 also increases the temporal resolution of our record. A reduced rate of events prior to this period might therefore be due to an undercounting of events due slower deposition and in turn a lower resolution record (e.g. Woodruff et al., 2008). Buynevich et al., (2007), identified a possible increase in frequency over the last 500 years corresponding possibly to NAO variations. Our record may be in agreement with Buynevich's, but it is difficult to determine due to potentially missing 200 years below the 1723 deposit. Looking at proxy records of NAO put together by Trouet et al. (2009), we can see that there appears to be a shift from a primarily positive NAO prior to ~1500 to a weaker NAO with more frequent negative oscillations following 1500. As stated previously, it has been shown that a negative NAO may correspond with increased coastal flooding, thus this could provide a possible explanation for the pattern we see in both of these records. Times of El Nino events have also been hypothesized to increase storm activity in the Northeast (Hirsch et al., 2001). However, proxy records of ENSO put together by Moy et al. (2002) appear to show less El Nino events following 1700, which runs counter to what we might expect if ENSO had played a significant role in driving the potential increase in ETC frequency observed following 1700. Records for sea surface temperature (SST) from the area of interest are limited, but a partial SST record from the Gulf of Maine, seems to show that temperatures have been decreasing over time for the past 1000 years (Wanamaker et al., 2008). In contrast temperature reconstructions to the south in Rhode Island support an increase in temperature when progressing out of the LIA (Hubeny et al., 2006). This observation combined with a proxy record of Gulf Stream transport from Lund et al. (2006) showing increased Gulf Stream transport of warm waters through the Straits of Florida from ~1700 to present may support an increase in the north-south temperature gradient, and therefore an increase in the potential energy necessary to increase ETC activity following 1700. Additionally, if the temperature decrease noted in Wanamaker et al. (2008) extended down to Boston, we must consider the role of ice in altering tides at Boston and Bartlett Pond. There is evidence that friction from ice cover may play a role in altering tidal heights (St-Laurent et al., 2008). While the effects of ice cover (damping or magnifying tides) are regionally specific, future model work may determine whether this may have also played a significant role in tidal variations over time. Both the record presented here and the Buynevich et al. (2007) Figure B3. GEV analysis. Storm surge and storm tide annual exceedance plots for Boston, MA, and Newport, RI constructed using tide gauge data available on tidesandcurrents.noaa.gov and plotted on MATLAB. Points represent the \"raw\" recurrence interval calculated with the equation RI = (n + 1) / m where n is the number of years in the data set, and m is the relative ranking of each event. The three parameters of the Generalized Extreme Value (GEV) function are then fit to these points to calculate \"true\" return periods. Red points represent events caused by tropical cyclones identified from the 2014 HURDAT database as passing within 500 km of the tide gauge at the time of the maximum flooding. Blizzard of 1978 (extratropical) Figure B4. Historical storm tides -Boston, MA. (Red) Annual maximum storm tide in Boston, MA identified from hourly water level data recorded at NOAA tide gauge station 8443970. (Yellow) Maximum storm tides measured at the Charlestown Naval Yard reconstructed from historic water level data. Storm tides for this data set are in reference to MTL rather than MSL. (Purple) Maximum storm tides reconstructed from secondary records of flooding during different historical storms, compiled by Stefan Talke at Portland State University and reused here with permission. MSL for these events is reconstructed using estimates by Engelhart and Horton (2012).          Figure B14. Bayesian analysis using chronological constraints from sediment core BAP6. Bounds representing 68% and 95% of the simulations are shown in light and medium grey respectively. C 14 age probabilities of each analysis are shown in black (Table A2). The red inset highlights the modern portion of the analysis with modern age constraints indicated by blue arrows. Figure B15. Age probability distributions of overwash deposits from core BAP6. Bayesian derived age probability distributions of lower bounds of individual overwash deposits identified from BAP6. Blue dashed lines show how the timing of the more modern overwash deposits compare to the largest storm tides identified in Boston Harbor as part of this study. Red lines indicate the depth of the base of each overwash deposit. Figure B16. GEV analysis with historical data. Return period identified from MATLAB GEV analysis of NOAA peak annual storm tide elevations identified for Boston, MA (green circles), along with a new reconstruction of the return period of the top 12 storm tide elevations identified as part of this study (red triangles). The return period of the Blizzard of 1978 is identified (dashed lines) both using the GEV analysis (~280 years) and a new reconstruction constructed using the formula RI = (n+1)/m for the top 12 events identified from this study (red circle; ~55 years). Peak annual storm tides associated with tropical cyclones are shown as magenta circles. Figure B17. BAP6 overwash frequency. Cumulative frequency of overwash deposits identified from BAP6."}]