[{"section_title": "Abstract", "text": "Vascular contributions to early cognitive decline are increasingly recognized, prompting further investigation into the nature of related changes in perivascular space. Using magnetic resonance imaging, we show that, compared to a cognitively normal sample, individuals with early cognitive dysfunction have altered perivascular space presence and distribution, irrespective of Amyloid-.\nSurprisingly, we noted decreased perivascular space presence in the anterosuperior medial temporal lobe, which was associated with neurofibrillary tau tangle deposition in the entorhinal cortex, one of the hallmarks of early Alzheimer's disease pathology. Our results suggest that anatomically-specific alteration of the perivascular spaces may provide an early biomarker of cognitive impairment in aging adults."}, {"section_title": "Introduction", "text": "One of the potential pathophysiological hypotheses for cognitive decline is represented by neurovascular dysfunction. Preclinical evidence in a pericyte-deficient mouse model supports the hypothesis that blood-brain barrier (BBB) breakdown leads to extravascular accumulation of blood-derived toxic fibrin deposits, with enlargement of perivascular spaces (PVS) and early white matter damage at the time when hypoxic changes are undetectable in the cortex [1] . Similarly, a recent study in humans showed that individuals with early cognitive dysfunction develop brain capillary and BBB damage in the hippocampus, suggesting that BBB breakdown is an early biomarker of cognitive decline [2] . In addition, previous studies in animals suggest that the glymphatic (glia-lymphatic) system, whose main pathway is represented by the perivascular spaces, is a substantial factor in the net clearance of Aβ [3, 4] ; reduction of efflux of interstitial fluid to the cerebrospinal fluid (CSF) in PVS could lessen Aβ clearance [5] [6] [7] . Such an impaired clearance from the brain parenchyma could in part explain the accumulation of Aβ [5] .\nAβ deposition in the wall of leptomeningeal and intraparenchymal cerebral arteries is a common observation in Alzheimer' disease (AD), that is thought to be associated with the enlargement of PVS as routes of Aβ clearance [8] [9] [10] . PVS changes have been linked to vascular diseases, including cerebral small vessel disease, cerebral amyloid angiopathy, BBB breakdown, hypertension and lacunar stroke [1, [11] [12] [13] [14] [15] [16] [17] . Furthermore, an emerging body of evidence suggests vascular changes are linked to both clearance system dysfunction [18] [19] [20] [21] [22] [23] and vasculotoxic effects of A and tau [10, 24] .\nMagnetic resonance imaging (MRI) studies have found significantly larger PVS in AD patients compared with controls in the centrum semi-ovale of the white matter (CSO-WM), but not in the basal ganglia [25, 26] . Interestingly, Banerjee et al. found that the perivascular spaces in the white matter were associated with AD independently of the amyloid burden [26] . These findings are limited to clinical scoring of PVS, which is based on counting total number of observed PVS in the white matter. The anatomical distribution and morphological features of PVS alterations in white matter however remain largely unexplored. To date, it has not been demonstrated whether PVS may represent an early biomarker of cognitive decline, nor have relationships of PVS with other pathological markers of AD, including A and tau been reported.\nTo examine whether and to what extent PVS is altered in early cognitive decline, we performed a comprehensive analysis of the multi-modal data of the Alzheimer's Disease Neuroimaging Initiative 3 (ADNI-3) participants (N=596). Since Aβ and tau can both lead to cerebral blood vessel abnormalities [27] [28] [29] , we mapped PVS using MRI data and analyzed the relationship between PVS volume fraction and Aβ and tau accumulation as measured in positron emission tomography (PET) images. Additionally, we investigated whether PVS distribution and appearance on MRI are influenced by the APOE gene, whose 4 variant represents one of the strongest genetic risk factors for AD [30] . which was assessed using education-adjusted cutoffs on the Logical Memory II subscale from the Wechsler Memory Scale [37] . Participants must also have an MMSE score between 24 and 30 and a CDR of 0 (memory box score must be 0). CN participants were considered cognitively normal based on an absence of significant impairment in cognitive functions or daily living activities."}, {"section_title": "Method", "text": ""}, {"section_title": "Mild cognitive impairment (MCI):", "text": "Participants were classified as MCI if they expressed subjective memory concern, with a score below the education-adjusted cutoffs on the Logical Memory II subscale from the Wechsler Memory Scale. The same MMSE score range as CN was used for the MCI group. Participants must have a global CDR of 0.5 and the memory box score must be at least 0.5. General cognition and functional performance of the MCI participants must be sufficiently preserved such that clinical diagnosis of Alzheimer's disease could not be made.\nAlzheimer's disease (AD): Participants categorized as AD were excluded from this study, to ensure the focus on early cognitive decline. In brief, participants were considered AD if they scored below the education-adjusted cutoff of the Wechsler Memory Scale, had an MMSE score between 20 to 24 and global CDR>= 0.5 [32] . "}, {"section_title": "Positron emission tomography", "text": "Amyloid PET data was used to categorize participants to Aβ+ and Aβgroups. Amyloid PET analysis was performed according to UC Berkeley PET methodology for quantitative measurement [38] [39] [40] [41] . Participants were imaged by Florbetapir (18 F-AV-45, Avid), or 18 F-Florbetaben (NeuraCeq, Piramal). All PET images were co-registered on T1w MRI to align brain parcellation boundaries. Quantitative measurement was done based on Standard Uptake Value ratio (SUVR).\nThe tracer uptake in the main four cortical regions: frontal, anterior/posterior cingulate, lateral parietal, lateral temporal and additional five reference regions (cerebellar grey matter, whole cerebellum, brainstem/pons, eroded subcortical white matter, and a composite reference region) was measured. The whole cortical SUVR was then calculated by averaging the mean of tracer uptake across the 4 cortical regions and dividing by one of the reference regions.\nTau PET was also collected by Flortaucipir (18 F-AV-1451). Similar processing to Amyloid PET was performed to measure Tau PET SUVR. ADNI-3 Tau PET includes a broad set of regional MRI preprocessing and brain parcellation T1w preprocessing and parcellation was done using the FreeSurfer (v5.3.0) software package, which is freely available [45] , and data processing using the Laboratory of Neuro Imaging (LONI) pipeline system (http://pipeline.loni.usc.edu) [46] [47] [48] [49] , similar to [50, 51] . Brain volume and white matter mask were derived from the Desikan-Killiany atlas [52] . The parcellation was performed as part of the recon-all module of the FreeSurfer, which uses an atlas-based parcellation approach.\nPrior to parcellation, recon-all applies the following pre-processing steps: motion correction, nonuniform intensity normalization, Talairach transform computation, intensity normalization and skull stripping [52, 53, [62] [63] [64] [65] [54] [55] [56] [57] [58] [59] [60] [61] .\nFLAIR images of each participants were corrected for non-uniform field inhomogeneity using N4ITK module [66] of Advanced Normalization Tools (ANTs) [67] . FLAIR images were then coregistered to T1w images using antsIntermodalityIntrasubject ANTs module."}, {"section_title": "Mapping perivascular spaces", "text": "Perivascular spaces (PVS) were mapped from T1w images and then white matter hyperintensities, which were falsely segmented as PVS, were excluded using FLAIR images. PVS segmentation was done using an automated and highly reliable quantification technique that we developed and validated [68] . In brief, after preprocessing the data, T1w images were filtered using an adaptive non-local mean filtering technique [69] . [70] , was used as the noise level for non-local filtering [69] . To preserve PVS voxels while removing the noise, filtering was applied only on high frequency spatial noises. This was achieved by using a filtering patch with a radius of 1 voxel, which removes the noise at a single-voxel level and preserves signal intensities that are spatially repeated [69] .\nSubsequently, we applied a Frangi filter [71] to T1w using the Quantitative Imaging Toolkit [72] .\nThe Frangi filter estimates a vesselness measure for each voxel ( ) from eigenvectors of the Hessian matrix ℋ of the image:\nDefault parameters of = 0.5, = 0.5 and c were used, as recommended in [71] . The parameter c was set to half the value of the maximum Hessian norm. Frangi filter estimated vesselness measures at different scales and provided the maximum likeliness. The scale was set to a large range of 0.1 to 5 voxels in order to maximize the vessel inclusion. The output of this step is a quantitative map of vesselness in regions of interest and is taken to be the maximum across scales, as suggested in the original paper [71] . The range corresponds to specific levels in scale space that are searched for tubular structure feature detector. Thus, the outputs across voxels comprise vesselness measured across a range of filter scales. Then the optimum threshold of 1.5 [68] was used to segment the PVS voxels. For each segmented voxel, corresponding FLAIR voxels was checked, and if the FLAIR voxel value was a white matter hyperintensity, then the voxel was excluded from the final PVS mask. Supplementary Figure 1 shows an example of the PVS map of one of the study participants.\nT1w images were registered to the ANTs template nonlinear registration module [67, 73] , and the same transformation matrix was applied on PVS masks. Then the normative PVS was generated for each of the CN and MCI groups (Figure 1) . Two ROIs were then drawn on the template to enable statistical analysis of the PVS presence. The first ROI was drawn in the anterosuperior medial tempura lobe (ASM), and centrum semi-ovale of white matter (CSO-WM). The ROIs were registered back into each subject's space. Then, the number of PVS in those regions were divided by the total ROI volume to extract PVS volume fraction.\nAll FLAIR and T1w MRI images were manually checked for misalignment and postprocessing failure, randomly and blind to clinical and neuroimaging measures. A total of 37 participants were excluded after the quality control.\nWe observed MRI manufacturer difference across PVS measures, in which PVS were consistently underestimated in Philips compared to other scanners (p<0.01 across all comparisons). Therefore, two post-hoc tests were performed: 1) manufacturer was included in the regression model as covariate. No statistically significant contribution from scanner manufacturer was observed in any statistical model (all p-value ≥ 0.55). 2) statistical analysis was repeated, excluding 65 participants that were scanned with the Philips scanner. Statistical conclusions were equivalent to those from the full dataset when images from Philips scanner were excluded (Supplementary File 3) . Table 1 summarizes study participants' demographic and clinical information. To assess the PVS volume fraction differences, we used estimation statistics when comparing CN and MCI group differences [74] . To this end, we estimated the group mean difference by calculating the unpaired"}, {"section_title": "Statistical analysis", "text": "Cohen'd effect size and the confidence interval between the PVS volume fraction of CN and MCI groups. To calculate the confidence interval of the effect size 5000 bootstrap samples were taken.\nThe confidence interval was bias-corrected and accelerated [74] . We also reported two-sided pvalue of Mann-Whitney test, which was reported as the likelihood of observing the effect size, if the null hypothesis of zero difference is true. For strong and significant group differences, a secondary statistical analysis was performed to incorporate potential covariates. To this end, we performed logistic regression using cognitive state as dependent variable, adjusting for age, sex, education and brain size. PVS estimates were calculated as a volume fraction, defined as the volume of PVS in the region. For domain-specific analysis, a similar approach with the same covariates was used, but with the difference that CDR was used to make 2 groups: participants with no cognitive deficit (i.e. CDR=0) and participants with mild cognitive deficit (i.e. CDR=0.5).\nThe association between PVS volume fraction and Tau pathology, as measured by PET, was investigated. For Tau PET analysis, regional SUVRs in medial temporal lobe regions associated with early AD pathology were investigated. In particular, we examined whether PVS volume fraction of ASM is correlated with Tau uptake in regions with early AD pathology: entorhinal cortex (ERC), hippocampus (HC), and parahippocampus (PHC). We also looked at regions associated with Braak stages, as described in the Positron emission tomography method section.\nFor these analyses, we formulated a linear regression model to investigate whether PVS volume fraction is a predictor of Flortaucipir (AV-1451) SUVR, adjusting for age, sex, education and brain size. An ordinary least square fitting was used to fit the linear regression to the data using StatsModel Python library. A secondary analysis was also performed including the continuous unthresholded Aβ SUVR as a covariate to compare the effect size of PVS volume fraction against Aβ SUVR.\nWe then looked into possible explanations for PVS volume fraction mean differences between CN and MCI groups, including amyloid PET, APOE status, and cardiovascular measures. For the Amyloid PET analysis, participants were categorized into CN and MCI with and without amyloid presence, which was defined by a cut-off at SUVR of 1.1. Mean PVS volume fractions were then compared across Aβ-and Aβ+ groups, correcting for age, sex, brain volume and education. When the overall association between vascular and PVS volume fraction and amyloid load was assessed, the continuous unthresholded Aβ SUVR values were used. Similar estimation statistics framework was used for APOE status comparison and cardiovascular measures. For the APOE-ε4 carrier status analysis, participants were categorized into three groups based on the number of APOE ε4 allele repeats: 0 for ε3/ε3, 1 for ε3/ε4, and 2 for ε4/ε4. Participants with APOE-ε2 allele were excluded from genotype analysis as it was shown to be a protective carrier [75, 76] . A secondary analysis was done including APOE-ε2 allele, which resulted to the same conclusion (no association was found).\nFinally, because of the pathological changes in blood vessels observed in hypertension as well as the cerebrovascular response to the blood levels of oxygen and carbon dioxide, which are two primary determinants of ventilation [77] , we explored the contributions of blood pressure and respiratory rate to the PVS. Available cardiovascular risk factors including history of hypertension and vital signs (systolic and diastolic pressures, respiration rate and temperature) were used as independent variables to explain the variation of PVS volume fraction. Similar linear regression modelling as above was used for this purpose, correcting for age, sex, education and brain volume.\nThe Benjamini-Hochberg procedure with a false discovery rate of 0.05 was used to correct for multiple comparisons (Supplementary Figure 2 and Supplementary File 4) . Participants with a history of hypertension had significantly higher PVS volume fraction in the CSO-WM (p=0.018, adjusted for age, sex, education and brain volume). After exploring the vital signs (systolic, diastolic and pulse pressure, respiration rate and temperature), we observed a significant inverse association between respiration rate and PVS volume fraction in the ASM (p=0.004, adjusted for age, sex, education and brain volume), in which tachypneic participants (respiration rate > 20 per minute) had lower PVS volume fraction in the ASM. After including variables with statistically significant associations with PVS (i.e. history of hypertension and respiration rate) into the analysis of PVS difference by cognitive status (CN vs MCI), all statistical conclusions regarding cognitive group differences remained unchanged."}, {"section_title": "Results", "text": "A higher total amount of PVS was observed in the normative PVS map of MCI participants compared to CN participants. The increased PVS in MCI compared to CN participants was most evident in the CSO-WM. Surprisingly, PVS was lower in MCI compared to CN in the anterosuperior medial temporal lobe (ASM). A significantly lower PVS volume fraction in MCI compared to CN groups was observed in both left (p=0.00047) and right (p=0.0009) anterosuperior medial temporal lobe (corrected for age, sex, education and brain volume). We also observed an asymmetrical pattern of PVS volume fraction in this region in both CN (p=7e-13) and MCI (p=0.0001) groups (higher on the right hemisphere).\nNo asymmetry was observed in the CSO-WM (p=0.6). PVS volume fraction of the CSO-WM was higher in MCI compared to CN (Figure 2.d) , but not statistically significant after adjusting for age, sex, education and brain volume (p=0.07). When participants were categorized based on CDR scores (Figure 2.f and 2.g) , the same pattern was observed: PVS volume fraction of ASM were significantly lower in participants with signs of cognitive deficit (CDR=0.5) compared with cognitively normal individuals (CDR=0) (left ASM: p=0.00014, right ASM: p=0.00025, corrected for age, sex, education and brain volume). No significant differences were observed in the CSO-WM after adjusting for aforementioned covariates (Figure 2.h) ."}, {"section_title": "Figure 2. PVS volume fraction in anterosuperior medial temporal lobe (ASM) was significantly lower in mild cognitive impairment (MCI) participants compared to cognitively normal (CN).", "text": "A 3D render of the ASM on template space is presented in (a). Bilateral and significant PVS volume fraction differences between CN and MCI participants were observed in ASM (b and c). Unpaired Cohen's d effect size and confident intervals were reported (d [CI]) for the group differences between CN and MCI using estimation statistics [74] . Two-sided p-value of Mann-Whitney test was also reported. The second p-value (reported on the line between the swarm plots) is adjusted for age, sex, years of education and brain size using logistic regression. The PVS volume fraction in ASM was asymmetrical across both CN and MCI groups (e); mean and standard errors are shown. Diagnostic group comparison on PVS volume fraction across the centrum semiovale of the white matter (CSO-WM) is shown in (d). (f-h) plots compare PVS volume fraction of the ASM when study participants were categorized based on clinical dementia rating (CDR).\nPVS volume fraction in the ASM was significantly associated with Tau PET standardized uptake value ratio (SUVR) in the entorhinal cortex (ERC), which is a pathological hallmark of AD in the first stages (Braak stages I and II). The association appeared to be lateralized, in which only the right ERC showed significant correlation (beta (SE) = -0.02 (0.007); p=0.006, corrected for age, sex, education and brain volume). Unlike ERC, we did not observe significant associations between PVS volume fraction and Tau uptake in the hippocampus and parahippocampal cortex nor in the white matter. ASM PVS volume fraction was associated with Tau uptake in regions associated with Braak I and II (i.e. HC and ERC combined), which is likely dominated by the significant association of PVS volume fraction and the ERC Tau uptake. The correlation was weaker for Braak stage III and IV, which includes parahippocampal, fusiform, and lingual gyri as well as the amygdala. The weakest correlation was found in regions affected in the latest Braak stages (V and VI), suggesting that ASM PVS alteration could be a biomarker of early AD pathology (the list of the brain regions analyzed according to the Braak stages are included in Supplementary File 2).\nPVS volume fractions across different regions were independent of Amyloid load or APOE 4 status (Figure 4 and 5) . A secondary linear regression was performed using cerebral amyloid load values (A SUVR) as a predictor of PVS volume fraction, which showed that A uptake was not a predictor of PVS volume fraction (p=0.61). The same conclusion was drawn when the analysis was performed on CN and MCI groups separately. No differences in mean PVS volume fraction between A -and A + participants were observed in MCI and CN participants (CN (left ASM): Figure 3) . We also observed no PVS volume fraction difference across participants with different APOE e4 allele repeats (Figure 5) . A -/+ categorization was applied based on Florbetapir cortical summary measurement (SUVR). Florbetapir cutoff of 1.11 using the whole cerebellum region as a reference. Equivalent statistical conclusions were drawn when we used a cutoff of 0.79 in a composite reference region including cerebellum, brainstem/pons, and eroded subcortical white matter. Linear regression analysis using A SUVR also showed no association between A uptake and PVS volume fraction (p=0.61). When regional values of A SUVR were used (instead of global SUVR), no associations were observed (p>0.6 for all tests). "}, {"section_title": "Discussion", "text": "In summary, our findings show that older adults with mild cognitive impairment develop alterations in the PVS; specifically, a significantly lower PVS volume fraction was found in ASM and a (non-significantly) higher PVS volume fraction was measured in the CSO-WM compared with cognitively normal participants. Since group differences in ASM PVS measurements between CN and MCI were significant after correcting for several covariates, including age and brain volumes, these data indicate that PVS alterations in ASM reflect cognitive impairment independent of normal aging and may therefore represent a sensitive biomarker of early cognitive dysfunction.\nConcerning the PVS in CSO-WM, our present results are consistent with previous studies\nshowing an association between enlarged PVS in CSO-WM and both Alzheimer's disease and cerebral amyloid angiopathy [26, 78] ; however, the enlargement of PVS in CSO-WM of MCI individuals in our cohort was not significant after correction for brain volume, suggesting that these changes might actually be a consequence related to the atrophy of the brain, as previously postulated [79, 80] . The CSO-WM results also invite further region-specific analysis across the white matter as neuroimaging techniques become more sensitive to PVS presence [68] .\nIntriguingly, for the first time we demonstrated a loss of PVS signal in the medial temporal lobe, a critical region intimately connected with the limbic system and anatomically in contact with the hippocampus. The PVS volume fraction of this region was a significant predictor of the cognitive status in a multivariate logistic regression model. Since the signal measured in PVS strictly depends on the CSF signal, we hypothesize that the reduction in PVS volume fraction may to diminished blood flow and white matter damage [1] . Although it is not known whether an early BBB breakdown similarly occurs in ASM, we believe that the obstruction of the PVS by these deposits may impair the CSF perivascular flow, with resulting decreased detectability of PVS in ASM of MCI individuals. In addition, we found that these PVS changes were independent from the Aβ and Tau pathology, as measured by PET and CSF. This is consistent with the recent demonstration that neurovascular dysfunction and BBB breakdown occur early in AD and independently of Aβ and Tau [2] , and therefore supports our pathogenic hypothesis. Interestingly, only the Tau uptake in the entorhinal cortex, a region classically described to be affected early according to the Braak staging, showed a significant association with the PVS changes in ASM,\nsuggesting that the PVS alteration in ASM may represent an early biomarker of AD pathology.\nIt has also been proposed that the impairment of the glymphatic flow through the PVS might reduce the clearance of metabolic waste products, including Aβ and Tau [5] , whose deposits could further impair the perivascular drainage, leading to ulterior accumulation in a 'feed-forward' process.\nHowever, whether BBB breakdown and perivascular flow impairment with reduced clearance are related and to which extent these two factors contribute to neurodegeneration remain to be explored by future studies.\nAccording to our results the APOE haplotype did not influence the PVS volume fraction and distribution in ASM and CSO-WM. Pathological changes in the structure and/or function of cerebral microvasculature has been shown to play a major role in dementia [21, 81, 82] . PVS, as direct biomarker of the cerebral glia-lymphatic pathway and indirect biomarker of cerebrovascular health, represent a \"bridge\" between two key mechanisms underlying neurodegeneration and may therefore be a novel indicator of early pathophysiological processes leading to cognitive impairment. On one hand, BBB breakdown in medial temporal regions has been demonstrated to affect a number of cognitive functions, such as working memory, executive function, and semantic fluency tasks, as a consequence of disrupted structures and connecting pathways [2] ; BBB damage may indeed induce neurotoxicity and axonal degeneration via multiple mechanisms, including perivascular and parenchymal leakage of blood-borne neurotoxic proteins as well as activation of inflammatory responses [6] . For example, plasmin and fibrinogen derived from the circulating blood are able to provoke neuronal injury, axonal retraction, and further BBB damage [83, 84] ; moreover, influx of albumin leads to perivascular edema, which obstructs not only the perivascular flow but also the microcirculation blood flow, resulting in hypoxia and neuronal death [28, 85] .\nOn the other hand, the impairment of the perivascular drainage system mediating waste products elimination and Aβ clearance is responsible for cerebral amyloid angiopathy, which is considered a pathological hallmark of AD and is related to cognitive decline [86] [87] [88] . Since in both cases pathological changes in PVS (i.e., obstruction/occlusion and/or enlargement), are reasonably expected as a consequence of the accumulation of proteins and other substances in the perivascular compartment, it is important to analyze and quantify these alterations that could be used not only as a potential biomarker of cognitive decline, but also for a better understanding of the pathophysiology and consequently for planning appropriate therapeutic interventions.\nFuture longitudinal studies, focusing on examining the alteration of the PVS as a function of pathophysiology and the cognitive decline, are demanded to further validate our findings and to evaluate the efficacy of PVS mapping as a surrogate for brain clearance and vascular health. The precise quantification and mapping of PVS offer the possibility to significantly improve the characterization of PVS changes, which were previously underappreciated by the visual rating methods. Moreover, the development of automated pipelines for computing unbiased and reproducible measurements of PVS will facilitate the analysis of PVS in multi-center studies and the comparison of the results with those obtained by other research groups, leading to more solid and comprehensive knowledge of the role of PVS. However, for this purpose it is fundamental to consider that the MRI-based PVS analysis strongly relies on the image resolution: higher resolution corresponds to increased PVS detection and improved segmentation [68, 90, 91] . Small PVS remain still undetected on MRI or are not discernible from noise. This limitation currently does not allow to identify the submillimeter pathological changes from clinical data, which are hypothetically supposed to occur at the very early pre-clinical stages of the disease. Finally, quantitative characteristics of the PVS using non-invasive techniques, such as diffusion MRI, could be used to extract submillimeter information [91, 92] ."}, {"section_title": "Conclusions", "text": "In conclusion, our results demonstrate that PVS may represent an important new biomarker of cognitive decline, in individuals in the Alzheimer's continuum as well as those without Aβ and/or pTau positivity. In contrast with CSF and neuroimaging biomarkers based on contrast-enhanced MRI, this novel biomarker is completely non-invasive and does not require any contrast injection since it can be accurately measured using conventional clinical sequences. This discovery encourages further investigation of the cerebral PVS in terms of both pathophysiology and new potential therapeutic strategies for cognitive dysfunction."}, {"section_title": "Supplementary File 3.", "text": "Statistical analysis results of when PVS volume fraction of ASM were used to predict cognitive state, using a logistic regression, using age, sex, education and brain volume as covariatesexcluding images acquired with Philips scanner. "}]