[{"section_title": "Abstract", "text": "Background: Immigrants and their children are the fastest-growing demographic group in the United States, and schools are often the first social institution young immigrants engage with on a sustained basis. As such, the academic achievement of immigrant students can be viewed as an indicator of their incorporation and a predictor of educational and employment outcomes in adulthood. In this study, we examined the factors associated with differences in mathematics achievement between first, second, and third-plus generation students in the US.\nWe analyzed the data from the Programme for International Student Assessment (PISA) 2012. Our analytic sample included 3700 15 year-old students attending US public and private schools. We used information on students' background and school characteristics from the student and school questionnaires. We used multiple linear regression models to predict mathematics achievement. To address the sampling design of PISA and the use of plausible values we fitted the models using the IDB Analyzer.\nResults: Our analysis shows that the families and schools of second-generation students are more similar to their first-generation than their third-plus generation peers. Once we control for student background characteristics and school contextual factors, the achievement gap between first-generation students and their second and third-plus generation peers disappears. Our results suggest that what we observed as generational differences in achievement are more likely to be gender, racial, and socioeconomic gaps.\nOur findings imply that student background and school contextual factors counteract some of the disadvantages that first-generation students face in the US. Our results also support existing evidence about the second-generation advantage in academic achievement. Taken together, these findings suggest that mathematics achievement can be addressed by policies and practices that support all students alongside policies and practices that target immigrant students. "}, {"section_title": "Introduction", "text": "Immigrants and their children are one of the fastest-growing demographic groups in the US, comprising 26% of the US population in 2015 (Pew Research Center 2015) . Schools are the first social institution young immigrants engage with on a sustained basis and their experiences in schools can either facilitate or hinder their transition into US society (Suárez-Orozco et al. 2009 ; see also Crosnoe and Lopez-Gonzalez 2005; Pong and Zeiser 2012) . One indicator of incorporation, or how immigrants adapt to life in the US is the academic achievement of first and second-generation immigrant students compared to their third generation and higher peers (hereafter third-plus generation).\nStudents' experiences in high schools are particularly important to understand because high schools are the gateway to participation in postsecondary educational opportunities and US economic and political life. While a substantial body of research has suggested that second-generation immigrants reach parity with or surpass their third-plus generation peers on a range of educational outcomes, most of these studies were conducted with data that is a decade or more old (e.g., Crosnoe and López-Turley 2011; Harris et al. 2008; Pong and Zeiser 2012; Potochnick and Mooney 2015) .\n1 Yet there is also considerable variation in outcomes among immigrant groups of both generations that are associated with race/ethnicity and family background, as well as the characteristics of immigrant destinations. These differences in outcomes suggests that the patterns of immigrant incorporation into US socioeconomic institutions are segmented (Duong et al. 2016; Pew Research Center 2015; Portes and Zhou 1993; Tran and Valdez 2017; White and Glick 2009 ). While many factors are associated with differences in achievement between the three groups, student and family background are the most frequently analyzed (e.g., Glick and White 2003; Kao 1999; Kao and Tienda 1995; Palacios et al. 2008; White and Glick 2009) . From a policy standpoint, it may be more important to understand features of the context of reception, or the opportunity structure for immigrants that can either be welcoming or hostile Rumbaut 2001, 2006; Rumbaut 2008; Schwartz et al. 2014; Stepick and Stepick 2010) . 2 With the exception of Feliciano (2018) , most analyses using the context of reception framework have not addressed school contexts in much depth (see also Crosnoe and Lopez-Gonzalez 2005) . However, we view the features of schools as an important aspect of the context of reception for immigrant youth because school-level policies and practices are malleable via school, district, state, or federal policies. As Crosnoe and Lopez-Gonzalez (2005) observe: \"Schools are, after all, a formal societal institution that has an enormously expansive, almost universal reach in the early life course\" because they provide access to institutional resources and serve as sites for socialization and developing social relationships (p. 20) .\nTo address these issues we ask two research questions: (a) what is the relationship between generational status and academic achievement? Are there differences in achievement between immigrant students and their third-plus generation peers? (b) Pivovarova and Powers Large-scale Assess Educ (2019) 7:7 To what extent do students' backgrounds and school contexts explain differences in achievement between these three groups?"}, {"section_title": "Literature review", "text": "Prior to 1965, most immigrants to the US were European and Canadian. The Immigration and Nationality Act altered the nature of immigration to the United States by expanding the number of immigrants and their countries of origin (Passel 2011) . The immigrants that entered the United States under the auspices of the 1965 Immigration and Nationality Act, a majority whom of have been Hispanic or Asian were, and continue to be, more diverse than the immigrants of previous generations. Since 1965, the immigrant population has increased from approximately 5% of the US population to 13% in 2010 (Griego et al. 2012; Pew Research Center 2015) . In 2000, half of recent arrivals were Hispanic while 22% were Asian. In the past decade this pattern has reversed so that by 2013, 33% of recent arrivals were Hispanic and 35% were Asian. The PISA 2012 sample includes immigrants who arrived in the United States as children in the late 1990s and early 2000s and who will be an important segment of the US labor force in the next four decades (Suárez-Orozco et al. 2009 ). Likewise, in 2015, 12% of the US population was comprised of second-generation immigrants who are projected to be a significant influence on future population growth (Pew Research Center 2015) .\nIn the section below we review the research on the school achievement of earlier cohorts of immigrant students, which provides an important backdrop for our analysis of PISA. Within this broad literature, we highlight studies that address the school contexts of immigrant students, one of the key sets of explanatory variables in the analyses that follow."}, {"section_title": "The academic achievement of immigrant students", "text": "While an extensive body of research has assessed immigrant achievement across groups by generational status using grades as outcomes, a smaller group of studies has used standardized test scores (Duong et al. 2016) . A subset of these utilize data drawn from nationally-representative samples of students. 3 We focus on the findings on mathematics achievement from this latter group of studies. Both first and second immigrant students had lower mathematics achievement than their third-plus generation peers in 1980 (Glick and White 2003) . By the late 1980s and early 1990s, this pattern had reversed such that both first and second-generation immigrant students had higher achievement than their third-plus peers, which was often characterized as an \"immigrant advantage\" (Schwartz and Stiefel 2006, p. 19 ; see also Crosnoe and López-Turley 2011; Glick and White 2003; Kao 1999; Kao and Tienda 1995; Potochnick and Mooney 2015) . In 2002 the immigrant advantage narrowed or even disappeared (Pong and Zeiser 2012; Potochnick and Mooney 2015) . When disaggregated by country of origin, race/ethnicity, and socioeconomic status, educational outcomes for immigrants vary considerably across groups (Demie 2001; Duong et al. 2016; Glick and Hohmann-Marriott 2007; Feliciano 2005; Greenman 2013 ; Pivovarova and Powers Large-scale Assess Educ (2019) 7:7 Kao 1999; Pong and Hao 2007; Portes and MacLeod 1996; Potochnick and Mooney 2015; Schnepf 2004; Sullivan et al. 2016; White and Glick 2009 ). For example, in an analysis that compared the academic achievement of immigrant students by generational status relative to White students who were third-plus generation, Kao (1999) documented an immigrant advantage in mathematics for Asian first and second-generation immigrant students and White second-generation students. While the achievement of White students who were third-plus generation was higher than Hispanic second-and third-generation students, as well as all three groups of Black students, the achievement gap was smaller for the immigrant students within these groups than their third-generation peers. Kao attributed the higher achievement among immigrant students to immigrant optimism among their parents who tend to have a positive view of their children's schools and the opportunities for them and their children in the US, which pushes their children to do well in school (see also Kao and Tienda 1995; Portes and Rumbaut 2001 ). Many of the initial studies that suggested there was an immigrant advantage were based on analyses of the National Educational Longitudinal Study (NELS) of 1988 (Crosnoe and López-Turley 2011; Kao 1999; Schwartz and Stiefel 2006) . More recent studies using the NELS, the Educational Longitudinal Survey (ELS) of 2002 and the Early Childhood Longitudinal Study (ECLS-K) have provided more nuanced analyses of the immigrant advantage that account for the heterogeneity of the immigrant population and educational and occupational outcomes over time (e.g., Glick and Hohmann-Marriott 2007; Hao and Pong 2008; Harris et al. 2008; Hsin and Xie 2014; Potochnick and Mooney 2015) .\nAs the discussion above suggests, immigrant achievement has also varied across cohorts. An early study of immigrant achievement in the early 1980s and 1990s found that students' generational status was related to baseline achievement, but that the effects of generational status varied across cohorts (Glick and White 2003) . Students' subsequent academic trajectories were more strongly shaped by race/ethnicity and socioeconomic background than by generational status, which could point to the context of reception (Glick and White 2003; Portes and Rumbaut 2001; Schwartz and Stiefel 2006; White and Glick 2009 . For example, immigrant students and the children of immigrants whose parents have relatively high social and cultural capital will have more success navigating mainstream American institutions such as schools than those that do not (Kalogrides 2009 ). Likewise, immigrant students who experience racial discrimination in their schools and communities may struggle more in school than their peers who do not experience racial discrimination (Portes and Rumbaut 2001; Glick 2009). Feliciano (2005) suggests that some of the within-group differences in immigrants' educational outcomes may be partially attributable to educational selectivity or the difference between immigrants' educational attainment and the educational attainment of their peers who remained in their home countries (see also Hsin and Xie 2014) . Potochnick and Mooney (2015) compared the achievement of successive cohorts of sophomore students and found that once demographic variables were controlled, firstgeneration immigrants outperformed their third-generation peers in mathematics in 1990 but their mathematics achievement was lower than the third generation in 2002. While the 2002 decline in academic achievement of immigrant students varied across ethnic/racial groups, in general they found that first-generation immigrants' reading and Page 5 of 18 Pivovarova and Powers Large-scale Assess Educ (2019) 7:7 mathematics scores were lower in 2002 than 1990 (Potochnick and Mooney 2015) . This decline was partially attributable to the shift in the demographic characteristics of the newer cohort and in particular, an increase in the share of Hispanic students. In addition, compared to first-generation immigrant students in 1990, first-generation immigrant students in 2002 had fewer family resources and attended schools with higher concentrations of minority students and student-teacher ratios, which also could have contributed to the achievement decline."}, {"section_title": "School contextual factors associated with academic achievement", "text": "In addition to understanding the achievement patterns of immigrant students compared to their US-born peers, researchers have also been concerned with documenting and analyzing the school contexts of immigrant students and its relationship to student achievement. Immigrant students are more likely to live in neighborhoods with high concentrations of poverty and attend under-resourced schools than their non-immigrant peers-conditions associated with low educational achievement (Crosnoe 2005; Crosnoe and López-Turley 2011; Pong and Hao 2007; Potochnick and Mooney 2015) . Crosnoe (2005) compared the school contexts of first and second-generation Mexican immigrant students with their US-born peers using the Early Childhood Longitudinal Study (ECLS-K) across three broad categories: (a) structural characteristics such as school size and teacher experience; (b) compositional features of schools such as the percentages of poor and minority students; and (c) measures of school climate such as school safety and level of disorganization within the community. Crosnoe (2005) found that Mexican immigrant students tended to be overrepresented in high poverty schools that served larger shares of minority students, and had less experienced teachers than other racial/ ethnic groups. Mexican immigrant students also attended schools in more disorganized communities than their US-born peers across racial/ethnic groups, which he characterized as a double-disadvantage (see also Pong and Hao 2007) . School contextual factors were not significant predictors of students' first grade mathematics achievement once other factors were accounted for. However, Mexican immigrant students tended to have higher performance in high poverty schools than other racial/ethnic groups. Areepattamannil and Kaur (2013) used the 2006 PISA to analyze the mathematics achievement of immigrant students in Canada controlling for a wide range of individual and school contextual factors. The only variable among the latter that was a significant predictor of immigrant students' science achievement was a shortage of qualified teachers. Immigrant students who attended schools in which their principals reported that a teacher shortage was a problem tended to have lower science achievement than immigrant students who attended schools without a teacher shortage. While the context of reception for immigrants in Canada is different than the United States (Bloemraad 2006) , we include it here as an example of a study based on PISA data that incorporated school contextual factors in the analysis. Potochnick and Mooney (2015) found that compared to their native peers, immigrant students were more likely to attend urban schools and schools with higher concentrations of poor, minority, and limited English proficient students. On average, immigrant students also attended schools with higher student-teacher ratios. The only school contextual factors that were statistically significant predictors of students' mathematics Page 6 of 18 Pivovarova and Powers Large-scale Assess Educ (2019) 7:7 achievement were percent poor students and student-teacher ratio. Finally, cross-country evidence from the Trends in International Mathematics and Science Study (TIMSS) suggests that school contextual factors such as class size were not strongly associated with achievement for immigrant or native students. While more immigrant students attended schools in urban areas, there were no differences in achievement between immigrant and native students by school locale. One factor that seemed to matter for all students independent of their immigrant status is student climate: students who attended schools with more positive climates on average had higher achievement than their peers whose schools had less positive climates (Hastedt 2016) . Overall, prior studies have found that school contextual factors are associated with student achievement, but their effects cannot be isolated from family background variables given the strong association between students' family backgrounds and the types of schools they attend (Lee 2015a, b) ."}, {"section_title": "Data and methods", "text": ""}, {"section_title": "Data and sample", "text": "PISA is an international student assessment collected and administered by the Organisation for Economic Development and Cooperation (OECD). This assessment is intended to provide measures of the knowledge and skills young people need for full participation in the global economy and as citizens in modern societies when they are at the end of compulsory schooling (OECD 2014a). According to the OECD, the PISA assesses how students can apply their knowledge to novel situations in and out of school settings (OECD 2014b). Administered every 3 years, PISA 2012 focused on assessing students' mathematics literacy. 4 PISA provides a rich source of data about high school students home and school lives because the students were also surveyed about their family backgrounds, their attitudes toward learning, and their perceptions of their school environments. The principals of the participating schools also answered surveys that provided information about the students' schools that can be linked to the student data. There are two additional advantages to the PISA. First, the United States data has a sufficiently large sample of first and second-generation immigrant students to permit comparisons between immigrant and third-plus generation students. Second, the PISA provides more recent data on immigrant and third-plus generation youths' high school experiences and achievement than most extant studies, many of which relied on the NELS of 1988 and the ELS of 2002. We used the US Public-use PISA files released by NCES. The 2012 US PISA data was collected using a two-stage stratified sampling design. A sample of public and private schools was selected, and then students were sampled within schools (Kastberg et al. 2014) . Participating schools were chosen such that all age-eligible students (15-year old students enrolled in grade seven or higher) would be equally likely to be selected for the sample. The full PISA 2012 US sample is comprised of 4978 students attending 162 schools. We excluded cases listwise that were missing information on the variables in our analysis, resulting in a final sample of 3700 students, Page 7 of 18 Pivovarova and Powers Large-scale Assess Educ (2019) 7:7 which included 224 first-generation immigrants and 457s-generation immigrants. 5 Our analysis proceeds in two steps. To answer our first research question about the relationship between immigrant status and academic achievement, we analyzed mathematics achievement using multiple regression models that assess blocks of variables for individual and school level characteristics. Our second research question focuses on the school contexts of immigrant students. As we explain below, our findings suggested that school contextual factors moderate the effects of immigrant status on achievement."}, {"section_title": "Dependent variable", "text": ""}, {"section_title": "Mathematics achievement", "text": "Our goal was to explore the extent to which school contextual factors moderate the gaps in academic achievement between immigrant students and their third-plus generation peers for more recent cohorts of immigrant students. We focused on mathematics achievement because it was the main domain assessed in the PISA 2012 and the student and school questionnaires were designed to collect information pertaining to math instruction. In PISA and other large-scale assessments, students do not take a single test with an identical list of test questions, rather they take shorter assessment blocks composed of subsets of the complete assessment (von Davieret al. 2009 ). Because of this design feature, if individual students' scores were estimated, each score would have a considerable amount of measurement error. Instead, five scores, or plausible values indicating the range of each student's proficiency are generated using multiple imputations researchers can use to estimate the achievement of groups of students. We conducted the analyses of plausible values using the IDB Data Analyzer (version 4.0.26)."}, {"section_title": "Independent variables", "text": ""}, {"section_title": "Student-level variables", "text": "The main variable of interest is students' generational status. First-generation students were born outside the US to foreign-born parents. Second-generation students were born in the US to at least one foreign-born parent. Additional student background characteristics included gender, race/ethnicity, 6 parental education, an index of wealth, and language other than English spoken at home. Parental education is measured using a set of variables that indicate if a student's parents reached one of three educational transitions: graduated from high school, attended some college, or college degree or higher.\nWealth is an OECD-calculated index based on students' responses to survey questions about their families' possessions. Because PISA 2012 does not include a direct measure of income, we used the latter as a second indicator of social background. We also controlled for grade. While the majority of students were in the tenth grade we added indicators for students who were in other grades because grade level is likely to be associated with mathematics achievement.\n5 We had information on the immigrant status of 4811 students. We were missing information on the immigrant status of 144 students in the full PISA 2012 US sample, which comprised 104,542 students in the weighted sample (3%). We dropped an additional 23 students who attended schools in which fewer than 10 students were sampled. 6 One of the limitations of the public-use version of the PISA is that it does not have information on country of origin to allow us to disaggregate within racial/ethnic groups. More recent studies suggest that there are considerable withingroup differences in immigrant outcomes by country of origin or ethnicity (e.g., Glick and Hohmann-Marriott 2007; Tran and Valdez 2017) .\nPage"}, {"section_title": "School level variables", "text": "Existing studies have highlighted the relationship between school contextual factors and student academic achievement (Areepattamannil and Kaur 2013; Crosnoe 2005; Pong and Hao 2007; Potochnick and Mooney 2015) . Based on this evidence we selected a number of school-level variables from PISA dataset to include in the model to provide indicators of the context of reception for immigrant students. Structural characteristics which include school and class size, student-teacher ratio, and teacher qualifications are strongly associated with student achievement within individual countries as well as across countries even after controlling for student background, school funding, and institutional features of school systems (Altinok and Kingdon 2012; Hanushek and Woessmann 2017; Woessmann 2016) .\nCompositional features are represented in our models by indicators for students eligible for free and reduced-price lunch and share of high school dropouts. A large body of research has documented the strong association between poverty and academic achievement (Sirin 2005) . We constructed an indicator that the school has more than 75% students eligible for free and reduced-priced lunch as a school-level measure of poverty. Another conventional measure of school composition is the share of high school dropouts, which we used to construct an indicator variable that denotes a school where the dropout rate is greater than 10%. Additional relevant compositional features are the school-level shares of students from different racial backgrounds and share of immigrant students, which we did not include in the final model because they were highly correlated with students' own backgrounds.\nSchool climate has been shown to be positively associated with academic achievement and narrowing achievement gaps between racial/ethnic groups (Hastedt 2016; Morgan et al. 2016; Stewart 2008; Wang and Degol 2016) . We use a measure of the school climate as perceived by students, or student-related aspects of school climate. Finally, institutional features such as school sector (public or private) and school location (urban, suburban, or rural) are also associated with achievement (Cobb-Clark et al. 2012). 7 See Table 1 for a more detailed description of variables.We modeled the relationship between student achievement and generational status as follows:\nwhere A is is the PISA mathematics score of student i in school s, FirstGen and SecondGen are indicators of generational status, and vectors W and Z are our sets of individual and school level controls. Table 2 provides the descriptive statistics for the student-level analysis. The first two columns provide the descriptive statistics for first and second-generation students, respectively, and in column three we provide descriptive statistics for third-plus generation students. Our samples of immigrant students roughly mirrored the demographics of immigrant youth between the ages of 12 and 17 nationally (Passel 2011) . 8 First-generation students' average mathematics achievement was 464, which was 25 points lower than second-generation students and 28 points lower than third-plus generation students. Sixty-one percent of our first-generation immigrant students were Hispanic and eighteen percent were Asian, which was consistent with the demographic characteristics of immigrants who arrived in the United States in the late 1990s and early 2000s, when many of the immigrants in the PISA sample would have entered the United States as young children. There were slightly higher shares of Hispanic and Asian American students in the second-generation (62% and 22%, respectively). White students comprised the majority of third-plus generation students (67%). In general, the parents of third-plus generation students had more education than the parents of first and second-generation students. Both first and second-generation immigrant students were substantially less wealthy than the third-plus generation students. The mean for first-generation immigrant students on our wealth measure was 0.06 or just slightly above the OECD mean which is set at zero, compared to 0.38 for secondgeneration students and 0.63 for third-plus generation students. Seventy-two percent of first-generation students spoke a language other than English at home, compared to 51% of the second-generation and 2% of the third-plus generation students. Sixty percent or more of all students were in grade 10 although there was considerable variation by generational status."}, {"section_title": "Results", "text": "Comparing across the three groups also highlights how on average, the characteristics of the schools attended by both first and second-generation immigrant students differed from those attended by third-plus generation students. The vast majority of all students attended public schools, however, there were substantial differences across the three groups in school locale. Ten percent of first-generation students attended rural schools compared to two percent of second-generation and 30% of third-plus generation. Both groups of immigrant students attended schools that were larger, enrolled more poor students, and had larger class sizes than the schools attended by third-plus generation students. Principals reported that a shortage of teachers was not a problem in the schools attended by 60% of the first-generation students compared to 66% of second-generation students and 75% of third-plus generation students. There was similar variation across "}, {"section_title": "Variable Description", "text": "Student climate An index variable created by summing school principals' responses on eight variables that assessed the extent to which the following student behaviors and attitudes hindered student learning: truancy, skipping classes, tardiness for school, absenteeism at required school events and activities, lack of respect for teachers, disruption of classes, use of alcohol or drugs, and bullying. Principals' responses ranged from 1 \"Not at all\" to 4 \"A lot. \" We reverse-coded the variables before creating the index so that a higher value indicated a more positive school climate Pivovarova and Powers Large-scale Assess Educ (2019) 7:7 the three groups in the shares of teachers with a bachelor's or master's degree in mathematics. However, first-generation immigrant students' schools had lower student-mathematics teacher ratios than both second-generation and third-plus generation students. With the exception of mathematics achievement, all of the differences between individual characteristics of second-generation students and third-plus generation students were statistically significant.\nIn other words, the demographic backgrounds and the characteristics of the schools attended by second-generation students more closely resembled those of first-generation students than third-plus generation students.\n9 While these differences in the school contexts of immigrant and third-plus generation students are notable, comparing the three groups suggest all three experienced opportunity gaps in some areas (Carter and Welner 2013) . For example, on average 25% of all third-plus generation students and 40% of first-generation immigrant students attended schools with shortages of mathematics teachers, and the average high school student was one of more than 115 students assigned to her mathematics teacher.\nBased on the descriptive statistics in Table 2 and evidence from prior research, we anticipated that there would be a negative relationship between first-generation immigrant status and mathematics achievement. Similarly, we expected there to be a significant positive relationship between achievement and wealth after controlling for immigrant status. Statistically significant coefficients on the race/ethnicity variables would suggest racial achievement gaps in comparison to White students independent of immigrant status. We also expected to find significant relationships between achievement and school contextual factors. Table 3 provides the results of our student-level regression analysis with mathematics achievement as the dependent variable. Model 1 is the baseline model, which contains variables for generational status. Both coefficients are negative but only the coefficient for first-generation immigrant was statistically significant. The latter indicates that the achievement gap between first-generation and third-plus generation students was 28 points or slightly below one-third of the standard deviation for the full sample (89 points, not shown). Model 2 accounts for the differences between students by gender, race/ethnicity, parental education, wealth, home language other than English, and grade, and explains more than a quarter of the overall variation in mathematics achievement across students (R 2 = 0.27). The first notable finding is that when we accounted for student background, the achievement gap between first-and third-plus generation students vanished. The achievement gap between second-and third-plus generation students, albeit only marginally significant at conventional levels, 10 is positive and indicates that second-generation students perform on par or even slightly better than their third-plus generation peers once we controlled for similarities in their background. All of the student background characteristics included in the model are significantly associated with achievement and explain differences in academic performance. The latter highlights how achievement varies considerably across racial/ethnic groups and by socioeconomic status. This suggests that what we initially observed as an achievement gap between firstgeneration immigrant students and their third-plus generation peers in Model 1 are gender, race, parental education, wealth, and language gaps. On average, girls had lower test scores than boys in mathematics. Black and Hispanic students had lower scores relative to White students while Asian students had higher scores. Likewise, the parental education and wealth variables are positive and significant, which indicates that students from more advantaged families had higher mathematics achievement than students with 10 According to the American Statistical Association, \"p-values and related analyses should not be reported selectively.\nConducting multiple analyses of the data and reporting only those with certain p-values (typically those passing a significance threshold) renders the reported p-values essentially uninterpretable\" (Wasserstein and Lazar 2016, p. 131) . We report coefficients with p-values up to the 10% threshold.\nFootnote 9 (continued) generation student included location (urban and rural), school and class size, share of FRL eligible students, and no shortage of mathematics teachers (results available from authors on request).\nPage 13 of 18 Pivovarova and Powers Large-scale Assess Educ (2019) 7:7 less educated parents or lower wealth. These results also demonstrate that the generational differences in immigrants' achievement in the raw data is partially a function of differences in race/ethnicity, use of English language at home, grade progression, wealth, and parental education. In Model 3, we included only our set of school contextual factors to understand how differences between schools are reflected in the achievement differences between immigrant generations. Our coefficient for first-generation immigrant status is now negative and only marginally significant, and second-generation remains positive and imprecisely estimated. Of the school level variables, public school, locale, our indicator for Table 3 Relationship between PISA mathematics score and student and school characteristics\nThe reference categories are: third-plus generation for immigrant generation group, White students for race, less than high school for parental education, Grade 10 for student's current grade, and rural school for school locale Page 14 of 18 Pivovarova and Powers Large-scale Assess Educ (2019) 7:7 high poverty school, school size, and student climate are all statistically significant at p < 0.05, while class size was marginally statistically significant at p < 0.10. We find that independent of immigrant generation, on average all students perform better in public schools than private schools and slightly better in urban schools compared to suburban and rural schools. We also find that school-level poverty and individual achievement are strongly related-the average student has a lower score in a school where more than 75% of students are eligible for free and reduced-price lunch. The same holds in schools with more than a 10% dropout rate; students have lower scores on average independent of their immigrant status and other school characteristics. The findings from this model strengthen our hypothesis that the apparent differences in achievement are not due to immigrant status but rather to students' home and school contexts. The results also suggest that for first-generation students, student background factors play a significant role in narrowing the achievement gap between their second-and third-plus generation peers. Finally, we included both student-level variables and school contextual factors in Model 4. We no longer observe generational differences in achievement. The coefficients for first-and second-generation are not statistically significant. School contextual factors such as sector, locale, high poverty, student climate, and school size were significantly related to achievement (although the latter is marginally significant at p < 0.10). After accounting for the differences in the observed characteristics of schools and students, average achievement was higher in urban public schools.\nStudent background and school factors account for a third of the variation in PISA mathematics test scores (R-squared = 0.31)-a large fraction given that we were not able to control for many other factors that are not available in the dataset such as student's prior mathematics achievement. When we controlled for student background and school characteristics separately in Models 2 and 3 we found that school contextual factors explain the differences in achievement between the second-and third-plus generations, and student background characteristics explain the differences between firstgeneration students and their third-plus generation peers. The fully saturated Model 4 suggests that to understand generational differences and achievement, we should look at both group of factors simultaneously. In other words, student background and school context should be regarded as factors that in combination shape the experiences of students. This confirms the descriptive evidence provided in Table 2 which indicates that school contextual factors were related to student demographics and background by immigrant generation status.\nOn average, there is a substantial achievement gap between first-generation immigrant students and their second and third generation peers, but the effect of first-generation immigrant status is explained by students' backgrounds and the characteristics of the schools that students attended. These findings point out that in addition to students' backgrounds such as family resources, the differences between the schools attended by first-generation students compared to schools attended by third-plus generation students (e.g., Crosnoe 2005) , or the contexts of reception that immigrants encounter in US schools, matter for students' outcomes (White and Glick 2009 ). The mathematics achievement of second-generation students is the same or higher than the mathematics achievement of third-plus generation students even though they attended schools with Page 15 of 18 Pivovarova and Powers Large-scale Assess Educ (2019) 7:7 many of the characteristics that appear to depress the achievement of their first-generation peers."}, {"section_title": "Conclusion", "text": "Immigrant adolescents come from a wide range of socioeconomic backgrounds and attend schools with different resources than their third-plus generation peers. These two factors shape their school experiences and subsequently their adult outcomes. In this study, we analyzed the differences in academic achievement between three generational groups accounting for student background and school context. Our descriptive results indicate that the families and schools of second-generation students are more similar to their first-generation peers than their third-plus generation peers, yet once these factors are controlled, second-generation students' achievement surpasses their third-plus generation peers.\nIn our analysis, we found that the negative achievement gap between first and thirdplus generation students virtually disappeared once we included gender, race, parental education, wealth, language, and grade. Similarly, the average achievement of secondgeneration students was the largely the same as the average achievement of third-plus generation students when we included school factors. When we controlled for student background, the second-generation outperformed their third-plus generation peers but the difference in achievement was only marginally significant. When we included school contextual factors in the model, there was no difference in the achievement of first and second-generation students relative to their third-plus generation school peers.\nOur results suggest that what we observe as generational differences in achievement are more likely to be gender, racial, and socioeconomic gaps. We also find support for the immigration advantage model proposed by Kao and Tienda (1995) whereby second-generation immigrants outperform first and third-plus generation students, which may be in part due to what they termed immigrant optimism. Our models suggest that despite attending schools that are more similar to their first-generation peers, second generation students outperform their third-generation peers when we account for students' background. Subsequent studies, including a major meta-analysis of the research on immigrant student achievement have confirmed this finding (Duong et al. 2016) . Our analysis suggests that this pattern is evident for more contemporary cohorts of secondgeneration students. Our results confirm that student background characteristics such as wealth and parental education play a larger role in the achievement of first-generation students relative to their third-plus generation peers than they do in the achievement difference between second and third-plus generation students. Our findings also indicate that it is relevant to conceptualize school context as one of the aspects of the context of reception that shapes immigrant incorporation. Differences in academic achievement between immigrant generations are important if we consider achievement to be a strong predictor of future success such as college attendance and higher wages as adults. However, addressing achievement differences between US students may require policies and practices that support all students, alongside policies targeted at immigrant students such as language support and ensuring immigrants are at grade level."}]