[{"section_title": "Abstract", "text": "This study examines mental health and special education needs and service use at school entry among children involved in maltreatment investigations as infants. Data are from the National Survey of Child and Adolescent Well-Being, a national probability study of 5,501 children investigated for maltreatment. The study sample comprised 959 children who were infants at baseline and 5 to 6 years old at the last follow-up. Half had behavioral or cognitive needs at entry to school. About a quarter received outpatient mental health or special education services. Logistic regression showed that compared to children residing with biological parents, adopted and foster children were more likely to receive mental health services, and children adopted or in kinship care were more likely to receive educational services. Increased monitoring of behavioral and cognitive needs of infants reported for maltreatment may facilitate their access to services and ease the transition to school."}, {"section_title": "", "text": "increased risk for future mental health and cognitive problems due to developmental disruptions (Cicchetti, 1989) . This study offers new insight into these long-term effects by estimating mental health problems and special education needs at a 5-to 6-year follow-up and by identifying the mental health and special education services received by children who were infants at the time of maltreatment investigations.\nChildren reported for maltreatment have higher rates of developmental and behavioral problems than children in the general population. The National Survey of Child and Adolescent Well-Being (NSCAW) provides the first nationally representative data on well-being and service receipt for children involved in child maltreatment investigations (Administration for Children and Families, 2005; NSCAW Research Group, 2003) . Analysis of this C hild maltreatment has been recognized as a major public health issue (World Health Organization, 2006) representing a significant burden of morbidity and premature mortality (Djedda, Facchin, Ranzato, & Romer, 2000) . In the United States during 2006, 3.6 million children received an investigation by child protective services (CPS). Maltreatment of infants deserves special concern: Allegations of maltreatment involving infants are the most likely to be substantiated (Administration for Children and Families, 2008a) , and infants less than a year old have the highest victimization rate (24.4 per 1,000 children), representing 11.4% of maltreated children (Administration for Children and Families, 2008a) . Moreover, infants are at substantial risk for placement in foster care (Administration for Children and Families, 2006, 2008b) and have the highest rates of maltreatment-associated death (44.2% of all fatalities; Administration for Children and Families, 2008a) . The impact of maltreatment among infants can be long term as well as immediate, with victims being at data has yielded national prevalence estimates of developmental and behavioral problems for the child welfare system (CWS) population. At initial (baseline) contact with the CWS, 48% of children aged 2 to 14 years had emotional or behavioral disorders , more than a third of children aged 0 to 3 years had developmental delays (Casanueva, Cross, & Ringeisen, 2008) , and 50% of preschoolers had high developmental or behavioral needs (Stahmer et al., 2005) . By contrast, mental health problems occur in the general population for about one fifth of children (Costello et al., 1996; Kataoka, Zhang, & Wells, 2002) . Similarly, among children of elementary school age whose cases were opened to the CWS, 30% showed a need for special education services at the 18-month follow-up (Webb, Jones Harden, Baxter, Dowd, & Shin, 2007) , whereas the generalpopulation need rate for elementary special education is about 10% (U.S. Department of Education, Office of Special Education Programs, 2006) .\nDespite the CWS population's high rates of need, other NSCAW research has shown that only one fourth of those who had emotional or behavioral disorders received any specialty mental health care Stahmer et al., 2005) , whereas among those with an open CWS case only 58% who needed special education services received them (Webb et al., 2007) . Only recently have studies examined the factors that predict service use (Garland & Besinger, 1997; Garland, Lau, McCabe, Hough, & Landsverk, 2005; Leslie et al., 2000) . Although these studies have consistently shown a significant relationship between need for services, defined as clinically significant Total Behavior Problems on the Achenbach (1991) Child Behavior Checklist (CBCL), and use of services, a disturbing finding has been that some predictors of use are nonclinical factors such as being older and being White (Garland & Besinger, 1997; Horowitz, Putnam, Noll, & Trickett, 1997; McMillen et al., 2004) .\nPlacement in out-of-home care is a major factor in service use, with children living in foster or kinship care being more likely to receive services than children who stay with their biological parents . For example, one study using NSCAW reported that more than half (57%) of children aged 2 to 14 years and in foster care received mental health services . A second NSCAW study (Stahmer et al., 2005) of young children in out-of-home care found that 29.2% of 3-to 5-year-olds received mental health services, and 37.0% of 3-to 5-year-olds received special education services. Not surprisingly, the percentages were smaller for children 0 to 2 years, among whom 9.1% received mental health services and 13.3% received special education services (Stahmer et al., 2005) .\nThe goal for children in out-of-home care who cannot return home is adoption, but no study specifically has compared rates of service use for children who were adopted with rates for children who remained in foster or kinship care. The mental health needs and services of children adopted from the CWS deserve special attention because their preadoption experience includes both maltreatment and dislocation, which have been associated with emotional, behavioral, and special education needs (Berry & Barth, 1989; Brodzinsky, 1993; Brodzinsky, Radice, Huffman, & Merkler, 1987; Ornelas, Silverstein, & Tan, 2007) . An analysis of a statewide sample of adopted youth aged 4 to 18 years found that high levels of externalizing behavioral problems were associated with preadoption abuse and neglect, prenatal drug exposure, and multiple placements (Simmel, Brooks, Barth, & Hinshaw, 2001) . Further analysis of the needs and service use of adopted children from the CWS is critical to determining what adoptive parents need to better help their children at the time of entry to school.\nFor many children the CWS acts as a gateway to mental health services; however, the CWS's facilitation of mental health service access appears to wane as CWS involvement decreases over time. One NSCAW study has reported that the onset of mental health service use among children 2 to 14 years old increased immediately after the child's contact with child welfare, but increases in service use were not maintained during the 1.5-year period after contact . We recently used NSCAW to explore receipt of early intervention services among children 0 to 36 months at baseline (Casanueva et al., 2008) . Of those children identified as in need of early intervention services (slightly more than a third of children), only 12.7% had received an Individualized Family Service Plan (IFSP) by age 3. Receipt of an IFSP at this age indicates preliminary access to Part C (early intervention) services that may include mental health services. At the 1.5-year follow-up, 5.7% of those in need and less than 3 years old had an IFSP, and only 8.8% of those in need and 3 years old or older had an Individualized Education Program (IEP). Receipt of an IEP at this age indicates preliminary access to Part B services, which would include preschool and school-based special education. Similarly, at the 3-year follow-up, only 17.5% of those in need had an IEP, showing that across time only a small percentage of young children in need received early intervention for cognitive or mental health needs.\nIn summary, previous NSCAW studies show that few young children with developmental and behavioral needs receive services before school entry. Because previous research also suggests that initial CWS involvement may increase access to mental health services but that this influence may no longer exist several years later, infants reported for maltreatment are extremely unlikely to receive services for their mental and developmental needs before school entry. Longitudinal research must examine the provision of services at school entry for those children involved with the CWS early in life.\nExamination of service delivery at school entry for these children makes sense because, for many children, schools are a specialty mental health service gateway (Brener, Weist, Adelman, Taylor, & Vernon-Smiley, 2007) . For many others needing mental health care, schools are not merely a gateway but the only service source (Burns et al., 1995) . Consequently, entry to school may be the first opportunity for most children maltreated in infancy to receive mental health and special education services. Receipt of mental health and special education services is particularly critical at the time of entrance to the school system, when children need to negotiate key developmental tasks while learning to function independently in a new, demanding environment. For children maltreated in infancy, these mental health and special education services may mean the difference between an unsuccessful transition to the school system and academic success.\nThis study is the first to examine the behavioral, cognitive, and language service needs and service use at the time of school entry for a particularly vulnerable group of children: those investigated as subjects of child maltreatment when they were 0 to 12 months old. Unlike prior research, this study examines differences in service need and receipt by living arrangement at the 5-to 6-year follow-up, whether the living arrangement is in the parental home, with adoptive parents after CWS intervention, in kinship care, or in foster care. The first aim here is threefold: to examine at a 5-to 6-year follow-up (entry to school) the behavioral and cognitive functioning of children who were maltreated as infants, to estimate the proportion of children eligible for mental health and special education services at school entry, and to explore the link between need and receipt of services."}, {"section_title": "Method", "text": "This research uses data from the NSCAW, which features the first national probability sample of children investigated for child maltreatment. NSCAW is a national longitudinal study of the well-being of 5,501 children aged 14 or younger who had contact with the CWS during a 15-month period starting October 1999. The NSCAW sample design involved a stratified two-stage sample, the primary sampling units (PSUs) being county child welfare agencies. The secondary sampling units were children selected from lists of closed investigations or assessments from the sampled agencies. The sample was subdivided into nine strata-one each for eight key states and a ninth stratum for 28 other states. Data from the nine strata have been combined to produce national estimates.\nAnalysis weights were constructed in stages corresponding to the stages of the sample design. Selection of a child was the product of two probabilities: the probability of selection of the PSU and the probability of selection of that child, given the child's PSU. Weights were further adjusted to account for small deviations from the original plan that occurred during sampling and for nonresponse.\nData were collected at baseline and at follow-ups conducted at the following intervals after the completion of the investigation: 1 year, 1.5 years, 3 years, and 5 to 6 years. At baseline, face-to-face interviews or assessments with children, their caregivers, and caseworkers were completed. At the 1-year follow-up, caseworkers were interviewed and caregivers had an abbreviated phone interview. At subsequent follow-ups, the same face-toface interviews or assessments used at baseline were completed; caseworkers were interviewed if the case was still open. Once children entered the school system (last follow-up), schoolteachers completed a mailed survey. Additional information on NSCAW methods appears elsewhere (NSCAW Research Group, 2002) .\nFamilies included both open cases in the CWS and closed cases (i.e., cases closed without offering of services). Among cases that were open, some children were served in their homes, and some were served in out-ofhome care (e.g., foster care). Because of statistical power requirements for key categories of cases, NSCAW's sample design required oversampling of open cases, infants, and sexual abuse cases (Administration for Children and Families, 2008b; NSCAW Research Group, 2002) . Response rates for the subsample of infants included in this study were 69.7% at baseline, 88.3% at 1 year, 88.8% at 1.5 years, 85.4% at 3 years, and 84.4% at 5 to 6 years."}, {"section_title": "Participants", "text": "Current analysis focused on a subsample of children who were infants (0 to 12 months old) when they first became involved in investigations for maltreatment and whose caregiver participated at the 5-to 6-year followup. At attempted follow-up interviews with caregivers, it was learned that 10 children among those who were infants at baseline had died, leaving the eligible child and caregiver sample size for the purpose of calculating response rates at 1,186. A total of 962 caregivers and their children were interviewed. The response rate for children's teachers was greater than 80%. Three children had missing data on mental health and special education services and were excluded from the sample. The final sample was 959 children; some variations in the total number of children presented in the results section are due to missing data.\nComparisons of the 962 children in this study and the 224 children who were not included in the 5-to 6-year follow-up showed that there were no significant differences between children not included in the 5-to 6-year follow-up and those included in the study regarding gender, race/ethnicity, living arrangement at baseline, poverty, or type of maltreatment suffered at baseline.\nFor the multivariate models, the analysis was based on 805 children. We found no significant differences between children with missing values and those with complete data regarding gender, race/ethnicity, school grade, living arrangement at the 5-to 6-year follow-up, type of maltreatment suffered at baseline, or need for services. However, a somewhat lower percentage of children with missing data were living at or under the poverty line (31.3%), compared with children with complete data (46.4%).\nAbout half of the children were boys and half were girls (Table 1) . More children were White (43.2%) than were Black (30.2%), Hispanic (20.9%), or Other (5.7%). At the time of the 5-to 6-year follow-up, most were in kindergarten (73.1%) or first grade (19.2%). Most (60.7%) were living with their biological parents at that time; 17.0% were living with adoptive parents, 16.1% were living in kinship care, and 6.2% were living in foster care. Most children had health insurance; only some children who were living with their biological parents lacked insurance. Of this group, uninsured children constituted less than 5%.\nAt baseline, the most serious form of maltreatment was neglect for 63.9% (physical neglect for 34.9% and supervisory neglect for 29.0%), physical abuse for 19.2% of children, and other types of maltreatment for 16.9%. More than a third (38.7%) of index maltreatment reports were substantiated, meaning that the CWS decided the allegations of maltreatment were valid. Caseworkers reported no harm to the infant in 36.9% of cases, mild harm for 25.9%, moderate harm for 20.0%, and severe harm for 17.3%. Level of risk was none for 21.1%, mild for 30.2%, moderate for 22.6%, and severe for 26.1%. Caseworkers also indicated the kinds of risks that were present in the home: Forty percent of families had prior reports of maltreatment, 91.6% of which were investigated. Other risks that were present in a substantial percentage of the cases included poor parenting skills (42.6%), a history of domestic violence against the primary caregiver (37.7%), active domestic violence against the primary caregiver (22.3%), a history of maltreatment of the primary caregiver (32.3%), and active drug abuse by the primary caregiver (29.7%).\nMore than a third of children were placed out of the home at some point in their lives. For most of these children, placement came early. At baseline, within 4 to 5 months after the index investigation, 30.7% of the infants were in out-of-home care. Among all children, 62.6% were never placed, 18.4% had one placement, 8.8% had two placements, and 10.2% had three or more placements. Nonkin foster care was provided for 14.1% at baseline, but this rate declined steadily over time to 6.4% at the 5-to 6-year follow-up. Correspondingly, adoption showed an upward trend: The percentage of children living in adoptive homes was 1.0% at baseline, 13.0% at the 3-year follow-up, and 16.9% at the 5-to 6-year follow-up. Of the children in need of adoption (defined as children placed out of the home and not reunified with their original parents), 56.0% were adopted by the 5-to 6-year follow-up and an additional 5.0% were adopted by kin. Parallel with the foster care decline, the sharpest increase in adoption was at the 3-year follow-up. The use of kinship care remained fairly consistent, ranging from 14.6% to 19.6% across waves. At the time of the 5-to 6-year follow-up, 12.0% of all caregivers (unweighted N = 143) reported that they were still in contact with the CWS and receiving some type of service. Caseworker surveys were attempted for all of these cases, and 129 interviews were completed (81.8% response rate). Fifty-six percent of families still involved with the CWS were reported by caseworkers to have received family-based services since the previous interview period."}, {"section_title": "Procedures", "text": "Field representatives (FRs) were selected from candidates with strong interview skills, experience working with children of all ages in a variety of environments such as low-income and high-crime neighborhoods, experience with the CWS population, and the ability to handle stressful situations. Most of the selected FRs were females, more than 40 years old, with professional experience as CWS caseworkers and/or child development professionals. FRs received 12 days of intensive training with special emphasis on the practice and administration of child assessment instruments, physical measurements, and computer-assisted personal interview (CAPI) and audio computer-assisted self-interview protocols. Bilingual FRs were required to attend additional training to obtain bilingual certification (NSCAW Research Group, 2002) . FRs contacted caregivers and asked permission to interview them about the selected child and to assess the child directly by means of standardized measures. Baseline interviews and assessments were conducted an average of 4 months after the CWS investigation for maltreatment. Interviews with the children's caregivers were conducted in English (96%) or Spanish at the children's homes by means of CAPI. Caregivers received an honorarium of approximately $40 for their participation in each interview. NSCAW also conducted 1-hour CAPI sessions with the CWS caseworkers who were instructed to consult the case records as needed during the interview. Additionally, teachers were mailed questionnaires about the child's classroom behavior and special education services. To assure confidentiality, the NSCAW project name was not utilized for the teacher survey. No teacher was contacted without the legal guardian's express approval. FRs were provided with instructions for selecting the most appropriate teacher respondent for the child, including the following: If the child had more than one teacher, the FR requested the name of the English or language arts teacher; if the caregiver interview occurred during the summer, the FR requested the name of the teacher in the previous year; if the child had only recently started school, the teacher survey was delayed by 2 months; if the child had a regular classroom teacher and a special education teacher, the FR requested the name of the regular classroom teacher; and the special education teacher was selected if he or she was the child's only teacher. The data analyzed here were drawn from child assessments as well as caregiver, caseworker, and teacher interviews.\nNSCAW, the consent protocols, and this study received Institutional Review Board approval from RTI International and the Office of Management and Budget."}, {"section_title": "Measures", "text": "NSCAW was advised by a panel of national experts to determine the list of instruments and tests used at each wave of data collection. Whenever possible, standardized instruments with national norms were chosen; alternatively, instruments or questions were employed that had been used in previous studies with large and diverse national samples of children and families. At the time of school entry, children were assessed with standardized instruments to sort them into four groups according to needs: (a) those with behavioral or adaptive-functioning needs, (b) those with cognitive or language needs, (c) those with both sets of needs, and (d) those with neither set of needs. Child assessment also included measures of mental health and special education service use."}, {"section_title": "Sociodemographics.", "text": "Caregivers were asked about their child's sex, age, grade level, race/ethnicity, insurance, family income, and number of adults and children in the household at the time of the 5-to 6-year follow-up. Family income and number of adults and children in the household were used to determine poverty level at the time of the 5-to 6-year follow-up, in accordance with U.S. Census Bureau guidelines (Dalaker, 2001) .\nChild living arrangements. At the time of the 5-to 6-year follow-up, information on the child's living arrangements was obtained by caregiver interview or, if possible, by caseworker interview. Children were classified as living in home with biological parents, in home with adoptive parents, in kinship care, or in foster care.\nSubstantiation. Substantiation is CPS's statement about the validity of a report of child maltreatment. Children were classified as having a substantiated maltreatment case on the basis of caseworkers' responses to the following question at baseline: \"What was the outcome of the investigation?\" Response options were (1) substantiated; (2) indicated; (3) neither substantiated or indicated, or unfounded or ruled out; (4) high risk; (5) medium risk; and (6) low risk. Following the criteria used for the annual national reports in Child Maltreatment, which are based on the National Child Abuse and Neglect Data System, only when caseworkers chose substantiated did NSCAW classify children's cases as such. All other cases were classified as unsubstantiated."}, {"section_title": "Levels of harm and risk.", "text": "Caseworkers were queried about harm and risk with the following questions at baseline: \"Regardless of the outcome of the investigation, how would you describe the level of harm to [FILL CHILD]?\" and \"Regardless of the outcome of the investigation, how would you describe the level of severity of risk?\" Response categories were none, mild, moderate, and severe.\nMaltreatment characteristics. NSCAW used the Limited Maltreatment Classification System (Barnett, Manly, & Cicchetti, 1993) to capture information about the reported maltreatment. Caseworkers were provided with a card bearing examples of each type of maltreatment. The most serious type of maltreatment was assessed by asking the caseworkers in the baseline interview, \"Of the types of abuse or neglect that were reported, please tell me the type that you felt was the most serious.\" Response options were physical maltreatment, sexual maltreatment, emotional maltreatment, physical neglect (failure to provide), supervisory neglect, abandonment, moral or legal maltreatment, educational maltreatment, exploitation, and other. Because of the small number of children in some maltreatment categories, child maltreatment at baseline is reported with three categories: physical abuse, neglect (failure to provide or lack of supervision), and other (sexual maltreatment, emotional maltreatment, abandonment, moral or legal maltreatment, educational maltreatment, exploitation, and other).\nCaseworker report on caregiver problems. NSCAW used questions from the risk assessment tools used in the CWS in Michigan, New York, Washington, Illinois, and Colorado to collect information from caseworkers at baseline about the primary caregiver: \"At the time of the investigation, was there active alcohol abuse by the caregiver?\" \"Did the caregiver have any serious mental health or emotional problem?\" \"Was there active domestic violence?\" \"Was there a history of abuse and neglect of the caregiver?\"\nBehavioral and adaptive-functioning needs at the 5-to 6-year follow-up. Children were judged to have behavioral or adaptive-functioning problems or risks if (a) they had a T score greater than 63 (≥2 SD above the mean) on the Externalizing, Internalizing, or Total Problems scales of the CBCL (completed by the caregiver) or on the Teacher's Report Form (TRF) or (b) they had a score less than 70 (>2 SD below the mean) on the Daily Living Skills items of the Vineland Adaptive Behavior Scale (VABS) Screener (Sparrow, Carter, & Cicchetti, 1993) .\nNSCAW used the CBCL and TRF to measure general behavioral problems (Achenbach, 1991) . These checklists assess children's social competencies and problem behaviors and have content that is for the most part parallel. For each item, the child's caregiver indicates how well the behavior describes the child, either at the time of assessment or in the previous 6 months. Items are on a 3-point Likert-type scale (0 = not true, 1 = somewhat or sometimes true, and 2 = very true or often true). Both scales contain 113 items for 4-to 18-year-olds, and both are composed of eight syndromes (Withdrawn, Somatic Complaints; Anxious/Depressed; Social Problems; Thought Problems; Attention Problems; Delinquent Behavior; and Aggressive Behavior) and an Other Problems category. Behaviors are also categorized as Externalizing (containing the Delinquent and Aggressive Behavior syndromes) or Internalizing (containing the Withdrawn, Somatic Complaints and Anxious/Depressed syndromes). A Total Problems score may be derived from the total of the syndromes and Other Problems items. For this research, the CBCL and TRF Total Problems standardized (T) scores were used to measure the behavioral well-being of children. In keeping with recommended procedures for classifying the Total Problems scale, T scores were classified as normal (<64) or clinical (>63; Achenbach, 1991) . The CBCL has been used previously in research on child welfare populations (Armsden, Pecora, Payne, & Szatkiewicz, 2000; Kolko, Baumann, & Caldwell, 2003) . The CBCL provides a reasonable proxy of clinical need for any diagnosis, with a sensitivity of .60 and specificity of .73 against the Diagnostic Interview Schedule for Children, although the correspondence between the CBCL and specific research diagnoses is not strong (Jensen, Salzberg, Richters, & Watanabe, 1993) .\nNSCAW used the Daily Living Skills items from the VABS Screener to measure adaptive behavior problems (Sparrow et al., 1993) . The 45-item screener was developed from the 261-item VABS Screener. Screener items were selected based on ease of administration, reliability, domain coverage, and strength of correlation with the total scales. The VABS Screener was developed for research purposes only, for screening large groups, rather than for making clinical judgments. Although it contains three domains (Communication, Daily Living Skills, and Socialization), NSCAW used only Daily Living Skills. This domain measures personal skills (e.g., how the child eats, dresses, and performs personal hygiene), domestic skills (household tasks the child performs), and community skills (the child's knowledge of safety, how the child spends his or her time, and telephone skills). The normative sample for the VABS Screener was nationally representative in gender, ethnicity, geographic region, and parent education level (comparable to 1980 U.S. Census data) of children from birth to 18 years 11 months (Sparrow, Balla, & Cicchetti, 1984) .\nCognitive and language needs at the 5-to 6-year followup. Cognitive and language needs were assessed with the Kaufmann Brief Intelligence Test (K-BIT; Kaufman & Kaufman, 1990) ; academic achievement, with the Woodcock-Johnson III Tests of Cognitive Abilities (Woodcock, McGrew, & Mather, 2001) ; and language skills, with the Preschool Language Scale-3 (PLS-3; Zimmerman, Steiner, & Pond, 1992) . For all measures, standardized scores are calculated from a normative mean of 100, with a standard deviation of 15. Children were determined to have cognitive or language needs if they had a score on the K-BIT, Woodcock-Johnson, or PLS-3 less than 70 (2 SD below the mean).\nThe K-BIT is a brief, individually administered measure of verbal and nonverbal intelligence for children, adolescents, and adults ranging in age from 4 to 90 years (Kaufman & Kaufman, 1990) . Verbal items assess word knowledge and verbal concept formation. Nonverbal items (matrices) assess the ability to perceive relationships and to complete analogies. The normative sample was composed of a nationally representative sample of 2,022 people aged 4 to 90 years and tested at 60 sites in the United States. The current study used the standard score for vocabulary, matrices, and total IQ composite.\nFour subtests were used from the Woodcock-Johnson III Tests of Cognitive Abilities with children aged 6 years or older. Letter-Word Identification is a basic reading skill involving naming letters and reading words aloud from a list. Calculation is a test of math achievement measuring the ability to perform arithmetic computation with paper and pencil. Passage Comprehension is a measure of reading comprehension in which the individual has to orally supply the missing word removed from each sentence or very brief paragraph. Applied Problems is a test of math reasoning requiring the individual to solve oral word problems.\nThe PLS-3 measures language development of children from birth to 6 years (in this study it was administered to children up to 5 years old; Zimmerman et al., 1992) . The Auditory Comprehension subscale measures precursors of receptive communication skills with tasks focusing on attention abilities. The Expressive Communication subscale measures precursors of expressive communication skills with tasks that focus on social communication and vocal development. A Total Language score combines these two subscales. The PLS-3 was standardized with a sample of 1,200 children aged 2 weeks to 6 years 11 months, with equal percentages of males and females in each age group (Zimmerman et al., 1992) .\nOutpatient mental health service use at the 5-to 6-year follow-up. Data on the use of mental health services were drawn from an adapted version of the Child and Adolescent Services Assessment responded to by caregivers (Ascher, Farmer, Burns, & Angold, 1996; Burns, Angold, & Costello, 1992; Burns, Angold, Magruder-Habib, Costello, & Patrick, 1994; Farmer, Angold, Burns, & Costello, 1994) . Questions ask about the type of services received, including outpatient and inpatient services, \"for emotional, behavioral, learning, attentional, or substance abuse problems\" in the 12 months preceding the interview. Outpatient services included (a) clinic-based specialty mental health services (e.g., community mental health centers); private-practice professionals including psychiatrists, psychologists, social workers, and psychiatric nurses; (b) home-based mental health services (e.g., family preservation); and (c) therapeutic nursery/day treatment. Inpatient services included (a) hospitalization in a psychiatric hospital or psychiatric unit of a general hospital, (b) hospitalization in a medical inpatient unit for emotional or behavioral problems, and (c) inpatient drug or alcohol detoxification. Caregivers were also asked whether the child was receiving school-based mental health services from a guidance counselor, social worker, or school psychologist. The current study focused on outpatient mental health services.\nSpecial education service use at the 5-to 6-year followup. Receipt of special education services was operationalized as the presence of an IEP according to teacher or caregiver report. When discrepancies emerged, the teacher report had priority. Additionally, teachers reported the student's diagnosis and the type of school-based services listed in the IEP (e.g., speech language, psychological, physical or occupational therapy, recreation/ therapeutic). If the teacher could not provide the information, then the caregiver's report was used."}, {"section_title": "Statistical Analyses", "text": "All analyses were conducted with weighted data, using the SUDAAN statistical package, Release 9.0.1, to take into account NSCAW's complex sampling design (RTI International, 2007) . All percentages are adjusted (weighted) for sampling probabilities; listed sample sizes have not been adjusted (i.e., are unweighted). Analyses first examined whether children with behavioral or adaptivefunctioning needs, cognitive or language service needs, and both types of needs differed on a number of demographic variables. Analyses then compared, in terms of receipt of outpatient mental health services and IEP, children in the three need groups with children not identified as in need. Pearson χ 2 tests adapted for complex samples were used to determine statistical significance of the differences between groups.\nTo identify and compare the unique effects of service need and sociodemographic characteristics on receipt of services, two logistic regression analyses were conducted. One modeled service receipt for those receiving outpatient mental health services, and the other did so for those receiving IEP services. Adjusted odds ratios with 95% confidence intervals and p values based on Wald F tests are reported. All tests were two-tailed. Note: All percentages are weighted. N varies between 919 and 831. a. p = .031. b. Children in kindergarten had a significantly different distribution of need than children in first grade (p = .006). c. Three children in second grade were included. d. Those in home with biological parents had a significantly different distribution of need than those who were adopted (p = .046).\nAlso conducted were analyses relating the following variables to service receipt: type of maltreatment, case disposition (substantiation of maltreatment allegations, level of harm and risk to the child), and caregiver's risk factors (e.g., mental health, drug use) at the time of the investigation. None of these variables predicted service receipt, so their results are not reported. To avoid very low numbers in the multivariate analysis, the models included only variables statistically significant in the bivariate analysis (p ≤ .05) or conceptually relevant to the literature."}, {"section_title": "Results", "text": ""}, {"section_title": "Behavioral and Cognitive Needs at School Entry", "text": "More than half of children (50.3%) who had an investigation with the CWS as infants had behavioral or cognitive needs as indicated by standardized measures at the time of entry to school (Table 2) . Almost a third (32.0%) had only behavioral or adaptive-functioning needs, 8.4% had only cognitive needs, and 9.8% had both. Only three variables were significantly associated with behavioral and cognitive needs in bivariate analysis: sex, grade, and setting at the 5-to 6-year follow-up. Boys were more than 3 times as likely to have cognitive needs as girls. Girls were more likely to have externalizing problems on the CBCL than boys (24.6%, as opposed to 15.2%). Children in kindergarten were more likely than children in first grade to have both types of need (10.5%, as opposed to 1.6%) and to be identified with cognitive problems (9.0%, as opposed to 5.9%).\nChildren in home with biological parents were more likely than adopted children to have cognitive needs (10.0%, as opposed to 3.2%), whereas children who were adopted (39.9%) were more likely to be reported with behavioral problems than children in home with biological parents (28.4%). Although children in kinship care and foster care appeared more likely to have both types of needs, these differences did not reach statistical significance when compared with adopted children or children living with biological parents; however, this limitation on statistical power undoubtedly arises from the small numbers of children with both types of needs in kinship and foster care at the 5-to 6-year follow-up."}, {"section_title": "Service Use", "text": "Among all children in the study, 27.1% received outpatient mental health or special education services; 11.4% received only outpatient mental health services, 10.2% received only special education services, and 5.5% received both. Only three variables were significantly associated in bivariate analysis with receipt of services at the 5-to 6-year follow-up: the child's behavioral and cognitive needs at the follow-up, the child's current living arrangement, and the type of maltreatment in infancy (Table 3) . Children with only cognitive needs were more likely than those with only behavioral needs to have an IEP, whereas children with only behavioral needs were more likely than children with only cognitive needs to receive outpatient mental health services.\nSome children were more likely to receive services than others. Children in home with adoptive parents and children in kinship care were more than twice as likely to receive services as children in home with their biological parents (40.0% of children in home with adoptive parents and 40.3% of children in kinship care received services, compared with 18.0% among children living with biological parents). Children who suffered from \"other\" types of maltreatment in infancy were more likely to receive services than children who suffered from physical abuse (32.7% of children who suffered from other types of maltreatment, compared with 22.1% of children who suffered physical abuse).\nIn the 12 months before the interview, a small percentage of children received specialty outpatient services, 3.1% from a community mental health center, 8.5% from a private practitioner, and 3.3% from home-based mental health services. Approximately one tenth (11.0%) of children were reported to have received school-based mental health services from a guidance counselor, social worker, or school psychologist in the year before the interview. Fewer than one tenth (7.0%) of caregivers reported visits to a medical doctor for their child's mental health problem. Very few (less than 1%) had received services through a therapeutic nursery.\nAmong children reported by teachers to have an IEP, many were classified in more than one diagnostic category. The majority had speech impairments (65.4%), followed by those with developmental disabilities (26.1%), attention-deficit/hyperactivity disorder (25.3%), learning disabilities (24.3%), emotional disturbances (21.6%), autism (17.8%), mental retardation (14.6%), and other health problems (14.0%); all other categories were used for fewer than 10% of children with an IEP. The services most commonly received were speech pathology (75.3%), followed by physical/occupational therapies (44.7%) and transportation services (47.2%); all other IEP services were received by few children (less than 10%)."}, {"section_title": "Predictors of Service Use", "text": "Results are reported of a logistic regression model analyzing how child gender, grade, race/ethnicity, poverty level, placement setting, service needs, and type of maltreatment at infancy are associated with having received any outpatient mental health service (Table 4) . Only current living arrangement and service needs were significant predictors of outpatient mental health service receipt. Children living in foster care had more than 4 times the odds of receiving an outpatient mental health service as children living at home with biological parents. Children living with adoptive parents had more than 3 times the odds of receiving an outpatient mental health service as those living with their biological parents. Children having only behavioral or adaptive-functioning needs and those having both cognitive and behavioral needs had more than 5 and 2 times the odds, respectively, Physical abuse 9.8 (3.1) 2.4 (1.0) 9.9 (4.4) 77.9 (5.4) Neglect 11.5 (2.1) 11.0 (2.2) 5.0 (1.3) 72.5 (2.9) Other 15.4 (4.5) 14.4 (5.6) 2.9 (1.4) 67.3 (7.5)\nNote: All percentages are weighted. IEP = Individualized Education Program. N varies between 959 and 869. a. Children with only cognitive needs had a significantly different distribution of services than children with only behavioral needs (p = .007). b. Children in home with adoptive parents and children in kinship care were significantly more likely to receive services than children in home with their biological parents (p = .014 and p = .046). c. Children who received other types of maltreatment (e.g., emotional, abandonment) had a significantly different distribution of services than children who received physical abuse (p = .017).\nof receiving outpatient mental health services as those having no needs. The child's sex was of borderline significance (p = .0653). The adjusted odds that boys would receive an outpatient mental health service were almost 2 times as great as the odds that girls would.\nResults are reported of a logistic regression model analyzing the relationship between children's characteristics and needs and the receipt of an IEP (see Table 5 ). Sex, current living arrangement, and service need were associated with IEP receipt. The adjusted odds that children would receive IEP services were twice as great for boys as for girls. Children with adoptive parents and children in kinship care had 2 times the odds of children living with biological parents of having an IEP. Having only behavioral or adaptive-functioning needs and having cognitive or behavioral needs were associated with higher odds of receiving IEP services than having no needs."}, {"section_title": "Discussion", "text": "This study provides the first national estimates of mental health and special education needs and service use at the time of school entry among children reported for maltreatment in infancy. Consistent with previous research for children involved with the CWS, observed service needs and use were greater than expected for similarly aged children from the general population (Kataoka et al., 2002; U.S. Department of Education, National Center for Education Statistics, 2007) . For instance, approximately 16% of children in this sample were reported to have an IEP. Nationally, it is estimated that 4.1% of children in kindergarten and 5.4% in first grade receive special education services (Institute of Education Sciences, 2007). The mental health service use observed in this study was also comparable to that observed for 6-to 10-year-old children in NSCAW at baseline , even though service use in this study was measured 5 to 6 years after the index maltreatment investigation. Previous research has established relationships between CWS contact and increased mental health service access. However, very few children in this sample were still in contact with the CWS, and few children had received prior early intervention services. Consequently, high rates of service use observed here 5 to 7 years after CWS maltreatment investigation are surprising and warrant further investigation. Future studies should examine the degree to which early service engagement may predict later use in other systems or the degree to which entry into one type of service (whether outpatient mental health or special education) might have facilitated complementary use of the other type of service, as hypotheses and empirical data from other publications suggest.\nThe gap found here between need for services and service use is important. Although about half of children have a behavioral or cognitive/language need at entry to school, 61% of those with only cognitive needs, 65.2% of those with only behavioral needs, and 43.6% of those with both types of needs received no mental health or special education services. Not surprisingly, children with cognitive needs were more commonly served by IEPs, and children with behavioral problems more commonly received outpatient mental health services. Levels of unmet service needs were particularly high for mental health services, higher than for special education services. About a third of children with cognitive needs had an IEP, whereas less than a fifth of those with behavioral needs were receiving outpatient mental health services (18.1% among those with only behavioral needs and 10.8% among those with both cognitive and behavioral needs). Although less research exists on special education services received specifically by maltreated children, these findings are consistent with the existing literature on mental health need and mental health service use among children involved with the CWS. Findings of unmet need are also consistent with our report in Casanueva et al. (2008) of early intervention service use. Even when children are interacting with the school system, many of those in need are not identified and receive no services.\nLevels of unmet special education needs reported here may be underestimates. Regardless of the type of special education need or numbers of needs described by teachers, teachers reported that children primarily received speech pathology or physical/occupational therapy. This finding means that even those receiving a school-based service may have other unmet service needs, particularly those related to behavioral or emotional problems. The main type of special education services received by children in this study is the same as those reported based on national data on special education services received by children with disabilities at the time of entry to the school system. According to the second wave of data (2004) (2005) of the Pre-Elementary Education Longitudinal Study, a nationally representative sample of children with disabilities who were 3 to 5 years old at Wave 1 (2003) (2004) , the most common service is speech or language therapy (received by 86% of children), and the second most common service is occupational therapy (received by 35% of children; Carlson et al., 2008) .\nSchool-based specialty mental health services are particularly important for young children; however, schools may lack adequate resources to address the complex and diverse needs of children with a history of maltreatment. The most recent national report on mental health services in school systems reported limited availability of psychologists; when available, most school psychologists focused on diagnosis and evaluation, not treatment (Brener et al., 2007) . This understaffing and lack of time for treatment may be particularly detrimental for children reported for maltreatment during infancy because they may have not only high rates of behavioral problems but also more severe and disruptive symptoms that require the help of mental health specialists.\nIn addition to identifying gaps in service provision for specific subpopulations in need, the current results demonstrate that child-level factors other than need predict service receipt. Contrary to the findings of previous studies based on foster care populations Leslie, Hurlburt, Landsverk, Barth, & Slymen, 2004; Leslie et al., 2000) , race/ethnicity did not explain mental health or special education service use. An important gap was the low level of service use for children remaining with their biological parents, as compared with those living in other arrangements and having similar clinical needs. Such nonclinical factors should have no role in mental health and special education service use; therefore, the evident influence of factors other than need warrants further research.\nAt similar levels of need, girls were less likely to receive mental health and special education services than boys. The gender variation in use of mental health and special education services found in this national sample is disturbing but consistent with previous national and community sample studies of the general population that found that boys were more likely than girls to receive services, even when need was controlled for (Stein & Silver, 2003; Zahner & Daskalakis, 1997) . Previous NSCAW studies with children 2 to 14 years old at baseline did not find a gender disparity in service use Hurlburt et al., 2004; Leslie et al., 2005; Stahmer et al., 2005) , but findings similar to the current findings were reported in a study of an urban high-risk sample in which two thirds of young children had been reported for maltreatment (Thompson, 2005) and in a study in San Diego County with foster care children (Leslie et al., 2000) . Differences in how caregivers and teachers perceive girls' and boys' problems and needs deserve additional research and more attention in the mental health and education systems.\nOne new finding of this study is that even when controlling for need, placement setting differentially influenced service receipt. Children living with adoptive caregivers and children living in foster care were 3 and 4 times as likely, respectively, to use outpatient mental health services as those living at home with biological caregivers. Although foster care did not significantly influence IEP service receipt as it did outpatient mental health service receipt, kinship care and living with adoptive caregivers predicted service receipt to fulfill an IEP. Other studies have shown that children living in foster care are more likely to receive mental health services than children living at home with their biological caregivers Hurlburt et al., 2004; Leslie et al., 2005; Stahmer et al., 2005) ; however, this study demonstrated that adoption, foster care, and kinship care all confer some advantage in receiving either mental health or special education services. The differences in service use across child living arrangements may be due to different caregivers' knowledge of child service needs or service availability. A majority of children who remain with their biological parents have their case closed with no services provided after the maltreatment investigation; in contrast, children who are placed out of home with kin or in foster care, and those who are placed and adopted, usually have a long-term connection with the CWS, facilitating caseworkers' help with the identification of developmental problems and connection with needed services. The differential influence of child living arrangements on service access merits further exploration.\nPrevious studies have suggested that the demographics of adoptive families-more educated, more likely to be involved in human services, and higher socioeconomic status (Zill, Caoiro, & Bloom, 1994 )-make them more vigilant about potential mental health difficulties in their children and, as a consequence, more likely to identify and report atypical behaviors and search for treatment options, particularly if they adopted their children through the CWS (Barth & Miller, 2000; Brodzinsky, 1993; Haugaard, 1998) . This phenomenon has been described as \"informant bias,\" and it has been proposed that adoptive parents may react to even minimal manifestations of behavioral problems (Barth & Miller, 2000) . Nevertheless, the percentage of parents or teachers in this study who described clinically relevant behavioral problems on standardized measures is so high (40%) that it is unlikely to be explained by informant bias alone. This result shows a continued need for mental health services in these children adopted from the CWS even 5 to 6 years after the report of maltreatment. The rate of emotional and behavioral difficulties of children adopted from the CWS observed in this study was consistent with the percentages of adoptive parents who reported a need for child, caregiver, marital, or family mental health services (Barth & Miller, 2000; Gibbs, Siebenaler, & Barth, 2002) . Unfortunately, only a limited number of mental health providers specialize in adoption issues (Henderson, 2002) . Although behavioral, developmental, and family services likely should be part of continuous postadoption services, Barth and Miller (2000) have concluded that in practice, postadoption services \"rarely and irregularly . . . have been put in operation to support troubled adoptions\" (p. 449). Findings here underscore the importance of access to both mental health and special education services to meet the needs of children adopted from the CWS and their families.\nThe high rates of mental health and special education needs more than 5 to 6 years after the index maltreatment report for child maltreatment is a concern. Even though children living in adoptive, kin, and foster homes were more likely to receive mental health or special education services than those living at home with their biological families, levels of unmet mental health and special education service needs for this group were nonetheless high. At the time of their contact with the CWS, biological parents', foster care parents', and adoptive parents' training and information on future mental health and special educational needs, as well as on school services and procedures, may help these caregivers advocate for their children and obtain needed services during the preschool and school years. Because so few children in this sample were still involved with the CWS 5 to 6 years after the index investigation, the CWS was not in a position to advocate for services for these children at school entry.\nOne limitation qualifies our conclusions. Although standardized measures of functioning eliminate some degree of subjectivity in assessment and estimate need according to national norms, they fail to fully measure the effects of limitations on actual daily functioning.\nDetermination of need, therefore, cannot be considered equivalent to results of a comprehensive developmental assessment. Nevertheless, the needs described here likely do constitute legitimate reason for referral for assessment of IEP service need or outpatient mental health service need.\nFuture studies should explore the specific reasons that adopted children receive more mental health and special education services even though their needs resemble those of children living with biological parents. Research should examine, for example, the relative impact of increased contact with the CWS that attends adoption and the characteristics of adoptive parents. Because of the high rate of cognitive and behavioral problems, research should also explore what mechanisms may be effective for continuing to monitor children after investigation, even when allegations are unsubstantiated.\nThe high levels of unmet need at school entry, even among those with multiple needs, confirm the importance of providing services and protection to children reported for maltreatment during infancy. Given the mental health risks associated with entering the CWS in infancy, researchers, clinicians, service facilitators, and policy makers must understand which children are at greatest risk for emotional and behavior problems, where they receive help for these problems, and what factors facilitate receipt of this help.\nThis study underscores the dire need for surveillance and collaborative service models for identifying and addressing service need among young children involved in the CWS; practice methods must be developed to effect collaboration among child welfare, pediatric, developmental screening, mental health, and special education services. That maltreatment in infancy increases risk for emotional and cognitive needs 5 years later adds weight to recommendations for routine links between CWS investigations and early mental health and developmental assessments (Casanueva et al., 2008; Shonkoff & Phillips, 2000) ."}]