[{"section_title": "Figures", "text": ""}, {"section_title": "Appendices", "text": ""}, {"section_title": "Introduction", "text": "Persistent racial and gender gaps are an increasing concern in many countries. In the United States, a typical black 17-year old reads at the proficiency level of a typical white 13-year old (Fryer & Levitt 2006a). Girls significantly outperform boys in reading, and boys outperform girls in mathematics. At the macroeconomic level, these gaps may be costly, given that the aggregate return to education is estimated at around 6-10% per year of schooling (Acemoglu & Angrist 2000). A back-of-the-envelope calculation thus suggests that there could be important gains of reducing the human-capital gap between races and genders. Of course, those potential gains depend on the cost of reducing racial and gender gaps. Some advocate that there are intrinsic differences between races and genders that are not reducible to social or economic factors. One of the most famous arguments is described in Herrnstein & Murray (1994). However, this explanation has been disputed. Firstly, there is no single factor -usually called the g factor -that explains educational or labor market outcomes (Heckman, Stixrud & Urzua 2006). Secondly, racial and gender gaps are not constant but increasing with age. Fryer & Levitt (2006b) reports that there is no difference in cognitive performance for children aged 1. In grade 1, a few covariates for family background are enough to make racial gaps disappear (Fryer & Levitt 2006a). By the end of third grade, covariates do not capture the black-white test score gap (Fryer & Levitt 2006a). And indeed, the black-white test score gap increases by about 0.1 percent of a standard deviation a year. This suggests that teachers' behavior may be part of the explanation. The explanation may partly rely on the lack of minority teachers in elementary education: the fraction of minority teachers should roughly double to make the fraction of minority teachers equal to the fraction of minority students. In this paper, I look at whether teachers give better subjective assessments to students of their own race and/or gender, conditionally on test scores. Subjective assessments are pervasive in schools: most teachers fill school records that include comments on the child's ability or behavior. And important decisions such as tracking, special education and ability grouping are partly based on subjective assessments. Moreover, teachers' priors, beliefs and behavior may be based on what other teachers reported. Table 1 shows how teachers report their grading practices. 11% of white teachers declare they hold all children to the same standards; 19% of non-hispanic black and hispanic teachers provide the same answer. Male teachers too, more often declare holding all children to the same standards -15%, 12% 2 for female teachers. Thus teachers' self-reported grading practices vary widely across race and gender. However econometric work is needed to reveal teachers' actual grading practices. I estimate the effect of being assessed by a teacher of the same race on assessments conditionally on test scores. I use a unique US longitudinal dataset that combines test scores and teacher assessments of children's skills in elementary education. I can therefore compare the difference between test scores and teacher assessments when the same child experiences same race teachers and when he has a teacher of a different race. I can also look at this difference for the same teacher when assessing same race children and children of different races. Combining these two identification strategies, I estimate the effect of same race and same gender teaching on assessments, conditionally on test scores, child and teacher fixed effects. This addresses three potential identification issues: firstly, children of different genders and races may behave differently in the classroom and during examinations, e.g. differential effect of testing on boys and girls, stereotype threat effects (Steele & Aronson 1998); secondly, teacher assessments may capture skills that are not captured by test scores; finally, some teachers may give higher average assessments regardless of their students' race or gender, and this can be correlated with child characteristics. The dataset is the Early Childhood Longitudinal Study, Kindergarten cohort of 1998-1999 (ECLS-K), collected by the National Center for Education Statistics of the US Department of Education. It is the first large scale US study that follows a cohort of children from kindergarten entry to middle school. This is therefore the first paper that looks at the discrepancy between test scores and teachers' perception of their students' ability using a representative longitudinal sample of US children in elementary education. Important findings are that teachers tend to give better assessments to children of their own race and ethnicity, but not significantly higher assessments to children of their own gender. Moreover this result is mainly due to grades given by white teachers to non-hispanic black and hispanic (any race) children. White teachers give better assessments to non-hispanic black children and to hispanic children. A number of robustness checks confirm the result of the baseline estimations. I test for endogenous mobility, and allow for some correlation between race, gender and pupil mobility. Moreover, measurement error checks show that only a large amount of measurement error can explain results. The estimates are also robust to falsification checks in which test scores are regressed on test scores rather than test scores on teacher assessments. Finally, I show that even if relative ranking and racial de facto segregation could be a potential explanation, controlling for peers' test scores does not change the results. The analysis of this paper is related to Lavy (2004  in all subjects. Moreover, the size of the bias was very sensitive to teachers' characteristics suggesting that teachers' behavior is causing grade discrimination. This paper differs from Lavy (2004) in at least three ways. Firstly, I compare subjective assessments and test scores, where subjective assessments are based on classroom behavior and coursework. Lavy (2004) compares blind and non-blind marks. Secondly, in Lavy (2004), if tough teachers are more likely to grade boys, the effect of non-blind assessments on boys' test scores could be overestimated. I control for this effect in the ECLS-K, since I take into account child and teacher fixed effects. This paper is also related to a small scale experiment on fifth grade teachers in the state of Missouri. Clifford & Walster (1973) sent report cards to teachers. These cards included child records randomly matched to photographs, and teachers were asked to assess child ability. They found a significant effect of physical attractiveness on assessments, but no effect of gender. This study nevertheless raises a number of issues. It is not clear whether this result on Missouri fifth grade teachers may be relevant to assess discrimination in a representative U.S. classroom: teachers were assessing students they did not know on the basis of randomly generated school records. This paper's analysis on the ECLS-K provides a large scale analysis of teacher assessments in U.S. elementary education. Better teacher assessments may have beneficial or detrimental effects on performance. On the one hand, better assessments for the same ability level make it easier to get good grades and may therefore decrease the child's marginal benefit of effort, in a similar fashion as in Coate & Loury (1993). On the other hand, better teacher expectations may raise student expectations, or reflect greater investment in the child's education. These stories can be told apart in a controlled experiment. The psychological and educational literature has debated on the issue of the effect of teacher expectations at least since the Pygmalion experiment (Rosenthal & Jacobson 1968). In this experiment children of an elementary school took a cognitive test at the beginning of the school year. The experimenters then selected 20% of the children and told the teachers that these children were showing \"unusual potential for intellectual growth\". Empirical results suggested that those labeled as bloomers had significantly higher IQ progress in first and second grade. Discrimination and the effect of discrimination cannot be jointly identified in the same dataset. The identification of grading discrimination by same race or same gender teachers requires a dataset such as the ECLS-K but the identification of the effect of perceptions requires a controlled experiment. Dee (2004) and Dee (2005b) show that being taught of the same race or a teacher of the same gender increases test scores. Empirical results from Project STAR's experiment show that same race teaching increases test scores for grade 1 to grade 3 children (Dee 2004). Other empirical results from the National Education Longitudinal Study shows that same gender teaching increases the test scores of 8th grade children (Dee 2005b). This paper is different: it estimates the effect of same race teaching on assessments conditionally on test scores. That is, I look at whether teachers have incorrect perceptions of their students' ability, either by overestimating or by underestimating it. This leads to different policy implications. The rest of the paper is structured as follows. Section 2 presents the Early Childhood Longitudinal Study. It provides a first hand descriptive analysis of the difference between teacher assessments and test scores, as well as some statistics on racial and gender diversity in US elementary education. Section 3 explains main identification issues, the identification strategy and baseline results. Section 4 checks the robustness of the results. Section 5 shows that assessment rankings are not affected by teacher-pupil racial interactions in the classroom, but that relative ranking does not explain the main results. Finally, section 6 concludes."}, {"section_title": "The Early Childhood Longitudinal Study", "text": "In the fall of 1998, the National Center for Education Statistics of the US Department of Education undertook the first national longitudinal study of a representative sample of kindergartners. It started with more than 20,000 children in a thousand participating schools. It then followed children in the spring, in the fall and spring of grade one and in the spring of grades three and five. The study's last followup will be eighth grade. Followups have combined procedures to reduce costs and maintain the representativeness of the sample. Movers have been randomly subsampled to reduce costs. At the same time, new schools and children have been added to the dataset to strengthen the representativeness of the survey. In the spring of 1999, part of the schools that had previously declined participation were included. In the spring of grade one, new children were included; this made the cross sectional sample representative of grade one children. Children have then been followed in the spring of grade three and five. This paper's empirical analysis uses the restricted use version of the ECLS-K which contains the race and the gender of both the teacher and his pupils. Some observations with missing data on basic variables (test scores, subjective assessments, teachers' and children's race and gender) were deleted. The analysis is done on 48,065 observations in mathematics and 67,085 in English, which is similar to Fryer & Levitt (2006a). Weights provided by the survey's designers correct for the subsampling of movers, but most of the analysis is robust to changes in weights. Race and ethnicity questions for the teacher were combined to match the categories of the child's race question; therefore 'Hispanic, Any Race' is a separate category. Same race should be subsequently read as 'same race, non-hispanic' or 'both hispanic, any race' 1 . print familiarity, letter recognition, beginning and ending sounds, recognition of common words (sight vocabulary), and decoding multisyllabic words; vocabulary knowledge such as receptive vocabulary and vocabulary-in-context; and passage comprehension. Skills covered by the mathematics assessment from kindergarten to fifth grade include: number sense, properties, and operations; measurement; geometry and spatial sense; data analysis, statistics, and probability; and patterns, algebra, and functions. Test 1 Racial questions follow the 1997 Revisions to the Standards for the Classification of Federal Data on Race and Ethnicity published by the Office for Management and Budget. These standards allow for the possibility of specifying \"More than One Race\". Nevertheless the share of children who were declared as \"More than One Race\" is small. 2 Item response theory computes test scores adjusting for the difficulty of each question. Formally, the probability of a right answer is modelled as pi(θ) = ci + (1 − ci)/(1 + e −Da i (θ−b i ) ), where ai,bi and ci are question specific parameters and θ is child ability. scores were standardized to a mean of 50 and a standard deviation of 10 before the deletion of missing observations. At approximately the same time, teachers are contacted in their school. Teachers fill one questionnaire per child. Teacher assessments of children's skills, also called the Academic Rating Scale, are separated into three areas: (i) Language and Literacy (ii) General Knowledge (ii) Mathematical Thinking. I will use English, ie Language and Literacy, and mathematics assessments, ie mathematical thinking. The instructions make it clear that it is not a test and should not be administered directly to the child. In English and Maths, teachers answer between seven and nine questions on the childs' proficiency in a set of skills. Answers are on a five-point scale: 'Not Yet', 'Beginning', 'In Progress', 'Intermediate', 'Proficient'. An overall assessment is computed for each topic. Teacher assessments, like test scores, were standardized to a mean of 50 and a standard deviation of 10 before the deletion of missing observations. Teachers also report measures of behavior, that will be useful as controls. The social rating scale (SRS) has five scales: approaches to learning, self-control, social interaction, impulsive/overactive, and sad/lonely. The Approaches to Learning Scale measures the ease with which children can benefit from the learning environment. The Self-Control Scale indicates the child's ability to respect the property of others, control temper, accept peer ideas for group activities, and respond appropriately to pressure from peers. The five Interpersonal Skills items rate the childs skill in forming and maintaining friendships, Moreover, test scores and teacher assessments were standardized to a mean of 50 and a standard deviation of 10 before the exclusion of missing data. This makes test scores and teacher assessments comparable to the overall population. What does it mean to be matched to a teacher of the same race or the same gender? Most children are taught by female white teachers, therefore the potential advantages of same race or same gender teaching will mostly be felt by female or white children. Tables 2 and 3 show that only 4.4% of teachers are male. 47.7% of children are matched with a teacher of the same gender. However, the fraction of male teachers increases over time. 2.2% of fall kindergarten teachers are male , but it jumps to 15.1% among grade five English teachers and 17.4% among grade five mathematics teachers. Teachers are also mostly white, with table 3 revealing that 73.9% of teachers are non hispanic white in fall kindergarten. This fraction decreases along the curriculum but goes up in grade 5. Most of minority teachers are either hispanic (of any race) or black, African Americans. They predominantly teach to minority children, with minority teachers' classrooms made up on average of 81.4% minority children. Column 1of table 13 shows the regression of a 'same race' dummy on pupil characteristics: boys are not significantly more likely to be taught by a teacher of the same race, whereas minority children are systematically less likely to be taught by a teacher of the same race. Non-hispanic black and hispanic children are between 65 and 67% less likely to be taught by a teacher of the same race. It goes down to 83% for Asian children. A first taste of the forthcoming results is shown in the descriptive statistics of tables 4 to 6. Let me start with mathematics. The difference between test scores and teacher assessments is higher when matched with a teacher of the same race for Black, African American children (7% of a standard deviation), Hispanic, Any Race children (26.3% of a standard deviation), and American Indian or Alaska Native children (42.6% of a standard deviation). These differences are significant at 1%. In English too these differences are higher for children matched to a teacher of the same race: 15.8% of a standard deviation for Black, African American children, 35.3% for Hispanic, Any Race children, 33.2% of a standard deviation for American Indian or Alaska Native children. The difference is slightly negative for white children in English, but this effect will disappear when controlling for confounding effects. Descriptive statistics for same gender vs different gender pairings do not display the same clear-cut figures. The difference between teacher assessments and test scores is lower for girls when matched to a teacher of the same gender. These statistics should not be seen as causal as they do not control for potentially confounding effects. I describe them in the next section."}, {"section_title": "Identification and Results", "text": ""}, {"section_title": "Identification of teacher discrimination", "text": "Descriptive statistics suggest that in most minority groups, the teacher assessment-test score gap is higher when matched to a teacher of the same race (tables 4 and 5). This may not be interpreted as a causal effect for a number of reasons. Firstly, teachers may capture skills that are not captured by test scores. The description of the dataset makes it clear that, in principle, teacher assessments and test scores cover the same skills. But questions and answers give some leeway. Questionnaires do not formally define the meanings of the five possible answers, ie 'Not Yet', 'Beginning', 'In Progress', 'Intermediate', 'Proficient'. Secondly, boys, girls, white and minority children may display skills differently in the classroom and in a multiple choice questionnaire. Studies have shown that, for instance, boys react differently to high stake examinations. Thirdly, some teachers give on average higher grades than other teachers for children of the same abilities. The teacher's tendency to give higher grades may be correlated with being of the same race or same gender as his children; in which case the gap between test scores and assessments varies with same race or same gender teaching, without reflecting discrimination. The baseline specification will attempt to cope with these three potential issues; in this specification, teacher assessments depend on test scores, teacher fixed effects, child fixed effects and a variable indicating whether the child is matched to a teacher of the same race or the same gender. Formally, Where a i,f,t is the teacher assessment of child i in field f = English, Maths, in period t. t runs from fall kindergarten to spring grade 5. y i,f,t is the test score, u i,f the child effect of child i in field f . is the teacher effect. Same Race i,f,t (Same Gender i,f,t ) takes value 1 when matched with a teacher of the same race (gender), 0 otherwise. u i,f captures non time varying individual characteristics that may have an effect on assessments regardless of the teacher. This for instance may capture behavior, that teachers may on average include in their assessments. Boys may also react differently to classroom exercises, which are assessed by the teacher, and to the multiple choice questions of the ECLS-K. The inclusion of teacher effects µ J(i,f,t) attempts to cope with the third identification issue. If the teacher's grading practice µ J(i,f,t) is correlated to same race or same gender teaching, the OLS estimates of α g and α r might be biased. The teacher effect µ J(i,f,t) therefore captures these permanent average differences between teachers 3 . The model is estimated using a preconditioned conjugate gradient method described in Abowd, Creecy & Kramarz (2002) 4 . All estimations have converged with a numerical precision of 10 −15 . Bootstrap was used to compute standard errors, as described in Efron & Tibshirani (1994). More specifically, block bootstrap was performed, i.e. simple random sampling of children, which takes into account the correlation of residuals across observations of the same child. As in Abowd, Kramarz & Margolis (1999) and Kramarz, Machin & Ouazad (2007), children moving from/to a same race teacher identify the effect of same race assessments and same gender teacher on assessments conditionally on test scores. The identification of specifications 1 and 2 therefore requires sufficient and exogenous mobility 5 . Exogenous mobility is best understood when comparing the progress of a child in terms of assessments to the progress of the child in terms of test scores. Let us therefore take the first difference of specifications (1) and 2. The effect of same race assessments and same gender assessments is identified whenever ∆Same Race i,f,t and ∆Same Gender i,f,t are not correlated with unobserved characteristics that have an impact on the progress in assessments, conditionally on the variation in teacher effects ∆µ J(i,f,t) and the progress in test scores ∆y i,f,t . In other words, child mobility should not be driven by unobserved time varying shocks that affect teacher assessments conditionally on the other covariates. Section 4.1 suggests that this issue is not affecting the empirical results."}, {"section_title": "Baseline Results", "text": "Baseline results suggest that teachers indeed give better assessments to pupils of their race, but not significantly better assessments to pupils of their gender. The effect is sizeable: it is between 1/10 and 1/5 of the black-white teacher assessment gap, and around 1/3 of the hispanic-non-hispanic white teacher assessment gap. Baseline results are presented in table 7. OLS estimates indicate that children who are assessed by same race teachers also have higher maths assessments, around 2.8% of a standard deviation higher. However this is not likely to be the causal effect of same race assessments for reasons outlined above. Column 2gives the estimate when controlling for child effects. The estimate is higher than the baseline OLS one, which suggests that the child fixed effect is negatively correlated with same race pairings. Most teachers are female nonhispanic white, thus either on average all teachers give lower assessments to white children or, white kids respond differently when in the classroom and when facing an assessor. Column 3gives the estimate when controlling for teacher fixed effects. Again, the estimate is higher than the OLS estimate of column (1), which implies that the teacher fixed effect is negatively correlated with same race pairings. This may be due to the fact that teachers who give lower assessments are matched with children of the same race. Again a majority of teachers are female nonhispanic white, and a possible story is that these teachers are tougher than teachers of other races & ethnicities. Finally, column 4gives the estimate when controlling for both children and teacher fixed effects. The estimate is fairly similar to the estimates of columns 2and 3. Column (4) is my preferred estimate for the effect of same race matching on assessments conditionally on test scores. It indeed addresses the three important identification issues described above. On average, children who are assessed by a teacher of the same race have a higher mathematics assessment, by around 7% of a standard deviation higher. Turning to English assessments, the OLS estimate and the child fixed effects are roughly similar; children who are assessed by a teacher of the same race also have a higher English assessments, by around 4% of a standard deviation. Column 7shows that controlling for teacher fixed effects actually increases the estimate, suggesting the same correlation between grading practices and same race matching as for maths assessments. Column (8) shows the estimate when controlling for both children and teacher fixed effects. Interestingly, the effect is of the same magnitude as the OLS and the child fixed effect estimates. This is due to the negative correlation between child and teacher fixed effects. Results indicate that being matched with a teacher of the same race increases assessments by around 4% of a standard deviation, conditionally on test scores and children and teacher fixed effects. The gender and racial gaps in teacher assessments are shown on table 8. This table is useful to compare the gaps in assessments to the magnitude of the effect. In mathematics, the effect of same race assessments is around 7% of a standard deviation, and that is around 1/3 of the black-white teacher assessment gap and 1/5 of the non-hispanic white-hispanic teacher assessment gap. In English, the effect of same race assessments is around 4.1% of a standard deviation, which is around 1/10 of the black-white teacher assessment gap. Overall, the effect of race interactions on assessments accounts for between 1/10 and 1/3 of the teacher assessment gaps."}, {"section_title": "Analysis of Child and Teacher Effects", "text": "Child fixed effects are interpreted as: (i) differential behavior in the classroom and during tests (ii) unobserved characteristics that teachers may on average include in their assessment (iii) average grading discrimination. Column 1 Teacher grading practices are captured by teacher fixed effects. The fixed effects are higher when teachers give better assessments regardless of the student's race or gender. Columns 3and 4 9 shows results of the analysis of teacher fixed effects. Male teachers' effects are 5.3% of a standard deviation higher, suggesting that male teachers give better assessments on average. Black, hispanic and Asian teachers' effects are between 1% and 2.5% of a standard deviation lower. These correlations are stable when controlling for tenure and experience; this even though the share of minority teachers has steadily declined in the last decades."}, {"section_title": "Breaking Down Results by Race", "text": "Results have suggested that teachers give higher grades to children of their own race conditionally on test scores and children's and teachers' constant characteristics. What races drive the result? In order to disentangle the effects of different racial interactions, I will estimate a specification in which the Same Race dummy is split into multiple dummies, one for each interaction between the teacher's and the student's race. This will allow for heterogeneous effects, race by race. The specification is similar to baseline specification 1. Pupil i's assessment a i,f,t in field f = English, Maths in period t depends on test scores y i,f,t , a set of interactions between the teacher's and the student's race (Teacher's Race is r, Student's Race is r'), child effects u i,f and teacher effects µ J(i,f,t) . Results are presented in table 10 for mathematics assessments and in table 11 for English assessments. This more refined analysis of racial interactions gives a better view of teacher perceptions. In mathematics being assessed by a white teacher lowers the assessment of hispanic children by 17.3% of a standard deviation. The interaction between white teachers and black students is not significant but the order of magnitude of the coefficient is comparable to baseline estimates. In English, this interaction is significant. White teachers give lower assessments to black children, lower by 11.1% of a standard deviation. They also give lower assessments to hispanic children, lower by 14.8% of a standard deviation. One result from table 10 and 11 departs from the idea that same race assessments higher grades. Hispanic teachers tend to give higher grades to white students than to hispanic students in English. Results from very small minority groups -Pacific Islanders, American Indians -may not be robust. Overall results broken down by race reveal that the strongest interactions occur between white teachers and black students on the one hand, and white teachers and hispanic students on the other hand."}, {"section_title": "Do Female Teachers Give Better Assessments to Girls?", "text": "It has not been found that teachers give significantly higher grades to children of their own gender conditionally on test scores and children's and teachers' constant characteristics. However, it may be possible that this average effect for both male and female teachers is due to the combination of opposite effects for male teacher-male child and female teacher-female child pairings. I therefore put forward a specification in which heterogenous effects are allowed. In the same way as in the previous subsection, The baseline model described in equations 1 and 2 is not identified if, for instance, (i) the behavior is the child is implicitly part of the teacher assessments and (ii) his behavior makes him more likely to be taught by a teacher of the same race. This section shows that there is little correlation between being assigned a teacher of the same race and measures of behavior. Studies in psychology have shown that family events are correlated with child behavior: children who witness domestice violence suffer from low self-esteem, anxiety, depression and behavior problems (Hughes 1988); physically abused adolescents have significantly higher prevalence rates of depression, conduct disorder, internalizing and externalizing behavior problems, and social deficits (Pelcovitz, Kaplan, Goldenberg, Mandel, Lehane & Guarrera 1994). Family events may therefore drive behavioral changes. Moreover the economics literature shows that students are not randomly assigned to students (Rothstein 2008). Clotfelter, Ladd & Vigdor (2005) suggests that novice teachers are assigned to classrooms in a way that disadvantages black students. In my case, if students who become disruptive are assigned to same race teachers, I overestimate the effect of same race assessments. A good test is therefore to regress probabilities of being matched to a teacher of the same race on changes of behavior. Columns (3) and (4) of table 13 show that there is no significant effect of behavior on the probability of being matched with a teacher of the same race 6 . There is little correlation between behavior and same race teaching when controlling for teacher fixed effects, and it disappears when controlling for both child fixed effects and teacher fixed effects . This table is for mathematics, and a similar table is available for English teachers. The ECLS-K contains multiple measures of behavior reported by the teacher and by the parents. Table 13 uses teacher-reported measures of behavior as they are likely to be more relevant in the teacher assignment process than parental measures 7 . 4.2 Minority children are more likely to be matched to a teacher of their own race as they move from kindergarten to grade 5 There are many more minority teachers in grade 5 than in kindergarten. Thus minority children are more and more likely to move from a teacher of a different race to a teacher of the same race as they move from kindergarten to grade 5. Thus moving from/to a teacher of the same race will be correlated with the child's race. This is a potential identification issue in specifications 1 and 2. I will therefore design a specification that allows for some correlation between race, gender and mobility patterns. Table 14 shows the average characteristics of children who experience different mobility patterns. '00100' means that the child had a teacher of the same race in spring grade 1 and a teacher of a different race in the other four periods -fall kindergarten, spring kindergarten, spring grade 3 and spring grade 5. Mobility is strongly correlated with race and ethnicity. Only 4% of white children have never been taught by a teacher of the same race, while 25% of Black, African American children have always been taught by a teacher of a different race. Column (1) of table 13 shows that while gender is not correlated with same race teaching, minority pupils are less likely to be matched with a teacher of the same race in the early years of elementary education. There is indeed a link between race and mobility patterns. It is possible to condition on the whole history of teacher-student matchings as in Card & Sullivan (1988), which inspired table 14. I perform here a simpler test. I introduce child and teacher fixed effects in the first differenced equation. That allows for some correlation between mobility and children's observed and unobserved characteristics. ∆a i,f,t = δ∆y i,f,t + α g ∆Same Gender i,f,t Notations are as before. u i,f is a child fixed effect, µ J(i,f,t) is a teacher fixed effect. These two specifications may then account for the observed correlation between race, included in u i,f , and mobility patterns ∆Same Race i,f,t and ∆Same Gender i,f,t . A major disadvantage of this specification though, is the increased standard errors that it generates.  4and 8show the estimates for same race pairings on English and maths assessments. The effect is not significant for mathematics; it is very similar to the baseline estimates (7% in column (4) of table 7, and 8% in column (4) of table 15). The estimate for English assessments is both significant and very close to the baseline estimate, with children paired with a teacher of the same race having an assessment that is 4% of a standard deviation higher than other children. Overall, mobility based on constant observed and unobserved characteristics such as ability, race or gender does not seem to affect baseline estimates."}, {"section_title": "Do Teacher Assessments Have An Effect on Test Scores? Reverse Causality", "text": "Baseline results suggest that teachers give significantly higher assessments to children of their race. However other stories could explain the result. Teacher assessments may be driving test scores as in the Pygmalion experiment (Rosenthal & Jacobson 1968), such that expectations actually have an impact on educational outcomes. In this case, the effect of same race teaching goes from teacher assessments to test scores, and not the reverse. The following specifications test for potential reverse causality, and empirical results suggest that these stories are not relevant. In this falsification test, test scores and teacher assessments are therefore reversed, assessments explain test scores rather than the other way round. Notations are as in the baseline specifications 1 and 2. Results are presented in table 16: while the OLS estimates are significantly negative, the effect of same race teaching becomes non-significant when adding a child fixed effect, in both mathematics and English specifications. The effect is also non-significant when controlling for both child and teacher fixed effects. This suggests that it is unlikely that reverse causality is an alternative story 8 ."}, {"section_title": "Does Measurement Error Explain the Results?", "text": "Test scores of multiple choice questionnaires are usually noisy measures of underlying ability (Rudner & Schafer 2001). Random error may be introduced in the design of the questionnaire; distractors -wrong options -may not be effective, or may be partially correct; items may be either not sufficiently difficult or too difficult for the child. Noise may be also be due to children's behavior, such as sleep patterns, illnesses, careless errors when filling the questionnaire, misinterpretation of test instructions. Measurement error in test scores could cause bias in my estimation of the effect of same race/same gender teachers on assessments. More precisely, most teachers are nonhispanic white, and most minority teachers are either hispanic or black, African American. The 'same race' variable will therefore be correlated with the gap between white and black and hispanic children. This means that the effect of same race assessments could be overestimated. It is therefore important to check whether measurement error could be a potential story for a significant effect of same race teachers on assessments in table 7. A first hint that measurement error may be an explanation comes from the second row of table 7. The coefficient of test scores in all regressions is lower than 1, and one would naturally expect this coefficient to be equal to 1, given that both assessments and test scores have standard deviation 10. But constraining this coefficient to be equal to 1 does not significantly alter the coefficients of interest (first row of table  I assume that measurement error is classical, ie ν i,t is not correlated with ability. In other words, this assumes that ability is as precisely measured for low performing children, average children and high performing children. For the sake of clarity, I drop fixed effects in the so-called structural equation: Where teachers' assessments are based on true ability y * i,f,t rather than test scores y i,f,t . The econometrician does not observe y * i,f,t and estimates equation 12 by regressing on y i,f,t . Then, both the estimate of δ and the estimate of α r will be biased.α Where θ is the size of the measurement error. If, as suggested, Same Race and test scores y are positively correlated, then λ > 0 and the effect α of same race teachers on assessments will be overestimated. This result is in the same spirit as developments from the literature on measurement error and statistical discrimination (Phelps 1972). Given the knowledge of the relative size θ of the measurement error, one could estimate the unbiased effect of same race teachers on assessments. Indeed, build the following corrected value of the test score: The estimation of specification 1 on the corrected test scoreỹ will then give an unbiased estimate of the effect α of same race teachers on assessments conditionally on test scores. But the size of measurement error is unknown, therefore I will estimate the parameter of interest α using different values of θ. The lowest size of the measurement error will give an estimate of the measurement error that is required to explain our results. Defining the gaps between assessments and test scores, Table 18 shows the correlation of teacher assessment-test score gaps across fields, race by race, and gender by gender. Interestingly, the correlation is significant and above 0.5 for all races expect Pacific islanders. Moreover, the correlation is remarkably stable across races -from 0.445 to 0.552 -, indicating that teachers' perceptions are correlated across fields regardless of race and gender. These figures also suggest that random noise is not likely to explain the main results of this paper."}, {"section_title": "Stereotype Threats", "text": "One last -and important -identification issue relies on the fact that students may truly perform better in the classroom when matched to a teacher of the same race. In this case, it is likely that behavior in the classroom will be affected by same race teaching. There is evidence that stereotype threats can impair both academic performance and psychological engagement with academics (Aronson, Fried & Good 2002). Wheeler & Petty (2001) review literature on the link between stereotype activation and behavior. Five regressions were therefore performed as a test for stereotype threat: b k i,f,t is the k-th behavioral measure of pupil i in field f in period t. Other notations are as before. The interpretation of fixed effects is slightly different than in the previous sections though. b k i,f,t is reported by the teacher and the teacher effect m J(i,f,t) is seen here as the average behavioral assessment of teacher J(i, f, t). θ i,f is the pupil's average difference between cognitive performance and behavior. Results are reported in table 19. There is no significant effect of same race assessment on behavior conditionally on test scores in neither of the four behavioral dimensions 10 . This suggests that the child's behavior is not significantly affected by same race teaching conditionally on test scores. Stereotype threats are therefore not likely to explain the main results of this paper. These results do not however rule out an unconditional effect of same race teaching on behavior, as in Dee (2005a)."}, {"section_title": "How Do Teachers Order Assessments?", "text": "Results suggest that teachers give higher assessments to children of their own race. Are assessments still ranked the same way as test scores? Even if the absolute value of teacher assessments is biased, the ranking of teacher assessments in the classroom might reflect the ranking of children's cognitive skills."}, {"section_title": "Relative v. Absolute Grading", "text": "I computed the child's rank in test scores and teacher assessments within surveyed children in the classroom. The small number of surveyed children per teacher is not an issue given that teachers fill assessment questionnaires only for the surveyed ones. In the econometric specification, the rank in teacher assessments depends on the rank in test scores, a teacher fixed effect, and a child fixed effect as well as a variable indicating whether the teacher is of the same race or the same gender. Rank in a i,f,t = µ J(i,f,t) + δRank in y i,f,t Rank in a i,f,t is the rank in teacher assessments within surveyed children of the classroom for child i Combining these results with the baseline results, teachers tend to give better assessments to children of their race and ethnicity, but they do not seem to alter the ranking of students of their race or gender."}, {"section_title": "A Small Model of Relative Grading", "text": "In fact, relative ranking could potentially explain my main results. I design a small model that explains that identification issue and I test the hypothesis in the dataset. The results do not support ranking as a driving force of my results. For the sake of clarity, I will design a model in which I do not capture teacher-student interactions. It can be extended to teacher-student interactions. Assume teachers order students on a rigid scale, and the absolute value of the assessments does not matter to them. Blacks could be overassessed whenever (i) they are more likely to be matched to other black kids than white kids (ii) black kids have on average lower test scores. If black students are more likely to be matched to underachievers when matched to a teacher of the same race than when not, then the effect of same race assessments might just reflect ranking and not teachers' perceptions. I will design a small model to explain this effect. Each classroom has two students, who can be either black or white. The teacher assessment of a student is either a = a or a = a depending on the child's ranking in the test scores in the classroom. The child can be either black (r = b) or white (r = w). The overall fraction of white kids in the population is π. I will use primes to designate the child's peer, e.g. the peer's race is r . The probability of getting a high assessment when black and when the test score is y depends on the distribution of test scores and the de facto segregation pattern. I assume that there is no correlation between the test score and the probability of being matched to a black pupil. Assuming that there is no correlation between test scores in a classroom -i.e. no peer effects, which is a strong assumption but can be relaxed -, let's say that the distribution of test scores is f b (y) for blacks and f w (y) for whites. Moreover, the segregation pattern can be described by a single number p = P (r = b|r = b) that doesn't change with test scores, r ⊥ y|r. Then, And, symmetrically for whites: With p = P (r = b|r = w) = π 1−π (1 − p). This leads to the following effect of race on assessments: δa(y) = P (a = a|r = w, y) − P (a = a|r = b, y) If white children have uniformly better test scores and if there is some degree of de jure segregation, then F b (y) > F w (y) for all y and p > p . This leads to lower assessments for white children, i.e. δ < 0. This makes clear that even in the absence of any form of teacher misperception, there can be effects of the child's race on teacher assessments. This result relies on the relationship between teacher assessments and classroom composition and is therefore testable."}, {"section_title": "Controlling for Peers in the Baseline Equation", "text": "For this to explain our main result one would require that students who move from a same race teacher to a teacher of a different race are more likely to move to a classroom with worse peers, conditionally on child and teacher fixed effects. In this case, peers' test scores would be correlated with same race teacher conditionally on the covariates and this would invalidate the causal interpretation of the identification strategy. I design two falsification tests. Firstly, I regress a same race teacher dummy on the average test score in the classroom either conditionally on teacher fixed effects or child fixed effects. Secondly, I include peers' average test score as a control in the baseline regression.     Standard deviations between round brackets (columns 1, 2 and 3) and standard errors between square brackets (column 4). The significance levels for the standard errors are computed following a two sample t-test with equal variances. **: Significant at 1%. *: Significant at 5%. Source: Early Childhood Longitudinal Study, Kindergarten Cohort of 1998/1999. Standard deviations between round brackets (columns 1, 2 and 3) and standard errors between square brackets (column 4). The significance levels for the standard errors are computed following a two sample t-test with equal variances. **: Significant at 1%. *: Significant at 5%. Source: Early Childhood Longitudinal Study, Kindergarten Cohort of 1998/1999.  (3)       (3)     (3)   (3)      (3) Correlation across fields of . . .   "}, {"section_title": "All Children", "text": ""}, {"section_title": "Black", "text": "(3)   (3)   (3)  "}]