[{"section_title": "Abstract", "text": "This paper describes a conceptual design of the Thrust Vector Control (TVC) system and preliminary modeling of propellant slosh, for the Altair Lunar Lander. Altair is a vehicle element of the NASA Constellation Program aimed at returning humans to the moon. Guidance, Navigation, and Control (GN&C) is the measurement and control of spacecraft position, velocity, and attitude in support of mission objectives. One key GN&C function is the commanding of effectors that control attitude and impart ∆V on the vehicle, utilizing both reaction control system (RCS) thrusters and throttling and TVC gimbaling of the vehicle main engine. Both the Altair descent and ascent modules carry fuel tanks. During thrusting maneuvers, the sloshing of liquid fuels in partially filled tanks can interact with the controlled system in such a way as to cause the overall system to be unstable. These fuel tanks must be properly placed, relative to the spacecraft's c.m., to avoid any unstable interactions. Following this will be a discussion of propellant slosh modeling work performed for the present vehicle configuration, including slosh frequency and participatory fluid mass predictions. Knowing the range of slosh mode frequencies over mission phases, the TVC bandwidth must be carefully selected so as not to excite the slosh modes at those frequencies. The likely need to increase the damping factor of slosh modes via baffles will also be discussed. To conclude, a discussion of operations procedures aimed at minimizing TVCslosh interactions will be given."}, {"section_title": "I. Introduction", "text": "The Constellation Program + is NASA's response to the human exploration goals set by former President George W. Bush for returning humans to the Moon by 2020. In January 2004, former President Bush announced the new Vision for Space Exploration for NASA. The fundamental goal of this vision is to advance U.S. scientific, security, and economic interests through a robust space exploration program. To this end, the NASA Constellation Program is working on two spacecraft (the Crew Exploration Vehicle named Orion and the Lunar Lander Vehicle named Altair), two launch vehicles (ARES-I will launch Orion and ARES-V will launch Altair), and surface support systems to establish a lunar outpost. This work will provide experience needed to expand human exploration farther into the Solar System. The first crewed flight of the Orion spacecraft is scheduled for no later than 2015, when it will fly to the International Space Station. Altair's first landing on the Moon with an astronaut crew is planned for no later than 2020.\nThe Lunar Lander Altair is the linchpin in the Constellation Program for human return to the Moon. The Guidance, Navigation, and Control (GN&C) system must perform many functions that are critical to the Altair mission. One key GN&C function will be the commanding of effectors that control attitude and impart ∆V on the vehicle, utilizing both Reaction Control System (RCS) thrusters and throttling and TVC gimbaling of the vehicle main engine. The purpose of this paper is to describe a conceptual design of the Thrust Vector Control (TVC) system and preliminary modeling of propellant slosh, for the Altair Lunar Lander. To this end, key requirements the GN&C system must satisfy, and functions it must perform, in various mission phases will first be described. The Altair GN&C system (including its sensor suite and thruster configurations) that is configured to support these requirements and functions has already been documented 6 and it will only be briefly summarized in this paper. To provide context, a brief description of the current Altair mission timeline with a focus on the various powered flight ∆V maneuvers will be provided. Both the descent and ascent modules of Altair carry fuel tanks. During thrusting maneuvers, the sloshing of liquid fuels in partially filled tanks can interact with the TVC (or RCS thrusters) controlled system in such a way as to cause the overall system to be unstable. Hence, these fuel tanks must be properly placed, relative to the spacecraft's c.m., to avoid any unstable interactions. Following this will be a discussion of propellant slosh modeling work performed for the present vehicle configuration, including slosh + The future of the human space flight program, and thus the Constellation program, is currently being discussed at the highest levels of the U.S. government. For the purposes of documenting the Altair design, this paper is written without consideration of any forthcoming changes in the direction (or even existence) of the program. frequency and participatory fluid mass predictions. To conclude, a discussion of the TVC system design, with its accommodation of predicted slosh characteristics and overall sensor and structural dynamics, will be provided along with a discussion of operations procedures aimed at minimizing TVC-slosh interaction."}, {"section_title": "II. Design Reference (Polar Sortie) Mission", "text": "Similar to that of the Apollo Lunar Module, Altair is envisioned to be a two-stage vehicle, comprising a Descent Module (DM) and an Ascent Module (AM). Using propulsion elements carried by the unmanned DM, the mated DM/AM will descend from a lunar parking orbit and land on the Moon. Altair will be capable of landing four astronauts on the Moon and of providing life support and a base for weeklong initial surface exploration missions. Using propulsion elements carried by the manned AM, only the AM will ascend from the lunar surface, returning the crew to the Orion spacecraft that will bring them back to Earth. A representative Altair mission profile consists of the following sub-phases:\n• Pre-launch ground operations and launch vehicle (LV) boost phases • LEO operations and mating of Altair/EDS with Orion The mission starts with the use of the ARES-I launch vehicle to insert Orion into a 100-km low Earth Orbit (LEO). Next, the ARES-V heavy-lift launch vehicle will insert Altair, which is mated with the Earth Departure Stage (EDS), into the same orbit. At liftoff, Altair has a mass of 45 metric tons. During docking operations with Orion in LEO, the passive Altair/EDS stack will be controlled by EDS. After spending 2-3 days in LEO, the EDS will be fired to impart 3.1-3.2 km/s ∆V on the mated Orion/Altair vehicle and send it on its way to the Moon. The duration of the trans-lunar injection (TLI) burn is about 6 min. Within 0.5-1 hour after the completion of the TLI burn, EDS will be separated from the mated Altair/Orion. Post-separation, the Altair GN&C system will begin to execute all guidance, navigation, and control functions of the mated Orion/Altair vehicle.\nThe Trans-lunar Coast (TLC) will last 90-100 hours. During the TLC phase, Altair GN&C will perform four (or more) trajectory correction maneuvers (TCM) in order to keep the spacecraft on a pre-computed reference trajectory. Typically, these are small burns (<30 m/s) that will be executed using RCS thrusters of the Descent Module. The long coast time offers opportunities to perform many checkouts and calibrations of GN&C sensors and equipment. Upon arrival at the Moon, the powerful gimbaled engine of the Altair descent module will be fired for 10-11 minutes in order to slow down the velocity of the stack by 891 m/s. At the end of the lunar orbit insertion (LOI) burn, the gravity field of the Moon will capture the mated vehicle into a 100-km low lunar orbit (LLO). This LLO will be a polar orbit for landing targets that are located near the south pole of the Moon. Table 1 provides a list of discrete propulsive maneuvers that will be executed by the Altair GN&C system. After spending about one day in the LLO, Altair will undock with Orion. Orion will execute both the undocking and the separation maneuvers. About 1.5 hours after the separation event, Altair will use the DM engine to perform a small (28.3-28.5 m/s) Plane Change (PC) ∆V burn in order to target the Shackleton landing site near the South Pole. The duration of the PC burn is about 19 s. Another 1.5 hours after the PC burn, Altair will use the DM RCS thrusters to perform a small (19.2-19 .4 m/s) de-orbit insertion (DOI) ∆V burn. The DOI burn will last about 5.7 min., and Altair has a mass of about 32 metric tons at the end of the DOI burn. The DOI burn will place Altair on an orbit that has a perilune of 15.24 km. At the perilune, the gimbaled engine of the DM will be ignited to initiate the powered descent burn.\nInitially, the powered descent burn (2074 m/s) will focus on braking the orbital speed of the vehicle. To do this efficiently, the engine thrust will be closely aligned with the velocity vector of Altair. At an altitude of about 2 km, nearly 3 minutes before touchdown, the Altair will make a large change in its attitude via a \"pitch-up\" maneuver. In so doing, the guidance algorithm will sacrifice fuel utilization efficiency in order to provide landing-site visibility for both the crew and the terrain hazard detection sensor system. With this attitude change, hazardous terrain features (craters, rocks, and surface slopes with angles too great for the Altair landing gear design) could be identified by both crew members and sensors, and a landing site \"re-designation\" made, if necessary, to avoid the hazardous landing site. During the final vertical descent of the vehicle, GN&C will focus on achieving a vehicle's touchdown state that is consistent with the landing gear design. Nominally, it will take Altair about twelve minutes, from the initiation of the powered descent burn, to land on the Moon. At the time of touch down, Altair will have a mass of 19-20 metric tons.\nAfter a stay of 5-7 days on the Moon, a series of burns will be executed to bring the Ascent Module (AM), housing the Crew, back to a 100-km LLO where it will dock with the orbiting un-crewed Orion. At liftoff, the Altair AM has a mass of about 7 metric tons. The first burn, named ascent insertion burn, will be executed using the ungimbaled engine of the AM in three sub-phases. After a vertical rise to achieve an altitude of 100 m, thrusters will be fired to execute a single-axis rotation (SAR) and orient the vehicle attitude to a desirable flight path angle for the next sub-phase. The AM GN&C will then use the Powered Explicit Guidance (PEG) algorithm to complete the insertion burn until engine cutoff. The time of this insertion burn is about 7 min. Nominally, the ascent insertion burn will place AM in a 15.24 km × 75 km orbit. Rendezvous, Proximity Operations, and Docking (RPOD) maneuvers are initiated 10-15 min. after the completion of the ascent insertion burn. These are discrete maneuvers with coasting in between discrete burns. They are relatively small and therefore will be executed using the AM RCS thrusters. The first discrete burn, about 1-2 m/s, will be used to \"clean up\" any undesirable trajectory dispersions generated by the ascent insertion burn. Next, the larger Terminal Phase Initiation (TPI) burn, about 19-20 m/s, will place Altair on a coasting trajectory to acquire the R-bar at a distance of 2 km from the orbiting Orion with a radial relative velocity. 6, 9 Between TPI and the R-bar acquisition, small maneuvers will be used to shape the trajectory and correct any dispersion.\nThe proximity operations phase consists of many small maneuvers to be executed by Altair, to close the gap between Altair and Orion, in \"steps\". During proximity operations, the uncrewed Orion will be the passive vehicle, and its thrusters will be used to maintain the spacecraft in a quiescent state. To achieve a soft docking, Altair will measure the relative angular and translational displacements and rates between vehicles via its docking sensor. The AM thrusters with small minimum impulse bit will then be used to generate the needed small translational and angular rate changes. To achieve a safe docking, the contact conditions between the vehicles must be controlled to levels that are acceptable to the Low Impact Docking System (LIDS). Key contact conditions include the relative translational and angular rates between the mating vehicles as well as the relative translational and angular attitudes, about all spacecraft axes. Altair has a mass of 3.3 metric tons at the time of docking. Measuring from the time of lunar liftoff, the AM will be able to complete the entire process in just less than 3 hours.\nAfter a successful transfer of Crew from the AM to Orion, the crewed Orion will perform the undocking and separation maneuvers to achieve a safe separation distance the vehicle. Before the Crew start their preparations for the Trans-Earth Injection (TEI) burn, they will send commands for Altair GN&C system to execute a second deorbit insertion to \"dispose\" the AM near a pre-selected site on the Moon. Henceforth, the Orion GN&C system will assume all GN&C responsibilities."}, {"section_title": "III. Key Altair Guidance, Navigation, and Control Related Functionalities", "text": "The Constellation Architecture Requirements Document (CARD) defines requirements controlled by the Constellation Program for hardware, software, facilities, personnel and services needed to perform the design reference missions. 13 The CARD is structured to provide top-level design guidance, architecture wide requirements, and allocations to the systems. A list of key GN&C-related requirements is given in Ref. 6 . Based on the current interpretations of these requirements, the following set of GN&C functions is identified:\n• Estimate the three-axis attitude and attitude rate of Altair (with respect to an inertial frame), at all times, satisfying a set of attitude determination accuracy requirements.\n• Control both the three-axis attitude and attitude rate of Altair relative to their commanded state, at all times, satisfying a set of attitude control pointing accuracy requirements.\n• Determine the \"state\" of Altair (both the three-axis position and velocity vectors) with respect to a reference frame, at all times, satisfying a set of position and velocity determination accuracy requirements.\n• Compute maneuvers associated with lunar descent and landing beginning with DOI after the completion of LOI.\n• Compute rendezvous maneuvers associated with lunar ascent and RPOD after the completion of the ascent insertion burn.\n• Execute fixed or time-varying commanded ∆V burns:\no Using either the AM or DM RCS thrusters, satisfying a set of RCS maneuver execution accuracy requirements.\no Using the gimbaled DM engine, satisfying a set of DM engine maneuver execution accuracy requirements.\no Using the ungimbaled AM engine, satisfying a set of AM engine maneuver execution accuracy requirements.\no Response to a crew command to terminate a burn in progress.\n• Land Altair near the landing site in any lighting condition and without the aid of pre-deployed lunar surface infrastructure, satisfying a pre-selected landing accuracy requirement.\n• Function as either the maneuvering or target vehicle while performing RPOD with Orion in LLO.\n• Accept both real-time and stored command sequences from either the mission control center or the crew.\n• Collect a pre-selected set of GN&C telemetry data and then routed it either directly to the ground, or to an onboard recorder (for later transmission to the ground).\n• Provide onboard manual control of flight path, attitude, and attitude rates when the crew can operate the vehicle.\n• Detect a GN&C system fault, isolate the root cause of the detected fault, and autonomously reconfigure the GN&C system to restore the affected GN&C functionalities."}, {"section_title": "A. Guidance, Navigation, and Control Sensor Suite", "text": "To perform the multitude of GN&C functions listed in Section 3, a set of GN&C sensors is selected. The intent in making this selection was not to promote any particular vendor's sensor or rule out possible use of different sensors in the ultimate spacecraft design, but rather to specify a representative set of sensors that can provide the requisite functionality, based on currently-available technology. The mapping between these GN&C sensors and the functions they support was described in details in Ref. 6 . The following paragraphs provide a brief description of the Altair GN&C sensor suite.\nThe spacecraft's attitude in a celestial frame is estimated using a Stellar Reference Unit (SRU, sometimes called a star tracker) and a set of three gyroscopes. The primary star tracker is mounted on the AM. The backup star tracker, together with a narrow angle camera, are mounted on a 2-dof gimbal platform. This sensor package, named Optical Navigation Sensor System (ONSS), is specifically included in the GN&C sensor suite for the purpose of performing optical navigation. 5 The ONSS can also serve other important GN&C functions. On descent, Altair GN&C plans to use ONSS to perform terrain relative navigation (TRN). This is a navigation technique that takes advantage of known locations of landmarks on the lunar surface. On ascent, the GN&C system plans to use ONSS to perform Orion-relative navigation. In this navigation approach, the range and bearing angles between the two vehicles would be estimated using measurements from ONSS cameras together with supporting onboard software.\nThree Inertial Measurement Units (IMU) are included in the Altair GN&C sensor suite. The primary IMU contains four gyroscopes and four accelerometers. The two backup IMU's are identical, and each unit contains three gyroscopes and three accelerometers. If these three IMU's are not co-aligned, and if they are all powered on, independent measurements from 10 gyroscopes and accelerometers will be available. Measurements from three selected prime gyroscopes will be used to support the attitude determination function. Measurements from three selected prime accelerometers will be used to support the propagations of spacecraft's \"state\" vector (the position and velocity vectors of the spacecraft). 4 For guidance and control of Altair in the descent and landing phase, a Terminal Descent Radar System (TDRS) will be used to estimate the surface-relative Altair's altitude and velocity. Radars were used on all Mars landers, such as Phoenix. But the specific Altair TDRS is the radar that is being readied for the Mars Science Laboratory (MSL), which will be launched in 2011. The MSL radar uses pulse-Doppler technology to simultaneously provide estimates of altitude and velocity. In the general vicinity of the intended landing site of Altair near the South Pole, there are many terrain hazards that will be challenging to the Altair's landing gear. These hazards include craters, slopes, and rocks. The presence of these types of terrain hazards forced the Apollo-12 crew to make seven redesignations of the landing site before a safe touch down. 17 For the Apollo missions, the identifications of terrain hazards were all made by the crews. This is feasible for well-lighted landing sites that are located within ±20° from the Equator. But even for these missions, near the end of the approach phase of the descent trajectory, crew vision was obscured by the presence of dust clouds. Apollo-11 crews observed dust cloud at an altitude of 30 m. 16 Dust cloud became so intense at 12-15 m that it impaired the visibility of the Apollo-11 crew during the terminal descent and landing phase of the mission. The detection of terrain hazards by crew alone might be risky. For Altair, a sensor named Terrain Hazard Detection System Sensor (THDSS) will be the primary mean of terrain hazard detection. 8 Crew visual detection will be the backup (via out-the-window viewing). Conceptually, THDSS will generate a prioritized list of \"hazard free\" landing sites and the re-designation to one of these recommended sites will be authorized by the crews. 8 The rendezvous and docking process consists of a series of orbital maneuvers and spacecraft attitude control motions that successively bring the active vehicle into the vicinity of, and eventually into contact with, the passive vehicle. In low lunar orbit, Altair will be the active vehicle and Orion will be the passive vehicle. Rendezvous and docking is a complex and challenging task, and it must be supported by a set of rendezvous and docking sensors with adequate redundancy. In the current GN&C plan, the bearing angles from Altair to Orion will be estimated using the prime star tracker. As a backup, the cameras of ONSS will be used. The range and range-rate between the two vehicles will be estimated via the two-way S-band radiometric ranging data. Again, as a backup, they could also be estimated using the ONSS cameras. Once the vehicles are within a range of 4-5 km, estimates of the bearing angles and range with better accuracy could be provided by a scanning lidar (Laser Imaging, Detection, and Ranging). Multiple alternative means to acquire these data are available, and lidar was adopted by Altair GN&C only as a placeholder (see Refs. 6 and 9 for details)."}, {"section_title": "B. RCS Thruster Configurations", "text": "In collaboration with the Altair Propulsion design team, the GN&C design team designed the RCS thruster configurations on Altair. Altair is equipped with two sets of RCS thrusters, one mounted on the descent module and the other on the ascent module. Both thruster sets use engines that are fed bipropellant fuel monomethyl-hydrazine (MMH) and oxidizer nitrogen tetroxide (NTO). MMH and NTO are hypergolic and have rich space heritage (Galileo, Cassini, Space Shuttle, etc.). For the AM RCS thruster configuration, MMH and NTO are each stored in two tanks. Upstream of these tanks is a high-pressure helium regulation system. The design of the DM RCS thruster configuration is similar. Functions to be performed by the AM and DM thrusters were described in details in Ref. 6 and will be not repeated here. Guided by the identified functionalities (given in Ref. 6 ), multiple alternative AM and DM RCS thruster configurations were considered. The DM RCS thruster configuration design, depicted in Fig. 2 , was selected based on the following selection criteria:\n• Minimize the total mass of the thruster configuration • Minimize the total number of thruster pods • Minimize the total number of RCS thrusters • Minimize thruster plume impingement on Altair's sensitive equipment • Minimize propellant consumption • Adequate 6-dof control authority in all phases in which the DM RCS thrusters are needed • Maintain 6-dof control functionality with one arbitrarily failed thruster • Use thrusters with high TRL • Use coupled thruster to perform rotational control about all spacecraft's axes The AM RCS thruster configuration design, depicted in Fig. 3 , was selected similarly (though using a different set of selection criteria).\nThe selected DM RCS thruster configuration consists of four thruster pods, with four thrusters per pod. The plane formed by the thruster pods is located near the predicted center-of-mass (c.m.) location of Altair at the time of touchdown. This arrangement will decouple vehicle's rotational motion from translational motion that will be beneficial to re-designation maneuvers that might be needed just before touchdown. On each thruster pod, there are four 445-N R-4D thrusters. Two thrusters are pointed in the ±X-axis directions. The other two thrusters are pointed ±45° from the ±Z-axis and ±Y-axis (see Fig. 2 ). Thruster pods are mounted on DM symmetrically while maximizing their moment arms and minimizing interference with the deployment of the landing gear. Rotational control about all spacecraft axes will be performed using coupled thrusters. Thrusts generated by these thruster firings will almost cancel each other, and the ∆V imparted on the spacecraft will be small (but non-zero). This arrangement is important to minimize the size of \"non-gravitational\" ∆V imparted on the spacecraft. "}, {"section_title": "C. Propulsive Maneuver Control System Designs", "text": "Pre-launch, based on the established design reference mission (DRM), navigation analysis and design tools will be used to generate a reference trajectory for the Altair mission. Besides the obvious need to be fuel efficient, the reference trajectory must also meet other requirements such as a capability to execute the undocking maneuver of Altair and Orion (in LLO) in Earth view. The approved reference trajectory will involve the execution of both large and small ∆V burns. Large burns such as LOI (891 m/s) and the powered descent burn (2074 m/s) will obviously be executed using the DM engine. Small burns, such as the trajectory correction maneuvers, will be executed using RCS thrusters. Intermediate size ∆V burns such as the DOI (19.2-19.4 m/s) and PC (28.3-28.5 m/s) could be executed using either engine or thrusters. The merits and demerits of using either engine or thrusters must be established, and decisions made. At times, decisions are made due to other hardware considerations. For example, there might be an upper bound on the number of times the DM engine could start and restart. In the current Altair mission design, we plan to perform DOI using DM RCS thrusters and PC using the DM engine. See Refs. 4 and 7 for details.\nThree-axis stabilized spacecraft (such as the Viking Mars orbiter and Cassini Saturn orbiter 3 ) had used a twoaxis gimbaled engine to successfully and accurately execute their orbit-insertion burns. Altair has adopted this proven approach. In a gimbaled engine burn, Altair's motions about the Y and Z-axis axes are controlled by engine gimbal actuators. In parallel with the gimbal control system, both the Apollo vehicles and the Space Shuttle had used RCS thrusters to form a backup controller (with wide deadbands) in case the TVC control authority is temporarily exceeded. The placeholder Altair TVC controller design will be described in greater details in Section 7. Thrusters will be used to control the Altair's X-axis motion. Band-off-bang controller that is commonly used to control spacecraft attitude such as the one used on the Cassini spacecraft 28 is the placeholder design. Flight experience associated with the Cassini RCS controller design was described in details in Ref. 3 . The ∆V imparted on the spacecraft will be measured by the IMU (accelerometer). The burn is terminated once the commanded ∆V is achieved. To this end, flight software will use values of both the scale factor and the bias of the accelerometer that are estimated pre-launch. For better burn accuracy, values of these parameters in the flight software should be updated using values calibrated inflight. A notional schematic diagram of the engine ∆V burn is depicted in Fig. 4 Pointing Again, the fixed pointing error is specified in units of velocity while the proportional pointing error is specified in units of angle. The ∆V errors along and perpendicular to the commanded ∆V vector become:\nIn these expressions, |V| represents the magnitude of the ∆V burn.\nTo control the accuracy of the ∆V burns, Altair GN&C will impose two sets of requirements. One set for all engine burns (e.g., the LOI burn) and another set for burns performed by either DM or AM RCS thrusters. Placeholder Gates requirements are given in Table 2 . "}, {"section_title": "V. Unstable Interactions between Thrust Vector Control and Sloshing Liquids in Tanks 6", "text": "Thrust vector stabilization and control is the closed-loop process that keeps the vehicle attitude from tumbling under the high thrust of engine firing and that accepts guidance steering commands to change the direction of the engine-caused acceleration vector. Vehicle motions about the two axes that are perpendicular to the thrust vector are controlled by the gimbal actuators. RCS thrusters are used to control vehicle motion about the remaining axis. Engine throttle is varied to change the magnitude of the acceleration vector. The TVC algorithm will be used to execute three critical ∆V burns of the Altair mission: LOI, PC, and the powered descent burn. A schematic diagram of the TVC is depicted in Fig. 4 .\nThe Altair DM carries eight fuel tanks, four for liquid oxygen (LOX) and four for liquid hydrogen (LH2). During thrusting maneuvers, the sloshing of liquid fuels in partially filled tanks can interact with the controlled system in such a way as to cause the overall system to be unstable. In the post-flight guidance, navigation, and control (GNC) report of the Apollo-11 mission, 16 there were numerous mentions of the impacts of sloshing fuels on vehicle control. For example, during the powered descent phase, the vehicle pitch rate started to diverge near PDI (at 102:36:57 MET). At that time, the peak-to-peak pitch rate was 0.6 °/s. It became 3.0 °/s when MET was 102:39:00. At MET = 102:39:30, the pitch-up maneuver was executed at the start of the approach phase, together with a throttle down and a tightening of deadband (from ±1° to ±0.3°). These control actions arrested the divergence of pitch rate. The peak-to-peak pitch rate dropped from 3.0 to 2.2 deg/s. 16 Experience from the Apollo-11 and other Apollo missions 15,17-18 testified to the need to careful consider the threat of unstable interactions between the TVC and sloshing fuels. To address this threat, the Altair GN&C team studied the following issues in greater depth:\n• Placements of fuel tanks relative to the vehicle's c.m.\n• Estimation of fuel slosh mode frequency as a function of mission phases.\nIn Fig. 6 , the symbols m and m f denote the masses of the dry spacecraft and the fuel bob, respectively. Here, the word \"dry\" is used to represent all spacecraft masses that aren't \"sloshing\". The moments of inertia of the dry spacecraft and fuel are denoted by I and I f , respectively. The symbols ω and ω f denote the inertial rates of the dry spacecraft and the fuel, respectively. θ is the attitude of the spacecraft relative to an inertial frame, \"a\" is the length of pendulum, \"b\" is the distance between the pendulum pivot point and the S/C's dry c.m., along X-axis, and \"c\" is the distance between the pendulum pivot point and the S/C's dry c.m., along the Z-axis. The location of the pendulum pivot and the pendulum length will be estimated using techniques to be described in Section 6. Using D'Alembert's principle, equations of motion of the spacecraft and the pendulum bob, as well as relevant kinematics relations could be written. Invoking small angle motions of the spacecraft and fuel bob relative to their trimmed states, the transfer function of the system, from the gimbal angle input (δ) to the spacecraft's attitude (θ) is given by (2) To avoid unstable interactions between the TVC and the sloshing fuel, the open-loop \"pole\" (Ω P ) must be larger than the open-loop \"zero\" (Ω Z ). 19, 28, 36 That is,\nIt is highly desirable to configure the vehicle to produce a stable interaction between the slosh mode and the spacecraft rigid body mode. An attitude control logic, designed to stabilize the rigid-body mode while neglecting the slosh mode, will naturally stabilize the slosh mode because of such a stable interaction. Using the expressions given in Eq. (2), we can derive the following relations:\nIn these expressions, we note that G and B are always positive. The terms A and B are functions of b, the distance between the pendulum pivot and the dry S/C's c.m. location, along the X-axis. If -L<b<0, both A and C will be positive and € Ω P 2 -Ω Z 2 > 0. Accordingly, we will have a stable interaction between the TVC and the fuel pendulum.\nThat is, the slosh pendulum pivot must be located below the dry S/C's c.m. to achieve a stable interaction 6, 19, 28, 36 Performing a similar analysis for a spacecraft with multiple sloshing fuels (the descent module carries eight tanks), one will arrive at the same conclusion. At the end of the 3 rd design cycle of the Altair vehicle, the design team has arrived at a vehicle design that is resilience relative to both \"Loss of Crew\" (LOC) and \"Loss of Mission\" (LOM) risks. Using the descent module tank geometry, liquid fill level, vehicle's c.m. location, and engine-imparted longitudinal acceleration per that design, the GN&C team generated estimates of the distance between the pendulum pivots and the S/C's c.m. location. From Fig. 7 , we note that the condition \"b < 0\" is satisfied in all mission phases (this is the case as long as red and yellow lines are below the blue line). To first-order, there will be no unstable interaction between the sloshing fuels and the TVC controlled system in these mission phases. A similar analysis was made for the powered ascent insertion burn. The AM main engine isn't gimbaled. Hence, there will be a need to cant the engine axis through the predicted location of the AM's c.m. at mid-way of the 7-minute burn. The large R-42 thrusters (cf. Fig. 8 ) will be used during the ascent insertion burn to counter any tumbling torque imparted on the AM due to canting error, knowledge error of the predicted c.m. location, staging torque (\"fire in a hole\"), etc. In Fig. 8 , the motion of the sloshing propellant (for the ascent insertion burn) is again modeled by an equivalent mechanical pendulum. The symbols m and m f denote the masses of the dry spacecraft and the fuel bob, respectively. The moments of inertia of the dry spacecraft and fuel are denoted by I and I f , respectively. The symbols ω and ω f denote the inertial rates of the dry spacecraft and the fuel, respectively. θ is the attitude of the spacecraft relative to an inertial frame, \"a\" is the length of pendulum, \"b\" is the distance between the pendulum pivot point and the S/C's dry c.m., along X-axis, and \"c\" is the distance between the pendulum pivot point and the S/C's dry c.m., along the Z-axis. The motion of the spacecraft about the [Y,Z] axes will be controlled by four pairs of 890-N thrusters (that are labeled \"X\" in Fig. 8 . See also Fig. 3 ). The effective magnitude of these thrusters are denoted by \"f\" in Fig. 8 (4), we can derive the following relations:\nwhere :\nIn these expressions, we note that G, B, and C are always positive. The term \"A\" is a function of the distance between the pendulum pivot and the dry S/C's c.m. location, along the X-axis. It is positive if b<0, and we will have a stable interaction between the RCS controller and the fuel pendulum. Accordingly, to first order and just like the placements of DM tanks, the slosh pendulum pivot of AM fuel must be located below the dry S/C's c.m. to achieve a stable interaction between the RCS thruster control system and the sloshing fuels during the powered ascent burn. Once \"b\" is computed for the current Altair AM design, we will know whether there is a need to change the locations of the fuel tanks in order to achieve a stable interaction between the sloshing fuel and the RCS controlled system throughout the ascent insertion burn."}, {"section_title": "VI. Estimations of Fuel Slosh Mode Frequencies", "text": "Altair is a flexible spacecraft and the design of the TVC system must consider these flexibilities. Also, the large quantities of propellants that are needed to perform the ∆V burns are stored in multiple tanks. When the spacecraft experiences high acceleration due to the firing of the descent (or ascent) engine, the poorly damped sloshing motions of the liquid fuel inside the tanks must also be considered in designing the TVC system. Else unstable interaction between the TVC control actions and sloshing motions might occur, leading to degraded performance or even a total vehicle failure. For example, during the powered descent phase of Apollo-11, the magnitude of pitch rate oscillations diverged beginning at the \"Window-up\" maneuver. 16 Also, during the Trans-Earth Injection burn of Apollo-11, the pitch slosh oscillation persisted throughout the entire Service Module burn. Significant interactions between the sloshing liquids and the TVC system will degrade the maneuver execution performance (magnitude and pointing accuracies) resulting in excessive propellant usage. The loss of the ATS-V (1969) 1 and the Intelsat IV spacecraft (1977) 2 were both attributed to more extreme examples of maneuvering spacecraft slosh interaction. Unstable interactions between sloshing fuel and the TVC system of the NEAR spacecraft also significantly impacted the performance of a critical engine burn. 11 Other spacecraft failures from fuel slosh were documented in Ref. 39 .\nIn order to design a TVC system accommodating slosh, an understanding of expected slosh behavior is required. To this end, simple closed-form analytic and more rigorous computational slosh models have been developed for the Altair Liquid Oxygen (LOX) and Liquid Hydrogen (LH2) propellant tanks. As slosh characteristics are highly dependent on tank geometry, fill level, and overall longitudinal acceleration, the Altair vehicle and tank geometry of the 3 rd Altair design cycle, along with mission profile was assumed. Slosh characteristics that affect slosh-TVC interaction and that were modeled for this analysis include (i) lateral slosh frequency, (ii) fluid participatory mass and as the sloshing fluid was modeled as a simple pendulum, (iii) the location of the vehicle center of mass relative to the slosh pendulum pivot point. Sections VI.A and VI.B provide estimates of these slosh model parameters using two alternative approaches, as well as provide some insight into the dynamics of slosh, its modeling, the estimation of liquid damping and how it compares for different fluids."}, {"section_title": "A. Analytical Approaches", "text": "For the analytic modeling of slosh during an acceleration event such as a propulsive ∆V maneuver, the primary slosh motion of interest is typically assumed perpendicular, or in a lateral direction, as compared to the longitudinal acceleration vector imparted by the propulsive system. 24, [33] [34] During an acceleration (propulsive) event and due to the relatively low damping of typical liquid propellants, the slosh motion can manifest itself as a lateral oscillatory response to any impulsive disturbance that has a lateral component. For example, the side force of a gimbaling main engine. Even a rotational disturbance due to firings of RCS thrusters could impart a lateral oscillation due to the presence of tank's internal constraints on the motion of the liquid.\nThere are two common closed form analytic methods for modeling the lateral oscillatory slosh behavior of a liquid in a tank experiencing acceleration. One approach is to model the participating liquid as a lump or body of mass attached to a tank wall via a spring and damper. This is a simplifying approach that constrains the fluid motion to one degree of freedom. Another approach is to model the participating liquid as a mass on the end of a pendulum, allowing multiple degrees of freedom (cf. Figs. 6 and 8) . The focus is on the lateral direction with the pendulum oscillating around the predominant acceleration vector. 24, [33] [34] Each method has advantages though the pendulum approach is adopted by the Altair GN&C team as it was used both for the original Apollo slosh analysis as well as for Cassini work. 2, 23, 26 Additionally, the pendulum approach has the advantage that the lateral response derives directly from the imparted longitudinal acceleration whereas the spring-mass approach requires a unique calculation of the spring constant for each acceleration level. Furthermore, in the pendulum approach, the 'micro-g' terms of the slosh pendulum model could be ignored as they are significant only for very small accelerations typical of a spacecraft venting on-orbit. Generally these terms are several orders of magnitude less than 1 Earth g, and require additional modeling terms to represent fluid surface tension of the liquid of interest. 24 The powered flight maneuvers that are the focus of our slosh analysis have accelerations in the range of 0.15-0.3 Earth g's (see Table 3 ). Fig. 9 .\nFrom the pendulum analytic slosh model, three slosh parameters emerge that support slosh-control system interaction analysis. These slosh parameters are the slosh frequency, participatory mass, and effective pivot point. Arguably the most important of these parameters is the estimated natural frequency of the sloshing liquid, which is derived from estimated pendulum length (see Eq. (6)) and which the thrust vector control system should avoid exciting. The participatory mass, being the amount of liquid that is sloshing in the pendulum model, is important as it correlates to how much force the vehicle experiences and whether flight control would attempt to counter it. 24, [33] [34] The effective pivot point is the rotation point of the pendulum. As discussed in Section V, there is a strong preference to have the pivot located below the rigid body vehicle's c.m. for increased overall system stability. 19, 28 All three slosh pendulum parameters are functions of tank geometry including size, tank fill level, and the longitudinal acceleration imparted on the tank. Interestingly these three slosh model parameters, of interest to flight control, are not a function of the specific liquid being excited, except in that the participatory mass is a fraction of the total fluid mass and is therefore a function of the specific liquid density. 24, [33] [34] However the damping of the sloshing liquid, which factors into baffle sizing and design, 34 along with the liquid surface tension, if modeling slosh for a micro-g acceleration, do correlate to the specific liquid type. 24 Literature describing the analytic calculations of these slosh model parameters includes a classic Apollo era NASA publication, SP-106, 33 and an updated version of this same treatise by Southwest Research Institute (SwRI) 24 along with other supportive publications. 25, 34 These references describe analytic techniques for estimating the three slosh parameters for a variety of basic tank shapes including spherical and upright cylindrical. The tank shapes for the original Lunar Excursion Module (LEM), as well as the tank configurations of Altair, are actually a combination of these basic shapes, effectively consisting of upright cylindrical tanks with hemispherical dome caps on the top and bottom. To address this configuration, slosh modeling for the LEM tanks utilized a hybrid approach where if the liquid fill fraction is in either end cap, fuel sloshing motion is modeled using a spherical tank equivalent in size to the hemispherical end cap. If the liquid fill fraction is in the cylindrical portion of tank, one uses an equivalent cylinder with cross sectional area equal to the actual cylinder, but with height sufficient to equal the total tank volume. For spherical tank model, slosh pivot is fixed at the center of the sphere. For cylindrical tank model, the slosh pivot point translates along the longitudinal axis as function of fill level. 26 This approach was adopted for analytic modeling of slosh motions inside the Altair's propellant tanks. The Altair's descent module carries four identical LOX tanks, and four identical LH2 tanks. All eight tanks are upright cylinders with hemispherical end caps. Relative to the LOX tanks, the LH2 tanks are slightly taller and significantly larger in diameter (due to the low density of liquid hydrogen).\nIt is assumed that single or multiple tanks would have the same basic slosh characteristics as these are only a function of tank size and geometry. It is also assumed in calculating total participatory slosh mass for the vehicle that the liquid of all the tanks acts together as this would generate a worse case slosh force on the vehicle. If the individual slosh masses of the tanks acted counter to each other, then the overall force on the vehicle would effectively be less. However, no further investigation into multi-tank interaction was pursued in our work. As the Altair vehicle design matures further, it would be recommended that such interactions be explored both experimentally and in simulation, modeling each tank individually with a slosh pendulum model."}, {"section_title": "A.1 Slosh modeling for basic tank shapes", "text": "The specifics of pendulum slosh modeling for a sphere and an upright cylinder, which can then be combined in the hybrid approach just described, are defined in the SwRI reference on slosh modeling. They are briefly reviewed in this paper. Not included here are their derivations, though those also exist in the reference. 24 For a simple spherical tank, a plot of the pendulum length over tank radius, as a function of fill level for the first slosh mode is given in Ref. 24 . In the same reference is the participatory mass fraction as a function of fill level for non-sloshing mass as well as the sloshing mass. Once pendulum length and the longitudinal acceleration is defined for a given tank geometry and fill level, the natural slosh frequency (in rad/s) can be estimated with the simple generic pendulum equation:\nwhere L is pendulum length and a X is the longitudinal acceleration. For the spherical tank, the center of pendulum rotation is assumed to be the center of the tank."}, {"section_title": "24", "text": "For the upright cylindrical tank, pendulum length, participatory mass and pendulum pivot point, relative to the center of mass of the current total fluid volume, are also given in Ref. 24 as a function of fill level. Again the slosh frequency is calculated from the pendulum length and the longitudinal acceleration using the generic pendulum equation (Eq. (6)).\nThough not evident from just reviewing the empirical plots and equations given in Ref. 24 , it is worth noting that in general the cylindrical tank has better slosh characteristics (for avoiding flight control interaction) than spherical tank. Specifically, the cylindrical tank when compared to a spherical tank of equal volume has a higher slosh frequency, allowing for more separation from the TVC bandwidth (BW). Details on the importance of having good separation between the TVC BW and slosh frequencies are given in Section VII. The cylindrical tank also has less participatory mass than that of a spherical tank of equal volume. Both of these advantages are due to the smaller exposed liquid surface area within the tank which reduces the amount of liquid that can rise up or down in a slosh wave."}, {"section_title": "A.2 Slosh modeling for the Altair's Clean Tanks", "text": "Slosh model parameters were estimated for both the LOX and LH2 tanks for various mission events. They were estimated assuming the latest vehicle mass properties, tank sizes, and tank placements on the vehicle. All slosh frequencies reported here correspond to Altair's clean tanks even though, as explained in section VI.A.3, it is highly likely that these tanks will be retrofitted with baffles. Three propulsive events of special interest are the LOI, PC, and PD&L burns. The Lunar Orbit Insertion (LOI) maneuver is a large burn executed by Altair vehicle main engine and TVC acting upon the total vehicle stack of Altair and Orion. About one day after LOI, Altair is separated from Orion. The Plane Change (PC) burn again uses the Altair main engine and TVC but is a relatively short burn acting only on Altair. The last major burn executed by the Altair main engine, requiring TVC, is the Powered Descent and Landing (PD&L) burn. This burn could be divided into three sub-phases. The braking phase is where most of the vehicle's orbital velocity is negated, along with a significant reduction in propellant. The approach phase begins about one km and about 107 s from the landing area. This phase, included primarily for astronauts to observe the landing area, is immediately preceded with a pitch up of the vehicle, allowing for crew visibility, and a throttle down, allowing for the vehicle to continue to descend in the low lunar gravity. The last phase is the vertical descent and ended with a soft touch down. In this phase, the descent engine will be throttled to maintain a constant vertical vehicle velocity of about 1 m/s before touch down. Details are given in Ref. 6 . Also critical to the estimation of slosh characteristics is the longitudinal acceleration experienced by the vehicle and tanks as this is the forcing function driving energy into the slosh pendulum. Increased acceleration will result in a higher slosh frequency (cf. Eq. (6)). The estimated values of longitudinal accelerations in various mission phases are listed in Table 3 . Fig. 9 shows both LOX and LH2 slosh frequencies (in Hz) versus mission event. Note that the LH2 frequencies are observed to be lower for all mission phases. This is due to the fact that its tanks are significantly larger than the LOX tanks, allowing for more exposed surface area and hence a longer pendulum arm. Estimated frequencies are also observed to be relatively unchanged for events 2-4. This is also true for events 6-8 because the propellant was in the cylindrical portion of the tank (where slosh frequency isn't a strong function of fill level). Frequencies for event 4 (prior to separation of Altair and Orion) and event 5 (PC ∆V burn after separation of Altair and Orion) are about the same even though the vehicle mass was greatly reduced after the separation event. This is the case because the throttle for the PC burn was reduced. The frequencies at event 6 (start of the PD&L phase) are higher than event 5, even with essentially the same mass. This is because of the higher engine throttle (and hence longitudinal acceleration) to be used for event 6. Slosh frequencies are lower for events 9-11 as the throttle has been reduced (see Table 3 , from 0.32 to 0.17 Earth's g) and as the propellant gets into the lower end cap where even though the exposed surface area is reducing, the effective pendulum arm is increasing as the pivot point of the arm remains at the radial center point of the lower end cap. The estimated range of Altair slosh mode frequencies, 0.21-0.44 Hz, is compared briefly with those of the Saturn orbiter Cassini 3 and the Mars Reconnaissance Orbiter (MRO). 37 The propulsion module of Cassini houses two cylindrical tanks with hemispherical end domes. These tanks each contain an eight-panel Propellant Management Device (PMD) of the surface tension type. 23 These PMD's are used to control the orientation of the propellant in the low-g environment via surface tension forces. In Ref. 3, the power spectrum of the per-axis spacecraft's attitude rates at the time of Saturn Orbit Insertion (when the tanks were about 50% full) were used to estimate the slosh mode frequencies and other spacecraft's structural appendages. The estimated values of the first and second slosh mode frequencies of Cassini were found to be 0.074 and 0.18 Hz, respectively. The MRO spacecraft uses almost identical propellant tanks with similar PMD's. The first slosh mode frequency was determined using Mars Orbit Insertion data and it was found to be 0.23 Hz. 37 Fig . 10 shows both the LOX and the LH2 slosh participatory mass (assuming all four LOX or all four LH2 tanks slosh and oscillate in unison) versus mission event. The participatory mass of the LH2 is observed to be significantly lower simply because the overall mass of liquid hydrogen required for performing the ∆V maneuvers is much lower. Participatory mass is observed both for the LOX and LH2 to be at a maximum for events 2-6 when in the upper half of the cylindrical portion of the tanks. Participatory mass is not a function of acceleration so there is no variation observed with throttle or vehicle mass changes. The participatory mass begins to drop off as the fill level gets into the lower portion of the cylindrical section and then into the hemispherical cap, as generally expected from the characterizing equations."}, {"section_title": "Figure 10. Total Participatory Slosh Mass versus Mission Event", "text": "The estimation of the slosh pivot point is shown in Fig. 7 (in section V) where the inherent stability of this fluid and tank geometry is explored. This shows the pendulum pivot point to always lie below the vehicle's c.m., as desirable. 19 This margin was at a minimum (but it is still >1 m) for events 5 and 6, after the Orion had separated, causing the overall stack CM to drop towards the effective pivot point. But, after event 6, the PD&L burn started to consume propellant causing the vehicle's c.m. to rise again (as there was less mass in the tanks to pull the vehicle's c.m. down).\nOverall, the events of most interest regarding slosh are events 2-6, where participatory mass is highest, and events 9-11, where vehicle maneuvering could be most significant. Events 5 (the PC burn) and 6 (start of the PD&L burn) are of concern as the participatory mass is the highest. Also, at the start of the PD&L phase, the TVCcontrolled high thrust vector of the descent engine might not have pointed through the vehicle's c.m. closely. The resultant ignition transient will likely excite the propellant. However, performing the PC ∆V burn before the PD&L burn will help to locate the vehicle's c.m. location (see section VIII). The on-board knowledge of the vehicle's c.m. location could be used to better pre-aim the descent engine's thrust vector. Events 9-11 (Approach and Vertical Descent to landing sub-phases) are of some concern because the overall slosh natural frequency is lowest, possibly very close to the TVC bandwidth. This is also the time when the vehicle is expected to execute some demanding rotational and translational maneuvers to perform a target re-designation or to accommodate human piloting commands. But the participatory slosh masses in these phases will be very low (cf. Fig. 10 )."}, {"section_title": "A.3 Slosh Damping", "text": "As stated above, damping of a slosh oscillation is one slosh parameter that does vary with the specific fluid involved, in addition to tank geometry, fill fraction, and longitudinal acceleration. 34 Damping of sloshing liquids is of particular interest as it factors into decisions of how to physically mitigate potential unstable interactions between sloshing propellant and TVC control actions. In particular, whether baffle should be added to tanks and how to size them. 34 This could be the case if there is inadequate separation between the slosh frequency and the TVC bandwidth, or if maneuvers, especially piloted maneuvers, could excite the slosh mode.\nEstimating the damping ratio (ξ) of a sloshing liquid in a smooth walled tank is an inexact science. However, some empirical equations have been derived to provide first-order estimates. For an upright cylindrical tank, similar to that of the current Altair configuration and with a fill level greater than its diameter, the damping ratio could be estimated via the following expression.\nHere, ν (in m 2 /s) is the liquid's kinematic viscosity, L (in m) is the tank radius, and a X (in m/s 2 ) the longitudinal acceleration. 24 The kinematic viscosity is itself an insightful parameter to calculate for a liquid. It basically represents the tendency of a fluid in motion to damp itself based on its density (correlating loosely to momentum) and dynamic viscosity (correlating loosely to friction). 24 Damping ratios of various sloshing liquid propellants in an 1-m (radius) cylindrical tank and assuming 0.30 Earth's g longitudinal acceleration, similar in size and acceleration to the current lander design and trajectory (see also Table 3 ), are computed using Eq. (7) and compared in Table 4 . These damping values are quite small due in part to the very large tank geometry being considered for the Altair vehicle. Also, it is evident from this table that the propellants chosen for Altair have less damping than those used for the Apollo LEM. That is, with an equivalent impulse or slosh excitation, an Altair propellant will oscillate or 'ring' longer than its Apollo counterpart. Additionally, if slosh excitation can not be prevented outright via sufficient frequency separation from the controller bandwidth, as further discussed in section VII, then it is evident that these fluids will likely require baffles or other slosh mitigation as their estimated damping ratios are almost two orders of magnitude less than that suggested for slosh suppression, being 1-3%.\n24,26,34 For comparison, the damping ratio of the MRO fuel slosh mode was estimated to be about 1%. 37 As it appears the current lander design will require slosh mitigation, a preliminary baffle design has been incorporated into the LOX tanks, where most of the participatory slosh mass would exist, with 3 horizontal ring baffles at locations ranging from near mid tank down to near the feed-line drain. As the Lander design matures, the baffle design would also be refined, possibly with additional baffles being added higher in the LOX tank, and possibly with baffles being incorporated into the LH2 tanks. The type of slosh filter (notch filter, phase-lead, or roll-off) needed depends on the separation between the slosh mode frequency and the TVC BW. If the slosh mode frequency is significantly larger than the bandwidth, a 2 nd order roll-off filter might suffice to remove any undesirable interactions between the slosh mode and the control of the spacecraft rigid body mode. Else, a phase-lead filter might be needed. The block labeled \"limiter\" is used to limit the gimbal angle command generated by the slosh filter to a level that could be supported by the gimbal actuator (see also Table 5 ). Finally, in the feedback path, we note the use of attitude rate feedback to add \"damping\" to the control loop. The resultant damping ratio of the TVC control loop (ξ TVC ) is given in Eq. (8) . To achieve a damping ratio of 1/√2 and a constant BW of 0.12 Hz throughout the PD&L burn, K R must assume a constant value of 1.88 s.\nIf all the high-frequency dynamics (slosh, structure, gimbal, gyroscope, etc.) and nonlinearities of the TVC control loop depicted in Fig. 15 are neglected, one can derive closed-form expressions for the time histories of the S/C's attitude (and the corresponding gimbal angle) when the TVC controlled loop is subjected to a step change in the gimbal angle ε (e.g., due to a mispointed engine at ignition). In the special case when ξ TVC =1/√2, the peak S/C's attitude and rate, as well as the peak gimbal angle and rate are given by expressions of Eq. (9) . (9) According to Eq. (9), for a TVC control system with a 0.12-Hz bandwidth and a gimbal angle step size of 1°, the peak S/C's attitude and rate are 0.6° and 0.2 °/s, respectively. Note that this peak Altair's attitude rate, 0.2 °/s, is comparable to the peak rate experienced by Apollo-11 at PDI, which was 0.25 °/s. The computed peak gimbal angle and rate of Altair are 1.21° and 1.07 °/s, respectively. Note that the peak Altair's gimbal rate is lower than the peak gimbal rate experienced by Apollo-11 at the start of its Trans-Earth Insertion (TEI) burn, which was 2 °/s. The peak gimbal angle of Altair, 1.21°, represents about 20% of the ±6° engine gimbal angle excursion range, and is deemed acceptable. In the representative engine gimbal angle budget given below (Table 5 ), 1.5° was allocated for the peak gimbal excursion at burn ignition.\nThe gain and phase margins selected for the Apollo TVC designs were 8-9 dB and 47°, respectively. 20 The gain and phase margins of space shuttle TVC designs were 8-18 dB and 30-50°, respectively. 21 Guided by these selections, the placeholder stability margins for the Altair TVC controller are: Gain margin ≥ 9 dB, and phase margin ≥45°.\nIn the nominal DRM, the gimbaled engine of the descent module will be used to perform three burns:\n• Lunar orbit insertion (LOI) burn of the mated Orion/Altair vehicle,\n• Plane change (PC) ∆V burn of the Altair vehicle, and\n• Powered descent and landing (PD&L) burn of the Altair vehicle.\nThe c.m. of the spacecraft (either the mated Orion/Altair vehicle or Altair alone) changed significantly from the LOI burn to the PD&L burn. Since the engine thrust vector must point through the c.m. locations of the vehicle during these burns, it is important to ascertain that the currently assumed excursion range of the engine gimbal actuators, ±6° per axis, is adequate. To this end, a preliminary budget of the engine gimbal angle is given in Table 5 .\nThe c.m. locations of the mated Altair/Orion vehicle (at the start and end of the LOI burn) and Altair (at the start and end of the PD&L burn) were estimated by the Altair vehicle engineering team. Using these estimates, one can errors are captured in Table 5 , the DM engine gimbal excursion budget for the PD&L burn. For brevity, the gimbal angle excursion budget for the LOI burn is not given because it is the worst case. Note that, in Table 5 , we have allocated 1.5° for the peak engine gimbal excursion due to TVC control transient at ignition. The peak gimbal angle excursion estimated for a TVC controller with a 0.12-Hz BW and a damping rate of 0.707 was 1.21° (cf. Eq. (9)). The allocation for gimbal angle due to prediction error of the vehicle's c.m. location is 1°. Since the distance between the engine pivot and the vehicle's c.m. is about 1.3 m at the start of the PD&L burn, 1° corresponds to about 2.3 cm knowledge error of the vehicle's c.m. location in the [Y,Z] plane. Based on this gimbal angle excursion budget for the PD&L burn and a similar one constructed for the LOI burn, the Altair GN&C team concluded that the current placeholder gimbal excursion range of ±6° is adequate. The gimbal angle excursion ranges of the LEM descent engines of Apollo-9, 10, 11, and 12 are all ±6°.The pitch and yaw gimbal angle excursion ranges of the space shuttle are ±7° and ±8°, respectively."}, {"section_title": "21", "text": ""}, {"section_title": "VIII. Operations Considerations", "text": "Several operational procedures have been considered by the Altair GN&C team to minimize the impacts of fuel slosh dynamics on TVC performance. They include:\n• A small ullage burn will be performed using RCS thrusters just before all engine burns performed in a \"micro-g\" environment (e.g., the LOI and the PD&L burns). This burn will force the fuel to the bottoms of the tanks and will make the vehicle's c.m. more predictable. The burn will also ensure that the propellant will be at the intake location at the bottom of the tank as large propellant tanks will not have micro-g fluid acquisition systems (unlike the RCS propellant tanks). No such ullage burn is needed before the Lunar ascent burn because the vehicle isn't in a micro-g environment before the ascent insertion burn. Ullage burns were used by all Apollo missions.\n• After the ullage burn, engine gimbal actuators will aim the 2-dof engine axis through the predicted c.m. location of the spacecraft. This practice will minimize the disturbance experienced by the fuel due to the rising engine thrust at ignition. At the end of the last engine burn, the engine thrust vector should have passed through the spacecraft's c.m. That c.m. location should be quite close to the c.m. location of the vehicle at the start of the next engine burn (unless a vehicle reconfiguration such as undocking had occurred between the two burns). For example, the engine gimbal angles found at the end of the PC burn should be used as initial condition for the subsequent PD&L burn. \"Pre-aiming\" of the 2-dof engine was used by Cassini for more than 100 engine ∆V burns. 3, 12 • To avoid exciting fuel sloshing motions, \"gentle\" rate and acceleration profiles will be used, when possible, to slew the vehicle (e.g., for the \"window-up\" motion) before the start of the gimbaled engine burn. However, powered flight maneuvering late in the PD&L burn, either as part of a possible approach phase landing re-designation maneuver, or as a result of direct piloting input, may demand more substantial angular accelerations, a significant demand when sloshing vulnerability may also be substantial. For reference, the Apollo LM provided ~10 °/s 2 during this mission sub-phase.\n• Use of small RCS controller deadband. During the powered descent phase of Apollo-11, the vehicle pitch rate started to diverge near PDI (at 102:36:57 MET). At that time, the peak-to-peak pitch rate was 0.6 °/s. It became 3.0 °/s when MET was 102:39:00. At MET = 102:39:30, the pitch-up maneuver was executed at the start of the approach phase, together with a throttle down and a tightening of deadband (from ±1° to ±0.3°). These control actions arrested the divergence of pitch rate (the peak-to-peak pitch rate dropped from 3.0 to 2.2 °/s). 16 The current plan is to use X-axis RCS controller deadbands of ±1°, ±0.2°, and ±0.2° during the Braking, Approach, and Terminal sub-phases of the PD&L burn. "}, {"section_title": "IX. Summary and Conclusions", "text": "In this paper, we described a conceptual TVC design for the Lunar Lander Altair, along with a discussion of the various powered flight maneuvers where it will be employed. The TVC controller must be designed to be robust relative to the significant fuel sloshing dynamics of the Altair vehicle. To this end, propellant slosh characteristics for the various mission powered flight phases were estimated. Also, since it is highly desirable to configure the vehicle to produce a stable interaction between the slosh mode and the spacecraft rigid body mode, fuel tanks on the ascent and descent modules must be placed with great care. Damping factors of Altair propellant slosh modes in clean tanks were estimated in our study. Since the estimated damping ratios are about two orders of magnitude less than that needed for TVC control stability, Altair fuel tanks are currently designed with baffles. The strong \"couplings\" between the TVC controller design (which is the responsibility of the GN&C team), fuel tank sizing (fuel slosh mode frequency is a strong function of tank geometry and tank sizing is the joint responsibility of the Propulsion and Structure teams), and tank placements (which is the responsibility of the Structure team) make it important for the GN&C, Propulsion, and Structure teams to collaborate closely during early design phases of Altair vehicle design. Beside meeting performance and stability requirements, TVC controller bandwidth must be selected taking into account the fuel slosh mode frequency. Moreover, one must check the compatibility of the TVC controller bandwidth with other vehicle system dynamics (such the engine gimbal actuator bandwidth, sensor bandwidth, structural frequency, sampling frequency of the flight software, etc.). In this paper, these key TVC design considerations are identified and described qualitatively. To quantify the performance of the TVC system, a simulation environment built around a flexible spacecraft base-body, which contains propellant slosh modes and other system dynamics and nonlinearities must be used. Future TVC design iterations will also address other important issues such as the interactions between the crews and the TVC, and will support the evolving reference design of the Altair vehicle and mission."}]