[{"section_title": "Abstract", "text": "As educator of the generations to continue the nation, teac hers have an important role as fac ilitator of strength and motivation in the development of the attitude required for the attainment of educational objectives and goals. They could have an influenc e on their students with what they teac h. Therefore, they need to be innovative in delivering their teac hing to learners in order that the teac hing and learning process becomes more meaningful and results in quality education. In a piec e of research, a learning kit with local culture as basis and developed with the purpose of improving students' analytical skills has been found to be valid and effective in use. The learning kit c onsists of a learning execution plan, a students' work sheet, and an evaluation instrument. The research was Research and Development in design and used the model named ADDIE with the letters in the name standing for Analysis, Design, Development, Implementation, and Evaluation to represent the research stages. The research subjects were junior high school students of the grade officially c alled Grade VII with 31 of them serving as the experimental class. The research instruments were a validation sheet, an analytical skill test, The research used test and non-test data collec tion tec hniques. According to the validation results, the IPA learning kit developed in the research with S erukam local culture as basis was declared valid by an experts' team of validators. The researc h results indicated that the learning kit was effective in use in relation with students' analytical skills. It was indicated by results of analysis of data obtained before and after the learning period, whic h showed that the gain score for students' analytical skills was 0.54, which was medium in category, Therefore, the learning kit developed as the final product of the research already meets the criteria for being valid and effective to use to improve students' analytical skills.\nKeywords: 1 Learning device; local culture; analytical skill\nEducation is a deliberate and planned effort to bring about a learning atmosphere and a teaching and learning process so that students actively develop their self-potential in order to have a religious spiritual strength, self-control, personality, intelligence, praiseworthy morals, and competence that they, their society, their nation, and their country need (Ara & Imam, 2012). Education is an aware and planned action to make students actively develop their potency to have spiritual strength, self-control, personality, intelligence, wellbehaved, and skills for themselves, society, nations, and country (Taqiyuddin, 2018). Suastra (2005) says that almost 90% goal of science education at school is to reach values (scientific products) while the rest is to build skill and attitude. Based on Trends in International Mathematics and Science Study (TIMSS) study in 2011, Indonesian students science achievement is on the 40 with score 405 among 42 count ries (Martin, Mulis, Foy, Stanco, 2012). In the rule of Ministry of Education and Culture (Permendikbud) No. 22 year 2016, every graduate on elementary and middle level must have competency on three dimensions which are attitude, knowledge, and skill. One of the aspects on the attitude dimension is caring, on the knowledge is science and technology, and on the skill is analysing.\nIn Permendikbud No. 22 year 2016 about Standard Process of Elementary and Middle Education, it is said that designing learning device is a part of composing learning planning. That is designed on the syllabus and lesson plan which are based on the content standard. Learning planning is divided into compiling lesson plan and preparing media as well as learning sources, learning asses sment device, and learning scenario. According to Zuhdan (2011) learning device is a tool to help teachers and students in conducting learning activity. Besides, Suhadi (2007) says that learning device is a package of sources, tools, media, guidance, and manual used for learning process.\nScience learning has four characteristics, which are science as a process, science as a product, science as a skill development, and science as an application. All these fourth characteristics should be there on the 1 Corresponding e-mail: frastikasasmitatias@gmail.com, orcid.org/0000-0002-1769-4075 Universitas Negeri Yogyakarta, Indonesia 59 S asmitatias,F. & Kuswanto,H.(2018) The development of science learning device based on Serukam local culture to improve students' analytic al skill. International Journal of Educational Research Review,3(3),[59][60][61][62][63][64][65][66][67][68] www.ijere.com learning process (Erina & Kuswanto, 2015) . Science learning has to pay attention on its characteristics as a process, product, and attitude. Yet at school, it is only focus on science as a product, not as a process and attitude in advance. The science concept which is learnt is related to the real phenomena had and faced by the students in daily (Dwianto, 2007). Thus, it needs special learning which brings interest and real life so that students can understand the material better. In improving students' analytical skill, there are several steps to take to increase the learning quality. To create meaningful activities with creativity so that students will be more active in solving the problems around them, one of the ways is conducting the learning based on the local culture.\nWest Borneo has rich culture and local tradition in managing their living environment. Those contain full of wisdom values and have been practiced since their ancestor's era until now. One of the local wisdoms is fishing together at certain moment by using 'menuba' or 'nuba' (natural fishing tool). According to Dohong (2010) the struggle on natural resources conservation and its protection has been practiced from generation to generation in society. The ability in understanding local culture by i ndividual, society, and government which is done by thinking, practicing as life style, and creating policy sustainably is hoped to create better living quality for society and country (Wahyu, 2007).\nLocal culture is understood as local thought which is wise, full of wisdom, good values, rooted, and followed by many people (Sartini, 2009). Local culture is all had by local society in certain region which contain uniqueness without influence from other regions (Faton Sihabul, 2012). Sardjiyo & Pannen (2005) says that cultural-based learning is a strategy to create learning experiment which is integrated to culture as a part of learning process. Cultural-based learning is based on the admittance of the culture as an important part of education development. The goal and function is also the on the rule No. 22 year 23 about National Education System on Article 3, which says that national education has a function to develop capability and create character and civilization in order to educate nation's life. Indones ian education system in Indonesia has allowed teachers to integrate local culture and learning process, but in practicing they still face several problems. The main problem is the teachers still do not understand how to integrate them (Alexon, 2010). The students cannot ignore the values among society which is full of ethnic and cultural background (Sajidan et al., 2015) .\nOne of the vital issues of the 21st century is developing learners' competence or skills in higher -order thinking (HOT). According to the results of a survey to determine rank and grade attainment in the Programme for International Student Assessment (PISA) in 2015 in the field of science for the purpose of knowing learners' HOT skills, Indonesia got a score of 403 while the international mean score was 493. Among the HOT skills demanding to be honed in the 21st century are analytical skills Areesophonpichet, S. (2013). Students' analytical skills are their skills in breaking down some information into smaller elements to determine their interrelations (Anderson, & Krathwohl, 2010) . Learners' analytical skills need to be honed in order that their HOT becomes improved so that they, as members of the generations to continue the nation, could improve their own quality in constructing innovation s in life and becoming qualified leaders in society. However, realities in the field indicate that the analytical skills are not yet sufficiently honed. Thinking analytically or analytic skill is a high level way of thinking. This skill is defined as wide use of thought to fine new challenges (Emi et al, 2013). High level thinking also makes someone to apply new information or previous knowledge and manipulate information to obtain new answer (Heong, 2011) . According to Barnett & Francis (2012), high level thinking can urge students to think deeply about one topic. Thinking analytically is a strong thinking tool to understand parts of situation, which is defined as foloows: 1) the ability to research and elaborate facts and thoughts into strenghts and weakn esses and 2) the ability to develop the capacity to think wisely and cleverly in solving the problems, analysing data, remembering, and using the information (Amer et al, 2005) . According to Elder dan Paul (2007), analysing and evaluating are introduced as important skills for all students to overcome the problem and give detail reasons. Learning aims to train the students to think analytically (decision making) and not thinking mechanically (routine) (Ministry of Education and Culture, 2013). Analysing is one of the high cognitive abilities which is important to master by the students. Analytical skill can be meant as individual capability in mentioning parts of a problem and showing its part relation, seeing the causes of certain cases or giving arguments which support a statement. (Sudrajat, 2011). Analytical skill is classified into three, which are differentiating, organizing, and attributing (Anderson & Krathwohl, 2001). According to Muryanto, et al (2016) analytical skill is 60 S asmitatias,F. & Kuswanto,H.(2018) The development of science learning device based on Serukam local culture to improve students ' analytic al skill. International Journal of Educational Research Review,3(3),[59][60][61][62][63][64][65][66][67][68] www.ijere.com students' ability to elaborate or separate a thing to its parts complete with the relation. Thinking analytically is developed by strategy which needs formalization and optimization of problem solving (Lieberman, 2010). Brookhart (2010) implies that to measure students' thinking abi lity in separating information into several parts with reasons, the assignment must ask them to find and elaborate each question. They also have to find the correlation of each and serve a problem in which the answer needs further explanation. Analytical s kill means students are able to separate the topics into several main parts and describe the relation of each. Those can be correlated each other or as the whole structure (Kuswana, 2012) . According to Robbins (2011) thinking analytically is a series of ty pical actions but involving inquiry element and further situation with undefined result and parameter. Low analytical skill can be bad-damaged for whether short or long term. The short term will cause the result of students 'learning will be far from the l earning objectives (Johnson, 2014).\nThis research aims to developing learning kit based on the Serukam local culture with problem based learning method in order to improve analytic skill of VII-grade students in Junior High School. The problembased learning is focused on problems in which students can construct their own knowledge, develop inquiry and thinking skills to a higher level. Students should be able to formulate a temporary answer to a problem requiring logical intelligence, courage and active solution with in real situation (Mulyanto. H, 2018) . Culture-based learning is a strategy that creates a learning environment and designs a learning experience which integrates culture as part of the learning process. Integrating cultural elements and local issues into learning is felt to be highly important because it could improve educational quality. Ther efore, the teacher needs to design a learning process by developing a learning kit with local culture as basis by means of raising environmental issues occurring around the students. The purpose of raising such issues is to enable the students to find the solutions by means of analysis so that their analytical skills improve. The purpose of the tryout in the field was to know whether there was a significant difference in average improvement of analytical skills between the learners participating in the lear ning using the learning kit with local culture as basis and those participating in the learning using the conventional learning kit .\nThe research was Research and Development (R&D) in design. The product developed in the research was in the form of a learning kit based on local culture for the purpose of improving students' analytical skills and caring attitude towards the environment . The learning kit developed consisted of RPP (Rencana"}, {"section_title": "INTRODUCTION", "text": "Education is a deliberate and planned effort to bring about a learning atmosphere and a teaching and learning process so that students actively develop their self-potential in order to have a religious spiritual strength, self-control, personality, intelligence, praiseworthy morals, and competence that they, their society, their nation, and their country need (Ara & Imam, 2012) . Education is an aware and planned action to make students actively develop their potency to have spiritual strength, self-control, personality, intelligence, wellbehaved, and skills for themselves, society, nations, and country (Taqiyuddin, 2018) . Suastra (2005) says that almost 90% goal of science education at school is to reach values (scientific products) while the rest is to build skill and attitude. Based on Trends in International Mathematics and Science Study (TIMSS) study in 2011, Indonesian students science achievement is on the 40 with score 405 among 42 count ries (Martin, Mulis, Foy, Stanco, 2012) . In the rule of Ministry of Education and Culture (Permendikbud) No. 22 year 2016, every graduate on elementary and middle level must have competency on three dimensions which are attitude, knowledge, and skill. One of the aspects on the attitude dimension is caring, on the knowledge is science and technology, and on the skill is analysing.\nIn Permendikbud No. 22 year 2016 about Standard Process of Elementary and Middle Education, it is said that designing learning device is a part of composing learning planning. That is designed on the syllabus and lesson plan which are based on the content standard. Learning planning is divided into compiling lesson plan and preparing media as well as learning sources, learning asses sment device, and learning scenario. According to Zuhdan (2011) learning device is a tool to help teachers and students in conducting learning activity. Besides, Suhadi (2007) says that learning device is a package of sources, tools, media, guidance, and manual used for learning process.\nScience learning has four characteristics, which are science as a process, science as a product, science as a skill development, and science as an application. All these fourth characteristics should be there on the learning process (Erina & Kuswanto, 2015) . Science learning has to pay attention on its characteristics as a process, product, and attitude. Yet at school, it is only focus on science as a product, not as a process and attitude in advance. The science concept which is learnt is related to the real phenomena had and faced by the students in daily (Dwianto, 2007) . Thus, it needs special learning which brings interest and real life so that students can understand the material better. In improving students' analytical skill, there are several steps to take to increase the learning quality. To create meaningful activities with creativity so that students will be more active in solving the problems around them, one of the ways is conducting the learning based on the local culture.\nWest Borneo has rich culture and local tradition in managing their living environment. Those contain full of wisdom values and have been practiced since their ancestor's era until now. One of the local wisdoms is fishing together at certain moment by using 'menuba' or 'nuba' (natural fishing tool). According to Dohong (2010) the struggle on natural resources conservation and its protection has been practiced from generation to generation in society. The ability in understanding local culture by i ndividual, society, and government which is done by thinking, practicing as life style, and creating policy sustainably is hoped to create better living quality for society and country (Wahyu, 2007) .\nLocal culture is understood as local thought which is wise, full of wisdom, good values, rooted, and followed by many people (Sartini, 2009) . Local culture is all had by local society in certain region which contain uniqueness without influence from other regions (Faton Sihabul, 2012) . Sardjiyo & Pannen (2005) says that cultural-based learning is a strategy to create learning experiment which is integrated to culture as a part of learning process. Cultural-based learning is based on the admittance of the culture as an important part of education development. The goal and function is also the on the rule No. 22 year 23 about National Education System on Article 3, which says that national education has a function to develop capability and create character and civilization in order to educate nation's life. Indones ian education system in Indonesia has allowed teachers to integrate local culture and learning process, but in practicing they still face several problems. The main problem is the teachers still do not understand how to integrate them (Alexon, 2010) . The students cannot ignore the values among society which is full of ethnic and cultural background (Sajidan et al., 2015) .\nOne of the vital issues of the 21st century is developing learners' competence or skills in higher -order thinking (HOT). According to the results of a survey to determine rank and grade attainment in the Programme for International Student Assessment (PISA) in 2015 in the field of science for the purpose of knowing learners' HOT skills, Indonesia got a score of 403 while the international mean score was 493. Among the HOT skills demanding to be honed in the 21st century are analytical skills Areesophonpichet, S. (2013) . Students' analytical skills are their skills in breaking down some information into smaller elements to determine their interrelations (Anderson, & Krathwohl, 2010) . Learners' analytical skills need to be honed in order that their HOT becomes improved so that they, as members of the generations to continue the nation, could improve their own quality in constructing innovation s in life and becoming qualified leaders in society. However, realities in the field indicate that the analytical skills are not yet sufficiently honed. Thinking analytically or analytic skill is a high level way of thinking. This skill is defined as wide use of thought to fine new challenges (Emi et al, 2013) . High level thinking also makes someone to apply new information or previous knowledge and manipulate information to obtain new answer (Heong, 2011) . According to Barnett & Francis (2012) , high level thinking can urge students to think deeply about one topic. Thinking analytically is a strong thinking tool to understand parts of situation, which is defined as foloows: 1) the ability to research and elaborate facts and thoughts into strenghts and weakn esses and 2) the ability to develop the capacity to think wisely and cleverly in solving the problems, analysing data, remembering, and using the information (Amer et al, 2005) . According to Elder dan Paul (2007), analysing and evaluating are introduced as important skills for all students to overcome the problem and give detail reasons. Learning aims to train the students to think analytically (decision making) and not thinking mechanically (routine) (Ministry of Education and Culture, 2013) . Analysing is one of the high cognitive abilities which is important to master by the students. Analytical skill can be meant as individual capability in mentioning parts of a problem and showing its part relation, seeing the causes of certain cases or giving arguments which support a statement. (Sudrajat, 2011) . Analytical skill is classified into three, which are differentiating, organizing, and attributing (Anderson & Krathwohl, 2001 ). According to Muryanto, et al (2016) analytical skill is students' ability to elaborate or separate a thing to its parts complete with the relation. Thinking analytically is developed by strategy which needs formalization and optimization of problem solving (Lieberman, 2010) . Brookhart (2010) implies that to measure students' thinking abi lity in separating information into several parts with reasons, the assignment must ask them to find and elaborate each question. They also have to find the correlation of each and serve a problem in which the answer needs further explanation. Analytical s kill means students are able to separate the topics into several main parts and describe the relation of each. Those can be correlated each other or as the whole structure (Kuswana, 2012) . According to Robbins (2011) thinking analytically is a series of ty pical actions but involving inquiry element and further situation with undefined result and parameter. Low analytical skill can be bad-damaged for whether short or long term. The short term will cause the result of students 'learning will be far from the l earning objectives (Johnson, 2014) .\nThis research aims to developing learning kit based on the Serukam local culture with problem based learning method in order to improve analytic skill of VII-grade students in Junior High School. The problembased learning is focused on problems in which students can construct their own knowledge, develop inquiry and thinking skills to a higher level. Students should be able to formulate a temporary answer to a problem requiring logical intelligence, courage and active solution with in real situation (Mulyanto. H, 2018) . Culture-based learning is a strategy that creates a learning environment and designs a learning experience which integrates culture as part of the learning process. Integrating cultural elements and local issues into learning is felt to be highly important because it could improve educational quality. Ther efore, the teacher needs to design a learning process by developing a learning kit with local culture as basis by means of raising environmental issues occurring around the students. The purpose of raising such issues is to enable the students to find the solutions by means of analysis so that their analytical skills improve. The purpose of the tryout in the field was to know whether there was a significant difference in average improvement of analytical skills between the learners participating in the lear ning using the learning kit with local culture as basis and those participating in the learning using the conventional learning kit ."}, {"section_title": "METHOD", "text": "The research was Research and Development (R&D) in design. The product developed in the research was in the form of a learning kit based on local culture for the purpose of improving students' analytical skills and caring attitude towards the environment . The learning kit developed consisted of RPP (Rencana Pelaksanaan Pembelajaran or 'the Learning Execution Plan or Lesson Plan'), LKPD (Lembar Kerja Peserta Didik or 'the Learners' Work Sheet'), the Analytical Skill Test Items. The development of the learning kit referred to the ADDIE model of R&D developed by Dick and Carey (2005) . Used in the research in modified form, it still had the five stages referred to by the letters A, D, D, I, and E, namely, (1) analysis, (2) design, (3) development, (4) implementation, and (5) evaluation. The stages in the development of the local-culturebased learning kit are as presented in Figure 1 . The analysis stage was a process of defining what the learners would study and it was done by making a school analysis, a learners' characteristic analysis, and a task analysis. The design stage was a designing activity divided into three specific activity types, namely, constructing an outline, determining the systematics, and designing the evaluation instrument . Then the development stage was conducted, divided into four sub-stages, namely, pre-writing, constructing the initial product (or the draft), editing, and revising. Next came the implementation stage, where, after the learning kit was produced, it was tested by applying it in class. The last stage was the evaluation stage, which was divided into two sub -stages, namely, formative evaluation and summative evaluation. The formative evaluation was done when processing the data resulting from the validation by experts acting as validators. The summative evaluation was done to the data resulting from the field testing of the learning kit .\nThe product testing design in the research covered three stages of execution, namely, (1) that done by two lecturers (university teachers) acting as consultant and expert to evaluate Draft I, (2) that done by two IPA teachers to evaluate Draft II with restricted testing, and (3) that done with field testing or large-scale testing. The design for the learning kit is as presented in Figure 2 . Figure 2 . Design of the Learning Kit The product in the form of the local-culture-based learning kit was divided into three parts, namely, the initial part, the content part, and the closing part. The initial part consisted of the kit cover , the preface, and the table of contents. The content part was divided into two sub -parts, namely, the learning kit, containing RPP and LKPD, and the evaluation kit, containing the analytical skill test, the students' environment-caring attitude observation sheet, and the students' environment-caring attitude questionnaire. The closing part contained the bibliography and the writers' biography ."}, {"section_title": "ANALYSIS", "text": "For quantitatively testing product effectiveness, the research used the pre-test post-test control group design (Sugiono,2014) . It is as shown in Figure 3 . Figure 3 . pre-test post-test control group design The specific testing design used in the research could be seen in Table 1 The research subjects contributing to the evaluation and testing of the product in the form of the learning kit were (1) two validators (the two lecturers) to evaluate the initial product (Draft 1), (2) the two IPA teachers to evaluate the revised initial product (Draft 2), and (3) students in Class VIIA (serving as experimental class) numbering 31 in all and those in Class VIIB (serving as control class) numbering 30 in all as participants in the field testing.\nThe instruments used in collecting data were (1) RPP, (2) LKPD, and (3) the analytical skill test instrument containing ten essay-type test items with differentiating, attributing, and organizing as indicators.\nThe data analysis in determining the fitness (or feasibility) for use of the learning kit was done via the following steps, (1) tabulating all the data obtained for each component of all the evaluation items provided in the evaluation instruments, (2) calculating the the total mean score for each component by using the following formula.\nin which x ̅ = mean score ∑ x = total score n = number of validators and (3) converting the mean score into grade with the criterion that for the purpose of knowing the quality of the kit development, the data originally in score form was converted into qualitative data (in the form of interval data) with four scales. The score conversion results could be seen in Table 2 . Mardapi, Djemari (2008) With the scores converted into categories as basis, the grade for the learning kit developed was obtained. The students' analytical skill scores were obtained by calculating the scores obtained by students through their answers to each item provided. Any improvement in the analytical skills of both the students in the experimental class and those in the control class on the whole was analyzed by using the normalized mean gain score determined by means of the following equation."}, {"section_title": "Gain =", "text": "final score −initial score maximum score −initial score Then the gain score was checked with the gain standard criteria presented in Table 3 .\nTabel 3. Gain Standard Criteria\nGain score Category g ≥ 0.7 High 0.3 < g < 0.7 Medium g ≤ 0.3 Low (Meltzer, 2002) , The data for the dependent variable already passing the prerequisite testing were analyzed with the independent sample t-test and α (the degree of significance) = 0.05. The hypothesis presented was stated as follows. H0: There is no significant difference in average improvement of environment -caring attitude between learners participating in learning conducted by using the learning kit with the Serukam local culture as basis and those participating in learning conducted by using a conventional learning kit. H1: There is a significant difference in average improvement of environment-caring attitude between learners participating in learning conducted by using the learning kit with the Serukam local culture as basis and those participating in learning conducted by using a conventional learning kit . The basis for decision making was stated as follows. If Sig. ≥ 0.05, then H0 is accepted and H1 is rejected. If Sig. < 0.05, then H0 is rejected and H1 is accepted."}, {"section_title": "RESULTS AND DISCUSSION", "text": ""}, {"section_title": "Product Fitness for Use", "text": "The validators in the validation stage were a lecturer of environmental science and a lecturer of chemistry education (both as lecturers expert in their respective subject matter) as well as two IPA teachers. The following presents the results of the validators' evaluation .\nResults of the RPP fitness evaluation by the lecturer experts and IPA teachers according to the criteria of fitness based on the aspect of validity indicated that it was very good in fitness with the final mean score from the validators being 3.55 and the grade being A so that the RPP fitness was very good in category. Results of the LKPD fitness evaluation by the lecturer experts and IPA teachers according to the criteria of fitness based on the aspect of validity indicated that the LKPD fitness got the grade A with the mean score being 3.53 so that it belonged to the category of being very good.\nResults of the Analytical Skill Test Item fitness evaluation by the lecturer experts and IPA teachers according to the criteria of fitness based on the aspect of validity indicated that the fitness got the grade A with the mean score being 3.73 so that it likewise belonged to the category of being very good. The data resulting from the analysis of the research product in the form of the learning kit were then converted into grades representing category ranges in Table 4 as follows. From Table 4 it could be known that the mean score from the lecturer experts was 3.7 with the grade being A referring to the category of being very good while that from the IPA teachers was 3.6 with the grade also being A referring to the category of being very good. The result diagram of learning kit validity by expert lecturers and science teachers are shown in Figure 4 and Figure 5 . S asmitatias,F. & Kuswanto,H.(2018) The development of science learning device based on Serukam local culture to improve students' analytic al skill. International Journal of Educational Research Review, 3(3), [59] [60] [61] [62] [63] [64] [65] [66] [67] [68] www.ijere.com As previously mentioned, the students involved in the field testing were divided into two groups, namely, the group in the class serving as experimental class consisting of 31 students and the group in the class serving as control class consisting of 30 students.\nThe result of product field trial is clear that there is an increase on students' analytical skill score both in experiment class and control class as written in Table 5 . Table 4 and Table 5 it could be known that the mean gain score for the analytical skills of the experimental class was 0.54 and that of the control class was 0.26. From the data it could be known that there was a significant difference in improvement of analytical skills between the experimental class and the control class.\nThe product effectiveness in improving students' analytical skill can be seen from comparing post -test score from control class and experiment class. The statistic test used is Independent Sample T-Tes. The significance score is 0.000 or < 0.05 thus Ho is refused. It can be concluded that learning device based on Serukam local culture is effective to improve students' analytical skill."}, {"section_title": "CONCLUSION", "text": "According to the data obtained and results of all the analyses above, it could be concluded that the local-culture-based learning kit developed in the research is fit (or feasible) to be used in the learning based on local culture conducted for SMP students of Grade VII and effective in being used to improve their analytical skills.\nIt is hoped that IPA teachers use the learning kit based on local culture during the learning process conducted at school. Such a learning kit is effective in being used to improve students' analytical skills. Students would also comprehend the lesson material with more ease if it is linked with the environment and culture in existence around them. The fitness and effectiveness of the IPA learning kit based on local culture here have already been tested so that it is suggested that teachers use it as alternative guide in the IPA learning conducted.\nIt is hoped that the local-culture-based IPA learning kit developed from the material about environmental pollution could be beneficially used to the maximum by IPA teachers as learning resource. Information concerning the effectiveness of the IPA learning kit based on local culture is still limited so that there is still opportunity for other researchers to further study the effectivenesspof thepIPA learning kit based on the Serukam local culture in relation with other basic competence."}]