[{"section_title": "Abstract", "text": "The computational cost required by the Ensemble Kalman Filter (EnKF) is much larger than that of some simpler assimilation schemes, such as Optimal Interpolation (OI) or three-dimension variational assimilation (3DVAR). Ensemble optimal interpolation (EnOI), a crudely simplified implementation of EnKF, is sometimes used as a substitute in some oceanic applications and requires much less computational time than EnKF. In this paper, to compromise between computational cost and dynamic covariance, we use the idea of \"dressing\" a small size dynamical ensemble with a larger number of static ensembles in order to form an approximate dynamic covariance. The term \"dressing\" means that a dynamical ensemble seed from model runs is perturbed by adding the anomalies of some static ensembles. This dressing EnKF (DrEnKF for short) scheme is tested in assimilation of real altimetry data in the Pacific using the HYbrid Coordinate Ocean Model (HYCOM) over a four-year period. Ten dynamical ensemble seeds are each dressed by 10 static ensemble members selected from a 100-member static ensemble. Results are compared to two EnKF assimilation runs that use 10 and 100 dynamical ensemble members. Both temperature and salinity fields from the DrEnKF and the EnKF are compared to observations from Argo floats and an OI SST dataset. The results show that the DrEnKF and the 100-member EnKF yield similar root mean square errors (RMSE) at every model level. Error covariance matrices from the DrEnKF and the 100-member EnKF are also compared and show good agreement."}, {"section_title": "Introduction", "text": "Ensemble-based data assimilation uses Monte Carlo model simulations in order to derive flowdependent forecast statistics and is applied, for instance, in operational weather prediction by the use of an ensemble forecast. Since the first introduction of the ensemble Kalman filter in an ocean model by Evensen (1994) , the method has gained considerable attention and has also been successfully applied in meteorology and other research fields (Hamill et al., 2001; Houtekamer and Mitchell, 2001; Rienecker, 2002, 2003; Natvik and Evensen, 2003; Leeuwenburgh, 2005) .\nPrevious studies showed that the ensemble size is one of the main factors influencing the quality of covariance estimates. Natvik and Evensen (2003) emphasized that too few members, e.g., less than 60-80, degraded the performance of the EnKF. Natvik and Evensen (2003) tried various ensemble sizes from 20 to 100 in a high-dimensional non-linear system. An ensemble of 100 members was sufficient in their exper-iments and in other applications, e.g., Lisaeter et al. (2003) . However, running 100 members multiplies the computational costs by a factor of 100 with respect to that of a single model run, which prevents use in applications that are large-scale and/or high-resolution. To reduce computational costs, we consider the reduction of the number of ensemble members based on a hybridation of the Optimal Interpolation (OI) and Ensemble Kalman Filter (EnKF) approaches. Evensen (2003) proposed a sub-optimal EnKF approach similar to OI and called this Ensemble Optimal Interpolation (EnOI). EnOI and EnKF experiments have been discussed in Wan (2006) , which agree with the findings of the twin experiment by Leeuwenburgh (2005) and the results of Durand et al. (2003) for the ability of satellite data assimilation to correct ocean fields below the mixed layer.\nA dynamical ensemble quantifies the model uncertainty but is inevitably limited by a finite ensemble size, by the approximate definition of model errors (often limited to errors in the model forcing) and the initial state errors. The ensemble is thus confined into a subspace of small dimensions and subject to bias. One way to compensate for bias is to add perturbations from a subspace of larger dimension to each dynamical ensemble member during the model integration. In the context of ensemble forecasting, Roulston and Smith (2003) bring forward the so-called \"best member method\", a method for producing ensemble by \"dressing\" a single forecast with historical error statistics. The skills of the resulting hybrid ensembles in probabilistic forecasts are superior to those of ensembles generated statistically around the best guess forecast. The best member method is applicable to all types of ensembles, and in particular to ensemblebased data assimilation techniques.\nIn this work, we make an initial attempt to apply the \"dressing\" idea outside of the numerical weather ensemble forecasting context, to test its performance in assimilating realistic data in the Pacific Ocean using a HYbrid Coordinate Ocean Model (HYCOM). In the dressing approach following Roulston and Smith (2003) and Wang and Bishop (2005) , the dressing is done by a dynamical ensemble of the model state and a static ensemble of observations of the atmosphere. Due to the lack of comprehensive observations in the ocean (mostly temperature sections before 1992, sea surface height anomalies after 1992, and temperature and salinity profiles after 2000), we rather use a collection of states from a long model integration as the static ensemble.\nOur main motivation is to explore the feasibility, efficiency and reliability of such an ocean data assimilation scheme. The Dressed EnKF (DrEnKF for short) experiment is compared to two standard EnKF experiments that use 10 and 100 members, and to the free running model. The paper is arranged as follows. In section 2, the DrEnKF method is described. Section 3 gives a brief introduction to the HYCOM model and the experimental design. In section 4, we discuss the experimental results. Section 5 gives the conclusions."}, {"section_title": "Dressing the ensemble Kalman filter", "text": ""}, {"section_title": "Dressed ensemble generation", "text": "Dynamical ensembles are constructed using a forward model integration to quantify the state dependence of the prediction errors. The atmosphere is so chaotic that it is often sufficient to add small perturbations to the observations assimilated to ensure divergence of the ensemble forecast. In ocean physics, the temporal scales are much longer and we rather assume that inaccuracy in an initial snapshot can be attributed to a displacement of the isopycnal vertical coordinates. We sample the initial ensemble by perturbing the layer interfaces from a model snapshot in equilibrium and the initial ensemble is then integrated forward with model errors in the atmospheric forcing fields to build up the multivariate covariances. The method for generating perturbations is reported in Evensen (2003) and Natvik and Evensen (2003) .\nThe seed dynamical ensemble state vectors are stored in a matrix, also known as the \"father\" ensemble matrix, with each member denoted as x i ∈ R,\nHere, M is the size of the dynamical ensemble and n is the model state dimension. We write the ensemble mean and ensemble anomalies as\nThe static or stationary ensemble is sampled from snapshots of a long model run. The static ensemble matrix is defined as\nwhere N is the number of model snapshots of the model states. N is an integer multiple of M (i.e., N = pM , p>1). The mean and anomaly of the static ensemble are given as\nThen we can define the dressed ensemble by adding static anomalies to a dynamical ensemble member:\nHere, F * ∈ R n×N is is the result of p concatenations of the matrix F , with same total size as S . The ensemble S +F * is called the \"daughter\" ensemble here.\nThe relative weights of the \"father\" and \"daughter\" ensembles are therefore equivalent in the resulting covariance matrix. This has been chosen arbitrarily to ensure their respective variance of Sea Level Anomaly (SLA) is similar."}, {"section_title": "Forecast covariance and analysis scheme", "text": "The covariance matrix P e ∈ R n×n is calculated using the M + N ensembles as:\nIf the dynamic and static anomalies F and S are uncorrelated, we obtain\nHere, P F e and P S e are, respectively, the ensemble covariance matrices for the \"father\" and \"daughter\" ensembles. We expect, therefore, that the DrEnKF has a larger spread than the small size dynamical ensemble, since a small ensemble tends to underestimate the variance. The comparison with the large size EnKF is not a prior. The impacts of cross-terms on the multivariate covariances are not obvious.\nThe observations are perturbed to form an ensemble of observations, with specified observation error statistics. There are two goals: one is to to the standard EnKF ensemble update algorithm (Burgers et al., 1998) , the second is to consider the storage in squareroot form of a large observation error covariance matrix R (of size with m×m, the number of observations m being of the order of 200 000 in our case). We note two matrices of perturbed observations. The first one has the dimension of the \"father\" ensemble\nThe second matrix is the ensemble representation of\nThe size of this ensemble is arbitrary, and we have chosen the same size as the \"daughter\" ensemble for convenience. The approximate observation error covariance matrix is\nWe use the standard analysis equation to update the \"father\" ensemble only:\nIn the DrEnKF scheme, only the \"father\" ensemble F is updated. The static ensemble S is only used to calculate the forecast covariance and is not updated.\nHere, H is the observation operator. The Kalman gain is defined as\nThe detailed algorithm of the Kalman gain is following the formulation referred as \"analysis2\" in Evensen (2004) . The perturbed observations introduce sampling errors, particularly for small ensembles (Whitaker and Hamill, 2002) . There are number of square-root implementations proposed (Anderson, 2001; Evensen, 2004; Sakov and Oke, 2008) . In this study, we do not experience ensemble collapse even though the \"father\" ensemble has very small size (N = 10). The use of a static ensemble has possibly prevented the ensemble from collapse. The implementation of a square root scheme would have been similarly simple and should be evaluated in future work."}, {"section_title": "Computational cost", "text": "The DrEnKF is implemented here in a way that saves considerable computational cost. The size of the \"daughter\" ensemble N is similar to usual EnKF applications, but the size of the \"father\" ensemble M is smaller, and only the latter is integrated into the model. The propagation is thus cheaper in the present implementation of the DrEnKF. Using the analysis scheme from Burgers et al. (1998) the computational cost of the analysis is approximately nN N for an Nmember EnKF approach. The update cost of DrEnKF (M \"father\" ensemble members, N \"daughter\" ensemble members) is nM (M + N ). If M is much smaller than N , the update cost of DrEnKF is also reduced. Hence, from both the model integration and update aspects, DrEnKF can save computational cost dramatically if we can keep the size of the \"father\" ensemble small."}, {"section_title": "Experimental design and preparation", "text": ""}, {"section_title": "Model", "text": "The data assimilation experiments use a Pacific Ocean implementation of HYCOM (Bleck, 2002) , a primitive equation, general circulation model with hybrid vertical coordinate."}, {"section_title": "The model domain covers the area from 28", "text": "• S-52\n• N, 95\nThe grid is generated by conformal mapping (Bentsen et al., 1999) , and has horizontal resolution between 42 km and 72 km (roughly half a degree). The present implementation uses 22 hybrid isopycnal and z-level coordinates, the 10 top layers using a linear increase of density and the last 12 layers an exponential increase. The range of the potential densities (σ is the potential density in each layer) varies from 18.00 kg m −3 to 27.84 kg m 3 . The model prognostic variables include 3-dimensional temperature, salinity, layer thickness, and velocity, as well as the barotropic velocity and pressure fields. All prognostic variables are updated within the assimilation process.\nThe model is forced by atmospheric forcing fields from the European Center for Medium-Range Weather Forecasting (ECMWF) reanalysis. The highfrequency synoptic forcings used were temperature, winds, and relative humidity determined from dewpoint temperatures. Clouds and precipitations are based on the climatology of the Comprehensive Ocean and Atmosphere Dataset (COADS) and precipitation from Legates et al. (1990) . \"Closed\" boundaries in the north and south have their salinities and temperatures relaxed to the Generalized Digital Environmental Model (GDEM) climatology (Teague et al., 1990) , with a common relaxation time scale of 100 days over 15 grids cells. River input is modeled as a negative salinity flux, and there are 13 river sources used in the Pacific simulation."}, {"section_title": "Experiment design", "text": "We carry out three data assimilation experiments using the DrEnKF, the 10-member EnKF, and the 100-member EnKF. Both schemes assimilate sea surface height (SSH) over the Pacific Ocean.\nThe static ensemble of model snapshots is based on a control run from 1 January 1981 to 31 December 2001, of size N = 100. The seasonality has been removed from the static ensemble. The dynamical ensemble is initialized following the optimal sample of Wan et al. (2008) , with 10 and 100 members for EnKF experiments and 10 for the DrEnKF. We randomly select 10 members of the static ensemble anomalies and add them to each dynamical member.\nWe simulate the model errors affecting the evolution of the ensemble members by generating random fields added to the ECMWF atmospheric forcing fields as outlined in Evensen (2003) . The spatial correlation depends on the given spatial scale (also called decorrelation scale) and typical grid size, while the temporal correlation is formed by a Markov process with a sequence of time-correlated pseudorandom fields with mean equal to zero and variance equal to 1. The set up of these errors follows Wan (2006) and detailed parameters are given in Table 1 . Figure 1 shows the correlation coefficients of SST relative to the grid point (33\n• N, 137\n• E) in the main axis of the Kuroshio Current sampled from the dynamical ensemble created by the EnKF experiment (100 members), the EnKF experiment (10 members), static ensemble (100 members), and dressed ensemble (110 members) created by the DrEnKF experiment, respectively. There are very weak long range correlations from the EnKF experiment using 100 members. The static ensemble generates more long range correlations than the EnKF. For the 10-member EnKF, because of the small size of its ensemble, high pseudo correlations exist in many regions. Once a dressed ensemble was created, many pseudo correlations disappeared, and the magnitude of pseudo correlation becomes smaller. However for realistic applications such as this one, the localization can help to remove remaining long range correlations. More discussions of localization and filtering of long range correlations are reported by Hamill et al. (2001) , Mitchell et al. (2002) and Oke et al. (2006) .\nIt is necessary to use localization to avoid the problem caused by obvious long range correlations. It uses only observations within certain circle around a grid to update the model state at a given grid point. We use a local analysis scheme that makes analysis of a grid point using a maximum of 49 observations within 700 km distance, and this has been applied in both of the two experiments. The time window of the two experiments is the same, i.e., from 1 January 2002 to 31 December 2005."}, {"section_title": "Data", "text": "Observational data used in the assimilation experiments are SSH satellite data sets merged from different satellites, e.g., TOPEX/Poseidon, Jason-1, ENVISAT, etc. The spatial resolution of the data sets is (1/3)\n• and the temporal resolution is one week. The data sets are provided by Collecte Localisation Satellites (CLS).\nThe temperature and salinity profiles from Argo floats and Optimum Interpolation Sea Surface Temperature (OISST) (Reynolds et al., 2002) are used to validate the performances of the two experiments. The OISST data set is produced at the National Oceanic and Atmospheric Administration (NOAA) using both in situ and satellite data, which is weekly on a onedegree grid. The Argo floats carry out continuous monitoring of the temperature and salinity from the sea surface down to 1000 m or 2000 m Carval et al. (2006) . We used all available (17354) temperature/salinity profiles in delayed mode within the model "}, {"section_title": "Overall performance", "text": "In this part, we first compare the EnKF error estimate against OISST to monitor the evolution of the ensemble with the Root Mean Square Errors (RMSE). Figure 2 displays them over the four-year experiment. For both experiments, the ensembles are timedependent and the spread is fluctuating. The curves show no visible trend over four years-neither growing nor shrinking. The three time series of EnKF and DrEnKF show a faint seasonal cycle, the error being slightly larger during winter than summer. The spread of the 10-member EnKF looks obviously divergent, which leads to an overestimate of the error background. This cycle appears both in the error estimate and in the RMS errors, indicating that the evolution of model errors is realistic. Since the heat fluxes are dependent on winds, it is also logical that the model errors are more efficient, and therefore the ensemble spread of DrEnKF is larger than that of the 100-member EnKF to avoid error underestimate by the small dynamical ensemble.\nThe overall performances of the 100-member EnKF and the DrEnKF are summarized in Table 2 . Root mean square (RMS) errors over the model domain and experiment time window for the temperature and salinity fields from the EnKF and the DrEnKF at different model levels are calculated by comparing them to Argo observations, and the SST is compared to OISST. Argo floats are inhomogeneous in their spatial and temporal sampling. So, we interpolated the model results to the locations of Argo floats. The comparisons are only computed for the top 14 model layers because of insufficient observations in deep waters. While for OISST was originally mapped weekly on a one-degree grid, we interpolated it's grid to the model grid. The RMS errors of the free running model (without assimilation) are also shown.\nIn the 100-member EnKF experiment, the RMS error of temperature is reduced by 0.08\n• C and that of salinity by 0.091 psu at the surface, while in the DrEnKF experiment, RMS error of salinity is reduced by 0.06\n• C and 0.094 psu at the surface. In the surface layer, the EnKF reduces the errors by 14.2% for temperature and 33.3% for salinity, while the reduction by the DrEnKF is 10.3% for temperature and 34.8% for salinity. In the mixed layer, a reduction of temperature and salinity errors is observed in the both experiments. Weaker but non-negligible reductions of RMS errors are observed in the thermocline for both experiments, indicating that none of the assimilation experiments have a strong impact in the thermocline, but still tend to improve the results. It is also comforting that the assimilation imbalances do not severely affect the stability of the water column and do interfere with deep water mass properties. The results of the DrEnKF are surprisingly close to those of the EnKF.\nThe evolution of the Root Mean Square Error (RMSE) over four years of the DrEnKF experiment and the 100-member EnKF experiment is shown in Fig. 3 . We select three layers: the surface layer (top 3 meters in the model), the model layer with potential density 24.00 kg m −3 (representative of the bottom of the mixed layer), and the layer with potential density 27.02 kg m −3 (located below the thermocline). Figures 3a , c, and e show RMS errors of temperature in different layers, while Figs. 3b, d , and f are those of salinity. It is obvious that the RMS errors of temperature and salinity in the two assimilation experiments are smaller than those of the free running experiment in the three layers. In the surface and the intermediate layer (σ = 24.00 kg m −3 ), the DrEnKF has RMS errors close to those of the EnKF. During a few periods, DrEnKF performs even better than EnKF. In the deep layer (σ = 27.02 kg m −3 ), the EnKF and DrEnKF yield the similar RMS errors. (Fig. 4c is for the dynamical ensemble, Fig. 4d is for the dressing ensemble). In Fig. 4b , the large standard deviation located in more areas in the North Pacific, which brings an overestimate of the background errors in these areas. In Fig. 4c , there is large standard deviation located in Northwest Pacific and East Equatorial Pacific, while the results of the \"father\" ensemble in DrEnKF only show a large spread only in the Northwest Pacific. After dressing, the location of the maximum agrees better, especially along the East Equatorial Pacific. Moreover, the magnitude of the ensemble spread is increased. For temperature and salinity in deep layers, we have also compared the standard deviation (figures not shown) of the two assimilation experiments, and found the DrEnKF can effectively account for residual errors and realize the time-dependence of error statistics. The DrEnKF reproduces the large scale correlation structures of SST. The assimilation of altimeter data improves the water mass properties only if the multivariate correlations are physically consistent. The validation we present in Fig. 4 has not been reported before to our knowledge."}, {"section_title": "Specific aspects of the DrEnKF", "text": "Near the thermocline, Fig. 5 gives a snapshot of the comparison between ensemble spread and the difference between ensemble mean and observation. Because of the sparseness of Argo floats, we select a small region (10\n• E-160 • W, which is similar to the region3 in Wan, 2006 ) on a typical date (25 August 2004) to calculate the RMS errors before and after assimilation in the 100-member EnKF and DrEnKF experiments. Ideally, the ensemble spread should be comparable to the RMS errors. Since the model errors are only affecting the sea surface, the errors introduced initially in the interior ocean are difficult to sustain. Near the surface, the ensemble spread is comparable to the RMS errors, but between the bottom of the mixed layer and the thermocline, it is underestimated for all methods. The spread is larger in the DrEnKF than in the EnKF through all the depths, mostly due to the addition of the spread of the static ensemble. Therefore, DrEnKF performs with results close to the EnKF and better than the EnKF sometime. However, treatment of model errors below the mixed layer is still a key issue to be focused on in subsequent model revisions."}, {"section_title": "Conclusions", "text": "Two data assimilation experiments (EnKF and DrEnKF) are compared and assessed against a free running model experiment. The DrEnKF is a new attempt stemming from state-of-the-art methodology in ensemble atmospheric forecasting, intended to save computing costs and add residual errors. Both methods assimilate real altimetry data into a HYCOM The idea of a \"dressing\" ensemble is the combination of a dynamical ensemble with a small size (here 10 members) and a static ensemble. The aim of the paper is to evaluate whether this idea could be a way to reduce the computational costs of the large number of members required for EnKF. We show that the DrEnKF is stable over an integration period of 4 years and reproduces the temporal variations of the error similarly to the EnKF. It is efficiently projecting the influence of the assimilated sea surface heights into the interior of the ocean, although with slightly less success than a large-membered EnKF. The DrEnKF avoids the underestimation of errors as expected with a dynamical ensemble of small size. The analysis of ensemble spread shows it is able to locate the horizontal patterns of the error variance as in a large-membered EnKF, and produces larger ensemble spread than the large-membered EnKF across the whole basin and at all observed depths of the ocean. The EnKF and DrEnKF, however, both underestimate the errors between the bottom of the mixed layer and the thermocline, which indicates that the addition of a static ensemble does not necessarily compensate for insufficient model accuracy, and neither does it compensate for possible model biases. Further research should therefore pursue improvement of model errors and robustness against model biases.\nIn the present work, the dynamical and static ensembles have approximately the same weight and we have not attempted to tune their respective contributions. There are, however, several ways to generate a dressing ensemble such that the ensemble spread matches closely some targeted error statistics. Wang and Bishop (2005) propose a refinement of the method based on seasonal statistics that could also be used to refine this study."}]