[{"section_title": "Abstract", "text": "Abstract\nThis paper presents a H-infinity synthesis with pole clustering based on"}, {"section_title": "Introduction", "text": "Normally, the uncontrolled free surface of liquid has an inclination to undergo large excursions, even for a very small movement of the container. Consequently, liquid sloshing has been a serious problem in many cases. For example, in the ship industries, the dynamic behavior of a vessel at sea is alarmingly troubled by the dynamics of moving partly filled tanks carried onboard [1] . However, controlling liquid slosh still faces plentiful degrees of difficulties that need to be considered before they can be used in much in everyday real-life applications. Feedback control or closed-loop control, which is well known to be less sensitive to disturbances and parameter variations, has been implemented for reducing the liquid slosh. These include active force control (AFC) [2] , PID control [3] [4] [5] , H-infinity control [6] , sliding mode control [7] , Variable Gain Super-twisting Algorithm (VGSTA) for output feedback control [8] , hybrid fuzzy-PID controller [9] , single input fuzzy logic controller [10] and data-driven PID tuning using SPSA algorithm [11] .\nIn this study, H-infinity synthesis with pole clustering based on LMI techniques is used to control the liquid tank so that it can reach a desired position or track a prescribed trajectory accurately with minimum sloshing of liquid. The reason for choosing H-infinity synthesis is because of its good performance in handling with various types of control objectives such as disturbance cancellation, robust stabilization of uncertain systems, input tracking capability or shaping of the open-loop response. Nevertheless, the weakness of H-infinity controller is in handling with transient response behavior and closed-loop pole location instead of frequency aspects [12] . As we all know, a good time response specifications and closed-loop damping of liquid tank system can be achieved by forcing the closed-loop poles to the left-half plane. Moreover, many literatures have proved that H-infinity synthesis can be formulated as a convex optimization problem involving linear matrix inequalities (LMI) [13] [14] [15] . In this case, the normal Riccati equation with inequality condition was used. This behavior will give wide range of 2637 flexibility in combining several constraints on the closed loop system. This flexible nature of LMI schemes can be used to handle H-infinity controller with pole placement constraints. In this work, the pole placement constraints will refer directly to regional pole placement [16] . It is slightly difference with point-wise pole placement, where poles are assigned to specific locations in the complex plane based on specific desired time response specifications. In this case, the closed-loop poles of liquid slosh model are confined in a suitable region of the complex plane. This region consists of wide variety of useful clustering area such as half-planes, disks, sectors, vertical/horizontal strips, and any intersection thereof [16] . Using LMI approach, the regional pole placement known as LMI region combined with design objective in H-infinity controller should guarantee a fast input tracking capability with very minimal liquid slosh. H-infinity controller has been proven to be robust and tremendously beneficial in many linear and non-linear applications such as [17] [18] [19] [20] [21] [22] [23] , however, for liquid slosh suppression are still lacking. The objective of the design is to actuate the system to a certain cart position with minimal slosh angle. The brief outline of this paper is as follows. In section 2, the liquid slosh model is described. In section 3, the H-infinity with LMI region method is explained. Simulation results and discussion are presented in section 4. Finally, some concluding remarks are given in section 5."}, {"section_title": "Liquid Slosh Model", "text": "A liquid slosh model in [24] that performing rectilinear motion as shown in Figure 1 is considered. Herein, a sloshing liquid modeled by a simple pendulum having a slosh mass, and length, is considered. Pendulum angle, represents the slosh angle. The system is like a moving rigid mass coupled with a simple pendulum as shown in Figure 2 . The Euler-Lagrange equations in and , which produce dynamic equations of the system, is given by Therefore, the control objective is to suppress the slosh angle in a moving tank while achieving a desired position . The system parameters are depicted in Table 1 . Note that these parameters depend on the liquid fill ratio, tank geometry and liquid characteristics. These parameters have been identified using a quick-stop experiment as reported in [25] . In (1) and (2) can be express in state space representation as follow [7] : "}, {"section_title": "Design of H-infinity Controller with LMI Region", "text": "In this study, an integral state feedback control is used as a platform to design the proposed controller. The block diagram of integral state feedback control is shown in Figure 3 . \nnext, at the steady state condition as\n, the state space equation can be written in the following form\nby subtracting (10) to (11), the state space form is converted to\nwhere\nthen, the new control input function is described as follow\nfinally, a closed loop state space equation with controller gain, K can be obtained below\nwhere\nand is exogenous input disturbance or reference input to the system. Let ( ) denote the closed loop transfer function from to y under state feedback control = . Then, for a prescribed closed loop H-infinity performance > 0, our constrained H∞ problem consists of finding a state feedback gain K that fulfil the following objectives: − The closed loop poles are required to lie in some LMI stability region D contained in the left-half plane − Guarantees the H∞ performance ‖ ‖ ∞ < The advantages of placing the closed loop poles to this region are the liquid slosh response ensures a minimum decay rate  , a minimum damping ratio = , and a maximum undamped natural frequency = [10] . In this study, the entire LMI problem is solved using well known LMI optimization software which is LMI Control Toolbox. "}, {"section_title": "Results and Analysis", "text": "In this section, the proposed control scheme is implemented and tested within simulation environment of the liquid tank system and the corresponding results are presented. The simulation results are considered as the system response under liquid tank motion control and will be used to evaluate the performance of the proposed control scheme. The performances of the control schemes are assessed in terms of input tracking capability and liquid slosh suppression in time domain. Zero initial conditions were considered with a step input of 0.5 meter.\nThe parameter of conic sectors and disk that fulfil the design requirement is at = 2.5, = −1.5 and = 28 ∘ . Then, the state feedback gain, K is obtained as followed:\n= [-0.5657 -0.5433 -11.8487 -0.9802 0.2378] with = 27.742. This state feedback gain also guarantees the H∞ performance ‖ ‖ ∞ < . The result shows that the location of poles has been confined in the selected LMI region as shown in Figure 4 with the value of -2.2062, -2.3100 ± j0.7825 and -1.6022 ± j0.4701. As a comparative assessment, the proposed control scheme is compared with hybrid model-free fuzzy-PID controller with derivative filter reported in the previous literature [9] .\nThe simulation response of cart position, slosh angle, slosh rate and control input are depicted in Figures 5-8 respectively. Figure 5 shows that the tank settles to the desired position (0.5 m) in about 5.5s for H-infinity controller while for fuzzy-PIDF is 7.5s. As we can see, the rise time for H-infinity controller and fuzzy-PIDF controller is 2.6s and 3.5s, respectively. It is noted that, no overshoot occurred for both controllers. However, a noticeable amount of liquid slosh occurs during the movement of the cart. Slosh is regulated nicely, as shown in Figure 6 and Figure 7 for both controllers. The slosh is settles within 6 s for H-infinity controller while for fuzzy-PIDF controller, the slosh is settles within 8s. Fuzzy-PIDF has a bigger slosh with a maximum residual of ±0.1 radian compared to H-infinity with only ±0.012 radian as shown in Figure 6 . From the Figure 7 , H-infinity controller has a better slosh rate with maximum residual ±0.021 radian/sec as compared to fuzzy-PIDF with ±1.1 radian/sec. Figure 8 shows the necessary control efforts. The control signal overshoots for a very short period (0.5s) when there is a step change in the command signal. The H-infinity has a less overshoot with 0.19 Newton compared to fuzzy-PIDF with 12.5 Newton and both control inputs are settles at 4s. Hence, we can confirm that the H-infinity with LMi region has a good potential in reducing the liquid slosh while maintaining the desired cart position. The control performance for both controllers is summarize in Table 2 . "}, {"section_title": "Conclusion", "text": "In this study, the development of H-infinity synthesis with pole clustering based on LMI region schemes for liquid slosh suppression has been presented. The proposed method has been tested to liquid slosh model. To show the superiority of proposed control scheme, results are compared with hybrid fuzzy-PIDF controller. It is noted that significant improvements are obtained with H-infinity with LMI region controller. The simulation results demonstrate that the proposed control approach yields a minimal liquid slosh while achieving the desired cart position. From above analysis and discussion it is assured that the proposed control technique may become a suitable controller for solving the liquid slosh problem in aforementioned industries. Further investigation and experimentation for an online technique might be investigate using a motor-driven liquid slosh experimental rig."}]