[{"section_title": "Introduction", "text": "Over the last decades, an increasing number of lipids from marine environments has been identified and linked to their natural sources, and some of them are now being used as proxies for past climate conditions (e.g. Eglinton and Eglinton, 2008 and references therein). Long chain alkyl diols form one group with high biomarker potential; after their discovery in the Black Sea (De Leeuw et al., 1981), they have been identified widespread in Quaternary sediments from low to high latitudes (Versteegh et al., 1997;2000 and references therein). Cultured marine and freshwater eustigmatophyte algae produce series of long chain alkyl diols, consisting mainly of C28 -C32 1,13-and 1,15-diols (Volkman et al., 1999;. In the environment, a recent study on lipids and 18s rRNA genes in a freshwater lake has shown that long chain alkyl diols are produced by eustigmatophytes in the surface waters of the lake (Villanueva et al., 2014). However, the role of eustigmatophytes as a source of marine long chain alkyl diols remains unclear. Reports of eustigmatophyte algae in marine environments are sparse and the long chain alkyl diol composition of marine eustigmatophytes does not match those of marine sediments (Volkman et al., 1992;Versteegh et al., 1997;Rampen et al., 2012). Despite uncertainties concerning their sources, recent work has indicated a strong correlation between sea surface temperatures (SST) and the fractional abundances of C28 1,13-, C30 1,13-and C30 1,15-diols in marine sediments. Based on this, a new temperature proxy, i.e. the long chain diol index (LDI), which expresses the C30 1,15-diol abundance relative to those of C28 1,13-, C30 1,13-and C30 1,15-diols, was introduced (Rampen et al., 2012). A strong correlation (R-value of 0.984 and p-value of <0.001) between the LDI and SST was observed. Besides 1,13-and 1,15-diols, long chain 1,14-alkyl diols are commonly reported in marine sediments. Sinninghe Damsté et al. (2003) and Rampen et al. (2007) showed that cultivated Proboscia diatoms produce both saturated and mono-unsaturated C28 and C30 1,14-diols, and in addition, saturated C28, C30 and C32 1,14-diols were recently reported in the marine Dictyochophyte Apedinella radians (Rampen et al., 2011). Sediment trap studies confirmed Proboscia diatoms being a likely source for long chain 1,14-alkyl diols, particularly in upwelling areas (Rampen et al., 2008), whereas the importance of Apedinella as a source for sedimentary long chain 1,14-alkyl diols remains uncertain (Rampen et al., 2011). These sources may be distinguished based on the occurrence of certain diols: C32 1,14-diols may be useful as an indicator for Apedinella input, as they are produced by Apedinella radians and were absent from the 8 cultures of Proboscia spp. analyzed to date. Mono-unsaturated long chain 1,14-alkyl diols, on the other hand, may indicate Proboscia as a source, as these lipids have been identified in Proboscia cultures but not in Apedinella. We previously reported that the chain length distribution and degree of saturation of long chain 1,14-alkyl diols in Proboscia cultures are related to growth temperature, indicating the potential of these diols to be used as a tool for reconstructing SST (Rampen et al., 2009). Changes in the chain length and degree of unsaturation of lipids are known adaptation mechanisms for bacteria, yeast, fungi and algae to changing environmental conditions (e.g. Russell and Fukunaga, 1990;Suutari and Laakso, 1994) and the following two indices, the Diol Chain length Index (DCI) and the Diol Saturation Index (DSI), were used to quantify the chain length distribution and degree of saturation of long chain diols: However, application of these indices using surface sediments from the eastern South Atlantic Ocean showed only a moderate correlation of DCI with annual mean SST, while no correlation was observed between DSI and SST (R-values of 0.72 and 0.55 and p-values <0.001 and 0.535, respectively; Rampen et al., 2009). It was suggested that factors other than temperature could also play a role, indicating that more data was required to validate the use of long chain 1,14-alkyl diols as a proxy for temperature. Proboscia diatoms are often abundant in nutrient-rich environments like upwelling areas (Hernández-Becerril, 1995;Koning et al., 2001;Lange et al., 1998;Smith, 2001) and their lipids may, therefore, be useful as tracers for these conditions. Indeed, sediment trap studies showed that, in the Arabian Sea, long chain 1,14-alkyl diols were found almost exclusively under upwelling conditions (Rampen et al., 2008;, whereas such a relationship was not observed for long chain 1,15-and 1,13-diols. Following this, Diol Index 1 was introduced: Diol Index 1 has been used as a proxy for upwelling in the Arabian Sea (Rampen et al., 2008), the Benguela Upwelling System (Pancost et al., 2009), the Eastern Equatorial Pacific (Seki et al., 2012), offshore Southeastern Australia (Lopes dos Santos et al., 2012) and the westernmost Mediterranean (Nieto-Moreno et al., 2013). Proboscia diatoms are also abundant in Antarctic waters and lipid analyses confirmed the presence of C28 and C30 1,14-diols in a sediment core from the Western Bransfield Basin (Willmott et al., 2010). However, unlike the Arabian Sea, C30 1,15-diol concentrations are low, whereas C28 and C30 1,13-diols are more abundant in this area, and consequently Willmott et al. (2010) introduced the Diol Index 2 to reconstruct upwelling of nutrient rich Upper Circumpolar Deep Water in the Western Bransfield Basin: Diol Index 2 = [saturated C28 + C30 1,14-diol] / ([saturated C28 + C30 1,14-diol] + [saturated How widely applicable these long chain alkyl diol indices are as tracers for upwelling and nutrient rich conditions is unknown. In a study of Pliocene sediments from the Benguela Upwelling System, Pancost et al. (2009) observed both periods in which trends in 1,14-diol abundances and Diol Index 1 were consistent with those of other productivity markers, and periods where they differed. Contreras et al. (2010) related the increasing abundance of the C28 1,14-diol in the Peruvian upwelling system during the last interglacial to enhanced stratification, the abundance being low during periods with presumed strengthened upwelling. In addition, several studies reported high Proboscia diatom abundance under stratified rather than upwelling conditions (e.g. Table 1). Hence, perhaps the Diol Indices should rather be used as indicators for Proboscia productivity, which can be linked to different environmental conditions depending on the region studied. To constrain the applicability of long chain 1,14-alkyl diols as indicators for temperature, upwelling/nutrient availability and other climate conditions, we have analyzed the long chain alkyl diol distributions in a comprehensive set of marine surface sediments (n = 209), previously studied for long chain 1,13-and 1,15-alkyl diols (Rampen et al., 2012), and compared various long chain 1,14-alkyl diol indices with environmental parameters of the overlaying surface waters, such as temperature, salinity, nutrient concentrations, stratification and mixed layer depths."}, {"section_title": "Methodology", "text": "We analyzed 209 marine surface sediments, globally distributed, although mostly from the North and South Atlantic Oceans ( Fig. 1 and Supplementary Material). Long chain alkyl diol fractions were obtained and analyzed as described by Rampen et al. (2012). Briefly, sediments were extracted using accelerated solvent extraction (ASE) using a DIONEX 200 instrument with a mixture of dichloromethane (DCM) and methanol (MeOH) (9:1; v:v) at 100°C and 7-8 × 10 6 Pa. For a selected set of samples, the ASE extracts were subsequently saponified with 6% KOH, according to De Leeuw et al. (1983), to release extractable ester-bound long-chain alkyl diols. Extracts and saponified extracts were separated into apolar and polar fractions using a pipette column filled with activated alumina and elution with hexane/DCM (9:1; v:v) and DCM/ MeOH (1:1; v:v), respectively, or into apolar, keto and polar fractions using a pipette column filled with silica-gel (silica 60) with hexane, hexane/DCM (1:4; v:v) and DCM/MeOH (1:1; v:v), respectively. The polar fraction was analyzed, after silylation of alcohols to the trimethyl silyl (TMS) derivatives, with gas chromatography-mass spectrometry (GC-MS). Fractional abundances of the long chain alkyl diols were calculated from relevant peak areas of mass chromatograms obtained using selected ion monitoring (SIM) of m/z 299, 313, 327, 341 and 355, which represent characteristic fragment ions of the relevant diols (Versteegh et al., 1997). Differences in the contribution of the selected ions to the total mass spectra (m/z 50-800) of saturated and unsaturated long chain alkyl diols were taken into account as described by Rampen et al. (2009). The long chain alkyl diol data were compared with temperature and salinity data from the 0.25° grid 2001 World Ocean Database (WOA; Boyer et al., 2005), nitrate, phosphate and silicate concentrations from the 1° grid 2009 WOA (Levitus, 2010), chlorophyll abundance from the 1° grid 2001 WOA (Levitus, 2002), and with mixed layer depth data (defined as the depth at which the temperature differs more than 0.5°C from the ocean surface temperature), obtained from the 1° grid 1994 WOA (Monterey and Levitus, 1997)."}, {"section_title": "Results and discussion", "text": "Surface sediments (generally 0 -1 cm) were obtained at locations with water depths ranging from ca. 20 to ca. 6000 m and a large range in annual mean SST (-1.8 -28.8°C), annual mean salinity (6.8 -37.0), nutrient concentrations, chlorophyll content (0 -280 µg/L) and mixed layer depth (0.1 -65 m) (see Supplementary Table 2). 187 sediments of this set (89%) contained quantifiable (i.e. signal to noise ratio > 10) 1,13-and/or 1,15-alkyl diols, together with 1,14-alkyl diols, although unsaturated long chain 1,14-alkyl diols were only detected in 146 sediments (70%). One sediment contained quantifiable amounts of long chain 1,13-and 1,15-alkyl diols without detectable amounts of long chain 1,14-alkyl diols. The observed chain lengths were C28 and C30 for 1,13-and 1,14-alkyl diols, and C30 and C32 for 1,15-alkyl diols. The C32 1,14-alkyl diol, previously reported in Apedinella radians (Rampen et al., 2011), was not detected. Long chain 1,14-alkyl diols dominate in the Arctic and Antarctic surface sediments and the Arabian Sea (Fig. 2), while their fractional abundances show strong variation in the other oceanic areas. For most regions, fractional abundances of 1,15-alkyl diols are inversely related to 1,14-alkyl diol abundances, while 1,13-alkyl diol abundances are generally low with little variationonly in estuarine sediments from Hudson Bay and the Gulf of St. Lawrence do 1,13-alkyl diols contribute >25% of the total long chain alkyl diols."}, {"section_title": "Effect of environmental conditions on long chain 1,14-alkyl diol distributions", "text": "The degree of saturation (as expressed in the DSI) and the chain length distribution (as expressed in the DCI) of long chain 1,14-alkyl diols in Proboscia diatom cultures have previously been reported to show a strong relationship with growth temperature, although the relationships were less apparent in a limited set of surface sediments from the eastern South Atlantic (Rampen et al., 2009). In order to examine the influence of various environmental factors on the DSI and DCI, we correlated their values with annual mean temperature, salinity, chlorophyll, phosphate, nitrate and silicate concentrations from the overlaying water at 0 m water depth, and with stratification (Table 2; Supplementary Table 3). The DSI values show a weak negative correlation with SST (R-value = -0.441, p-value < 0.001; Table 2; Fig. 3a), contrasting with the positive temperature correlation observed for cultured Proboscia diatoms by Rampen et al. (2009). We observed no regional pattern in the distribution of DSI valuesstrong differences in values were found for surface sediments taken within the same oceanic areas with similar annual mean SST (Fig. 3a). Moreover, analysis of data sets of different regions also did not reveal any strong correlations with annual or seasonal SST (Supplementary Table 3), confirming that temperature is not the only factor affecting DSI (Rampen et al., 2009). The lack of correlation between DSI and other environmental parameters included in this study (Table 2; Supplementary Table 3) suggest that they do not significantly impact the DSI. In Proboscia cultures, concentrations of unsaturated long chain alkyl diols were always similar or higher than saturated long chain alkyl diols; the often low abundance and sometimes absence of unsaturated 1,14-alkyl diols in marine surface sediments may indicate that unsaturated long chain alkyl diols are more strongly affected by diagenesis than saturated long chain alkyl diols. On the other hand, some of the surface sediments from the West African coast and the eastern South Atlantic contain relatively high amounts of unsaturated 1,14-alkyl diols, higher than would be expected based on culture results (Fig. 3a). Another factor affecting the DSI could be that we mostly analyzed freely occurring long chain alkyl diols (see Fig. 4, where open blue triangles indicate data for samples where extracts were not saponified, and open red circles indicate samples where extracts were saponified), whereas these lipids also occur in various bound forms, which may comprise different distributions (cf. Hoefs et al., 2002;Shimokawara et al., 2010;Volkman et al., 1992). To test this, we selected a subset of surface sediments for which diols were analyzed both without and with prior saponification of the extract. Fig. 4 shows the various long chain alkyl diol indices plotted versus annual SST. Filled symbols indicate the data for saponified (red circles) and non-saponified (blue triangles) surface sediments of the selected dataset. For most sediments tested, the DSI shows markedly lower values after saponification ( Fig. 4a), indicating that the fraction of mono-unsaturated long chain alkyl diols released by saponification is higher compared to this fraction in free lipids. Nevertheless, neither the DSIvalues of saponified nor free long chain alkyl diols show a strong correlation with temperature ( Fig. 4a), suggesting the DSI is also affected by factors other than temperature. We also observe no statistically significant correlation between SST and the chain length of the 1,14-alkyl diols ( Fig. 3b), while weak to moderate correlations are observed between DCI and silicate, nitrate and, most strongly, phosphate concentrations ( Table 2). Saponification of the extracts resulted in slightly lower DCI values ( Fig. 4b) and, apparently, the release of bound long chain 1,14-alkyl diols did not substantially improve the correlation between DCI and SST. The lack of correlation between the DCI and SST is in contrast with previous results for surface sediments from the eastern South Atlantic (Rampen et al., 2009) and a more detailed analysis shows that the DCI values from specific areas follow distinct patterns (Fig. 3b) Previous studies have shown that Proboscia species proliferate in different seasons (e.g. Table  1) and therefore their long chain 1,14-alkyl diol distributions may reflect different seasonal temperatures, which may be an explanation for some of the scatter in the DCI-SST relationship. However, even correlations between regional DCI values and monthly SSTs remained weak (Supplementary Table 3). In addition, seasonal growth cannot explain why, for example, highest DCI-values were observed for Arctic sediments (Fig. 3b). As implied by the moderate correlation between DCI and nutrient concentrations (Table 2), the DCI may also be affected by environmental factors other than temperature or by the physiological state of the long chain 1,14-alkyl diol producers. The different DCI/SST patterns for the various locations could also be an indication that different species of Proboscia have their own specific relationship with temperature. The correlation between DCI and growth temperature is mainly based on cultures of P. indica (Rampen et al., 2009). Proboscia alata is a cosmopolitan species (Table 1) but other Proboscia spp. are restricted to specific areas, which may be related to specific environmental factors like nutrient availability, salinity or temperature (e.g. Jordan et al., 1991;Takahashi et al., 1994). A regional occurrence, related to environmental factors, of Proboscia species with specific long chain diol distributions may also explain the weak correlation observed between DCI and silicate, nitrate and phosphate concentrations. Alternatively, the indices may be affected by input of diols from species other than Proboscia. Analyses of an extensive set of diatom cultures indicated that, except for Proboscia species, diatoms are an unlikely source for long chain alkyl diols (Rampen et al., 2007). However, recently, Rampen et al. (2011) did report long chain 1,14-alkyl diols in the heterokont marine Dictyochophyte Apedinella radians indicating that these lipids may indeed also be produced by algae other than diatoms. Moreover, the DCI value of the A. radians culture does not match with the results from Proboscia cultures (Fig. 3b). On the other hand, strong similarities between Proboscia frustule flux and long chain 1,14-alkyl diol flux in the Arabian Sea (Rampen et al., 2008) suggest that, at least in the Arabian Sea, Proboscia are the main source of long chain 1,14-alkyl diols. Furthermore, A. radians also contained C32 1,14diol (Rampen et al., 2011), which was not detected in this study. Possibly in areas like the central and western South Atlantic the source of long chain 1,14-alkyl diols is predominantly a single Proboscia species and this may explain the apparent relationship between DCI and SST in these areas. Hence, the DCI may only be applicable as a temperature proxy if the biological source does not change over time, and its temperature-proxy relationship is known."}, {"section_title": "Effect of environmental conditions on relative abundances of long chain 1,14-alkyl diols.", "text": "Previously we introduced two diol indices, Diol Index 1 and 2 (Eq. 3 and 4), to reconstruct past upwelling conditions in the Arabian Sea and the shelf waters of the Western Antarctic Peninsula, respectively (Rampen et al., 2008;Willmott et al., 2010). To test the applicability of these two long chain alkyl diol indices as upwelling or stratification proxies on a global scale, we determined their values in our marine surface sediment set. This sediment set contains samples from major coastal upwelling regimes like the Canary Current system (off Northwest Africa), the Benguela Current system (off Southern Africa), the Somali Current system (off Somalia and Oman) and the Southern Ocean around Antarctica (Capone and Hutchins, 2013;Orsi et al., 1995;Smith et al., 2001). For Diol Index 1, highest values (>0.9) were observed in both northern and southern highlatitude areas (>60°), while typical upwelling areas in the Arabian Sea, off the coast of West Africa and in the eastern South Atlantic Ocean showed moderate to low index values ( Fig.   5a), suggesting that Diol Index 1 is not an unambiguous indicator for upwelling conditions.  but the results of the Combined Diol Index strongly resembled those of Diol Index 1, indicating no additional value (data not shown). We also investigated the effect of bound long chain alkyl diols on these indices, but the Diol Index values before and after saponification of the extracts have similar values ( Figs. 4c and d). Quantitative correlation of the long chain alkyl diol indices with upwelling strength are hampered by the relatively small quantitative data on upwelling strength, which is why upwelling is often inferred by indirect methods like measurements of wind stress, tracer observations, salinity, nutrients and temperature (Kadko and Johns, 2011;Rhein et al., 2010). Furthermore, most upwelling studies areas are on a regional scale, whereas data on upwelling on a global scale is limited to indications of presence or absence of upwelling in specific areas (e.g. Capone et al., 2013). In order to provide some quantitative comparison with upwelling strength, and to investigate whether certain environmental factors affect the two Diol Indices, we correlated the indices with temperature, salinity and chlorophyll, phosphate, nitrate and silicate concentrations of the overlaying water (Table 2). Diol Index 2 showed no correlation with these environmental factors, while Diol Index 1 showed a significant inverse correlation with SST (R-value = -0.855; p-value <0.001, Fig. 6). The correlation between SST and the Diol Index 1 is remarkable since the index is composed of lipids supposed to be produced by different organisms, so shifts in their relative abundance are unlikely to be related to physiological adaptation within single organisms. C30 1,15-diol abundance shows an increase relative to 1,14-diol abundances with increasing temperature, similar to the LDI, whereas the C30 1,15-diol also increase relative to C28 1,13-and C30 1,13-diols with increasing temperature (Rampen et al., 2012). However, the LDI correlates much stronger with SST (R-value = these diol indices are also affected by other factors than temperature (Fig. 6). In addition to temperature, nitrate, phosphate and silicate concentrations also showed significant correlations with the Diol Index 1, but these are likely due to the underlying correlation of these nutrients with SST (Rampen et al., 2012). To investigate whether the degree of stratification is related with the Diol Indices (cf. Conteras et al., 2010), we compared the indices with the temperature differential between sea surface and subsurface at 200 m depth (T0 -T200, suggested as a measure for stratification by Dave and Lozier, 2013) and mean annual depths of the surface mixed layers. A significant correlation is only observed between Diol Index 1 and T0 -T200, but again this may also be due to the strong correlation between SST and To -T200. To examine the possibility of seasonal production of long chain 1,14-diols during months with maximum stratification, Diol Indices were also compared with stratification and mixed layer depth values for months with the shallowest mixing depths and smallest temperature differences, but also this revealed no relationships (see Supplementary Table 3). These results indicate that Diol Index 1 is unsuitable as a globally applicable upwelling indicator, although it does seem to work in certain regions (e.g. Rampen et al., 2008), while Diol Index 2 seems applicable as a global indicator for upwelling, although this will likely also depend on the local ecological niche of Proboscia diatoms."}, {"section_title": "Conclusions", "text": "Although it was previously reported that the chain length distribution and degree of saturation of long chain 1,14-alkyl diols in Proboscia cultures are related to growth temperature (Rampen et al., 2009), our comprehensive study of marine core tops does not show a strong correlation between SST and chain length distribution or degree of saturation of long chain 1,14-alkyl diols in marine surface sediments, indicating that these compounds are not widely applicable as a temperature proxy. It remains uncertain why these correlations are not observed in this core top study, but regional differences in source organisms may play an important role. Analyses of long chain alkyl diol indices proposed as indicators for upwelling/high nutrient factors indicate that Diol Index 1 is affected by temperature. The geographical distributions of Diol Index 2 values suggest that this index may be more widely applicable as an indicator for upwelling conditions although this will depend on the local ecological niche of Proboscia diatoms and their relationship with upwelling conditions.  Brichta and Nöthig (2003) a Sp = spring, Su = summer, Au = autumn, Wi = winter; b strongly dominating total biomass; c dominating the diatom population.  Levitus (2002); c Levitus (2010); d mixed layer depth (Monterey and Levitus, 1997). 530           "}]