[{"section_title": "", "text": "As the productivity of pesticides and seeds has increased, the concentration of these input industries has also increased. In the 1960s, over 70 basic manufacturers of pesticides were operating in the United States, but mergers and acquisitions have combined those firms into roughly eight major multinational manufacturers (Just 2006). Concentration has increased similarly in the seed industry. Until the 1930s, most commercial seed suppliers were small, family-owned businesses that multiplied seed varieties developed in the public domain (e.g., state agricultural experiment stations). With the development of hybrid corn and with greater intellectual property right protection, the number of private firms engaged in plant breeding grew rapidly at first. But consolidation has prevailed since the early 1990s. By 1997, the share of the U.S. seed sales controlled by the four largest firms reached 92% for cotton, 69% for corn, and 47% for soybeans (Fernandez-Cornejo 2004). On a crop-by-crop basis, the seed industry is Jorge Fernandez-Cornejo is Economist with the Economic Research Service, USDA. Richard Just is Distinguished University Professor at the University of Maryland. The views expressed are those of the authors and do not necessarily correspond to the views or policies of the U.S. Department of Agriculture. This article was presented as a principal paper at the AAEA annual meeting (Portland, Oregon, July 2007). The articles in these sessions are not subjected to the journal's standard refereeing process. more concentrated than the pesticide industry (Ollinger and Fernandez-Cornejo 1995), although pesticide markets tend to be more concentrated use-by-use. Increasing concentration of these industries raises concerns about the impact of market power. Major crop production is increasingly dominated by inputs for which benefits can be appropriated by use of market power. Half of soybean operating costs and a third of corn operating costs are due to seed and pesticide inputs alone (USDA 2006b). A recent study shows that lack of competition in post-patent pesticide markets explains 30-50% of current prices (Just 2006). The U.S. Department of Justice has had similar anticompetitive concerns in the seed industry (Ross 2000). Increased industry concentration has at least two competing effects presenting a social trade-off. A tendency toward monopoly pricing restricts markets, limits the social benefits of new technologies, and skews benefits away from farmers and consumers. However, economies in research and development (R&D) and other cost savings can arise from mergers and concentration (Williamson 1968). An additional possibility is that concentration leads to political economies of scale in influencing government regulations. While economists have developed theory and methods to measure market power and analyze effects of concentration, the main limitation is the availability of data. Although several potential sources of data on modern agricultural input markets are available, they vary widely in accessibility, ranging from confidential proprietary data to public data collected by government agencies. In this paper, we first show how concentrated these modern input industries have become and then demonstrate potential economic impacts of concentration in these input markets. Next, we discuss the data needed for reliable economic analysis of these issues and the adequacy of existing sources of data. The need for additional public data is assessed and approaches for obtaining them are explored. We conclude with suggestions regarding how the influence of the American Agricultural Economics Association (AAEA) can be used to support such data collection efforts."}, {"section_title": "Concentration in the Seed Industry", "text": "Until the late 19th century, most U.S. farmers depended on seed saved from their own harvests and did not purchase significant quantities of commercial seed. From 1915-30, seed certification programs began to provide quality assurance, which led to an increase in the role of commercial seed markets. Until the 1930s, most commercial seed suppliers were small, family-owned businesses lacking the financial resources for R&D. Their primary role was to multiply and sell seed varieties developed in the public domain (Duvick 1998;McMullen 1987). Improved variety R&D was carried out almost exclusively by land grant institutions and other public agencies. The development of hybrid corn varieties, with its inherent capacity to protect returns to private investment, transformed the U.S. seed industry. From 1930 on, the number of seed producers grew rapidly. Some 150 new companies joined some 40 existing seed companies in the production of hybrid corn seed. Some instituted in-house research and breeding programs. Early growth shifted corn production to hybrids so extensively that by 1965 over 95% of American corn acreage was hybrid (Duvick 1998). However, the ability of farmers to save nonhybrid seeds limited expansion into other seed markets (sorghum and sunflower are the only other hybridized field crops). The Plant Variety Protection Act (PVPA) of 1970 (along with amendments and rulings) strengthened property rights and brought further significant increases in R&D expenditures and changes in seed industry structure (Fernandez-Cornejo 2004). Merger and acquisition activity began to expand. Traditional seed industry structure gave way to the entry of much larger R&D companies with extensive investments in sectors such as pharmaceuticals and chemicals including Ciba-Geigy and Sandoz (Kimle and Hayenga 1993). Private sector acquisitions expanded rapidly, and by the early 1980s several international firms were among the top seed sellers worldwide. Beginning in the early 1980s, the development of biotechnology brought additional incentives for expansion and R&D in seed production. As early crop biotechnologies entered large-scale testing, further mergers, acquisitions, and joint ventures sought economies of scale to offset the high costs of biotechnology R&D. Chemical and seed businesses were combined, taking advantage of strong demand complementarities (Just and Hueth 1993), as evidenced most clearly by the case of glyphosate and glyphosate-tolerant soybeans. Still, many large chemical and industrial manufacturing companies that invested heavily in the seed business in the early 1980s have since exited (e.g., Royal Dutch/Shell Occidental Petroleum, Upjohn, and Celanese). Although determination of precise market size and structure for the overall seed industry is difficult, estimates of four-firm concentration ratios (CR4) can be made for individual field crops. The corn seed industry has included many small firms since its inception (105 of the original 190 companies of the 1930s still existed in the 1990s) together with market leaders, such as Hi-Bred Corn (which became Pioneer), Funk Brothers, Dekalb and Pfister (Duvick 1998). Until the 1970s, small firms accounted for about 30% of the corn seed market but the four largest firms held 50 to 60% of the U.S. market in the 1970s (Fernandez-Cornejo 2004). By 1997, this CR4 ratio had risen to 69% with the strategic entry of multinational firms (table 1). The public sector dominated development of soybean varieties longer than corn varieties. However, the transformation to private development was more rapid. In 1980, over 70% of the U.S. harvested acreage represented publicly developed varieties, but this share fell to 10% by the mid-1990s (Fernandez-Cornejo 2004). This privatization is apparently due to the strengthening of intellectual property rights and has led to a fairly concentrated industry with a CR4 ratio close to 50% (table 1). Until the early 1980s, the two largest private cottonseed firms, Delta and Pine Land and Stoneville, controlled roughly 40% of the varieties planted. Several smaller public and private breeders each held between 5% and 15%. In the 1980s, new developments in cotton breeding improved seed varieties, causing the cottonseed market to expand as farmers found saving seed to be less economical. Large private firms rapidly replaced smaller firms and public institutions as suppliers. Delta and Pine "}, {"section_title": "Concentration in the Pesticide Industry", "text": "Major changes have occurred in the pesticide industry over the past four decades. The number of innovative firms has declined, and the industry has become international (Ollinger and Fernandez-Cornejo 1995). The number of basic pesticide manufacturers with U.S. registrations has fallen rapidly since the 1960s as a result of numerous mergers, with some of the most important occurring recently. For example, Syngenta represents the merger or acquisition of at least 45 pesticide manufacturers that grew out of some 25 that existed in the 1960s, with mergers since 1995 including Merck, Ciba-Geigy, Sandoz, Novartis, Zeneca, and G.B. Biosciences. Bayer Crop Sciences combines at least an additional 34 pesticide manufacturers that grew out of some 19 that existed earlier, with mergers since 1995 including AgrEvo, Aventis, Hoechst-Roussel, and Rhone-Poulenc. Aggregate measures of concentration suggest that pesticide markets are less concentrated than seed markets. From 1972-89, the estimated CR4 ratio for pesticides averaged 45% in the United States, falling from 50% in 1972 to a low of 37% in 1982 and then rising through the rest of the 1980s to 48% in 1989. However, the pesticide industry is more concentrated than aggregate numbers suggest because herbicides, insecticides, fungi-cides, and fumigants do not compete with one another, and the markets for many individual pesticide uses (e.g., pre-emergent grass control on soybeans, post-emergent broad leaf weed control on corn, etc.) involve only two or three major pesticides. For example, not all soybean herbicides are close substitutes as are all soybean seeds. As of 2001, the EPA's top 25 pesticides included only three fungicides, two insecticides, and four fumigants (EPA 2004). Also, some top herbicides have specialized uses (e.g., Roundup has no close substitutes other than generic glyphosate). During this time, foreign firms' market share has increased from 18% to 43% (Ollinger and Fernandez-Cornejo 1995). While some foreign penetration primarily involved generic sales as a competitive fringe for off-patent products (e.g., the Israeli firm Makhteshim-Agan), other foreign activity represents a dominating share in an individual pesticide. For example, the Danish firm Cheminova dominated the malathion market, by far the leading insecticide, for many years after patent expiration. Other aspects of pesticide distribution, manufacturing, and regulation raise market power issues. Because only five firms handle most U.S. pesticide distribution, each seeking to offer a full line of products in the regions they serve, several major manufacturers have attempted to require distributors to supply 90% of needs for a particular pesticide with their individual product under the threat of withdrawing the rest of the manufacturer's product line (including patented products). Also, because of specific chemical process requirements, concentration in an upstream input market can have important implications, as in one case where the dominant manufacturer bought and dismantled the only other facility that produced a necessary pesticide ingredient. Pesticide market concentration is further influenced by provisions of the Federal Insecticide, Fungicide, and Rodenticide Act (FIFRA). A generic firm can typically offer timely competition only by making a binding offer to pay compensation for test data held by the original registrant. Original registrants usually demand a per capita share of costs plus add-ons representing what could have been earned in alternative investments. This can exceed the total profit potential of generic firms in limited-life post-patent markets at more competitive prices and typical generic market shares. While FIFRA requires binding arbitration for these cases, it sets no cost-sharing standard. This subjects generic firms to high risk, which apparently explains why generic entry has been delayed far past patent expiration in a number of successful pesticide markets. For example, generic entry lagged patent expiration by seven years for both linuron, a leading domestic herbicide at the time, and chorothalonil, the leading U.S. fungicide (EPA 2004;Just 2006). Another adverse impact of FIFRA occurs when a pesticide producer patents a new production process or a slightly modified product that requires a new EPA registration just before an original patent expires and then cancels its original registration. This prevents generic firms from relying on previous test data to compete with the original product while the new patent prevents competition with the new product (Just 2006). Current public data do not permit analysis of such inefficiency."}, {"section_title": "Concentration and R&D", "text": "Market concentration can also be usefully measured by innovation competition (Fulton and Giannakas 2002). For crop biotechnology, the CR4 ratio for USDA approvals of field releases of genetically engineered field crop varieties from 1990-2000 in table 2 evidence both concentration and potential barriers to entry in biotech R&D. Based on approvals, corn seed is less concentrated than soybeans and cotton. Corn seed R&D concentration has remained relatively constant at 65-80% since 1990. Soybean and cottonseed R&D fell some during the mid-1990s, but by 2000 increased to"}, {"section_title": "Table 2. Four-Firm Concentration in APHIS Field Release Approvals, 1990-2000", "text": "Crop 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 Corn CR4  67  67  65  82  82  67  60  73  73  80  79  Soybeans CR4  100  100  94  68  72  94  82  82  71  87  85  Cotton CR4  100  100  100  89  79  85  91  64  98  98  96 Source: Fernandez-Cornejo (2004). 85 and 96%, respectively. Pesticide innovation can be measured by EPA registrations of new active ingredients. From 1997From -2006, the CR4 ratio was 59%. After the top five, most firms obtained only one registration and no firm obtained more than two (EPA 2004). Soybean production cost data also suggest that genetically modified seed causes interaction between seed and pesticide markets. While data for a careful analysis are lacking, Monsanto's Roundup-Ready soybean seed appears to be responsible for both the 33 to 15% decline in pesticide cost (as one pesticide replaced several) and 25 to 36% increase in seed cost as a share of soybean operating expenses from 1996-2005."}, {"section_title": "Modeling the Effects of Concentration", "text": "The increase in industry concentration raises concerns about its potential economic impact, in particular, the trade-off between greater market efficiency and farmer and consumer benefits from increased competition versus R&D economies of scale from increased concentration. A recent study has shown that concentration in post-patent pesticide markets explains 30-50% of pesticide prices and that the benefits from competition for farmers and consumers combined are 30-90% of competitive market revenue. These effects occur largely as a transfer from individual pesticide firms to farmers and consumers as generic entry tends to lead to more competitive pricing (Just 2006). If R&D cost efficiency outweighs market power effects, then concentration may be more beneficial to society. However, the decline in EPA registrations of new active pesticide ingredients from an average of 26.6 per year in 1993-97 to 7.4 per year in 2002-6 (EPA 2004) following a period of numerous mergers calls into question the concentration effect on innovative activity for the pesticide industry over this period. Yet another effect is that concentration may lead to political economies of scale, whereby large companies are more able to influence government regulations, possibly in ways that could discourage generic entry (see papers in Just, Alston, and Zilberman 2006). Models designed to measure oligopoly power in an industry have been proposed by Iwata (1974); Gollop and Roberts (1979); and Appelbaum (1982). Assuming firm behavior is interdependent, these studies estimate conjectural variations in production choices following the \"New Empirical Industrial Organization\" (NEIO), now the cornerstone of industry conduct analysis (Wann and Sexton 1992). Recent studies extend NEIO approaches to simultaneous estimation of price-taking behavior where firms have market power in both input and output markets (Just and Chern 1980;Schroeter 1988;Wann and Sexton 1992). The conjectural variation approach has been extended to distinguish market power and cost-efficiency effects of industry concentration (Azzam and Schroeter 1995). However, this analysis is limited by absence of firm-level panel data. Analysis at the industry level requires extensive time-series data on firm market shares, R&D investment, output quantities, and input and output prices, which are also lacking for the seed and pesticide industries. While the accuracy of the NEIO approach has been questioned, several remedies have been proposed, including nonparametric and Solow residual market power tests, which require somewhat less data than structural market power tests (Raper, Love, and Shumway 2007). The specialized competition among pesticides by use rather than by crop presents further challenges for modeling the effects of regulations. When a generic firm applies for a registration, it usually must wait most of a year for the EPA approval process. With a carefully timed petition by the original entrant claiming impurities, which the EPA is bound to consider, the additional delay can easily cause the generic firm to miss an entire marketing season, which is typically only a month or two in the spring. Thus, the incentive to extend a monopoly on an individual product can delay the consequent welfare effects on farmers and consumers for a full year. Such issues of delay and penetration of generic competition can be understood only on a product-by-product basis."}, {"section_title": "Data Availability", "text": "The main limitation to effective economic analysis of the effects of industry concentration is the availability of public data for research. The absence of firm-level panel data has forced researchers to develop models at the industry level, using aggregate and undifferentiated public data. Absence of data on product markets limits discovery of concentration and its effects at the level that determines prices. Reliable analysis requires time-series data on firm market shares, R&D investment, output quantities, and prices. While conventional thinking is that such data are private and confidential, concerns about market power in regulated markets should make public observation appropriate. Several sources of data on seed and pesticide markets are available, but they vary widely in their accessibility for research, ranging from (1) in-house market intelligence compiled and protected by firms as proprietary, (2) confidential sales and cost data provided by commercial marketing services and consultants (such as Doane Marketing Research, Inc.), and (3) public data collected by government agencies. Public data is often not complete due to budget and survey exposure considerations. Marketing services' data are sold to input producers and regulatory agencies (such as the EPA) but are prohibitively expensive for individual research and usually have proprietary restrictions preventing research publication. Public data collected by the USDA or other government agencies include the Agricultural Resource Management Survey (ARMS), which is the major source of annual data on farm-level input use, acreage, production, resource use, and financial conditions of farm households. It represents the diversity of U.S. farms and farm households, but, as a broad survey, has limited capacity to focus on seed and pesticide markets, particularly at the product and use level. Furthermore, it does not yield panel data. Other data sources that may offer possibilities for specific cases include trade and other administrative records. For example, if a pesticide is produced abroad or uses an essential ingredient from abroad, public import records can be mined for relevant data. In some cases, these records together with EPA data on overall market activity and the National Pesticide Information Retrieval System (NPIRS) on registrations can enable tracking generic market activity. However, EPA market activity data are typically reported in the form of large numeric intervals that limit accuracy."}, {"section_title": "Proactive Data Generation as a Profession", "text": "Several studies have called for a more proactive role by the AAEA and other organizations in public data collection (e.g., Just and Pope 2002). The Economics, Statistics, and Information Resources Committee (ESIRC) of the AAEA is charged to \"monitor the availability and use of publicly available statistics for economic research.\" We believe that these possibilities, along with AAEA involvement in other organizations that influence public data generation (see various annual ESIRC reports) have been underutilized. But we also suggest that the primary focus of existing surveys, and the AAEA's influence on them, has been on agricultural production and output markets. Given changes in seed and pesticide markets, both in market concentration and the appropriation of benefits due to scientific advancement and genetic engineering, we suggest that greater attention to input markets is now appropriate. One possibility that might be explored is expanding the sections of the ARMS on seed and pesticide inputs to provide more detailed price and quantity data facilitating assessments of market performance. The chemical use section of ARMS could be coordinated with other relevant USDA surveys and the Census of Manufactures to enhance assessments of market performance. Because competition in pesticide markets is product-and characteristic-specific, corresponding detail in data is necessary for accurate analysis. To improve their use, farm surveys might be combined with data already available through the EPA and NPIRS on pesticide registrations by individual companies, as well as public data such as import/export records, so that impacts of regulation, generic competition, and offshore markets can be analyzed reliably. Other efforts might involve facilitating cooperative agreements with universities to fund input surveys. In some cases, the AAEA may be able to negotiate with consultants who collect data to provide less restrictive conditions for university researchers, perhaps under limited confidentiality agreements that permit research without disclosing basic data."}, {"section_title": "Concluding Comments", "text": "One of the most remarkable changes in U.S. agriculture over the past few decades has been in agricultural input markets. Improved pesticides and seeds have increased agricultural productivity. More recently, genetically engineered seeds and improved pesticides have limited reproducibility and augmented these trends. Accordingly, the ability of seed and pesticide manufacturers to appropriate the benefits has increased. These developments, coupled with large increases in concentration in seed and pesticide supply, raise significant concerns about market power and its impact on agriculture. Public data are generally unavailable for careful research of these impacts, but preliminary analysis with limited data suggests large impacts on farmers and consumers (Just 2006). Monopoly benefits for innovators prior to patent expiration provide incentives for continued innovation. But obstacles to generic participation in post-patent markets and the impacts of increasing concentration, which reduce competition among off-patent products and patented products with similar characteristics, appear to have reduced competitiveness of the agricultural input sector. Considering new AAEA efforts to increase its proactive influence on data collection, we believe a significant effort should focus on the need to analyze and understand the major agricultural input markets."}]