[{"section_title": "Abstract", "text": "ABSTRACT\nThis integrative review paper examines the most recent research data as it pertains to transfer"}, {"section_title": "", "text": "research question: What are the suggested components of a quality transfer program? The sections that follow outline the key themes present in the area of transfer programs. An overview of the findings is presented followed by recommendations for policy implementation."}, {"section_title": "METHODOLOGY", "text": "This integrative review paper was created using the integrative review process as posed by Jackson (1980) and Cooper (1982) . This method is being used to examine the research as it pertains to transfer programs between two-year colleges and four-year colleges (2/4 transfers) in the United States. This examination is conducted using computer aided literature searches of more than 40 journal articles, governmental agency documents, and non-profit organizational documents. Textbooks and doctoral dissertations were also investigated due to the limited number of journal works on this topic available from established authors."}, {"section_title": "FINDINGS", "text": "According to the Education Commission of States, 65% of all community college students transfer prior to earning their associate's degree (Education commission of States, 2009). Table 1 provides the most recent national data of beginning postsecondary students who reported transferring from their first Community College to pursue a baccalaureate degree. 56 .8% of all beginning postsecondary students in public 2-year institutions claim one reason they left their first institution was to pursue a baccalaureate degree. Slightly more males than females indicated an intent to transfer for a baccalaureate degree although males compose a lesser percentage of the total public 2-year enrollments. It is interesting to note that the percentage of beginning students indicating transferring from their first institution to pursue a baccalaureate degree increases for each age bracket until they reach age 30. The percentage of students in this 30 years or older age group transferring for a baccalaureate is higher than those 19 years or younger. A greater percentage of Asians/Pacific Islanders claimed to transfer for a baccalaureate degree.\nState planners and students both see the community college as a vehicle for facilitating baccalaureate attainment (Townsend, 2001 ). One of the thorniest problems with this vehicle is that of determining which community college courses are acceptable for credit in which university (Cohen & Brawer, 2003) . To avoid penalizing baccalaureate-bound students, many state systems of higher education have developed equivalency guides that are maintained with common course numbering systems (Cohen & Brawer, 2003 Table 2 reports the number of states that have addressed the issue of transfer through a variety of methods. The methods that states implement include (a) writing transfer and articulation policy into legislation through statutes, bills or resolutions (legislation); (b) statewide articulation agreements between institutions of higher education (Cooperative Agreements); (c) collecting and reporting transfer data on a regular basis by commissions or departments of higher education (Transfer Data Reporting); (d) offers of financial aid, guaranteed transfer of credit, or priority admission to transfer students (Incentives and Rewards); (e) providing descriptions of transfer requirements and answering student questions regarding the transfer process (Statewide Articulation Guide); (f) eliminating the confusion arising when separate institutions require different core courses to fulfill graduation requirements (Common Core); and (g) creating a common course numbering system to focus student efforts toward transferable credits (Education Commission of the States, 2001).\nAlthough many states are making progress toward effortless transfer, most states still do not have streamlined programs written into legislation. Illinois, Florida and Washington, have programs in place that mandate \"associate and baccalaureate degree granting institutions are equal partners in providing the first two years of baccalaureate degree programs.\" Arkansas, Indiana, and Maryland have only created committees or commissions to \"establish procedures for transfer of students between the public segments of postsecondary education\" (Education Commission of the States, 2001). Although much advancement has been made, state lawmakers and education leaders should continue to work toward implementing programs that will increase students' access to four-year colleges and universities (Education Commission of the States, 2001).\nDetrick (2008) indicates that \"in some instances, transfer experts were clearly disappointed with articulation agreements because information had not been clearly communicated to the public and the agreements have been viewed as public relations pieces only. Effective program-to-program articulation agreements at the institutional level and at the state wide level are more critical than ever before for the community college transfer student\" (Detrick, 2008).\n\"Although the research is limited, it clearly points to a keen student interest in transferring. This positive interest, however, should be tempered with the obvious need for student guidance. To help students through the difficult process of transfer, many institutions across the country have developed Transfer Centers; physical locations where students can come to learn more about the transfer process\" (Zamani, 2001). The mission of Transfer Centers is to promote and support community college students who are seeking to transfer to four-year institutions\" (Hagedorn et. al, 2004) . \"Communication between community college and 4-year university advisors is also critical to providing information relevant to student transfer. Programming and structures should be in place to help facilitate the establishment and maintenance of relationships among advisors\" (Flaga, 2006 ). Geleskie (2008) makes several recommendations toward transfer student advising. These recommendations are: (a) clearly communicate the role of an advisor; (b) recognize that advisor interest in advising students has a significant impact on the advisors' perceptions of the advising process and his or her role as an advisor; (c) provide regularly scheduled training and development opportunities that address specific advising skills, specific issues such as interpersonal communication, needs of specific student populations, various advising models, and effective collaboration with units supporting advising; (d) continue upgrading automated advising tools and technology for advisors; (e) develop separate advising programs unique to the individual college units which build on the distinctive qualities and capabilities of the advisors and students in those colleges; and (f) make a long-term commitment to support the advising programs throughout the institution (Geleskie, 2008) .\nAnother problem for transfer students stems from the preparedness of students once they do transfer to four-year institutions. \"There is widespread, long-standing evidence of transfer shock, a decrease in the first semester's grade point average (GPA), when community college students transfer to a four-year school\" (Townsend, 2001) . A need exists to create programs to aid in the initial shock of their new environment. Flaga states that \"before, during, and after transfer, 4-year universities need to take an active role in interacting with community college transfer students\" (Flaga, 2006) . Examples that she sites for accomplishing this interaction include: (a) provide an orientation that provides transfer students with foundations for friendships that may carry over into the upcoming school year; (b) provide a pre-transfer orientation course taught at the community college to give an early look at the learning resources at the university; and (c) provide campus tours, visits to various facilities at the 4-year university campus, and opportunities for appointments with university advisors to help students begin connecting to the academic, social, and physical environments of the university (Flaga, 2006) . Lastly, Eggleston, Laanan, and Santos (2001) indicate that while transfer students continue to experience problems in adjusting to their new campus environments support programs specifically for transfer students do not formally exist in most senior institutions. They continue to state that \"In recent years, senior institutions have been shifting to a more responsive attitude toward transfer student needs, as they attempt to increase their efforts to recruit, retain, and graduate transfer students\" (Eggleston et. al., 2001 ). Flaga suggests that \"4-year universities could sponsor programming at community colleges such as information fairs, meetings with community college advisors, and a pre-transfer orientation course taught at the community college for students planning to transfer to the four-year university the following semester.\" She continues that transfer students should be given access to student organizations, mentoring programs, and special networking sessions at both the community college and 4-year universities to establish informal networking opportunities that may provide these students with the support mechanisms to overcome poor performance during their initial semester at four-year institutions. Participation in academically related clubs provides information about internships and career opportunities and serves as resources to help solidify students' interest in the areas of interest. Peer mentor programs may facilitate the use of informal learning resources, as well as assist with connecting to peers. Student mentors can be either four-year students or transfer students who have already made a successful transition to the four-year university. An opportunity to live on campus increases opportunities to integrate into the academic, social, and physical environments, and help transfer students find their niche faster (Flaga, 2006) ."}, {"section_title": "CONCLUSION", "text": "There are three key stakeholders: transfer students, community colleges, and 4-year universities. Transfer student transition is a collaborative service process among the three, working together to assist with the transition (Flaga, 2006) . Wellman suggests that states also have a great interest in the success of transfer programs. States with strong programs will have lower appropriations per degree (Wellman, 2002) . Most states have no streamlined transfer programs written into legislation (Education Commission of the States, 2001).\nSeamless transfers and genuine collaboration between community colleges and public and private four-year institutions are essential for academic excellence to be realized by all students pursuing higher education today and tomorrow (Detrick, 2008) . Since 65% of all community college students intend to transfer before completing their associate's degree (Education Commission of the States, 2001), it is in our best interest to have consistency among transfer programs.\nOne primary component of transfer programs should be a transfer center placed within the community college. This transfer center will provide one location where students can receive any support necessary to aid their intended goal of transferring to a four-year institution. The support services offered to students should include: (a) advising services from both the community college and the four-year institution including articulation agreements that are university and program specific; (b) pre-transfer orientation programs; (c) access to four-year resources such as academic clubs, student organizations, peer mentoring programs and special networking sessions at both the community college and the four-year university; (d) a method of tracking the transfer student's performance through graduation of the baccalaureate program; and (e) internet access. Generally, discrete services such as advising which is done in a short period of time will be provided in the transfer center. Continuous services, those requiring longer periods of time such as peer mentoring and special networking sessions will be arranged at the transfer center, but provided off campus (Katzen, 2008)."}, {"section_title": "IMPLICATIONS FOR POLICY", "text": "State lawmakers are urged to continue their work on streamlining programs to ease the transfer process from community colleges to universities. Work should continue on articulation agreements as well as finding sources of funding to provide support mechanisms such as Transfer Centers on community college campuses. Their efforts may be rewarded in the form of decreased per degree expenditures as well as an increase in the education levels of the state workforce.\nCommunity college and university administrators are urged to work toward collaborations that will encourage students to declare, pursue, and transfer into the four-year university. Programs that offer clear interactions between community college and university students, advisors, and faculty should be pursued. The ultimate goal should be to identify, encourage, and support students whose aims are to attain baccalaureate degrees. Community college and university efforts may be rewarded in the form of increased enrollments, increased revenues, and the increased number of associate and baccalaureate degrees awarded."}, {"section_title": "FUTURE RESEARCH", "text": "One area of interest not directly addressed by this research is the examination of transfer program services and support available to students electronically. Many good Community College websites exist on the internet providing information to students. An examination of best practices of these websites may prove beneficial as transfer programs grow and evolve."}]