[{"section_title": "Abstract", "text": "Background-Few pathologic data are available on cerebral vessel disease, dementia, and cognition. This cross-sectional study examined associations of cerebral atherosclerosis and arteriolosclerosis neuropathology with probable and possible Alzheimer's disease (AD) dementia and level of cognitive function, in a large group of older persons who came to autopsy."}, {"section_title": "Introduction", "text": "Cerebral vascular disease is very common in aging and associated with poor health outcomes, with stroke identified as second leading cause of death in the world in 2012. 1 Research has now consistently shown that cerebral vascular disease, including as identified on neuroimaging and neuropathology, lowers the threshold for the clinical expression of dementia. 2 Indeed, stroke and its' major pathologic underpinning, cerebral infarct, are established risk factors for dementia and cognitive impairment, and both gross and microscopic infarcts have been related to dementia in pathologic studies. 2 Less is known about the role of other cerebral vascular disease, specifically atherosclerosis and arteriolosclerosis. Available data suggest that large vessel disease, and especially atherosclerosis, may increase risk of dementia, and as well Alzheimer's disease (AD) dementia more specifically, 3 however, previous studies of atherosclerosis have largely concentrated on in-vivo data which are not able to control for the mediating or confounding effects of microinfarcts and AD pathology. In addition, previous studies have focused on imaging of extracranial vessel disease and cannot clarify the potential role of intracranial vessels, and particularly small vessels, in dementia. There are also little data on the association of vessel disease and cognitive systems. Similar to studies on infarcts, in-vivo studies of atherosclerosis showed cognitive systems involving executive function and processing speed appear to be particularly affected, in contrast to memory systems. 4, 5 And, we are not aware of any studies of arteriolosclerosis and cognitive systems.\npublished study which examined associations of these pathologies with performance-based measures of specific cognitive systems.\nThe present study examined the relationship of two common cerebral vessel pathologies in aging with AD dementia and cognition. Subjects included 1,143 deceased and autopsied women and men, participating in one of two clinical-pathologic cohort studies of aging. Subjects enrolled without dementia and underwent detailed annual clinical evaluations, which included assessment of cognitive function and classification of dementia status. At time-of-death, neuropathologic evaluations of the brain documented severity of cerebral vessel pathology, and other data on common neurodegenerative and vascular pathologies of aging. We tested whether two cerebral vessel pathologies, atherosclerosis and arteriolosclerosis, were associated with higher odds of probable or possible AD dementia and lower levels of cognitive function proximate-to-death, using summary measures of global cognition and five separate cognitive domains. We also examined whether associations were independent of AD and infarct pathologies, or affected by APOEε4 and vascular risk factors."}, {"section_title": "Methods", "text": "This cross-sectional study follows recommendations made in, and is reported according to, the STROBE statement."}, {"section_title": "Subjects", "text": "Study subjects were participants in a prospective, community-based, clinical-pathologic cohort study of aging, either the Religious Orders Study or the Rush Memory and Aging Project. Both cohort studies have received approval from the Rush University Medical Center, Institutional Review Board. Methods were published elsewhere and are summarized here. 11, 12 Both study designs follow essentially identical methods, including recruitment, and biospecimen and data collection, thus facilitating the combination of data to examine the relation of clinical and pathologic factors in the aging brain. At time of enrollment, each subject consents to undergo annual clinical evaluations, and signs an anatomical gift act agreeing to brain donation at time of death. Follow-up and autopsy rates in both studies are high, and more than 80%.\nThe Religious Orders Study began enrolling participants in 1994. To date, there have been 1,285 Catholic nuns, priests, and brothers who underwent a baseline clinical evaluation, including detailed neuropsychological testing (see below). After excluding the 2 subjects who withdrew over the course of the study, of the remaining subjects, there were 694 who have died, and of these, 640 have come to autopsy (92% autopsy rate). Complete neuropathologic data in subjects without dementia or with AD dementia, necessary to conduct this study, were available on the first 586 subjects, included in analyses here.\nThe Rush Memory and Aging Project began in 1997, and there are 1,771 participants to date who have undergone a baseline clinical evaluation. Of these, 11 withdrew from the study, 750 have died, and 614/750 deceased subjects underwent a brain autopsy (82% autopsy rate). The first 557 subjects without dementia or with AD dementia, and with complete neuropathologic data available, were included in analyses in this study."}, {"section_title": "Clinical data", "text": "Uniform and structured baseline and annual clinical evaluations were identical in all essential components, and included a medical history, physical examination with a focus on the neurological examination, and detailed neuropsychological testing, as previously described. 11, 12 All data were entered on laptop computers using the Blaise system (Westat).\nNeuropsychological testing, administered at each clinical evaluation, consisted of a standardized battery of a broad range of tests of different abilities, as published before. 13 In addition to the Mini-Mental State Examination, there were 17 individual tests of cognition, which were summarized into composite measures of five cognitive domains and an overall score of global cognition (based on all tests). 13 Seven tests were used to create a measure of episodic memory, three tests for semantic memory, three tests for working memory, two tests for perceptual speed, and two tests for visuospatial abilities. These summary measures decreased ceiling artifact and other sources of measurement error, and have been used in many of our previous studies. 11, 12 All data were reviewed by a neuropsychologist blinded to data collected in previous years. For this study on the relation of cerebral vessel disease to cognitive function, we used cognitive data most proximate-to-death, in the primary analyses.\nClinicians with expertise in dementia review clinical data from a given year, blinded to previously collected data, in order to classify each participant by dementia status, following published recommendations. 14 At time of a participant's death, a board-certified neurologist with expertise in dementia (authors ZA and DAB), blinded to all pathologic data, reviewed clinical data from across the study years to classify dementia status proximate-to-death. For this study, we used a dichotomous outcome measure for the presence vs. absence of probable or possible Alzheimer's disease (AD) dementia, in accordance with the published criteria for the diagnosis of dementia due to AD. 11, 12, 14 The term \"AD dementia\" refers to the clinical syndrome of AD and to those with either probable or possible AD dementia. This designation was dichotomous and made without the use of biomarkers.\nThe clinical evaluations included a blood draw, from which APOEε4 data were derived as previously reported, 15 and documentation of vascular risk factors, including hypertension, diabetes, and smoking, from which the number of vascular risk factors present was computed."}, {"section_title": "Neuropathologic data", "text": "Each autopsied brain underwent a systematic neuropathologic evaluation, blinded to clinical data, as previously published. 16 Briefly, a uniform gross and histologic evaluation for common age-related pathologies is conducted, and includes a detailed assessment of cerebrovascular disease.\nCerebral vessel disease is documented in large and small vessels. 17, 18 Atherosclerosis describes the segmental or circumferential subintimal accumulation of lipid, plasma proteins, and calcium deposition (plaque) in the walls of large arteries and was assessed on gross examination, by visual inspection of vessels in the Circle of Willis. Vessels included the vertebral, basilar, posterior cerebral, middle cerebral, and anterior cerebral arteries and their proximal branches. Severity was graded using a semi-quantitative scale, based on involvement of each artery and number of arteries involved, from 0 (no atherosclerosis) to 6 (severe atherosclerosis, with all visualized large arteries affected or one artery completely occluded). Arteriolosclerosis describes concentric hyaline thickening of small vessel walls, with emphasis placed on arterioles less than 50 microns. Arteriolosclerosis was documented on the histologic examination, by using H&E stained sections of the anterior basal ganglia (caudate, putamen, globus pallidus, and internal capsule). Severity was also graded based on vessel wall thickening, and ranged from 0 (no arteriolosclerosis) to 7 (complete small vessel occlusion), as described elsewhere. 18 In analyses for this study, the severity of both vessel pathologies was grouped into four levels for primary analyses (not present, mild, moderate, and severe), and in some other analyses, into two levels (moderate-to-severe, versus not present-to-mild).\nNeuropathologic data also included systematic assessment for other common cerebral vascular disease and neurodegenerative diseases, and have been published elsewhere. 11, 12 In summary, gross (macroscopic) infarcts were identified on gross examination, and classified by number, volume (in mm 2 ) and location, and each infarct was then dissected and confirmed on microscopic examination using H&E, and classified by age (chronic, subacute, acute). 16 Microinfarcts, defined as infarcts not visible to the naked eye and identified only under microscopy, were identified in blocks of nine brain regions that were paraffin embedded and stained with H&E. 19 Location and age of microinfarcts were also recorded. For this study, only chronic gross and micro-infarcts were considered, and all infarct variables were dichotomized into present (one or more) vs. absent (none, as reference group).\nIn addition to cerebral vascular disease pathology, neurodegenerative pathology data were available. The continuous, global AD pathology score takes into account counts of neuritic plaques, diffuse plaques, and neurofibrillary tangles from a 1mm 2 area (of greatest density), from sections of entorhinal, hippocampus, midfrontal, middle temporal, and inferior parietal cortices, using a modified silver stain. 15 Data on the pathologic diagnosis of AD was also available. The Lewy body pathology measure is based on the presence of any Lewy bodies on α-synuclein immunostaining. 20 "}, {"section_title": "Analytic approach", "text": "Descriptive statistics of demographic, clinical, and neuropathologic characteristics of subjects were examined in the total group, and then among those with and without AD dementia. Associations among cerebral vessel pathologies and age were quantified with Spearman's rank correlation coefficients. We examined the relationship of cerebral vessel pathology to the clinical outcomes of AD dementia (clinical syndrome of AD, including subjects with either probable or possible AD dementia) and cognitive function. Analyses in the study included terms to adjust for pertinent demographic (age-at-death, sex, and education) and neuropathologic variables (gross infarcts, microinfarcts, AD pathology, and Lewy body pathology). A nominal threshold of p<0.05 was imposed for statistical significance and p values are reported with two significant digits, unless <0.0001. In the primary analysis for AD dementia, we used a logistic regression model to examine the odds of AD dementia (outcome) by severity level of atherosclerosis and arteriolosclerosis (with both vessel terms in a single model). In this model, the primary predictors of interest were the severity grades of the two vessel pathologies (mild, moderate, and severe), with no vessel pathology as the reference group. Secondary analyses examined whether the presence of an APOEε4 allele (one or two alleles) or vascular risk factors affected the results (at least one of hypertension, diabetes, or smoking). Separate secondary analyses provided tests for effect modification of vessel disease by each of age-at-death, any brain infarct (gross or microscopic), and AD pathology (first using the global AD pathology measure; then using the pathologic diagnosis of high and intermediate likelihood of AD vs. low likelihood and no AD). For these tests, we added two additional terms in each of the three analyses, one term for the interaction of atherosclerosis by the variable of interest (e.g., age-at-death), and the other term for the interaction of arteriolosclerosis by the same variable.\nBecause cognitive function is a complex construct with a range of types of function (e.g., domains) and levels of function/impairment, in addition to examining for the odds of AD dementia, this study also aimed to examine the association of vessel pathology with level of cognition proximate-to-death in different cognitive domains. For the primary analyses for cognitive function, we used a set of six linear regression analyses to examine the associations of vessel pathology with level of global cognition (one outcome) and cognitive function in five separate cognitive domains (five outcomes). Each of the six models included the same nine terms as in the primary analysis with AD dementia as the outcome: age-atdeath, sex, education, gross infarcts, microinfarcts, AD pathology, Lewy body pathology, atherosclerosis, and arteriolosclerosis. Standard diagnostic methods and graphical examination of residuals were used to verify the assumptions underlying the statistical models. To examine the effects of APOEε4 and vascular risk factors effects on the associations of vessel disease with cognition, as well as effect modification by age-at-death, any infarct, and AD pathology, we followed the approach outlined for the analysis of AD dementia. Finally, we conducted additional sensitivity analyses to address whether severity of dementia proximate-to-death affect the results.\nWe evaluated the models for violations of the core model assumptions and conducted graphical analyses of data. All analyses were programmed in SAS version 9.3 (SAS Institute Inc, Cary, NC)."}, {"section_title": "Role of the funding source", "text": "The funder of the study had no role in study design, data collection, data analysis, data interpretation, or writing of the report. The corresponding author had full access to all the data in the study and had final responsibility for the decision to submit for publication."}, {"section_title": "Results", "text": ""}, {"section_title": "Demographic, clinical and neuropsychological characteristics", "text": "The demographic, clinical, and neuropathologic characteristics of the 1,143 subjects included in the study are shown in Table 1 . In the total group, vessel pathology was common, and moderate-to-severe atherosclerosis was present in almost 40% of subjects, and arteriolosclerosis in 35%, with 19% of all subjects (221/1,143) having a moderate or more severe grade of both vessel pathologies. Atherosclerosis and arteriolosclerosis were associated with one-another (rs=0.30, p<0.0001). We also found associations of each of the two vessel pathologies with age, with both having r s =0.15 and p<0.0001. Compared to those without dementia, subjects with probable or possible AD dementia (478/1,143; 42%) were older and more likely to be female, to have an APOEε4 allele, lower cognitive scores proximate-to-death, and more vascular and AD pathology (all p values <0.026). Cognitive data were complete (no missing data on any of the 17 neuropsychological tests) in 1,069 of 1,143 (94%) subjects; 44 (4%) had missing data on one test; and the remaining (2%) had missing data on more than one test. Supplemental data on the neuropsychological tests used to create the global cognitive score are presented in a table in the Appendix. The distribution of vessel disease (atherosclerosis and arteriolosclerosis) among subjects with and without AD dementia is illustrated in Figure 1 . This figure suggests that a higher proportion of persons with AD dementia have vessel disease."}, {"section_title": "Vessel disease and odds of AD dementia", "text": "The primary objective of this study was to examine the relationship of cerebral vessel pathology to the clinical syndrome of AD dementia. We found that each level increase in the severity of atherosclerosis and arteriolosclerosis was associated with significantly higher odds of AD dementia ( Table 2 ). The association was stronger for atherosclerosis (OR=1.33) than for arteriolosclerosis (OR=1.20), adjusted for age, AD pathology, and gross and microinfarcts.\nComparing the associations of vessel disease with AD dementia to that of gross infarcts, shows that moderate atherosclerosis and severe arteriolosclerosis have comparable effects to gross infarcts (OR=1.63). The effects of vessel pathology on the probability of AD dementia are shown in Figure 2 , panel A.\nWe next explored whether other factors may account for the observed associations of vessel disease with AD dementia. In these secondary analyses, we first controlled for the presence of APOEε4. Results were essentially unchanged, with both atherosclerosis (OR=1.31; 95%CI:1.11-1.57) and arteriolosclerosis (OR=1.21; 95%CI:1.04-1.41) remaining associated with a higher odds of AD dementia. In another model, we controlled for vascular risk factors (hypertension, diabetes, and smoking), and again, results were similar for both atherosclerosis (OR=1.32; 95%CI:1.10-1.58) and arteriolosclerosis (OR=1.19; 95%CI:1.02-1.39). Finally, four additional analyses separately examined for the presence of interactions of vessel disease by each of 1) age, 2) any infarct (gross or microscopic), and AD pathology using 3) the global measure and separately, 4) the pathologic diagnosis of AD. No interactions were found (all p>0.25), suggesting that the associations of atherosclerosis and arteriolosclerosis with AD dementia were not modified by age or the other common pathologies of dementia (infarcts and AD)."}, {"section_title": "Vessel disease and level of global and domain specific cognitive function", "text": "We first considered the outcome of global cognition and then the outcomes of five separate cognitive domains, including episodic memory, semantic memory, working memory, perceptual speed, and visuospatial abilities. Greater severity of both atherosclerosis and arteriolosclerosis were each associated with lower scores for global cognition ( Table 3 ). The additive effects of vessel disease on lower global cognitive function, after taking demographic and other common vascular and neurodegenerative pathologies of dementia into account, are depicted in Figure 2 , panel B. In similar models for each of the five cognitive domains, we found associations of both vessel diseases with lower scores for function in each of the five cognitive domains, with the exception that atherosclerosis was not related to working memory, and arteriolosclerosis showed a borderline and nonsignificant association with visuospatial abilities (Table 3) .\nSecondary analyses were conducted to evaluate whether other factors affect the results with global cognition. Controlling for APOEε4 and vascular risk factors in two separate models did not change observed associations of vessel disease with lower scores for global cognition (all p values <0.087). Further, vessel disease did not interact with age, any infarct, or AD pathology using separately the global measure and pathologic diagnosis of AD (p>0.15 for all eight interaction terms), suggesting that the observed associations of vessel disease with cognition is not modified by these factors.\nWe conducted additional analyses to address the question whether results were affected by severity of dementia proximate-to-death. First, we repeated the analysis (from Table 3 ) but using the second to last evaluation proximate-to-death (rather than the last) as the global cognitive outcome measure. Second, we repeated the analysis but excluding those with severe cognitive impairment (those in the bottom 10 th percentile on the measure of global cognition). Results for these two sets of analyses were consistent with results in the primary analyses (Table 3) , with levels of severity of both atherosclerosis and arteriolosclerosis being associated with lower cognition (all p<0.040)."}, {"section_title": "Discussion", "text": "In this study of more than 1,100 community-dwelling older persons with and without dementia who came to autopsy, we found that moderate or more severe cerebral atherosclerosis and arteriolosclerosis are both common, being observed in more than a third of subjects, and that higher severity grades in each vessel pathology independently increase the odds of probable and possible AD dementia, independent of the effect of infarcts and AD pathology. Interestingly, both atherosclerosis and arteriolosclerosis are associated with lower scores on summary measures of a range of cognitive domains, including episodic memory, the hallmark of AD pathology, as well as perceptual speed, the hallmark of vascular pathologies. Scientific work by many research groups have now established a relation of vascular disease, and cerebral vascular disease in particular, to dementia including the clinical syndrome of AD dementia, and to cognitive impairment. [2] [3] [4] [5] [6] [7] [8] [9] [10] [21] [22] [23] While there is a substantial body of literature suggesting that extracranial atherosclerosis, usually detected by in-vivo imaging such as ultrasonography, is associated with a higher risk of dementia, including AD dementia, 3, 21-23 these in-vivo studies cannot adequately address the direct role of large artery atherosclerosis separate from the downstream effects of infarcts, especially those less than 3mm and not detected by routine neuroimaging; as well as effects of AD pathology. Indeed, atherosclerosis is related to not only gross infarcts but also microinfarcts. 18, 24 A recent study using postmortem data from about 600 older persons, found that internal carotid artery stenosis of >70% was associated with a doubled odds of dementia. 25 Analyses were not adjusted for gross or micro-infarcts, nor for other common brain pathology, whether AD pathology or arteriolosclerosis. Few studies have specifically examined intracranial vessel. Several clinical-pathologic studies from another group, including smaller studies with 20 to 100 subjects and one study with nearly 400 subjects, have shown that atherosclerosis in the circle of Willis is associated with dementia, including AD dementia. 6, 8, 10, 26 Another study of 200 subjects from the Baltimore Longitudinal Study of Aging Cohort, found that the presence of intracranial atherosclerosis (found in about two-thirds of the cohort) was associated with a higher odds of dementia separately from brain infarcts including microinfarcts. 9 Our study confirms these findings and advances the field in several important ways. We found that more severe atherosclerosis in the circle of Willis corresponds to the odds of AD dementia being higher by about 30% per level increase in severity of vessel disease, even after taking into account arteriolosclerosis, and controlling for both gross and microscopic infarcts, as well as AD pathology. Further, other factors commonly associated with dementia were also considered. APOEε4 and vascular risk factors, such as hypertension and diabetes, did not affect the observed associations. Also, age, infarcts, and AD pathology did not modify the effects of cerebral vessel disease on AD dementia. Moreover, results were not modified by the presence vs. absence of a pathologic diagnosis of AD suggesting that vessel pathology contributes to cognitive impairment similarly in those with and without an underlying AD pathophysiologic process. Given the relationships of atherosclerosis and infarcts, and of atherosclerosis and AD pathology in some studies, these data strongly suggest that atherosclerosis may be directly contributing to brain functional impairment (dementia) through mechanisms other than infarcts or AD pathology.\nThere has been increasing interest in the role of small vessel disease and dementia. While studies of microinfarcts are common, we are not aware of any previous study relating cerebral arteriolosclerosis to dementia. Our data show that pathologically detected arteriolosclerosis is independently associated with a higher odds of AD dementia (in this case, 20% higher per level increase in severity of arteriosclerosis). Again, this appears to be a separate effect from the effects of infarcts and AD pathology, and the finding remains unchanged when controlling for other factors that are associated with dementia, including APOEε4 and vascular risk factors. The ORs for dementia were not affected by age or by the presence/severity of other common neuropathologies. Of note, though there was a relationship between atherosclerosis and arteriolosclerosis, they were both considered in the same model and were found to be independently associated with AD dementia. The pathophysiologic pathways linking large and small cerebral vessel disease to dementia need further characterization.\nBecause dementia occurs along a disease spectrum and typically starts with more limited impairment in select cognitive domains, we also wanted to examine the relation of cerebral vessel pathology to overall and specific cognitive functions. This examination may allow early detection and treatment of impairment, clinical discrimination of AD vs. vascular pathologies, and shed further light into the pathophysiologic mechanisms by which vessel disease leads to dementia. The scientific data available to date on the association of vessel disease with cognition is largely derived from studies of peripheral and extracranial vasculature, and has focused on atherosclerosis. These data suggest, rather consistently, that atherosclerosis outside the brain is associated with lower levels of cognition and cognitive impairment, even among persons without dementia. [27] [28] [29] [30] [31] [32] In addition, one study used brain autopsy data of vessel disease, in 47 cases for whom a Clinical Dementia Rating (CDR) score was retrospectively determined. 33 Authors found that cerebral small vessel disease, including \"arteriosclerosis/lipohyalinosis\", was inversely/negatively correlated with the CDR score. We are not aware of any previous study examining the relationship of cerebral vessels to performance-based measures of cognition. Our novel data show that greater severity in each of cerebral atherosclerosis and arteriolosclerosis, is associated with a lower levels of function in a performance-based summary measure of global cognition. These findings are independent of infarcts and AD pathology, are unchanged when controlling for APOEε4 and vascular risk factors, and are not modified by age or other pathologies. Furthermore, we examined relations of both cerebral vessel diseases to five separate cognitive domains, and found that atherosclerosis and arteriolosclerosis were associated with lower performance across almost all domains, including memory and perceptual speed. This suggests that the effect of cerebral vessel disease on cognition may be more widespread than anticipated, and contrast with reports suggesting that peripheral atherosclerosis is associated with specifically executive function and processing speed, rather than with memory. 4, 5 Mechanisms underlying the associations of cerebral vessel diseases with a higher odds of the clinical syndrome of AD dementia and with lower function on a range of cognitive domains remain elusive. Indeed, vascular risk factor studies are limited in their ability to determine underlying mechanisms linking vessel disease to dementia. In our neuropathologic study, we considered several mechanisms. One mechanism may be through AD pathology itself, for instance if cerebral vessel pathology somehow hindered clearance of amyloid-beta from the brain and promoted accumulation of this protein and deposition of plaques. Previously published neuropathologic studies on cerebral vessels and AD pathology are mixed, with some studies showing an association and others not. 24,33-35 While we did not examine the relation of cerebral vessel disease with AD pathology here, this raises the possibility that other mechanisms are at play, possibly resulting in an effect by which cerebral vessel disease lowers the threshold for the clinical expression of AD. This mechanism has been postulated for other biologic processes leading to dementia, including vascular ones such as diabetes. 36 Another mechanism is that cerebral vessel disease increases dementia via other vascular pathologies, most notable infarction. Indeed, we have recently shown that atherosclerosis and arteriolosclerosis are each associated with microinfarcts, and subcortical microinfarcts in particular, and that microinfarcts are associated with an increased odds of dementia and with lower cognition. 18, 19 Nonetheless, our findings reported here were after accounting for both AD pathology, and gross infarcts and microinfarcts as co-variates in analyses. In addition, AD pathology and the presence of infarcts did not modify the association of vessel disease with dementia. These findings suggest that cerebral vessel diseases are linked to dementia via mechanisms other than AD pathology or frank infarction. Interestingly, microinfarcts were not strongly related to cognition with vessel diseases and gross infarcts included the statistical models. However, our assessment of microinfarcts is likely not capturing all of this pathology given the limited sampling of brain regions. The role of microinfarcts and other vascular pathologies needs further research. Indeed, other vascular pathologies such as white matter disease, have not been considered. Therefore, these and other plausible mechanisms need to be examined in future studies of cerebral vessel disease and dementia and cognitive function, including breakdown of the blood-brain barrier, inflammation, oxidative stress, and others (for review, please see 37 ).\nThis study has several limitations. First, this is an observational study and does not establish causation between brain pathology and function. Indeed, most neuropathologic studies examine for associations, but can only infer causation and mechanism. Yet, this limitation is inherent to most clinical-pathologic studies, and in the absence of in-vivo assessment of intracerebral vessel disease, these designs are currently one of the only ways to examine cerebral vessel disease, particularly small vessel disease, and dementia in humans, underscoring the value of clinical-pathologic studies in research on mechanisms contributing to dementia. Furthermore, neuropathologic studies are uniquely poised to take into account the full range of the most common causes of dementia, namely AD pathology and vascular disease including microinfarcts, which cannot be easily detected postmortem at this time.\nControlling for, and looking for interactions with these pathologies are important considerations in order to determine the independent effects of cerebral vessel diseases on dementia. Second, the extent of the cerebral vessel disease is likely underreported in our data collection and only select areas of vasculature were examined, a particularly notable weakness for the assessment of atherosclerosis which was limited to the circle of Willis. Third, this study was not able to characterize the mechanisms linking vessel disease to dementia and lower cognition. Importantly, we did not assess for white matter disease, yet this pathology likely plays a role in the relation of vessel disease to cognition. Finally, while we examined for confounding and effect modification by age, and conducted additional analyses taking severity of dementia into account, we cannot exclude that these and other factors may play a role in the relation of vessel disease to dementia.\nThere are important strengths of this study. Logistic regression analyses are event-driven and the number of events in this sample (AD dementia) was large. 38 Indeed, there was a total of 478 AD dementia events among the 1,143 subjects, and models considered a total of nine variables (Table 2) , with an adequate event-per-variable (EPV) ratio of 53. The total sample size was large and subjects with and without dementia were derived from a prospective, community-based cohort study with high follow-up and autopsy rates, enhancing the study validity and generalizability of the findings. Also, data in our study is overall very complete, with at least 94% (1,077 of the total of 1,143) subjects included in the models. Participants not included in the models did not differ by age or sex (data not shown). The clinical evaluations provided detailed, performance-based neuropsychological test data collected annually, summarized in measures of global cognition and separate cognitive domains, and included cognitive data and dementia status proximate-to-death. Furthermore, the neuropathologic data were available on two different but related types of cerebral vessel diseases and analyses considered severity grade rather than dichotomous measures of present vs. not. Also, neuropathologic evaluations were conducted blinded to clinical data, and documented the known common pathologies of dementia including infarcts and AD pathology, which were included in analyses of this study. Finally, confidence in our findings from this cross-sectional, clinical-pathologic study is strengthened by several factors, including 1) the biologic plausibility of a relation of cerebral vessel disease to dementia; 2) the consistency of the findings for both dementia and cognitive impairment across domains, and consistency of our findings with the literature, and 3) the strength of the associations detected."}, {"section_title": "Contributors", "text": "ZA conducted the literature search, conceptualized the study, collected data, designed the study, analyzed and interpreted data, drafted the first version of the manuscript, and revised the manuscript; she had full access to all the data in the study and takes responsibility for the integrity of the data and the accuracy of the data analysis. AWC analyzed and interpreted data, and revised the manuscript. SEL interpreted data and revised the manuscript. DAB conceptualized the study and revised the manuscript. JAS conceptualized the study, collected data, designed the study, interpreted data, and drafted and revised the manuscript."}, {"section_title": "Supplementary Material", "text": "Refer to Web version on PubMed Central for supplementary material."}, {"section_title": "Research in context", "text": "Evidence before this study\nWe conducted a review of the published medical literature, using PubMed up to January 2016, with the terms atherosclerosis and (arteriolosclerosis or lipohyalinosis) and dementia. No limits were set in any of the filters. This yielded 16 citations which were each reviewed. After excluding the six review articles, one case report, and four studies with a small number of subjects (n<75), there were 5 remaining studies. None of these five studies directly examined either dementia or cognition, in relation to both atherosclerosis and arteriolosclerosis. This systematic review of the literature suggests that little is known about the relation of intracranial cerebral vessel disease to dementia and cognition. Furthermore, there are few pathologic studies on intracranial vascular disease and dementia. Yet, pathologic studies are able to capture data not only on large but also small vessel pathology, which can only be indirectly assessed using in-vivo imaging. Moreover, as cerebral vessel disease is related to infarcts, and arguably AD pathology, the most common underlying dementia pathologies, pathologic studies are able to control for infarcts, as well as AD pathology, to study the independent effect of both atherosclerosis and arteriolosclerosis separate from these other common pathologies."}, {"section_title": "Added value of this study", "text": "This clinical-pathologic study examined association of cerebral large vessel (atherosclerosis) and small vessel (arteriolosclerosis) neuropathology with the clinical syndrome of Alzheimer's disease (AD) dementia and with the level of cognitive function proximate-to-death, in a large group of more than 1,100 older, community-dwelling persons with and without dementia, who were clinically evaluated annually until death and came to autopsy. Results show that atherosclerosis and arteriolosclerosis are related to each other, but each separately contributes to the odds of AD dementia by 20-30% per level increase in vessel disease severity. Atherosclerosis and arteriolosclerosis are associated with lower scores in perceptual speed, the hallmark of vascular pathology, but also in episodic memory, typically considered the hallmark of AD dementia. Results are independent of the effects of infarcts (both gross and micro-infarcts) and AD pathology, and not modified by age, infarcts, or AD pathologies. And, results are essentially unchanged when taking APOEε4 and vascular risk factors into account. These data add important information to the current state of knowledge of intracranial vessel disease and dementia and cognition."}, {"section_title": "Implications of all the available evidence", "text": "Cerebral vessel pathologies, specifically intracranial atherosclerosis and arteriolosclerosis, are both common, under-recognized, and independent pathologies associated with AD dementia. This study lays the foundation for future research to examine pathophysiologic mechanisms by which vessel disease leads to dementia, to discriminate cognitive impairment from AD versus vascular pathology, and to detect and treat in the early phases the cognitive impairment due to vessel disease. Distribution of cerebral vessel disease, with and without infarcts, shown separately in subjects with and without AD dementia Legend: The distribution of cerebral vessel disease (atherosclerosis and arteriolosclerosis) is shown in the left panel for subjects without dementia, and in the right panel for subjects with AD dementia. Each wedge of the pie shows the proportion of subjects with or without atherosclerosis, arteriolosclerosis, and/or infarct(s), with percentages indicated at the periphery. Atherosclerosis and arteriolosclerosis (in color) are considered present when of moderate severity or greater. Infarcts are considered present if any infarct, whether a gross or micro-infarct, is detected on the neuropathologic evaluation. The proportion of subjects in each vessel category who also have infarcts is shown in black diagonal lines (hatch). Note the increased proportion of subjects with vessel disease among subjects with AD dementia, compared to those without. "}]