[{"section_title": "Abstract", "text": "We use the National Longitudinal Study of the High School Class of 1972 and the Education Longitudinal Study of 2002 data sets to evaluate changes in the college matching process. Rising attendance rates at 4-year institutions have not decreased average preparedness of college goers or of college graduates, and further attendance gains are possible before diminishing returns set in. We use multinomial logit models to demonstrate that measures of likely success ðgrade point averageÞ became more predictive of college attendance over time, while other student characteristics such as race and parents' education became less predictive. Our evidence suggests that schools have become better at sorting while students have efficiently responded to changes in the return to higher education."}, {"section_title": "I. Introduction", "text": "Over the past half century the percentage of students in high school cohorts who attend 2-year and 4-year institutions within the first 2 years after leaving high school have both increased significantly. Theoretically, the effect of this increase on the average quality of the student body is not clear. On the one hand, a diminishing returns argument would suggest that the quality of the marginal student is lower than the quality of other students, so the average quality should decrease. On the other hand, the matching process between students and colleges could become more meritocratic so that, despite diminishing returns, the quality of the average student could increase.\nThe matching process is indeed both messy and complex. Students have to choose to start at a 2-year school or a 4-year school. year-olds play a significant role in these decisions, and they cannot all be counted on to behave sensibly. Attending college requires a considerable up-front expenditure as well as significant forgone income, which may rule out some students with considerable ability. Liquidity constraints combined with fear of borrowing may hold back other high-ability potential college students. Also, the process of applying to college and applying for financial aid is complex, and many talented students come from families that do not know how to help them cut through the complexity. Students often lack good information about the quality of the potential matches they could make at various educational institutions.\nRecent research has highlighted the haphazard nature of matches made between students and colleges. Some of this literature focuses on the students at the top of the ability distribution. Many of these students do not link up with selective colleges to which they could easily gain admittance ðe.g., Hoxby and Avery 2012; Dillon and Smith 2013Þ. The mismatch problem, however, concerns much more than selection into elite institutions. Some very talented high school students do not attend college at all ðBowen, Chingos, and McPherson 2009; Roderick et al. 2009Þ . Some students do not do a very good job choosing between 2-year and 4-year institutions ðBrand, Pfeffer, and Goldrick-Rab 2012Þ. And schools themselves may have improved selection procedures in ways that increase the proportion of top students who attend. All of these margins are potentially important. If mismatching is a significant issue, we can potentially expand the percentage of the college-age cohort in college without any reduction in average student quality that could depress completion rates. But that potential can be short-circuited if the evidence of diminishing returns is substantial.\nAs college attendance rates rose in the period from 1970 through the 1990s, the completion rate conditional on attendance began to decline. Explaining this set of facts spawned a considerable literature, and the possibility of diminishing student quality is a key part of the discussion. One strand of that literature examines labor market outcomes. Carneiro and Lee ð2011Þ find declining wage premiums for graduates, wherever they settle, if they came from a region that experienced rapid growth in the pool of graduates from that region's colleges and universities. 1 Bound, Lovenheim, and Turner ð2010Þ advance a very different argument. They use two large longitudinal data sets-the National Longitudinal Study of the High School Class of 1972 ðNLS-72Þ and the National Education Longitudinal Study of 1988 ðNELS:88Þ-to study the falling completion rate directly from survey data. Using math standardized test scores as a measure of student ability, they find no direct evidence of falling student quality when comparing these two cohorts. Instead, they conclude that the declining completion rate is due to the funding falloff at nonflagship public institutions that serve the most vulnerable part of the college-going population. Lovenheim and Reynolds ð2011Þ use multinomial logit models to examine the choices that high school graduates make across 2-year programs, 4-year programs, or nonattendance using the 1979 and 1997 cohorts of the National Longitudinal Survey of Youth ðNLSYÞ. They use Armed Forces Qualification Test ðAFQTÞ scores to measure ability. They find significant increases in college going among higher-ability students.\nIn this paper, we extend the work done by Bound et al. and Lovenheim and Reynolds in a number of ways. Like them, we use two nationally representative surveys to study changes in college matching. We compare over the 32 years between the NLS-72 and the Education Longitudinal Study of 2002 ðELS:2002Þ, which describes the high school class of 2004. The extended time frame gives us several benefits. Between the cohorts of the 1990s ðlike the NELS:88 high school class of 1992Þ and the cohort represented in the ELS:2002, the college attendance rate has continued to climb. If marginal student quality is indeed diminishing, the evidence should be clear using a more recent high school cohort. In addition, we show with census data that the overall college completion rate has begun to rise and is now similar to its 1970s levels. This reversal of the completion rate trend adds value to studying more recent data like the ELS:2002. In addition, we check our conclusions using the NLSY's 1979 and 1997 cohorts. Using these intermediate samples, we substantially replicate the results we get from the wider time span of the NLS-72 and ELS:2002. We separate students attending 2-year programs from students in 4-year bachelor of arts programs. This allows us a more nuanced perspective on matching, and it differs from that in Carneiro et al. ð2011Þ and Carneiro and Lee ð2011Þ, which aggregate 2-year and 4-year students. We find that college attendance patterns differed substantially between 2-year and 4-year college goers.\nIn contrast to Bound et al. and Lovenheim and Reynolds, we use three predictors of student ability: reading test scores, math test scores, and the student's high school grade point average ðGPAÞ expressed as a percentile of the national sample distribution. As Geiser and Santelices ð2007Þ demonstrate, despite being a noisy measure of student ability, high school GPA is a very good predictor of college success.\nTo preview our results, between the high school classes of 1972 and 2004 we observe no decrease in the average quality of students attending 4-year institutions despite the substantial increase in attendance rates. Most of the increase in 4-year college attendance has come from the top half of the GPA and test score distributions. Attendance at 2-year colleges has also expanded, and at these institutions the average quality of the student body has decreased. The mechanism that allowed 4-year college attendance rates to increase without reducing average student quality involved higher attendance rates of well-prepared students, diminishing roles of race and parents' education in the college attendance decision, and an increasing effect of high school GPA on 4-year college attendance.\nOur approach presumes that moving up ðor downÞ the distribution of measurable traits-such as the average college-going student's percentile in the GPA distribution-means that the average student is of higher ðor lowerÞ \"quality\" in the sense that he or she is better ðor worseÞ prepared for college work. By contrast, if the whole talent distribution shifted to the left, then students at the mean of the distribution would be less prepared for college work. In this case we might not observe any diminishing returns in the data while still feeling the impact of diminishing quality on things like graduation rates. This could be the case if the kindergarten through grade 12 system is declining in ways that reduce the average student's capacity to succeed in college or if other skill correlates of adult outcomes are worsening. Although a leftward shift in the overall talent distribution is a possibility, there is good evidence that the characteristics of youths that correlate with adult outcomes are improving instead of worsening ðInstitute for Education Sciences 2009; Altonji, Bharadwaj, and Lange 2012Þ."}, {"section_title": "II. Data", "text": "The NLS-72 and ELS:2002 from the US Department of Education provide longitudinal data on cohorts of high school students. We use them to analyze a representative sample of high school seniors in 1972 ðNLS-72Þ and a representative sample of high school seniors in 2004 ðELS:2002Þ. For our analysis sample, we select respondents who completed high school by graduating or obtaining a general equivalence certificate. 2 The 32-year gap between these data sets offers a long-run window on important changes in matching between students and schools. To investigate changes in the determinants of college going, we focused on variables that were available in both surveys.\nOur dependent variable is college attendance, which we measure from survey questions about whether the respondent was enrolled in school in October after normal high school graduation and October of the following year ðOctober 1972 and October 1973 in NLS-72; October 2004 and October 2005 in ELS:2002Þ. We categorize a respondent as attending a 2-year college if she did so in the first year or if she did not attend college in the first year but attended a 2-year college in the following year. We categorize a respondent as attending a 4-year college if she did so in the first year or if she did not attend college in the first year but attended a 4-year college in the following year. We categorize a respondent as not attending college if she reported attending neither a 2-year nor a 4-year college in both survey questions. 3 Our choice of independent variables is guided by similar studies that utilized multiple data sets to study college attendance. Ellwood and Kane ð2000Þ use data from the High School and Beyond high school class of 1980 and the NELS:88 high school class of 1992. Belley and Lochner ð2007Þ and Lovenheim and Reynolds ð2011Þ use the NLSY79 and NLSY97. The sets of variables in these studies were similar in several respects. All these studies included variables for sex, race, parents' education, income, and student ability. 4 Most of the variables we utilize are measured in the same fashion in the two surveys. There are three important exceptions. The first is family income, which in each survey is measured using a series of indicator variables for nominal income at the time of the survey. To obtain comparable data we first adjusted the boundaries for family income using the consumer price index so that the income boundaries for the NLS-72 variables were expressed in 2002 dollars. This yielded four income categories for which the NLS-72 boundaries lined up with the ELS:2002 boundaries: family income less than $25,000, family income between $25,000 and $50,000, family income between $50,000 and $75,000, and family income greater than $75,000 ðall in 2002 dollarsÞ. We would have preferred more categories, but we have preserved a common definition of income across time. 5 The second exception is test scores. The two surveys gave students different aptitude tests in mathematics and reading. We express test scores as percentiles in the sample's distribution ðseparately for NLS-72 and ELS: 2002 samplesÞ so that the units would be the same for both surveys. The NLS-72 respondents took the aptitude tests in the twelfth grade, while the ELS:2002 respondents took the aptitude tests in the tenth grade. The test instruments were different between the surveys but assessed similar proficiencies. 6 3 Our measure of college attendance excludes students who significantly delay going to college. The NLS-72 and ELS:2002 include surveys 2 years after normal high school completion, but the timing of subsequent follow-up surveys is not consistent between the two. However, our definition catches the bulk of the traditional college population. In our analysis of the NLSY79 and NLSY97, we use the more consistent follow-up survey timing to identify people who begin college between 2 and 6 years following high school completion. They constitute a small fraction of college goers. When we estimate our main specifications with the NLSY data, expanding the time horizon does not change the main results. 4 The parents' education variable takes on the value of the higher level of education between the respondent's mother and father. 5 In the NLS-72, our lowest family income category includes those reporting less than $6,000 of family income in 1972 nominal dollars. The subsequent categories include those reporting between $6,000 and $12,000, between $12,000 and $18,000, and more than $18,000. Family income data in the NLS-72 come from the student questionnaire. When the data are missing, we impute family income on the basis of parents' occupations and annual salaries by occupation in the 1970 US census. 6 The NLS-72 reading test presented short passages for students to analyze and interpret, although the main focus was \"straightforward comprehension.\" The NLS-72 math test The third variable measured somewhat differently between surveys is the high school GPA. Both come from surveys of high school administrators rather than the students themselves, and they refer to GPA as of twelfth grade. The raw NLS-72 data are in different formats, including letter grades ðe.g., B1Þ, numbers on a 100-point scale, and numbers on a four-point scale. We convert letter grades to numbers on a four-point scale. We assign to each NLS-72 respondent her GPA's percentile within the group of students in the NLS-72 with the same grading system ðfour-point or 100-pointÞ. 7 The ELS:2002 GPA variable is on a four-point scale and measures the student's average grade across all academic courses. We calculate ELS:2002 respondents' GPA percentiles within the ELS:2002 distribution. Using percentile GPA scores maintains the same units between surveys and adjusts for average GPA increases over time ði.e., grade inflationÞ. Table 1 presents summary statistics for the variables included in our analysis. We present data for the full sample and for subsamples divided by high school GPA. Throughout the paper, our calculations use sampling weights that make sample statistics representative of high school senior classes in 1972 and 2004. Our use of weights explains why the subsample averages are not exactly equal to corresponding full-sample averages.\nThe data in the two halves of the GPA distribution are interesting ðcols. 3-6 of table 1Þ. Females are overrepresented in the top half of the GPA distribution in both surveys, and this overrepresentation increases over time. While females represent about half of the full sample, the female share in the top half of the GPA distribution is .578 in the NLS-72 and .598 in the ELS:2002. Whites and Asians are overrepresented in the top half of the GPA distribution in both surveys. Students whose parents have college degrees are overrepresented in the top half of the GPA distribution, particularly graduate degrees in the ELS:2002 sample, whose share increases from .174 of the full sample to .241 in the top half of the GPA sample. Students from families in the highest-income group in the ELS: 2002 survey are overrepresented in the top half of the GPA distribution, increasing from a .289 share in the full sample to a share of .364 in the top half of the GPA distribution.\nTo supplement our analysis, we also investigate college attendance patterns in the NLSY program. We compare the 1979 cohort ðNLSY79Þ with the 1997 cohort ðNLSY97Þ. The NLSY79 is a sample of American youths who were born between 1957 and 1964 and were first interviewed in 1979. The NLSY97 is a sample of American youths who were born between 1980 and 1984 and were first interviewed in 1997. Similarly to Lovenheim and Reynolds ð2011Þ, we select respondents who were 17 years old or younger at the first interview in order to observe sufficient detail about initial college attendance choices.\nAs in the NLS-72 and ELS:2002 samples, we select only respondents in the NLSY cohorts who completed high school. We categorize respondents by the year they finished high school and identify college attendance that took place in the same year or the following year. The NLSY cohorts fit in time between our other data sets. The NLS-72 respondents mostly completed high school in 1972; the NLSY79 respondents in our selected sample finished high school between 1979 and 1985, and 89 percent finished by 1982. The NLSY97 respondents finished high school between 1997 and 2009, and 90 percent finished by 2002. The ELS:2002 respondents mostly finished high school in 2004. We construct other variables in the NLSY cohorts following choices made for the NLS-72 and ELS:2002. We create a high school GPA measure as the average of course grades in the NLSY high school transcript files. Summary statistics and results tables for these data sets are available from the authors by request."}, {"section_title": "III. Grade Point Averages and College Success", "text": "In our analysis, we will place considerable emphasis on high school GPA as an indicator of college readiness. This is not typical in the literature. Belley and Lochner ð2007Þ, Bound et al. ð2010Þ , and Lovenheim and Reynolds ð2011Þ use standardized test scores exclusively. Bound et al. do not use GPA over concerns about comparing across schools in the presence of grade inflation. Ellwood and Kane ð2000Þ is the only study using more than one longitudinal data set that we found that included high school GPA.\nDifferences in school quality make GPA harder to interpret than nationally normed standardized tests. The development of college entrance exams was in part a response to colleges' reluctance to make admission decisions solely on the basis of grades whose information content varied across high schools. And there is no reason to suppose that grade inflation has proceeded at the same pace in all high schools. As a result, high school grades are a noisy indicator of ability. On the other hand, high school performance can capture potentially important noncognitive skills that are markers for college success. Bowen et al. ð2009Þ suggest that grades \"reveal qualities of motivation, and perseverance-as well as the presence of good study habits and time management skills-that tell us a great deal about the chances that a student will complete a college program\" ð24Þ. For similar reasons, DiPrete and Buchmann ð2014Þ find that even middle school grades are good predictors of college completion.\nPsychologists have found that noncognitive skills are strongly related to college success. This literature focuses on three particular noncognitive skills: conscientiousness, having an internal locus of control, and having self-control. Cobb-Clark ð2014Þ argues that having an internal locus of control is a necessary condition for the other two traits. Using four different samples, Noftle and Robins ð2007Þ show that conscientiousness is the personality trait that correlates with both high school GPA and college GPA, but not with Scholastic Aptitude Test ðSATÞ math or verbal scores. The correlation between conscientiousness and high school and college GPA holds in multiple regressions with controls for gender and SAT verbal and SAT math and for other personality traits. They also show that different \"facets\" of conscientiousness ðe.g., organization, diligence, perfectionism, etc.Þ that are positively correlated with college GPA are also positively correlated with high school GPA. Gray and Watson ð2002Þ also show that conscientiousness is highly correlated with both undergraduate and high school GPAs. Finally, Duckworth and Seligman ð2005Þ demonstrate that self-discipline is a better predictor of a student's GPA than the scores on an IQ test.\nThe problem is clear. Grades are imperfect measures, but GPA may contain important information about noncognitive abilities that is missed by standardized tests. Recognizing the potential pitfalls, colleges themselves have come to value the GPA measures in making admission decisions. Geiser and Santelices ð2007Þ summarize the internal data gathering done by universities this way: \"The superiority of HSGPA over standardized tests has been established in literally hundreds of 'predictive validity' studies undertaken by colleges and universities to examine the relationship between their admission criteria and college outcomes such as freshman grades\" ð4Þ. Using University of California system data, Geiser and Santelices also show that GPA becomes progressively more predictive of grades after the freshman year, and the superiority of GPA is \"consistently evident across all academic disciplines, campuses and freshman cohorts in the UC sample\" ð24Þ.\nTo investigate the relationship between high school GPA and test scores in our samples, we estimate linear probability models of 4-year college completion in each cohort. Our model controls for test scores-math and reading percentile scores in the NLS-72 and ELS:2002 and the AFQT percentile scores in the NLSY79 and NLSY97-GPA percentile, and other control variables listed in table 1. In addition, respondents in the NLSY79 were given tests measuring two of the important noncognitive skills, locus of control and self-esteem ðHeckman, Stixrud, and Urzua 2006Þ, and we included these test scores in our regressions for this sample. The locus of control measure is the Rotter score: higher values for the Rotter score imply a more external locus of control; that is, the individual feels that events are less within his or her control. This should be related to lower completion. The self-esteem measure is the Rosenberg scale. Higher values imply more self-esteem, and this should be positively related to completion. Table 2 gives the results of these regressions. For each sample we present two regressions. The first regression includes only test scores: for reading and math in NLS-72 and ELS:2002 and for the AFQT in the NLSY79 and NLSY97. The second regression adds high school GPA. The high school GPA percentile is clearly an important predictor of college completion in all the samples. The coefficients on test score percentiles decrease considerably when the GPA percentile is introduced. Even though different schools assign course grades, the GPA percentile contains information about a student's likely success in college beyond what is captured by test scores.\nThe regression for the NLSY79 sample is of particular interest. This is the regression in which we were able to include direct measures of noncognitive abilities others have found to be related to success in college. In the first NLSY79 regression, the measures of noncognitive skills have the anticipated sign and are marginally statistically significant. When GPA is added in the second regression, the absolute value of the coefficients on both noncognitive skill variables declines, and they are no longer statistically significant. The other pairs of regressions demonstrate that GPA is an important variable because it captures some of the effects on completion of cognitive abilities measured by test scores. The NLSY79 regression adds to this the finding that GPA also captures some of the effects of noncognitive skills on completion.\nAlthough high school GPA is not a perfect measure, we think that it captures both cognitive and noncognitive skills that are very important for success in formal education. The GPA measure is earned over the student's entire high school career, so it measures noncognitive abilities such as conscientiousness and staying on task with many observations ði.e., classesÞ. By contrast, test scores are measured at only one point in time. Given the strong results in table 2, our analysis will focus on the relationship between college attendance and high school GPA."}, {"section_title": "IV. Increasing Enrollment and Improving Matches", "text": "Over time the United States has been rather successful in linking more students to colleges and universities. In the NLS-72 data, 52.3 percent of .0052*** .0036*** .0044*** .0019*** ½t 5 17.9 ½ t 5 11.63 ½ t 5 14.73 ½ t 5 6.255 Reading test percentile .002*** .0012*** .0021*** 9.0e204*** ½t 5 6.51 Following the results in table 2 of the prior section, we focus on GPA as the main influence on how college going has changed across the distribution of ability. To describe the matching process between students and colleges, we divided students in each data set into 10 deciles on the basis of their high school GPA. Figure 1 presents these data for 4-year colleges. The NLS-72 attendance rates are dark bars, and the ELS: 2002 attendance rates are gray bars. For both surveys, the 4-year collegegoing rate was clearly related to high school GPA: students with higher GPAs go to college more frequently than students with lower GPAs. Looking first at the NLS -72 results, there is a lot of room in the top half of the GPA distribution for the 4-year college-going rates to increase. And the ELS:2002 results ðthe gray barsÞ fill in a lot of this room. Eightyone percent of the increase in 4-year attendance rates between the two surveys comes from students in the top half of the high school GPA distribution. The top three deciles alone generate half of the increase in 4-year college participation, and only 2.2 percent of the rise in participation comes from the bottom three deciles. Although the collegegoing rate increased in every decile but the bottom, the process was over- whelmingly driven by the well-prepared students in the top half of the GPA distribution. 8 There is clearly less scope today for further increases in 4-year attendance from the top deciles, yet we are far from the limiting case. In the ELS:2002 sample, the college-going rate for students in the top 10 percent of high school GPAs is 86.9 percent, and it is 79.5 percent, 68.1 percent, and 60.2 percent for students in the next three deciles. If attendance rates rose to 90 percent in the top four GPA deciles, then the overall attendance rate would increase from 47 percent to 52.1 percent. We can still raise overall college-going rates without having to slip down the GPA distribution. Figure 1 illustrates that college attendance is increasingly concentrated among students at the top of the high school GPA distribution. We could present similar figures comparing the NLSY79 and NLSY97, for test scores as well as GPAs, and for subsets of the data ðe.g., males and femalesÞ. As an alternative, we have devised a summary measure we can present in a simple table. Our measure is the share of a 4-year college-going cohort drawn from the top of the high school GPA ðor test scoreÞ distribution. At most this share could be 1.0. A value of 1.0 would occur if X percent of high school students attended a 4-year college and every one of those students was in the top X percent of the high school GPA ðor test scoreÞ distribution. In this case the college matching process is perfectly meritorious. A value of .75 would indicate that three-quarters of the students in a 4-year program came from the top X percent of the high school GPA ðor test scoreÞ distribution. Table 3 presents these calculations.\nThe results in the table illustrate that the findings displayed in figure 1 are not unusual. For GPA percentile and for each test score variable, 4-year college attenders are more likely to be drawn from the top of the distribution in the later surveys. This is true in the full sample and in the subsamples for men and for women. The patterns are similar when comparing the NLS-72 with the ELS:2002 and also the NLSY79 with the NLSY97. Students attending a 4-year college in 1997 or 2004 are much more likely to be good students as measured by GPA and test scores than were college attenders in 1972 and 1979. None of the measures is close to 1.0, so there is further room to increase the quality of the 4-year college class. Figure 2 presents the analogue to figure 1 for 2-year college attendance. In both the 1972 and 2004 cohorts, 2-year college attendance rates exhibit a much lower variance across the GPA deciles than do 4-year attendance rates. And unlike the gains in 4-year attendance, the bigger increases in 2-year college attendance are concentrated in the lower GPA deciles. Almost 83 percent of the increase in 2-year attendance between high school classes of 1972 and 2004 comes from the bottom half of the GPA distribution, and roughly half of this increase came from students in the bottom three deciles of the high school GPA distribution.\nOur results demonstrate that patterns of college attendance have shifted considerably in the 32 years between the high school class of 1972 and the high school class of 2004. Overall attendance rates have risen substantially. Higher-ability students are increasingly likely to attend 4-year colleges, while students of lesser ability who seek postsecondary training are increasingly likely to sort into 2-year colleges. The matching process remains far from perfect. Many students who could succeed in a 4-year institution enroll instead in a 2-year program, often for financial reasons. On average, these students pay a price in lower graduation rates. 9 Yet overall, the shift of higher-GPA students from 2-year to 4-year programs is an improvement in the college matching process. Table 4 gives the average percentiles of high school GPA and test scores by their college attendance choices. Focus first on columns 1 and 2 of Note.-Each panel shows a meritocracy measure based on a different high school performance measure ðGPA, math and reading tests, and the AFQTÞ. Let X be the share of high school graduates attending a 4-year college. Let Y be the share of students attending a 4-year college if their performance percentile is greater than or equal to 100 Â ð1 2 X Þ. Let Z be the share of all students whose performance percentile is greater than or equal to 100 Â ð1 2 X Þ.\nThen Y =Z is a measure of how meritocratic the college matching process is. The table reports Y =Z for each cohort and subsample. If Y =Z 5 1, then all of the students attending a 4 -year college are from the top percentiles.\npanel A. Each student fits in a percentile ð1-99Þ of the GPA distribution across seniors in his or her cohort ðNLS-72 or ELS:2002Þ. In the full sample ðtop panelÞ, the averages of these percentiles are near 50, as expected. This is true for math and reading test scores as well. The averages are not closer to 50 because of sampling error and attrition in the sample. Attrition happens because college attendance is known only for respondents to the follow-up survey, so we drop people who left the sample prior to that survey. The second panel shows averages of GPA and test score percentiles for students who attended any college, 2-year or 4-year. They are significantly higher than the overall averages. Also, percentiles are lower, particularly in math test scores, in the ELS:2002 results compared to the NLS-72 results. The third panel shows the same calculations for students who attended 2-year colleges. The levels of high school success of those who attended a 2-year college after finishing high school in 1972 are very close to the overall averages. Students in the 2004 cohort of high school graduates who enroll at 2-year programs are considerably less well prepared for college than the average student.\nThe final panel gives the results for students who moved from high school directly into a 4-year program. High school success in this group is higher than average, as expected. These students likely have the highest returns from college completion, and they have revealed through their high school performance a preference for attending college. If diminishing returns were a significant problem in 4-year college admissions, we would expect to see declining average quality; yet the GPAs and test scores of college goers in the NLS-72 and ELS:2002 are very similar. The average GPA and reading test score percentiles are actually slightly higher in the ELS:2002, while the average math test score percentile is slightly lower. Even though 4-year college attendance increased substantially between the two time periods ðby 13.6 percentage pointsÞ, the average preparation of 4-year college attenders did not fall. This implies that the marginal 4-year college goer was probably not less well prepared in 2004 than in 1972. Diminishing returns remain a theoretically valid concern, but if constraints are being relaxed in a way that permits more high-ability students to go to college, the entire marginal relationship between college going and college preparation is shifting upward. If we are moving down a marginal curve that is shifting upward, the quality of the marginal student enrolled in a 4-year program can remain constant. Columns 3 and 4 of table 4 repeat the exercise accounting for the attrition between the survey of seniors and the survey 2 years later that measures college choice. The attrition induced positive selection on GPA and test scores, and this effect was strongest in the ELS:2002 ðsee the top panel of col. 2, where average percentiles in the 2-years-later sample are somewhat higher than 50Þ. This attrition would mechanically increase the measured college preparation of college goers over time and offer unwarranted support for our result. So for columns 3 and 4, we calculate GPA and test score distributions in the sample of respondents to the follow-up survey 2 years after expected high school graduation. This nets out the attrition effect on average GPA percentiles. The averages of percentiles in the ELS:2002 are closer to 50 ðtop panel of col. 4Þ. Accounting for the attrition, the bottom panel ðcols. 3 and 4Þ shows again that average college preparation of 4-year college attenders did not decline between 1972 and 2004, despite the large increases in attendance rates. In addition, the standard deviation of the GPA percentile distribution of college goers between the 1972 and 2004 cohorts was essentially unchanged. The younger cohort does not have a fatter left tail of students who are mismatched in 4-year programs.\nPanel B of table 4 shows similar comparisons over time of average high school success by college attendance in the NLSY cohorts. Columns 1 and 2 describe the earlier ð1979Þ and later ð1997Þ cohorts. Similar to the prior results, average GPA and test score ðAFQTÞ percentiles fall over time among 2-year college attenders. However, there is little evidence of a reduction in college preparation among 4-year college attenders: the average GPA percentile increased over time, while the average AFQT percentile decreased a little.\nA limitation of the prior analysis is that our measures of preparation for college were not standardized over time. Reaching a given percentile in the 1972 high school class GPA or test score distribution did not clearly imply the same level of preparation as reaching the same percentile in the class of 2004. Our conclusions so far have been about changes over time in the preparation of college attenders relative to peers in their own cohort.\nOur use of the NLSY cohorts enables us to provide evidence about changes in the absolute level of preparation for college. Altonji et al.\nð2012Þ construct a consistent version of the AFQT score in the NLSY79 and NLSY97 data sets that can be interpreted as a measure of cognitive ability that is comparable across time. The \"standardized AFQT\" rows in our table 4 show averages of this cognitive skills measure by college attendance in the NLSY79 and NLSY97. The standardized AFQT score fell among 2-year college attenders. The mean among 4-year attenders fell as well, but the change is very small. We view this as evidence that the preparation of 4-year college attenders did not fall substantially between the early 1980s and 2000s, despite large increases in the college-going rate.\nIn their work using the 1972 and 1992 high school senior cohorts ðNLS-72 and NELS:88Þ, Bound et al. ð2010Þ also showed that \"math percentiles remained constant or increased in all four year ½college sectors across the two surveys\" ð137Þ. 10 Our ELS:2002 end point is 12 years later than theirs, which adds credence to the long-run proposition that diminishing returns are not a significant issue. Moreover, we think that the results for GPA are more telling given the links between GPA and noncognitive skills that predict college success. And our results for reading test scores also show increases in average preparedness. Results with standardized overtime AFQT scores in the NLSY cohorts further support this finding. Fouryear college going increased and student quality did not decline."}, {"section_title": "V. Multinomial Logit Estimates", "text": "Tables 5 and 6 present average marginal effects from multinomial logit models of college attendance in which the choice is among three options: attend no college, attend a 2-year college, or attend a 4-year college. Table 5 gives the estimates for the full sample while table 6 gives the estimates for the top half of the GPA distribution. We computed the standard errors for the changes in the marginal effects under the assumption that the estimates using the NLS-72 data and the ELS:2002 data are independently distributed.\nColumns 1 and 3 in the tables present the association between a oneunit increase in each independent variable and the predicted probability of 2-year college attendance, and column 5 gives the difference between the two estimated marginal effects. Our discussion will focus on the results for 4-year attendance in columns 2, 4, and 6. In the full sample, the marginal effect of being female is negative in both data sets, but the effect is very small and statistically insignificant in the ELS:2002. The change is much greater in the top half of the GPA distribution, where being female goes from being a 5.94 percentage point disadvantage to being a 2.76 percentage point advantage.\nThe two statistically reliable results for racial categories are for blacks and Asians. The marginal effect for blacks is 25.14 percentage points in The effect of parental education levels on 4-year college attendance in the NLS-72 data is very strong, but it is much weaker in the ELS:2002. This pattern repeats in the results for the top half of the GPA distribution. Family income has the effects one would expect. Students from families with higher income are more likely to attend 4-year colleges, and given the higher prices of 4-year schools, the effects are much larger than the comparable effects for 2-year schools. Also, the effects for the full sample and the top half of the GPA distribution are quite similar in the NLS-72 and the ELS:2002.\nThe results for GPA suggest that the marginal effect of GPA on the likelihood of attending 4-year college is very large, and much larger than the effect on 2-year enrollment. A 10 percentile increase in GPA increases 4-year attendance by 3.3 percentage points in the NLS-72 full sample and 5.7 percentage points in the ELS:2002. In the top half of the GPA distribution ðtable 6Þ, these effects are even larger: 4.8 percentage points for the NLS-72 and 6.1 percentage points for the ELS:2002. Grades matter a great deal. Math scores also matter, but the effects are slightly smaller, particularly in the ELS:2002. As an example, in the overall sample a 10 percentile increase in the math test score has a marginal effect of 3.2 percentage points for the NLS-72 and only 2.1 percentage points in the ELS: 2002. Reading scores also have significant effects, but the effects are much smaller than they are for GPA and math scores. 11 We estimated analogous multinomial logit specifications with the NLSY79 and NLSY97 data as well. The results were very similar. 12 Higher GPA percentiles are strongly predictive of 4-year college attendance, and this relationship grows stronger over time. The estimated effects of race and ethnicity and parents' education fall over time. One of the limitations of the NLS-72 and the ELS:2002 was the use of different math and reading tests across cohorts. The fact that results in the NLSY analysis using the AFQT score for both cohorts were similar suggests that any difficulties created by differences in the tests of math and reading are not important."}, {"section_title": "VI. Discussion of Sorting into College", "text": "Between 1972 and 2004 the United States increased its college-going rate from 52.3 percent of the high school class to 73.4 percent, with 4-year college attendance accounting for the majority of the increase. One might expect to see a decrease in the preparedness of the average student enrolled at a 4-year institution, but in Section IV, we demonstrated that there has been no such decrease. The same cannot be said for the group of students at 2-year schools: the average percentiles of GPAs, reading tests, and math tests for students attending 2-year colleges all decreased. These results are consistent with the broad shift in college attendance that has sorted better-prepared students to 4-year colleges and sorted less wellprepared students to 2-year colleges.\nThe results in tables 5 and 6 reveal several mechanisms that explain the preservation of student ability despite a substantial rise in college attendance. Some of these mechanisms are driven by the changes in behavior of potential students while others are the result of changes in the behavior of colleges and universities. We will start our discussion with changes in student behavior.\nFirst, well-prepared women moved increasingly into 4 -year programs over time. Women's college attendance rose by 28.6 percentage points compared to the overall increase of 21.1 percentage points, and women's 4-year college attendance rose 18.2 percentage points compared to the overall increase of 13.5 percentage points. Women now make up more than half of students enrolled in 4-year programs. In addition, our results show that the marginal effect of being female on 4-year attendance increased 8.71 percentage points between 1972 and 2004 for women in the top half of the GPA distribution ðcol. 6 in table 6Þ. 13 In contrast, the marginal effect of being female on 2-year attendance did not change for women in the top half of the GPA distribution ðcol. 5 in table 6Þ, so the fullsample increase at 2-year colleges was driven by respondents in the bottom half of the GPA distribution. In sum, more women went to college, and other things equal, the impact of being a woman increased 4-year attendance for well-prepared women and 2-year attendance for less wellprepared women. This improvement in sorting for women plays a large role in explaining the improved sorting overall.\nThe striking rise in the female share of the college-going population is the subject of a paper by Becker, Hubbard, and Murphy ð2010Þ. They build a model of the supply of and demand for highly educated labor to explore the reasons behind the fact that women have overtaken men in attending and completing a 4-year degree program. In their model, the population distribution of noncognitive abilities plays an important role as a supply shifter affecting the number of graduates. Using grades from primary, secondary, and tertiary schooling as \"a crude but broad measure on noncognitive skills relevant to schooling\" ð227-28Þ, they find that the female distribution of grades has a higher mean, while the male distribution has a higher variance. Higher noncognitive ability translates into a lower nonmonetary cost of attendance because the average woman finds college success easier than the average male. Since the male distribution has fatter tails, at low levels of the college wage premium, earning a degree will pass the cost-benefit test for more males than females. As the return to higher education rises, we move into a part of the noncognitive skill distribution that is fatter for women than for men, so female college participation grows faster than male participation. 14 The Becker et al. model is silent about improved sorting procedures by colleges. Nor does it suggest reasons for improved sorting among males. But improvements in college sorting would reinforce the process at work in their model unless the improvements were largely confined to males. We show that sorting improved for both men and women, and the results in table 3 indicate that the improvement is larger for women than for men.\nOther studies using multiple data sets have found similar shifts ðEllwood and Kane 2000; Belley and Lochner 2007Þ. 15 Goldin, Katz, and Kuziemko ð2006Þ discuss the substantial rise in college going and college completion for women ðsee also Buchmann and DiPrete 2006Þ. They suggest that the measured improvement in high school girls' achievement relative to boys is driven by higher expected returns to college due to improved labor market opportunities and a rising age at first marriage. They also show that long-standing behavioral and developmental differences between the genders have played a role in the new gender gap in college enrollment.\nThe rise in the overall wage gap between college degree holders and people who stopped with a high school credential could lead to increased attendance from the upper deciles of ability independent of gender. Our finding of improved sorting in the upper deciles of the male GPA distribution is consistent with this. For any given increase in the wage gap, the elasticity of the response is likely greater for people whose expected chance of completion is higher. Students in the upper deciles of the talent distribution, regardless of gender, would have a lower cost of college completion. This should boost the responsiveness of attendance in high-GPA deciles to changes in the wage gap.\nImproved sorting in the upper deciles may occur even without a change in the college wage premium. If the skill set of students in the upper deciles of the GPA distribution has improved relative to the skill set of the lower deciles ðAltonji et al. 2012Þ, the nonmonetary cost of attendance would fall for students in the top half of the GPA distribution relative to the bottom half. This would disproportionately push higher-achieving students who were at the margin of attendance into school.\nNow we turn to changes in college and university behavior. High school GPA became more predictive of 4-year college attendance over time. The average marginal effect of GPA percentile on 4-year college attendance increased in the regressions for the full sample and also the top half of the GPA distribution. Since the former increase ð.0024 from col. 6 of table 5Þ was larger than the latter increase ð.0013 from col. 6 of table 6Þ, the magnitude of the increase was even larger for the bottom than the top half of the GPA distribution. This means that in the ELS:2002, a very low GPA was a larger hurdle to attending a 4-year college than it was in the NLS-72 data. This evidence is consistent with colleges and universities themselves increasingly thinking that class rank or GPA percentile is a good predictor of who will succeed in college.\nThe results for the percentile on the math score provide less support for this finding. The cross-sample differences in the coefficients for this variable are all negative. This indicates that performance on the math test became less important for determining which students go to a 4-year college over time. However, in alternative specifications that drop the GPA and reading test score variables, the effects of math test scores on 4-year college attendance are very similar between NLS-72 and ELS:2002 samples. Finally, there is little, if any, change over time in the importance of reading test scores.\nThe results for the race indicator variables also help explain the improved sorting in the student body. The importance of the coefficients for blacks and Hispanics declined in the overall results and in the results for the top half of the GPA distribution, though the results for Hispanics are not statistically significant. Controlling for student quality, this means that the race of the student mattered less for 4-year attendance in the ELS:2002 than in the NLS-72, and this is particularly true for students with high GPAs. Other studies that have compared college going across time have come to the same conclusion: the effect of race on college going has gotten smaller over time. 16 16 Arcidiacono and Lovenheim ð2015Þ have recently shown that changes in affirmative action policy have not had a big effect on the extensive margin ðgoing to a 4-year program vs. not going to college at allÞ but have had a significant effect on the intensive margin ðwhich school a student attendsÞ. Our shrinking coefficient on race is not an evaluation of specific changes in affirmative action policy, and we are controlling for a set of other factors that could lead to changes in the fraction of the African American student cohort that chooses to go to college.\nThe results for parents' education level also show that, controlling for student quality, this family characteristic had less influence on 4-year attendance in the ELS:2002 than it had in the NLS-72. 17 Students of parents who have higher levels of educational attainment are likely to be better students for a potentially wide set of reasons. If the advantages these students have are reflected in grades and test scores, we would not expect the marginal effects of parents' education to be large. The fact that they are large, 21.69 percentage points for parents with a bachelor's degree and 23.78 for parents with a graduate degree in the NLS-72 regressions, shows that they are a factor even after controlling for grades and test scores. The marginal effects decrease significantly in the ELS:2002, to 5.31 percentage points and 9.11 percentage points, respectively, but they still are statistically significant. While parents' education remains important, the decrease in the magnitudes of the marginal effects is consistent with students and colleges paying more attention to indicators of likely student success and less attention to student background.\nThe results from these indicator variables for race and parental education all point in the same direction. If student quality were the only factor affecting college attendance, then racial categories and parental education would not affect which students go to college. The results for the ELS:2002 show that these factors do matter, but their effects are diminished compared to the NLS-72. Student quality has gotten relatively more important over time.\nOther features of the higher education landscape have evolved in ways that could increase the fraction of students in upper deciles who attend 4-year institutions. Changes in financial aid practices over the time period of our analysis have altered the cost-benefit calculations of some potential 4-year college attenders. The effects should be different for needbased financial aid and merit-based financial aid. And as a result the effects will be different for aid provided by the federal government, state governments, and universities themselves.\nFederal Pell grants have been an entitlement since 1972. Together with Supplemental Economic Opportunity Grants, they are the federal grant programs based solely on financial need. Over the time period of our analysis, Pell grants have lost value in terms of the fraction of tuition and fees they cover. 18 This should depress college attendance for students with financial need, and to the extent that GPA and test score percentiles are positively correlated with income, the effect should be stronger for students in the bottom of the GPA and test score distributions.\nBy contrast, federal financial aid in the form of loans has expanded dramatically. College expenses have risen substantially in real terms, and the average loan burden required to meet those expenses has increased as well. The prospect of repaying any given loan burden is less of an attendance deterrent for better-prepared students since high-ability students are much more likely to graduate.\nAt the start of our analysis in 1972, all state grants were need based. But by the 2004-5 academic year, when the ELS:2002 students were incoming college freshmen, only 73 percent of state grants were need based. 19 The major shift in state financial aid started with the Georgia HOPE scholarship ðestablished in 1993Þ, which gave grant aid to students with a high school GPA above some threshold. Several states initiated similar programs, and this accounts for a large part of the drop in the percentage of state grants awarded on the basis of need. Dynarski ð2000Þ demonstrates that the Georgia HOPE scholarship program has increased attendance. By its basic design this kind of merit scholarship program encourages college attendance for students in the top of the GPA distribution. This rising emphasis on merit in state financial aid programs could have large effects, because in many states these programs are widely advertised.\nCollege rankings like the one started by U.S. News and World Report in 1983 have grown in visibility and importance over time. These ratings place great emphasis on enrolling students in the top 10 percent of their high school class, on average SAT scores, and on graduation rates. Universities dislike these rankings, but they do react to them. There is evidence that institutional grants have become more merit based toward the end of the period we are studying ðMcPherson and Schapiro 1998, 2006; Woo and Choy 2011Þ. To the extent that this shift toward merit aid moves students from one 4-year program into a different one, it has little effect on access. At the margin, however, some high-ability students targeted with merit aid might switch from 2-year to 4-year programs."}, {"section_title": "VII. Some Implications for Completion", "text": "One of the puzzles motivating the literature on the average quality of the student body is the contrast between increases in the fraction of an age cohort going to college and decreases in the fraction of an age cohort having completed college. These data strongly suggested diminishing returns in student quality. While there is still a puzzle about why college completion rates fell in the 1970s and 1980s, our calculations using US census data in table 7 show that 4-year college completion rates did not continue to fall. In fact, they increased from 1990 to 2000 and from 2000 to 2009-11. These increased college completion rates since the 1990s are consistent with our evidence of improved sorting of students into 4-year colleges. In addition, there is a pronounced difference in completion rates by sex: they are roughly constant for males after 1990, but they increased dramatically for females. This evidence reinforces our findings that there has been a dramatic increase in the likelihood that a female in the top half of the high school GPA distribution ði.e., those who are well preparedÞ will attend a 4-year college.\nWhile our main focus is the matching process between students and colleges that works through college attendance decisions, we can extend our findings to college graduation outcomes. Table 8 displays average high school characteristics in our samples categorized by college completion. As in table 4, panel A focuses on a comparison between the NLS-72 and ELS:2002, and panel B focuses on the NLSY79 and NLSY97. Columns 1 and 2 describe percentiles of the high school distribution, while columns 3 and 4 describe percentiles in the distribution of sample members who stayed in the sample long enough to infer college degree attainment.\nThe lack of diminishing cohort quality that we report for the attendance process mostly carries through to degree attainment. Average high school GPA and reading test percentiles increased among those receiving an associate's or bachelor's degree between the NLS-72 and ELS:2002. The average math test percentile fell slightly. Average high school preparedness fell among associate's degree earners but not among bachelor's degree earners. This is the same pattern we observe in the attendance process: diminished ability measures among 2-year college attenders in contrast to the stable ability measures among 4-year college attenders.\nThe results in panel B using the NLSY cohorts are similar. While high school GPA percentiles among associate's degree earners fell between the 1979 and 1997 cohorts, they did not fall among bachelor's degree earners. There was a substantial reduction in the average AFQT percentile for bachelor's degree earners, which is the strongest evidence of diminishing marginal returns that we find among 4-year college students. The reduction in the standardized AFQT measure is smaller.\nThe reduction in the AFQT percentile over time is larger among 4-year college graduates than among attenders ðtable 4Þ. To the extent that the pool of 4-year college graduates has experienced diminished cognitive ability, much of this change has occurred during students' college experiences rather than through college attendance decisions. However, high school GPA percentiles among bachelor's degree earners have increased over time, which implies that by a broader measure of cognitive and noncognitive abilities, the pool of college graduates has maintained a steady level of quality."}, {"section_title": "VIII. Conclusions", "text": "Between 1972 and 2004 the percentage of high school students attending both 2-year and 4-year institutions within the first 2 years after leaving high school increased significantly. In this paper we evaluate how this change has affected the average quality of the college-going student population. Existing studies present conflicting findings on this issue. Carneiro et al. ð2011Þ and Carneiro and Lee ð2011Þ offer labor market evidence that is consistent with diminishing marginal returns, but Bound et al. ð2010Þ and Lovenheim and Reynolds ð2011Þ find no diminishing returns using longitudinal survey data. Our evidence demonstrates that this apparent contradiction can be traced to differences in how \"attending college\" is defined. The studies that find diminishing returns aggregate students in 2-year and 4-year programs while the studies that do not find diminishing returns examine 4-year programs or break attendance into separate 2-year and 4-year categories. This difference proves crucial. The quality of students attending any college, 2-year or 4-year, has decreased over time, as a diminishing returns argument would suggest. The quality of students attending a 4-year college, on the other hand, has remained roughly constant or increased slightly, and this is not consistent with diminishing returns. Likewise, the cognitive and noncognitive characteristics of 4-year graduates have been quite stable.\nIn contrast to these previous studies, we focus on high school GPA as our measure of student quality. Almost all previous studies have focused solely on tests of cognitive ability. Including GPA in the analysis is very important because GPA captures noncognitive abilities not captured by test scores. We demonstrate that adding GPA to a college completion regression decreases the magnitude of the coefficients on test scores. Also, for one of our samples we were able to include explicit measures of noncognitive abilities. Adding GPA to this equation reduces the coefficients on these noncognitive abilities as well as the coefficient on test scores. These findings tell us that high school GPAs capture important cognitive and noncognitive skills that are very important for success in formal education.\nThe improvement in sorting of students into 4-year colleges is the result of changes by both prospective students and colleges and universities. Students have responded to the increase in the returns to a college degree and to the increasing use of loan financing. We argue that the positive response to higher returns to education will be stronger at the top of the ability distribution while the negative response to increases in debt financing will be stronger at the bottom of the ability distribution. These results follow under the quite reasonable assumptions that students are aware of their standing in high school and the likelihood that it will be replicated in college. The behavior of colleges and universities plays a role as well. Schools have increasingly recognized the importance of noncognitive skills in college success, and this favors students who are higher in the GPA distribution. Pressure from college rankings may have pushed more universities to seek out and reward high-ability students. This should alter the cost-benefit calculation of high-ability students, causing more of them to attend 4-year schools.\nSince the sorting process improved substantially between 1972 and 2004, there is less room for further improvement. At some point, 4-year enrollment will not be able to rise without the qualifications of the average enrolled student experiencing some decline. Yet there is still a lot of room to raise enrollment rates in the top half of the GPA distribution. Existing financial aid policies are not perfect, and informational barriers remain formidable obstacles for some students and families. We are not yet near the limit where diminishing returns are an unavoidable consequence of rising 4-year enrollment.\nIn the absence of diminishing student quality, existing federal policies that have reduced the financial obstacles to college attendance have not caused lower completion rates. Reforms that stimulate further increases in college attendance, either by improving information about the net cost of attendance or by reducing the net cost, are not necessarily self-defeating given the remaining potential to move high-quality students into 4-year programs. In addition, state policies that reduce the net cost of attendance for students who have achieved some performance thresholds could complement federal assistance."}]