[{"section_title": "abstract", "text": "Variations in the human genome have been found in the literature to be an essential factor that affects the susceptibility of Alzheimer's disease (AD). Genome-wide association studies (GWAS) have identified genetic loci that significantly contribute to the risk of AD. The availability of the genetic data, coupled with brain images technologies leaving rooms for more opportunities and allows further study designs. Although methods have been proposed towards integrating imaging and genetic information, the statistical power remains a primary challenge preventing the production of replicable associations. Moreover, for such kind of studies, the measurement of disease is often taken at a single time point, therefore, not allowing the disease progression to be taken into consideration. In longitudinal settings, we analysed a DTI and Single Nucleotide Polymorphisms (SNPs) datasets obtained from Alzheimer's Disease Neuroimaging Initiative (ADNI), by conducting a GWAS on the global network metrics absolute change, after which we used the GWAS summary statistics to compute the gene scores. We observed significant associations between the change in the AD brain and genes which reported to manipulate AD susceptibility, brain structure and function."}, {"section_title": "Introduction", "text": "Alzheimer's disease (AD) is a neurodegenerative disease with onset in the hippocampus and subsequently spreads to the temporal, parietal, and prefrontal cortex [RLK + 15]. The apolipoprotein E (APOE) gene is located on chromosome 19, it carries the cholesterol in the brain, and it affects diverse cellular processes. Carriers of the APOE allele 4 have three times the risk of developing AD as compared to non-carriers [CS + 93] . Although APOE 4 is the main genetic risk factor which affects the development of a late-onset AD, its effect accounts for 27.3% of the overall disease heritability, estimated to be 80% [LIVH + 13]. In order to estimate the remaining heritability, many attempts and efforts have made to uncover more genetic risk factors. Genome-wide studies has successfully identify Single Nucleotide Polymorphisms (SNPs) that affect the development of AD [Bo10, LWL + 08, NBM + 10] In this paper, we used a dataset from ADNI (http://adni.loni.usc.edu/) to performed a quantitative GWAS, the longitudinal change in brain connectome used as phenotype. The latter was computed using integration and segregation network measures. After getting the GWAS summary statistics for all the SNPs typed in the original data, we assigned them at a gene-level using Pathway scoring algorithm (Pascal) software. Our result identified three genes including SUCLG1 gene, which relates to some brain-related phenotypes [oS96] .\nFigure 1: The analysis pipeline. An illustration of the workflow: both genetic and imaging data were obtained from ADNI; the DTI images were processed, along with AAL and T1 weighted images to construct the brain network, after which the global brain network metrics were computed. The latter were merged with the PLINK FAM files for all the subjects present in both datasets. Lastly, GWAS was conducted, and its results were used by PASCAL to calculate the gene scores (accounting for LD patterns using reference dataset)"}, {"section_title": "Results", "text": "We follow the pipeline in figure ? ? to get our results. After processing the two datasets, we merged them and calculated the absolute differences between the baseline and follow-up visits. To have a general idea of how the differences between these connectivity metrics are distributed, we plotted four boxplots, as shown in figure 3. The boxplots correspond to transitivity, global effect, Louvain modularity and characteristics path length, respectively. Figure 4 illustrated the longitudinal change of global network metrics -measured as the absolute differences, in more details; it also compares Alzheimer's patients to healthy participants.\nThe left plot in figure 5 compares AD patients with controls regarding how the differences in brain connectivity metrics are distributed (histograms) and correlated with each other (boxplots). Note that the diagonal shows a stacked histogram of the differences for each measure, therefore, the AD histogram is plotted on top of the control histogram. While the right plot in figure 5 show the distribution of the actual brain connectivity measure, and it compares their distribution in the baseline and follow-up visits. We then performed a standard GWAS analysis using PLINK, with the phenotypes as a quantitative measure, representing the change in connectivity metrics in this analysis. Figure 6 shows the GWAS results for brain segregation measures, and figure 7 shows the GWAS results for brain integration measures. In those figures, the Manhattan plot appears to the Here, we could not use the standard GWAS threshold (7.9 × 10 −8 ), because the number of genes is much smaller than the SNPs. We then used the number of genes (21, 407) to calculate a gene-level threshold. We calculated the gene-wide significance threshold by dividing the conventional statistical significance level threshold 0.05 by the number of genes, that is,"}, {"section_title": "21, 407", "text": "≈ 0.000002336, hence, at 95% power, we used a threshold of 2E − 6. If we consider less power, 90%, we get a gene-wide threshold of 0.10 21, 407 ≈ 5E − 6. For each Pascal result (and for both brain segregation and integration measures) we constructed a table that contains the most ten significant SNPs. These tables contain six columns; the gene symbol, the genes start and end locations, respectively, the gene ID, the number of SNPs in that gene and the p-value corresponds to the gene score calculated with Pascal. Tables for Louvain modularity, transitivity, global effect and charactaristic path length are Table 1 Table 2 Table 4  and Table 3, respectively  Table 5 shows all genes with p-value less than 0.005 for all global network metrics. The genes in this table are known genes that play a key role in AD brain function 1 ."}, {"section_title": "Discussion", "text": "Association studies of the variation on the human genome and imaging features of the brain have led to more discoveries in the AD disease susceptibility, and several genetic variants were identified to be in association with AD. Moreover, GWAS of the brain connectome previously found many genetic variants associated with AD and dementia [JRH + 13]. Studying those imaging features, including the connectomics, in a longitudinal setting; allows identification of risk factors which affects AD progression. This paper aims at identifying the genetic risk factors which associate with AD brain neurodegeneration over time -measured as the change in global network metrics of the brain connectome.\nOur GWAS results has show a large inflation in type-I error (figures: 6 and 7). This inflation could be due to the genetic complexity of AD, the small sample size available and also, not controlling for LD structure between SNPs. This also explains the overestimation in associations demonstrated in the Manhattan plots.\nHowever, after correcting for LD and aggregating GWAS results at a gene level; Pascal had shown more rubout results with no inflation (figures: 8 and 9). Pascal has successfully replicated genes previously reported to affect disease susceptibility and progression.\nAt 5% significant level, our results have identified SUCLG1 gene (chromosome2, p-value = 7.111E-7, phenotype: global effect), which previously reported to affect different phenotypes, including those responsible of causing changes in some aspects of the human brain such as brain atrophy, atrophy/degeneration affecting the cerebrum and encephalopathy [oS96] .\nAt 10% significant level, TSPAN17 (p-value=3.852E-6, phenotype: transitivity ) and TMED11P (p-value= 4.681E-6, phenotype:global effect) were statistically significant."}, {"section_title": "Materials and Methods", "text": ""}, {"section_title": "Datasets and Data Processing", "text": "Our analysis was conducted on Alzheimer's Disease Neuroimaging Initiative (ADNI) dataset publicly available at (adni.loni.usc.edu) 2 . We used two types of datasets; 1) the cohort measurements of Diffusion Tensor Images (DTI) along with T1-Weighted to allow co-registration, taken at two time points, at the baseline and follow-up after 12 months, and; 2) the PLINK binary files (BED/BIM/FAM) genotypic data for AD, controls and Early MCI (Early Mild Cognitive Impairment)."}, {"section_title": "Brain Connectivity Metrics", "text": "To assess longitudinal changes, we evaluate those metrics at different time points, and we compute their absolute differences. To be in line with previous works on AD and connectomics [PNTT13, BTB + 11, JRH + 13], , in this work, we focus on specific network segregation and integration features. Segregation represents the ability of a network to form communities/clustering which are well organized [DT + 15]. Integration represents the network's ability to propagate information efficiently[DT + 15]. Louvain modularity and transitivity were computed to quantify segregation, while global efficiency and characteristic path length were computed as integration measurements.\nThe Louvain modularity is a community detection method that partitions the network using a two-step optimization [RS10] . First, the method groups individual nodes into communities by optimizing modularity locally, then it constructs a new network whose nodes are the newly formed communities. This is repeated until a maximum of modularity is attained and a hierarchy of communities is produced. For weighted graphs, modularity is defined as\nwhere A ij is the weight of the edge connecting between nodes i and j from the adjacency matrix A, k i and k j are the sums of weights of the edges connected to node i and j respectively, m = 1/(2A ij ), c i and c j are the communities of nodes i and j, and δ is a simple delta function. The transitivity is a variation of the clustering coefficient computed directly on the global network [RS10] , and it reflects the prevalence of clustered connectivity around its nodes. It can be defined as\n2 The ADNI was launched in 2003 as a public-private partnership, led by Principal Investigator Michael W. Weiner,MD. The primary goal of ADNI has been to test whether serial magnetic resonance imaging (MRI), positron emission tomography (PET), other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of mild cognitive impairment (MCI) and early Alzheimer's disease (AD). For up-to-date information, see www.adni-info.org with t W i being the weighted geometric mean of triangles around node i and k i its degree. Weighted global efficiency represents how efficiently information is exchanged over the network . It is computed as the inverse of the average weighted shortest path length in the network d W ij , and is also inversely related to the characteristic path length as\nwhere n is the number of nodes. Characteristic path length measures the integrity of the network and how it is easy for the information to flow within the network. Let d ij be the number of links (connections) which represent the shortest path between node i and j. Characteristic path length of the network is the average of all the distances between every pair in the network."}, {"section_title": "Integration of the two datasets", "text": "To quantify the longitudinal change between the baseline and follow-up visits from the imaging dataset, we calculated the absolute differences for each brain connectivity measure between the two time points. We then merged the absolute differences with the PLINK fam file, using the subject ID. In such settings, subjects who were not present in both datasets were removed and not considered in the rest of this analysis. In total, we were able to merge 57 subjects."}, {"section_title": "Data analysis", "text": "We performed four quantitative GWAS, separately, using PLINK software[PNTB + 07] (http:// pngu.mgh.harvard.edu/purcell/plink/), a GWAS for each network connectivity measure with a total of 12809667 variants (genotyping rate was 0.84943). We used the absolute difference for each one of the measures as our quantitative trait (phenotype).\nAfter we obtained the GWAS association results, we used them as input for the Pascal (Pathway scoring algorithm) software[LMR + 16] to aggregate SNPs at a gene level, and hence, compute gene scores for the four network measures. Along with the obtained association statistics; Pascal uses a reference population from 1000 Genomes Project[C + 12] to correct for linkage disequilibrium (LD) between SNPs. We sat Pascal to compute the gene scores according to the sum of chi-square statistics, and get a p-value for each gene, provided that there were SNPs presents for that gene. Finally, we used python to plot the Manhattan plot, and R studio [RSt15] to plot the QQ-plots. Figure 1 shows the pipeline of this analysis."}, {"section_title": "Conclusion", "text": "This analysis proposed a simple way to quantify changes in the brain connectome in a longitudinal setting, through global network metrics. We used those measurements to perform GWAS, and then compute the p-value for each gene by aggregating the GWAS summary statistics for each gene. At a power of 95 %, SUCLG1 were the only significant gene (change in global effect as phenotype), and at 90% power, TMED11P and TSPAN17 were also significantly associated with global effect and transitivity, respectively. Future work will consider combining gene scores at a pathway level, accounting for LD between neighbouring genes."}, {"section_title": "Acknowledgement", "text": "We would like to acknowledge our funders, the Organisation for Women in Science for the Developing "}]