[{"section_title": "Abstract", "text": "Background: There are racial/ethnic disparities in breast cancer mortality may be attributed to differences in receipt of adjuvant cancer treatment. Our purpose was to determine whether the mortality disparities could be explained by racial/ethnic differences in long-term adherence to adjuvant endocrine therapy (AET). Methods: We conducted a retrospective cohort study with the Texas Cancer Registry and Medicaid claims-linked dataset of women (20-64 years) diagnosed with local and regional breast cancer who filled a prescription for AET from 2000-2008. Adherence to AET was measured at three time points (1-, 3-, and 5-year adherence) using a value for the percentage of medication filled for each period divided by the total number of possible prescriptions prescribed (Medication Possession Ratio, MPR). We created a binary variable of adherence (MPR≥80%). We performed multivariable logistic regressions to assess racial differences for the odds of AET adherence and Cox proportional hazard models to determine the risk of mortality adjusting for potential confounding variables of SES, comorbidities, tumor prognostic factors, and other cancer treatment. Results: Of the 1,497 women with breast cancer who initiated AET, 56.9%, 42.3%, and 33.3% were adherent for 1, 3, and 5-years, respectively. Hispanics compared to non-Hispanic whites did differ in the proportion that were adherent to 5-years of AET. In the adjusted analysis for long-term adherence to AET, Hispanics did not have a significantly increased risk of death compared to non-Hispanic white patients (HR: 1.13, 95% CI: 0.58-2.21). However, black compared to non-Hispanic white patients had significantly lower odds of three-year adherence (OR: 0.45, 95% CI: 0.28-0.73). After controlling for 5-year adherence to AET, the risk of death for black compared to non-Hispanic white patients was 12% lower (HR: 1.90; 95% CI: 1.03-3.51) and in the fully adjusted model, the disparity was reduced and no longer significant (OR: 1.86, 95% CI: 0.94-3.66). Conclusions: Long-term adherence in the Medicaid population is suboptimal and racial/ethnic differences in AET adherence may partially explain disparities in mortality. This study underscores the critical need to ensure long-term adherence to AET for all racial/ethnic groups to decrease disparities in mortality."}, {"section_title": "Background", "text": "Minorities with breast cancer have an increased risk of breast cancer death than non-Hispanic whites [1] [2] [3] [4] . These racial/ethnic mortality disparities have been attributed to differences in factors such as tumor characteristics [2, 3, 5, 6] , socioeconomic factors [4] , and the initiation and timing of initial and adjuvant cancer treatment [2, 4] . Adherence to recommended treatment, such as adjuvant endocrine therapy (AET), is one way to significantly reduce breast cancer mortality [7] since adherence to AET is associated with improved disease-free survival for women with early-stage breast cancer [8] [9] [10] [11] [12] .Thus, racial/ethnic differences in adherence to AET may be a determinant that contributes to disparities in breast cancer outcomes [13] .\nThe National Comprehensive Cancer Network (NCCN) recommends women with hormone receptorpositive breast cancer receive five-years of treatment with either tamoxifen if women are premenopausal or an aromatase inhibitor (exemestane, anastrozole, and letrozole) or tamoxifen if they are postmenopausal [14, 15] . While the benefits of AET are evident, the one-year adherence to recommended treatment (55-75%) is suboptimal [13, 16, 17] and adherence is even lower for racial/ethnic minorities compared white women [18, 19] .\nOther factors associated with poor adherence include the presence of chronic conditions [20] , age at initiation [19, 21] , and adverse toxicities of the medication [16, [22] [23] [24] [25] [26] . However, despite these associations, medication adherence is often studied within the first year following initiation of therapy. Few studies have examined long-term adherence over the 5-year recommended period, which is important to receive the maximal disease-free survival benefit. Therefore, studying these factors among across the entire 5-year duration of recommended treatment is critical for our understanding of AET adherence.\nMoreover, poor adherence to AET is associated low socioeconomic status [18, 27] . In the Texas Medicaid program about one-tenth of low-income adults in the state are covered by the plan and receive comprehensive medical care including prescription drug coverage [29] and enrollment in the program may influence racial/ethnic disparities in cancer mortality in some areas of the state [30] [31] [32] . Therefore, we aimed to determine whether racial/ethnic differences in long-term adherence to AET among a low-income and racially diverse Medicaid population explains disparities in all-cause mortality. We hypothesized that AET adherence would be associated with a lower risk of death and, more importantly, there will be no significant disparities in the risk of mortality among Hispanics, Blacks and non-Hispanic whites after controlling for long-term adherence."}, {"section_title": "Methods", "text": ""}, {"section_title": "Data source and sample population", "text": "Women with breast cancer aged 20-64 who initiated AET within 1.5 years after the date of cancer diagnosis were identified from Texas Cancer Registry-Medicaid linked database (TCR-Medicaid database) from 2000-2007. Medicaid claims data were available through December 31, 2008 (Fig. 1) . The TCR database is a state-based dataset that contains information on initial cancer treatment and clinical and cancer diagnostic characteristics. Data were available for patients enrolled in Medicaid from medical claims for outpatient, inpatient, and pharmacy records.\nTo calculate long-term adherence, we analyzed three cohorts that had at least one, three, and five years of eligible continuous enrollment in Medicaid after the date of AET initiation. Patients were considered to have eligible continuous enrollment in Medicaid if they did not have two or more consecutive months of unknown or non-enrollment status for each of the adherence time points. Doing this allowed us to accurately assess AET medication prescription refills over each time-period since complete pharmacy claims were available for patients who were continuously enrolled in Medicaid for each time period. Patients may be non-enrolled due to ineligibility in Texas Medicaid, enrolled in another insurance program, or because they moved out of Texas or died. Therefore, these people were excluded from each of the 3 adherence cohorts. However, patients may have been non-enrolled after the 3 time periods or died."}, {"section_title": "Outcome Measures", "text": "Similar to previous studies, adherence was defined by calculating each patients' medication possession ratio (MPR) over each of the three time periods (1 year, 3 years, and 5 years) [33] [34] [35] . Patients that filled prescriptions for AET to cover more than 80% of the days in one, three, and five years, (MPR≥80%) were defined as adherent. Pharmacy claims from Medicaid include information for the prescription date, days of dugs supplied, and the National Drug Code (NDC). A patient was considered to have initiated AET if they had a pharmacy drug claim identified by the NDC code for either tamoxifen or any of the aromatase inhibitors within 18 months after their diagnosis date. If a patient started taking another AET medication we assumed that they stopped taking any excess prescribed medication for the discontinued AET medication and initiated the new AET drug on the date the new drug was prescribed. We did not count any access AET drug in the medication possession ratio.\nAll-cause mortality was defined as dead (of any causes). Patients who were alive at the last follow-up of vital statistics (December 31, 2010) were censored. The mean and median follow-up time from breast cancer diagnosis until the end of the study period or death of the one-year adherence cohort in this study were 2,229 days and 580 days (range 438-4,008); of the three-year adherence cohort in this study were 2,678 days and 2,650 days (range 1,114-4,008); of the five-year adherence cohort in this study were 3,188 days and 3,167 days (range 1,918-4,008)."}, {"section_title": "Race and geographical region variables", "text": "We created a single measure for race/ethnicity as identified in Texas Medicaid enrollment file as Non-Hispanic White, Non-Hispanic Black, Hispanic, and other (including Asian or missing race/ethnicity). We included categorical county-level variables for the proportion of the population living below the federal poverty level, median income, and the number of direct primary care (DPC) physicians per 100K population. These variables were categorized into tertiles and based on the 2000 US Census linked to the dataset.\nGeographic region variables were included and based on the location where patient lived at the time of diagnosis along the Texas-Mexico Border (Yes/No) based on 3-digit county Federal Information Processing Standard (FIPS) codes. These codes were also used to determine whether patients resided in counties that were metropolitan regions or non-metropolitan regions including urban and rural areas based on the US Census Rural-Urban Continuum Codes."}, {"section_title": "Demographic and clinical Covariates", "text": "Categorical tertiles for age groups and the number of chronic conditions were included as patient characteristics. We measured the number of comorbid conditions between 6 months before and 3 months after breast cancer diagnosis with a modified version of the Charlson comorbidity index (CCI) based on diagnostic and procedures codes described [41] , and surgery (ICD-9-CM procedure code 8521-8523, 8541-8548, 19120, 19180, 19222, 19240, 19162) [42] . Our study was limited to patients with localized or regional disease. Year of diagnosis were grouped into three categories: 2000-2001, 2002-2004, 2005-2007 ."}, {"section_title": "Statistical Analysis", "text": "Descriptive statistics were used to illustrate patient sociodemographic and clinical treatment and prognostic factors across the racial/ethnic groups. We examined the proportion of adherent patients (MPR≥80%) in the three adherence periods (1, 3 and 5 year) across all variables. We ran three separate multiple logistic regression models to assess the association between race/ethnicity, geographic region, and AET adherence [33] [34] [35] . Cox proportional hazard regression was used to analyze the association between adherence to AET at three different time periods and mortality. We conducted six step-wise Cox proportional hazard regression models on each of the three adherence levels (1-, 3-, and 5-year). In the first model, we only included the variable indicating whether a patient was adherent to AET to see the crude risk of mortality associated with adherence at each time period. Next, we added sequentially, 2. race, 3. age, 4. stage and CCI, 5. SES, and 6. initial breast cancer treatment information in order to examine how the association between adherence and risk of death changed with the addition of each variable. Likewise, six regression models were assessed to analyze the impact of race/ethnicity within the three adherence time points in a step wise manner by adding 1. race, 2. adherence, 3. age, 4. stage and CCI, 5. SES, and 6. initial breast cancer treatment information. We checked for multiple collinearity between all variables and used a Pearson's correlation coefficient r>0.7 or a variance inflation factor (VIF)>7 as a rule of thumb to exclude variables. No variables met these criteria in our final analysis. We used 2-sided p-values and a significance level of p<0.05. We performed all analysis using SAS (version 9.4; SAS Institute, Cary, NC)."}, {"section_title": "Results", "text": "In the first cohort, there were 1,497 breast cancer patients with 1-year of continuous enrollment in the Texas Medicaid after the month of initiating AET. For patients with continuous enrollment for 3 and 5-years there were 718 and 300 patients, respectively. One-, three-, and five-year adherence to AET (MPR≥80%) were calculated in this study ( Table 2) . A greater proportion of patients were adherent to AET at one-year adherence (56.9%) compared to longer-term adherence (three-and five-year), where only 42.3% and 33.3% of patients were adherent to AET. There were certain differences of adherence across the ethnic groups where non-Hispanic Black patients represented the lowest adherence compared to other non-Hispanic whites and Hispanics. For the one-year follow-up cohort, 58.1% and 60.5% of non-Hispanic white and Hispanic patients were adherent to AET. However, only 44.6% of Black patients were adherent. A similar pattern was observed for long-term adherence for the three and five-year cohorts. In the five-year long-term follow-up cohort, only 35.3%, 36.8%, 19.2% were adherent for Non-Hispanic White, Hispanic and Black patients, respectively. A greater proportion of older patients were adherent at three-and five-years compared younger patients. Table 3 shows the results of the three logistic regression models used to examine the relationship between race/ ethnicity and adherence after adjusting for patient characteristics, cancer treatment and regional variables. We found that Black compared to white patients had lower odds of adherence to AET for both one-year adherence (OR: 0.63, 95% CI: 0.47-0.85) and three-year adherence (OR: 0.45, 95% CI: 0.28-0.73). We did not find a significant association between Hispanic and white patients and adherence. In addition, the youngest age group (20-34 years) have significantly lower odds of one-year adherence (OR: 0.46, 95% CI: 0.26-0.82) and three-year adherence (OR: 0.09, 95% CI: 0.01-0.68) compared to the oldest group (50-64 years). Because there were few younger patients in the sample population and younger patients tended not to be adherent, there was no patient in the youngest group which could be followed for the 5-year cohort and thus we did not put age group variable in the third (5-year adherence) model. We also found that breast cancer patients living on the border of Mexico had significantly higher odds of one-year adherence (OR: 2.19, 95% CI: 1.29-3.71) compared to patients not residing in the border counties. Interestingly, patients with three or more comorbid conditions had significantly higher odds of 5-year adherence (OR: 2.87, 95% CI 1.31-6.29), but we did not observe a significant association for one-or three-year adherence.\nWe found a significant impact of both short-and long-term adherence on survival (Table 4 ). In the three study cohorts, approximately 24% of patient died during the follow-up period. Before adjusting for other variables, patients who were adherent to AET had 25-41% lower risk of death compared with non-adherent patients (one-year adherence: 0.75, 0.61-0.92; there-year adherence: 0.60, 0.44-0.83; five-year adherence: 0.59, 0.34-1.01). In the final model, after controlling for patient demographic, treatment and regional variables, the impact of AET adherence on survival became slightly larger for long-term adherence (Five-year adherence: 0.54, 0.30-0.99).\nWe also found racial/ethnic disparities in survival among breast cancer patients receiving AET (Table 5 ). In the unadjusted analysis (model 1) black compared to non-Hispanic white patients had a significantly greater risk of death that ranged from a 36% increased risk of death (HR: 1.36, 95% CI 1.05-1.75) to a two-fold increased risk (HR: 2.02, 95% CI: 1.10-3.71) for those patients with one-and five-year adherence, respectively. However, once we controlled for whether a patient was adherent over the indicated duration, for example 5-years and age (model 3), the risk of death was now 12% lower for black patients compared to non-Hispanic white patients (HR: 1.90, 95% CI: 1.03-3.51). In the fully adjusted model (full model) the racial disparity in mortality was reduced (HR: 1.86, 95% CI: 0.94-3.66) for black compared to non-Hispanic white patients.\nIn the unadjusted model (model 1), Hispanic patients had a lower risk of mortality, for the cohort with complete adherence data available for 1-year, compared with Non-Hispanic White patients (HR: 0.69, 0.54-0.88). However, Hispanics did not have significantly decreased risk of death compared to non-Hispanic white patients in the long-term cohorts (5-year cohort; HR: 1.13, 95% CI: 0.58-2.21)."}, {"section_title": "Discussion", "text": "In this study of the Texas Cancer Registry and Medicaid-linked data set, we found that black patients compared to non-Hispanic white patients had significantly lower odds of 1-and 3-year adherence to AET. After adjusting for long-term adherence (5-years), the disparity in mortality between black and non-Hispanic white patients was 12% lower. This is an important finding since in this cohort of patients with comprehensive health coverage and no out-of-pocket costs for medication, adherence for the recommended 5-year period was suboptimal, where nearly two-third of patients did not complete recommended AET treatment.\nPrior studies that examined racial/ethnic differences in AET adherence are mixed and vary by insurance status, household income, and out-of-pocket costs for the medication. Studies among privately insured populations did not find significant differences in adherence by race/ethnicity [18, 43, 44] , while others that did find a significant racial/ethnic difference in AET adherence are explained by household net worth [18] , or out-of-pocket costs for medications [28] . Similar to others, we also found that younger patients had lower odds of adherence to AET treatment within the first year compared to older patients [17, 19] .\nIn our study, merely 33.3% of women were adherent to AET for the five-year recommended duration. Further, we found that 42.3% of patients were adherent to AET for three years. This is lower than previously reported. Partridge and colleagues measured long-term adherence at three years using similar claims-based methodology among non-elderly patients and reported 62-79% were adherent at three years [33] . However, unlike our study, they only had data available for commercially and privately insured patients and did not study adherence among a predominately minority or low-income population, which are associated with poor adherence [33] . Our one-year adherence rate was 56.9% that is similar to other studies using equivalent datasets by population and demographics in North Carolina [20] and New York [45] . These studies found that only three-fifths of patients were adherent at 1-year. Whereas a study using data from the New Jersey Medicaid population included patients with higher incomes found that nearly three-fourths of patients were adherent to AET at one year [19] . Similar to our study, these studies included a racial/ethnically diverse, low-income patient population [20, 45] , however, they did not examine long-term adherence by race/ethnicity. Further, we have previously reported AET adherence for stage I-III breast cancer patients enrolled in Medicare Part D and adherence but did not find a significant difference among Hispanic and Black patients over non-Hispanic whites, after controlling for sociodemographic, prognostic and treatment factors [28] . Previous studies have examined lower adherence rates for non-whites, which may explain the disparities in breast cancer mortality observed between minorities and white patients [18, 19, 46] . However, after controlling for AET adherence, we did not observe racial/ethnic differences in the risk of all-cause mortality between black and non-Hispanic white patients. We found that adherence to AET was independently associated with a lower risk of all-cause mortality, which is corroborated by Hershman et al [12] . Similar to our study, they found that Hispanics had a lower risk of death than non-Hispanic whites, [12] but after controlling for long-term adherence we no longer observed this association between Hispanics and non-Hispanic white patients.\nIn this study, we found that black patients were not statistically more likely to die compared to non-Hispanic white patients after controlling for long-term adherence to AET and age. This is similar to our other finding using the SEER-Medicare dataset among an older publicly insured population [13] . In this study, we found that discontinuing AET treatment was associated with a higher all-cause and cancer-specific mortality (HR: 1.75, 95% CI: 1.54-2.00) [13] . This is important because it demonstrates that adherence to AET, particularly long-term adherence over the recommended 5 years, may reduce the racial/ethnic disparities that we see in cancer outcomes.\nWhile previous studies of AET patterns and outcomes used only medical claims or pharmacy data without details on tumor characteristics [17, 47, 48] , we were able to examine long-term adherence and all-cause mortality by other prognostic factors because Medicaid claims data were linked to the TCR registry database. Because we had complete medical claims, pharmacy, and Texas Cancer Registry data, this is one of the most comprehensive studies examining racial/ethnic differences in long-term AET adherence and mortality. To the best of our knowledge, this is the first study to examine adherence to AET among the Texas Medicaid population. Our findings are highly valuable since patients diagnosed with cancer in Texas are not part of the SEER-Cancer Registry and are underrepresented in research studies, which represents a large proportion of minority and low-SES breast cancer patients in the US. Our study has some limitation. First, our study included women <64 years, continuously enrolled in Texas Medicaid that may have different enrollment eligibility criteria compared to other state-Medicaid programs, and with minority women who may have different life experiences than others throughout the United States. These factors may limit the generalizability of the study findings. Second, unmeasured confounding such as psychosocial factors or factors related to the quality of care women receive (e.g., trust in their physicians) could affect their use of AET but were not measured in this study [49] . Third, our measure of adherence relies on counting the number of prescriptions a patient fills for AET and we assumed that patients were actually taking them. Data were not available in the TCR on estrogen receptor status so we also assumed that patients where eligible to receive AET if they filled a prescription for one of the medications. However, we were able to account for switching AET medication, which allowed us to have a more accurate measure of adherence. Further, using pharmacy claims data has been shown to correlate with medication use and has previously been validated as a method for medication adherence [50, 51] . Finally, we were only able to observe adherence for patients that had continuous follow-up information available for each of the three cohorts. Patients that have continuous enrollment in Medicaid may be different than patients that did not remain enrolled in Medicaid. Because patients that were continuously enrolled in Medicaid did not die during the follow-up time it may make the use of AET seem more effective in this study population. However, patients that were adherent to treatment over the 5-year study period were compared to patients who were alive but did not complete treatment. "}, {"section_title": "Conclusions", "text": "About two-thirds of patients with who initiated AET were non-adherent to AET over the recommended five-year study period. AET adherence was independently associated with a significantly lower risk of all-cause mortality even after adjusting for all other treatment, clinical prognostic, and sociodemographic characteristics. After adjusting to 5-year adherence to AET, we did not observe racial/ethnic differences in all-cause mortality. The findings are novel because they emphasize the importance of improving the low rates of adherence among racial/ethnic minorities as a way to decrease racial/ethnic disparities in cancer mortality. "}]