[{"section_title": "Abstract", "text": "Título: Hipatia: un entorno de aprendizaje hipermedia en matemáticas. Resumen: La literatura existente señala los beneficios de diferentes herramientas dirigidas al desarrollo de la competencia matemática, la solución de problemas y los aspectos afectivo-motivacionales y la intervención en estudiantes con dificultades específicas de aprendizaje en matemáticas. Sin embargo, no existe una herramienta que combine todas estas variables. El objetivo de este estudio es presentar y describir el diseño y desarrollo de una herramienta hipermedia llamada Hipatia. Los ambientes hipermedia son, por definición, sistemas adaptativos de aprendizaje que son habitualmente empleados para proporcionar ambientes personalizados de aprendizaje. Este trabajo describe los principios en los que se basa la herramienta hipermedia Hipatia, así como, una revisión de las tecnologías disponibles desarrollas en diferentes áreas académicas. Hipatia fue creada para potenciar la autorregulación del aprendizaje y desarrollar habilidades específicas matemáticas y la resolución de problemas. La herramienta está dirigida a estudiantes de quinto y sexto curso de Educación Primaria con y sin dificultades de aprendizaje en matemáticas. Tras el desarrollo de la Hipatia, se puede concluir que efectivamente subyace los principios dela aprendizaje autorregulado. En investigaciones futuras será necesario poner a prueba la eficacia de la herramienta a través de metodologías empíricas. Palabras clave: Hipermedia; pizarras interactivas; ambientes de aprendizaje; aprendizaje autorregulado; matemáticas.\nAbstract: Literature revealed the benefits of different instruments for the development of mathematical competence, problem solving, self-regulated learning, affective-motivational aspects and intervention in students with specific difficulties in mathematics. However, no one tool combined all these variables. The aim of this study is to present and describe the design and development of a hypermedia tool, Hipatia. Hypermedia environments are, by definition, adaptive learning systems, which are usually a web-based application program that provide a personalized learning environment. This paper describes the principles on which Hipatia is based as well as a review of available technologies developed in different academic subjects. Hipatia was created to boost self-regulated learning, develop specific math skills, and promote effective problem solving. It was targeted toward fifth and sixth grade students with and without learning difficulties in mathematics. After the development of the tool, we concluded that it aligned well with the logic underlying the principles of self-regulated learning. Future research is needed to test the efficacy of Hipatia with an empirical methodology."}, {"section_title": "1*) Introduction", "text": "The process of student learning is influenced not only by students' cognitive skills but also by their affect and motivation (Barca-Lozano, Almeida, Porto-Rioboo, PeralboUzquiano, & Brenlla-Blanco, 2012; Hintsanen et al., 2012; Lambic & Lipkovski, 2012) . This influence holds true in the area of mathematics as well, where student performance is affected by different variables such as attitude, motivation and emotion. The latest reports on student achievement from the International Association for the Evaluation of Educational Achievement (IEA) and Pisa Projects (Organization for Economic Cooperation and Development, 2010) indicate particularly poor mathematics performance for students of Spain (IEA, 2011) . In addition to these indicators of math difficulty for Spanish students across grade levels, research shows clear deficits in affective-motivational aspects as well (Cueli, González-Castro, Álvarez, García, & González-Pienda, 2014; Valle et al., 2009) ; thus, it is critical that we identify intervention tools that offer job-oriented instruction that not only develops knowledge and the acquisition of academic content, but also enhances strategic and self-regulated learning and increases student motivation and positive attitudes toward mathematics.\nTo reach a working methodology in mathematics aimed at achieving the above objectives, some research has high-lighted the importance of using new technologies (Reed, Drijvers, & Kirschner, 2010) . The advent of these new technologies, such as Interactive White Boards (IWBs) and hypermedia environments (e.g., Digital-Text; which is a universal school content base, presented as online multimedia textbooks, and specially designed to work with the new classroom technologies), has opened a new field of research that studies the effectiveness of these new learning environments and teaching methods (Engel & Onrubia, 2013; Macias-Ferrer, 2007; Ojeda, Perales, & Gutierrez-Perez, 2012) . The advent of computers in schools occurred in the early 1980s; however, despite evidence that the use of digital technologies can enhance the teaching and learning of mathematics (Kaput & Hegedus, 2007; Lazakidou & Retalis, 2010 , Reed et al., 2010 , they are often not a mainstay in typical classroom instruction (Gross, 2002) . For computer technology to be effective in classroom use, they must take into account the guidelines and activities necessary to fully support the educational process (Brown, 2009; Keengwe, Onchwari, & Wachira, 2008; Oncu, Delialioglu, & Brown, 2008; Purvis, Aspden, Bannister, & Helm, 2011; Tamar & Rivka, 2008) .\nAmong these new technologies, research points to the use of electronic tools such as computer-based learning environments (CBLEs) on the IWBs and hypermedia environments. CBLEs are effective to the extent that they can adapt to the needs of individual learners by systematically and dynamically providing scaffolding of key learning processes during learning (Azevedo, Moos, Johnson, & Chauncey, 2010) . IWBs are a large interactive display that anales de psicología, 2016, vol. 32, nº 1 (enero) combines an electronic touchable whiteboard connected to a network computer and a data projector (Al-Qirim, 2011), which projects the computer's desktop onto the board's surface where users control the computer using a pen, finger, stylus, or other device (Lee, Cheng, Rai, & Depickere, 2005) . Hypermedia environments are, by definition, adaptive learning systems, which are usually web-based application programs that provide a personalized learning environment (Özyurt, Özyurt, Baki, Güven, & Karal, 2012) . As will be described below, these instruments have been used with the aim of increasing problem-solving proficiency (for students without difficulties) or supporting the acquisition of mathematical skills (for students with learning difficulties). They have also been used to enhance students' self-regulated learning as well as their attitude toward mathematics. In this sense, learning in a hypermedia environment requires students to adjust and adapt their activities and strategies to achieve their goals, thereby self-regulating their learning. This is an active process in which subjects set goals that guide their learning, while attempting to monitor, regulate and control their cognition, motivation and behavior in order to succeed in a task (Rosário et al., 2012; Fernández et al., 2013) . The topic of self-regulated learning in hypermedia learning environments is one that is being widely treated (Artino & Stephens, 2009; Azevedo & Aleven, 2013; Barnard, Lan, To, Paton, & Lai, 2009 ). However, other research, such as that conducted by Walker and colleagues (2012) , has attempted to study the benefits of these tools not only academically, but also affective-motivationally. This study was conducted with a sample of 1247 students (ages 12 to 15) who completed pre/post questionnaires which contained seven self-report Likert scale items. Two items addressed student behavior, three addressed knowledge and two addressed attitude. Findings showed gains not only in terms of conceptual content acquisition, but also on a behavioral and attitudinal level.\nIn this sense, we can find different programs developed and research on various hypermedia environments. Following is the description of some of the programs designed to achieve the same objectives we outlined for Hipatia. We classified these programs based on the aim of the tool (i.e., work solving problems, develop self-regulating strategies, etc.), the technique used (heuristic learning, guided selfregulation learning, etc.), student grade, and the academic content area."}, {"section_title": "Programs developed", "text": "The following describes the programs developed in order to achieve an improvement in the self-regulatory skills development, content exposure, or practical exercises. Also, these can be classified based on the content or educational stage (course) for which they are intended. Table 1 shows the classification of these programs based on these aspects. Sharp Online. Rodríguez, Gil, García and Lopez (2008) presented the development of a web application called SHARP Online: An Adaptive Hypermedia System for solving math problems. The pedagogical foundation of this application is in the techniques of heuristic learning support in solving mathematical problems. Adaptability of the system is achieved through the use of an algorithm that allows the user to build the mathematical knowledge adaptively using training methods. This application also provides the teacher with the option to include content through specific modules. It was originally developed for educational contexts in the field of mathematics education so it includes a module for editing and visualizing mathematical formulas in a web environment."}, {"section_title": "Web Teaching of Mathematics (WBMTS)", "text": ". Hypermedia environments have shown promise not only with acquisition of basic math skills and problem solving, but also with the acquisition of specific mathematical skills. Özyurt (2012) conducted a study with ten teachers and seventy high school sophomores with the goals of designing a system based on WBMTS for the learning of probability and then implementing and evaluating its effectiveness in tenth grade students. Data from the study were analyzed by analysis of covariance and showed that the system WBMTS had a positive effect on the academic performance of students in the skill tested.\nPIAC. Andrade-Aréchiga, López and López-Morteo (2012) conducted a study in which an intervention was designed to help students overcome difficulties related to the concepts of calculus. Intended as a specific intervention for mathematics difficulties, they used an interactive platform for learning calculus, called PIAC, with a total of 102 students. The application allows students to manage, display and present a wide variety of content, including text, images, video, and interactive content. The use of PIAC to support anales de psicología, 2016, vol. 32, nº 1 (enero) to learning of calculus concepts was shown to be effective; further, results indicated positive response to the program and also showed that benefits occurred not only in the students' academic performance, but also on the motivational aspects of the learning process. Thus, they concluded that the technology-based intervention provides a positive influence on the learning process.\nMetaTutor. Developed by Azevedo et al. (2012) , MetaTutor is a learning tool designed to teach and train students to self-regulate. Moreover, it is a research tool used to select trace data on the cognitive, metacognitive, affective, and motivational processes that students employ as they learn. This learning tool is a multi-agent, adaptive hypermedia learning environment, designed to train, model, and foster students' SRL while learning about the human circulatory system. The primary goal underlying the design of MetaTutor is to investigate how advanced learning technologies (ALTs) can adaptively scaffold learners' SRL while they learn about complex biological topics (Azevedo et al., 2012) . As a learning tool, MetaTutor has a host of features that embody and foster self-regulated learning. Additionally, MetaTutor collects information from user interactions with it to provide adaptive feedback on the deployment of students' SRL behaviors. This tool includes the avatar, or metatutor, which is an application of hypermedia environments that promotes student self-regulated learning through guidance and immediate feedback on answers (Cerezo et al., 2010) .\niSTART. Interactive Strategy Training for Active Reading and Thinking is an intelligent tutoring system designed to improve students' reading comprehension skills (Jackson, Boonthum, McNamara, 2010) . iSTART teaches students how to self-explain and which strategies will most effectively aid comprehension from moment to moment (Kurby et al., 2012) . These authors used the Reading Strategy Assessment Tool (RSAT) to assess how iSTART changes the relation between important self-explanation reading strategies-bridging and elaboration-and online comprehension, and how often they are produced. iSTART is designed so that teachers and researchers may add their own texts into the system.\nIn short, as can be seen in table 1, the programs described are directed to stimulate various aspects through different content in a specific age range. However, there has not been found a program that combines the aims of all those reviewed above. Although it is true that many tools have been developed for learning academic content, it seems that the theoretical models upon which they are based are oriented more to the explanation of content and execution by the student than to the stimulation of self-regulation learning and affective-motivational variables. There are two programs that incorporate both of these components; however, these are aimed at learning the circulatory system (MetaTutor) and developing reading comprehension skills (iStart).\nGiven the potential of new technologies and the results provided by previous research that found positive effects of these tools in the teaching and learning process of the students, the objective of the current work is to design and develop a hypermedia tool, called Hipatia, based on the principles of self-regulated learning (similar to MetaTutor or iSTART but directed toward mathematical content). Further, it was important that the program be adaptative so that it can be used with students with various learning difficulties (similar to PIAC). Thus, Hipatia will combine in one tool the principles seen in the above literature: enhanced selfregulated learning, development of specific content skills, and effective problem solving (similar to Sharp, which focuses on problem solving). This technology is geared to students in fifth and sixth grades with and without learning difficulties in mathematics. It also includes the avatar, which has been mainly applied only in high school so far."}, {"section_title": "Target Demographic", "text": "The sample to be targeted by the intervention program consists of students in grades five and six. This level was selected because results from the Trends in International Mathematics and Science Study (IEA, 2011) showed below average academic achievement in mathematics for fourth grade students. Further, students at this age generally have sufficient computer resources (i.e., equipped with computers and have basic knowledge about handling them) but are still young enough that intervention may prevent the difficulties or shortcomings often experienced by secondary school students. Thus, the mathematical content of the hypermedia system described in the current study are adapted to the competences proposed by the administration of the Spanish education system for this stage of the curriculum. The following sections describe the tool, Hipatia, and its application to classroom instruction, as well as implications for future research."}, {"section_title": "Theoretical Framework", "text": "The designed instrument, Hipatia, is a hypermedia tool intended to improve math skills in fifth and sixth grades. The theoretical foundation of the content is based on Zimmerman's (2008) model of self-regulation, which states that students operate their self-regulated learning through the implementation of a number of strategies that activate and modify their cognition, metacognition and behavior. These strategies are variously applied before, during, and after the learning takes place; each follows the phases of planning, implementation and evaluation of the process (Figure 1) .\nanales de psicología, 2016, vol. 32, nº 1 (enero) Also, Hipatia is directed for students with and without learning disabilities in mathematics. Maccini, Gagnon and Hughes (2002) showed three practices for working with students with learning disabilities in mathematics: hypermedia software programs, contextualized learning, and multimedia software. Hipatia is hypermedia software that provides contextualized learning, as content is only shown after an example that activates prior knowledge. This is very relevant, especially considering that math skills evolve in a hierarchical and inclusive way (Kikas, Peets, Palu, & Afanasjev, 2009; Olkun, Altun, & Deryakulu, 2009 ). Moreover, Swanson (1999) reviewed 20 years of research on intervention with students with learning disabilities in mathematics and concluded that the two teaching practices with best results are direct instruction and cognitive strategies of self-regulation and control. These results were supported by the metaanalysis by Kroesbergen and van Luit (2003) , which also indicates that the intervention strategies with improved outcomes for teaching students in elementary school with learning disabilities in mathematics were self-instruction and direct instruction of cognitive strategies. This is in the line of Hipatia, which uses direct instruction and includes the avatar for enhancing this point. If the student gives the wrong answer, the avatar provides prompts to determine which procedure to follow to self-correct (based on self-regulatory logic and direct instruction) in order to reach the correct answer."}, {"section_title": "Description of the Program", "text": "The program described below is an adaptation of the tool Hypatia, initially developed in Portugal (http://www.hypatiamat.com/). Hipatia is a researcherdeveloped hypermedia program that was created to support the development of students' self-regulatory skills and the acquisition of specific math skills. Because of the nature of the tool, one of the goals of Hipatia is to improve students' motivation toward math. As it is designed, the teacher and the student can work with the application both from the computer and from the whiteboard; thus, it is an in-class tool meant to supplement and reinforce whole-class instruction. Hipatia was created and established in a web space (www.institutouria.es/hyp), making it accessible to both the students and faculty. In this space, there are different sections or links. First, there is a section concerning the content, which lists each of the topics offered (loca, angles, polygons, areas, etc.). Second, there is a specific section for calculating activities, working this skill in a fun way through games. Third, there are sections describing the project and sections which give visitors the opportunity to collaborate. The application can be run from the student's own computer (at home or at school), from the teacher, or from the interactive whiteboard.\nIn this regard, students using Hipatia follow a predetermined series of tasks. First, they are presented a concept through an example (thus activating prior knowledge); then they process the content, first with simple tasks and then with progressively more difficult tasks. The underlying concepts of these initial phases are learning to learn and selfregulatory enhancement planning. Once students have acquired the knowledge, they practice with different activities (i.e., \"learning to do,\" or execution) and the program gives students immediate feedback once they complete the task; this component of the tool supports affective-motivational development as it is an immediate and contingent reinforcement (Cameron, Pierce, Banko, & Gear, 2005) . Feedback makes learning more active, autonomous, reflective, and critical (Martínez-Berruezo & García-Varela, 2013) .\nAfter feedback, each topic includes a final summary that lists the main ideas learned, thus facilitating the process of self-evaluation and monitoring of learning. Some of the mathematical content includes loci, polygons, perimeter, area, and angles. To more clearly describe the sequencing of the instrument's content, one of the lessons (on angles) is described below. It is important to note that all the proposed content follows the same dynamics as shown below. All the topics are divided into 10 sections, within which appear different activities that present relevant concepts, exercises and problems. Students navigate through activities using the arrows (as evident in the figures). The Hipatia program has several tools but the following three are used most frequently: pencil, pen, and rubber/eraser. The pen allows students to write and to conduct operations while the pen allows them to point out or highlight data. Students use these tools to perform the requested activities, operate to solve a problem, outline the statement when necessary, and seek strategies to solve a problem. For this, they have to click on the tool, which appears at the top right of the screen. In addition, the teacher and the student have the option to change the data in the exercises by a specific button (shown at the top of the screen in some exercises). Using this option, the problem statement remains invariable while the numerical data change. This action facilitates the consolidation of knowledge needed to repeatedly perform the activity. Further, students can obtain a proposed correct solution, receive clarification on words (those underlined with a dotted line include a comment when you mouse over them), check their responses (through immediate feedback), and receive the guidance of the avatar or meta-tutor. The avatar, which can be seen at the top right of Figure  3 , acts as a guide in the learning process, emerging when the student makes a mistake or seeks to provide an answer before attempting the exercise. Based on student performance errors, the avatar gives specific instruction tailored to each response and, therefore, to the specific needs of each student. In this way, deficits related to specific learning difficulties in mathematics are addressed. Other tools offered by the program are the protractor, ruler, and compass, which are necessary for various activities.\nThe main way in which students are assessed on their learning is through questioning. There are two types of questions posed to students in Hipatia: theoretical open-ended questions where they must write the correct answer in the space provided, and multiple choice questions where the student chooses the answer in a set. The different question types demand a different cognitive load; whereas multiplechoice questions require students to identify the right answer from a finite list, open-ended questions require that students produce an answer that demonstrates the conceptual and relational underpinnings of the skill (García-Beltrán, Martínez, Jaén, & Tapia, 2006) ."}, {"section_title": "Classroom Application", "text": "The application can be run from the student's own computer (at home or at school), the teacher's computer, or the interactive whiteboard. This means that the application in the classroom can be done in multiple ways. Further, all students and the teacher can access the application simultaneously. As the tool includes both theoretical concepts and practical activities, the application can be done in all weekly math classes to show a content to perform an exercise and correct it. In addition, homework can be given through the application, provided that the student has available personal computer."}, {"section_title": "Summary", "text": "The aim of this study was to present and describe the design and development of an hypermedia tool, Hipatia, which sought to boost self-regulated learning, develop specific math skills, and promote effective problem solving. It was targeted toward fifth and sixth grade students with and without learning difficulties in mathematics and it included the avatar to guide the teaching-learning process and selfregulation simultaneously. A thorough review of the literature revealed the benefits of different instruments for the development of mathematical competence (Özyurt, 2012) and problem solving (Koehler, 2002) , guided self-regulated learning (Azevedo & Aleven, 2013) , improving affectivemotivational aspects (Walker et al., 2012) , and intervention in specific difficulties in mathematics (Andrade-Aréchiga et al., 2012) . However, no one tool combined all these variables; this was our goal with Hipatia. It can be concluded that anales de psicología, 2016, vol. 32, nº 1 (enero) it adapts to student proficiency with each skill and adjusts in each individual case to individual student needs. This is relevant in the context of diversity, especially because research makes clear that not all students learn the same way at the same speed (Lee et al., 2005) .\nThe importance of the guide in the learning process has great relevance considering that students who performed better academically place more emphasis on the planning phase of self-regulated learning (Cueli, García, & González-Castro, 2013) . Hence, it is very important to strengthen and practice this first phase with students who struggle. Overall, we have concluded that Hipatia is well aligned with the principles of self-regulated learning."}, {"section_title": "Directions for Future Research", "text": "The true benefits of Hipatia still need to be tested with an empirical methodology. Therefore, one of the future lines of research includes the implementation of the tool in the daily classroom routine in order to ascertain its impact compared to traditional teaching methods. To do this, the technology should be implemented over an extended time and there should be comparison groups who do not use this or other digital tools. To do so would require the consent of the centers as well as parents of students. In order to see the benefits of working with this tool, the researcher should apply at least one of the proposed themes and also compare the results of students with other groups of the same level of education who had worked the same subject following a traditional methodology in order to determine and then compare the rate and depth of acquisition of math skills through each method. The teacher must be trained in handling Hipatia and implement the schedule with fidelity. Also, to study the effects on self-regulation of learning, questionnaires may be used for self-regulation, which should be completed prior to and after the intervention.\nIn addition to assessing the effectiveness of Hipatia improving self-regulation, it is necessary to know its benefits on students´ academic performance in this subject and on other affective-motivational variables related to mathematics such as anxiety, motivation or perceived competence. These variables, as well as self-regulation, would be assessed using self-report methods responded by a group of students who would work with the hypermedia tool and another group of students who would follow a traditional learning methodology. Furthermore, the questionnaires would be completed prior to and after the intervention. An expert would go to the schools to give the specific instructions and supervise the administration. At the same time, this process would be done by means of an online platform where the students would be required to enter with an individual username and password. However, other process-based assessment could be carried out, following protocols such as thinking aloud or triple task, as applications to the area of mathematics are already being initiated .\nOn the whole, the line of future research proposed is to analyze the impact of the tool on three key areas: mathematical learning process, students´ self-regulation in this subject and other affective-motivational variables. Taking the guidelines described here into account, a first empiric study was carried out with the aim of analyzing the benefits of this new technology in four affective-motivational variables (perceived usefulness, perceived competence, intrinsic motivation and anxiety towards mathematics) and determine if such benefits are related to the previous affective-motivational levels in these variables. To achieve this goal 425 fifth and sixth grade students received an intervention with Hipatia. This first application was based on the work with the topic \"Loca\" which students learned during a month three times per week. The affective -motivational levels of all students were collected before and after intervention using the Inventory of Attitudes towards Mathematics Rosário et al., 2007) . The results of the t Student Test for related samples showed statistically significant differences in the post-test compared to pretest variables in perceived competence and math anxiety. In addition, the students with low prior affective-motivational levels obtained greater benefits from the intervention (Cueli, Gonzá-lez-Castro, Rodríguez, Núñez, & González-Pienda, In press )."}]