[{"section_title": "Abstract", "text": "Abstract We engage the concept of ecological instability to assess whether children's exposure to frequent change in multiple contexts is associated with teacher reports of students' overall behavior, externalizing behavior, and approach to learning during kindergarten. We operationalize multiple dimensions of children's exposure to repeated change-including the frequency, concurrency, chronicity, timing, and types of changes children experiencein a nationally representative longitudinal cohort of U.S.-born children (Early Childhood Longitudinal Study-Birth Cohort, N~4,750). We focus on early childhood, a period of substantial flux in children's family and neighborhood contexts. Predicted behavior scores differ by approximately one-fifth of a standard deviation for children who experienced high or chronic exposure to ecological change compared with those who experienced little or no change. These findings emphasize the distinctiveness of multidomain ecological instability as a risk factor for healthy development that should be conceptualized differently from the broader concept of normative levels of change in early childhood environments."}, {"section_title": "Introduction", "text": "Since the mid-2000s, demographers and family scientists have emphasized the role of instability in children's environments in shaping cognitive achievement, socioemotional well-being, and behavior across the early life course. Broadly, instability has been defined as frequent and closely sequenced changes in the composition and characteristics of children's social contexts. Much work has focused on instability in specific domains, including parents' union instability (Cavanagh and Huston 2006; Fomby and Cherlin 2007; Lee and McLanahan 2015; Osborne and McLanahan 2007; Wu and Martinson 1993) , changes in coresidence with extended kin (Dunifon and Kowaleski-Jones 2007; Landale et al. 2014; , residential mobility (Fomby and Sennott 2013; Fowler et al. 2015; Haynie et al. 2006; South et al. 2005) , parents' variable work schedules and employment status (Conger and Elder 1994; Dunifon et al. 2013; Rege et al. 2011) , and frequent changes in childcare arrangements (Crosnoe et al. 2014 ). More recently, scholars have drawn on the concept of environmental chaos to consider whether child well-being is compromised by the \"routine uncertainty\" that emerges from experiencing frequent change in a variety of domains simultaneously or in close sequence (Coley et al. 2015; Kamp Dush et al. 2013; Odgers and Jaffee 2013; Vernon-Feagans et al. 2016) .\nThese approaches-whether focused on individual domains of instability or considering instability more holistically-are premised on the notion that instability has an independent association with children's development net of circumstances at any one point in time. This expectation is guided by perspectives derived from family stress theory and family systems theory that emphasize the potential stress to parents and children when established relationships and routines are disrupted repeatedly without sufficient opportunity to achieve and adapt to a new equilibrium (Hill et al. 1949; McCubbin and Patterson 1983) .\nFurther, research on instability is motivated by the observation that children's more proximate settings, such as the family-based household, are embedded in a larger set of interconnected contexts including extended kin, neighborhoods, schools, and parents' work environments (Bronfenbrenner 1979) . This interconnectedness implies two potential consequences of instability in a given context: (1) changes in one setting (such as the home) may affect well-being in another (such as school); and (2) changes in one setting may trigger changes in another. For example, parents' union dissolution may lead to a cascade of changes in residence, parents' work hours, and childcare arrangements. The U.S. Centers for Disease Control and Prevention (CDC) (2012) have called for public policy and family practice strategies to prevent or ameliorate the effects of instability on child well-being, a recommendation based on research demonstrating that stable environments buffer children from stress and help them to develop a sense of their environments as predictable and manageable.\nWe draw on these insights to consider how exposure to instability in multiple contexts during early childhood-ecological instability-is associated with students' externalizing behavior and approach to learning during kindergarten. The selected child behavior outcomes are of interest because of their robust association with specific dimensions of instability that children experience-including family structure change, residential mobility, and parents' inconsistent work hours-and because they are critical components of school readiness. This work makes three contributions. First, we operationalize the concept of ecological instability by measuring and assessing multiple dimensions of children's exposure to repeated change, including the frequency, scope, concurrency, chronicity, developmental timing, and types of changes children experience in a nationally representative sample of U.S.-born children followed over four waves from birth to school entry. Comparing these metrics offers purchase for identifying the conditions under which instability matters for children in order to inform policies designed to support children's school readiness. Second, we focus on ecological instability during a period of substantial flux in children's family and neighborhood contexts but that has received relatively little research attention: early childhood (the years before school entry). Third, we consider how prior exposure to ecological instability is associated with children's adjustment to kindergarten based on teachers' reports of children's well-being. Teacher reports at this life stage provide a distinctive early assessment of how children are managing the transition to school, an event with enduring consequences for educational attainment and long-term well-being (Alexander et al. 2014; Entwisle et al. 1998 )."}, {"section_title": "Children's Developmental Ecologies", "text": "To provide a framework for understanding the content and context of instability in young children's lives, we use the term developmental ecologies to refer to the proximal features of children's everyday lives that affect their development and health (Mollborn 2016 ). Children's proximal developmental ecologies are shaped by more distal influences (such as their communities' social organization and economic circumstances) as well as by social categories (such as parents' age and child's gender, race, and ethnicity). Developmental ecologies in turn affect children's interpersonal relationships with family members, teachers, and peers. We acknowledge the importance of macro-level influences on children's development and health, but like many others studying similar issues (e.g., Becker 1991; Elder 1974) , we retain a primary focus on more proximal influences to represent a child's developmental ecology.\nWithin this perspective, we focus on disruptions to the social contexts and circumstances that shape the conditions under which children interact with parents, peers, and other adults. This conceptualization contributes to early life course theory by broadly defining children's environments and by considering how changes in those environments condition children's initial engagement with social institutions. We use the term ecological instability to refer to this constellation of disruptive events. In particular, we consider changes in children's household composition, as indicated by children's coresidence with parents, extended household members, and siblings; place of residence, as indicated by parent-reported number of residential moves; childcare arrangements, as measured by parent-reported changes in childcare settings and weekly hours in care; and maternal employment status, as measured by being not employed or employed part-time or full-time. We emphasize these contexts because we expect that a child's household, neighborhood, and childcare settings together provide the backdrop against which much of a child's early development takes place. Further, we expect that mothers' employment status and changes in that status play a significant role in shaping when and how parents and children interact. Prior research has demonstrated that instability in each of these domains is predictive of children's behavior problems and diminished school readiness (Cooper et al. 2011; Fomby and Cherlin 2007; Fowler et al. 2015; Morrissey 2009; Rege et al. 2011) , but little research to date has considered the extent to which transitions in these various domains co-occur or whether closely sequenced transitions across multiple domains are distinctively associated with children's subsequent development compared with transitions in a single domain (Crosnoe et al. 2014; Fomby and Sennott 2013; Fowler et al. 2015; South et al. 1998) .\nWe acknowledge that other proximal features of children's environments in early childhood are independently associated with behavioral development and also may co-occur with the changes in children's contexts that we consider here. These include material and economic resources, the quality of interactions with kin and others, and family behaviors and environmental characteristics that influence children's well-being (Mollborn 2016) . To the extent possible, we control for these factors observed when children were infants. We leverage the developmental ecology perspective in order to assess whether a broad view of children's experience of instability provides a useful metric for exploring variation in children's early behavior problems and school readiness."}, {"section_title": "Dimensions of Change", "text": "Much research on instability in children's environments has relied on counts of the number of transitions that children have experienced (Cooper et al. 2011; Fomby and Cherlin 2007; Osborne and McLanahan 2007; Wu and Martinson 1993) . Although this linear specification has yielded significant associations between exposure to instability and a variety of child behavior outcomes, we expect that more complicated dynamics-such as chronicity, scope, and concurrency across domains, and nonlinearity in instability effects-may be useful complements to this more straightforward approach. Thus, we develop seven approaches to measuring instability in childhood: frequency, scope, concurrency, thresholds, developmental timing, chronicity, and domain-specific change."}, {"section_title": "Frequency", "text": "Frequency of change is at the core of research on children's experience of instability. Underpinning this notion is the expectation that change in children's social contextswhether expected to be positive, detrimental, or neutral-requires children to adjust to new circumstances. This perspective is grounded in family systems theory, which predicts that frequent changes that occur over short or unpredictable intervals inhibit children from establishing routines, expectations, and relationships in one set of circumstances before those circumstances change again (Hill et al. 1949) . In a variety of the domains we consider, empirical research measuring transitions as counts of events has documented that each additional transition is associated with higher predicted likelihoods of presenting externalizing and delinquent behavior and risky behavior (Fomby and Cherlin 2007; Fomby and Sennott 2013; Haynie et al. 2006; Morrissey 2009; Wu and Martinson 1993) . In considering the frequency of changes a child experiences, we characterize ecological instability as the cumulation of change over early childhood, with the total experience of repeated transitions across domains more salient to children's behavior than the domains in which children experience change and independent of their circumstances at any point in time."}, {"section_title": "Scope", "text": "Prior to school entry, many young children experience change in domains that structure their contexts for early socialization, including household family composition, neighborhoods, childcare settings, and parents' employment status and routines (Anderson et al. 2014; Brand and Thomas 2014; Cavanagh and Huston 2006; Dunifon et al. 2013; Jelleyman and Spencer 2008; Johnson et al. 2012; Long 1992; Mollborn and Blalock 2012; . Within each domain, transitions are often normative and intended to improve or maintain children's well-being. However, the spread of transitions over multiple domains may coalesce into a broadly unstable developmental environment with distinctive implications for children's adjustment, particularly where transitions are externally imposed, such as through sudden unemployment or eviction. This assertion is motivated by Bronfenbrenner's (1979) ecological systems theory, which highlights the interconnectedness of children's developmental domains and points to two related corollaries: (1) change in one domain may precipitate changes in other domains over time; and (2) children's adjustment to change in any one setting may be buffered if circumstances in other domains remain stable, particularly where children's social support systems remain intact (Fomby et al. 2010; Hetherington 1999; McLoyd et al. 2000) . In accounting for scope, we consider whether instability is meaningfully characterized by changes occurring in multiple domains in the years prior to school entry, even if low-frequency within any single domain."}, {"section_title": "Concurrency", "text": "The concept of concurrency considers changes in multiple domains that occur over a relatively short interval. Co-occurring or closely sequenced changes in multiple social contexts occur throughout childhood. For example, although more than 85 % of children experience change in their childcare arrangements at some point prior to school entry, such changes occur approximately 10 % to 25 % more often in periods when family structure also changes (Crosnoe et al. 2014) . Similarly, children who experienced a divorce were four to five times more likely to move out of their census tract in the following year, and children whose parent remarried were three to four times more likely to move compared with children who lived continuously in stable two-parent families (South et al. 1998) . Young children are also more likely to experience changes in mothers' work hours and changes in kin coresidence when parents' union status changes (Crosnoe et al. 2014; . To the extent that changes in multiple domains over a short time horizon compound additively or multiplicatively to influence child well-being (Simmons et al. 1987; Tucker et al. 1998) , instability characterized by concurrent transitions may best represent the relationship between frequent change in social contexts and children's behavior problems."}, {"section_title": "Thresholds", "text": "Some research has defined instability as the most frequent change in a given distribution (e.g., the top quartile) or as change above a given criterion or threshold (e.g., three or more changes in an interval). Here, the expectation is that the association between the transitions and children's behavior is better described by a discontinuous step function than by a linear association. The underlying expectation is that children and families possess the coping strategies and resources to adjust to one or two types of change in a short interval, but very frequent change would overwhelm those strategies and resources. Recent ethnographic work on frequent instability in family composition, employment, and housing has characterized the experience of extreme ecological instability (Desmond 2016; Edin and Nelson 2013; Edin and Shaefer 2015) ."}, {"section_title": "Developmental Timing", "text": "The developmental timing approach considers that the magnitude of the association of ecological instability with children's emergent behavior trajectories may change as children's age. For example, several studies have documented that very early family instability is robustly and more strongly associated with later behavior problems than is more proximate family structure change (Cavanagh 2008; Fomby 2013; Fomby and Bosick 2013) , and others have shown that early transitions out of extended kin coresidence may be associated with better child outcomes compared with remaining in that residential status (Dunifon and Kowaleski-Jones 2007; . Similarly, to the extent that employment and residential transitions may signal financial strain, prior work has documented an association between socioeconomic disadvantage and child development that increases through early childhood and then diminishes in the preschool year (Mollborn et al. 2014 ). To assess whether there is variation in the association of ecological instability with children's behavior at school entry depending on when the instability occurs, we consider the total number of changes occurring between 9 months and 2 years, 2 years and 4.5 years, and 4.5 years and school entry separately."}, {"section_title": "Chronicity", "text": "We consider that chronic ecological instability-the enduring experience of changemay be uniquely consequential for children's behavioral development. In contrast to concurrency, which considers the number of changes co-occurring in a short interval, chronicity considers the duration of exposure to change. Here, the notion is that long-term exposure to disruption may be more consequential than a concentrated period of transition at one phase of the early life course. Chronic ecological instability may emerge from one precipitating event, such as union dissolution. For example, the Virginia Longitudinal Study of Divorce and Remarriage found that divorced women with children moved an average of four times in six years following union dissolution, and poor women in the sample moved seven times in that period, often into progressively lower-quality neighborhoods (Hetherington and Kelly 2002) . We assess chronic exposure to ecological instability by counting the number of between-wave intervals in which children are in the top quartile for transition events across domains."}, {"section_title": "Domain-Specific Change", "text": "Finally, we consider each of the various domains in which instability may occur. Although prior research has documented that changes in various components of household composition, place of residence, childcare, and employment are each consequential for children, they have not been evaluated together. We assess the magnitude and strength of the association of each dimension with each outcome when the other dimensions are accounted for."}, {"section_title": "Teacher Reports of Children's Behavior", "text": "We document the association of ecological instability with teacher reports of children's behavior at kindergarten entry. We use teacher reports of children's behavior outcomes for two reasons. First, teachers are uniquely positioned to describe children's behavior in the classroom, a setting where children's early social relationships, self-identity, and academic habits begin to take shape in in a context that is likely to remain salient to their evolving developmental ecologies over time (Entwisle et al. 2003; Weller et al. 1992) . Parent reports of children's behavior at home do not capture this distinctive perspective (Hinshaw et al. 1992; Winsler and Wallace 2002) . Second and relatedly, teachers are powerful agents in shaping children's educational trajectories. Teachers' assessments of children determine the grades they earn and influence next-year classroom placements, retention, and referrals to special education. Thus, teachers' perceptions of children's behavior at school entry potentially have enduring consequences for their long-run educational experiences (Alexander et al. 2014) .\nWe consider teachers' assessments of children's behavior overall and on two subscales: externalizing behavior and approaches to learning. These reports provide an opportunity to assess whether related but distinct spheres of behavior are similar in their association with ecological instability. Specifically, a substantial body of research has documented that instability in various domains is associated with externalizing behavior. This finding continues to warrant attention because it is underlain by an expectation that aggressive and disruptive behavior compromises children's academic trajectories. This expectation has been supported to some extent by evidence that children who have experienced some types of instability are less likely than their peers to complete college-preparatory coursework in high school or to attend college (Cavanagh and Fomby 2012; Fomby 2013) . However, the pathways through which this compromise occurs are not well articulated. \"Approaches to learning\" (described in more detail later) refers to a set of classroomrelevant behaviors that we expect are related to externalizing behavior and that contribute to teachers' early and consequential assessments of children as students."}, {"section_title": "Data and Method", "text": "We use data from the Early Childhood Longitudinal Study-Birth Cohort (ECLS-B), which followed a nationally representative sample of approximately 10,600 children born in 2001 from infancy through the start of kindergarten (U.S. Department of Education 2009). Because of security requirements, all sample sizes are rounded to the nearest 50. No other nationally representative U.S. study has tracked children through these first years of life using parent interviews and direct assessments. All 2001 births registered in National Center for Health Statistics vital statistics were eligible, and the sample was drawn using a clustered, list-frame design. Children were sampled from 96 counties or county groups. Children with mothers younger than age 15 at their birth were excluded from data collection for confidentiality reasons.\nThis study used data from all waves of the survey, conducted when the children were approximately 11, 24, and 52 months old (typically the fall before the start of kindergarten), and in the fall of their kindergarten year at an average age of 66 months. (Thus, most children were interviewed in fall 2006, but some were interviewed in fall 2007.) The primary parent, who was almost always the biological mother, was interviewed in person. Because of budgetary constraints, the kindergarten wave included a random subsample of approximately 85 % of the children who had completed the parent interview of the preschool wave, although all American Indian children who completed either the two-year or preschool wave were included (Snow et al. 2009 ). Some of the sample was lost to attrition or subsampling from budget constraints, but after weighting, the resulting analyses are representative of the cohort (Snow et al. 2009 ). The weighted response rates for the parent interview at each wave were 74 %, 93 %, 91 %, 92 %, and 93 %, respectively. The children eligible for the current analysis had valid kindergarten wave teacher report weights and clustering information, and their biological mothers completed the kindergarten parent interview.\n1 Multiple imputation was used to retain the approximately 4,750 eligible cases.\n2 All analyses adjusted for complex survey design using probability weights and accounting for replication weights in Stata."}, {"section_title": "Outcome Measures", "text": "Outcome variables capture different facets of children's socioemotional behavior as reported by their kindergarten teacher. Kindergarten information was taken from either Wave 4 or Wave 5, depending on when the child first enrolled in kindergarten. Children's overall behavior was captured by a standardized continuous variable, constructed from an index of 24 items in which the teacher was asked how frequently the child acted in certain ways, with responses given on a five-point scale ranging from \"never\" to \"very often\" (Cronbach's alpha = .93). Higher values represent more favorable behavior. The items were drawn from the Preschool and Kindergarten Behavior Scales -Second Edition, the Social Skills Rating System, and the Family and Child Experiences Study, as well as new questions developed for ECLS-B.\nPrincipal components analysis retained four factors representing subscales of behavior: externalizing behavior, approaches to learning, internalizing behavior, and 1 Approximately 300 children were omitted because their biological mother did not complete the kindergarten parent interview. Approximately 1,700 children completed the kindergarten wave but did not have a kindergarten teacher complete the survey. The teacher weights, used in this study, adjust for teacher nonresponse. 2 Separate imputations were implemented for each operationalization of ecological change. Each imputation model included 10 iterations using the SVY suite of commands to account for complex survey design. Each imputation model was informed by all variables included in the associated full analytic model as well as by child development and physical health indicators from each wave and by kindergarten household factors. social competence. In each subscale, relevant items range from 1 to 5 and are averaged and standardized. Greater values for each subscale represent higher levels of the construct (e.g., higher levels of approaches to learning behavior are beneficial, and higher levels of externalizing behavior are detrimental). Items were reverse-coded as needed to construct unidirectional scales. The analysis presented here focuses on the overall score and the first two subscales. Parallel results for the latter two subscales are available in Online Resource 1.\nExternalizing behavior is described as aggressive or rule-breaking behavior that is typically directed outward and in opposition to other individuals or against property; it is distinct from internalizing behavior, which is characterized by symptomatology that reflects depression and anxiety (Achenbach 1992) . Externalizing behavior in early childhood is predictive of clinical diagnoses of behavior disorders and longer-term delinquency, risky behavior, diminished academic performance, and educational attainment (Keenan et al. 1998; Masten et al. 2005; Miech et al. 1999; Moffitt 1993) . Items in the subscale include whether the child shares with other children (reverse-coded), acts impulsively, is overly active, has temper outbursts, is aggressive physically, annoys others, disrupts others, or is restless.\nApproaches to learning largely reflects children's self-regulation, or the capability to manage emotions and attention in ways that are efficacious for classroom learning (Calkins and Fox 2002; Eisenberg and Spinrad 2004) . Early teacher-and parentreported approaches to learning and focused attention are predictive of later academic achievement (Duncan et al. 2007; Li-Grining et al. 2010) . Subscale items include whether the child is eager to learn, does a good job paying attention, works independently, works until a task is completed, or has trouble concentrating (reverse-coded)."}, {"section_title": "Measures of Ecological Instability", "text": "Change in children's ecological context is based on counts of the number of transitions a child experienced between infancy and school entry. For some analyses, we subsequently recoded each count variable into three categories, with cutoffs as close to the first and third quartiles as possible. Within each domain, we captured a child's situation at each wave and identified changes between waves. Thus, these variables ranged from 0-3 total changes. Such measures included change in the presence of any coresident grandparent or any other coresident adult, the number of coresident children, and the type of childcare (based on the categories of Head Start, other center-based care, care by a relative, other non-center-based care, and no nonparental care). Maternal paid work hours and childcare hours were first coded into three categories (0, 1-29, or 30 or more hours per week), and then changes from one category to another were counted. Mother's changes in union status from birth to Wave 1 and between waves captured the entry and departure of spouses and coresident partners, with up to two transitions possible between each wave (the exit of a partner and the entry of another). The variable ranged from 0 to 6 transitions. The survey tracked residential moves in greater detail, asking from the second wave forward about the number of moves since the previous wave. At Wave 5, respondents simply indicated whether they had moved since Wave 4. The constructed variable ranged from 0 to 25 residential moves.\nFrom these classifications, we developed the seven indicators of ecological instability described earlier: (1) frequency of change, measured by the total number of changes children experienced across all domains and across all waves; (2) scope of change, the number of domains in which children experienced change by school entry; (3) concurrency of changes, summing the number of domains of change children experienced during each age interval; (4) thresholds of total change and domains of change, comparing children in the bottom quartile on frequency and scope of change with those at roughly the 25th-75th percentile or above the 75th percentile (comparing 0-4 with 5-9 to >10 total changes, and 0-2 with 3-5 to >6 domains of change); (5) developmental timing of change, measuring separately the frequency and scope of changes experienced between birth and age 2, age 2 and 4.5 years, and between age 4.5 and school entry; (6) chronicity of change, indicated by the number of waves in which children experienced high (vs. medium or low) amounts of change; and (7) domainspecific type of change, measured by the number of changes children experienced in each domain between birth and school entry separately.\nAll multivariate models control for child age at Wave 1 and at the kindergarten wave, gender, race/ethnicity, and birth weight. Family background characteristics include whether the child was born to a teen mother and whether the mother was foreign-born, lived with both parents until age 16, was herself born to a teen parent, ever repeated a grade, and ever received welfare as a child. Household resources at Wave 1 (in infancy) include mother's educational attainment; whether anyone in the household had special needs; whether the household was participating in the Women, Infants, and Children program (WIC), the Supplemental Nutritional Assistance Program (SNAP/food stamps), or the Temporary Assistance to Needy Families program (TANF); mother's marital status (cohabiting or single vs. married); whether any grandparents or other adults were coresident in the household; the household income-to-needs ratio; household assets; child's health insurance status; and whether the mother's own parent provides childrearing advice to her. Early indicators of ecological context were measured by mother's marital status at birth (cohabiting or single vs. married) and at Wave 1, whether any grandparents, other adults, and other children were coresident in the household, as well as mother's work status (0 = not working, 1 = part-time, 2 = 30 or more hours per week). Descriptive statistics appear in Table 4 in the appendix. Table 1 summarizes the dependent variables and indicators of ecological instability. By school entry, children had experienced an average of 7.19 changes in their broad ecological contexts. Some amount of change is nearly universal: 99.2 % of children experienced some type of transition prior to school entry, and changes frequently occurred across the dimensions we consider. The distribution of the amount of change is highly dispersed, though, ranging from 0 to 36 events. Approximately one-quarter of children experienced 10 or more changes (classified as \"high\" levels of total change in our nonlinear measure of the frequency of change); 10 % experienced 12 or more changes (not shown)."}, {"section_title": "Results", "text": "Children experienced frequent change at each stage of early childhood, but the prevalence of any change and the number of changes were higher in the toddler and preschool years (i.e., after age 2) compared with during infancy. The greatest Count of domains of change, age 2-4.5 2.56 0.03 0-7 9 2\nCount of domains of change, frequency of change occurred between the age 2 and age 4.5 interviews but was nearly as high in the subsequent shorter interval between age 4.5 and school entry, suggesting that children experienced a substantial amount of transition in their immediate environments at this life stage. Considering chronic change, approximately 14 % of children experienced high levels of change in two interwave periods (i.e., in the top quartile at each period), and 5 % experienced high levels of change in all three periods. Among the domains we considered, residential change, changes in childcare arrangements, and changes in mother's work status were most frequent. Eightyseven percent of children experienced any change in childcare arrangements (including entering nonparental care at all), and most experienced two or three wave-to-wave changes (not shown). Considering residential mobility, approximately one-third of children remained in the same dwelling across childhood. Approximately two in five children experienced one or two changes, and nearly one-quarter experienced three or more moves (not shown). Changes in family structure occurred less often. The most common type of change pertained to the presence of other children, usually the addition of a younger sibling. Approximately one-quarter of children experienced a coresident parent's change in union status, 10 % moved in or out of coresidence with a grandparent, and 20 % changed coresidence with other adults. This kind of compositional change may have co-occurred when, for example, a change in union status between waves precipitated a move into or out of a household with extended kin.\nReturning to the guiding concept of ecological instability, our descriptive results suggest that instability may be distinguished from the more general experience of any change by frequency, density, chronicity, or range. Our multivariate analysis assesses the utility of each of these approaches to describe the relationship between exposure to instability in early childhood and behavioral school readiness. Table 2 reports unstandardized coefficients from imputed bivariate ordinary least squares (OLS) regression models predicting children's standardized behavior scores at school entry as a function of each specification of ecological change. Table 3 reports unstandardized coefficients associated with these measures when control variables are included. In each model, the magnitude of the coefficient represents change in the predicted standard deviation units of change in the dependent variable for a one-unit change in the independent variable. Because the metric varies across the different indicators of ecological instability, the magnitudes of the various coefficients are not directly comparable, and the models estimated on imputed data cannot produce standardized coefficients. To assess the practical implications of our findings, we also describe the effect sizes for one specification of ecological instability on children's total behavior scores in comparison with other domains of children's experience that are also predictive of young children's overall behavior scores. We also report children's predicted behavior scores after exposure to varying levels of ecological instability from the models summarized in Table 3 , holding all control variables constant at their respective means (upcoming Fig. 1) . Table 2 shows that most methods of assessing ecological instability were associated with each indicator of behavioral school readiness at p < .05 or higher in bivariate models. Considering the frequency of total change, each additional change a child experienced was associated with a 0.04 standard deviation decrease in children's overall behavior and approaches to learning scores and a 0.04 standard deviation increase on the externalizing behavior scale. Given that the a High-level is significantly different from mid-level. † p < .10; *p < .05; **p < .01; ***p < .001 (two-tailed tests) Table 4 in the appendix. † p < .10; *p < .05; **p < .01; ***p < .001 (two-tailed tests) Early and more recent exposure to change overall or in multiple domains were also consistently associated with each outcome in the expected direction. With regard to chronic exposure, each additional wave at which a child had experienced high levels of change was associated with a 0.14 to 0.15 standard deviation change in the predicted value of each outcome. For the 5 % of children who experienced high levels of change at each interval, this translated to an unadjusted 0.42 standard deviation increase in predicted externalizing behavior scores and a decrease of the same magnitude in approaches to learning scores compared with children who did not experience frequent change. Among the various types of change we consider, the total number of changes in grandparent coresidence, maternal employment status, and childcare arrangements (hours or type) were unrelated to either outcome at p < .05 in the bivariate models. We note that there are potentially salient asymmetries in the direction of change in these domains (e.g., transitions into unemployment vs. employment) that should be incorporated into estimates of instability in order to further refine how such change is associated with children's behavior. Table 3 reports unstandardized coefficients associated with each type of ecological instability after introducing control variables. In general, the coefficients were reduced in magnitude by 50 % to 60 % compared with Table 2 . Two specifications of ecological instability remained consistently statistically significant across outcomes at p < .05, and four remained significantly associated with two outcomes. Indicators of total amounts of change across domains remained more robust predictors of children's behavior and approaches to learning than did indicators of change experienced within a given domain. In particular, total change (frequency) and high levels of change across domains (threshold) remained associated with each outcome at p < .05 or higher. High levels of change across domains also remained significantly different from moderate levels of change. Further, chronic change and recent changes (timing) remained associated with two of three outcomes. Among the specific types of change we considered, only residential mobility remained independently associated with the subscale outcomes but not overall behavior.\nIn a hypothetical example of a child who experienced a relatively high level of ecological instability by school entry, effect sizes associated with these specifications of ecological instability were approximately one-fifth of a standard deviation. Using the continuous measure of frequency of change, a child who experienced 10 transitions (the cutpoint for the top quartile) would have a predicted overall behavior score 0.20 standard deviations lower (i.e., less favorable) than a child who experienced no changes. Highly frequent change across domains would predict a 0.19 standard deviation decrease in the overall behavior score compared with low frequency, and chronic change (high-frequency change at every interwave period) would predict with a -0.21 standard deviation decrease compared with no waves having high frequencies of change. Prior research has considered an overall behavior score lower than 1 standard deviation below the mean to carry significant consequences for children's later achievement in school (Pritzker et al. 2015) . By that measure, most indicators of ecological instability may be considered to have small but meaningful independent associations with each outcome after accounting for family background and family circumstances shortly after birth.\nThe magnitude of these effect sizes is comparable to or greater than those for other demographic predictors included in our analytic models. Table 5 in the appendix displays the coefficients for all control variables in predicting overall behavior scores under two different specifications of ecological instability: total frequency and scope (frequency of types of change). A difference of one-fifth of a standard deviation is 10 times larger than the effect of an increase in household income equivalent to 100 % of the federal poverty line. It is nearly twice the effect of having a mother who worked full-time, being born with moderately low birth weight, or of having a mother who grew up in a single-parent household. The magnitude of this difference in predicting teacher ratings of child behavior is similar to being a year older at kindergarten entry, to having a household member with special needs, or to living in a household that received food stamps. As one example put another way, a 1 standard deviation increase in the total number of changes a child experiences (SD = 3.75) is associated with a 0.072 standard deviation increase in a child's predicted externalizing behavior score. A 1 standard deviation increase in a child's age at school entry (SD = 4.43 months), in comparison, is associated with a 0.057 standard deviation decrease in the predicted externalizing behavior score. The only predictors in the model with a stronger relationship to behavior scores are child gender (boys have lower overall behavior scores) and being born with very low birth weight. Figure 1 summarizes predicted scores from Table 3 for overall behavior (panel a), approaches to learning (panel b), and externalizing behavior (panel c), varying the specification of ecological instability and holding control variables at their means. (For continuous measures of total ecological change and total domains of change, we input the values at the bottom and top quartiles of their respective distributions into the equations used to generate the predicted values that appear in the figure.) In the interest of space, we present only those specifications that were statistically significantly associated with each outcome. The figure highlights that high levels of change as measured by the nonlinear threshold approach and chronic instability are associated with behavior scores approximately one-tenth to one-sixth of a standard deviation less favorable than the sample mean. Thus, although continuous and nonlinear measures of ecological instability produce similar effect sizes, the two approaches yield different substantive conclusions about children's predicted behavior scores relative to the population distribution.\nWe extended this work in two ways. First, related research has suggested that the association between ecological instability and child behavior varies by socioeconomic status or race/ethnicity (Coley et al. 2015; Fomby and Cherlin 2007; Fomby et al. 2010) . Therefore, we estimated supplemental models that introduced first an interaction between child race/ethnicity and each measure of ecological instability, and then an interaction between Wave 1 household socioeconomic status (using the ECLS-B-constructed measure divided into quintiles) and ecological change. These interactions were not significant in predicting any outcome. We conclude that the various specifications of ecological instability operate similarly across race/ethnicity and socioeconomic class groups for the outcomes and population considered here, but alternative specifications of ecological instability that reflect children's social contexts at later life stages may reveal stronger sociodemographic patterning in exposure to and response to repeated change.\nSecond, we tested the unadjusted and adjusted associations between each indicator of ecological instability and the two other subscales that emerged from the overall behavior scale: internalizing behavior (characterized by symptomatology that reflects depression and anxiety) and social competence (i.e., social engagement and cooperation). Instability has had a less robust association with these outcomes in prior research compared with overall behavior or externalizing behavior (Cavanagh and Huston 2008; Lee and McLanahan 2015; Lichter et al. 2002) . Results from these analyses were not included here in the interest of space but are available in Online Resource 1. Most measures of ecological instability were associated with each outcome in the bivariate context and were attenuated by approximately 50 % when control variables were added. Chronic change remained predictive of both outcomes, and frequency of change remained associated with internalizing behavior."}, {"section_title": "Discussion", "text": "Our aim was to assess a variety of specifications of the concept of ecological instability in early childhood in order to identify the conditions under which instability is associated with teachers' evaluations of children's behavior at school entry and to inform policies designed to support children's school readiness. We defined ecological instability as frequent changes occurring in multiple developmental contexts across early childhood. Guided by the framework of children's developmental ecologies, the contexts and conditions we considered included parents' union status; coresidence with grandparents, other adults, and other children; residential stability; childcare type and hours; and maternal employment status. We highlight three key findings.\nFirst, we found that children experience a fair amount of cumulative change across developmental contexts in early childhood. On average, children experienced just over seven transition events over approximately 5.5 years, and changes in childcare arrangements, residence, and maternal employment were particularly common. Low and moderate levels of ecological change during early childhood had neutral associations with behavior at school entry. However, high levels of change and persistent exposure to change were associated with compromised teacher-reported behavior scores after taking background characteristics and family circumstances into account. The magnitude of these associations is small but on par with sociodemographic, family background, and health characteristics that are meaningfully predictive of children's early learning outcomes. These findings emphasize the distinctiveness of instability as a risk factor for healthy development that should be conceptualized differently from the broader concept of change. Although change in developmental contexts is a nearly universal, normative, and often well-supported experience in early childhood, instability is marked by frequent and enduring disruption that potentially has independent associations with compromised early development apart from the circumstances where children begin or end up. As such, we propose that measures of ecological instability that capture threshold effects or chronic exposure may offer a useful complement to the more common method of using continuous count-based measures of ecological change to represent instability. This approach is consistent with family stress and family systems theories, which expect that change will be more challenging for children and families to adapt to when it is frequent, persistent, or nonnormative.\nSecond, our results support a broader ecological approach to understanding the implications of instability in early childhood. Consistent with ecological systems theory, we found that examining a single domain, such as union instability, is not as revealing as is combining changes across several domains. That said, the value of this approach appears to come from improving estimates of the frequency of change children experience, rather than from identifying the concurrency of changes in multiple settings. Considering the number of settings in which children experienced change (scope) was not more useful than considering the total number of change events children experienced across settings (frequency) in predicting behavior at school entry.\nThird, we found that high or chronic instability was predictive of teacherreported overall behavior, externalizing behavior, and approaches to learning, but the magnitude of the association was stronger with the first two outcomes. The association between instability in developmental contexts and children's externalizing behavior is one of the most robust findings in the literature, but the practical consequences of this finding for later academic achievement are not well understood. Documenting the consistent association of ecological instability with overall behavior, externalizing behavior, and approaches to learning connects sets of classroom-relevant behaviors that characterize teachers' early expectations about children as students.\nWe acknowledge several limitations. First, although the choice of developmental contexts considered in our analysis was guided by the developmental ecology framework, the settings we considered are not exhaustive. Other circumstances, such as changes in custody arrangements, paternal employment status, or actual childcare settings (as opposed to childcare type), also likely contribute to children's experience of instability and influence their school readiness. Our goal was not to build a comprehensive model of children's developmental ecologies but rather to demonstrate the utility of considering change in at least some salient developmental contexts simultaneously. Second, our estimates of the number of changes children experienced are based largely on dichotomous indicators of whether any change occurred between waves, rather than the total number of changes experienced. The exceptions are residential mobility and union status change. Thus, it is likely that in other domains, we have underestimated the frequency of change experienced by at least some children. Even within this constrained coding scheme, however, we observed substantial variation in children's experience of ecological instability.\nThird, our analysis of developmental timing is open to interpretation. We found that ecological change in the period just before school entry has the most robust association with behavior. This could be because these changes are the most recent, and children are still responding to this change; because these changes occurred over a relatively short interval compared with the earlier between-wave intervals; or because the children experienced change during this specific developmental period.\nFourth, we did not take into account assymetries in the impact of changes that occur in opposite directions: for example, a parent's move from unemployment to employment may have a different association with chlid behavior than does a move from employment to unemployment. Thus, we may have underestimated the impact of particular types of instability if changes in opposite directions have different influences on child well-being. This tension between thinking about instability as the repeated experience of disruption as opposed to the experience of a specific sequence of events permeates the instability literature. In longitudinal studies with many waves, it is possible to control for circumstances at the beginning and end of the observation period and to observe an analytically meaningful amount of variation in transition events, or instability, between those two states in the intervening waves. With fewer waves-as one often has in studies of early childhood-this approach is more challenging. We controlled for early-life circumstances in each of the developmental contexts considered in our analysis, but we acknowledge that our findings may provide an imprecise description of the association between cumulative instability and children's behavior if there are distinctive patterns of association with the outcomes in each of the potential sequences of change events that children may experience. Further, to the extent that any unmeasured correlates of ecological instability and child behavior are excluded from the analytic model, the associations documented here may be overestimated. We selected a rich set of covariates to minimize the risk of developing a misspecified model, but a fixed-effects model or instrumental variables approach would further refine our understanding of the true strength of the association between ecological instability and child behavior.\nDespite these limitations, this work contributes to the literature on the relationship between instability in early childhood and school readiness by highlighting the distinctive associations of high-frequency and chronic instability with two dimensions of children's behavior and by using the framework of children's developmental ecologies to emphasize the numerous contexts in which children may experience instability. Refining the constructs of instability and children's developmental ecology can facilitate public efforts to support children's well-being by targeting students most at risk of compromised readiness at school entry. "}]