[{"section_title": "", "text": "of information about crime and violence, disciplinary actions and problems, and policies related to school crime. The 2000 SSOCS questionnaire expanded on these topics, and included additional topics related to school practices to prevent or reduce crime, violence prevention programs and activities, and other school characteristics that maybe associated with the presence of crime at school. One of the topics covered by SSOCS was violence-related activities that occurred at public schools during the 1999-2000 school year The focus of this report is the presence of violence and serious violence (a subset of violence) that occurred in American public schools. The incidents of violence collected in SSOCS included rape, sexual battery other than rape, physical attacks or fights with and without a weapon, threats of physical attack with and without a weapon, and robberies with and without a weapon. The measure of serious violence is a subset of these items that includes all of the incidents described above with the exception of physical attacks or fights without a weapon and threats of physical attacks without a weapon."}, {"section_title": "Incidents of Violence in Public Schools", "text": "According to school principals, 71 percent of public elementary and secondary schools experienced at least one violent incident during the 1999-2000 school year (including rape, sexual battery other than rape, physical attacks or fights with and without a weapon, threats of physical attack with and without a weapon, and robbery with and without a weapon). In all, approximately 1,466,000 such incidents were reported in public schools. One or more serious violent incidents (including rape, sexual battery other than rape, physical attacks or fights with a weapon, threats of physical attack with a weapon, and robbery with and without a weapon) occurred in 20 percent of public schools.\nIn 1999-2000, 71 percent of public elementary and secondary schools experienced at least one violent incident (table 1). Approximately 1,466,000 violent incidents occurred in public schools that year. Of those crimes included as violent incidents, physical attacks or fights without a weapon occurred in the highest percentage of schools, with 64percent of all public schools experiencing at least one incident (table 3). Threats of physical attack without a weapon was the crime reported by the second highest percentage of schools, with 52 percent of schools reporting at least one such incident (table 4). A smaller percentage of schools experienced any of the other types of incidents asked in the 1999-2000 school year, ranging from 11 percent of schools that experienced at least one threat of a physical attack with a weapon to 1 percent or less of public schools that experienced at least one robbery with a weapon or rape, respectively (tables 3-6). Thirty-six percent of all public schools experienced at least one violent incident that they reported to the police or other law enforcement (table 2). Of the 1.47 million violent incidents that occurred in public elementary and secondary schools during the 1999-2000 school year, around 257,000 were reported to police. Although this represents 18 percent of violent incidents being reported to police, regulations concerning notification vary by state and district as well as by the type of crime that has been committed. Therefore, some violent incidents, such as fights without a weapon, may not require police notification. In the 1999-2000 school year, 20 percent of American public schools experienced at least one serious violent incident (table 1). In those schools, about 61,700 serious violent incidents occurred. The most commonly occurring serious violent crime was the threat of attack with a weapon, with 11 percent of schools experiencing at least one such offense during the 1999-2000 school year (table 4). The remaining serious violent offenses (rape, sexual battery other than rape, physical attack or fight with a weapon, and robbery with or without a weapon) occurred in 5 percent or less of schools that year Unlike violent incidents, the majority of serious violent incidents (56 percent) that occurred in public elementary and secondary schools were reported to law enforcement (table 2). Principals in those schools that experienced at least one serious violent incident reported about 34,300 serious violent incidents to law enforcement during the 1999-2000 school year Because of the nature and severity of these offenses, the higher rate of involvement oflaw enforcement is to be expected. Principals would likely be obligated to report these types of crimes to law enforcement in most districts, while the simple assaults included in violent incidents may not require police involvement. Although the estimates provided in tables 2 through 7 include a detailed look at the types of incidents collected in the 2000 SSOCS, this report provides analysis of only the total number of violent and serious violent incidents reported by principals for the 1999-2000 school year"}, {"section_title": "School Demographic Characteristics and Violence", "text": "Secondary schools were more likely than elementary, middle, and combined schools to report a violent incident during the 1999-2000 school year (92 percent of secondary schools vs. 61 percent, 87 percent, and 77 percent for elementary, middle, and combined schools, respectively). Elementary schools were less likely to report a serious violent crime than middle or secondary schools, between which no differences were detected in their likelihood of reporting a serious violent incident (14 percent of elementary schools vs. 29 percent for middle schools and 29 percent for secondary schools). In the 1999-2000 school year, the size of a school's student enrollment was related to the prevalence of both violent and serious violent incidents. That is, as enrollment size increased, schools were more likely to report one or more violent or serious violent incidents. City schools (77 percent) were more likely than urban fringe schools (67 percent) to report an occurrence of at least one violent incident during the 1999-2000 school year, while no differences were detected among schools in other locations. When looking at serious violent incidents, however, no such differences were detected when comparing schools in city, urban fringe, or town locations. Rural schools (12 percent) were less likely than schools in cities (27 percent), urban fringe areas (22 percent), or towns (20 percent) to experience a serious violent incident. Principals reporting that their students lived in neighborhoods with high or mixed levels of crime were more likely to report a violent or serious violent incident than those principals with students who lived in neighborhoods with low levels of crime."}, {"section_title": "Characteristics of the Student Population", "text": "Schools with the largest percentage (more than 15 percent) of students below the 15th percentile on standardized tests were more likely than those schools with the smallest percentage (0-5 percent) of students below the 15th percentile to have experienced at least one violent or serious violent incident. The percentage of students who principals felt considered academics to be very important was inversely related to the prevalence of violent and serious violent incidents. As the percentage of students who considered academics important increased, the likelihood of schools experiencing a violent or serious violent incident decreased.\nViolence occurring in a school can be related to the attributes of the school's student body. As shown in studies ofjuvenile offending and school violence, some students may be more likely to commit a violent act, while others may be more likely to be the victims of violence (Addington et al. 2002, Hawkins et al. 2000, Wasserman et al. 2003. Given that some students may be more likely to be exposed to violence both inside and outside of school (DeVoe et al. 2002;Addington et al. 2002), information was collected from principals about the student population. These characteristics included the percentages of the student population who were minorities, eligible to receive free or reduced-price lunch, below the 15th percentile on standardized tests, likely to attend college; who considered academics to be very important; and who were male. Previous research has found that minority youth are exposed to violence more often than other children (Ellickson, Saner and McGuigan 1997). In the school setting, research does suggest that a larger number of minority students experience disciplinary referrals and actions (McCarthy and Hoge 1987;McFadden et al. 1992), but this does not necessarily reflect higher rates of offending behavior. Some studies have found a relationship between the amount of violence in schools and the percent of minority students (Heaviside et. al. 1998;Cantor and Wright 2001); however, other studies  'Violent incidents include rape, sexual battery other than rape, physical attack or fight with or without a weapon, threat of physical attack withor without a weapon, and robbery with or without a weapon. 'Serious violent incidents include rape, sexual battery other than rape, physical attack or fight with a weapon, threat of physical attack with a weapon, and robbery with or without a weapon. have found few differences in the racial composition of schools and the level of school violence (Hellman and Beaton 1986). The percent of the student population that are minorities did not appear to have a strong relationship with violence in public schools during the 1999-2000 school year. No differences were detected between schools with varying levels of minority representation and the prevalence of violent incidents (figure 5 and   table 1). However, a positive relationship existed between the percent of minority enrollment and the prevalence of serious violent incidents (figure 5 and table   1). As the percent of minority enrollment increased in schools so did the likelihood of schools experiencing at least one serious violent incident. An additional measure of the student population that some research has found to have an effect on violence and crime in schools is the socioeconomic status of students. While some studies have found that the poverty rate of the students served by a school does have a relationship to the presence of crime and violence (Verdugo and Schneider 1999), others have found no relationship at all between measures of student poverty and crime and violence at school (Heaviside et al. 1998;Crosse et al. 2002). The 2000 SSOCS did not collect information on the socioeconomic status of individual students. However, one commonly used measure of the school population that provides some information about socioeconomic status is the percent of students eligible to receive free or reduced-price school lunch. The free or reduced-price school lunch program is a component of the National School Lunch Program designed to provide students whose family income is near or below poverty level with nourishing meals. Therefore, the percent of students in a school that are eligible to receive free or reduced-price school lunch can serve as a measure of low income. 'Violent incidents include rape, sexual battery other than rape, physical attack or fight with or without a weapon, threat of physical attack with or without a weapon, and robbery with or without a weapon. 'Serious violent incidents include rape, sexual battery other than rape, physical attack or fight with a weapon, threat of physical attack with a weapon, and robbery with or without a weapon. 'Some schools are omitted from these categories because of missing data. "}, {"section_title": "School Administrative Practices", "text": "During the 1999-2000 school year, schools in which students have a larger number of classroom changes in a typical school day were more likely to experience at least one violent or serious violent incident.\nOne approach to preventing or reducing violence in schools is to structure the way the school manages its student population. Many schools have a large student body, which provides an opportunity for a large number of students to be together in the same area. In these school settings, students are both \"potential offenders and potential victims\" (Garofalo, Siegel, andlaub 1987). Given the need to control the behaviors of a large number of students, certain factors can increase the ability of adults to supervise students, or reduce the amount of unsupervised interaction among students. In order to gather information on some of the school administrative practices that could have a relationship to school violence, principals were asked in the 2000 SSOCS about the number of students and teachers in the schools, the number of classroom changes in a typical school day, and the presence of law enforcement or other security personnel during the 1999-2000 school year."}, {"section_title": "School Disorder", "text": "Schools in which a greater number of serious discipline problems (3 or more problems) occurred were more likely to experience a violent or serious violent incident than schools with fewer discipline problems (0 to 2 problems). Schools that reported at least one disruption (such as a bomb or anthrax threat) were more likely to experience a violent or serious violent incident than those that did not have any disruptions during the 1999-2000 school year. iv Violence in U.S. Public Schools: 2000 School Survey on Crime and Safety 6 Relationship Between School Characteristics and Violence and Serious Violence I While controlling for other factors, six school characteristics were related to the prevalence of violent incidents in public schools during the 1999-2000 school year, including school level, urbanicity, academic importance, number of classroom changes, number of serious discipline problems, and number of schoolwide disruptions. ) Five school characteristics were related to the likelihood that a school would experience at least one serious violent incident, while controlling for all other factors: enrollment size, urbanicity, percentage of males, number of serious discipline problems, and number of schoolwide disruptions.\nResearch has shown that some measures of school disorder can be predictive of more serious forms of certain delinquent behaviors (National Institute of 29  (Gottfredson and Gottfredson 1985). While school disorder has been used to refer to a variety of behaviors, the SSOCS 2000 asked principals to provide information regarding various types of serious discipline problems, the number of transfers to and from the school, the number of disruptions that the school experienced, and a measure of student absenteeism. Violent crimes make up only a portion of the disruptive and harmful activities that occur in schools and affect the school's environment. According to teachers, student misconduct such as 'Cursing, grabbing, pushing, verbal threats and intimidations\" are more common problems than acts of violence in schools (Furlong et al. 1994;Petersen et al. 1998). Because the less severe discipline problems have a relationship to violence, it is important to analyze these measures to provide a full picture of the violent situation in schools."}, {"section_title": "Patterns of School Violence", "text": ") During the 1999-2000 school year, 7 percent of public schools accounted for 50 percent of the total violent incidents that were reported. Approximately 2 percent of schools accounted for 50 percent of the serious violent incidents. II When comparing the characteristics of those schools with a high number of incidents (those schools in which 50 percent of violent incidents occurred) to those schools with no incidents or a low-to-moderate number of incidents, school level, enrollment size, urbanicity, crime where students live, number of classroom changes, number of serious discipline problems, and number of schoolwide disruptions were related to the number of violent incidents. When compared to schools with either no incidents or a low-to-moderate number of incidents, schools with a high level of serious violent incidents differ by enrollment size, percent of students below the 15th percentile on standardized tests, student-to-teacher ratio, number of serious discipline problems, number of students transferring from the school, and number of schoolwide disruptions.  Percentage of public schools reporting at least one violent or serious violent incident, by percent of students below the 15 percentile on standardized tests: 1999-2000  Tables   Table A. Odds ratios of logistic regression results on the prevalence of violent and serious violent incidents, by selected school characteristics: 1999-2000 26 Table B. Percent and number of public schools, by percentage of violent incidents: 1999-2000 28  Table D. Odds ratios for various amounts of violent and serious violent incidents, by selected school characteristics: 1999-2000 32 Table E. Distribution of sample schools by response status and response rates by various school and district characteristics 1999-2000 39 Table F. Total enrollment as of October 1, by school characteristics: 1999-2000\nOne general pattern that has been universally recognized is that crime occurs in clusters (Sherman, Gartin andBuerger 1989, Farrell andSousa 2001). Whether it is by person, place, location or situational domain, certain characteristics have been associated with higher levels of violence and disorder. Crime and criminality is not a random occurrence. It becomes critical then, to learn where crime is likely to happen. As with the general literature on crime and violence, previous research has shown that a disproportionately small number of schools accounts for a large amount of the crime. In 1990, Burquest, Farrell, and Pease found that about 12 percent of schools accounted for more than a third of all school crime (Burquest, Farrell, and Pease 1992). In an earlier study, about a third of the schools accounted for over 75 percent of all burglaries reported to authorities (Hope 1982). An additional study found that about 8 percent of schools accounted for over half of all reported violent offenses (Lindstrom 1997). All of these studies restricted the sampled schools to individual cities, but they provide evidence that suggests crime and violence may cluster within certain schools. An analysis of the 1996-1997 Principal/School Disciplinarian Survey on School Violence provides some background suggesting that violence may cluster in specific American public schools. Cantor and Wright (2001) analyzed this national study, and found that 60 percent of the violent incidents occurred in only 4 percent of the public high schools. The researchers specified four levels of crime (no crime, isolated crime, moderate crime, and violent crime), and used these categories to identify certain characteristics that were associated with varying levels of crime in schools. Their analysis also found that enrollment size, percent minority, and urbanicity were associated with violence in public schools during the 1996-1997 school year."}, {"section_title": "41", "text": "List of Tables   Tables of Estimates   Table 1. Number and percentage of public schools with violent and other incident, by selected school characteristics: 1999-2000 Number and percentage of public schools with violent and other incidents reported to police, by selected school characteristics: 1999-2000 Table 3. Number and percentage of public schools with physical assaults, by selected school characteristics: 1999-2000 Table 4. Number and percentage of public schools with threats of physical attack and robbery by selected school characteristics: 1999-2000 61 Table 5. Number and percentage of public schools with theft and possession of weapons, by selected school characteristics: 1999-2000 Table 6. Number and percentage of public schools with other incidents, by selected school characteristics: 1999-2000 Tables of Standard Errors "}, {"section_title": "Introduction", "text": "The safety of American schools is a major concern to educators, parents, students, and policymakers. Schools officials are entrusted with the responsibility of keeping students and faculty safe from harm. They also are responsible for creating environments that are conducive to effective education. If students are to learn, and teachers are to teach, schools need to be free from the distractions, concerns, and apprehensions that are associated with crime and violence. National attention has focused on the issue of crime and violence in public schools as a result of highly publicized acts of extreme school violence. School officials and policymakers have difficulty knowing which media reports reflect problems that are nationwide, and which are relevant only to some schools. In order to better understand the magnitude and nature of the problems of disorder, crime, and violence in American schools, it is important to collect data that can inform educators and policymakers. Individual school officials also may want to know how they compare to national estimates in order to assess the level of their own problems. The federal government has collected data on crime and safety in American schools for the past several decades. In order to assess the number of schools affected by violence or crime, the Safe Schools Study was undertaken in the late 1970s. The study was based on a mail survey of over 4,000 schools and on-site visit surveys of 642 schools, as well as case studies of 10 of those schools. This large-scale study was the first of its kind to include participation from principals, teachers, and students. The Safe Schools Study represented a comprehensive effort to look at all of the populations in schools in one study. However, other studies exist for specific populations. The National Crime Victimization Survey (NCVS) is a household survey that serves as the nation's primary source of information on the victims of crime. The NCVS has been surveying households since 1972 about experiences with crime, and students have been among those interviewed. Therefore, NCVS provides a vehicle for estimating the percentage of the student population between the ages of 12 and 18 who experience victimization at school. The National Center for Education Statistics (NCES) sponsors the School Crime Supplement (SCS) to the National Crime Victimization Survey. The SCS was administered in 1989SCS was administered in , 1995SCS was administered in , 1999SCS was administered in , 2001SCS was administered in , and 2003 to students who responded to the NCVS. Students are asked questions regarding their experiences with victimization at schools, as well as preventive measures used by schools, participation in afterschool activities, students' perceptions of school rules, the presence of weapons and street gangs at school, the presence of haterelated words and graffiti, bullying, and drug availability. Another survey program that provides information about the experiences of students at school is the National School-Based Youth Risk Behavior Survey (YRBS). The YRBS has collected data from students at school in 1993, 1995, 1997, 1999, and 2001. The focus of the study is on priority health-risk behaviors established during youth that result in the most significant mortality, morbidity, disability, and social problems during both youth and athilthood. Some of these behaviors include the use of alcohol, tobacco, and illegal drugs, carrying weapons, physical fights, attempted suicide, and unsafe sexual behavior. In order to provide data from the perspective of the school, NCES collected several one-time surveys of school principals using the Fast Response Survey System (FRSS). In 1991, the FRSS Principal Survey on Safe, Disciplined, and Drug-Free Schools was administered to approximately 900 principals. This FRSS included information regarding student offenses, school policies, disciplinary actions, and other aspects of school safety. As a follow-up to the 1991 FRSS, a FRSS Principal/ School Disciplinarian Survey on School Violence was administered to 1,234 public elementary and secondary school principals during the 1996-97 school year. The 1996-97 FRSS included information regarding incidents of crime and violence, disciplinary actions, discipline problems, and school policies related to school crime. To continue the collection of information from schools, NCES conducted the School Survey on Crime and Safety (SSOCS) in the spring and summer of 2000. SSOCS was administered to public elementary, middle, secondary, and combined school principals in regular schools in the 50 states and the District of Columbia. The survey is a nationally representative cross-sectional survey of 2,270 principals of public schools that responded to the questionnaire. The 2000 SSOCS built on earlier surveys of school crime and safety conducted using the FRSS, and includes topics similar to those collected in other studies. SSOCS included sOme topics similar to those collected in the FRSS survey, such as incidents of crime and violence, disciplinary actions, discipline problems, and use of security measures. The 2000 SSOCS questionnaire expanded the coverage of the topics from the FRSS, and it included additional questions regarding school policies and practices, violence prevention programs and activities, and other school characteristics that could be associated with school crime and violence. As with the previous FRSS survey, SSOCS attempted to provide a general picture of school crime and safety in American public schools. Principals are the best respondents to address the conditions of schools as a whole. They are able to report on the presence of crime and violence, the amount of discipline that occurs, the presence of programs and policies designed to prevent or reduce crime and violence, the involvement of teachers and parents, as well as other school practices. It would be difficult for students, teachers, or parents to provide information about the conditions of the entire school that SSOCS asked of the principals. Although principals can provide a good picture of conditions in public schools, some limitations do exist regarding the information that they can provide. Principals can only provide the number of incidents that have been brought to their attention. When collecting estimates of crime from principals, it is possible that they will provide an undercount of the actual incidents of crime that may have occurred during the school year because some incidents may not have been reported to them. In addition, SSOCS may have asked for information that principals did not keep. If they did not systematically track the information from the beginning of the school year, it would be difficult to retrace that information at the end of the school year. SSOCS collected a wide variety of information from principals regarding school crime and safety issues; however, this report will focus on the violence that occurred in schools during 1999-2000. In order to provide a better context for examining the measures of violence gathered from principals, SSOCS also collected information about the characteristics of the 'public schools. Survey findings are presented by the following school and student characteristics: Enrollment size: less than 300 students, 300 to 499 students, 500 to 999 students, 1000 or more students I Urbanicity: city, urban fringe, town, Tural"}, {"section_title": "14", "text": "Crime level where students live: high, moderate, low, and mixed Characteristics of the student population Percent minority enrollment: 0 to 5 percent, 6 to 20 percent, 21 to 50 percent, more than 50 percent Percent of students eligible for the free and reducedprice lunch program: 0 to 20 percent, 21 to 50 percent, more than 50 percent Percent of students below the 15th percentile on standardized tests: 0 to 5 percent, 6 to 15 percent, more than 15 percent Percent of students likely to attend college after high school: up to 35 percent, 36 to 60 percent, more than 60 percent Percent of students who consider academics to be very important: up to 25 percent, 26 to 50 percent, 51 to 75 percent, more than 75 percent 1 Percent male enrollment: up to 44 percent, 45 to 55 percent, more than 55 percent"}, {"section_title": "School administrative practices", "text": "Student-to-teacher ratio: Less than 12:1, 12:1 to 16:1, More than 16:1 I Number of classroom changes: 0 to 3 changes, 4 to 6 changes, more than 6 changes I Use of paid law enforcement: regular use of law enforcement, no regular use of law enforcement School disorder I Number of serious discipline problems: no problems, 1 problem, 2 problems, 3 or more problems 1 Transfers as a percentage of enrollment: up to 5 percent, 6 to 10 percent, 11 to 20 percent, more than 20 percent 15 I Prevalence of schoolwide disruptions: no disruptions, any disruptions I Percent of students absent without excuses: none, 1 to 2 percent, 3 to 5 percent, 6 to 10 percent, more than 10 percent The analysis included in this report examines the relationship between the characteristics of the schools described above and types of violence that occurred during the 1999-2000 school year. While this analysis will show that a majority of the incidents occur in relatively few schools, it is important to examine all of the schools that have experienced any violence during the school year. This analysis allows for comparison of the characteristics of those schools that have experienced any type of violence with those that have not had violence occur during the school year The Incidents of Violence in Public Schools section of the report describes the relationship between individual school characteristics and those schools that experienced at least one of the violent incidents, as well as schools that experienced a subset of those incidents that constitute more serious measures of violence. An additional analysis of these measures of the prevalence of violence and serious violence is included in the"}, {"section_title": "Relationship between School Characteristics and Violence", "text": "and Serious Violence section. Because the various characteristics of schools may be related to one another, this section uses analysis that allows for the relationship between the prevalence of both violent and serious violent incidents and the school characteristics to be examined in concert. Finally, a further analysis of the incidents of both violence and serious violence is included in the Patterns of School Violence section. This section includes a more detailed look at those schools that account for the majority of violent and serious violent incidents. The total number of incidents is examined to isolate those schools that are experiencing the most violence and serious violence, and identify the characteristics of those schools."}, {"section_title": "Measuring Incidents of Crime and Violence", "text": "Public school principals were presented with a list of crimes and asked to report the total number of incidents of each crime for the 1999-2000 school year. Principals were instructed to report on the number of incidents of each type of crime regardless of the number of offenders or victims involved in each event. The number of incidents of the following crimes was collected: rape, sexual battery other than rape, physical attack or fight with and without weapons, threat of physical attack with or without weapons, robbery with or without weapons, theft, possession of firearms or explosive devices, possession of knives or sharp objects, distribution of illegal drugs, possession or use of alcohol or illegal drugs, sexual harassment, and vandalism. Definitions were provided for some of these crimes and can be found in the glossary. Additional information collected about the incidents was the number of these incidents that were reported to the police or other law enforcement, the number that were hate crimes, and the number that were gang-related.' The principals were provided with instructions that clarified what types of incidents should be included in each section. They were instructed to include incidents regardless of whether the people involved were students, and whether they occurred during school or after school hours. The location of the incidents was restricted to include only those that occurred in the school building, 'Because of the small size of the estimates for those incidents that were hate crimes or gang-related, these estimates will not be included in this report. For more information about the data available in SSOCS, see 2000 School Survey on Crime and Safety: Detailed Data Documentation. on the school grounds, on the school bus, or at places that were holding school-sponsored events or activities. If an incident contained more than one crime, the principal was asked to count only the most serious offense. The example provided in the survey was that if an incident included rape and robbery, the incident should be counted only as a rape. The final instruction to principals was to omit any incidents that occurred during the school year, but did not fit within the specific categories of crimes that were provided. Each crime type (e.g., rape, sexual battery other than rape, robbery) provides an important picture of what is occurring in the nation's schools. In order to allow for comparisons among all of these types of incidents, the estimates have been combined into four groups. These groups are violent incidents, serious violent incidents, theft incidents, and other incidents, and are shown in tables 1 and 2. The estimates for specific crime types can be found in tables 3, 4, 5, and 6. The measure of violent incidents was created to provide an overall estimate of any type of violence that may occur in schools. Violent incidents include rape, sexual battery other than rape, physical attacks or fights with and without a weapon, threats of physical attack with and without a weapon, and robberies with and without a weapon. The measure of serious violent incidents looks at the subset of violent incidents that are traditionally considered to be the most severe forms of violence. Serious violent incidents in SSOCS only include rape, sexual battery other than rape, physical attacks or fights with a weapon, threats of physical attack with a weapon, and robberies either with or without a weapon. Incidents that could be characterized as simple assaults, such as physical attacks or fights or threats of physical attacks without weapons, are included in violent incidents, but are excluded from the measure of serious violent incidents. For example, routine physical fights between students that occur in many schools are included in violent incidents, but are excluded from serious violent incidents. The serious violence measure allows a look at how many of the nation's public schools experienced the most severe type of violence during the 1999-2000 school year."}, {"section_title": "School Demographic Characteristics", "text": "The prevalence of violence that occurs at school can be related to the school characteristics. In SSOCS, principals were asked to report information pertaining to the demographic characteristics of their schools, including the school level, enrollment size, location of the school, and level of crime in the students' neighborhoods. In past research, secondary schools have been more likely to experience crime and violence than elementary schools (National Institute of Education 1978;Heaviside et al. 1998). For some types of violence, such as fighting, studies have found middle schools more likely to experience these incidents than high schools (Crosse et al. 2001;Banks 1997). However, high schools report a higher prevalence of violent incidents, in general, than either middle or elementary schools (Heaviside et al. 1998). Results from SSOCS found that during the 1999-2000 school year, the prevalence of violent incidents varied by the school level. Secondary schools were more likely than elementary, middle, and combined schools to have experienced a violent incident during the 1999-2000 school year (92 percent for secondary schools vs.   61 percent for elementary schools, 87 percent for middle  schools, and 77 percent for combined schools (figure 1  and table 1). As with violent incidents, secondary schools were more likely than elementary or combined schools to have experienced at least one serious violent incident during the 1999-2000 school year (14 percent for elementary schools vs. 29 percent for middle schools and 29 percent for secondary schools (figure 1 and table 1). However, there was no difference found between secondary schools and middle schools in the prevalence of serious violent incidents. Some research suggests that a larger number of students contributes to the problem of violence in schools (Gottfredson 2001). One reason for this is that with more students interacting with one another, the opportunity for crime or violence is increased. In fact, studies have found that schools with more students report more  'Violent incidents include rape, sexual battery other than rape, physical attack or fight with or without a weapon, threat of physical attack with or without a weapon, and robbery with or without a weapon. 2Serious violent incidents include rape, sexual battery other than rape, physical attack or fight with a weapon, threat of physical attack with a weapon, and robbery with or without a weapon. BEST COPY AVAILABLE 1 crime and violence than schools with fewer students (Gottfredson and Gottfredson 1985;Heaviside et al. 1998; Cantor and Wright 2001). An additional connection between school size and violence is suggested by Verdugo and Schneider (1999), who found that the greater the school size, the less likely the school is to utilize certain successful components of school safety programs. Specifically, teachers in larger schools were less likely than teachers in smaller schools to feel that the principal enforces school rules for student conduct and tends to support teachers, and rules for student behavior are consistently enforced by teachers. SSOCS found that in the 1999-2000 school year, the size of a schooFs student enrollment was related to exposure to violent incidents. Smaller schools were less likely to experience violent incidents than larger schools (figure 2 and table 1). For example, 61 percent of schools with less than 300 students had a violent incident, while 89 percent of schools with 1,000 or more students experienced such an incident. The relationship between the number of students enrolled in schools and the prevalence of serious violence is similar to that of violence. Those schools with larger student enrollments were more likely to experience a serious violent incident than schools with smaller enrollments (figure 2 and table 1). In 1999-2000, 10 percent of schools with the fewest students, less than 300 enrolled, reported a serious violent crime, while 36 percent of schools with the highest number of students, 1,000 or more, reported a serious violent incident. The community surrounding a school may have an effect on the crime experienced in that school. Previous research suggests that the level of crime in schools reflects that of the community in which the school is located (National Institute of Education 1978;McDermott 1983;Gottfredson and Gottfredson 1985). For example, schools that are located in cities, which have traditionally experienced more crime, have exhibited higher rates of crime than those located in other neighborhoods (Heaviside et. al. 1998;Verdugo and Schneider 1999;Cantor and Wright 2001).  'Violent incidents include rape, sexual battery other than rape, physical attack or fight with or without a weapon, threat of physical attack with or without a weapon, and robbery with or without a weapon. The 2000 SSOCS also found a relationship between the location of the school and the likelihood that a school would experience one or more violent incidents. City schools (77 percent) were more likely than urban fringe schools (67 percent) to report at least one violent incident during the 1999-2000 school year, while no differences were detected among other locations (figure   3 and table 1). The relationship between the location of schools and the prevalence of serious violent incidents is different than that reported for the prevalence of violent incidents. Rural schools (12 percent) were less likely than schools in cities (27 percent), urban fringe (22 percent), or towns (20 percent) to experience at least one serious violent incident (figure 3 and table 1). However, no such differences were detected when comparing city, urban fringe or town locations. Researchers have found that students' attitudes towards violence and aggressive behavior in school can be influenced by the neighborhoods in which they live (Gottfredson 2001;Menacker and Weldon 1990). Therefore, it is important to observe the relationship between the crime level in the neighborhoods where students live and violence in the schools they attend. During the 1999-2000 school year, principals were asked to describe the crime level in the neighborhoods where their students lived. They were instructed to choose whether the students lived in neighborhoods with a high level of crime, moderate level of crime, or low level of crime. Principals were also provided an option for mixed level of crime, meaning that students in their school represented diverse types of neighborhoods. Those principals who reported that their students lived in neighborhoods with high crime or mixed levels of crime were more likely to experience a violent incident in their schools than those principals with students who lived in neighborhoods with low levels of crime (84 percent of high levels of crime and 79 percent of mixed levels of crime vs. 68 percent oflow levels of crime, respectively) (figure 4 and table 1). Urban Town fringe Rural 'Violent incidents include rape, sexual battery other than rape, physical attack or fight with or without a weapon, threat of physical attack with or without a weapon, and robbery with or without a weapon. 'Serious violent incidents include rape, sexual battery other than rape, physical attack or fight with a weapon, threat of physical attack with a weapon, and robbery with or without a weapon. SOURCE: U.S. Department of Education, National Center for Education Statistics, School Survey on Crime and Safety (SSOCS), 2000."}, {"section_title": "BEST COPY AVAILABLE", "text": "\nIn SSOCS, principals were asked about discipline problems that occur in schools. These problems included student racial tensions, student bullying, student verbal abuse of teachers, widespread disorder in classrooms, student acts of disrespect for teachers, undesirable gang activities, and undesirable cult or extremist group activities. Principals were instructed to respond if each of these problems happened daily, at least once a week, at least once a month, on occasion, or not at all. If a principal reported that undesirable gang activities, or undesirable cult or extremist group activities happened at all, or any of the other problems occurred at least once a week, the discipline problem was considered serious. The number of serious discipline problems in schools was counted for the 1999-2000 school year. Schools in which more serious discipline problems occurred were more likely than schools with fewer serious problems to report any violent incidents (figure 14 and table 1). Schools that reported a larger number of serious discipline problems were also more likely to experience serious violence than those with a smaller number of these problems. In general, as the number of serious discipline problems increased, so did the likelihood of experiencing a serious violent incident at school (figure 14 and table 1). Another measure of school disorder collected in SSOCS relates to the level of stability in the student population. In any given school year, some students transfer into the school while other students transfer out. Ideally, the more stable the student population remains throughout the school year, the more opportunity faculty and staff have to get to know the students. Additionally, while some students with discipline problems may be transferred out of the school, other students may be transferred in after the beginning of the school year, which may leave them at a disadvantage academically and socially. In 1999-2000, principals were asked to report the number of students who were transferred to and from the school after the start of the school year. They were instructed to include any students who were transferred, not just those who had been moved as a result of disciplinary actions. The number of students who had either been transferred out of or into the school was added together, and the total enrollment was used to create a percentage of the school's student enrollment that was transferred. A relationship between the mobility of the student population and the prevalence of violence existed during the 1999-2000 school year. Schools with the smallest percentage of students transferred after the beginning of the school year were less likely than those with the highest percentage to experience at least one violent incident (66 percent vs. 76 percent) (figure 15 and table 1). A relationship between the prevalence of serious violent incidents at school and the percent of the student population that had been transferred during the school year did not exist during the 1999-2000 school year. No differences were detected between the prevalence of serious violent incidents and the percentage of students who were transferred after the beginning of the school year (figure 15 and table 1). Another aspect of a school's level of disorder is the amount of times disruptive activities take students away from academics. In addition to the loss of class time, schoolwide disruptions are a form of disorder that affects the entire school population. Schools were asked to provide the number of times that school activities were disrupted by actions such as bomb or anthrax threats. They were also instructed to exclude all fire alarms from their responses. Although fire alarms may be disruptive to the school day, actions such as bomb or anthrax attacks represent a more severe threat to the school population. The school also may respond to threats of this type with a different set of procedures than would be used in a fire alarm. During the 1999-2000 school year, there was a difference between the schools that experienced disruptions and Transfers as a percentage of en rollment3 'Violent incidents include rape, sexual battery other than rape, physical attack or fight with or without a weapon, threat of physical attack with or without a weapon, and robbery with or without a weapon. 'Serious violent incidents include rape, sexual battery other than rape, physical attack or fight with a weapon, threat of physical attack with a weapon, and robbery with or without a weapon. 'Transfers as a percentage of enrollment combines the number of students who were transferred to a school and the number of students who were transferred from a school, divided by the total number of students enrolled in the school. to report on the percent of students who were absent without excuse on an average school day. In general, those schools with a higher percentage of students absent without excuse were more likely than those with a lower percentage to have reported any violent incidents during the 1999-2000 school year (figure 17 and table 1). For example, 55 percent of schools in which no students were absent without excuse experienced a violent incident compared with 78 percent of schools with more than 10 percent of students absent. The relationship between absenteeism and serious violent incidents at school has a similar pattern as observed with violent incidents. In general, as the percent of students who are absent without excuse on an average school day increased, so did the likelihood of schools experiencing a serious violent incident (figure 17 and table 1). 'Violent incidents include rape, sexual battery other than rape, physical attack or fight with or without a weapon, threat of physical attack with or without a weapon, and robbery with or without a weapon. 2Serious violent incidents include rape, sexual battery other than rape, physical attack or fight with a weapon, threat of physical attack with a weapon, and robbery with or without a weapon.  6 to 10 More than percent percent percent 10 percent Percent of students absent without excuse 'Violent incidents include rape, sexual battery other than rape, physical attack or fight with or without a weapon, threat of physical attack with or without a weapon, and robbery with or without a weapon. 'Serious violent incidents include rape, sexual battery other than rape, physical attack or fight with a weapon, threat of physical attack with a weapon, and robbery with or without a weapon. \nnumber of serious discipline problems, and number of schoolwide disruptions. While school level, crime level where students live, percent minority enrollment, percent of students eligible to receive free or reducedprice lunch, percent of students below the 15th percentile on standardized tests, percent of students likely to attend college, percent of students who consider academic achievement to be very important, student-to-teacher ratio, number of classroom changes made in a typical school day, use of paid law enforcement, transfers to and from school, and percent of students absent without excuse were related to the prevalence of serious violence when examined individually, no such differences were detected when the other factors were controlled. Some of the school demographic characteristics remain related to the prevalence of serious violent incidents. For example, enrollment size was positively related to the occurrence of at least one serious violent incident. Also, the prevalence of serious violence was related to school urbanicity after controlling for other factors. Compared to city schools, rural schools were less likely to experience at least one serious violent incident during the 1999-2000 school year. Consistent with previous findings, no differences were detected between the likelihood of schools in cities, urban fringe and towns experiencing one or more serious violent incidents. The only characteristic of the student population that remained related to the prevalence of serious violence while controlling for other factors was the percent of male students in the school population. As the percent of male students increased, so did the likelihood of experiencing a serious violent incident. Finally, two characteristics of school disorder were correlated with serious violence incidents. In 1999-2000, both the number of schoolwide disruptions and serious discipline problems at school were positively related to the prevalence of serious violence at school when adjusting for other characteristics. Therefore, as either the number of schoolwide disruptions or serious discipline problems increased, so did the odds of experiencing at least one serious violent incident. 'Violent incidents include rape, sexual battery other than rape, physical attack or fight with or without a weapon, threat of physical attack with or without a weapon, and robbery with or without a weapon."}, {"section_title": "0", "text": "Principals who reported that their students lived in low crime neighborhoods were less likely to have indicated at least one serious violent incident in their schools than those with students living in neighborhoods with higher levels of crime. Specifically, 16 percent of schools with students who lived in low crime neighborhoods experienced a serious violent crime compared to 38 percent of schools with students in high crime neighborhoods, and 25 percent of schools with students in either moderate crime neighborhoods or mixed crime neighborhoods (figure 4 and table 1)."}, {"section_title": "22", "text": "BEST COPY AVAILABLE During the 1999-2000 school year, no differences were detected between schools with different percentages of the school population that received free and reducedprice school lunch and whether any violent incident occurred at the school (figure 6 and table 1). The relationship observed between the percent of students who were eligible to receive free or reducedprice lunch and the prevalence of violence is different from that for the prevalence of serious violence. Schools with the highest percentage of students eligible for free or reduced-price lunch were more likely to experience one or more serious violent incidents than those with smaller percentages of students eligible for the program (figure 6 and table 1). For example, schools with more than 50 percent of the population eligible to receive free or reduced-price lunch were more likely to experience a serious violent incident than schools with between 0 and 20 percent and 21 to 50 percent of students eligible for free and reduced-price lunch (24percent vs. 16 percent and 18 percent, respectively). The relationship between academic performance and violence in schools is of particular concern to educators. Research has found a relationship between poor academic performance and delinquent behavior (Maguin and Loeber 1995). It has been suggested that poor academic achievement or lack of academic engagement leads to frustration that may result in delinquent behavior (Verdugo and Schneider 1999). A similar argument is that those students who are more successful academically have a greater investment in adhering to the school rules (Hawkins et al. 1998). An additional argument is that those students who are engaging in violence or fearful of the violence around them are not able to concentrate on academics, or may leave school altogether (Fleming et al. 2000).  In the 1999-2000 school year, principals were asked to provide information aimed at gauging the academic achievement of the student population. Specifically, they were asked for the percentage of students who were below the 15th percentile on standardized tests, were likely to go to college after high school, and considered academic achievement to be very important. The first measure of academic performance collected from principals in SSOCS was the percentage of the students who scored below the 15th percentile on standardized tests. This measure was positively related to the prevalence of violence in public schools during the 1999-2000 school year. Those schools in which principals reported that more of the student population was below the 15th percentile on standardized tests (6 to 15 percent of students below the 15th percentile and more than 15 percent of students below the 15th percentile-73 percent and 77 percent, respectively) were more likely to report experiencing at least one violent incident than schools with a smaller percentage of students below the 15th percentile (0 to 5 percent of students below the 15th percentile-64 percent) ( figure   7 and table 1). The association between the percent of students below the 15th percentile on standardized tests and the prevalence of serious violent incidents was the same as that exhibited in the relationship with violent incidents. The larger the percentage of students who principals report are below the 15th percentile on standardized tests, the more likely the school was to experience at least one serious violent incident (27 percent vs. 19 percent vs. 14 percent) (figure 7 and table 1). A second measure of the level of academic achievement in schools was the percent of students who were likely to attend college. An inverse relationship existed between the percent of students that principals felt were likely to attend college and the prevalence of violent incidents at  "}, {"section_title": "4", "text": "BEST COPY AVAILABLE school. Those schools that reported a lower percentage of students were likely to attend college were more likely to have experienced at least one violent incident during the 1999-2000 school year than those with a higher percentage of students likely to go to college. For example, schools with the smallest percentage of students likely to go to college (up to 35 percent of students) were more likely than those with the highest percentage (more than 60 percent of students) to experience a violent incident at school (77 percent and 66 percent, respectively) (figure 8 and table 1). As with violent incidents, those schools with the largest percentage of students likely to attend college were less likely than those with the smallest percentage to have experienced a serious violent incident during the 1999-2000 school year (figure 8 and table 1). While 17 percent of schools with more than 60 percent of students likely to attend college reported a serious violent incident, 23 percent of schools with 0 to 35 percent of students likely to go to college experienced such an incident. The final measure concerning academics was the percentage of the student population that considered academics to be very important according to principals. In the 1999-2000 school year, as the percent of students who considered academics to be important increased, the prevalence of experiencing any violent incident decreased (figure 9 and table 1). The relationship between the perceived importance of academics to students and the prevalence of serious violence is similar to that observed with the prevalence of violence. In general, as the percent of students who  Percent of students likely to attend college 'Violent incidents include rape, sexual battery other than rape, physical attack or fight with or without a weapon, threat of physical attack with or without a weapon, and robbery with or without a weapon. consider academics important increased, the prevalence of serious violent incidents decreased (figure 9 and table 1). The final student characteristic reported by school principals is the percentage of the population that is male. Previous studies have found that male students are more likely to be offenders than female students, and are also more likely to be victimized at school than female students (Farrington 1993;Daly 1994;. Therefore, schools with a higher proportion of male students may be expected to have a higher prevalence of violence. In the 2000 SSOCS, the relationship between the percentage of males in the student population and the prevalence of violence is not consistent with previous literature. Schools with a relatively equal percentage of male and female students, 45 to 55 percent (73 percent), were more likely to experience at least one violent incident than schools where more than 55 percent of the population was male (63 percent) ( figure 10 and table 1). The percent of male students enrolled in schools and the prevalence of serious violence also were related. Schools with up to 44percent of the population male (15 percent) were less likely to experience at least one serious violent incident compared to those schools with 44 to 55 percent male students (21 percent) who experienced a serious violent incident at school (figure 10 and table 1).2 While other differences appear to exist, these differences are associated with the standard errors and are not statistically significant.  "}, {"section_title": "7", "text": "Previous research suggests that teachers who are assigned fewer students in their classrooms may have an easier time establishing discipline than those who are assigned a larger number of students (Betts and Shkolnik 1999;Rice 1999). In the 2000 SSOCS, principals provided information on the number of students, and full-and part-time teachers in each school. These figures were used to establish a student-to-teacher ratio. The studentto-teacher ratio does not necessarily equal the number of students per classroom, but it does provide a measure of the ratio of students to teachers in the entire school. In 1999-2000, schools with a low student-to-teacher ratio were less likely to experience a violent incident than schools with a high student-to-teacher ratio. Specifically, 68 percent of schools with a student-to-teacher ratio less than 12:1 reported a violent incident compared to 78 percent of schools with a student-to-teacher ratio of more than 16:1 (figure 11 and table 1). The ratio of students to teachers also was associated with the prevalence of serious violence in schools. Schools with the largest ratio of students to teachers were more likely to experience at least one serious violent incident (25 percent) than those with the smallest student-toteacher ratio (16 percent) (figure 11 and table 1). When students change from one class to the next during the school day, they have the opportunity to mix with other students with less adult supervision than they have during the class period. In the 2000 SSOCS, principals were asked to report the number of classroom changes that students make in a typical school day. They were instructed to exclude morning arrivals and afternoon departures, and count each time students go from one location to another as one classroom change. During 1999-2000, as the number of classroom changes increased, so did the likelihood of experiencing at least one violent incident (figure 12 and table 1). For example, 58 percent of school with 3 or fewer classroom changes in a typical school day experienced one or more violent incidents, compared to 82 percent of schools with more than 6 classroom changes. Similarly, a positive relationship also existed between the likelihood of experiencing a serious violent incident at school and the number of classroom changes in a typical school day. Schools that employed fewer classroom changes (0 to 3 changes) were less likely than schools that had either 4 to 6 or more than 6 classroom changes to have experienced a serious violent incident during the 1999-2000 school year (14 percent vs. 21 and 24 percent, respectively) (figure 12 and table 1). 'Violent incidents include rape, sexual battery other than rape, physical attack or fight with or without a weapon, threat of physical attack with or without a weapon, and robbery with or without a weapon. 'Serious violent incidents include rape, sexual battery other than rape, physical attack or fight with a weapon, threat of physical attack with a weapon, and robbery with or without a weapon. 'Student/teacher ratio was calculated by dividing the total number of students enrolled in the school by the total number of full-time equivalent teachers. The total number of full-time equivalent teachers is a combination of the full-time and part-time teachers, including special education teachers, with an adjustment to compensate for the part-time status of those teachers. In order to reduce the threat of violence and increase the supervision of students, some schools incorporate the use of law enforcement officers or security personnel. The presence of law enforcement or security is intended to deter potential violence as well as aid principals in discipline after violent behavior occurs (Marans and Shaefer 1998). While some schools may utilize police assistance only when needed, other schools employ police officers or other security to work full time in the school building. Principals were asked about the use of paid law enforcement or security services in their schools in the 2000 SSOCS. Those principals who responded that they used paid law enforcement or security services at any time during schools hours, while students were arriving or leaving, at selected school activities, or at other specified times were considered to regularly use law enforcement. Schools that indicated that they used paid law enforcement only when school or school activities were not occurring were considered to have no regular use of law enforcement for the purposes of analysis. The regular use of law enforcement or security services did have a relationship to the prevalence of violence at school. In 1999-2000, schools that regularly used paid law enforcement or security were less likely to experience a violent incident those that did not regularly use such personnel (62 percent vs. 80 percent) (figure 13 and table 1). Additionally, those schools that used regular law enforcement or security personnel were less likely to experience a serious violent incident than those who did not have such personnel (13 percent vs. 26 percent) (figure 13 and table 1)."}, {"section_title": "Relationship between School Characteristics and Violence and Serious Violence", "text": "Having discovered a number of school characteristics related to the presence of violence and serious violence in public schools, it is important to examine whether these associations remain when all of these factors are considered at once. Many of the school characteristics may be correlated with one another. For example, school level and the number of classroom changes may be related to one another, since elementary schools are more likely to employ fewer classroom changes because of the way in which their school day is organized. If this is the case, it is difficult to know whether a positive relationship between the number of classroom changes and violence is due to the number of classroom changes or due to the fact that the schools that incidentally have more classroom changes (high schools) BEST COPY AVAILABLE experience more violence. In order to examine the relationship of the different factors previously discussed with violence and serious violence in schools, multivariate analysis was conducted using logistic regression for both the prevalence of violence and serious violence. The use of logistic regression allows for the simultaneous analysis of all of the factors in relation to violence and serious violence. The logistic regression technique was used to examine the relationship of school demographic characteristics, characteristics of the student population, school organization and management, and school disorder to the presence of violent and serious violent incidents during the 1999-2000 school year. In the logistic regression equations, some of the school characteristics were modified from the previous analysis.' The discussion will include only those factors that provided a significant contribution to the equations!' The results for the logistic regressions are presented as odds ratios, which can be used to estimate the change in the relative odds of violence or serious violence in schools with certain school characteristics. The odds ratio for an independent variable tells the relative amount by which the odds of the outcome increase or decrease when the value of the independent variable is increased by 1.0 unit. For categorical independent variables, one category is omitted from the equation and serves as the reference category against which the other categories are judged. An odds ratio greater than one indicates a greater likelihood of schools with a certain characteristic having violence or serious violence than schools with the omitted characteristic, a ratio equal to one indicates no greater or lesser likelihood, and a ratio less than one indicates a lower likelihood of schools with the characteristic having violence or serious violence than those with the omitted characteristic. An odds ratio can also be expressed as a percentage increase or decrease in the likelihood of experiencing the dependent variable. school level, urbanicity, percent of students who 3 Unlike the previous section of this report, logistic regression utilizes the continuous variables for the school characteristics where possible. This includes enrollment size, percent minority enrollment, percent free/reduced-price lunch, percent of students scoring below the 15th percentile, student/teacher ratio, number of classroom changes, percent male enrollment, percent of students likely to attend college, percent of students likely to consider academic achievement important, number of serious discipline problems, number of schoolwide disruptions, number of transfers to school during the school year, number of transfers from school during the school year, and percent of students absent without excuses."}, {"section_title": "Prevalence ofViolence in Schools", "text": "The logistic regression results in this report are presented as odds ratios. See the Multivariate Analysis section of this report for details on odds ratios and how to interpret them. consider academics to be very important, number of classroom changes made in a typical school day, number of serious discipline problems, and number of schoolwide disruptions. The school enrollment size, crime level where students lived, percent of students who were below the 15th percentile on standardized tests, percent of student likely to attend college, percent male enrollment, student-to-teacher ratio, use of paid law enforcement, transfers to and from school, and percent of students absent without excuse were related to the prevalence of violence at school when examined individually. However, these characteristics did not prove to be significant when examined simultaneously in the regression equation. As the analysis in the previous section showed, a number of the school demographic characteristics were related to the prevalence of violence at school during the 1999-2000 school year. A smaller number of these school demographic characteristics continued to be related to the prevalence of violence when controlling for other characteristics. The level of the public school remains associated with the prevalence of violent incidents. Middle schools and secondary schools were more likely to experience violence than elementary schools after adjusting for other factors (table A). While combined schools appeared to be more likely than elementary schools to experience any violent incidents in the previous analysis, no such differences were detected when accounting for the other characteristics. Results also show the same relationship between the school's location and the prevalence of violence as previously observed. Compared to city schools, schools located on the urban fringe were less likely to experience at least one violent incident at school during the 1999-2000 school year, while no differences were detected between city schools and schools located in rural areas or towns. While a number of the characteristics of the student population were associated with the prevalence of violence when viewed individually, only the importance of academic achievement continued to be related to experiencing violence after adjusting for other factors. The percent of students who considered academic achievement important was negatively related to the prevalence of violent incidents at school. Specifically, an increase in the percentage of students who consider academic achievement to be important decreased the likelihood of experiencing at least one violent incident in 1999-2000. The school organization and management practice that remains associated with the prevalence of violence when controlling for other factors was the number of classroom changes a school made in a typical school day. As the number of daily classrooms changes increased, the odds of experiencing at least one violent incident during the 1999-2000 school year also increased. Finally, two characteristics of school disorder were associated with the prevalence of violence in 1999-2000 after controlling for other factors. Schoolwide disruptions and the number of serious discipline problems in the school remained positively related to the prevalence of violence at school. For every additional disruption a school experienced, the odds of at least one violent crime occurring increased. Also, as the number of serious discipline problems increased, so did the likelihood of experiencing at least one violent incident."}, {"section_title": "Prevalence of Serious Violence in Schools", "text": "Table A also shows the odds ratios for select school characteristics and the prevalence of serious violence in schools.' Of the characteristics that were previously related to serious violent incidents, only five school characteristics continued to be related to the likelihood that a school would experience at least one serious violent incident at school during the 1999-2000 school year after controlling for other factors. These characteristics were enrollment size, urbanicity, percent male enrollment, 'In order to address the concern of multicollinearity within the logistic regression equations, variance inflation factors and a correlation matrix were run for the variables. Al/ of the variables were within acceptable limits, with the exception of two variables. Transfers to and from schools were entered into the logistic regression equations as separate continuous variables, and showed marginal signs of multicollinearity. For more information regarding the analysis of multicollinearity, see the Multivariate Analysis section of this report."}, {"section_title": "36", "text": "'Serious violent incidents include rape, sexual battery other than rape, physical attack or fight with a weapon, threat of physical attack with a weapon, and robbery with or without a weapon. 'The comparison group is elementary schools. \"The comparison group is city schools.°T he comparison group is students who live in low crime neighborhoods.°S tudent/teacher ratio was calculated by dividing the total number of students enrolled in the school by the total number of full-time teachers. The total number of teachers is a combination of the full-time and part-time teachers, including special education teachers, with an adjustment to compensate for the part-time status of those teachers. 'Serious discipline problems is a count of discipline problems reported by principals. These discipline problems include student racial tensions, student bullying, student verbal abuse of teachers, widespread disorder in classrooms, and student acts of disrespect for teachers. If a principal reported that any of these problems occurred daily or weekly in their school, each was counted once in the total number of serious discipline problems. Undesirable gang activities, and undesirable cult or extremist group activities were also counted once as a problem if the principal reported that these events occurred at all in their school. "}, {"section_title": "Distribution of Violent and Serious Violent Incidents across Public Schools", "text": "The 2000 SSOCS provides an opportunity to analyze the distribution of the violent and serious violent incidents that were reported by public school principals for the 1999-2000 school year. In any sample of schools, one expectation is that a proportion of schools would account for the same proportion of incidents. That is, 25 percent of schools should account for 25 percent of the incidents. When the number of violent incidents reported by public school principals is displayed in figure   18, however, the curve shows that a small number of schools disproportionately account for a large number of incidents. Although 70 percent of all public schools reported at least one violent incident, approximately 7 percent of public schools accounted for 50 percent of the total violent incidents reported by schools during the 1999-2000 school year.' 6 Counts of some less serious offenses may not be included in the number of incidents reported. Principals were instructed to categorize an incident according to the most serious offense when the incident included multiple types of offenses. The example provided to principals in the survey was that if an incident included rape and robbery, include the incident only under rape. Additional offenses may have occurred during the 1999-2000 school year, but were not reported because they were part of a more serious incident.        Compared to schools with a low-to-moderate number of violent incidents, high incident schools were also more likely to be in towns, compared to cities. No 'The measurement of the independent variable needs to be taken into account before assessing the contribution of the various factors related to violent incidents. Of those variables that showed a relationship to violent incidents, school level, urbanicity, and crime level where students live are categorical variables. In comparison, enrollment size, number of serious discipline problems, number of students who transferred from the school, and number of schoolwide disruptions are continuous variables. Although the odds ratios shown in table D for continuous variables may appear smaller than those for the categorical variables, readers should use caution when making such comparisons because continuous variables are comprised of a relatively greater number of units than are categorical variables. A few of the school disorder characteristics were associated with the level of violence in public schools. These characteristics included the number of serious discipline problems, number of students transferred from school, and prevalence of a schoolwide disruption. Schools with a high level of violent incidents experienced more serious discipline problems than schools with less violence. When compared to schools with a low-tomoderate number of violent incidents, schools with a high level of violence had a larger number of students transfer from the school after the start of the school year. Further, high violence schools were more likely to have experienced a schoolwide disruption than schools with no violent incidents. When compared to schools with no serious violent incidents, schools with a high number of serious violent incidents were more likely to have a larger student enrollment. However, no such difference in enrollment size was detected when comparing schools with a high number of incidents to those with a low-to-moderate number of incidents."}, {"section_title": "BEST COPY AVALABLE", "text": ""}, {"section_title": "Levels of Serious Violent Incidents", "text": "A measure of the student population that was related to the level of serious violence in schools was the percent of students that the principals reported were below the 15th percentile on standardized tests. Compared to schools with either no incidents or a low-to-moderate number of incidents, schools with high levels of serious violence were more likely to have a larger percentage of the student body below the 15th percentile on standardized tests. The ratio of students to teachers also was related to the level of serious violence during the 1999-2000 school year. Compared to schools with no incidents or a low-tomoderate number of incidents, schools with a high number of serious violent incidents had a larger ratio of students to teachers in 1999-2000. Finally, several measures of the level of disorder at school were related to the amount of serious violence experienced during the 1999-2000 school year. Compared to schools with no incidents or a low-to-moderate number of incidents, schools with a high number of serious violent incidents had more serious discipline problems. They were also less likely to have students transferred out of the school during the school year when compared to those schools with no incidents Or a low-to-moderate number of incidents. Schools with high levels of serious violent incidents also experienced more schoolwide disruptions during the 1999-2000 school year when compared to those schools with no serious violent incidents. 'The reference category for both no incidents of violence and a low-to-moderate number of violent incidents is high level of violent incidents. The categories were created to represent the distribution of violent incidents, and were constructed as follows: No incidents= 0 incidents; Low-to-moderate number of incidents = 1 to 59 violent incidents; High number of violent incidents = 60 or more violent incidents. 'The reference category for both no incidents of serious violence and a low-to-moderate number of serious violent incidents is high level of serious violent incidents. The categories were created to represent the distribution of serious violent incidents, and were constructed as follows: No incidents= 0 incidents; Low-to-moderate number of incidents = ito 8 violent incidents; High number of violent incidents = 9 or more violent incidents. 'The comparison group is elementary schools. 'The comparison group is city schools. 'The comparison group is students who live in low crime neighborhoods. The school level and the location of the school were the school demographic characteristics that were related to the prevalence of violence after adjusting for all of the other characteristics of schools. Middle and secondary schools were more likely than elementary schools to have experienced a violent incident. Compared with city schools, urban fringe schools were more likely to have had at least one violent incident, while no differences were detected among other locations while controlling for other factors. The characteristic of the student population that was related to the prevalence of violence at school, while controlling for all other factors, was the percentage of students who considered academic achievement to be very important. This is consistent with the previous research that suggests that there is a connection between academic success and violence in schools (Maguin and Loeber 1995;Verdugo and Schneider 1999;Fleming et al. 2000). The number of classroom changes that a school used in a typical school day was the only factor of school Although violent incidents and serious violent incidents are constructed using some of the same offenses, the prevalence of serious violence focuses on the most severe and disruptive crimes collected in the 2000 SSOCS. While some of the factors related to the prevalence of violence were also related to the prevalence of serious violence, some of the factors are different. Unlike the prevalence of violent incidents, school level was not a significant predictor of serious violent incidents when controlling for all other factors. However, the enrollment size of the school was related to the prevalence of serious violence, but it was not related to the prevalence of violence. As the enrollment size of a school increased, so did the likelihood of experiencing a serious violent incident during the 1999-2000 school year. In terms of the location of a school, only urban fringe schools were less likely than city schools to experience a violent incident, while this relationship was not evident for serious violent incidents. Only rural schools were less likely than city schools to experience any serious violent incidents at school for the 1999-2000 school year. Although the importance of academic achievement to students was not related to serious violent incidents as it was to violent incidents, the percentage of male enrollment was predictive of the prevalence of serious 4 4 33 violence in schools. Consistent with research that shows that males are more likely to be both offenders and victims (Farrington 1993;Daly 1994;DeVoe et al. 2002), as the percentage of male students enrolled in schools increased, so did the likelihood of experiencing at least one serious violent incident. Unlike the prevalence of violence, none of the factors of school organization and management were related to the presence of serious violent incidents during the 1999-2000 school year. As with violent incidents, levels of school disorder were also related to the prevalence of serious violent incidents. During the 1999-2000 school year, none of the characteristics of the student population provided a significant contribution to the likelihood of reporting a high level of violence when compared to schools with lesser levels of violent incidents. As with the prevalence of violence in schools, the number of classroom changes employed during a typical school day was positively related to the schools with a high level of violent incidents. High violence schools had more classroom changes per day than schools with either no violence or a low-to-moderate number of violent incidents during the 1999-2000 school year. The measures of school disorder that were related to experiencing any violent incidents were also related to high levels of violent incidents. Schools with a high level of violent incidents experienced more serious discipline problems than schools with lesser levels of violence. Further, high violence schools were more likely than schools that did not experience any violence to have experienced a schoolwide disruption. Although some of the same measures that were predictive of high levels of violent incidents were also related to high levels of serious violent incidents, many were not the same. For example, none of the school demographic characteristics, with the exception of enrollment size, were related to schools with a high level of serious violence when compared to schools with no serious violence or a low-to-moderate level of serious violence. While none of the characteristics of the student population were related to varying levels of violent incidents, the percentage of students who were below the 15th percentile on standardized tests was related to high levels of serious violence. Finally, the same measures of school disorder that were predictive of the prevalence of violence and serious violence and schools with high levels of violence were also related to high levels of serious violent incidents in schools. Schools with a high level of serious violence had more serious discipline problems when compared to schools with no serious violence or a low-to-moderate level of serious violent incidents. When compared to schools with no serious violent incidents, high serious violent incident schools also experienced more schoolwide disruptions. In addition to these measures, schools with a high level of serious violent incidents were also more likely to have students transferred out of the school after the start of the school year than schools with no serious violent incidents or a low-to-moderate level of serious violence. This report allows an initial examination of the conditions of American public schools. Many schools experienced at least some violence during the 1999-2000 school year. The results reported here provide data with which school principals, school officials, teachers, policymakers, parents, and students can continue to explore the existence of violence in schools, and those measures that are associated with its presence. FRSS on teacher quality. The SASS frame was constructed in order to minimize the overlap with NAEP and ECLS-K that were in the field at the same time. For SSOCS, the minimization algorithm involved the derivation of a set of conditional selection probabilities that were used in selecting the sample. The sample was stratified by school level (elementary, middle, secondary, and combined), type of locale (city, urban fringe, town, and rural), enrollment size (under 300, 300-499, 500-999, and 1,000 or more), and minority status (less than 5 percent of the students were racial/ ethnic minorities or their minority status was unknown, Detailed Data Documentation. The sample was chosen to produce the following allocation of schools, assuming a response rate of 90 percent: 750 elementary schools, 1,000 middle schools, 1,000 secondary schools, and 250 combined schools. This allocation was chosen to permit a relatively detailed analysis of the three major levels (elementary, middle, secondary), while still being reasonably efficient for overall estimates. Within each of the four broad school level categories, the sample was allocated to substrata defined by type of locale, enrollment size, and minority status in rough proportion to the aggregate square root of the enrollment of schools in the stratum. The use of the square root of enrollment to determine the sample 4 7 allocation is considered reasonably efficient for estimating both school-level characteristics (e.g., the number or percent of schools that reported a certain type of crime) and quantitative measures correlated with enrollment (e.g., the number of incidents or the number of students in schools that reported a certain type of crime A total of 52 schools in the sample were determined to be ineligible, primarily by being alternative rather than \"regular\" schools. Returned questionnaires were reviewed for completeness, and data retrieval was attempted on key items and school characteristics. At the end of the data collection period, 111 questionnaires were excluded because they had a substantial amount of missing data. Some additional questionnaires were received after the end of data collection, and were complete enough to be included in the final data file. A total of 2,270 schools completed the survey. Thus, the final unweighted response rate was 68.5 percent (2,270 schools divided by the 3,314 eligible schools in the sample). The weighted response rate was 70.0 percent. Item response rates ranged from 33.0 percent to 100.0 percent, but typically were quite high (generally above 85 percent). Items with a response rate lower than 85 percent appear only on the restricted use data file, and were excluded from this analysis. A total of 123 items were designated as key items. These were items in questions 2, 3, 9a, 10, 14, 15, 16 (columns 2-4), 19, 21, 21 (columns 1-3 for all, and columns 4-5 for rows a, b, c, and d), 24, 28, and 29. Any of these items that had missing data or data that conflicted with other responses and that could not be imputed through logical imputation were sent to data retrievallf data continued to be missing after data retrieval, then the missing values were imputed. For most of the key data items, the response rate was greater than 98 percent. Depending on the type of data to be imputed and the extent of missing values, logical imputation, poststratum means, or hot-deck imputation methods were employed. For three data items, imputation was done using information from the 1998-99 CCD file. An analysis was conducted of school level nonresponse to determine the extent to which nonresponse might bias the survey estimates. School level nonresponse differed by the characteristics of the school, and ranged from response rates of 64 to 80 percent. Generally, the characteristics that were related to nonresponse in the SSOCS were also correlated with many of the school characteristic variables collected in the survey (e.g., level, type of locale, enrollment size of school, region, pupilto-teacher ratio, minority status  The formula used to compute the t statistic is as follows:"}, {"section_title": "Sources of Error and Statistical Analysis Procedures", "text": "( 1)where E1 and E2 are the estimates to be compared and se, and se2 are their corresponding standard errors. Note that this formula is valid only for independent estimates. When the estimates are not independent (for example, when comparing a total percentage with that for a subgroup included in the total), a covariance term (i.e., 2se1*se2) must be added to the denominator of the formula: t E 2 se2, + se22 + 2* se 1* se2 (2) Once the t value was computed, it was compared with the published tables of values at certain critical levels, called alpha levels. For this report, an alpha value of 0.05 was used, which has a t value of 1.96. If the t value was larger than 1.96, then the difference between the two estimates was statistically significant at the   'Student/teacher ratio was calculated by dividing the total number of students enrolled in the school by the total number of full-time equivalent teachers. The total number of full-time equivalent teachers is a combination of the full-time and part-time teachers, including special education teachers, with an adjustment to compensate for the parttime status of those teachers. 'Serious discipline problems is a count of discipline problems reported by principals. These discipline problems include student racial tensions, student bullying, student verbal abuse of teachers, widespread disorder in classrooms, and student acts of disrespect for teachers. If a principal reported that any of these problems occurred daily or weekly in their school, each was counted once in the total number of serious discipline problems. Undesirable gang activities, and undesirable cult or extremist group activities were also counted once as a problem if the principal reported that these events occurred at all in their school. 'Transfers as a percentage of enrollment combines the number of students who were transferred to a school and the number of students who were transferred from a school, divided by the total number of students enrolled in the school. 'Violent incidents include rape, sexual battery other than rape, physical attack or fight with or without a weapon, threat of physical attack with or without a weapon, and robbery with or without a weapon. "}, {"section_title": "Multivariate Analysis", "text": "A multivariate analysis is performed for two reasons. First to confirm the bivariate relationships found in the first part of this report, and second, to identify correlates related to the schools with a high volume of incidents as shown by the distribution of incidents in the hotbed analysis. The bivariate relationships presented in the Incidents of Violence in Public Schools section are the simple relationships between school characteristics and the prevalence of violence and serious violence in public schools. To further examine these relationships, and to address the fact that schools were not randomly assigned particular characteristics, a number of variables were introduced into multivariate regression equation. Without controlling for the relationships between these characteristics, one might erroneously conclude that a particular variable was related to violence in schools. To disentangle these interrelationships between school characteristics and school violence four multivariate regression equations are presented. In order to address concerns about multicollinearity, variance inflaction factors and a correlation matrix were run for the variables in the regression equations, and all were within acceptable limits with the exception of two variables. Specifically, all of the variables had a variance inflation factor of less than three except for transfers to and from school. These variables showed marginal signs of multicollinearity with tolerances of 0.22 each, or variance inflation factors of 4.6. The correlation matrix revealed that these two variables are correlated with one another at 0.87. Schools with no serious violence and schools with 1 to 8 serious violent incidents were compared to schools that experienced 9 or more serious violent incidents in 2000. As with logistic regression, the coefficients are transformed for easier interpretation. For multinomial logistic regression, relative risk ratios (rrr) were used. The rrr is interpreted as the odds that an event will occur compared to the reference category, while at the same time controlling for the other response category. For example, a unit change in percent males impacts the odds that a school will have no violence incidents compared to having a high volume of violent incidents, while controlling for schools that experienced low-tomoderate violent incidents in 2000. Unlike the previous sections of this report, the continuous variables were used rather than the collapsed bound, percent who value academic achievement, percent absent without an excuse, use of police on campus, percent eligible for free lunch, percent male, number of violent incidents, number of serious violent incidents, prevalence of violence, and the prevalence of serious violence. Differences were detected in only two variables: level and urbanicity. Elementary schools were less likely than middle and secondary schools to have missing data. City schools were less likely than rural schools to have missing data. However, no differences were detected in the number or prevalence of violence or serious violence experienced by schools eliminated from the analyses compared to those used in the analyses. Therefore, it is not likely that the elimination of schools because of missing data had a significant impact on multivariate results."}, {"section_title": "Derived Variables", "text": "The number of classroom changes variable represents the number of changes from one classroom to another in a typical school day. Principals were instructed to count going to lunch and then returning to the same or different classroom as 2 classroom changes. They also were instructed not to count morning arrival or afternoon departure as a classroom change. If a school reported more than 10 classroom changes, it appears that they may have been double counting the number of changes by counting both the class that the student left and the class that the student entered. For the purposes of analysis, the cases where the respondent reported between 10 and 20 classroom changes were divided by 2. The cases where the respondent reported more than 20 classroom changes were set to missing. The level variable was constructed from the Common Core of Data (CCD). The CCD includes information about the highest grade and lowest grade served by a school. For this analysis, elementary schools are those in which the lowest grade is less than or equal to third BEST COPY AVAILABLE grade, and the highest grade is less than or equal to eighth grade. Middle schools are those in which the lowest grade is greater than or equal to fourth grade, and the highest grade is less than or equal to ninth grade. Secondary schools were those that had a lowest grade greater than or equal to ninth grade, and a highest grade of less than or equal to twelfth grade. Combined schools included those with a low grade less than or equal to third grade with a high grade of greater than eighth grade, or the school had a highest grade of ninth grade with a lowest grade greater than third grade. The number of serious discipline problems variable was derived by combining principals' responses to the amount of the following behaviors that would constitute a serious problem for the school: student racial tensions, student bullying, student verbal abuse of teachers, widespread disorder in classrooms, student acts of disrespect for teachers, undesirable gang activities, and undesirable cult or extremist group activities. If a principal responded that student racial tensions, student bullying, student verbal abuse of teachers, widespread disorder in classrooms, student acts of disrespect for teachers occurred in the school daily or at least once a week, the problem was considered to be a serious. If a principal responded that undesirable gang activities or undesirable cult or extremist group activities occurred at all, they were considered a serious problem in the school. The number of behaviors was added together to provide a count of the number of serious discipline problems in the school. The other incidents variable used to provide an estimate of the number and percent of schools that experienced such an incident at school was derived by including the schools that reported at least one possession of a firearm or explosive devise, possession of a knife or sharp object, distribution of illegal drugs, possession or use of alcohol or illegal drugs, sexual harassment, or vandalism. In order to provide an estimate of the total number of other incidents that occurred, all of the incidents reported for each type of crime were combined. If a respondent left the total number of any of the incidents missing, the variable was imputed with the total number of the incident that was reported to the police."}, {"section_title": "55", "text": "The percent minority variable was derived from the Common Core of Data (CCD), and includes students in the following racial or ethnic groups: American Indian or Alaska Native, Asian or Pacific Islander, Hispanic, and Black, non-Hispanic. The serious violent incidents variable used to provide an estimate of the number and percent of schools that had experienced such an incident at school was derived by including the schools that reported at least one rape, sexual battery other than rape, physical attack or fight with a weapon, threat of physical attack with a weapon, robbery with a weapon, or robbery without a weapon. In order to provide an estimate of the total number of serious violent incidents that occurred, all of the incidents reported for each type of crime were combined. If a respondent left the total number of any of the incidents missing, the variable was imputed with the total number of the incident that was reported to the police. The student/teacher ratio variable was derived by dividing the total number of students enrolled in the school by the total number of full-time teachers. The total number of full-time teachers is a combination of the full-time and part-time teachers, including special education teachers, with an adjustment to compensate for the part-time status of those teachers. The transfers as percentage of enrollment variable was derived by combining the number of students who were transferred to a school and the number of students who were transferred from a school, and dividing by the total number of students enrolled in the school. The urbanicity variable was constructed from the Common Core of Data (CCD). The CCD uses eight different categories in describing the location of the schools. Four categories were included for the SSOCS data by combining the categories from the CCD. City schools were those in a central city of a metropolitan statistical area, and included those schools located in large or midsize cities from the CCD. Urban fringe schools were located in any incorporated place, Censusdesignated place, or non-place territory within a CMSA or MSA of a city, and defined as urban by the Census Bureau, and included those schools located in the urban fringe of large or midsized cities from the CCD. Town schools were located in any incorporated place, Censusdesignated place with a population greater than or equal to 2,500 and located outside a CMSA or MSA, and included schools in large or small towns from the CCD. Rural schools were ones in any incorporated place, Census-designated place, or non-place territory designated as rural by the Census Bureau, and included schools outside of an MSA and rural, but inside of an MSA from the CCD. The use of paid law enforcement variable was derived by including those schools that reported the use of paid law enforcement or security services at any time during school hours, while students were arriving or leaving, at selected school activities, or at other times if the description was consistent with regular use. The violent incidents variable used to provide an estimate of the number and percent of schools that had experienced such an incident was derived by including the schools that reported at least one rape, sexual battery other than rape, physical attack or fight with a weapon, physical attack or fight without a weapon, threat of physical attack with a weapon, threat of physical attacks without a weapon, robbery with a weapon, or robbery without a weapon. In order to provide an estimate of the total number of violent incidents that occurred, all of the incidents reported for each type of crime were combined. If a respondent left the total number of any of the incidents missing, the variable was imputed with the total number of the incident that was reported to the police. Weaponany instrument or object used with the intent to threaten, injure, or kill. Includes look-alikes if they are used to threaten others. 'Violent incidents include rape, sexual battery other than rape, physical attack or fight with or without a weapon, threat of physical attack with or without a weapon, and robbery with or without a weapon."}, {"section_title": "Glossary of Terms", "text": "'Serious violent incidents include rape, sexual battery other than rape, physical attack or fight with a weapon, threat of physical attack with a weapon, and robbery with or without a weapon. 'Other incidents include possession of a firearm or explosive device, possession of a knife or sharp object, distribution of illegal drugs, possession or use of alcohol or illegal drugs, sexual harassment, or vandalism. 'Some schools are omitted from these categories because of missing data on their school characteristics. For this reason, the detailed results do not sum tothe totals. 'Studentlteacher ratio was calculated by dividing the total number of students enrolled in the school by the total number of full-time equivalent teachers. The total number of full-time equivalent teachers is a combination of the full-time and part-time teachers, including special education teachers, with an adjustment to compensate for part-time status. 6Serious discipline problems is a count of discipline problems reported by principals. These discipline problems include student racial tensions, student bullying, student verbal abuse of teachers, widespread disorder in classrooms, and student acts of disrespect for teachers. If a principal reported that any of these problems occurred daily or weekly in their school, each was counted once in the total number of serious discipline problems. Undesirable gang activities, and undesirable cult or extremist group activities were also counted once as a problem if the principal reported that these events occurred at all in their school. 'Transfers as a percentage of enrollment combines the number of students who were transferred to a school and the number of students who were transferred from a school, divided by the total number of students enrolled in the school.    'Violent incidents include rape, sexual battery other than rape, physical attack or fight with or without a weapon, threat of physical attack with or without a weapon, and robbery with or without a weapon. 'Serious violent incidents include rape, sexual battery other than rape, physical attack or fight with a weapon, threat of physical attack with a weapon, and robbery with or without a weapon. 'Other incidents include possession of a firearm or explosive device, possession of a knife or sharp object, distribution of illegal drugs, possession or use of alcohol or illegal drugs, sexual harassment, or vandalism. 'Detail may not sum to totals because of missing cases. 'Student/teacher ratio was calculated by dividing the total number of students enrolled in the school by the total number of full-time equivalent teachers. The total number of full-time equivalent teachers is a combination of the full-time and part-time teachers, including special education teachers, with an adjustment to compensate for part-time status. 'Serious discipline problems is a count of discipline problems reported by principals. These discipline problems include student racial tensions, student bullying, student verbal abuse of teachers, widespread disorder in classrooms, and o-student acts of disrespect for teachers. If a principal reported that any of these problems occurred daily or weekly in their school, each was counted once in the total number of serious discipline problems. Undesirable gang activities, and n7 undesirable cult or extremist group activities were also counted once as a problem if the principal reported that these events occurred at all in their school. 7Transfers as a percentage of enrollment combines the number of students who were transferred to a school and the number of students who were transferred from a school, divided by the total number of students enrolled in the school.    'Detail may not sum to totals because of missing cases. 'Student/teacher ratio was calculated by dividing the total number of students enrolled in the school by the total number of full-time equivalent teachers. The total number of full-time equivalent teachers is a combination of the full-time and part-time teachers, including special education teachers, with an adjustment to compensate for part-time status. 'Serious discipline problems is a count of discipline problems reported by principals. These discipline problems include student racial tensions, student bullying, student verbal abuse of teachers, widespread disorder in classrooms, and student acts of disrespect for teachers. If a principal reported that any of these problems occurred daily or weekly in their school, each was counted once in the total number of serious discipline problems. Undesirable gang activities, and undesirable cult or extremist group activities were also counted once as a problem if the principal reported that these events occurred at all in their school. 'Transfers as a percentage of enrollment combines the number of students who were transferred to a school and the number of students who were transferred from a school, divided by the total number of students enrolled in the school.    'Detail may not sum to totals because of missing cases. 'Student/teacher ratio was calculated by dividing the total number of students enrolled in the school by the total number of full-time equivalent teachers. The total number of full-time equivalent teachers is a combination of the full-time and part-time teachers, including special education teachers, with an adjustment to compensate for part-time status. 'Serious discipline problems is a count of discipline problems reported by principals. These discipline problems include student racial tensions, student bullying, student verbal abuse of teachers, widespread disorder in classrooms, and student acts of disrespect for teachers. If a principal reported that any of these problems occurred daily or weekly in their school, each was counted once in the total number of serious discipline problems. Undesirable gang activities, and undesirable cult or extremist group activities were also counted once as a problem if the principal reported that these events occurred at all in theirschool. o-'Transfers as a percentage of enrollment combines the number of students who were transferred to a school and the number of students who were transferred from a school, divided by the total number of students enrolled in the school.    'Detail may not sum to totals because of missing cases. 'Student/teacher ratio was calculated by dividing the total number of students enrolled in the school by the total number of full-time equivalent teachers. The totalnumber of full-time equivalent teachers is a combination of the full-time and part-time teachers, including special education teachers, with an adjustment to compensate for part-time status. 'Serious discipline problems is a count of discipline problems reported by principals. These discipline problems include student racial tensions, student bullying, student verbal abuse of teachers, widespread disorder in classrooms, and student acts of disrespect for teachers. If a principal reported that any of these problems occurred daily or weekly in their school, each was counted once in the total number of serious discipline problems. Undesirable gang activities, and undesirable cult or extremist group activities were also counted once as a problem if the principal reported that these events occurred at all in their school. 'Transfers as a percentage of enrollment combines the number of students who were transferred to a school and the number of students who were transferredfrom a school, divided by the total number of students enrolled in the school.    'Student/teacher ratio was calculated by dividing the total number of students enrolled in the school by the total number of full-time equivalent teachers. The totalnumber of full-time equivalent teachers is a combination of the full-time and part-time teachers, including special education teachers, with an adjustment to compensate for part-time status. 3Serious discipline problems is a count of discipline problems reported by principals. These discipline problems include student racial tensions, student bullying, student verbal abuse of teachers, widespread disorder in classrooms, and student acts of disrespect for teachers. If a principal reported that any of these problems occurred daily or weekly in their school, each was counted once in the total number of serious discipline problems. Undesirable gang activities, and undesirable cult or extremist group activities were also counted once as a problem if the principal reported that these events occurred at all in their school. 'Transfers as a percentage of enrollment combines the number of students who were transferred to a school and the number of students who were transferred from a school, divided by the total number of students enrolled in the school. "}, {"section_title": "Tables of Standard Errors", "text": "BEST COPY AVAILABLE 7 9                 During the 1999-2000 school year, how many students were involved in committing the following offenses, and how many of the following disciplinary actions were taken in response? (If more than one student was involved in an incident, please count each student separately when providing the number of disciplinary actions. If a student was disciplined more than once, please count each incident separately (e.g., a student who was suspended five times would be counted as five suspensions). However, if a student was disciplined in two different ways for a single infraction (e.g., the student was both suspended and referred to counseling), count only the most severe disciplinary action that was taken.) Offense a. Use of a firearm/explosive device b. Possession of a firearm/ explosive device c. Use of a weapon other than a firearm d. Possession of a weapon other than a firearm e. Distribution of illegal drugs f. Possession or use of alcohol or illegal drugs Think of those times during the 1999-2000 school year that special education students committed an offense that normally would result in a suspension or expulsion of more than 10 school days for children without disabilities. Please enter the number of outcomes for each of those offenses, using the categories below. a. Placement was changed (including a suspension or expulsion) 1. After a due process hearing 2. After a court-ordered injunction 3. Without a due process hearing or court injunction (e.g., parents did not object) b. Placement was not changed 1. No due process hearing or court session was held (e.g., did not seek a change) 2. Due process hearing did not approve change 3. Court did not approve change How many classroom changes do most students make in a typical day? (Count going to lunch and then returning to the same or a different classroom as two classroom changes. Do not count morning arrival or afternoon departure.) Typical number of classroom changes 26. How many paid staff are at your school in the following categories? In 1999-2000, how many students transferred to or from your school after the school year had started? Please report on the total mobility, not just transfers due to disciplinary actions. (lf a student transferred more than once in the school year, count each transfer separately.) a. Transferred to the school b. Transferred from the school 31. Please provide the following dates. Words that are underlined are defined at the beginning of this questionnaire."}]