[{"section_title": "Abstract", "text": "ABSTRACT: This paper analyses the impact of teacher gender towards students' test results in a blinded Math test administered to students in Catalonia (Spain). The data for this analysis are drawn from a sample of secondary school students who participated in an international blind-test known as the \"Mathematical Kangaroo\" in 2008. The estimation considers a two-stage procedure since participation on the test leads to the presence of sample selection. Results show a correlation between female teacher gender and student results. Moreover, students with female teachers have a higher probability of participating in the \"Kangaroo\" test (in this case, the effect being more marked among male students).\nJEL Codes: I28, J16"}, {"section_title": "Introduction", "text": "A number of countries, including Australia, Canada, Finland, New Zealand, United Kingdom and the United States have implemented policy initiatives to increase the number of male teachers in primary education (where they have been in a clear minority) to improve the results of male pupils, since it is assumed that, among other reasons, they are related to the lower presence of male teachers (see a review in Klein, 2004; Carrington et al., 2007; Younger and Warrington, 2008; Skelton, 2009 ). These policies have been implemented although there is ongoing debate as to whether students' results can be correlated with the gender of their teachers.\nThus, some studies report that students perform better if they have a same-gender teacher, others point out that it is better to have a female teacher, while the third group of studies indicate that there is no gender effect at all. The reasons to support the first type of results relate to the fact that teachers might prefer teaching students of their own gender or that gender stereotypes may influence teacher evaluations of their students. In addition, teachers may act as role models for their students (see, among others, Carrington and Skelton, 2003; Gray and Leith, 2004; Holmlund and Sund, 2008) . In regards to the second kind of results, students assigned to female teachers perform better since female teachers tend to be more supportive, provide a more positive classroom atmosphere, and tend to use a more student-oriented style of teaching stressing the importance of motivation (see Stake and Katz, 1982; Singer, 1996; Krieg, 2005; Nelson Laird, 2011) . Below we summarize some of the existing evidence for primary and secondary education (middle and high school).\nIn primary education, the studies reviewed conclude that teacher gender is either irrelevant or that female teachers improve both girls' and boys' performance. Thus, in a large-scale analysis (8,978 eleven-year-old pupils and 413 teachers) in 113 primary schools (Year 6) in England, during the 1997/98 academic year, Carrington et al. (2008) conclude that having a same-gender teacher has no impact on student performance (measured through tests), either that of males or females, in mathematics, reading and science. Moreover, with a sample of students and teachers in 19 primary and secondary schools in Australia, Lingard et al. (2002) show that teacher gender is not a significant factor in determining positive outcomes for students in literacy and mathematical tests. This result is also found in Sokal et al. (2005) in a study with 6-to 8-yearold children in a school in Canada regards to reading performance, as well as in Driessen (2007) with a large-scale sample of Dutch primary schools, in relation to language and maths tests' results, which included 5,181 grade eight pupils, 251 teachers and 163 schools. Krieg (2005) also concludes that having a teacher of the same gender is not relevant. However, the study shows that male and female students in grade three (8-year-olds) assigned to female teachers obtain higher marks on a standardized test (the Washington Assessment of Student Learning).\nControlling for student ability as well as for school and district fixed effects, Krieg shows that the students of female teachers are more likely to score well on the maths, reading and writing sections of the test (i.e., they obtain higher results and present a higher probability of passing).\nIn developing countries, Chudgar and Sankar (2008) consider a sample of grade four and six students (ages 9 to 11), in 300 public schools in India, and conclude that being in a female teacher's classroom is advantageous for language learning but teacher gender has no effect on mathematics learning.\nIn secondary education we find numerous evidence: teacher gender is irrelevant regards to students' results; female teachers increase students' outcomes; and/or students assigned to a same-gender teacher have better results. Thus, in an analysis of upper-secondary education students (16-to 18-year-olds) in 69 schools in Stockholm (Sweden), Holmlund and Sund (2008) find no evidence to show that teacher gender improves student outcomes. In this study, for each student and school year, they are able to identify both the student outcome (the final overall grade as well as the grades obtained in several individual subjects) and the gender of the students and teachers. The authors argue that the gender performance differential (in favor of female students) is greater in subjects in which the share of female teachers is higher but this effect is not causal, since it is not observed when the analysis controls for teacher turnover and student mobility nor when the assumption of random student-teacher matching within a subject holds. The same kind of evidence is provided by Ehrenberg et al. (1995) for the USA. Using data from the National Education Longitudinal Study of 1988, which comprises nearly 25,000 eighth graders (lower secondary education) as well as two of each of the student's teachers, they find that a teacher's gender is not correlated with the achievement (test scores in mathematics and science) of students (although, in some cases, teachers' subjective evaluations about their students are). However, Dee (2007) shows that that assignment to a same-gender teacher significantly improves the achievement of both girls and boys in terms of their test scores (in mathematics, science, reading and history). Data comes from the National Education Longitudinal Study of 1988 and he controls for student traits, classroom and teacher characteristics as well as including student, class and teacher fixed effects. Finally, considering 3,446 pupils from 110 public schools in Israel, Klein (2004) concludes that male and female pupils get higher scores, defined as end of the year grades in subjects related to humanities, such as literature and history, and science (mathematics, chemistry and physics) with female teachers.\nThus, the available empirical evidence does not allow an accurate determination of the correlation between teacher's gender and student's academic performance in primary and secondary education. In this context, this paper analyses the impact of teacher gender on student marks, considering student results in a mathematical blind-test (named \"Kangaroo\"). The issue is of importance since, as Holmlund and Sund (2008) point out, the gender gap may have both educational and economic consequences in terms of an efficiency loss whereby students with higher ability might obtain lower marks and face greater difficulties in accessing higher levels of education and furthering their professional careers. In addition, as mentioned before, educational policies have been implemented in a number of countries to regulate this issue with labor consequences for the teachers.\nThree specific aspects of this paper are worth highlighting. First, in this study we include the characteristics of the agents that might have an impact on student results, such as pupils, teachers, and schools. Second, we include fixed effects to control for student and school characteristics not observed in the analysis unobservables, as the recent literature recommends (Dee, 2007; Hoffman and Oreopoulos, 2009; Holmlund and Sund, 2008) . Finally, to the best of our knowledge, this is the first analysis conducted in Spain (or in any similar country in Southern Europe)."}, {"section_title": "Data and Methodology", "text": "The data for this analysis is drawn from a sample of students in Catalonia (one of the 17 Spanish regions, representing 14.7% of Spain's secondary students) who participated in a blindtest (known as the Mathematical Kangaroo). The Kangaroo was first organized in Europe, in 1991, by two French teachers who adopted the idea from Australia, hence its name. The aim of the test is to promote mathematics among the world's youth. Since then, the competition has been open to any student in grades 1 through 12. Today, some 45 countries participate in the test. Since 1996, for each age level tests are the same in all participating countries. The subjects for the following year's contest are chosen by the Kangaroo's International Association (Kangourou sans frontieres) during the annual general assembly organized each year, in October or November, in a different country (KSF, 2010) . In Spain, Catalonia is one of the four regions that took part in this test (participation is open to any school that asks for it).\nThe data sampling took place between February and December of 2008. The survey targeted secondary school students. Specifically, in the last two years of lower-secondary education, grades 9 and 10 (known as ESO) and in the two courses of upper-secondary education (grades 11 and 12, named Bachillerato). Secondary school mathematics teachers in Catalonia were asked to participate in the survey and to help with student data collection. The final sample contained complete information for 2,083 students (387 sat the Kangaroo test), and 90 maths teachers at 90 schools. The population figures are 16,833students and 427 teachers. The chosen schools were a representative sample of the Catalan educational system. The students' questionnaire was mainly supplied on-line. Students filled in the questionnaire at school, using anonymous codes, with the supervision of a teacher. It contained five blocks of questions: personal data, family background, school characteristics, and questions related to teachers and teaching. Teachers also provided some information about their personal characteristics and teaching experience.\nMore specifically, we considered the following information: (i) pupil's personal data: age and gender; (ii) parental background characteristics: if parents are married or otherwise, immigrant status, having changed residence recently (during the last three years), number of books in the household (up to 100 books or more than 100), and mothers' educational attainment levels (up to primary education, secondary and higher education); (iii) schooling features: type of school (private or public), academic year (from Year 9 to 12), and grade in the subject of mathematics in the previous academic year (marks ranging from 0 to 10); (iv) classmates' characteristics:\npercentage of classmates' mothers with higher education, proportion of female pupils in the classroom, and whether students kept the same peers as in the previous year; (v) characteristics of their current mathematics teacher: age, gender, years of experience as teacher at the same school, whether the teacher is the same as last year's, and students' satisfaction with current maths teacher. Results from the Kangaroo test were provided by the Kangaroo Organization in Catalonia (they were not self-reported by the students).\nWe controlled for several factors to reduce any potential bias (as regards gender) in our results.\nOf the teachers whose students took part in the Kangaroo test, in Catalonia, 52.4% were female.\nThis figure was slightly reduced to 49.2% in our sample. Of all the girls from the four years of secondary education considered, 43.2% participated in the test (corrected to 44.9% in our sample). In the case of the test results, the average female's performance on the Kangaroo test was 57.37 points compared with 61.32 for the males. In our sample, these figures became 59.26 and 62.92, respectively. Thus, although our sample is quite small, our results are not gender biased with regards to either teachers or students. In fact, none of the differences presented here are statistically significant. Finally, as reported by schools' principals teachers could not choose their students and, therefore, students were randomly assigned to teachers. In fact, some teach mathematics to more than one group at the same school. Table 1 contains the main descriptors for the sample. We highlight that in the case of gender variables, 51.0% of students were female, which is very similar to the figure for the total population of students in the school grades considered (52.2%). Moreover, regarding teachers, 49.2% were women (the figure is 51.0% for the whole population of mathematical teachers in the courses considered in this study). The average points score on the test was 61, with a minimum of 11 and a maximum of 128.\n(Insert Table 1 (1)\nWhere y i represents the score obtained on the Kangaroo test, x i is a matrix containing the control variables, d is a k-vector of k unknown parameters, p i represents those students participating on the test, l is the coefficient associated with student participation, whilst e i represents the independently distributed error term. We conduct our estimation using a two-stage procedure since participation on the test (p i ) leads to the presence of sample selection, which should be explained through the use of z covariates (Heckman, 1979) .\nThe covariates within x as conditioning individual maths test scores at the different levels of secondary education are those indicated in the previous section. Moreover, we include an interaction variable between teacher and student gender. It is incorporated in order to consider whether the effect of the teacher's gender on students' performance differs between males and females. This variable is given a value of 1 when both teacher and student are female and 0 otherwise. It enables us to maintain the whole sample in our analysis of teacher effects on students' results by gender.\nParticipation in the Kangaroo test is explained by means of the following covariates (z i ): students' age and gender, immigrant status, having changed residence recently, number of books in household, type of school, students' current academic year, grade in the subject of mathematics in the previous academic year, proportion of female classmates, whether students kept the same peers as in the previous year, teachers' age, gender (and the above indicated interaction term), years of experience at the same school, whether the teacher is the same as last year's, and students' satisfaction with current mathematics teacher. Moreover, a variable is included to indicate whether the school promoted student participation in the Kangaroo test.\nFinally, in both analyses, school fixed effects are included (a dummy variable for each school).\nThese represent school characteristics not specifically included in the study. Table 2 shows our main findings using a Heckman two-step procedure (as indicated in section 2). With respect to the specific variable under consideration in this study, we highlight the following results: teacher gender affects students' results since these are positively correlated with having a female teacher. The interaction term is not statistically significant. Thus, the teacher gender effect is the same for both male and female students. In the case of male students, those with female teachers improve their results in the Kangaroo test by 12 points."}, {"section_title": "Results", "text": "Since the standard deviation is 21.5 (see Table 1 ), the teacher's gender increases students' results by more than half the standard deviation.\nLikewise, Table 2 shows the relationship between teacher gender and student participation in the Kangaroo test (the effect of all the other variables is available upon request). In this case, the variables related to teacher gender show that pupils studying mathematics with a female teacher are more likely to participate in the Kangaroo test. The interaction term has a negative sign and is statistically significant. As such, the indicated effect is greater for male students than it is for their female counterparts.\nTo sum up, students with a female teacher receive higher marks on the Kangaroo test. Moreover, they are more likely to take this test, although here the effect is more marked among male pupils. We point out that very similar findings were obtained through the use of a multilevel approach as well as through the use of a maximum likelihood estimation procedure (data not shown). We do not report them for redundancy reasons.\nFor the remaining teacher variables, the fact that a student was more than one school year with the same maths teacher is positively related to pupil's results on the mathematical test (although it is only significant at the 10% level). In addition, the teacher's age and the number of years teaching at the same school, as well as the degree of satisfaction that students expressed as regards their mathematics teacher, were not statistically significant. These results are similar to those related to teacher experience (Hanushek, 2011) and age (Chudgar and Sankar, 2008) .\nAmong the students' personal characteristics, results show that female students presented lower scores in mathematics than their male counterparts, as is usual in mathematical tests (see OECD, 2010 ) among other factors due to multiple-choice type of examinations (Stobart et al., 1992) . As for family characteristics, the cultural background of the home (measured in terms of number of books) enhanced students' results (in line with, among others, Woessmann, 2003 and Kang, 2007) , whereas recent changes of residence had a negative effect (in line with findings in Krieg, 2005 , who analyzed changes of school). However, the mother's educational attainment level, while presenting the expected sign, was not statistically significant (note that the same effect might be captured by the aforementioned cultural variable). The use of father's education provided the same results (we do not include both variables due to the high level of correlation between them). Neither were significant the civil status of parents nor their possible immigrant status. As regards this last variable, the small sample of parents reporting immigrant status might explain the results, which have been typically negative in most previous studies -see Gang and Zimmermann (2000) , Frick and Wagner (2001) , and Ammermuller (2007), although not in Fertig (2003) after he controlled for parents socioeconomic background.\nAs for the school, the pupils with the highest grades in mathematics in the previous academic year obtained, as expected, the highest scores on the Kangaroo test. Additionally, students in Year 10 (fourth year of ESO) obtained the lowest scores. The type of the school (public or private) seems irrelevant in terms of students' mathematical achievement on the test, in line with earlier studies, see Fertig (2003) , Dronkers (2004) , Altonji et al. (2005) , Calero and Escardíbul (2007) . Moreover, those students who had the same peers as in the previous year presented lower results. Finally, neither the percentage of students' mothers in the class with higher educational levels nor the percentage of female students in the class is statistically significantvariables that were found to be significant in other studies albeit at the school level (see Van Houtte, 2004; Lavy and Schlosser, 2011) but not in Calero and Escardíbul (2007) for the Spanish case.\n(Insert Table 2 around here) Finally, we extended the analysis by including students' fixed effects. Since the present sample is a cross-section (not a panel), we need to find a way to control for student fixed effects. We included students' self-reported personality (specifically, their degree of conscientiousness in relation to school work) and self-reported motivation (for studying mathematics) as a proxy for individual ability. These psychological traits can be considered individual fixed effects since both are inherent to student behavior. Both variables were captured through specific questions included on the questionnaire. We conducted several interviews with psychologists in order to ensure that relevant questions were included regarding conscientiousness. They recommended the inclusion of the following questions from the well-known Big Five Personality Trades Test (see Norman, 1963) : I am exacting in my work; I follow a schedule; I get chores done right away; I pay attention to details; I leave my belongings around; I make a mess of things; I shirk my duties. We computed Cronbach's alpha statistics for the scale formed from the pairs of variables (0.76). The Kaiser-Meyer-Olkin measure of sampling adequacy (0.81) was satisfactory to proceed with factor analysis. Accordingly, the factor scores were re-scaled to a variable ranging from 0 to 1, indicating the degree of personal conscientiousness. For the motivational variable, we followed the Alonso-Tapia and Arce-Sáez (1992) questionnaire designed specifically for Spanish teenagers. The motivational variable was then computed following the same methodology described for the conscientiousness one. In the empirical analysis (see Table   3 ), the effects of teacher gender were robust to the inclusion/exclusion of these student fixed effects (note, we only report the results related to teacher characteristics). As it is shown, only having the same teacher more than one course becomes not significant. Moreover, both variables related to students' fixed effects were positive and statistically significant.\n(Insert Table 3 around here)"}, {"section_title": "Discussion", "text": "In this paper we analyze whether teacher gender is related to mathematical achievement of students in Catalonia (Spain). The gender gap between teacher and student may cause an efficiency loss if the more able students obtain lower marks than usual and, therefore, have greater difficulties in accessing higher levels of education. Moreover if hiring policies negatively affects female teachers, this will not only increase discrimination in the labor market -see evidence of the gender gap in the European labor market in Díaz and Sánchez (2011) , and Furnham and Wilson (2011) -but will cause an efficiency loss if the best teachers are not recruited.\nHere, we have specifically analysed student results on a blind-test, conducted outside the school system, known as the Mathematical Kangaroo test, the aim of which is to promote mathematics among the world's youth. The analysis has incorporated factors related to the personal and family characteristics of the students as independent variables, in addition to school and teacher characteristics. In line with the recent literature, we have also included student and school fixed effects.\nOur results show that all pupils who studied mathematics with a female teacher obtained higher results on the blind-test than those with a male teacher. Likewise, students with female teachers were more likely to participate in the blind-test. Thus, teacher gender is related to students' academic achievement as well as in relation to their motivation for the subject of mathematics (assuming that their motivation is reflected in their willingness to participate in the Kangaroo test). Our results, therefore, are not in line with international evidence supporting discrimination or role-model hypotheses (see Holmlund and Sund, 2008) but they do coincide with findings on the way that female teachers interact with their students (Krieg, 2005) . Therefore, following policies to increase male teachers in order to improve male pupils' results, already implemented in other countries, seem inappropriate (at least for environments similar to the one analysed in this study).\nFurther research is called for in this area; we hope to extend this study in the near future by considering two effects. On the one hand, the male-female teacher differences should be examined in relation to a wider range of factors related to teachers, such as training, selfconfidence, job satisfaction and teachers' beliefs (see Li, 1999; She, 2000; Driessen, 2007) to understand why pupils should benefit from having a female teacher. In this regard, school personnel management should also be considered (wages, promotion, etc.). On the other hand, this study could be usefully extended to all educational levels. (1) There were 13 missing responses for this variable. Average imputation method was used (see Allison, 2002) . Teacher female * student female -0.424** 0.176 *** denotes significance at 1% level, ** 5%, * 10%. "}]