[{"section_title": "Abstract", "text": "This paper explores gender equity in science education and occupations in a global context. Research on the development of all science talent is critical given the importance of diversity for science and the increased demand for well-trained technical workers, scientists, and engineers. Although women are under-represented in most science systems around the world, some countries have been more successful in creating gender equity than others. We use cross-national data from multiple sources to examine gender equity in science at various points in the science pipeline. We also focus on patterns of equity in science across diverse political and socio-economic settings. Findings show gender inequity in science education and (especially) occupations worldwide. Countries where women are doing the best on early science indicators do not tend to include the United States and Scandinavian countries. They also are not limited to countries with higher GNP per capita or higher percent women in Parliament. GNP and percent women in Parliament are better predictors of gender access later in the pipeline. Given these geographic patterns, we provide recommendations and a sample map for using a spatial approach to examining gender equity in science in a global context."}, {"section_title": "Introduction", "text": "This paper focuses on gender equity in science education and occupations 1 in a global context. The argument for equality of access to science comes in part from a social justice perspective (Hanson 2012) . Access to science is a human right regardless of gender, race/ethnicity, or social class. Additionally, we cannot have good science without the development of all science talent. Innovation in science comes with diversity in science (Scheibinger, 1999; Committee on Science, Engineering, and Public Policy, 2011; UNESCO, 2015a) . Research on the development of science talent is also critical given the increased demand for well-trained technical workers, scientists, and engineers. The demand is not just for a well-trained science labor force, but also for a diverse, well-trained science labor force that reflects the demographics of the population. Global economic growth and security, improved standard of living, advances in medicine and environmental sustainability are contingent on diversity in all STEM related areas (science, technology, engineering, and mathematics) (AAAS,, 2010 ; Committee on Science, Engineering, and Public Policy, 2011; Phillips, 2014) . In this paper, we use cross-national data from multiple sources (including PISA, TIMSS, and UNESCO) to examine gender equity in science at various points in the science pipeline. We also focus on patterns of equity in science and the political and socio-economic characteristics of countries that are doing better (and worse) on gender equity. Stuit, 2016; Rubin, 2014; European Parliament, 2015; Rees, 2010) . Accounts from different world regions suggest multiple factors at play in this process. For example, reports from China suggest that traditional culture and the association of women with the family keeps women from success in science occupations although they have greater success in science education (Science Development Network, 2011) . In some Asian countries like Cambodia, young women's access to higher education, in general, remains limited (UNESCO, 2015b) . In Latin America, researchers suggest that social class is a major factor in impeding women in the science pipeline (International Development Bank, 2007) . In general, Latin America has a relatively small investment in research. This is a limiting factor for scientific output and training in general (Gutié rrez, 2017) . In Africa, the lack of encouragement for girls in science early on in the pipeline and the shortage of women in leadership roles serve as major factors in hindering women and girls in the science pipeline (UNESCO, 2012; Wilde, 2012; Akwei, 2016) . Worldwide, factors involving gender stereotypes, traditional gender cultures, expectations about family roles, poverty, labor market characteristics, and lack of political/financial support work against women in science (African Women in Science and Engineering, 2013; All Africa, 2013; Science Development Network, 2011; UNESCO, 2012; 2015b ; U.S. Department of Commerce, 2011; Bradley & Charles, 2003; Charles and change to & Bradley, 2009; Dekkers & van Langen, 2005; Rees, 2010) .\nWomen throughout the twentieth century have often been denied science jobs, been harassed and ignored when they do participate in science occupations, and sacrificed their desired family lives because of the structure of science jobs (Wasserman, 2000) . International organizations like UNESCO have stressed the ongoing need for careful gender analyses of access to science (United Nations DAW, 2010) . Surveys like the Trends in Math and Science Study (TIMSS) and the Program for International Student Assessment (PISA) provide valuable cross-national data on math and science scores and literacy for boys and girls in the early part of the science education pipeline (TIMSS, 2015; NCES, 2015) . Some reports show the gender gap narrowing cross-nationally on these math and science indicators that reflect achievement through the high school years (Hayward &Goh, 2016) . Young women's access to higher education has also expanded worldwide but women remain under-represented in science degrees (World Economic Forum, 2016; Bradley & Charles, 2003; Charles and change to & Bradley, 2009; Dekkers & van Langen, 2005) . Data on women's access to science occupations show that there has been less progress here (Stuit, 2015; UNESCO, 2015a; Rees, 2010) . Research examining equity in science at all levels of the science pipeline shows that although women are under-represented in science systems worldwide, some countries have been more successful in creating gender equity than others. For example, countries noted for their progress include New Zealand, Iceland, Finland, Albania, and Thailand (UNESCO, 2015a, b; Rubelien, 2013; Rubin, 2014; Dekkers & van Langen, 2005; Bradley & Charles, 2003; Charles & Bradley, 2009; Rees, 2010) .\nAlthough there is no integrated data set on gender equity in science across the science pipeline, a 2007 report by the United Nations (UNESCO, 2007) provides valuable insights on cross-national trends in gender inequity in science and technology education and occupations. The report suggests that issues like poverty and enrollment rates in school are some of the country level factors that influence gender disparities in science and technology education and occupations. In early education, there are few gender differences in math scores but slight differences in science scores. At the tertiary level of education, on the other hand, data reviewed in the report suggest that gender disparities in science and engineering are high. Women represent less than 45 percent of university graduates in science and engineering fields, and the vast majority of the countries examined (85 percent) had not achieved gender parity at this level. Women's participation in certain areas such a physics and engineering at the tertiary level is persistently low globally. The report provides less detail on occupations, but notes the under-representation of women in science/technology employment and their concentration in lower level science/technology occupations. Estimates on women as a share of researchers show that gender parity has been achieved in only 17 percent of countries. Regions including Latin America and the Caribbean show higher parity here than most other regions. The report shows variation in the extent of the under-representation of women in science/technology occupations and concludes that the explanations for this shortage are complex.\nThe UNESCO report (2007) notes the incompleteness of cross-national data on gender and science, the importance of developing all science talent, and the millennial goals regarding gender and science. The UNESCO report encourages researchers to collect this critical data on gender and science as it will provide needed resources for countries and organizations working for gender equity. The goal of our research is to bring together current data on gender equity in science education and occupations so that patterns and exemplary systems can be observed in the context of broader political and socio-economic characteristics. A second goal of this paper is to suggest mapping as a valuable technique for examining these science patterns."}, {"section_title": "Conceptual background: Variation in Gender Equity in Science by Political and Socio-Economic Country Characteristics", "text": "Just as level of gender equality varies by country, so do the causes and consequences of gender equality. Charles' (1992; 1995; 2003; 2009) conceptual and empirical work on gender equity and equity in science has been instrumental in showing the import of economic, political, and cultural characteristics on gender opportunity systems at the country level. Guiso and colleagues (2008) show that the gender gap in math is larger in countries where there is greater gender equality and Else-Quest et al. (2010) find that gender equality in math is tied to gender equality in school enrollment, women's share of research jobs, and women's representation in Parliament. Bradley and Charles provide evidence that gender typing in field of study is more pronounced in economically advanced countries (Charles & Bradley, 2009) . Cultural ideologies and social traditions involving gender have also been shown to affect gender equity in science globally (Bradley & Charles, 2003; Charles & Bradley, 2009; Dekkers & van Langen, 2005) . In this paper, we argue that gender equality in science education and occupations is a key component in gender equality systems. Although there is little conceptual development on the topic, the limited research suggests inequality in science is related to broader gender inequalities and also influenced by key macro structures involved in political and socio-economic contexts (Charles, 2011; Bradley & Charles, 2003; Charles & Bradley, 2009; Dekkers & van Langen, 2005; Else-Quest et al., 2010; Hanson et al., 1996) . In general, when countries have more equitable systems of opportunity with women represented in key structures, it is not just women's status that is affected but larger equities also follow including those involving families and children (UNWomen, 2017). Our macro, country level focus along with the social justice perspective suggest the value of a spatial justice approach to examining cross-national gender variation in science equity. The notion of spatial justice suggests that human societies and inequities are organized through space and stresses the importance of a geographic lens (Harvey, 1973; Soja, 2010) .\nSome organizations are beginning to understand that there is an economic cost to this gender inequality in science. The U.S. State Department, World Bank, and other national and international organizations are increasing their support of programs that work to create more women scientists. They argue that improving women's educational opportunities will spur economic growth and innovation (AAAS, 2010) . Our research involves an examination of gender and science within the context of a framework that argues science opportunity systems work at the country level in the context of political, social, and economic systems. Thus, our approach is a spatial one and our findings have implications for disadvantages in science being spatially located. We recommend mapping as a strategy to implement this geographic perspective. The data provided here will aid in moving forward in that direction. In order to provide additional motivation for mapping gender and science cross-nationally, we provide a sample map and some unique insights and advantages to understanding gender in the context of place."}, {"section_title": "Method", "text": "The research questions examined here involve global patterns of gender equality in science. The questions are addressed by examining country level indicators of gender equity in access to science education and occupations as well as country level political and socio-economic characteristics. As with all cross-country analyses, our examination of country-level measures of science and country characteristics is limited by the fact that data is not available for all countries across all variables. On some measures (e.g. percent female in science field of study collected by UNESCO), it is the Organization for Economic Cooperation and Development (OECD) member countries that have the most complete data. On other measures (e.g. on access to bank loans collected by OECD) it is OECD partner countries that are the best represented. Finally, on some measures (e.g. UNESCO's measure of GNP) a majority of countries have data. In general, our measures of gender equity in science are the most complete for the OECD member countries. Given this and the general availability as indicated by OECD member or partner countries, the organization of countries in our tables is by OECD status. Our tables looking at cross-country data first list OECD member countries, followed by the reporting partner countries. For all measures, we use the most recent data available. For each measure discussed, our conclusions are limited to the countries for which data are available. This research is descriptive in nature. Our goal is to provide -for the first time -the most recent global data on girls and women's access to science with multiple measures and in the context of cross-national variation on political and socio-economic characteristics. The data collected in this paper come from multiple sources and this culmination of diverse data in one location is unique. Like other reports that gather diverse data on topics of global gender inequality (e.g., United Nations Development Programme's Human Development Reports, 2016) the data cannot be manipulated for analyses showing correlation or causation. When information on statistical significance is available (e.g. for male/female difference in science scores and science literacy), it is provided.\nIn order to better view the patterns of gender equity, we provide figures showing countries scoring highest and lowest on the science outcomes and on some of the socio-economic and political country characteristics. At the end of the findings section, we provide an example of a map that uses the cross-national data from 2012 to show spatial patterns of gender equity in science occupations along with a number of country characteristics. The mapping software used here is Geographic Information Systems (GIS), which allows the examination of social processes by attributing data on percent female in science and technology occupations, percent female in Parliament, and level of GNP to specific geographic areas. Multiple variables can be shown in a single map, thus revealing patterns that otherwise might remain obscured."}, {"section_title": "Measures of Gender Equity in Access to Science", "text": "We examine four measures of gender access to science across countries at various points in the science pipeline. These include gender differences in science achievement scores of eight grade students, gender differences in science literacy scores of 15-year-old students, percent female participation in post-secondary science field of study, and percent female in science and technology occupations.\nWe examine male/female differences in science achievement scores for eight grade students collected in 2015 by the Trends in International Mathematics and Science Study (TIMSS, 2015) . TIMSS administers comprehensive assessments of student achievement of fourth and eighth graders across countries every four years (twelfth grade students were also assessed in the mo st recent TIMSS). TIMSS was first conducted in 1995, and in the 2015 study, more than 60 diverse countries participated. The TIMSS science scores used here are intended to measure the extent to which students have learned the science curricula in their country. TIMSS data were collected in some (but not all) OECD member and partner countries.\nWe also examine the gender difference in science literacy scores among 15-year-old students. By examining the gender difference in science literacy among young adults in the science pipeline, we are able to measure \"the ability to think scientifically and to use scientific knowledge and processes to both understand the world around us and to participate in decisions that affect it,\" (Australian Council for Educational Research 2014). This 2015 measure collected by OECD's Programme for International Student Assessment's (PISA) allows us to examine the male/female difference score to indicate whether males or females rank higher in science literacy. PISA is an international assessment administered every three years. In 2015, 72 countries and economies participated as partners in PISA and the data are available for most of the OECD member countries and partner countries (NCES, 2015) .\nOur third measure of gender and access to science education involves percent female participation in science as field of study (tertiary or post-secondary) in the school year ending in 2011. The United Nations Educational, Scientific and Cultural Organization (UNESCO) collected this international measure in 2011 (with the exception of Singapore and Kazakhstan where data were collected in 2012). This data is available for the OECD member countries but few others.\nFinally, we examine gender access to science occupations by considering country-level variation in the representation of women in science and technology occupations. The measure used here is available from the European Commission's statistical database -Eurostat. It provides data for most OECD member (and some partner) countries on percent female in occupations that involve a degree or qualifications in science in 2012."}, {"section_title": "Measures of Socio-Economic Country Characteristics", "text": "Our research also focuses on cross-country gender differences in science education and occupations in the context of country level socio-economic and political characteristics. We examine six socio-economic and political characteristics of countries. These include three economic measures (GNP per capita, women's access to land, and women's access to bank loans); one political measure (percentage of women in Parliament); and two socio-cultural measures --laws prohibiting domestic violence against women and the Gender Inequality Index (GII). The GNP, Parliament, and GII data are available for all OECD member and partner countries. The other measures are primarily available for OECD partner countries."}, {"section_title": "Economic Characteristics", "text": "We use GNP per capita in current U.S. dollars --collected in 2015 by UNESCO for OECD (and most reporting partner) countries. Women's access to land and bank loans are measures originating from OECD collected in 2012. The indicators for these economic characteristics are measured on a 0 to 1 scale, '0' indicated full access to land/bank loans, and '1' indicated no access to land/bank loans. Thus, a score closer to zero indicates greater economic equality among women. These measures are available for some reporting partner countries -but not OECD countries."}, {"section_title": "Political Characteristics", "text": "We also examine percent female in lower or single house of Parliament. The Inter-Parliamentary Union (IPU) collected the women in Parliament measure in 2017 (Inter-Parliamentary Union, 2017). The data is available for most OECD (and reporting partner) countries."}, {"section_title": "Social/Cultural Characteristics", "text": "Several measures of social and cultural equity for women were also examined. One of the measures involves domestic violence against women. The data were collected by OECD in 2012 from over 100 non-OECD countries and indicate whether there is legislation that protects women from domestic violence. A score of '0' indicates that there is legislation protecting women from domestic violence, and a score of '1' indicates that there is no legislation protecting women from domestic violence.\nFinally, our research includes 2015 data on the Gender Inequality Index (GII), created by the United Nations Development Programme for 159 countries (including most OECD and many non-OECD countries). The GII is an inequality index that measures gender inequalities in three critical areas of human development-reproductive health (maternal mortality ratio and adolescent birth rates); empowerment (proportion of parliamentary seats occupied by females and proportion of adult females and males aged 25 years and older with at least some secondary education); and economic status (labor force participation rate of female and male populations aged 15 years and older). The GII is designed to measure differences in men and women's achievements and the human development costs of gender inequality. The value of the index varies from 0 to 1 with 1 being the most inequality. Higher GII values reveal larger disparities between females and males and more loss to human development."}, {"section_title": "Results", "text": "We first examine girl's (and women's) access to science education and occupations. We then examine a number of socio-economic and political country characteristics and their overlap with access of girls and women to science education and occupations. Data for gender access to science and for country characteristics are presented in Table 1 . The countries ranking the highest and lowest on science equity variables and on country characteristics are shown in Figure 1 . "}, {"section_title": "Gender and Science Access Cross-Nationally", "text": "Data in the first column of Table 1 show male-female difference in average science scores for eighth grade students. Even though TIMSS is the main source of data on science scores across countries, science scores in Table 1 reveal the difficulty (noted in the Methods section) in reporting scores for all countries. The findings show that for co untries that have TIMSS measures in our table, a majority have either no significant difference in scores or a female advantage. There are only five countries with a significant male advantage; these include Hungary, Chile, Hong Kong, Italy, and the United States. Figure 1a shows the countries with the largest male advantage as well as the countries with the largest female advantage on science scores. In the latter category are Jordan, Dubai, Qatar, and Thailand. Young women have a significant advantage of up to 41 points on the science score in these countries. Table 1 also shows male/female difference in science literacy for 15-year olds (PISA scores). The locations with the largest significant male advantage on science literacy include Austria, Italy, Chile, Argentina (Buenos Aires) and Japan. As shown in Table 1 and Figure 1b , the countries with the highest scores for females on this indicator include Jordan, Dubai, Albania, and Qatar. Data in Figure 1b show that young women have a significant advantage of up to 39 points on the science literacy score in these countries. The next indicator of girls' access to science presented in Table 1 measures percent female in science field of study at the tertiary level. With only a few exceptions, women are a minority in tertiary science programs. Figure 1c shows the lowest access for girls at this level is in Japan, Chile, Netherlands, and Macao-China. The countries where girls have the highest access at this level include Kazakhstan, Tunisia, Thailand, Azerbaijan, and Romania. The data in Figure 1c show that young women make up as much as 65 percent of the students in tertiary science field of study in these countries.\nFinally, we look at percent female in science and technology occupations in the fourth column of Table 1 . For every country examined here, the representation of women goes down between tertiary science programs and science occupations. Women are consistently a minority of the science labor market and they rarely make up more than a quarter of scientists. As shown in Figure 1d , the countries where women have the lowest representation in science and technology occupations include Turkey, Greece, Dubai, and Romania. The science and technology labor force is only 4.9 percent female in Turkey. The countries where women have the highest representation in these occupations include Iceland, Luxembourg, Sweden, and Denmark. Note that although there was overlap on the countries doing the best on girl's education (science scores, science literacy, and field of study), the countries doing the best on women's representation in science and technology occupations do not overlap with those doing the best in the education system."}, {"section_title": "Country Characteristics and Science Access", "text": "Finally, we examine gender equity in science in the context of cross-country gender differences on socio-economic and political characteristics. With regard to economic characteristics, the six countries/systems that have the highest GNP per capita in Table 1 are Qatar, Luxembourg, Dubai, Norway, Switzerland, and Hong Kong. Nine countries having the lowest GNP per capita include: Argentina, Indonesia, Jordan, Tunisia, Albania, Peru, Serbia, Columbia, and Thailand (four countries on each extreme are shown in Figure 1e ). Most of these countries have science literacy data and most have data on field of study. A few of these countries have TIMSS science scores. Note that only two of the high GNP countries (Qatar and Dubai) are included in those where girls are doing better than boys on science scores and science literacy scores. Also, note that one of the low GNP countries (Jordan) is among those with the highest male advantage on both science scores. However, Hong Kong is among the higher GNP per capita countries/systems and has one of the higher male advantages on science scores. Two countries with female advantage on the science scores are among the lower GNP per capita countries (e.g., Thailand and Jordan). Countries with the highest female advantage on science literacy are also not among the six highest on the GNP list. In fact, Albania and Jordan are among the low GNP countries but score high here.\nLower GNP countries are also more likely to have higher percent female in science field of study (e.g., Tunisia and Thailand). None of the six countries we listed as highest GNP are among those with highest percent female in science field of study. Countries that have the fewest women in science field of study (Macao -China, Netherlands, and Chile) are not among the highest or lowest GNP countries.\nPatterns on percent female in science and technology occupations, shown in Figure 1d show mixed support for a positive relationship between high GNP and high representation of women in these occupations. Luxembourg is a high GNP country that also has a high percent of women in science and technology occupations. On the other hand, Dubai is among the highest GNP countries and ranks among the lowest on its female science/technology labor force.\nWith regard to the measure of women's access to political systems, figures in Table 1 also show percent female in Parliament (or lower house). As shown in Figure 1f , the countries with the highest percent female in the lower house (Parliament) include Iceland, Sweden, Mexico, and Spain. In a similar pattern as was shown with GNP, none of these countries with larger numbers of women in Parliament are doing the best on girls' science scores, science literacy, and access to science field of study. In fact, Qatar and Thailand score among the lowest on the percent women in Parliament variable but are ranked among the highest on several measures of gender equity in science education. As with the pattern for GNP, the percent women in Parliament is a better predictor of gender equity in the later part of the science pipeline. Countries like Sweden and Iceland with more women in Parliament are also the countries where women have higher representation in science and technology occupations.\nAlthough two economic measures of gender equity (access to land and bank loans) were not collected for the OECD countries, they are available for some of the partner countries as shown in Table 1 . Women have full access to land and bank loans in many of the reporting countries, but there are a number of countries that score lower on these indicators. Countries like Albania, Azerbaijan, Brazil, Columbia, Dubai, Jordan, Kyrgyzstan, and Thailand have lower scores on women's access to both land and bank loans. Interestingly, Jordan and Albania were two of the six countries where girls scored the highest on science literacy and Jordan and Thailand were top countries for girls having high 8 th grade science scores. A limited number of countries with information on access to land and bank loans had informat ion on girl's (women's) representation in tertiary science education. Countries like Kazakhstan and Azerbaijan have high numbers of women in tertiary science programs but do not provide women full access to land. Women do have full access to bank loans in Kazakhstan. There is little data on science occupations for countries with information on women's access to land and bank loans.\nTwo country measures that deal with social and cultural gender equity -domestic violence against women and the Gender Inequality Index are in the final two columns of Table 1 . Many OECD partner countries have scores of .5 or higher on the scale measuring absence of legislation on domestic violence against women (e.g. Dubai, Albania, Hong Kong, Indonesia, Jordan, Romania, and Uruguay). Although Jordan does not do well on legislation against women's violence, they are among the countries with the highest female scores on science and science literacy. Girls also score high on science literacy in Albania.\nCountry data on the GII index are provided in the far right column of Table 1 . As shown in Figure 1g , the countries with the lowest score (and thus highest gender equality) on the GII index include Switzerland, Netherlands, Sweden, and Iceland. These countries are not included among those with higher science scores, literacy, or women in science field of study but they are all high on percent women in science and technology occupations (especially Iceland and Sweden). Qatar has the highest inequality score among the countries examined here. As noted earlier, gender differences in Qatar on science scores and science literacy are more favorable for females than in most other countries."}, {"section_title": "A Suggestion for Future Research: Mapping", "text": "Given the spatial patterns shown in our analysis and our earlier arguments about the advantage of taking a geographic approach to understanding patterns of gender inequity in science, we provide a sample map. The data provided in this research can be used for mapping by social scientists and geographers to further understand patterns of gender equity. In the map below we show percent female in science and technology occupations for European countries. Larger circles represent more women scientists. Two country characteristics are also shown with darker shading symbolizing more women in Parliament and with cross-hatching on the countries with the highest GNP. The four highest GNP countries in Europe (Norway, Sweden, Denmark, and Switzerland) have high levels of women scientists. Note, however, that high GNP is not a necessary condition for having more women in the science labor force since many countries in Europe that do not have the highest GNP also have a good number of women in the science labor force (e.g., Germany, Netherlands, and Luxembourg). The relationship between women in Parliament and women in science occupations is also shown in the map with many countries that have more equity in Parliament also having more equity in science and technology occupations (e.g. the Scandinavian countries and a group of countries in middle Europe including Germany, Netherlands, Luxembourg). However, sometimes countries such as Spain with higher percent women in Parliament (have the lowest percent of women scientists. Note that Spain and Portugal have similar low rates o n women in the science labor force but diverging characteristics on women in Parliament with Spain having a higher percent. No country with light green shading (representing low numbers of women in Parliament) ranks among the highest on women in science and technology occupations. The visualization of patterns of equity and country characteristics in Europe aids in understanding the complexity of conditions for science equity and is recommended as a path for future researchers. The extensive data on gender, science, and country characteristics provided here will aid in these future mapping efforts, not just to understand the gender inequities but also to reflect on the intersection between spatial justice, gender inequities, and science."}, {"section_title": "Discussion", "text": "The goal of this research was to integrate cross-national secondary data on diverse areas of science equity and examine the gender gaps in equity across countries. It is hoped that a global examination of gender equity in science education and occupations across countries with diverse political and socio-economic characteristics will lend insights and solutions for resolving ongoing gender inequity in science.\nThe data of interest involve country-level measures of gender equality in science experiences at various stages in the science pipeline as well as multiple country characteristics. Findings show that there is a male advantage in science in many countries. Gender equity is greatest in early science scores and literacy, but girls and women have lower representation at each stage in the science pipeline. Countries where girls do the best on early science education include Turkey, Jordan, and Thailand. Countries with higher scores for girls on access to science education are not the same countries that have more women in science and technology occupations. Women have the highest representation in science and technology occupations include Iceland, Luxembourg, Sweden, and Denmark.\nCountries with high GNP per capital, more women in Parliament, and lower scores on the Gender Inequality Index are often (but not always) the places where science labor markets have more women. However, it is countries scoring low on these political and socio-economic characteristics that have more gender equity in science education. An examination of access to land and bank loans across countries reveals a striking overlap between those countries that score low on women's access to land and bank loans, and countries where girls scored high on science literacy.\nFindings from this paper on gender equity in science cross-nationally suggest ongoing inequality, especially in the later sections of the science pipeline. Many countries have been implementing new initiatives in an effort to reverse these trends. For example, Finland is making an effort to take gender bias out of STEM textbooks (Rubin, 2014) . Other initiatives include pre-college initiative programs for girls in Ghana (Akwei, 2016 ) and a long-term policy focus on gender equity in education and labor markets in Indonesia and Malaysia (UNESCO, 2015b).\nOur findings on patterns of equity in science cross-nationally are consistent with the complexities of macro-level processes suggested by Charles in her research on gender inequality. Simple assumptions about level of economic development (and other economic indicators) and gender equality are often misleading (Charles 1992; 2003) . Similarly, assumptions about level of economic development and gender equity in science are inaccurate (Charles & Bradley, 2009 ).\nThere are a number of limitations to our research. One limitation involved in using international data sets is that data are available for some, but not all countries. Additionally, the data presented here are descriptive. They come from multiple data sets and cannot be combined for causal analyses. Finally, we are limited in not having data on all country-level characteristics that might be relevant for equity in science. We suggest that indicators of culture and ideology are important in understanding gender inequity. These variables are seldom measured in data collection efforts and should be considered in future data collection and research.\nRobert Park (1926) and the Chicago School suggested that spatial patterns reflect social relations and historically, social scientists have argued that social variables (such as race, gender, inequality, and achievement) are often geographically clustered (Entwisle et al., 1994; Holloway, 1998; Stoll et al., 2000) . Geographers note that these spatially based inequities should be viewed through a spatial justice approach (Harvey, 1973; Soja, 2010) . Our macro-level cross-country look at patterns of gender inequity in science education and occupations acknowledges the potential for viewing patterns by region and by political and socio-economic characteristics of countries. It is argued that geographic mapping provides considerable potential in further understanding these spatial patterns and furthering social and spatial justice.\nThe United Nations and other international organizations have noted the fast pace at which the science and technology sector is growing and the parallel need for developing all science talent. In their report on science, technology and gender, UNESCO (2007) suggests it is urgent that we study the status and experiences of women in science and establish an information system that provides indicators of equity as well as the conditions that lend to it. We have argued here that it is larger structures that affect opportunities in science. Global economic growth and security depend on progress in science and all are dependent on diversity and equity. Diversity and social justice make us smarter (Phillips, 2014; Hanson, 2012) . It is hoped that the country level indicators of gender equity in access to science as well as political and socio-economic characteristics provided here will contribute to research, knowledge, policies, and programs that facilitate greater gender equity in science."}]