[{"section_title": "", "text": "with aging and, therefore, reducing intake and circulating levels of AGEs may promote healthy aging and greater longevity. In support of this view, we report evidence that is emerging from in vitro studies, animal models, clinical and pathological studies, epidemiological cohort studies of aging, and clinical trials. The number of scientific publications on AGEs have been increasing astronomically in the past decade. In the decades of the 1970s, 1980s, 1990s, and 2000s, the number of articles on AGEs listed on PubMed was 0, 21, 978, and >3700, respectively. This review highlights recent work on AGEs and aging and is a synthesis that attempts to bridge molecular and cellular advances with recent epidemiological observations on AGEs and aging, rather than a systematic review. We identify controversies in the field and current barriers to progress in the field, and we suggest studies that will help further insight in the role of AGEs in aging."}, {"section_title": "Historical Background", "text": "Reducing sugars such as glucose react with amino groups in proteins, lipids, and nucleic acids through a series of reactions forming Schiff bases and Amadori products to produce AGEs (2) . This process was first described by Louis Camille Maillard (1878 Maillard ( -1936 in 1912 when it was noted that amino acids heated in the presence of reducing sugars produced a characteristic yellow-brown color responsible for the \"browning\" of foods (3) . The Maillard reaction, as it later became known, was originally studied in relation to the color, flavor, and tastes of foods (2) . Only in the 1970s it was recognized that the Maillard reaction occurs slowly in vivo, a process generally termed glycation (4, 5) . In the late 1970s, researchers began to understand that late-stage Maillard processes mediated the complications of diabetes and some of the tissue modifications that occur with aging (6) . Glycation refers to the process of Amadori product formation (which includes glycated hemoglobin, hemoglobin A 1C ), and the later stage of complex cross-links formed from glycated proteins in the Maillard reaction are known as AGEs (5) . AGEs constitute a heterogeneous group of compounds of which about 20 have been elucidated to date. Major AGEs include hydroimidazolone, Ne-carboxymethyl-lysine (CML), pentosidine, and glucosepane ( Figure 1 ).\nAGEs are formed continuously in the human body and the rate of formation is accelerated in diabetes. It was originally thought that glycation of macromolecules marked senescent molecules for subsequent degradation by macrophages, and that the receptors binding AGEs were scavengers involved in AGE disposal and cell regeneration (7) . However, when the receptor for AGEs (RAGE) was cloned and characterized in 1992 (8) , it became clear that binding of AGEs to RAGE did not accelerate the clearance and degradation of AGEs but instead induced sustained postreceptor signaling, including Figure 1 . Formation of advanced glycation end products. Nonenzymatic reactions of the carbonyl groups of reducing sugars with primary amino groups of proteins produce corresponding Schiff bases, which undergo Amadori rearrangement to give ketoamines. Further glycoxidations and auto-oxidations yield highly reactive carbonyl compounds, which react with protein amino groups forming a variety of AGEs such as carboxymethyl-lysine and hydroimidazolone.\nactivation of the nuclear factor-kappa B NF-kB pathway and MAP kinases, with prolonged cellular dysfunction and localized tissue destruction (7) .\nIn the early 1990s, controlled animal experiments showed that intravenous administration of exogenous AGE-modified albumin to rats and rabbits for 2-4 weeks resulted in vascular complications resembling those seen with diabetes or aging, such as increased vascular permeability and elevated mononuclear cell migratory activity in subendothelial and periarteriolar spaces of liver, kidney, and skeletal muscle (9) . At the time, the importance of food as an exogenous source of AGEs was largely dismissed due to the presumed poor absorption of AGEs (5). However, in 1997, Koschinsky and colleagues demonstrated that ~10% of dietary AGEs are absorbed in humans (10) . Controlled studies conducted in humans within the past decade provided evidence suggesting that diet is a source of exposure to AGEs. Most clinical studies have focused on AGEs in patients with diabetes and end-stage renal disease. Our own studies over the past 2 years have expanded these investigations into population-based cohorts of aging in the United States and Europe. These epidemiological studies suggest that older adults with elevated circulating CML, a well-characterized AGE, are at greater risk for arterial stiffness (11), chronic kidney disease (12) (13) (14) , anemia (15, 16) , poor skeletal muscle strength (17) and physical performance (18) , and cardiovascular and allcause mortality (19, 20) ."}, {"section_title": "Evidence for a Role of AGEs in Aging", "text": "We postulate that if AGEs' accumulation contributes to aging \"acceleration,\" several conditions should be met. Many, but not all the conditions, we will set forth have formally tested and confirmed at the present time. First, there should be plausible biological mechanisms for the harmful effects of AGEs on tissues and cells as demonstrated by molecular, in vitro, and animal studies. Second, epidemiological studies should show that most individuals are exposed to AGEs. Third, the degree of exposure should be related to the risk of decline in multiple organ systems and with survival. The relationship of AGEs with disease and longevity should be consistent with social, demographic, and behavioral factors in the population. Animal and human studies should show that the reduction of the exposure to AGEs through restricting the dietary intake of AGEs should have a positive impact on phenotypes that are typical of aging. Pharmacological intervention with AGE inhibitors or AGE breakers should also reduce impaired organ function and disease. Finally, interventions to reduce AGEs, whether dietary, pharmacological, or both, should increase longevity."}, {"section_title": "Biological Mechanisms for the Harmful Effects of AGEs", "text": "AGEs form covalent cross-links with proteins, increase oxidative stress, and upregulate inflammation. Proteins that constitute the extracellular matrix and vascular basement membrane are among the longest lived and most susceptible to AGE modification (21, 22) . Human aging is associated with a stiffening of tissues that are rich in extracellular matrices and long-lived proteins, such as skeletal muscle, tendons, joints, bone, heart, arteries, lung, skin, and lens (23) . Glucosepane appears to be the most important cross-linking AGE in human tissues, and other cross-linking AGEs include methylglyoxal lysine dimer and pentosidine (23) . Crosslinking of collagen and other proteins by AGEs affects the mechanical properties of tissues, especially of the vasculature. The cross-links formed by AGEs in the aorta, carotid, and other conduit arteries increases the stiffness of the arteries, reducing the buffering function of the conduit arteries near the heart and increasing pulse wave velocity, both of which increase systolic and pulse pressure (24) .\nAGEs increase oxidative stress and inflammation through binding with the receptor for advanced glycation end products (RAGE) (25) . RAGE is a multiligand member of the immunoglobulin superfamily of cell-surface molecules that is widely expressed in tissues. RAGE is most abundant in heart, lung, and skeletal muscle. The RAGE signaling pathway can be initiated by a diverse repertoire of proinflammatory ligands that include AGEs, S100/calgranulins, amphoterin, and amyloid-b peptide (25) . The CML adduct of AGEs has been identified as a signal-transducing ligand for RAGE (26) . Ligand binding with RAGE triggers the induction of increased reactive oxygen species, activates NADPH oxidase, increases expression of adhesion molecules, and upregulates inflammation through NF-kB and other signaling pathways ( Figure 2 ) (27) . Inflammatory mediators that are upregulated through AGE and the NF-kB pathway include tumor necrosis factor a, interleukin-6, and C-reactive protein (25) . The RAGE promoter contains NFkB sites that are involved in the regulation of RAGE expression. Activation of NF-kB results in increased RAGE expression, thereby prolonging NF-kB activation. RAGE expression occurs in an inducible manner and is upregulated at sites where its ligands accumulate (25) . Sustained RAGE expression by smooth muscle cells, endothelium, mononuclear cells, and other cells in proximity to their ligands leads to chronic activation of inflammation and tissue damage."}, {"section_title": "Exposure to AGEs is Common", "text": "In food analyses, CML has been the most widely used marker for AGEs (28, 29) . The CML content of the same food item can be increased up to 200-fold by increasing the temperature and conditions used in cooking. The CML concentrations of various foods vary widely from about 0.35-0.37 mg CML/kg food for pasteurized skimmed milk and butter to about 11 mg CML/kg food for fried minced beef and 37 mg CML/kg food for white bread crust, as shown in Figure 3 . Fried meat, sausage, and cookies are high in CML by guest on http://biomedgerontology.oxfordjournals.org/ Downloaded from (29, 30) . Other foods that are high in AGEs include many commercial breakfast cereals (31), roasted nuts and seeds (32) , ice cream (33) , and barbecue sauces (34) . High concentrations of methylglyoxal, an intermediate product of the Maillard reaction, are found in commercial soft drinks that contain high fructose corn syrup (35) . Methylglyoxal is reactive and readily modifies lysine or arginine residues of proteins to form carboxyethyllysine and hydroimidazolones (29) . Pasteurized milk and sterilized milk contain much higher CML concentrations than raw milk (36) . Evaporated whole milk contains high concentrations of CML, probably due to the high temperatures used in processing the milk (29) . Infant formula contains high concentrations of AGEs (37) . Commercial infant formulas contain a 70-fold higher level of CML than human breast milk, and infants fed infant formula had significantly high plasma CML than breast-fed infants (38) . Foods that are either eaten raw or cooked at lower temperatures are relatively low in AGEs, and such foods include raw fruits and vegetables, raw fish, raw nuts, yoghurt, tofu, pasta, boiled rice, boiled potatoes, and other boiled or simmered foods."}, {"section_title": "AGEs Play a Role in the Pathogenesis of Diseases Across Different Organ Systems", "text": "AGEs affect virtually every tissue in the body. The effect of AGEs on different organ systems is summarized in Figure 4 . There is increasing evidence from pathological and epidemiological studies that exposure to AGEs is related to the risk of adverse aging-related outcomes and with survival."}, {"section_title": "Brain", "text": "AGEs accumulate in the human brain with increasing age (39) and are found in neurofibrillary tangles and senile plaques in patients with Alzheimer's disease (40) . In older adults with cerebrovascular disease, elevated CML was found in cortical neurons and cerebral vessels and was related to the severity of cognitive impairment (41) . Diabetic patients are at higher risk of developing Alzheimer's disease, and greater deposition of AGEs and upregulation of RAGE was found in the brains of diabetic patients with Alzheimer's disease (42) ."}, {"section_title": "Eye", "text": "AGEs accumulate in the lens and the retina with aging. Crystallins, the major structural proteins of the lens that account for transparency, are susceptible to glycation and AGE cross-linking (43) . Human cataractous lenses had higher levels of CML, pentosidine, and imidazolone compared with clear lenses (44) . High serum AGE concentrations were found in diabetic and nondiabetic older adults with cataract (45) . Both CML and RAGE were present in the pathological lesions of age-related macular degeneration (46) . Older adults with age-related macular degeneration had higher plasma CML and pentosidine compared with normal controls (47) ."}, {"section_title": "Cardiovascular System", "text": "There is strong evidence for a role of AGEs in atherosclerosis (48) . With aging, AGEs are deposited in arterial walls, especially the elastic membrane and intimal extracellular Figure 2 . Model for advanced glycation end products-receptors of receptor for advanced glycation end products (RAGE) interactions. Activated RAGE upregulates inflammatory cytokines, adhesion molecules, and its own receptors via NF-kB. matrix, and the process appears to be accelerated in diabetes. Atherosclerotic lesions contain high concentrations of AGEs (49) . AGEs form cross-links with matrix proteins in the wall of blood vessels, reducing elasticity and promoting vessel rigidity. AGEs alter the functional properties of important matrix molecules such as type IV collagen and laminin. Cross-linking of AGEs with type IV collagen from the basement membrane inhibits the association of these molecules into a normal complex network-like structure (48) . AGEs on collagen form covalent cross-links with low-density lipoprotein (LDL) and soluble immunoglobulins, entrapping them in the subendothelium. AGEs increase the susceptibility of LDL to oxidation and enhance monocyte migration across endothelial cells (48) . Vascular endothelium expresses RAGE. RAGE contributes to the diffuse accumulation of AGEs in the subendothelial space (50), initiates increased vascular permeability, increased migration of macrophages and T-lymphocytes into the intima, and impaired endotheliumdependent arterial relaxation (48) . Interaction of AGEs with endothelial surface RAGE induces the generation of reactive oxygen species (51) and induction of adhesion molecules and proinflammatory cytokines (25, 48) .\nAging is associated with increased deposition of AGEs and increased expression of RAGE in the myocardium (52) . In diabetic patients with heart failure, cardiac stiffness is associated with myocardial AGE deposition (53) . Patients with diabetes have higher serum AGE concentrations compared with healthy controls (54) . In patients with type 1 diabetes, elevated serum or plasma AGEs were associated with microvascular complications (55), increased arterial stiffness (56) , and left ventricular diastolic function (57) . In type 1 diabetes, heart failure was linked to coronary atherosclerosis, poor glycemic control, and elevated AGEs (58) . In patients with type 2 diabetes, elevated serum AGEs Figure 3 . Carboxymethyl-lysine content of selected dairy products, bread, and meat using liquid chromatography-mass spectrometry. Adapted from Assar and colleagues (29) .\nby guest on http://biomedgerontology.oxfordjournals.org/ Downloaded from were associated with severity of coronary artery disease (54, 59 ) and microangiopathy (54) .\nElevated serum AGEs have been described in patients with coronary artery disease (60) . Serum AGEs were associated with aortic stiffness in a study of 46 middle-aged participants (61) . In a study of 493 adults, aged 26-93 years, from the Baltimore Longitudinal Study of Aging, elevated serum CML levels were associated with increased arterial stiffness (11) . Elevated serum AGEs are an independent risk factor for cardiac events and cardiovascular mortality among patients with heart failure (62) and women with type 2 diabetes (63) . Older disabled women living in the community in Baltimore who had elevated serum CML were at higher risk of cardiovascular mortality (19) . Among adults, 65 years and older, in the InCHIANTI study in Italy, elevated plasma CML was an independent risk factor for both allcause and cardiovascular disease mortality (20) (Figure 5 )."}, {"section_title": "Erythrocytes", "text": "Recent studies suggest that AGEs accumulate in erythrocytes (64) and alter their deformability (65). The decreased deformability induced by AGEs in erythrocytes is reversed by AGE inhibitors (65) . The AGEs on the surface of erythrocytes can bind with RAGE on the vascular endothelium (66) . Elevated serum AGEs were found in anemic patients with type 2 diabetes (67). Communitydwelling adults with higher serum CML were at higher risk of anemia (15, 16) ."}, {"section_title": "Liver", "text": "The liver is a site for clearance and catabolism of circulating AGEs but can also be a target organ for AGEs. There is some evidence that AGE and RAGE play a role in certain liver diseases such as nonalcoholic steatohepatitis and cirrhosis (68) ."}, {"section_title": "Kidney", "text": "AGEs are removed and metabolized by the kidney, but the kidney is also a site for accumulation of AGEs and AGEassociated damage (69) . AGEs have been implicated in the pathogenesis of diabetic nephropathy and complications in patients with end-stage renal disease. AGEs upregulate the synthesis of fibronectin, laminin, and type IV collagen in the kidney, promoting glomerular sclerosis, interstitial fibrosis, and hypertrophy (70) . In humans, both CML and pentosidine accumulate in the expanded mesangial matrix and thickened glomerular capillary walls in early diabetic nephropathy and in nodular lesions and arterial walls in advanced diabetic nephropathy, but are absent in control kidneys (71) .\nThe binding of AGEs with RAGE induces the expression of transforming growth factor-b1, a key mediator of renal fibrogenesis, in proximal tubule cells (71) and induces apoptosis of podocytes (72) . Podocytes are terminally differentiated cells that cover the glomerular basement membrane and constitute an integral part of the glomerular filtration barrier, and these cells have limited capacity to regenerate after injury. Podocyte loss precedes the development of renal dysfunction and albuminuria in diabetics (72) .\nAGEs are markedly elevated in the serum and tissues of patients with end-stage renal disease (69, 73) . Diabetic patients with end-stage renal disease had twice the concentrations of AGE in tissues compared with diabetic patients without renal disease (73) , and serum CML levels were three-to fivefold higher in patients with end-stage renal disease compared with healthy controls (69) . Plasma AGE concentrations were independently associated with impaired renal function among nondiabetic adults (74) . Older disabled women with elevated serum CML had reduced renal function (12) . Elevated CML was associated with chronic kidney disease in community-dwelling men and women, aged 26-93 years (13) . In a large population-based study, older adults with elevated plasma CML had a greater decline of renal function over 6 years of follow-up (14) ."}, {"section_title": "Bone", "text": "Collagen molecules in bone have an exceptionally long lifetime, making them susceptible to AGE modification. Evidence is emerging suggesting that the accumulation of AGEs in bone contributes to disturbed bone modeling and deterioration of bone tissue quality (75) . AGE concentrations increase in cortical and trabecular bone with age and are negatively associated with bone density and mineralization (76) . Accumulation of AGEs in the collagen matrix of bone alters the mechanical properties of bone, increasing stiffness and fragility (77) . Serum AGEs are significantly higher in patients with osteoporosis compared with healthy controls (78) . Elevated serum pentosidine was associated with prevalent vertebral fractures in postmenopausal women with diabetes (79) . In the Health, Aging and Body Composition Study, older adults with elevated urinary pentosidine levels were at an increased risk of developing fractures (80) ."}, {"section_title": "Muscles and Tendons", "text": "Older adults have increased cross-linking of collagen and deposition of AGEs in skeletal muscle (81) . In aging animals, cross-linking of collagen in muscle, tendons, and cartilage is associated with increased muscle stiffness, reduced muscle function, and accumulation of AGEs (81, 82) . AGEs may also play a role in sarcopenia through upregulation of inflammation and endothelial dysfunction in the microcirculation of skeletal muscle through RAGE. AGE-induced cross-linking of collagen elevated in older adults (83) has been shown to increase the stiffness of human articular cartilage (84) . In older community-dwelling adults, elevated circulating CML levels were independently associated with low grip strength (17) and slow walking speed (18). "}, {"section_title": "Social and Cultural Context of AGEs and aging", "text": "Food preparation that involves deep-frying and hightemperature industrial processing is a relatively recent development in the evolutionary timescale for humans. It is a reasonable assumption that the overall content of AGEs in the diet has been increasing over the past few centuries. The average human life span was shorter at a time when there were relatively less AGEs in the diet. In this earlier period, the main determinants of life span were infectious diseases, which were largely related to underlying problems of poor nutrition and hygiene. With improvements in nutrition, hygiene, and public health, people are living longer in developed countries. Through this epidemiological transition, other factors, such as dietary AGEs, may now be affecting the phenotypic manifestations characteristic of the aging process. The possibility of increased longevity may lie in the quality of food, not just the quantity of nutrients.\nRecent food analyses show that exposure to AGEs may occur throughout the life span, including at early ages. Infant formula, which gained increasing popularity in U.S. households in the past several decades, contains high levels of AGEs compared with breast milk (37, 38) . In the United States, the National School Lunch Program was developed over the past century and guaranteed federal funding following World War II to provide basic nutrients to schoolchildren (85) . The program provides AGE-rich foods to schoolchildren such as low-grade meats, processed cheeses, chicken nuggets, and hamburgers (85) . Over the past few decades, the dietary habits of adolescents have changed, with more snacking and consumption of AGE-rich foods in fast food restaurants (86) . The consumption of fast foods that are typically high in AGEs is associated with insulin resistance in young adults (87) and increased risk of diabetes in middle-aged adults (88) . Recently, a communitybased study showed a strong association between fast food restaurants with ischemic stroke in neighborhoods (89) .\nWhether dietary intake of AGEs could account for the health disparities between the rich and the poor and for worse health outcomes for some minority groups is not known. The consumption of AGE-rich foods may be higher among low-income groups because foods such as sodas, crackers, cookies, potato chips, and other highly processed foods are less expensive and more readily available than low-AGE foods such as pure fruit juices, fresh fruit, and vegetables (90) . Geographic analyses show that fast food restaurants are concentrated in black and low-income neighborhoods in the United States (91) and that stores with fewer fruit and vegetable markets are more common in poorer areas. Diet has been implicated in the higher rates of chronic diseases among American Indians. The dietary practices of Native Americans have changed drastically in the past two centuries due to forced relocation and the introduction of high-fat and heavily processed foods under federally subsidized programs. The Navajo Health and Nutrition Survey showed that, unlike traditional foods of southwestern indigenous populations, fry bread, tortillas, home-fried potatoes, bacon, and sausage comprised a large part of the regular diet, whereas fruits and vegetables were consumed less than once per day (92) . In the past two centuries-and particularly since the 1940s-socioeconomically disadvantaged groups, including ethnic minorities in highly segregated regions and neighborhoods, have had a rapid increase of exposure to AGE-rich foods. Given this trend, it is reasonable to speculate that relatively high consumption of AGEs by disadvantaged minorities could contribute to heightened racial/ethnic and socioeconomic disparities in adverse agingrelated outcomes. Further work is needed to distinguish the health risks from dietary AGEs from other risk factors for poor health that are higher in minority populations."}, {"section_title": "Impact of Reducing Exposure To Ages On Aging Phenotypes", "text": "Animal models and small trials in humans show that some of the adverse effects of AGEs upon the cardiovascular and renal systems can be reduced with AGE inhibitors or breakers and by dietary restriction of AGEs. In animal models, treatment with alagebrium (formerly ALT7-111), a thiazolium derivative that can break established AGE cross-links, has been shown to reverse arterial and myocardial stiffness and improve cardiac function (93) and reduce AGE deposition in the kidneys and improve renal function (94) . In phase 2 trials conducted in elderly patients with vascular stiffening, alagebrium improved arterial compliance after 56 days of treatment by about 15% compared with no change in the placebo group (95) . In a study of 23 older patients with diastolic heart failure, alagebrium improved cardiac function and significantly improved the Minnesota Living with Heart Failure total score from 41 to 32 (96) . In a clinical trial involving 690 patients with diabetic nephropathy, aminoguanidine, an AGE inhibitor, inhibited the decline in estimated glomerular filtration rate and increase in proteinuria (97) . Over a 36-month period, serum creatinine doubled in 26% of the placebo-treated patients compared with 20% of the aminoguanidine-treated patients (97) . Pyridoxamine inhibited the increase in serum creatinine and reduced urinary excretion of transforming growth factor-b1 in patients with diabetic nephropathy (98) .\nThe contribution of dietary AGEs to the total pool of AGEs in the body is much greater than the contribution from AGEs that are endogenously generated by abnormal glucose metabolism or lipid oxidation (99) . It has been estimated that humans usually consume 25-75 mg of AGEs per day, mostly as CML and pyrraline (99) . Controlled feeding studies in animals show that about 30% of dietary CML is absorbed into the circulation (100). Whether dietary AGEs have an adverse impact upon human health has not been conclusively demonstrated (101) (102) (103) . There have been a small number of short-term dietary studies which show that AGEs in foods are absorbed during digestion and that a portion of the ingested AGEs are excreted in the urine (104) (105) (106) . Three dietary intervention studies conducted in adults with diabetes suggest that single meals or single oral challenges with high AGE content lead to large postprandial increases in serum AGEs (10, 107) . In adults with type 2 diabetes, a single AGE-rich meal resulted in impaired flow-mediated dilatation, elevated adhesion molecules, and higher levels of a marker for oxidative stress compared with the meal that was low in AGEs (107) . A single oral challenge with a 10-fold concentrate of a cola beverage resulted in impaired flow-mediated dilatation and an increase in serum AGEs at 90 minutes post-challenge (108) . The results of these last three intervention studies have not been independently corroborated. A recent randomized, crossover, diet-controlled intervention trial, conducted in 62 healthy student volunteers, compared the effects of a steamed diet (low in AGEs) with a high heat-treated diet (high in AGEs) (109) . After 1 month, consumption of the high heat-treated diet was associated with higher plasma CML concentrations, reduced insulin sensitivity, and increased plasma cholesterol and triglycerides compared with the steamed diet (109) . The interindividual variability in the absorption of AGEs in humans has not been well studied. This variability could potentially contribute to differences in plasma CML levels and to variability in the aging process. In addition, the amount of absorption of different AGEs found in foods was not been well characterized."}, {"section_title": "Counterpoint and Alternative Explanations", "text": "The original sources of AGEs that have been described in human organs and tissues have not been clearly identified. Whether aging itself affects the dietary absorption of AGEs or production of endogenous AGEs is unknown. Oxidative stress and lipid peroxidation can give rise to AGEs (48); thus, AGEs found in damaged tissues could be markers for oxidative stress and inflammation, rather than an underlying causative factor. Although elevated circulating AGEs are found in patients with decreased renal function, whether elevated AGEs are causally involved in compromised renal function has not been shown conclusively. There are many other substances that do not play a role in kidney disease but are also increased in the circulation when renal function is compromised."}, {"section_title": "Conclusions and Future Directions", "text": "Current evidence from many different disciplines lends strong support to the idea that AGEs contribute to the multisystem decline that occurs with aging. AGEs contribute to inflammation and tissue damage through AGE-RAGE binding. AGEs cross-link collagen and other proteins and thus increase the stiffness of tissues such as the major arteries, heart, bone, and muscle. Histopathological studies show that AGE and RAGE are associated with the lesions of Alzheimer's disease; age-related macular degeneration; atherosclerosis; glomerulosclerosis; and interstitial fibrosis in the kidney, osteoporosis, and sarcopenia. The harmful effects of AGEs on various organs and tissues have been demonstrated in animal models.\nEpidemiological studies show that elevated circulating AGEs are associated with diabetes, age-related macular degeneration, heart disease, arterial stiffness, anemia, chronic kidney disease, bone fractures, low skeletal muscle strength, and poor physical performance. In addition, communitydwelling men and women with elevated AGEs are at higher risk of all-cause and cardiovascular disease mortality. Animal studies and some pilot studies in humans involving small numbers of participants show that reducing the dietary intake of AGEs improves some biomarkers of oxidative stress and markers of vascular function. Further corroboration is needed by different groups on the potential adverse effects of high dietary intake of AGEs on inflammation, oxidative stress, and other outcomes. Clinical trials show that AGE inhibitors slow the decline of renal function and that treatment with AGE breakers improves cardiovascular function.\nScientific understanding is still incomplete with regard to many issues related to AGEs and aging. It is not known whether older community-dwelling adults with elevated serum AGEs have an increased risk of developing Alzheimer's disease, age-related macular degeneration, coronary heart disease, stroke, peripheral artery disease, hip fractures, or chronic kidney disease. AGEs affect the stiffness of tissues, but little work has been done to characterize the relationship of AGEs to pulmonary function and lung stiffness in older adults.\nThe exposure of the general population to AGEs is high because the Western diet is rich in AGEs, but whether dietary AGEs have harmful health effects remains controversial. One major barrier to progress in this field has been the lack of a large reference database of CML in different foods, where CML has been measured using sensitive and accurate measurement techniques such as high-performance liquid chromatography or liquid chromatography-mass spectrometry and where careful preparation of food samples has been conducted to minimize matrix effects. The second major obstacle is the lack of an assessment method for dietary AGEs that has been rigorously validated. An accurate reference database of CML in foods and a validated dietary assessment method would greatly facilitate further epidemiological studies of the relationship of dietary AGEs to health outcomes in different populations. Other gaps in knowledge are the amount of absorption of different dietary AGEs, and stables isotopes could be used to address this question.\nIt is not known whether differences in dietary intake and circulating levels of AGEs contribute to the health disparities in rates of diabetes, renal, and cardiovascular disease in different populations, such as blacks, Hispanics, and American Indians. Further insight into the relationship of AGEs in these risk groups could be provided by comprehensive by guest on http://biomedgerontology.oxfordjournals.org/ Downloaded from investigation in existing cohorts that focus on minority health. The increased susceptibility of blacks, Hispanics, and Asians to diabetes is not well understood. Whether dietary AGEs, genetic differences in the AGE-RAGE pathway, or combination of AGE-related genetic and environmental determinants are involved is unknown. Diets that are high in AGEs, such as fast foods, tend to be high in saturated fats and low in fiber and antioxidants. Further work is needed to disentangle the health risks of dietary AGEs from other components of the diet.\nThe long-term effects of AGEs in early life have not been characterized in humans. Whether infants and young children with a higher exposure to AGEs are at higher risk of chronic disease in later life has not been addressed. In adolescents, the effect of increased consumption of fast foods and convenience foods on circulating levels of AGEs and biomarkers of health have not been well characterized. Studies in animal models suggest that high AGE exposures predispose to the development of insulin resistance and diabetes. Further work is needed to determine if younger adults with high circulating AGE levels are at an increased risk for insulin resistance, metabolic syndrome, or other health problems in later life.\nWhether single nucleotide polymorphisms are associated with circulating AGEs and RAGE is not known and could be addressed through genome-wide association studies in the future. Finally, it is not known whether adopting a lifestyle involving a low intake of dietary AGEs will prevent or slow the development of chronic diseases that are common in older adults. Further long-term dietary intervention studies are needed by different groups to corroborate the effects of high and low dietary intake of AGEs on circulating AGE levels and biomarkers of disease. Although AGE inhibitors and AGE breakers have shown promise in small controlled trials, further work is needed to evaluate long-term effects of these drugs upon cardiovascular and renal disease in older adults."}, {"section_title": "Funding", "text": "This work was supported by NIH R01 AG029148, R01 AG027012, R01 HL094507, R37 AG019905, and the Intramural Research Program, National Institute on Aging, National Institutes of Health."}]