[{"section_title": "", "text": "The Appalachian region of the United States is a geopolitically defined area comprising 25 million individuals living in 420 counties and 8 independent cities that follow the spine of the Appalachian Mountains. 1 The region-which spans from southwestern New York to northeastern Mississippi-is 42% rural and diverse in its health, demographic, and socioeconomic profile. [1][2][3] The region as a whole is recognized for increased rates of cancer incidence and mortality compared to non-Appalachia [4][5][6][7][8][9][10] and has been identified as an underserved, special population by the National Cancer Institute (NCI). [11][12][13] The elevated burden of cancer in Appalachia is associated with a host of risk factors prevalent across multiple levels of influence (eg, individual, provider, community, policy), including higher rates of obesity and tobacco use, lower rates of cancer screening and human papillomavirus vaccination (HPV), poor diet and physical inactivity, limited access to health care services, lower socioeconomic status (SES), geographic isolation, and limited smoke-free legislation at the state and community level. 3,8,[14][15][16][17][18][19][20][21] In addition to the previously described risk factors, knowledge and beliefs about cancer may also influence individuals' engagement-or lack thereof-in cancer information-seeking, preventive behaviors such as exercise and cancer screening, and/or adherence to recommended cancer treatment. For example, limited knowledge of cancer (eg, etiology, screening, treatment, survival), confusion related to evolving prevention and screening recommendations (eg, mammography, cervical, colorectal, lung), and/or fatalistic beliefs (eg, death from cancer is inevitable) may negatively impact individuals' attitudes, intention, internal locus of control, and self-efficacy to participate in healthful behaviors. [22][23][24][25][26][27][28][29] Adverse cancer-related beliefs and perceptions may be particularly salient in Appalachia given the prominent health and socioeconomic disparities in the region and the influences of individual health literacy and educational attainment; inadequate patient-provider communication; negative community norms related to cancer; lack of community infrastructure, legislation, and resources supportive of health; and barriers to health care across the cancer continuum. 3,16,21,[30][31][32] In reviewing prior research assessing Appalachian cancer-related beliefs and perceptions, Vanderpool and Huang found that Appalachians were significantly more likely to associate cancer with death and perceive that almost everything causes cancer compared to their non-Appalachian counterparts. 33 Two studies have also reported that over three-fourths of Appalachians agree that the number of recommendations about preventing cancer make it hard to know which ones to follow. 33,34 Rice and associates found that Appalachians were significantly less likely to believe behaviors influence obesity risk compared to non-Appalachians. 32 In addition, locally conducted studies from Appalachian communities in Kentucky, Ohio, Tennessee, Virginia, and West Virginia have reported-from both provider and individual patient perspectives-the adverse impact of limited cancer knowledge, fatalistic beliefs, and negative cancer perceptions on HPV vaccination behaviors, cancer screening, and utilization of the health care system. 30,[35][36][37][38][39][40][41][42][43][44][45] These overarching findings from across and within the region suggest that lack of knowledge and negative beliefs about cancer may ultimately result in an increased risk of cancer incidence and mortality among Appalachian residents. As described, much of the research focused on assessing Appalachians' cancer beliefs and perceptions has included comparisons of Appalachia versus non-Appalachia without further analysis of specific Appalachian states or subregions. This is likely due to limited sample sizes, or smaller survey studies or qualitative investigations conducted within specific Appalachian communities that were unable to provide comparisons to other Appalachian or non-Appalachian areas. These are important limitations given the heterogeneity of Appalachia and documented variations in demographics, SES, health care access, healthrelated policies, and cancer burden across its Northern, Central, and Southern subregions. 2,3,5,16,21 For example, Central Appalachia is recognized for significant economic distress, whereas Northern Appalachian communities fare better on several economic indicators (eg, household income, adults age 25+ with a bachelor's degree, labor force participation). 2 Related to cancer burden, Central Appalachia has the highest lung (both sexes) and cervical cancer incidence rates in Appalachia, and Northern Appalachia has the highest colorectal (both sexes) and breast cancer incidence rates. 5 Donahoe et al's analysis of smoke-free law coverage also showcased differences by Appalachian sub-region, wherein only 7% and 9% of the total population in Central and Southern Appalachia, respectively, were covered by smoke-free policies compared to 30% of the population in the Northern subregion. 21 Based on these subregional differences, understanding the variability of cancer beliefs and perceptions within Appalachia is needed to inform the development of culturally appropriate health communication messages, locally tailored educational programming, and evidencebased strategies to promote positive cancer-related behaviors, 45,46 which may ultimately impact the burden of disease across this unique geographic region. Therefore, the primary aim of this study was to provide estimates of cancer-related beliefs and perceptions from 3 geographically distinct Appalachian populations in Kentucky (Central Appalachia), Ohio (Northern and North Central Appalachia), and Pennsylvania (Northern Appalachia). In a secondary aim of the study, we compared findings from the 3 states' combined Appalachian populations to 2017 data from the NCI's Health Information National Trends Survey (HINTS) to articulate differences in national estimates of cancer beliefs as compared to localized estimates."}, {"section_title": "Methods", "text": ""}, {"section_title": "Study Procedures", "text": "In 2016, NCI awarded administrative supplements to 15 designated cancer centers focused on the implementation of local population health assessments to help define and describe the centers' population-based geographic service areas (ie, state or county boundaries), also known as catchment areas. [48][49][50] As outlined in  Table 1 outlines the details of each cancer center's survey design, data collection method, geographic catchment area, sample size, Appalachian sample size and response rate, weighting methodology, and other pertinent information related to the conduct of its population health assessment. For the purposes of this manuscript, we only analyzed survey responses from individuals residing in counties designated as Appalachia by the Appalachian Regional Commission (ARC) across the 3 states ( Figure 1). 51 "}, {"section_title": "Measures", "text": "Using validated items from national surveys (ie, HINTS, Behavioral Risk Factor Surveillance System, National Health Interview Survey) as well as newly created questions, the 3 cancer centers' surveys assessed a range of topics including: cancer communication practices, cancer knowledge and beliefs, cancer screening and other health behaviors (eg, tobacco use), and sociodemographics (eg, age, gender, education, annual household income). Five specific questions related to cancer beliefs and perceptions were included in all 3 cancer centers' surveys as well as in the publically available HINTS datasets: (1) it seems like everything causes cancer; (2) there's not much you can do to lower your chances of getting cancer; (3) there are so many different recommendations about preventing cancer, it's hard to know which ones to follow; (4) when I think about cancer, I automatically think about death; and (5) cancer is most often caused by a person's behavior or lifestyle. Response categories were the same across all 5 questions: 1 = strongly agree, 2 = somewhat agree, 3 = somewhat disagree, and 4 = strongly disagree. Given all 5 questions were significantly associated with one another and most of the 5 questions had reasonably good positive correlation (Spearman's correlation coefficients > 0.24), we created a composite score for all 5 questions (range 5-20) wherein a lower total score was indicative of more negative cancer beliefs and a higher total score was representative of more positive cancer beliefs. \"Cancer is most often caused by a person's behavior or lifestyle\" was reverse-coded for analysis. The composite score could not be calculated for HINTS because the 5 questions were not asked in the same iteration of the survey (ie, questions 1-4 were asked in HINTS 5 Cycle 1 and question 5 was asked in HINTS-Food and Drug Administration [FDA] 2). The following variables were included in the analysis and in some cases, included collapsed response categories based on sample distributions: current age (18-49, 50-64, 65+ years); gender (male, female), race (non-Hispanic white, other/multiple races); annual household income ($0-$19,999, $20,000-$49,999, $50,000-$99,999, $100,000+); educational attainment (high school education or less, high school graduate and/or some college, and college graduate); employment status (employed, unemployed); insurance status (uninsured, Medicare, Medicaid, private, other); marital status (married/living as married, unmarried); urban-rural status based on the US Department of Agriculture's Rural-Urban Continuum Codes (urban 1-3, rural 4-9); 52 feelings about household income (living comfortably on present income, getting by on present income, finding it difficult on present income, and finding it very difficult on present income); current smoking status (every day, some days, not at all); history of smoking at least 100 cigarettes (yes, no); and body mass index (BMI) based on calculations of self-reported height and weight (underweight [<18.5], healthy weight [18.5-24.9], overweight [25.0-29.9], obese [≥30.0]). In comparing the 3 cancer centers' combined Appalachian results to nationally representative findings, we utilized NCI's HINTS 5 Cycle 1 data, which were collected from civilian noninstitutionalized US adults aged ≥18 between January-May 2017 (Table 1). 53 Because the question \"Cancer is most often caused by a person's behavior or lifestyle\" was not asked in the HINTS 5 Cycle 1 survey, we used data from the HINTS-FDA2 survey in our analysis. HINTS-FDA2 was collected during the same time period as HINTS 5 Cycle 1, utilized similar survey methodology with the exception of including more current and former smokers, and included specific questions about the public's risk and harm perceptions about new tobacco products in addition to the traditional HINTS questions. Details about HINTS-FDA2 are published elsewhere. 54 Related specifically to weighting of the data, several demographic variables, such as age and number of adults in a household, were imputed for missing data based on the empirical distribution of nonmissing observations across all variables used for computing weights. Taking into account nonresponse observations, the survey weight was calculated using either a simple poststratification or iterative poststratification approach, and it was subsequently calibrated based on the corresponding 2011-2015 American Community Survey 5-year estimates 55 for each cancer center's catchment area"}, {"section_title": "Data Analyses", "text": "Weighted univariate and bivariate statistics were calculated for each state's Appalachian population as well as for the 3 states' combined Appalachian samples. Weighted Spearman's correlation was used to identify correlations among the 5 cancer belief measures. Weighted estimates for each of the beliefs and associated composite scores (ie, 4 categories, mean) were reported for Appalachian Kentucky, Appalachian Ohio, and Appalachian Pennsylvania and compared among the 3 states. In addition, the 3 states' combined Appalachian results were compared to national HINTS using weighted chi-square tests. Weighted multiple linear regression with a backward selection approach was used to identify significant factors associated with the composite score of cancer beliefs from the 3 states' combined Appalachian samples. The final model retained only covariates with P < .10. All statistical tests were 2-sided with a significance level of P ≤ .05. All data analyses were performed using SAS 9.4 (SAS Institute, Inc., Cary, NC). Analytic activities were covered by Data Use Agreements and study procedures were approved by the 3 universities' Institutional Review Boards."}, {"section_title": "Results", "text": "Across the 3 cancer centers' population health assessments, there were a total of 1,891 Appalachian residents included in the current analysis, including 798 respondents from Kentucky (29% response rate), 112 from Ohio (51% response rate among Appalachians), and 981 from Pennsylvania (41% response rate). As noted in Table 1, OSU's cancer center serves the entire state of Ohio; Appalachian counties comprise only 36% of their catchment area compared to the entirety of UK and UPMC's geographic service areas. Based on the weighted distributions in Table 2, roughly half (51%) of the combined Appalachian population was between the ages of 18 and 49 and female. Overall, racial/ethnic diversity was limited with 93% of the combined sample indicating they were non-Hispanic white; 59% of the sample resided in an urban-designated county. Almost half (45%) of the overall Appalachian sample reported an annual household income less than $49,999 and over onethird (39%) had a college degree or more. Over half (56%) of the Appalachian sample was employed and 62% had private insurance. In terms of health-related behaviors, 34% reported smoking every day, while 43% indicated a history of smoking of at least 100 cigarettes. Onethird of the combined Appalachian sample was obese. The bivariate analysis presented in Table 2 compares participant characteristics across the 3 states' respective Appalachian samples. Similarities were observed across all 3 Appalachian populations regarding age, gender, racial/ethnic diversity, employment, insurance status, and both tobacco use questions. Significant differences were observed across the 3 populations related to annual household income (P < .001), educational attainment (P = .004), marital status (P < .001), urban-rural status (P < .001), perceptions of present income (P < .001), and BMI (P < .001). Specific findings highlight the lower income and educational status of Appalachian Kentuckians. For example, 57% of Appalachian Kentuckians reported an annual household income less than $49,999 compared to 38% of Appalachian Ohioans and 42% of Appalachian Pennsylvanians. Related, 29% of Appalachian Kentuckians found it difficult or very difficult to get by on their current income. Similarly, 12% of Appalachian Kentuckians had less than a high school education compared to 4% and 5% of Appalachian Ohioans and Appalachian Pennsylvanians, respectively. One of the more striking findings was the difference between urban/rural status across the 3 states: 50% and 80% of the Appalachian Ohio and Appalachian Pennsylvania samples, respectively, were considered urban, whereas only 10% of the Appalachian Kentucky sample resided in urban-designated counties. Estimates of being obese were higher in Appalachian Ohio (42%) compared to Appalachian Kentucky (36%) and Appalachian Pennsylvania (28%). Examination of the 5 cancer belief measures revealed substantial variation among the 3 states ( Table 3). Four of the 5 cancer beliefs were significantly different among the 3 states, with the exception of \"Cancer is most often caused by a person's behavior or lifestyle.\" Appalachian Kentucky respondents consistently had higher percentages of negative beliefs (\"Strongly agree\" or \"Somewhat agree\") across the 5 questions compared to Appalachian Ohio and/or Appalachian Pennsylvania. For example, 71% of Appalachian Kentuckians agreed that everything causes cancer compared to 63% of Appalachian Ohioans and 57% of Appalachian Pennsylvanians (P = 001). In addition, 81% of Appalachian Kentucky respondents indicated agreement with the statement that there are too many cancer prevention recommendations to know which ones to follow compared to 61% of Appalachian Ohioans and 74% of Appalachian Pennsylvanians (P .= 020). Close to threefourths (72%) of Appalachian Kentuckians agreed that when they think of cancer they automatically think death, which was notably higher than Appalachian Ohioans (55%) and Appalachian Pennsylvanians (57%). A significant difference was also identified in the composite score of cancer beliefs (ie, lower value indicates higher negative beliefs), with Appalachian Kentucky having the lowest mean score (11.35), followed by Appalachian Pennsylvania (11.89) and Appalachian Ohio (12.46) (P < .001). When comparing the 3 states' combined Appalachian population to HINTS, 3 of 5 cancer belief measures were significantly different ( Table 3). More specifically, Appalachians had lower agreement that everything causes cancer (61%) compared to HINTS respondents (69%) (P = .003), higher disagreement that cancer equates to death (40% Appalachia vs 37% HINTS, P .= 008), and higher disagreement that cancer is caused by a person's lifestyle (60% Appalachian vs 37% HINTS, P < .001). Perceptions about personal control over cancer risk and beliefs about too many cancer recommendations were not significantly different between the combined Appalachian and HINTS respondents. As presented in Table 4, results of the multiple linear regression showed gender, educational attainment, BMI, perceptions of financial security, and Appalachian state were significantly associated with the composite score of cancer beliefs from the 3 states' combined Appalachian samples. Of note, rural/urban status was not significantly associated with the composite score. Specifically, being male was associated with a higher composite score (P = 005), whereas having lower education attainment (P < .001), being obese (P = .014), finding it difficult to get by on present income (P < .001), and residence in Appalachian Kentucky (P = .030) were associated with decreased composite scores."}, {"section_title": "Discussion", "text": "Given national agendas focused on increasing NCI-designated cancer centers' understanding of their local communities, [48][49][50] increasing rural cancer control research, 56 and capturing variability in cancer-related outcomes in smaller subpopulations, 57 we explored beliefs and perceptions about cancer among Appalachian residents of 3 different states. To the best of our knowledge, this is among the first estimates of cancer-related beliefs representative of these unique geographic populations. Moreover, the current study compared combined estimates from the 3 states' Appalachian respondents to nationally representative results from HINTS, illustrating differences in cancer-related beliefs between the 2 populations. Similar to other published ARC reports, 2,3 there was considerable variation in the sociodemographic and health behavior profile of the 3 Appalachian populations. Notably, respondents from Appalachian Kentucky, which is one of the most economically distressed regions of the United States, 2 were characterized by lower incomes and educational levels, were more likely to reside in rural-designated counties, and reported more negative perceptions of financial security compared to their Appalachian counterparts in Ohio and Pennsylvania. These circumstances likely play an important role in the elevated cancer burden in Appalachian Kentucky, 5,9 but also the more negative beliefs and perceptions related to the disease itself as evidenced in the bivariate results and supported by the weighted multiple linear regression model. Related specifically to the primary aim of establishing estimates of cancer-related beliefs and perceptions among the 3 different Appalachian populations, Appalachian Kentuckians had the lowest mean composite score across the 5 questions, which was likely driven by higher rates of agreement with statements related to everything causes cancer, there are too many cancer prevention recommendations to follow, and equating cancer with death. Yet this same population was also more likely to agree that cancer is associated with behavior. Appalachian Ohioans had the highest mean composite score, which may have resulted from higher rates of disagreement with individuals not being able to lower their cancer risk, too many cancer prevention recommendations to follow, and equating cancer to death. Notably, Appalachian Pennsylvanians were more likely to disagree that everything causes cancer compared to the other 2 states. The reasons for these unique geographic differences across the 3 states are undoubtedly multifaceted and complex, ranging from personal and familial experiences with cancer and the health care system (eg, generational transference of fear and negative beliefs, perceived cancer risk, availability of clinical resources and health insurance) to differing socioeconomic (ie, economically distressed counties), environmental (eg, air and water pollution), and health conditions (eg, cancer burden, \"diseases of despair\") found in each Appalachian region. 2,3,30,33,58 Moreover, supportive health policies, which in turn may influence social norms related to cancer prevention, vary by state. For example, in 2016, all Appalachians living in Ohio were covered by comprehensive smoke-free laws compared to only 10% of Appalachian Kentuckians and 0% of Appalachian Pennsylvanians. 21 Importantly, none of the 3 states have policies requiring HPV vaccination for school entry. 59 In addition, consideration should be given to variations in the history, implementation, and reach of community and state cancer control initiatives across Kentucky, Ohio, and Pennsylvania. These initiatives include cancer education, capacity building, and communitybased participatory research conducted by the Appalachia Leadership Initiative on Cancer (1992-2000), the Appalachia Cancer Network (2000)(2001)(2002)(2003)(2004)(2005), and the Appalachian Community Cancer Network (2005-2015) focused on smoking cessation, energy balance, and cancer screening, 13 as well as state-level comprehensive cancer coalitions supported by the Centers for Disease Control and Prevention, 60 among other local activities. Lastly, each Appalachian region also varies in community assets (eg, social capital, resilience, love of place, religion), which provide a foundation for individual and community participation in the development and implementation of cancer-related interventions. 13 When identifying factors related to the composite score of cancer beliefs across the 3 states' combined Appalachian sample, individuals with less than a high school education, increased weight status, perceptions of increased financial difficulty, and residence in Appalachian Kentucky were more likely to have a lower score, thereby indicating lower rates of cancer knowledge and more negative beliefs. Rural/urban status was not significantly associated with the composite score; the impact of this variable may have been attenuated by other factors such as education and income. Given these disparate findings across Appalachian states and personal characteristics, it is vital to further understand the historical, geographic, contextual, psychosocial, and cultural underpinnings of these beliefs-and how they may influence cancer prevention and screening behaviors-through additional qualitative and quantitative investigation. For example, Drew and Schoenberg suggested some Appalachian populations may use fatalistic beliefs as a coping mechanism in resource-constrained circumstances and the construct of fatalism may be culturally acceptable. 41 In addition, Hutson et al reported that some Appalachian residents perceive the mountains as \"holding things in\" such as misperceptions about cancer and its causes. 30 Further exploration of these phenomena is warranted, particularly in a region such as Appalachian Kentucky where residents reported high rates of agreement with the notion that cancer equates to death. Findings from the current study also support the need for individual-, provider-, and community-level communication and education initiatives-developed in collaboration with Appalachian residents-that present evidence-based cancer control guidelines in an understandable, culturally relevant manner so that individuals feel confident and empowered to follow important health guidelines and provider recommendations that may save their lives. In comparing findings from the 3 states' combined Appalachian populations to HINTS, it was surprising to find that Appalachians had similar-or in several instances-less negative cancer-related beliefs than the national sample. The only exception was the statement related to cancer being associated with a person's lifestyle, wherein Appalachians were more likely to disagree. These findings differ from previously reported comparisons of Appalachia and non-Appalachia, wherein the Appalachian sample had more negative cancer perceptions than their non-Appalachian counterparts as assessed by several of the same variables from the current study (eg, seems like everything causes cancer). 33,34 Importantly, because of the specific cancer centers that were funded for this project in 2016, our study represented only 3 Appalachian states compared to the entire 13-state region. Regardless, these findings underscore important and prevalent misperceptions and negative beliefs about cancer across the entire United States. 22,28,29,61 "}, {"section_title": "Strengths and Limitations", "text": "There are many strengths to the current study, including a focus on cancer beliefs and perceptions among 3 distinct Appalachian populations, which has not been previously reported; the large sample size for the Appalachian population; the use of the same questions across the 3 states' surveys as well as HINTS; and the comparison of local results to national data. However, there are also noted limitations that should be addressed. First, all 3 cancer center surveys and HINTS are cross-sectional surveys, thereby limiting the ability to infer casualty. In addition, although the 3 cancer centers shared the common goal of conducting local population health assessments in their respective catchment areas, there was variation in each site's survey methods. Common issues associated with survey data may have also affected the study results, including selection bias, nonresponse bias, and recall errors, which potentially could have caused some over-or underestimation of results even after appropriate weighting. However, the impact from these biases should be limited. The sample distribution for each site along key demographics was similar to the population distribution in the catchment areas overall and for the specific Appalachian subsets. In addition, the small magnitude of the weight adjustments needed in the calculation as well as the low variability in the analysis weights provides further evidence of the limited potential for bias. Lastly, we did not have representation from Southern Appalachia (eg, Mississippi) or other states such as West Virginia to make the estimates representative of the entire Appalachian region. Of note, the University of Virginia, whose catchment area includes Appalachian Virginia, was funded as part of the 2018 cohort of NCI cancer centers conducting an additional round of population health assessments. 48 "}, {"section_title": "Conclusions", "text": "As suggested by study findings, there are variations in sociodemographic characteristics and cancer-related beliefs and perceptions within Appalachia, specifically, Kentucky, Ohio, and Pennsylvania. The population health assessments conducted by the 3 NCI-designated cancer centers allowed us to capitalize on locally collected data to identify patterns specific to each Appalachian region, thereby providing evidence for individual-, provider-, and communityspecific cancer communication messaging, culturally appropriate health education strategies, and efficacious interventions aimed at improving cancer knowledge, cancer-related attitudes and self-efficacy, patient-provider communication, and ultimately, cancer preventive behaviors. Suggestions for future implementation include dissemination of low-literate, visual, and/or audio cancer educational materials and messaging through community-and faith-based initiatives; improved access to online health information and technology infrastructure; increased informed-and shared-decision making between providers and patients about cancer prevention and screening recommendations; explanation of local cancer statistics, including incidence, mortality, and survival, in layman's terms to further the public's understanding; passage of supportive health policies at state and local levels; and creation of positive social norms related to prevention, screening, and survivorship that help to alleviate the fear, stigma, and confusion related to cancer in Appalachia. All of these efforts are needed to impact the significant cancer disparities present in this unique geographic region of the United States. Appalachian-Designated Counties in Kentucky, Ohio, and Pennsylvania.    "}, {"section_title": "Characteristics of Appalachian Respondents in 3 Study States", "text": ""}, {"section_title": "Table 3", "text": "Cancer  "}]