[{"section_title": "Abstract", "text": "Abstract Obesity risk depends on food energy balance. Because food and beverages are acquired primarily through purchases by household members, understanding food expenditure is central to understanding food intake and obesity risk. This paper reviews three areas of the literature that explore potential influences on food expenditure and thus obesity risk: food insecurity, food environments, and food prices. This article examines these three lines of research together, reporting key results in a comparable fashion; it focuses on recent innovations in data and research design in each area; and it includes articles that have been published since the most recent reviews. While it did not prove possible to identify a single food expenditure influence that most strongly affects obesity risk, examining the three literatures jointly highlights fertile ground for future work that combines elements of each."}, {"section_title": "Introduction", "text": "Obesity risk depends on food energy balance, including energy use and energy intake [1] . For non-institutionalized US populations, food and beverages are acquired primarily through purchases by household members. Foods are purchased from many sources, including grocery retailers, other retailers, restaurants, cafeterias, and vending machines. These food expenditures are influenced by tastes and preferences, food prices, household incomes, information, participation in nutrition assistance programs, and the food marketing environment. Understanding food expenditure is central to understanding obesity risk.\nFood expenditure is important in at least three rapidly growing lines of research exploring the causes of the current obesity epidemic."}, {"section_title": "1.", "text": "The food insecurity hypothesis. Food insecurity may affect weight through several mechanisms [2] [3] [4] . To cope with food insecurity, household members may consume cheaper, energy-dense foods, overeat when food resources are available, or overfeed vulnerable members in times of plenty in an effort to compensate for periods of food insecurity. Under the food insecurity hypothesis, obesity risk stems from not having enough economic resources for a food spending pattern that promotes health. 2. The food environment hypothesis. Households living in food deserts, characterized by the absence of supermarkets, may lack access to appealing and less energydense foods, such as fresh fruits and vegetables, at affordable prices [5] . In a variation on this hypothesis, households living in food swamps, characterized by the density of quick service restaurant options, may be overwhelmed by a marketing environment with too much inexpensive and energy-dense foods, or too great a ratio of energy-dense foods relative to affordable healthier options. Under the food environment hypothesis, obesity risk stems from poor retail options for a food spending pattern that promotes health.\n3. The food price hypothesis. In a simple version of this hypothesis, technological advances in the 20th century generated a long-term decline in real inflation-adjusted food prices, raising the quantity demanded and thus food intake [6 , 7] . In a more complex version, prices of energy-dense foods fell in real terms relative to the prices of fruits and vegetables and less energy-dense foods [8] . Under the food price hypothesis, obesity risk stems from food demand choices that are influenced by counterproductive price signals.\nSome recent research in this area addresses fundamental research design challenges. With observational data, it commonly is difficult to demonstrate that variation in obesityrelated outcomes is caused by variation in the main explanatory variable of interest, whether that variable is household food insecurity, or access to supermarkets, or food prices. In the face of this challenge, some studies just report crosssectional associations without making claims about causation, while other studies have developed innovative approaches toward stronger research design. Other recent research has been exploring improvements in data quality, through better measurement and data analysis.\nAs noted below, there have already been separate highquality literature reviews on all three topics since 2009. This article makes a new contribution in several respects: 1) it addresses these three lines of research together, restating some key results in a more comparable fashion; 2) it points out the distinct conceptualizations of the role of food spending in obesity risk; 3) it focuses on recent innovations in data and research design in each area, which may be useful for policy-relevant causal inferences in all three lines of research; and 4) it includes some newer articles that have been published since the most recent reviews.\nThe studies reviewed here are related to other lines of research that we ruled out of scope. We did not include the rapidly growing field of research on school food service and obesity [9 , 10] because, in federal programs that provide a large fraction of meals for free, it is not clear that the customer's spending is central. We included research covering the effect of other nutrition assistance programs on obesity only if the research also addressed one of our three topics [11 , 12• , 13 , 14 , 15•] . We addressed aspects of the food environment related to food expenditure, such as access to food retailers and restaurants, but did not review how the food environment influences physical activity.\nFor the food insecurity hypothesis, the search terms were food security, food insecurity, or hunger (and BMI or obesity). This search yielded 5 new articles and also repeated 6 of the 10 relevant articles in our initial bibliography. 2. For the food environment hypothesis, the search terms were food environment, food access, food desert, and food swamp (and BMI or obesity). This search yielded 4 new articles and also repeated 3 of the 18 relevant articles in our initial bibliography. 3. For the food price hypothesis, the search term was price (and BMI or obesity). This search yielded 6 new articles and also repeated 2 of the 23 relevant articles in our initial bibliography.\nOur review of each empirical research article had two main components. First, we extracted reported quantitative associations between obesity and key explanatory variables, which could be treatments or economic and environmental variables. For outcomes that could be expressed as odds ratios or as a change in BMI, we tabulated the results in as comparable a format as possible (Tables 1 and 2 ). Second, we noted contributions to data and research design and the explicit or implicit conceptualizations of food spending."}, {"section_title": "Methodology", "text": "We began this project with the existing literature reviews plus an extensive partial bibliography of relevant sources already in hand, collected non-systematically. We supplemented this initial bibliography with a systematic search of the PubMed database on the three lines of research. This database search retained refereed English-language empirical research articles published between 2009 and 2012 with a treatment relevant to one of the three lines of research and a reported outcome that could be expressed as an odds ratio for obesity risk or as a change in the expected value of body mass index (BMI)."}, {"section_title": "Results", "text": ""}, {"section_title": "The Food Insecurity Hypothesis", "text": ""}, {"section_title": "Background", "text": "Food insecurity is defined as 1) the limited or uncertain availability of nutritionally adequate and safe foods, or 2) limited or uncertain ability to acquire acceptable foods in socially acceptable ways [16] . The US government produces national prevalence estimates using the Household Food Security Module in the annual Current Population Survey. The module consists of 10 survey items (for households without children) or 18 survey items (for households with children) related to experiences of food-related hardship in the previous 12 months [16] . Households are classified as food-insecure if the respondent answers affirmatively to three or more questions [17] . The survey questions ask about hardships caused by a lack of resources to acquire a Outcome is a combination of overweight and obesity (BMI≥85th percentile for age-/sex-specific reference values).\nb ORs calculated by literature review authors from study results. The reported interaction term was statistically significant at P<0.05.\nc Relative risk ratio.\nd OR based on reported mean obesity prevalence and coefficient for treatment (comparing forecast outcomes centered around current mean).\n* Statistically significant at the 10 % level; ** Statistically significant at the 5 % level; *** Statistically significant at the 1 % level.\nBMI-body mass index; OR-odds ratio; SNAP-Supplemental Nutrition Assistance Program. Beydoun et al. [49] A $1 increase in fast-food price index among children aged 2-9 years −0.2 Cross-sectional food; food insecurity is about having insufficient resources for food spending. Because weight gain is caused by food and beverage intake that is more than sufficient for energy balance, the empirical association between insufficient resources and obesity is sometimes called a \"paradox,\" although in fact the possible coexistence of food insecurity and obesity has long been understood [18] . Several previous reviews summarize the literature published on this association through 2010. Eisenmann et al. [19] reviewed 16 cross-sectional and 5 prospective studies conducted in children and adolescents. All of the studies demonstrated coexistence of food insecurity and overweight, but results revealed a mix of positive, negative, and null associations between them. An additional review including 42 studies [20] similarly found mixed evidence for a food insecurity-weight status association among children and little evidence for men. Among women, consistent evidence suggests a positive association between food insecurity and risk of obesity.\nThe food environment determines the set of options available to individuals and households as they make food spending choices. Household food spending patterns influence the dietary intake of household members and, ultimately, health and weight status. Researchers have been concerned about multiple potential shortcomings of the food environment:\n& Perhaps low-income neighborhoods lack food retailers; & Perhaps retailers offering healthy food options are too far away for customers without automobiles; & Perhaps other food services, including quick-service restaurant chains and small scale convenience stores, are more likely to be available in low-income neighborhoods; & Perhaps the retailers present in low-income neighborhoods have low quality and high prices for healthy food options.\nMuch of the early research explored cross-sectional associations between the distribution of food retailers or restaurants within an area and the demographic or socioeconomic characteristics of that area [5 , 29] . Evidence suggests that neighborhoods that are predominantly lower income and minority have fewer supermarkets or longer distances to supermarkets [30] [31] [32] . Other studies have noted that the density and proximity of fast-food outlets tends to be higher in low-income neighborhoods [33] .\nAttention has since shifted toward establishing connections between the food environment and diet and health outcomes. Larson et al. [33] reviewed 54 studies and found that households with better access to supermarkets and limited access to convenience stores tended to have healthier diets and lower obesity rates. The findings on restaurant access were less consistent, but they suggested that less access to fast-food restaurants was associated with better diets and lower rates of obesity. Giskes et al.'s [34] review of the literature found a consistent association between environment and weight status. Better access to supermarkets and more limited access to fast-food restaurants were associated with lower BMI or prevalence of overweight or obesity, while higher weight status was found among those with limited supermarket access or greater accessibility to fast-food restaurants. Both literature reviews emphasized that the majority of studies were cross-sectional, and Giskes et al. [34] specifically cautioned against giving the results a causal interpretation, noting the potential importance of more general material deprivation in low-income neighborhoods. Such neighborhoods may have other relevant characteristics in addition to limited supermarket access.\nIn the basic microeconomic theory of food spending, consumers maximize utility subject to a budget constraint that depends on prices and income. For normal goods, increased income boosts while higher prices lower the quantity demanded of a particular good. A price increase for one good may also raise or lower the quantity demanded of a second good, depending on whether the goods are respectively substitutes or complements. Higher prices for healthy foods, or lower prices for unhealthy foods, could increase the risk of obesity [8 , 42 , 43] . Some research has explored this association directly, mainly through models that regress a weightrelated variable on prices and income. Other research has explored it indirectly, by estimating demand elasticities and then extrapolating the implications for obesity risk based on a simulated model of the metabolic response.\nPrevious evidence explores potential effects of food prices on intake and obesity. Epstein et al. [44] reviewed studies that investigate the response of food and macronutrient purchases to laboratory and field-based price experiments. The purchase of less healthful foods fell as price increased while lower prices boosted purchase of healthier options. Improvement in nutrient intake was less consistent. Andreyeva et al. [45] reviewed 160 observational studies estimating demand elasticities for 16 food and beverage groups. Elasticities varied from 0.27 to 0.81 (absolute values). Finally, Powell and Chaloupka [42] reviewed evidence of food price sensitivity of weight outcomes. The effect of price was found to be small in magnitude, though more likely to produce weight change among children, lowincome individuals, and those at risk for overweight."}, {"section_title": "Recent Literature", "text": "Recent studies have used new data sources or measures of obesity and food insecurity, examined the association in specific sub-populations, and explored interaction terms or effect modifiers. One recent study also employed nonparametric analysis techniques to examine the food insecurityobesity relationship. The research confirms some previous mixed results about the association between food insecurity and risk of obesity.\nSeveral recent studies employed measures of food insecurity and obesity that differ from the bulk of the earlier literature. Yaemsiri et al. [21] drew on the NYC Community Health Survey to assess food concern (found to be associated with obesity among white New Yorkers but not among Black, Hispanic, or Asian adults). Gundersen et al. [22•] estimated the association between household food insecurity and alternative measures of childhood weight status including BMI, waist circumference, tricep skinfold thickness, trunk fat mass, and percentage of whole body fat (no significant associations with food insecurity).\nOther recent studies focused on specific populations. Laraia et al. [3] studied the food security status of pregnant women in North Carolina (finding a strong association with risk of severe obesity). Buscemi et al. [23] studied parents' acculturation scores and food security status for low-income Latino children (finding an association between both parent acculturation and food insecurity and lower child BMI, and a significant interaction effect).\nStill other studies, such as the Buscemi et al. [23] study, explored mediators or effect modifiers. Lohman et al. [2] assessed the mediating effect of individual, maternal, and family stressors in a cross-sectional analysis of 1011 adolescents (finding that maternal stress enhanced the association between food insecurity and risk of overweight or obesity). For adults, Martin and Lippert [15•] built on previous research studying gender as an effect modifier for the relationship between food insecurity and risk of obesity. They explored whether it is better to treat the heavy burdens of management of the family's food supply, rather than gender itself, as the relevant effect modifier (finding that the association between food insecurity and risk of obesity is stronger for women with children than for women without children). Gooding et al. [14] , however, found that the interaction between food insecurity and the presence of children had a nonsignificant effect on the BMI of both women and men. In a cross-sectional study of the 1999-2002 NHANES (National Health and Nutrition Examination Survey), Tayie and Zizza [24] only partly confirmed earlier research suggesting that height was an effect modifier (for men, food insecurity was significantly associated with lower BMI regardless of their measured height; for women, marginal food security was associated with higher a Reported change for child BMI was based on reported percent change in the source document, converted to unit change using the average BMI measure in the sample (18.5 mm/kg 2 ) at the average age (8 years).\n* Statistically significant at the 10 % level; ** Statistically significant at the 5 % level; *** Statistically significant at the 1 % level.\nBMI-body mass index; FV-fruit and vegetable; HH-household; SNAP-Supplemental Nutrition Assistance Program.\nBMI only among women below median height). Jilcott et al. [11] estimated the moderating effect of Supplemental Nutrition Assistance Program (SNAP) benefits in a convenience sample of North Carolina women. They found a positive association between food insecurity and BMI for women receiving less than $150 in SNAP benefits per person per month, but no association among women receiving larger amounts. One study investigated the possibility of reverse causation among adults aged 50 years and older [25] . In adjusted models, older adults categorized as Class II obese based on a waist circumference for men ≥49 inches and for women ≥45 inches were 2.51 times as likely to be food insecure as adults with narrower waists (95 % CI, 1.43, 4.39, P≤0.01). In older adults, the authors posit that obesity may lead to food insecurity through the effects of weight-related disability.\nFinally, a recent study employed alternative nonparametric functional forms in the statistical analysis. Using data from the nationwide Panel Study of Income Dynamics (PSID), Kuku et al. [26•] found non-linear associations between the number of affirmative food insecurity responses and the risk of childhood obesity, and these associations vary by gender, race, and income level. At higher levels of food insecurity, the probability of obesity decreases markedly among boys, while rising to its highest level among girls. Their results confirm the possibility, suggested in previous work documenting an inverse U-shaped relationship [13 , 27 , 28] , that the food insecurity-obesity relationship may be nonlinear.\nRecent research efforts seek to strengthen causal claims through the use of longitudinal data analysis methods, instrumental variable techniques, randomized trials, and the careful selection of key exogenous variables in research design. Even with these improvements in research design, many recent studies have had mixed results and small estimated effects.\nSome researchers have used randomized social policy initiatives to address selection bias and unobserved heterogeneity. Ludwig et al. [35• •] compared the baseline and follow-up weight status of participants in Moving to Work, a randomized US Department of Housing and Urban Development (HUD) demonstration program. Existing public housing residents in high-poverty areas were randomly assigned to receive vouchers that could be used to relocate to low-poverty areas, unrestricted vouchers that could be used to relocate to another area regardless of the poverty rate, or no new assistance. Moving from a high-poverty urban area to a low-poverty area was associated with small reductions in the prevalence of extreme obesity (BMI>35 mm/kg 2 ). Through random assignment, the study had an exceptional source of independent variation in the key explanatory neighborhood location variable, but it is not possible to say if the food retail environment or some other characteristic of low-income neighborhoods is responsible for the observed results.\nOther researchers have used an instrumental variables approach to estimate causal effects. Courtemanche and Carden [36•] identified an instrument using information on the entry date and location of Walmart Supercenters and the unique geographical expansion of Supercenters centered around the Walmart headquarters in Bentonville, Arkansas. Each additional Walmart Supercenter per 100,000 residents (county-level) increased average BMI and the probability of being obese. This effect was strongest for women, lowincome married individuals, and those living in the least populated counties. They conclude that the existence of Walmart Supercenters account for 10.5 % of the rise in the obesity rate in the United States since the late 1980s.\nChen et al. [37] take account of the special correlations among households who live closer to each other, finding that increased access to chain grocers was associated with lower BMI for people in low-income neighborhoods but not higher-income neighborhoods. Other studies use longitudinal data and fixed effects models to control for some of the unobserved heterogeneity. Most noteworthy are studies that use longitudinal data for both weight outcomes and food environment exposure. Using follow-up data from the National Longitudinal Survey of Youth 1979, Gibson et al. [38] found that the density of small grocery stores was positively and significantly associated with obesity and BMI among residents of urban areas. For individuals who moved from rural to urban areas over a 2-year period, changes in neighborhood supermarket density, small grocery store density, and full service restaurant density were significantly associated with the change in BMI over that period.\nUsing information from the California public school system, Currie et al. [39] estimated the relationship between the change in weight status and the change in nearby fast-food restaurant availability. The presence of a fast-food restaurant within 0.1 miles of a school was associated with an increase in the fraction of students in a class who were obese relative to the presence of a fast-food restaurant within 0.25 miles. This effect accounted for a 5.2 % increase in the incidence of obesity among the affected children.\nBlock et al. [40• ] examined the long-term relationship between the food environment and weight status using data spanning 30 years from the Framingham Heart Study Offspring Cohort. Each 1-km increase in distance to the closest fast-food restaurant was associated with a decrease in BMI. In sex-stratified analyses, the association of fast-food restaurant proximity was present only for women. Other aspects of the food environment were inconsistently associated or not at all associated with BMI.\nNew research has innovated in several directions: using new sources of price data, research designs, and methods for estimating the likely effects of demand responses on obesity. Whereas earlier research tended to be skeptical that higher prices for snack foods would have much influence on demand [46] , some of the new research has been more optimistic that there could be a substantial demand response for certain food and beverage categories.\nSeveral studies use cross-sectional or random-effects models. Three of these utilize Council for Community and Economic Research (C2ER, formerly known as ACCRA) data, which capture prices of 27 food prices in urban markets. Gordon-Larsen et al. [47] studied the response of adolescent fast-food intake to community-level soda and hamburger prices. Significant results were small in magnitude and price sensitivity varied by item, race, and income. Khan et al. [48] found larger effects. Using an expanded, weighted set of C2ER prices they estimated that a 10 % increase in the price of fast food is associated with a 5.7 % decrease in weekly frequency of fast-food consumption among 5th and 8th graders. Beydoun et al. [49] linked fast food and fruit and vegetable price indices to food intake and BMI. Price increases had significant, expected effects among children (fewer fast-food items consumed; increased BMI), but not adolescents. Additionally, Andreyeva et al. [50] used industry consumption data to estimate that a penny-per-ounce excise tax on sugar-sweetened beverages would result in a 24 % annual drop in consumption, resulting in a potential per capita weight loss of 5 lb/year.\nA few studies employed the fixed-effects models to control for unobserved characteristics. Han and Powell [51] drew on the C2ER database and compared random-to fixed-effects models. In random-effect models, a 10 % increase in fast-food price index was associated with an 18.8 % and 20.7 % decrease in the probability of obesity among women and men, respectively. However, these associations lost magnitude and significance in individual fixedeffects models. Staudigel [52] found significant, but very small price effects on BMI for 4 of 20 foods, and no price effect on obesity prevalence among Russian adults.\nIn contrast, Zhang et al. [12•] found evidence for a food price-obesity relationship among US female SNAP participants. A significant negative interaction term suggested that higher prices of unhealthy foods partially offset the positive association found between SNAP participation and body weight. In instrumental variable models, the unhealthy food price index and the price-SNAP interaction term remained associated with lower odds of obesity.\nWhile most of the above studies used C2ER data, Wendt and Todd [53••] drew upon the new Economic Research Service (ERS) Quarterly Food-at-Home Price Database (QFAHPD) to show that price changes may have a lagged effect on child obesity. The QFAHPD, constructed from Nielsen Homescan data, includes frequency-weighted prices for 52 narrowly defined food groups. Wendt and Todd [53••] combine QFAHPD with Early Childhood Longitudinal Study data in fixed-effects models. They found significant price effects for several foods and beverages, and note that for some items the previous quarter's price impacts BMI, while for others the 1-year lagged price affects weight. Estimated effects account for around 10 % of annual growth for a child at the 85th percentile of BMI.\nFinally, Lin et al. [54••] advanced the literature by proposing the use of a dynamic weight loss model for estimating the impact of tax-induced beverage demand changes on obesity. This model assumes that changes in body composition during an intervention impact the energy deficit needed for continued weight loss, whereas the widely used static model assumes that a 3500-calorie energy consistently translates to 1 lb of body weight loss. In side-by-side simulations, the static model overestimates weight loss by 63 % in year 1 and 346 % in year 5."}, {"section_title": "Looking Forward", "text": "The recent focus on particular populations, particular effect modifiers, and non-linear functional forms, improves and extends our knowledge of the cross-sectional associations between food insecurity and obesity. Yet, the result is a plethora of statistically significant and insignificant associations whose overall thrust is difficult to characterize. Moreover, as all of the studies acknowledge, and as the Brewer et al. [25] study specifically emphasizes, we cannot describe food insecurity as the cause and risk of obesity as the outcome. Studies in the next two sections place stronger emphasis on research designs that seek to estimate the effects of the key explanatory variables on obesity outcomes, but such emphasis has not been possible to date in research on the food insecurity hypothesis.\nTwo topics that deserve further investigation are consumers' access to vehicles and their willingness to trade off retail proximity against other objectives such as lower cost and greater product variety. The US Department of Agriculture (USDA)'s 2009 Report to Congress on food deserts found that only 2.3 % of American households, and 3.6 % of American households living in low-income areas, lived more than a mile from a supermarket and also lacked access to an automobile [5] . Future research may distinguish households with and without automobile access when measuring the effects of the food environment.\nEven with more sophisticated study design and econometric techniques, the relationship between the food environment and obesity remains mixed. Issues with selection bias and unobserved heterogeneity remain, because the food environment, neighborhood characteristics, and health and weight status of populations within neighborhoods change over time and not independently [29] . Research in this area would benefit from careful investigation of the different steps in the causal chain, by exploring relationships between the food environment and multiple outcomes in the same population. In future work, the PHRESH (Pittsburgh Hill/Homewood Research on Eating, Shopping & Health) study will examine the effect changes in the food environment on both more proximal outcomes, like household shopping behavior, and more distal outcomes, like health and weight status, in two Pittsburgh communities before and after introduction of a supermarket in one of the sites [41]. Incorporating more micro-level data on food item availability and prices is another area to prioritize in future research.\nThough this research has advanced in the analytical methods used, a key limitation remains the lack of a database combining information about dietary intake, health outcomes, and prices. Many recent studies rely on the C2ER. This database provides prices for just 24 food-at-home and 3 food-awayfrom home items that represent indicator prices for geographic markets, not prices that individual consumers actually pay. Furthermore, some question its representativeness, as the sample focuses on urban areas and food retailers frequented by professional (upper-income) consumers [55] . In 2012, USDA/ERS will begin its new National Household Food Acquisition and Purchase Survey (FoodAPS). This survey will collect information on the price and quantity of household food purchases as well as demographic, socioeconomic, diet and health information for household members. While FoodAPS will improve researchers' ability to study the priceobesity relationship, it remains cross-sectional in design. Future research will be further strengthened by longitudinal data on diet and weight outcomes linked to changes in the food prices that individuals actually pay. Randomized price-change trials such as the forthcoming SHELf (Supermarket Healthy Eating for Life) trial conducted by Ball et al. [56] will also play an essential role in establishing causality."}, {"section_title": "The Food Environment Hypothesis", "text": ""}, {"section_title": "The Food Price Hypothesis", "text": ""}, {"section_title": "Conclusions", "text": "A purpose of this article was to compare findings and methodologies across three diverse lines of research. Even with our effort to put obesity-related outcomes on a comparable scale, it did not prove possible to draw conclusions about which theory of food expenditure has the greatest impact on obesity risk. The main hurdle is that the treatments or changes in environmental variables are so diverse. It is difficult to say what number of new food retailers per county has the right scope or magnitude for a fair comparison with a 10 % tax on a sugar-sweetened beverage.\nMost studies focus only on one of the three hypotheses connecting food expenditure to obesity risk. The exceptions are interesting. For weight status outcomes data from the PSID, Powell and Han [57] used food price information from C2ER and food retail locations from the Dun and Bradstreet commercial database. Courtemanche and Carden [36•] offered an intriguing discussion of whether their findings for Walmart Supercenters are due to the retail chain's distinctive pricing strategy or to its role in the retail environment. Future research may fruitfully continue to combine elements from the three literatures reviewed here. For example, the food insecurity literature in the first section focuses on lack of resources for comparably expensive foods, a topic that would benefit from explicit attention to the food price variation addressed in the third section.\nMany of the studies reviewed here concluded with a discussion of policy relevance. When available, we have highlighted studies that sought to identify the effects of food prices and the food retail environment on obesity-related outcomes, using research designs that go beyond just cross-sectional comparison. To the extent that research on food expenditure is intended to support policy analysis, future research in this same spirit may strengthen our knowledge about the effects of both retail environment and food prices on multiple outcomes, including both food security status and the risk of obesity."}]