[{"section_title": "S. A. Gallagher and J. J. Gallagher", "text": "Using Problem-based Learning to Explore Unseen Academic Potential A majority of research in problem-based learning (PBL) pursues two lines of inquiry. The first line of inquiry investigates whether students in PBL classrooms learn as much as students in classrooms with traditional instruction. This research has demonstrated children and young adults in PBL classrooms can learn at least as much as other students if the problems are carefully constructed around content objectives (Davis, Oh, Anderson, Gruppen, & Nairn, 1994; Gallagher & Stepien, 1996; Goodnough & Cashion, 2003) , thoughtfully delivered (Schmidt & Moust, 1995; Van Berkel & Dolmans, 2006) , and appropriately scaffolded (Belland, 2010; Gallagher, 2009a; Hmelo-Silver, 2004; Hmelo-Silver, Duncan, & Chin, 2007; Vardis & Ciccarelli, 2008) .\nThe second line of inquiry investigates whether students can learn discrete learning skills through PBL curriculum. Findings support PBL as a method of teaching many different kinds of skills including problem finding (Gallagher, Stepien, & Rosenthal, 1992) , rules of argumentation (Belland, Glazewski, & Richardson, 2008) , experimental method (Feng, VanTassel-Baska, Quek, Bai, & O'Neill, 2005) , collaboration, (Visschers-Pleijers, Dolmans, De Leng, Wolfhagen, & Van Der Vleuten, 2006) and peer tutoring and metacognition (Shamir, Zion, & Spector-Levi, 2008) . The strongest and most consistent finding in this branch of research is that students in PBL classrooms find learning more motivating, engaging, and satisfying (e.g., Faessler, Hinterberger, Dahinden, & Wyss, 2006; Hmelo-Silver, 2004; Lieberman, Stroup-Benham, Peel, & Camp, 1997; MacKinnon, 1999; Maxwell, Bellisimo, & Mergendoller, 2001) . The engagement students experience in PBL leads to achievement as evidenced in structural equation models where student engagement contributes both directly and indirectly to achievement (Van Berkel & Dolmans, 2006; Schmidt & Moust, 1995) . At least part of this achievement seems to be the situational interest aroused by the problem itself. The problem engages the student, arouses interest, and the child learns as a result of being intrigued (Schmidt, Rotgans, & Yew, 2011) .\nLess research has been devoted to possible ancillary benefits of PBL, particularly whether PBL provides teachers with an opportunity to see academic potential in their students that they hadn't seen before. The question of teacher perception is crucial, particularly in the identification of low-income, high-ability students (Siegle & Powell, 2004) .\n\nPrompt: You are home from the long meetings, with the ordinances being debated now by the Council of Elders. With all that you have learned, you look around your house and think, \"I've got to get ready. \" What will you do to protect yourself and your family from the plague? Why will you do these things? The response provides multiple ideas about how the author might protect against the plague. The ideas offered suggest a multi-faceted approach to combating the plague, which combines multiple perspectives. Most or all of the ideas are supported with explanation that articulates why the plan of action is appropriate. All ideas are reasonable, considering the 13 th century information available. Ideas are well elaborated and clear.\nEvidence of sophisticated thinking, but some reader inference or further elaboration is necessary for a higher score. The response provides multiple ideas about how the author might protect against the plague. Most or all of the ideas are supported with explanation that articulates why the plan of action is appropriate. All ideas are reasonable, considering the 13 th century information available. Minimal amounts of reader inference may be necessary due to lapses in clarity or weak elaboration of ideas.\nEvidence of some understanding, but not sophisticated thinking. The response provides multiple ideas about how the author might protect against the plague. Supporting explanation is weak. All ideas are reasonable, considering the 13 th century information available. The response provides one well-explained idea about how the author might protect against the plague. The idea is reasonable, considering the 13 th century information available.\nThe prompt is addressed in a weak, limited, or unrealistic manner. The response provides at least one reasonable idea about how the author might protect against the plague. Supporting explanation is lacking or requires much reader inference. The response provides one reasonable idea about how the author might protect against the plague. Supporting explanation is weak.\nThe prompt is not addressed with an explanation. The response does not provide any reasonable ideas about how the author might protect against the plague. Table 3 . Insights scoring rubric for the Black Death assignment \"Getting Ready\" Note: Contamination: A response should lose a point if it is contaminated with (1) false information, (2) unreasonable information or ideas, (3) contradictory comments, or (4) a high percentage of off-topic comments.\nPrecise analysis of in situ research is difficult largely because student assignment to classrooms is determined at the beginning of the school year, appropriately based on student needs rather than research needs. In the current study, accurate statistical analysis required controlling for considerable between-classroom differences and the fact that a majority of the TI students were clustered in two classrooms. A General Linear Model Level 5 (Highest) I am so tierd from that meeting, and I need soemthign to eat and dink. I stayed at meeting for 4 hours. First, Need something to keep that pleuge out. We need to always keep our house clear and don't need to leave any food on the floor or outside, because if we don't rats are going to come Second we don't need to bring any thing from the outside/somewhere else, because it could of caught the pleague and coud give it to us, and we could die. Third we need to go tell our neaibors so they can alwo keep out side and their house and outside clean. We need to all come together and put all of our scaps of food in one spot and we can kill all of the rats in one spot in one time. If we do all of these things we probllay can stop the pleauge from comeing to our town."}, {"section_title": "Finding Low-Income Students with Advanced Academic Potential", "text": "While the nation has focused intently on raising standards for low achieving low-income students, the needs of low-income students with advanced academic potential have largely been ignored. The result has been a substantial loss of human potential. Analysis of data\n• volume 7, no. 1 (Spring 2013) from the Early Childhood Longitudinal Study and the National Education Longitudinal Study revealed that nearly 44% of low-income students who are classified as high achieving in first grade are no longer high achieving by fifth grade (Wyner, Bridgeland, & Dijulio, 2007) . A second nationwide longitudinal study of high achievers replicates this trend in both elementary and middle school cohorts, finding fewer low-income than high-income achievers initially and observing a decline of 15-20% in the number of high achievers in low-income groups over the five years of the study (Theaker, Xiang, Dahlin, Cronin, & Durant, 2011) . Similar trends are also found in the results of the National Assessment of Educational Progress where fewer low-income than high-income students score at the Advanced level (Plucker, Burroughs, & Song, 2010) .\nOne explanation for the underachievement of low-income, high-ability students is that low-income classrooms are not designed for high achievers. In many low-income classrooms the curriculum, closely aligned to accountability tests, is overly simplistic and fact-oriented (Gamoran, 2000) . Teachers in low-income classrooms rarely adjust their curriculum to create challenging lessons (Archambault et al., 1993; Westberg, Archambault, & Brown, 1997; Whitton, 1997) , partly because they don't believe they have any advanced students (Callahan, 2005) . While arguably demotivating for all students, this classroom setting is particularly detrimental to the inquiring disposition of the high-ability student (Coleman & Gallagher, 1995; Heller, Calderon & Medrich, 2003; Van Tassel Baska & Stambaugh, 2007) . The peer culture in low-income classrooms also often militates against achievement, discouraging the students with academic potential (Garcia-Reid, Reid, & Peterson, 2005; Rycraft, 1991) . By the time low-income, high-ability students reach middle school, many have become invisible, underachieving relative to their ability and unable or unwilling to draw attention to their potential (Bishop & Pflaum, 2005; Cross, Coleman, & Terhaar-Yonkers, 1991; Van Tassel-Baska & Stambaugh, 2007) .\nLiterature specific to PBL and disadvantaged middle school students is sparse, but generally supports the finding that most students find PBL engaging (Dicintio & Gee, 1999; Gordon, Rogers, Comfort, Gavula, & McGee, 2001 ). This suggests that the challenge of identifying low-income students with advanced academic potential may resolve in a PBL classroom. Problem-based learning is successful with all students, but is particularly well-suited to gifted students' inquiry-oriented learning style (Gallagher, 2008; Sak, 2004) , making it likely that PBL would pique the interest of a low-income gifted student. Initiating learning with student questions about an ill-structured problem opens the door to full participation, regardless of students' background knowledge. The students' questions rouse situational interest which leads to more engaged classroom behavior (Schmidt, Rotgans, & Yew, 2011) . The answers to student questions form the core content of study, allowing teachers to observe how well students apply higher order thinking to discipline-specific information without the expectation of substantial prior knowledge. Students of different abilities and background operate in a more equitable environment where cognitive ability can more easily be distinguished from prior educational opportunity. This kind of identification-in-context has the added advantages of being relatively noninvasive, low-cost, and less time consuming than formal testing (Swanson, 2006) . Project Insights was funded by the US Department of Education to test a method of identifying and serving low-income gifted middle school students. Problem-based learning was selected as the platform to create engaging, standards-based curricula that would benefit all students and also help unearth previously unobserved academic talent. Two research questions guided this investigation: (1) Can use of PBL curriculum in the regular classroom facilitate identification of low-income students with advanced academic potential? and (2) How does the academic performance of the students with advanced academic potential compare to performance of traditionally identified gifted students and the remaining general education students on traditional academic and PBL-specific measures?"}, {"section_title": "Method", "text": ""}, {"section_title": "Participants", "text": "Principals from two low-income middle schools in a small North Carolina community agreed to have their schools participate in Project Insights. School 1 enrolled 96% minority and 84% free-lunch eligible students. School 2 enrolled 75% minority and 57% free-lunch eligible students. Both were designated Title 1 schools based on the percentage of lowincome students in attendance. Although problem-based learning units were developed for each grade as a part of Project Insights, this study focused on the sixth grade because the sixth grade teachers had acquired the most experience and comfort with PBL."}, {"section_title": "Teachers", "text": "Together, the two schools had 14 sixth-grade core-subject teachers who had between one and 31 years of classroom experience. All of the teachers were female; two were minorities and 11 were Caucasian. None of the regular classroom teachers was certified to teach gifted students, but each school employed a gifted-certified consultant teacher. The gifted consultant of each school served as team leader, coordinator, and classroom aid for the regular classroom teachers as they taught the PBL units.\nAll 14 sixth-grade teachers taught the PBL units; 13 teachers participated in the study. The remaining teacher taught the units but went on leave during the project; her classroom was excluded from the analysis.\n• volume 7, no. 1 (Spring 2013)"}, {"section_title": "Students", "text": "All sixth-grade students in the two schools participated in the study; 271 were included in the analysis of 13 classrooms. The group included 136 males and 135 females. Onehundred and sixty-nine of the 271 students were enrolled in the Free Lunch program. Twenty-one of the 271 students were Caucasian.\nTwenty of the 271 students were identified as gifted using the district criteria. Identification was based on a combination of scores on the Otis-Lennon School Abilities Test (OLSAT), the North Carolina End of Grade (EOG) accountability test, classroom performance measures, and teacher recommendations. The 20 sixth-grade students identified as gifted by the school district comprised the traditionally identified (TI) group in the analysis."}, {"section_title": "Curriculum", "text": "The PBL units designed for Project Insights followed the model presented by Barrows and Tamblyn (1980) in most respects: (1) study was initiated using an ill-structured problem, (2) student questions drove inquiry, and (3) instruction emphasized metacognition and self-reflection. Students were asked to take on the perspective of a significant stakeholder in the problem, paralleling the practice of having medical students adopt the role of a medical professional. Consistent with recommended practice in PBL, academic scaffolds were incorporated to ensure that students engaged in study that was challenging but accessible (Gallagher, 2009b; Hmelo-Silver, Duncan & Chin, 2007) . For example, students in Project Insights were unused to self-direction and required substantial assistance as they made their first attempts at directing their own investigation. Scaffolds provided included structured note-taking guides, a research center with information matching their reading level, and critical thinking exercises that helped students construct reasonable inferences from their research information. Student work was gathered in a portfolio called a problem log (Gallagher, 2011) . The problem log contained a record of questions the students pursued, research notes, critical thinking activities, and reflective moments that engaged students in metacognitive reflection about the problem-solving process.\nBoth PBL units addressed questions of disease and public response to actual or perceived risk. Black Death (Gallagher, 2011) was a social studies unit about the outbreak of bubonic plague in 1348. In this unit students were given the stakeholder role of a villager on the council of elders in a northern Italian town. A meeting of the elders is convened where they learn that a devastating plague is moving towards their city; their charge is to figure out how to ward off the disease or minimize its effects on their town. Activities in the unit were designed to respond to predictable student questions: How will the disease arrive? Is there a treatment? How is it transmitted? What are other towns doing to try to keep the disease at bay? Students' research led them into the geography of Europe and Asia, the primitive understanding of illness, and the debilitating effect the plague had on individuals, families and the infrastructure of towns and cities.\nBlack Death was followed by Mosquito Coast (Gallagher, in press ) a contemporary science PBL unit. In this unit, students in the role of medical entomologists investigate a case of West Nile Virus. As they investigate their case they learned about the disease, its prevalence, and the impact of media coverage on perceived public risk. They learned that while West Nile Virus has some surface symptoms similar to bubonic plague, they are very different diseases. Then, when they discovered that some parents in the community wanted the child's school closed to avert a 'coming plague' they turned their attention to disease vectors, with a specific emphasis on the mosquito's life cycle and feeding habits. They also conducted a site check of the schoolyard to assess the likelihood that it was an unusually accommodating habitat for mosquitoes. As a culminating activity students presented an assessment of the danger presented by the disease at a mock press conference. Each of the units was pilot tested at least once and revised in the year prior to the study."}, {"section_title": "Procedures", "text": ""}, {"section_title": "Teaching the Insights PBL Units", "text": "Teachers received professional development in PBL before they taught the units including: (a) a day-long training in PBL in the early days of the school year, (b) 2-3 half-day sessions specific to the project units, and (c) ongoing coaching and troubleshooting as they taught the units. Training included simulated experience in a PBL unit, however, not all teachers had a simulated experience with the units they would later teach. Teachers from School 2 had an opportunity to watch teachers from School 1, who taught the units earlier in the school year. Project teachers also received training in the behaviors associated with advanced academic potential.\nAll sixth grade teachers taught the PBL units during a common 90-minute block. They used their planning period to meet with the gifted consultant teacher to go over plans, anticipate materials needed for the next day, and discuss any changes needed to respond to questions students raised during class. Teachers frequently team taught different elements of the units. Black Death was taught first and lasted around six class periods. Mosquito Coast began the day after Black Death and was completed in seven class periods."}, {"section_title": "Teacher Selection of Students With Advanced Academic Potential", "text": "At the conclusion of the second unit, the 13 project teachers were asked to identify students who showed behaviors consistent with advanced academic potential during the PBL units. Teachers were told to choose only from among students who were not already identified gifted. The group of 34 students identified by the teachers were termed ad-\n• volume 7, no. 1 (Spring 2013) vanced academic potential (AAP) because they showed attributes of advanced, higher order thinking during PBL even though they did not meet the district criteria for giftedness."}, {"section_title": "Measures", "text": "Two types of measures were used in the current study: (1) traditional achievement measures routinely collected by the school system, and (2) measures designed specifically for this study."}, {"section_title": "Standardized Achievement Measures", "text": "Students' fifth grade mathematics and language arts scores on the North Carolina End of Grade (EOG) test were included in the analysis to compare the achievement levels of AAP students with the achievement of traditionally identified (TI) gifted students and the remaining general education (GE) students."}, {"section_title": "PBL Measures", "text": "The problem based learning measures included the teachers' scores using the Classroom Engagement Rubric and the PBL rubrics for judging student performance in science and social studies.\nTeacher ratings. The teachers used the Classroom Engagement Rubric (Gallagher, 2011) as a means of judging students' level of engagement in the PBL units. The rubric includes a five-point rating scale along three dimensions of classroom engagement: quality of individual participation, effectiveness in group work, and in-class participation. Teachers were asked to rate each student at the end of each unit; the sum of these ratings were used as the Teacher Rating variable. A copy of the Classroom Engagement Rubric is included as Table 1 .\nAcademic performance during PBL. Table 2 shows the three academic performance variables that were constructed from assignments embedded in the PBL units. Each Insights variable was constructed from two separate assignments: Insights Science was constructed from assignments in Mosquito Coast; Insights Social Studies was constructed from assignments in Black Death, and the Insights PBL Knowledge variable combined one assignment from each unit."}, {"section_title": "Data Collection", "text": "The teachers' judgment of academic potential required objective validation. This objective assessment was achieved by sending student responses to a team of three independent evaluators. Teachers gathered student responses to three designated assignments from each PBL unit; the resource teacher for each school replaced identifying information with code numbers representing student and teachers. These assignments were then sent to the evaluation team who were located in a different region of the state and had no interaction with project students. The evaluation team, comprised of the junior author and two graduate assistants, developed five point rubrics to gauge the quality of students' responses for each assignment. Table 3 is a sample scoring rubric for one of the assessments in Black Death. Benchmark responses for each of the five levels of the rubric were drawn from student work gathered during pilot testing the previous year; sample benchmark responses are presented in Table 4 . The three raters independently scored each student response aided by the rubric. The judges' agreement rate was over 80%; disagreements in ratings were resolved through discussion and consensus of the judges."}, {"section_title": "Dimension", "text": ""}, {"section_title": "Data Analysis", "text": "Three groups were part of the analysis; traditionally identified gifted students (TI) (n = 20), teacher-identified advanced academic potential students (AAP) (n = 34), and the remaining general education (GE) (n = 217) sixth grade students. Possible differences in group composition on demographic variables were analyzed using a one-way Analysis of Variance (ANOVA). A chi-square analysis was then conducted to determine specific differences between groups. "}, {"section_title": "Level 4", "text": "What would I do? I would exsterminate all fleas, ordens, and I will fill my house up with purifying odors. I would also use any other meathod that I have learned. I would change my diet and eat less meat and more vegetables. These things I would do to prevent my family from getting infrected. Cates, dogs, or any other animal that attracts fleas, or rats will be exed out of my house I will listen to anything to prefent my family from getting infectious, I will even board up my house with bricks and stones! Level 3 I would keep away from the topoel that has the Black Dath. Also I, would wear the crow costumes that protects your whole body. I would eat right and keep healthy so it would be harder for my family and I to catch the Bleack Death. I would do those things so myfmaily and I wouldn't be in danger of catching the Black Death.\nLevel 2 I will nto let the people enter my house or my town. I will do these thigns so my family want catch tha plague. Also is because I love them and I don't want my family to get very very il and die. I also will try not to let my friends catch it cause we will need something to do instead of going to a funeral every 2 weeks. My friends mean much to me like my familiy only my true friends. That is what I will do so my family -n-friends want catch the plague."}, {"section_title": "Level 1", "text": "What wil I do to protect my family is to stay in the house and don't never come outside for nothing less you getting in your car. You can get desease from the flees the most important thing is that they do not take baths so it can opened up there pours. (GLM) analysis using nested fixed effects model 1 with a set of twelve dummy variables representing the effects of each class was considered the most rigorous approach. Type III tests were used to account for the substantial differences in the size of the subgroups. Subsequent pair-wise comparisons of the adjusted means were used to determine which differences in means were large enough to reject the null hypothesis that the groups were the same. Effect sizes were calculated by dividing the pair-wise adjusted mean differences by the standard deviation of the outcome variable. These numbers closely resemble Cohen's d (Cohen, 1988) , and carry similar interpretation. While guidelines on how to interpret the magnitude of effect size varies, most accept the standard that an effect size of .25 is educationally meaningful (Slavin, 1990) ; that the standard was used when interpreting study results."}, {"section_title": "Results", "text": "Two questions framed the current research: (1) Can use of PBL curriculum in the regular classroom facilitate identification of low-income students with advanced academic potential? and (2) How does the academic performance of students with advanced academic potential (AAP) compare to performance of traditionally identified (TI) gifted students and the remaining general education (GE) students on traditional academic and PBL-specific measures? Table 5 presents the demographic distribution of students in the TI, AAP, and GE groups. The three groups had similar proportions of male and female students but varying proportions of minority students and Free Lunch participants. Minority students comprised 45% of the TI students as compared to 82% of the AAP and 99% of the GE students. Only 5% of the TI and 7% of the AAP qualified for the Free Lunch program, as opposed to 76% of GE students. Table 5 . Proportion of male, minority and free lunch qualified students in Traditionally Identified, Advanced Academic Potential, and General Education Groups *p < .01"}, {"section_title": "Demographic Distribution", "text": "• volume 7, no. 1 (Spring 2013)"}, {"section_title": "Study Variables", "text": ""}, {"section_title": "General Linear Model Comparisons", "text": "Significant differences emerged when the mean scores for the three study groups were submitted to the General Linear Model analysis using a nested, fixed effects model. Unadjusted average scores for each group on all study variables are presented in Table 6 . After adjusting for classroom the relationship between most outcome variables and TI, PG, or GE group was significant: EOG English F (2, 235) = 8.30, p < .0003, Insights PBL Understanding F (2, 210) = 3.85, p < .0229, Insights Science F (2, 212) = 4.39, p < .0136, Insights Social Studies F (2, 210) = 3.85, p < .0229, Insights Teacher Ratings F (2, 233) = 30.62, p < .001. Differences on EOG Math bordered on significance F (2, 235) = 2.83, p < .06. Because this bordered on significance it was included in the post hoc analysis to investigate possible differences in effect size in pairwise comparisons."}, {"section_title": "Pairwise Comparisons", "text": "In order to control for classroom and ability levels the General Linear Model analysis used a nested fixed effects model that was applied to the data. the General Education (GE) group that favored gifted students on EOG English M = 5.55, SD = 1.49, p < .001, d = 0.79. Differences between TI and GE students on EOG Math were not significant but had a moderate effect size (M = 3.10, SD = 1.45, d = 0.38).\nDifferences favoring the TI students over the AAP students were found for EOG English (M = 3.64, SD = 1.72, p< .05, d = 0.52) and EOG Math (M = 1.93, SD = 1.68, d = 0.24). A small difference favored the AAP students over GE students on the EOG English measure (M = 1.91, SD -0.99, d = 0.27), and there was no difference on EOG Math (M -1.17, SD = 0.96, d = 0.14). AAP and GE students appear quite similar to each other; differences that were observed were generally of a smaller magnitude than the difference between either of these groups and the seemingly more capable TI group.\nInsights variables. A different picture emerged in the data taken from the objective ratings of the PBL lessons. The TI group was still different from the GE group on all three measures (PBL Understanding M = 1.46, SD = 0.58, p < .05, d =0 .61, Insights Science M = 0.61, SD= 0.64, d = 0.25, Insights Social Studies M = 0.84, SD = 0.53, d = 0.36) . The AAP group was also different from the GE group on two of the three PBL measures. The difference on the Science (M= 1.26, SD = 0.44, p < .01, d= 0.51) was of moderate magnitude, and a smaller but meaningful difference was also observed for the Insights Social Studies "}, {"section_title": "Discussion", "text": "Findings of this study suggest that using PBL in the regular classroom can help identify students with advanced academic potential who might be overlooked using standardized testing, particularly low-income students. Meaningful differences in academic performance were observed among the three groups. When viewed through the lens of standardized tests, the AAP students seem similar to the GE students, when viewed through the lens of PBL assignments AAP students seemed more similar to the TI students.\nThe AAP students scored higher than GE students on two independent measures: the Insights Teacher Rating, which measured classroom engagement, and the Insights Science and Social Studies tasks, which measured student work with discipline-specific content. The teachers rated the AAP students higher in classroom engagement than either the TI or the GE students. The teachers' high ratings of the AAP students are reflective of their expressed excitement at seeing new qualities in these students during the PBL units. Feedback gathered from focus group discussions with the teachers during project evaluation gives voice to the changes they saw in their students, as in these representative comments:\nAt first [my students] were expecting me to give them information, but after that, realizing they were on their own, I think that they really enjoyed being in charge for a while.\nI didn't have a single student that said, \"I can't do this, \" and that's unusual.\nI have a student, most everything we do she'll complain, but this time she took it away. She even got up and explained to the students in her group.\nI have a student who is painfully shy, does not like to be called on in class. You can see him struggle through it, but he finally had to tell it. From then on, when he realized that he was really getting the point . . . you could see his confidence level go up.\nMy troublemakers really did well. My kids even said, \"He got it right. \" And I said, \"Yeah, \" They don't do anything in my class-nothing-and they were raising their hands for the [Learning Issues Board], they were doing it all.\nIndependent raters who never met the students validated the teachers' choices: They judged AAP products to be of similar quality to TI students on Insights Social Studies and somewhat superior to TI students on Insights Science. It appears that even though the AAP students may lack content knowledge assessed on the standardized tests, they have a capacity to use higher order thinking skills that their GE classmates did not evidence. The classroom environment created by PBL seems to have attracted reluctant learners, drawing out more observable academic behaviors like those assessed in the study including active research, making comparisons, and drawing inferences. The results have implications for educators working with low-income populations, for educators interested in identifying high-ability in low-income populations, and for practitioners interested in PBL.\nThe current results provide further evidence that family income is a more intractable barrier to academic performance than race or ethnicity. Only three students in the AAP group, 7%, qualified for the Free Lunch program, dramatically lower than the 76% Free Lunch qualified students in the remaining GE population. In comparison, 82% of the AAP group was minority, not quite on parity with the 99% in the GE population, but substantially closer than the 45% in the TI group. The education gap created by income disparity requires much more intensive intervention than three weeks of science and social studies can provide.\nThe number of students identified as AAP by teachers during the PBL units was nearly two times the number of TI gifted students. Even if half of these students ended up being \"false positives\"-unlikely given the independent validation-the number of students considered gifted would double. This validates the contention of national reports that a significant number of talented students remain unidentified and under challenged (VanTassel-Baska & Stambaugh, 2007) . The results also suggest a need for more research testing identification methods that are organic to the classroom and curriculum based. Teachers are often asked to nominate students for gifted programs based on qualities related to academic engagement; results presented here give evidence that some students will not demonstrate academic engagement in the absence of engaging tasks. Current results suggest that PBL should continue to be an integral part of this research.\n• volume 7, no. 1 (Spring 2013)\nThe results also suggest that the benefits of the PBL classroom go beyond content delivery, skill development, and enhanced engagement. In this study the gestalt formed by combining ill-structured problems, self-directed learning and guided instruction created a positive change in the way teachers viewed their students, and a discernible change in performance on academic tasks. Findings presented here add to the body of research that demonstrates that high quality standards-based PBL curriculum is a valuable addition to the classroom.\nThis study documents a first attempt at assessing the ancillary benefits of using PBL in the regular classroom. One of these benefits seems to be the opportunity to identify students who have advanced academic potential. However, first attempts also invariably reveal ways to improve in the future. For instance, the teachers did well as novice PBL instructors, but they would have benefitted from additional professional development. As is often the case in classroom-based research it was impossible to control student placement in classrooms. General Linear Model statistics can help account for the lack of random assignment but random assignment is still preferable.\nA final limitation relates to the scope of the findings. While the results seem promising, they do not establish with certainty that these students are academically gifted. They instead give evidence that they have qualities associated with giftedness, especially the inclination to respond well to open-ended learning environments, and the ability to apply higher order thinking skills to a given set of information. Now they have been noticed, these students need continued exposure to PBL and other inquiry based models, both because continued high level performance will be the best confirmation of the results and because the recognition of academic potential should always open the doorway to advanced instruction. Replication and extension of this study is necessary to determine whether or not these results can be generalized to different grades, subject areas, and student populations.\nRegardless of the limitations, the results point yet again to the potential value PBL brings to the classroom. In this study students were so engaged by the ill-structured problem they didn't notice that they are working harder and thinking more. Relieved of the role of information dissemination, teachers had a chance to watch their students interact with information. In the end they saw more academic potential in more students. The fact that Project Insights schools continued to use this model after the project's completion suggests that the approach holds promise as a feasible, affordable, and effective recipe for enduring practice."}]