[{"section_title": "Abstract", "text": "Introduction: The objective of this study was to determine the factors including neuropsychological test performances and cerebrospinal fluid (CSF) biomarkers which can predict disease progression of early Alzheimer's disease (AD) in a Japanese population. Methods: The group classification on early AD population in both Japanese Alzheimer's Disease Neuroimaging Initiative (J-ADNI) and North American ADNI (NA-ADNI) was performed using the inclusion criteria including brain amyloid positivity on positron emission tomography or CSF. Participants with early AD from each cohort were stratified into two groups based on a cutoff 1.0 of Clinical Dementia Rating Scale Sum of Boxes (CDR-SB) change at month 24 (m24): participants in \"progress group\" have CDR-SB change 1.0 and participants in \"stable group\" have CDR-SB change , 1.0. Then, we performed identification of prognostic factors from baseline items including neuropsychological scores (Assessment Scale-Cognitive Subscale[ADAS-cog 13], Mini-Mental State Examination (MMSE), CDR, FAQ, and Geriatric Depression Scale ), CSF markers (t-tau, p-tau, and beta-amyloid 1-42), vital signs (body weight, pulse rate, etc.,), by using two statistical approaches, Welch's t-test and simple linear regression by ordinary least squares. Comparisons between participants with J-ADNI and participants with NA-ADNI were also performed. Results: Trends of CDR-SB changes were very similar between J-ADNI and NA-ADNI early AD population enrolled in this study. Baseline levels of CSF t-tau, p-tau, Mini-Mental State Examination, FAQ, and ADAS-cog13 were identified as prognostic factors in both J-ADNI and NA-ADNI. Based on a detailed subscale analysis on ADAS-cog13, four subscales (Q1: word recall, Q3: construction, Q4: delayed word recall, and Q8: word recognition) were identified as prognostic factors in both J-ADNI and NA-ADNI. Discussion: Characterizing population with early AD can provide benefits for promoting efficiency in conducting AD clinical trials for disease-modifying treatments. Thus, implementing these 1 These authors contributed equally to the manuscript. 2 Data used in preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (adni.loni.usc.edu). As such, the investigators within the ADNI contributed to the design and implementation of ADNI and/or provided data but did not participate in analysis or writing of this report. A complete listing of ADNI investigators can be found at:"}, {"section_title": "Introduction", "text": "Drug development targeted to altering disease progression in Alzheimer's disease (AD) has faced numerous challenges through multiple clinical trial failures. What we learned from past clinical studies is that one of the major underlying causes for failures was inappropriate patient selection. So, clinical development strategies need to be optimally modified to demonstrate disease-modifying effects in suitable patient population and, thereby provide substantial benefits over existing symptomatic relief. The current knowledge of the pathological process in AD suggests that the therapeutic window for disease-modifying therapies targeting beta-amyloid (Ab) should be moved earlier in the disease course. Therefore, based on the current understanding of the disease process and the underlying pathology, the scientific community has begun to focus on developing treatments for patients with \"early AD\". This shift in focus has been made possible by the development of new diagnostic criteria for the clinical diagnosis of AD in clinical research studies, which were published in recent years by the National Institute on Aging (NIA) and the Alzheimer's Association (AA) and by an International Working Group (IWG) [1] [2] [3] [4] . These criteria address the need to define the clinical diagnosis of the predementia phases of AD (e.g., mild cognitive impairment [MCI] due to AD) and to improve specificity of diagnosis by incorporating biomarkers of AD pathology into the diagnostic process. In 2014, IWG criteria were updated (IWG-2) [5] , and key members of both the NIA-AA and IWG working groups published criteria that harmonized both sets of criteria [6] . The improved diagnostic framework, combined with the ability to confirm underlying disease pathology by use of cerebrospinal fluid (CSF) biomarkers or amyloid positron emission tomography (PET), has enabled more accurate diagnosis of AD in participants with predementia. In keeping with these and other advances in the field, including the harmonization of diagnostic criteria for AD, pharmaceutical companies have been developing disease-modifying therapies targeting Ab as a treatment for MCI due to AD and mild AD dementia, based on the premises of the amyloid cascade hypothesis in which reducing amyloid plaques could lead to a slowing of cognitive decline in patients with AD. Indeed, some candidate drugs are currently being studied in phase 3 studies in participants with MCI due to AD or mild AD dementia. Participants are also required to test positive for cerebral Ab based on PET imaging or CSF testing, to ascertain significant presence of hallmark neuropathological changes in the brain. However, some disease-modifying therapeutics have failed to provide statistically significant clinical benefit in the early stage of AD who had biomarker evidence of brain Ab deposition [7] . Given the present status of AD drug development, one explanation for failures of clinical trials for disease-modifying treatments targeting amyloid cascade hypothesis could be heterogeneity of target population in clinical progression of AD, which often tended to cause considerable variation in treatment effects across the trial population [8] . Thus, the course of cognitive decline in AD varies significantly between individuals, which may make it difficult to detect the effects of treatment in clinical trials for AD. The Feb 2018 Food and Drug Administration Guidance notes that there is currently no consensus as to which AD biomarkers will support clinical findings in trials in early AD [9] . Owing to lack of understanding prediction of clinical courses, assessment methods such as evaluating proper biomarkers to identify AD subpopulations as potential targets for clinical trials have not been established [10] . Therefore, the identification of prognostic factors which potentially allows us to predict clinical outcomes in target population has been considered to be necessary to evaluate the effects of treatment more sensitively considering these variables.\nMCI is a common disorder characterized by a cognitive decline and changes in cognition range between those typically associated with aging and those fulfilling the criteria for MCI related dementia. Although MCI has been considered as a transitional stage between cognitive changes of normal aging and dementia, particularly AD, some studies suggest that many individuals diagnosed with MCI do not progress to dementia, and many MCI patients remain cognitively stable over time and may even revert to normal particularly in community-based settings [11] [12] [13] .\nGiven the inherent heterogeneity of MCI, more efforts on the characterization of MCI population have been focused on searching for prognostic factors which make patients more susceptible to clinical progression. The North American Alzheimer's Disease Neuroimaging Initiative (NA-ADNI) has been leveraged to provide crucial evidence for identification of prognostic factors that can be objectively measured and evaluated as indicators of normal biological processes or pathogenic processes in US population with AD. Many studies through different approaches using NA-ADNI have showed several factors including CSF biomarkers and that cognitive measures could provide prognostic insight regarding cognitive decline and conversion to AD in patients with MCI [14] [15] [16] [17] [18] [19] . However, prognostic factors to determine rates of progression at the early stages of AD remain to be elucidated in Japanese populations. Therefore, data analysis on Japanese population with early AD is required to answer questions of how they would progress in cognitive function and which factors would contribute to disease progress. The Japanese ADNI (J-ADNI) was the first large-scale longitudinal observational study in Japan, conducted between 2008 and 2014, following NA-ADNI, to elucidate the natural history of the early stages of AD in the Japanese population [20] . Recently, the J-ADNI, in which participants with mild AD, MCI, or normal cognitive health followed the same protocols as NA-ADNI for maximum of three years, has shown that people with late MCI worsened at the same rate as in J-ADNI and NA-ADNI, suggesting J-ADNI can provide valuable data on Japanese population in patients with AD.\nOur goal with the present study is to better understand clinical profiles in Japanese early AD population and identify potential prognostic factors which are highly predictive of clinical progression in this population. Furthermore, we also aimed to investigate the same set of factors in early AD participants defined within NA-ADNI using the same methodological approaches."}, {"section_title": "Methods", "text": ""}, {"section_title": "Data acquisition", "text": "The entire approval for this study was obtained from the Eisai Ethics Committee (110010143). J-ADNI data (accession: JGAD00000000051) were downloaded from the National Bioscience Database Center (Tokyo, Japan, https://humandbs.biosciencedbc.jp/en/hum0043-v1). Demographic features, vital signs, neuropsychological scores, PET and CSF biomarkers including Ab 1-42 (Ab42), total tau (t-tau) and phosphorylated tau (p-tau) measured by multiplex-based assay (INNO-BIA AlzBio3) were extracted from three files named JGAZ00000000134, JGAZ00000000135, and JGAZ00000000136. NA-ADNI data were downloaded from the ADNI database (http:// adni.loni.usc.edu/). Demographic and diagnosis data were extracted from a table named \"ADNIMERGE.csv\" (version as of 29th Aug. 2016). There were some variations of CSF datasets measured by different technology available in NA-ADNI. We used the University of Pennsylvania biomarker dataset measured by INNO-BIA AlzBio3 which was compatible to J-ADNI CSF data. Assessment Scale-Cognitive Subscale (ADAS-cog13), Clinical Dementia Rating (CDR), and their subscales were extracted from individual files named \"ADASSCORES.csv\" and \"CDR.csv\", respectively."}, {"section_title": "Definition of early AD population", "text": "In this study, participants were identified as populations with early AD separately using J-ADNI and NA-ADNI. For J-ADNI, individuals who met all the following criteria were considered as having early AD: (1) diagnosis at baseline was MCI or mild AD; (2) Mini-Mental State Examination (MMSE) 24; (3) CDR-global 5 0.5; (4) Ab accumulation was positive, where Ab positivity was defined as either CSF-Ab42 concentration 333 (pg/mL) [20] or visual read of amyloid PET (11C-PiB PET or 11C-BF227 PET) of \"positive\" or \"equivocal\". For NA-ADNI, participants were considered as having early AD who met all of the following criteria: (1) diagnosis at baseline was late MCI or mild AD; (2) MMSE 24; (3) CDR-global 5 0.5; (4) CSF-Ab42 concentration 192 (pg/mL) or 11C-PIB (suvr) 1.47 or 18F-AV45 (suvr) 1.13 [14, [21] [22] [23] . Utilizing these criteria to define early AD, 91 participants were selected from J-ADNI and 336 participants were selected from NA-ADNI."}, {"section_title": "Stratification based on Clinical Dementia Rating Scale Sum of Boxes change", "text": "Change from baseline in the Clinical Dementia Rating Scale Sum of Boxes (CDR-SB) (hereafter, CDR-SB change) at each visit was calculated for each participant by subtracting their baseline values. Early AD participants were further stratified into two groups based on a cutoff 1.0 of CDR-SB change at month 24 (m24): participants in \"progress group\" have CDR-SB change 1.0 and participants in \"stable group\" have CDR-SB change , 1.0. Of the 91 J-ADNI participants, 15 participants were excluded at this stage because of the missing data of CDR-SB score at m24 required for group categorization. The final J-ADNI population consists of 76 participants (19 participants in stable group vs. 57 participants in progress group). Similarly, NA-ADNI population was narrowed down to 249 participants (84 participants in stable group vs. 165 participants in progress group), by excluding 87 participants because of the missing data of CDR-SB score at m24."}, {"section_title": "Statistical analysis", "text": "To find baseline items that influence CDR-SB change, we explored baseline items assessed in J-ADNI population, including neuropsychological scores (ADAS-cog13, MMSE, CDR, and Geriatric Depression Scale ), CSF markers (t-tau, p-tau, and Ab42), vital signs (body weight, pulse rate, etc.), as well as demographic characteristics (age and educational years). To evaluate the relationships between baseline items and CDR-SB change at m24, we used two statistical approaches. The first one is two-group comparison: comparing baseline values between stable and progress group by Welch's t-test. The second approach is simple linear regression by ordinary least squares, in which relationship between baseline values of each item and CDR-SB changes was modeled by a linear function. In contrast to t-test which just detects items with different baseline values between progress and stable group, linear regression was used to find items whose baseline values show linear relationship to CDR-SB change at m24. Two statistical approaches were performed independently for each baseline item. Finally, items detected by at least one approach with statistical significance (P , .05) were identified as candidates. To ensure reproducibility, the candidates identified in J-ADNI population were also evaluated in NA-ADNI population by repeating the same statistical procedure. P values are also used to compare the impact of each item within each cohort. "}, {"section_title": "Software and packages", "text": ""}, {"section_title": "Results", "text": ""}, {"section_title": "Demographics of population with early AD", "text": "Demographics and baseline neuropsychological characteristics of early AD populations enrolled in this study were summarized in Table 1 . Except for education (2.67 years shorter in J-ADNI), other demographic features (age, sex, and frequency of APOE ε4 carries) were comparable between the two populations. Although MMSE and ADAS-cog 11 scores were slightly lower in J-ADNI participants than NA-ADNI participants (0.44 points lower for MMSE and 1.31 points lower for ADAS-cog 11), there were no significant differences between J-ADNI participants and NA-ADNI participants in other baseline neuropsychological scores (CDR-SB, ADAS-cog 13, and FAQ)."}, {"section_title": "Trend of CDR-SB changes", "text": "CDR-SB was monotonically increased during three years in J-ADNI population (Fig. 1A) , indicating cognitive decline in total participants. The mean value of CDR-SB changes at m24 was 1.97 times higher ( Supplementary Table 1 ). A very similar trend was also observed in NA-ADNI population ( Fig. 1B) , in which the mean value of CDR-SB changes at m24 was 1.90 times higher. The difference at m24 between the two populations was just 0.07, suggesting the two early AD populations elucidated in this study show almost identical rate of cognitive decline for at least two follow-up years. Moreover, stable group exhibited a very slow rate of cognitive decline (Fig. 1C and D) , whereas progress group showed a steep increase in both population: 2.74 and 2.91 times increase at m24 in both J-ADNI and NA-ADNI, respectively."}, {"section_title": "Identification of prognostic factors in J-ADNI population", "text": "As shown in Table 2 , a total of 13 baseline items were identified by at least one statistical approach with statistical significance (P , .05) in J-ADNI population, of which 10 items were also detected in NA-ADNI population. CSF markers demonstrated that baseline levels of CSF t-tau and p-tau were statistically significantly higher (P ,.05) in progress group compared to stable group in both J-ADNI and NA-ADNI population (Fig. 2) , whereas there was no difference in Ab42 value (data not shown).\nMMSE baseline scores showed negative correlation with CDR-SB changes (lower MMSE baseline scores indicating high CDR-SB changes) in both populations (Fig. 3A) . Baseline scores of FAQ, and ADAS-cog 13 were positively correlated with CDR-SB changes in J-ADNI with high statistical significance (all coefficients showing P , .005), which was consistent with NA-ADNI population ( Fig. 3B and C) .\nOf all items explored in this study, ADAS-cog 13 showed the smallest P values in multiple conditions (linear regression in J-ADNI; both t-test and linear regression in NA-ADNI) as shown in Table 2 , implying 7-points increase on ADAS-cog 13 at baseline is equivalent to 1 point increase of CDR-SB changes at m24. Given this situation, we performed further analysis of ADAS-cog individual subscales. At the subscale level of ADAS-cog13, four subscales (Q1: word recall, Q3: construction, Q4: delayed word recall, and Q8: word recognition) were identified in both populations ( Table 2) . Among these items, Q1 (word recall) and Q4 (delayed word recall) were detected by both t-test and linear regression in NA-ADNI with smaller P-values, compared with other subscale items ( Table 2 and Fig. 3D ). On the other hand, three subscales (Q6: ideational praxis, Q11: word finding, and Q14: number cancellation) were NOTE. Percent of APOE ε4 carriers in NA-ADNI was calculated by 233 APOE ε4 positive carriers out of 334 NA-ADNI participants because of two missing participants of APOE ε4 data in NA-ADNI participants.\nAbbreviations: N, the number of participants in each population; n, the number of participants for relevant category; SD, standard deviation; J-ADNI, Japanese Alzheimer's Disease Neuroimaging Initiative; NA-ADNI, North American Alzheimer's Disease Neuroimaging Initiative. identified in J-ADNI population alone. Especially, ADAS-Q14 (number cancellation) also showed the high statistical significance in J-ADNI (P , .0005), although statistical significance was not detected in NA-ADNI ( Fig. 3E )."}, {"section_title": "Discussion", "text": "In this study, we performed the exploratory analysis using both J-ADNI and NA-ADNI. Our findings from this study demonstrated that CDR-SB changes of early AD population in J-ADNI cohort had a very similar trend to the equivalent population in NA-ADNI cohort. Furthermore, with the exploratory analysis, we identified CSF t-tau, p-tau, MMSE, FAQ, ADAS-11, and ADAS-13 as prognostic factors to detect cognitive decline in CDR-SB. Based on a detailed subscale analysis on ADAS-cog13, four subscales (Q1: word recall, Q3: construction, Q4: delayed word recall, and Q8: word recognition) were identified as potential prognostic factors.\nWhile a substantial number of studies using NA-ADNI have been conducted to identify the risk factors for AD, our present study explored the J-ADNI data to identify the prognostic factors influencing cognitive decline in early AD population for the first time. In addition to analyzing the Japanese population, the comparison of J-ADNI and NA-ADNI for exploring prognostic factors was conducted to confirm consistency between both populations. Furthermore, this is the first longitudinal, observational study of patients with early AD in Japanese population to estimate clinical progression.\nThere is growing evidence from multiple previous studies in different populations that t-tau, p-tau, and Ab42 in CSF are strongly associated with clinical progression of patients with MCI [14, [24] [25] [26] [27] . Thus, these CSF biomarkers stemming from the pathomechanism of AD will help detect the early stages of AD and improve early and differential diagnosis in clinical settings. Consistent with the evidence, CSF t-tau and CSF p-tau were identified as prognostic factors in both J-ADNI and NA-ADNI in this study. However, the lack of statistical significance in CSF Ab42 may be related to the fact that early AD participants were identified in part using CSF Ab42.\nAlthough many different cognitive screening tests are available in clinical practice, MMSE has been the most commonly used instrument in detecting cognitive impairment. Thus, with easy accessibility, MMSE has been used as the first step in detecting cognitive impairment. However, one of the important shortcomings MMSE has faced is its limited effectiveness for detecting early phase of cognitive impairment, which has been raised by poor sensitivity in detecting MCI and an at-risk status for cognitive progression due to several factors including the ceiling effects [28] [29] [30] ; given the fact, ADAS-cog was originally developed as a rating scale to evaluate cognitive functions on AD population and it has gone through many modifications to optimize this assessment method [31] . Based on the data showing that ADAS-cog 13 has the smallest P values in either J-ADNI or NA-ADNI, it is reasonable that ADAS-cog 13 could be the most important factor to evaluate the prognosis of patients with early AD. This finding is very convincing because it has been shown that ADAS-Cog 13 was identified as the strongest predictor for conversion from MCI to AD in ADNI by using joint modeling of longitudinal and time-toevent data [16] . Furthermore, among four ADAS-cog 13 subscale items (Q1: word recall, Q3: construction, Q4: delayed word recall, and Q8: word recognition) identified as prognostic factors in this study, Q1 (word recall) and Q4 (delayed word recall) were detected by both t-test and linear regression in NA-ADNI with smaller P values ( Table 2 and Fig. 3D ). Similar to findings from other previous reports [32] [33] [34] , these findings imply these two subscale items might be more sensitive parameters for forecasting clinical outcomes.\nOver the past decade, significant progresses have been made in the development and validation of biomarkers to capture core AD neuropathological features, leading to the establishment of the amyloid, tau, and neurodegeneration classification system proposed by the 2018 NIA-AA Research Framework [35] . In the clinical trial settings, given the fact that a significant number of amyloid negative subjects were included in the past phase II/III tri-als, more recent or on-going late phase trials in prodromal or mild AD implemented enrichment strategies based on the status of amyloid deposition measured through PET imaging and CSF analyses of Ab levels [36] . However, the implementation of tau pathology by using tau PET limits their widespread application for most global AD trials because of the expense and relative limited availability of tau PET imaging uniformly throughout various regions. Furthermore, the technical issues such as batch-to-batch variations in the assays and lack of valid cutoff levels have added to the challenges associated with the implementation of CSF tau analyses in routine AD clinical trials [37] . Therefore, despite the current emphasis of the amyloid, tau, and neurodegeneration stratification, characterizing the clinical fate of early AD population through the cognitive performance is still required to achieve the enrichment of clinical trial populations with effective and feasible methods. This study revealed the context of cognitive assessments to detect clinical progression in populations with early AD with the amyloid positive status. This finding sheds light on the potential utility for future clinical trials to overcome the problems such as the long duration, large variability in endpoints, and high rate of screening failure.\nWhen interpreting the results of the present study, some important points should be kept in mind. First, although we observed the similar demographic trend and common potential prognostic factors between J-ADNI and NA-ADNI, the imbalance of cohort size between J-ADNI and NA-ADNI in our study could have affected the results, especially in the context of determining the level of Table 2 Baseline items identified in J-ADNI population and the validation in NA-ADNI Abbreviations: N, the number of participants with nonmissing values of each item; diff, mean difference between the two groups (Progress vs. Stable); P (t-test), P value calculated by Welch's t-test (unpaired); coef, coefficient of linear regression estimated by ordinary least squares; P (coef), P value of coefficient; J-ADNI, Japanese Alzheimer's Disease Neuroimaging Initiative; NA-ADNI, North American Alzheimer's Disease Neuroimaging Initiative.\n*Represents statistical significance (P , .05).\nstatistical significance. Furthermore, the differences in the criteria for amyloid positivity may make comparison of results difficult. Thus, further investigations to validate the data are required to achieve the implementation of these findings into clinical trials.\nIn conclusion, this study aiming on prognostic factors to predict cognitive decline in populations with early AD showed the similarity and differences between Japanese and Caucasian populations with early AD. Our findings provide important knowledge about Japanese individuals with early AD, which would be beneficial for future drug development in AD.\nthank David Verbel, Akihiko Koyama, and June Kaplow (Eisai Inc., NJ, USA) for their careful review and advice on our manuscript. Data used in preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (adni.loni.usc.edu). As such, the investigators within the ADNI contributed to the design and implementation of ADNI and/or provided data but did not participate in analysis or writing of this report. A complete listing of ADNI investigators can be found at: http://adni. loni.usc.edu/wp-content/uploads/how_to_apply/ADNI_ Acknowledgement_List.pdf. Data collection and sharing for this project was funded by the Alzheimer's Disease Neuroimaging Initiative (ADNI) (National Institutes of Health Grant U01 AG024904) and DOD ADNI (Department of Defense award number W81XWH-12-2-0012). ADNI is funded by the National Institute on Aging, the National Institute of Biomedical Imaging and Bioengineering, and through generous contributions from the following: AbbVie, Alzheimer's Association; Alzheimer's Drug Discovery Foundation; Araclon Biotech; BioClinica, Inc.; Biogen; Bristol-Myers Squibb Company; CereSpir, Inc.; Cogstate; "}, {"section_title": "Supplementary data", "text": "Supplementary data related to this article can be found at https://doi.org/10.1016/j.trci.2019.06.004."}, {"section_title": "RESEARCH IN CONTEXT", "text": "1. Systematic review: The Pubmed database was searched to identify large-scale longitudinal studies exploring prognostic factors in population with early AD. The present study was the first study to assess prognostic factors influencing cognitive decline in early AD population using J-ADNI."}, {"section_title": "2.", "text": "Interpretation: Analyses revealed that CDR-SB changes of early AD population in J-ADNI cohort had a very similar trend to the equivalent population in the NA-ADNI cohort. CSF t-tau, p-tau, MMSE, FAQ, and ADAS-cog were identified as prognostic factors to detect cognitive decline in CDR-SB. Based on a detailed subscale analysis on ADAS-cog13, four subscales (Q1: word recall, Q3: construction, Q4: delayed word recall, and Q8: word recognition) were identified as potential prognostic factors. To the best of our knowledge, this is the first published article to assess prognostic factors influencing cognitive decline in early AD population using J-ADNI database. In addition to analyzing the Japanese population, the comparison of J-ADNI and NA-ADNI for exploring prognostic factors was conducted to confirm consistency between both populations.\n3. Future directions: Based on results from the present study, further studies are required to help developing a more efficient method for future clinical trials as screening to effectively enrich suitable individuals with early AD."}]