[{"section_title": "Abstract", "text": "We present a new flow-based method for modeling brain structural connectivity. The method uses a modified maximum-flow algorithm that is robust to noise in the diffusion data and guided by biologically viable pathways and structure of the brain. A flow network is first created using a lattice graph by connecting all lattice points (voxel centers) to all their neighbors by edges. Edge weights are based on the orientation distribution function (ODF) value in the direction of the edge. The maximum-flow is computed based on this flow graph using the flow or the capacity between each region of interest (ROI) pair by following the connected tractography fibers projected onto the flow graph edges. Network measures such as global efficiency, transitivity, path length, mean degree, density, modularity, small world, and assortativity are computed from the flow connectivity matrix. We applied our method to diffusion-weighted images (DWIs) from 110 subjects (28 normal elderly, 56 with early and 11 with late mild cognitive impairment, and 15 with AD) and segmented co-registered anatomical MRIs into cortical regions. Experimental results showed better performance compared to the standard fiber-counting methods when distinguishing Alzheimer's disease from normal aging."}, {"section_title": "INTRODUCTION", "text": "Connectivity in the brain has commonly been measured from the relative count of tractography fibers connecting different areas. The pathways delineated by the fibers denote the connected structure between areas in the brain, but do not provide any information about the diffusion, or the 'capacity', of the fiber network.\nHere we model the brain's anatomical network using wholebrain tractography, but we also compute a measure of the total 'capacity' or flow along these fibers using a flow network representation of our diffusion data. A flow network is defined as a dense connected network where each voxel center is a node, all neighbors of a voxel are connected to it, and the connection strength of an edge depends on the orientation distribution function (ODF) in the direction of the edge. A natural measure of the 'flow' between regions is embedded into a flow connectivity matrix, which we compared with the standard fiber connectivity matrix to understand what new information flow provides.\nBrain connectivity has been modeled from diffusion data using a maximum-flow inspired algorithm in [1] . Our method differs in that we also constrain paths between regions to follow tractography fibers instead of shortest paths between the two regions. The logic is to attempt to follow actual connections rather than other shorter paths through the diffusion functions that have no physical reality. In addition, we used the mean flow along the path instead of the minimum flow, to be more robust to noise in diffusion data. White matter connectivity is also modeled as a maximum flow problem by [2] , but unlike their optimization, we factor in the structure of the brain and guide paths using whole-brain tractography.\nSpecifically, we wanted to determine whether the new definition offered better effect sizes in discriminating diseased from normal networks, in the context of aging and Alzheimer's disease.\nWe apply our method to publicly available structural magnetic resonance imaging (MRI) and diffusion MRI from the Alzheimer's Disease Neuroimaging Initiative (ADNI) [3] . We studied the imaging data from 110 subjects: 28 normal healthy controls (C), 11 with late-stage mild cognitive impairment (LMCI), 56 early MCI (eMCI), and 15 AD.\nWe describe how we preprocess our data to generate whole-brain tractography fibers running between 68 automatically parcellated regions of interest. In parallel, we compute a very dense lattice, or flow graph, from our diffusion data. We project the tractography fibers onto the dense flow graph to form projected paths connecting any two regions of interest. The paths are used to estimate flow between the regions of interest and generate a flow-based connectivity matrix. We compare these matrices to the standard connectivity matrices (based on counting fibers) using network measures and test how well they discriminate between disease groups in our data. We discuss how inclusion of flow or capacity changes the network landscape of the brain.\n2. METHODS"}, {"section_title": "Data", "text": "Our data consisted of 110 subjects scanned as part of the ADNI-2 [4] collection, a continuation of the ADNI project in which diffusion imaging was added to the standard MRI protocol. The dataset at the time of writing this paper included 28 cognitively normal controls (C), 56 early-and 11 late-stage MCI subjects (eMCI, LMCI), and 15 with Alzheimer's disease (AD). Subjects were scanned on 3-Tesla GE Medical Systems scanners, which collected both T1-weighted 3D anatomical spoiled gradient echo (SPGR) sequences (256 × 256 matrix; voxel size = 1.2 × 1.0×1.0 mm 3 ; TI=400 ms; TR = 6.98 ms; TE = 2.85 ms; flip angle = 11\n• ), and diffusion weighted images (DWI; 256 × 256 matrix; voxel size: 2.7 × 2.7 × 2.7 mm 3 ; scan time = 9 min). For each subject, the DWI consisted of 41 diffusion images with b = 1000 s/mm 2 and 5 T2-weighted b0 images. This protocol was chosen after an effort to study trade-offs between spatial and angular resolution in a tolerable scan time [5] . Fig. 1 . We summarize the method to compute a measure of flow between two regions in the brain. A dense flow graph, with all voxel centers as nodes, is created from diffusion data, with edge strengths to all neighbors derived from the orientation distribution function (ODF) evaluated in the edge direction. The graph shown (first panel) is downsampled for clarity; the true version is much denser. Next, fibers from a global probabilistic tractography algorithm are selected that connect two regions of interest. These fibers are projected onto the dense flow graph to form projected paths between the two ROIs and we compute the mean flow along each path. The projected path with the maximum mean flow is selected and we remove its mean flow from its edges in the graph. The maximum mean flow is added to the connectivity matrix and the process is repeated a set number of times."}, {"section_title": "Image Preprocessing", "text": "We processed the T1-weighted images as follows. We first automatically removed extra-cerebral tissues from the anatomical images using ROBEX [6] , a method that learned from manual segmentations of hundreds of healthy young adults. Skull-stripped brains were inhomogeneity corrected using the MNI N3 tool [7] and aligned to the Colin27 template [8] with FSL Flirt [9] . The resulting images were segmented into 34 cortical regions (in each hemisphere) using FreeSurfer [10] . These segmentations were then dilated with an isotropic box kernel of 5×5×5 voxels to make sure they intersected with the white matter for the subsequent connectivity analysis. We corrected head motion and eddy current distortion in each subject by aligning the DWI images to the average b0 image with FSL's eddy correct tool. The brain extraction tool (BET) [11] was then used to skull-strip the brains. Further, the images were EPI corrected with an elastic mutual information registration algorithm [12] that aligned the DWI images to the T1 scans.\nWe used a global probabilistic tractography method based on the Hough transform [13] . While ADNI's scans are not high angular resolution, due to the need for a fast scan, this method takes advantage of all the diffusion information provided at each voxel, parametrized by the orientation distribution function (ODF). The Hough method generates curves in the fiber space and scores them based on fractional anisotropy (FA) and the ODF at each point along the curve. FA was computed from the single-tensor model of diffusion [14] . ODFs at each voxel were computed with a recently proposed, normalized and dimensionless estimator derived from Q-ball imaging (QBI) [15] . This model is more accurate and outperforms the previous QBI definition [16] , offering better detection of multiple fiber orientations [15, 17] and additional information for the scoring function. We used the tractography method to generated close to 50,000 fibers per subject."}, {"section_title": "Flow-Based Connectivity", "text": "We created a flow graph (Figure 1 , first panel) constructed using a densely connected lattice, from our diffusion data to help compute connectivity between regions of the brain; its nodes consist of all the 3D voxel centers lying in the white matter (found using an FA mask with a threshold of 0.2). All nodes in the flow graph are connected to their neighbors with edge weights derived from the orientation distribution function (ODF) in the directions of edges connecting neighboring voxels. We projected fibers generated from tractography (parameterized polynomial curves) onto this lattice graph to find pathways in the lattice between different regions. The mean flow along these projected paths is used to estimate the relative rates of diffusion, or total integrated flow, between any pair of regions in the brain."}, {"section_title": "ODF Flow Graph", "text": "Our flow graph is a set of nodes and edges representing voxel locations and the diffusion or flow between them. These edges may be thought of as pipes or conduits, whose capacity or diameter is equal to the diffusion probability from the ODF. Each node is connected to its surrounding voxels by edges (the 6 neighborhood around the voxel per node). The edges are weighted according to the value of the ODF at the angle of the neighboring voxel. The constant solid angle (CSA) ODF [15] is used, which includes the Jacobian factor r 2 as 1 4π\nwhere S(û) is the diffusion signal, S0 is the non-diffusion-weighted image, FRT is the Funk-Radon transform, and 2 b is the LaplaceBeltrami operator.\nThe resulting graph covers the entire white matter region by using an FA mask (0.2 threshold) and connects the previously parcellated cortical regions. We now compute a measure of the amount of flow passing between regions by finding paths between these regions as follows. The classic maximum flow problem has a variety of algorithms [18, 19] to compute flow from the flow network. The Edmonds-Karp algorithm [20] is a widely used method to solve this problem. It works by finding a path between two regions in the graph, using breadth-first search, and subtracting the minimum flow along this path from the graph. The minimum flow or minimum edge constitutes the bottleneck along the path and represents the maximum flow along the path. This process is repeated with the updated graph until no more paths can be found between the two regions. The sum of the minimum flow edges from the paths is the maximum flow between the two regions.\nIn this paper, we adapt the Edmonds-Karp method [20] to our diffusion data by restricting the paths to follow tractography fibers between the two regions. In addition, we use the mean flow along these paths instead of the minimum flow. Our flow graph can have millions of nodes and edges, leading to an enormous number of possible paths between any two regions, but many of these may not be biologically plausible. Unlike prior methods, we restrict the paths to follow fibers from tractography and restrict our search to n paths per connection instead of all possible paths to estimate the flow in a practical amount of time. If we rely on the minimum flow along a path between two regions, it may falsely restrict the capacity of a path because of noise in our diffusion data (causing a single edge along the path to be abnormally small). To remedy this, we compute the mean flow or mean edge weight along the path as an estimate of the passing flow. We summarize the analysis pipeline in Fig. 1. "}, {"section_title": "Tractography Fiber Projection", "text": "We compute connections between two regions in the flow graph by following paths closest to tractography fibers connecting the two regions, and further select those fibers from our Hough tractography method that intersect the two regions of interest. These fibers are then projected into the flow graph by finding the closest nodes and edges along each fiber. This set of nodes and edges represents a projected path between the two regions in the flow graph."}, {"section_title": "Flow Between Regions", "text": "Paths between two regions of interest are then scored based on the their mean edge value or flow. We then select the path with the maximum mean flow and subtract its maximum mean flow from its edges in the flow graph. This modified graph is used to re-score the projected paths between the two regions and the process is repeated for a pre-specified number, n, of iterations. In our experiments, n = 10 was sufficient to capture the flow between all regions in our image. The procedure for our method is described as pseudo-code in Algorithm 1.\nAlgorithm 1 A summary of our flow connectivity method 1: for each cortical region pair (2 sets of voxels) do 2:\nCompute ODF graph with FA mask (0.2 threshold) 3: Select Tractography fibers that intersect both regions 4: for each fiber do 5: Find the set of closest nodes in the graph 6: Connect these nodes by edges 7: This set (nodes/edges) is the projected path 8: end for 9: for 1 to n do 10: for each projected path do 11: Find its mean edge cost (flow) in the ODF graph 12: end for 13: Select the path with the maximum mean flow 14: Add this maximum mean flow to the connectivity matrix 15: Remove the maximum mean flow from the ODF graph along the maximum mean flow path edges 16: end for 17: end for\nThe above process is repeated for each of the 68 cortical areas to generate a 68 × 68 flow connectivity matrix [21] . In addition, we computed standard fiber connectivity matrices that count the number of fibers connecting each region. Fig. 2 compares the flow-based connectivity matrix and fiber count connectivity matrix in the same subject. Fig. 2 . We show the fiber connectivity matrix and flow connectivity matrix. The flow connectivity matrix may be thought of as a particular weighting of the fiber connectivity matrix from which it is derived."}, {"section_title": "Connectivity Measures", "text": "We interpreted our connectivity matrices with eight network measures described in [22] , computed with the Brain Connectivity Toolbox. We chose global efficiency, transitivity, path length, mean de- Table 1 . Most significant results in our network measure comparison between network measures derived from fiber connectivity matrices and flow connectivity matrices and their ability to discriminate between disease states. The p-values are from two-sample t-tests and the threshold represents the proportion of weights preserved in the connectivity matrices before network measures are computed. % represents the threshold used on the connectivity matrix. Ten separate thresholds were applied to each connectivity matrix that preserved a proportion of the weights ranging from .1 to 1, at intervals of . gree, density, modularity, small world, and assortativity. We computed all 8 measures from both weighted and binary undirected networks. As is standard, ten different thresholds were applied to each connectivity matrix, to preserved a fixed fraction of the weights ranging from .1 to 1, in intervals of .1."}, {"section_title": "EXPERIMENTAL RESULTS", "text": "For each subject, we computed both a flow connectivity matrix and a fiber connectivity matrix. For each of these matrices, we computed a total of fourteen (global efficiency, transitivity, path length, density, modularity, and small world were found both in weighted and binary matrices while mean degree and assortativity were found in only binary) different network measures at ten different weight preservation thresholds. The resulting measures were then used in two-sample ttests comparing controls vs. eMCI, controls vs. LMCI, controls vs. AD, and eMCI vs. LMCI, allowing the network sparsity (threshold) to vary. 2-tailed tests were used, as it is not clear in advance, for these newly defined networks, how some network properties would change with disease (e.g., small world properties). We then analyzed the lowest p-value from each test to compare the discriminative ability of each network. Table 1 shows the 'most significant' network measures (i.e., the ones with greatest effect size) from fiber and flow connectivity matrices for each test along with its p-value, and the threshold used to create the connectivity matrices."}, {"section_title": "DISCUSSION", "text": "From Table 1 , we observe that the network measures from our flow connectivity matrices are able to produce more significant differences (i.e., higher effect sizes) in distinguishing the disease groups when compared to network measures from fiber connectivity matrices in each test, except for eMCI vs. late-MCI. The selection of mean degree as a discriminative feature was also a reasonable choice, as the progression of Alzheimers disease results in a gradual loss of connectivity between regions. The flow connectivity matrices may be thought of as a weighting of the original fiber connectivity matrices because the procedure of computing flow between a pair of regions, expects an already-existing connection of tractography fibers. The flow measure may help differentiate the disease states relative to simply counting fibers, as it gives a sense of the diffusion along those fibers. Additionally, we conjecture that the flow network measures result in more significant differences (greater effect sizes) due to the additional global flow information retained in the network. To be precise, the flow measure is not measuring the total diffusion as the ODFs are normalized to unit mass. It will reflect myelination as greater myelination would create dominant peaks in the ODFs.\nFuture work will assess how these types of connectivity networks differ in overall content and organization. Another goal will be to test how much the flow connectivity method depends on the tractography algorithm, e.g., Hough versus streamline methods, and ODF versus tensor-based models. Finally it will be useful to see how this method compares to traditional maximum flow algorithms by using synthetic or simplified data.\n5. REFERENCES"}]