[{"section_title": "Abstract", "text": "A novel multi-atlas based image segmentation method is proposed by integrating a semi-supervised label propagation method and a supervised random forests method in a pattern recognition based label fusion framework. The semisupervised label propagation method takes into consideration local and global image appearance of images to be segmented and segments the images by propagating reliable segmentation results obtained by the supervised random forests method. Particularly, the random forests method is used to train a regression model based on image patches of atlas images for each voxel of the images to be segmented. The regression model is used to obtain reliable segmentation results to guide the label propagation for the segmentation. The proposed method has been compared with state-of-the-art multi-atlas based image segmentation methods for segmenting the hippocampus in MR images. The experiment results have demonstrated that our method obtained superior segmentation performance.\nIndex Terms-multi-atlas based image segmentation, hippocampus, random forest, label propagation"}, {"section_title": "INTRODUCTION", "text": "Accurate segmentation of the hippocampus in magnetic resonance (MR) images is often needed in neuroimaging studies of neuropsychiatric disorders. Since manual delineation of the hippocampus is time-consuming, it is desirable to automatically segment the hippocampus with high accuracy, especially in large scale studies.\nAmong existing automatic medical image segmentation methods, multi-atlas based image segmentation (MAIS) has been widely adopted for the hippocampus segmentation [1] . Particularly, the MAIS methods align atlas images and their segmentation labels to a target image to be segmented, and then the aligned segmentation labels are fused to obtain a segmentation result for the target image.\nIn the past years, a variety of MAIS methods have been developed to improve the image segmentation [1] . In addition to improving image registration [2] [3] [4] [5] [6] , most MAIS methods are developed to improve the label fusion [7] [8] [9] [10] [11] [12] [13] [14] . In particular, majority voting (MV) might be the simplest label fusion method [15] , and sophisticated label fusion strategies have been built upon a nonlocal patch-based label fusion strategy [16] , such as joint label fusion [9] , multi-scale and multi-feature label fusion based on optimized image patch matching [12] , dictionary learning [10] , and metric learning [7] . The label fusion could also be modeled as a pattern recognition problem [11, 14] . In the pattern recognition setting, image patches of the aligned atlases are used as training data to build prediction models using support vector machines (SVM) [11] , artificial neural networks (ANNs) [17] , or linear regression model [8] , and then the trained models are used to predict segmentation labels of image patches of the target image.\nRegardless differences of the existing label fusion methods, they typically implement the label fusion of different voxels independently without taking into consideration correlations among voxels of the target image, and therefore their performance might be degraded by imaging noise. Furthermore, the label fusion might also be hampered by image discrepancy across subjects that cannot be fully handled by the image registration, particularly differences between the target image and the atlas images [18, 19] . Although these problems have been addressed in different methods for medical image segmentation problems [18] [19] [20] , a unified solution is desirable.\nTo improve the hippocampus segmentation, we integrate a semi-supervised label propagation (SSLP) method and a supervised random forests (RF) method in the MAIS framework [21, 22] . Particularly, a probabilistic image segmentation of each voxel in the target image is obtained using a local prediction model built upon its neighboring image patches of the atlas images using RF regression in the MAIS framework. Then, a semi-supervised label propagation method is adopted to segment the target image by propagating reliable segmentation information within the target image regularized by local and global image consistency [18, 19, 21] . The segmentation information propagates within the target image itself with an information-balance-weighting scheme, rather than propagating information among the target image and the atlas images [20] , which may suffer from the inter-subject image inconsistency. The method has been validated for the hippocampus segmentation based on imaging data and segmentation labels provided by the EADC-ADNI (European Alzheimer's Disease Consortium and Alzheimer's Disease Neuroimaging Initiative) harmonized segmentation protocol (www.hippocampal-protocol.net) [23] ."}, {"section_title": "METHODS", "text": "Our method consists of an MAIS method for generating a probabilistic segmentation result using a RF regression method and a SSLP method for computing reliable image segmentation for the hippocampus. The method is referred to as RF-SSLP."}, {"section_title": "MAIS based on random forest regression", "text": "Given a target image and registered atlas images and their labels , where and are the atlas and label images respectively, RF regression models are built to generate a probabilistic segmentation result of the target image in a pattern recognition framework [11] . In order to label each voxel in the target image, image patches in its neighborhood with voxels are extracted from each atlas image as training samples. From each of the image patches, texture image features are computed using the method described in [11] . We obtain training samples , where is a feature vector with label . Finally, a RF regression model is trained for predicting segmentation label of the voxel under consideration. To build the regression model on balanced training samples, we select the same number ( ) positive and negative samples, most similar to the image patch to be segmented, to train the regression model [11] . The RF regression model is an ensemble of regression trees that are built upon the training data using randomly sampling, with 2 parameters:\n(the number of trees) and\n(the number of predictors sampled for splitting at each node) [22] . Once regression trees are trained, they are applied to image features of voxel to predict its segmentation label: (1) where is the regression tree, and is the prediction of segmentation label. In this study, we treat the output of a regression model as a \"probabilistic\" segmentation label.\nA specific regression model is built for each voxel of the target image, similar to the local label learning (LLL) method [11] , and a probabilistic segmentation map is finally obtained for the target image. The RF based label fusion method is referred to as LLL-RF-regression hereafter. A binary segmentation results can be obtained by thresholding the probabilistic map. However, probabilistic segmentation results with smaller absolute label values might be unreliable. Furthermore, the segmentation results might be degraded by imaging noise since they are obtained for different voxels separately. The segmentation result can be improved by the semi-supervised label propagation method [18, 19, 21] ."}, {"section_title": "Semi-supervised label propagation for the hippocampus segmentation", "text": "A graph theory based label propagation method is adopted to improve the image segmentation [21] . Particularly, the label propagation will update the probabilistic segmentation map, regularized by local and global image consistency, by minimizing , (2) where and are matrices of the probabilistic segmentation and the final segmentation maps respectively, is a symmetric normalized Laplacian matrix, is an identity matrix, and is a parameter. Particularly, plays an important role in the label propagation in that it characterizes similarity among different voxels. In our study, image similarity between two voxels and is defined by ,\nwhere and are image intensity values of voxels and respectively, and is a parameter. Given a pairwise similarity matrix, , between all voxels defined by Eq. (3) , ,\nwhere is a diagonal matrix with its diagonal element equal to the sum of the corresponding row of .\nThe optimization problem of Eq. (2) can be solved iteratively [21] : , (5) where is the number of iteration steps, and is a trade-off parameter related to .\nTo relieve impact of unreliable image segmentation results on the label propagation, the probabilistic segmentation map is weighted by reliable segmentation information, referred to as information-balance-weighting. Particularly, the reliable segmentation result is determined by a threshold ( ). For segmenting the hippocampus, the number of background voxels is typical larger than the number of the hippocampal voxels. To balance the background and foreground label information in the label propagation, the reliable background label information is updated as ,\nwhere is the number of voxels with reliable foreground (hippocampus) segmentation labels, is the number of voxels with reliable background segmentation labels, is a threshold for determining the reliable segmentation result, and is a negative reliable segmentation label, i.e., . It is worth noting that guarantees that the reliable remains greater than or equal to the threshold after the information-balance-weighting. Then, the probabilistic segmentation map is normalized separately for voxels with foreground and background probabilistic segmentation labels by , and , where is a positive segmentation label, is a negative segmentation label, and and are mean values of positive and negative labels respectively.\nFinally, the weighted probabilistic segmentation map is updated using the label propagation method, as formulated by Eq. (5)."}, {"section_title": "EXPERIMENTAL RESULTS", "text": "We have validated our method for the hippocampus segmentation based on imaging data and segmentation labels provided by the EADC-ADNI [23] . The dataset consists of a preliminary release part with 100 subjects and a final release part with 35 subjects. The final release data were used as training data and the preliminary release data were used as testing data. To segment the testing data, the images of training data were used atlases.\nTo reduce the computational cost, bounding boxes for both the left and right hippocampi were identified after all the images were linearly aligned to the MNI152 template with voxel size of . Instead of using all available atlases to segment a target image, 20 most similar atlases were selected based on normalized mutual information of the image intensities within the bounding box [11] . These atlases were then registered to the target image using ANTs [24] . To further reduce the computation cost, the majority voting label fusion method was used to obtain an initial segmentation result of the target image. Our method was then applied to voxels without 100% votes for either the hippocampus or the background in the majority voting method [11] ."}, {"section_title": "Parameter selection based on the training data", "text": "The image patches with size of were extracted from a neighborhood of following the LLL method [11] . Texture features were computed to build regression models using the RF regression method.\nOur method has 6 parameters, including (the number of nearest neighboring samples for training local random forest), (the number of trees), (the number of predictors sampled for splitting at each node), (the threshold for determining the reliable segmentation), (the image similarity parameter), and (the trade-off parameter for updating the segmentation). Based on the training dataset, we adopted leave-one-out (LOO) cross-validation to optimize Dice index by grid-searching parameters from , , , , , and . The optimal parameters were , , , , , and . Since the MV method could provide probabilistic segmentation results too, we integrated the same SSLP method with the MV method for the hippocampus segmentation, referred to as MV-SSLP. The same parameters used in our method were adopted in the MV-SSLP method. Table 1 summarizes segmentation performance of the MV, MV-SSLP, LLL-RF-regression, and RF-SSLP, measured by Dice index estimated using a LOO crossvalidation based on the training dataset. The results demonstrated that the SSLP method could improve segmentation results of both the MV and the RF label fusion methods, and the integration of RF and SSLP obtained the best performance. "}, {"section_title": "Comparison with alternative MAIS methods", "text": "We compared our method with alternative MAIS methods, including majority voting (MV) [15] , nonlocal patch (NLP) [16] , local label learning (LLL) [11] , random local binary pattern (RLBP) [8] , and metric learning (ML) [7] . Parameters of these methods were set to optimal values suggested in their respective studies. Particularly, for the NLP method [16] , its parameters were adaptively set using its suggested method; for the RLBP method [8] , the number of generated RLBP features was set to 1000 and its balance parameter was set to ; for the ML method [7] , the number of nearest training samples was set to 9.\nFor the LLL method [11] , we built both SVM classifiers and random forest classifiers, referred to as LLL-SVM and LLL-RF respectively. The image patches with size of were extracted from a neighborhood of , and texture features were computed to build local classifiers based on 400 training samples. Sparse linear SVM classifiers were built with the default parameters of LibSVM, while random forest classifiers were built with following parameters:\n, , , which were obtained to optimize Dice index by selecting parameters from , , and . Table 2 summarizes segmentation performance, measured by Dice index and mean distance (MD), of all the methods under comparison on both the training and testing datasets. For the training dataset, the segmentation performance was estimated based on a LOO cross-validation. Both the Dice index and measure distance measures indicated that the proposed method achieved superior segmentation performance relative to other methods under comparison. "}, {"section_title": "CONCLUSIONS", "text": "We proposed a novel hippocampus segmentation method by integrating the random forest regression-based multi-atlas segmentation and the semi-supervised label propagation. Experiment results on the EADC-ADNI dataset demonstrated that our method achieved promising segmentation performance. Source codes of the algorithms under comparison are available at www.nitrc.org."}]