[{"section_title": "Abstract", "text": "Background-Mood disorders in old age increase the risk of morbidity and mortality for individuals and healthcare costs for society. Trait Neuroticism, a strong risk factor for such disorders into old age, shares common genetic variance with depression, but the more proximal biological mechanisms that mediate this connection are not well understood. Further, whether sex differences in the neural correlates of Neuroticism mirror sex differences in behavioral measures is unknown. The present research identifies sex differences in the stable neural activity associated with Neuroticism and tests whether this activity prospectively mediates Neuroticism and subsequent depressive symptoms."}, {"section_title": "Introduction", "text": "Among older adults, depression has a particularly pernicious effect on both the individual and society. Depression increases morbidity and mortality (Beekman et al., 1997a; Frojdh et al., 2003) , health care costs (Katon et al., 2003) , and caregiver burden (Alexopoulos et al., 2002) . It also decreases quality of life and impairs physical functioning (Lyness et al., 2007; Rowe and Rapaport, 2006) . Even at sub-syndromal levels, depressive symptoms are associated with increased risk of disability and mortality (Magruder and Calderone, 2000) . A greater understanding of the biological mechanisms that link established risk factors, such as trait Neuroticism, and depressive symptoms may help inform interventions that aim to reduce the prevalence and course of depressive symptomatology across the lifespan.\nDifferences in resting-state neural activity have been noted across a variety of affective and psychiatric disorders, such as major depression (Dunn et al., 2002) , subthreshold depression (Dotson et al., in press) , and schizophrenia (Malaspina et al., 2004) . Such variations suggest that individual differences in emotional processing may modulate neural activity when the brain is not engaged in goal-directed behavior. Much of this research has focused on pathological distortions in emotion regulation; comparatively less research has addressed the association between resting-state neural activity and stable individual differences in normal emotional processing, such as trait Neuroticism.\nNeuroticism refers to a tendency to experience negative emotions and is a well-established risk factor for mood, anxiety, and other psychiatric disorders (Bienvenu et al., 2004) . Numerous studies have demonstrated that Neuroticism is stable (Terracciano et al., 2006) , heritable (Jang et al., 1996) , universal (McCrae et al., 2005) and predictive of important life outcomes, including mortality (Terracciano et al., 2008) . Strong cross-observer agreement indicates that others can detect aspects of Neuroticism that converge with the individual's own subjective evaluation (McCrae et al., 2004) . As such, Neuroticism is an easily measurable, observable vulnerability to psychopathology that may be a useful tool for identifying the shared neural correlates across disorders with a strong affective component.\nThe neural mechanisms associated with Neuroticism may contribute to the liability for psychiatric disorders. Evidence from twin studies suggests that Neuroticism and major depression stem from a shared genetic basis (Kendler et al., 2006) . The more proximal biological mechanisms that mediate this connection, however, are not well understood. Stable neural activity in specific areas of the brain may be one biological mechanism partly responsible for the association between Neuroticism and depression. In particular, activity in the hippocampus has been linked to both Neuroticism (Hooker et al., 2008) and depression (Videbech et al., 2002) , and activity in such structures may subsequently contribute to negative emotional states (Sheline et al., 2009) . As such, Neuroticism may be associated with subsequent depressive symptoms, in part, because of stable activity in the hippocampus.\nMany disorders have clear sex differences and the vulnerability to psychopathology often differs by sex (Piccinelli and Wilkinson, 2000) . Even in non-clinical populations, when the brain is at rest, men and women have different patterns of brain activity (Gur et al., 1995) . Given that the underlying neural mechanisms associated with emotional processing often differ by sex (Cahill et al., 2004) , there may be sex differences in the resting-state correlates of Neuroticism. Studies that have examined the neural correlates of personality, however, have primarily relied on mixed-sex samples (Johnson et al., 1999; Zald et al., 2002) . Two studies that used single-sex samples -one with males, one with females -found different patterns of rCBF correlates for Neuroticism for men (Kim et al., 2008) and women (Deckersbach et al., 2006) . These divergent patterns suggest the possibility that men and women have distinct neural mechanisms underlying Neuroticism. No study, however, has directly tested for sex differences in the resting-state rCBF correlates of Neuroticism.\nThe purpose of the current research is twofold: (1) to identify stable neural activity associated with Neuroticism separately for men and women and (2) to test whether this activity prospectively mediates the association between Neuroticism and depressive symptoms. To detect the most robust rCBF correlates of Neuroticism, participants underwent two independent assessments of both personality and rCBF, approximately two years apart. Neuroticism remains a strong risk factor for depression well into old age (Weiss et al., in press ), yet researchers have only recently expanded their consideration of the structural and functional neural correlates of Neuroticism to older adults (Wright et al., 2007) . With a relatively large sample size (N = 100), we tested whether the rCBF correlates of Neuroticism replicated after a two-year interval among older adults and whether these replicated correlates differed by sex. We then investigated whether these relatively stateindependent neural correlates of Neuroticism mediated the relation between Neuroticism and subsequent depressive symptoms."}, {"section_title": "Methods", "text": ""}, {"section_title": "Subjects and procedure", "text": "Subjects were drawn from the longitudinal neuroimaging substudy of the Baltimore Longitudinal Study of Aging (BLSA) (Shock et al., 1984) and were included in the present analyses if they had valid resting-state PET scans at the baseline neuroimaging assessment and at two-year follow-up and two valid personality assessments within two years of each scan. A total of 100 participants (46 female) met these criteria. Participants in the BLSA neuroimaging study were limited to those 55 years of age or older; in the present sample, the average age was 71.4 (SD = 7.7) overall, and 72.3 (SD = 7.4) for men and 70.4 (SD = 7.9) for women at the baseline scan (ns). Participants completed neuropsychological evaluations annually and were deemed cognitively normal at both baseline and follow-up assessments. The local Institutional Review Board approved the study and all subjects provided written informed consent before each assessment and the research has been carried out in accordance with the Declaration of Helsinki and other international guidelines."}, {"section_title": "Neuroticism", "text": "Participants completed the Neuroticism scale of the Revised NEO Personality Inventory (NEO-PI-R), a widely-used, objective measure of personality (Costa and McCrae, 1992) . Subjects responded on a Likert scale ranging from 1 (strongly disagree) to 5 (strongly agree). Raw scores were converted to T-scores (M = 50, SD = 10) using the combined-sex norms for adults reported in the Manual (Costa et al., 1992) . In the current sample, the Neuroticism scale had an alpha reliability of .90 at both assessments. The retest correlation across the two assessments was .83."}, {"section_title": "Depressive symptoms", "text": "Depressive symptoms were assessed using the 20-item Center for Epidemiologic Studies Depression Scale (CES-D) (Radloff, 1977) , which assesses the frequency and severity of depressive symptoms within the last week. The scale ranges from 0 to 60 and has been shown to be a reliable and valid measure of depressive symptoms in older adults (Beekman et al., 1997b ). In the current research, participants completed the CES-D at both assessments; CES-D scores were missing for two participants."}, {"section_title": "PET scanning", "text": "Participants underwent the same PET scanning procedure at both scanning occasions (i.e., baseline and follow-up). During the resting-state scan, subjects were instructed to keep their eyes open and focused on a computer screen covered by a black cloth. PET measures of rCBF were obtained using [ 15 O]water. For each scan, 75 mCi of [ 15 O] water were injected as a bolus. Images were acquired for 60 secs on a GE 4096 +PET scanner, starting from when radioactivity in the brain was detected to surpass threshold level. The scans provided 15 slices of 6.5-mm thickness. Each PET scan was realigned and spatially normalized into standard stereotactic space and smoothed to a full width at half maximum of 12, 12, and 12mm in the x, y, and z planes. To control for variability in global flow, rCBF values at each voxel were ratio adjusted to the mean global flow and scaled to 50 mL/100g per min for each image."}, {"section_title": "Data analysis", "text": "The image data were analyzed using Statistical Parametric Mapping (SPM2; Wellcome Department of Cognitive Neurology, London, England), where voxel by voxel comparisons determined significant associations between rCBF and Neuroticism. We correlated personality scores with patterns of CBF for men and women separately at baseline and follow-up. Second-level conjunction analyses were then used to detect significant associations between personality and rCBF that replicated across the two scans (masking threshold of p ≤ .05; magnitude p ≤ .005; spatial extent > 50 voxels) to identify associations common to both baseline and follow-up. As such, we take a relatively stringent approach by only examining the neural activity associated with trait Neuroticism that replicated across two independent measurements of both rCBF and Neuroticism separated by approximately two years. Additionally, rCBF values were extracted from a 4 mm spherical area centered on the local maxima of each region of significant correlation in each group to directly compare differences in the correlations between Neuroticism and rCBF between men and women. All analyses were adjusted for baseline age."}, {"section_title": "Mediation", "text": "Mediator models hypothesize that one or more variables act as a mechanism to explain the relation between two variables (Preacher and Hayes, 2008) . Accordingly, such models specify a specific causal sequence. Longitudinal data, although unable to definitively test for causality, can be a powerful tool to help separate cause and effect when experimental manipulation of the variables is difficult or impossible. To that end, we test our hypothesized mediational model using trait Neuroticism at baseline and depressive symptoms at follow-up. In addition, we test an alternative model that reverses the causal ordering of Neuroticism and depressive symptoms (i.e., neural activity mediates the association between depressive symptoms at baseline and Neuroticism at follow-up) to rule out this causal sequence.\nWe based our mediational analyses on the steps outlined by Baron and Kenny (1986) : (1) the independent variable (Neuroticism) must have a significant effect on the dependent variable (depressive symptoms) in the absence of the mediator, (2) the independent variable must have a significant effect on the mediator, (3) the mediator must have a significant and unique effect on the dependent variable, in the presence of the independent variable, and (4) the effect of the independent variable on the dependent variable must be reduced significantly when the mediator is added to the model.\nTo test neural activity as a mediator between trait Neuroticism and depression, we take a dual approach and use two complementary methods. First, for each area found to be associated with Neuroticism, we test the rCBF values from those regions as a mediator using the product of coefficients method. Specifically, we use the Sobel test, which quantifies the magnitude of the indirect effect.\nSome researchers, however, have noted that the Baron and Kenny approach to mediation has low statistical power to detect such effects (see MacKinnon et al., 2002 , for a comparison of mediation techniques). To overcome this limitation, we complement the Sobel test with mediational analyses that use bootstrapping techniques. Bootstrapping is a nonparametric resampling procedure that overcomes the problem of low power (Mallinckrodt et al., 2006; Shrout and Bolger, 2002) and does not assume multivariate normality of the sampling distribution (Preacher et al., 2008) . We applied this technique in the current research: cases were randomly selected, with replacement, from the original sample of N. For each bootstrap sample, the model was estimated and the parameter estimates saved. The distribution of these estimates was then examined. The indirect effect was deemed significant if the confidence interval around that effect did not include zero (Preacher et al., 2008; Shrout et al., 2002) . We utilized the SPSS macro developed by Preacher and Hayes (2008) for testing multiple mediators via bootstrapping. We set the number of bootstrap samples to 1000."}, {"section_title": "Results", "text": "The expected sex difference in Neuroticism scores was apparent at both assessments: Neuroticism scores were higher for women than men at baseline (M = 49.63 (SD = 9.33) versus M = 44.29 (SD = 6.42), respectively; F(1,98) = 11.36, p < .05) and at follow-up (M = 48.33 (SD = 9.26) versus M = 44.46 (SD = 6.60), respectively; F(1,98) = 5.93, p < .05). Mean Neuroticism scores did not change across the two assessments for either women or men (ts = 1.69 and .27, respectively, both ns) and there was no time × sex interaction (F(1,98) = 2.35, ns). As expected, Neuroticism scores were highly stable for both women and men; the corrected stability coefficient across the two assessments was .93 for women and .87 for men.\nDepressive symptoms did not differ significantly between women and men at baseline (M = 7.33 (SD = 6.97) versus M = 5.19 (SD = 4.93), respectively; F(1,97) = 3.21, ns) or follow-up (M = 6.62 (SD = 6.94) versus M = 5.60 (SD = 6.06), respectively; F(1,96) = .60, ns). Similar to Neuroticism, depressive symptoms did not change across assessments for women or men (ts = .63 and .69, respectively, both ns), and there was no time × sex interaction (F(1,95) = ."}, {"section_title": "83, ns).", "text": "The neural correlates of Neuroticism were different for men and women (see Table 1 and Figure 1 ). For women, higher Neuroticism scores were associated with greater rCBF in both the midbrain and the hippocampus at both assessments. In contrast, neither of these areas was associated with Neuroticism in men. For men, higher Neuroticism scores were associated with greater rCBF in the middle temporal gyrus (Brodmann Area 21). This association was not significant for women. Using the Fisher r-to-z transformation, direct comparison of the correlation between Neuroticism and rCBF confirmed that brain activity differed significantly between men and women within each of these regions (all zs > 1.98, ps < .05). There were no significant negative correlations between rCBF and Neuroticism for either men or women.\nAs expected, for both women and men, Neuroticism at baseline and depressive symptoms at follow-up were moderately correlated (rs = .41 and .40, respectively, both ps < .01). Of the potential mediators -midbrain and hippocampal activity for women and middle temporal gyrus activity for men -only activity in the hippocampus had a unique and significant effect on depressive symptoms at follow-up (see Figure 2) . Inclusion of this variable in the model significantly reduced the association between Neuroticism and depressive symptoms (Δβ = . 17, p < .05), satisfying all criteria for mediation. The Sobel test confirmed that this reduction was significant (Sobel = 2.07, p < .05) and the bootstrapping analysis also identified hippocampal activity as a significant mediator between Neuroticism and subsequent depressive symptoms (point estimate = .13, p < .05; bias corrected 95% confidence interval = .02 -.36). The findings were essentially unchanged when age and baseline depressive symptoms were added to the model. Finally, we tested an alternative model that specified hippocampal activity as a mediator between depressive symptoms at baseline and trait Neuroticism at follow-up in women. Consistent with our hypothesis of the causal ordering, this model was not significant, as tested by either the Sobel (Sobel = 1.78, ns) or bootstrapping methods (point estimate = .12, ns)."}, {"section_title": "Discussion", "text": "The present study identified sex differences in the resting-state neural correlates of trait Neuroticism among older adults and tested these correlates as mediators of the association between Neuroticism and depressive symptoms. Using a large sample to detect the most robust correlates that replicated across two independent scanning and personalityassessments within the same sample, we found that Neuroticism was associated with greater activity in the right hippocampus and midbrain for women, whereas Neuroticism was associated with greater activity in the left middle temporal gyrus for men. Our findings suggest that the neural underpinnings of this established risk factor for affective disorders and psychopathology differ by sex. Further, building a model of the more proximal biological mechanisms between Neuroticism and depression, we found that hippocampal activity mediated the association between Neuroticism and subsequent depressive symptoms for women.\nThe midbrain and hippocampus have been implicated in emotional processing and emotion regulation. Activity in the midbrain, for example, has been associated with transient sadness (Lévesque et al., 2003) , memories of particularly fearful experiences (Damasio et al., 2000) , and visualizing negative facial expressions . And, compared to controls, patients with panic disorder have higher resting levels of midbrain activity (Boshuisen et al., 2002) . Thus, the response of the midbrain to the experience of negative emotions, both real and imagined, may contribute to sensitivity to these emotions that is typical of individuals high in Neuroticism.\nThe hippocampus has also been implicated in the experience of negative emotion and mood disorders. Dysfunction of the hippocampus is associated with inappropriate contextregulation of affect, a common component of mood and anxiety disorders (Davidson et al., 2002) . And indeed, individuals suffering from such disorders tend to have greater activity in their hippocampus at rest, compared to healthy controls (Sakai et al., 2005; Videbech et al., 2002) . Although not all find this relation (Saxena et al., 2001) , this may be due, in part, to the use of mixed-sex samples. Further, experimentally inducing negative emotion is associated with increases in rCBF in the hippocampus (Lane et al., 1997) . Neuroticism in particular has been associated with greater activation of the hippocampus during fear learning, which suggests that the neural mechanisms responsible for punishment are particularly reactive in these individuals (Hooker et al., 2008) . Thus, among women, chronic activity in both the hippocampus and midbrain may contribute to the emotional instability that is so characteristic of Neuroticism.\nIn contrast to women, men high in Neuroticism had greater activity in their middle temporal gyrus, an area associated with more cognitive operations such as the processing of language and semantic memory. This finding is consistent with recent research indicating that, for individuals high in Neuroticism, the left middle temporal gyrus is particularly responsive to threatening information (Chan et al., 2009) . The sex differences found in the present research highlight the importance of considering men and women separately. Combining men and women into a single sample implicitly assumes that neural correlates of traits, such as Neuroticism, are equivalent across the sexes and potentially obscures distinct mechanisms ). Sex differences in the neural underpinnings of cognitive functions are not uncommon (Andreano and Cahill, 2006; Cahill et al., 2004) , and these differences likely extend to other aspects of the person, such as personality traits. Such differences may stem, in part, from the different effects of sex hormones on brain organization, structure, and function across the lifespan (Cosgrove et al., 2007) .\nTurning to our second objective, we found that hippocampal activity mediated the association between Neuroticism at baseline and depressive symptoms at follow-up. Neuroticism is a strong risk factor for depression across the lifespan and evidence suggests that Neuroticism and depression share common genetic variance (Kendler et al., 2006) . The current research takes a step toward a model of the more proximal biological mechanisms that link Neuroticism and depression. As discussed above, the hippocampus plays a role in emotion regulation. One recent study found that depressed individuals showed increased hippocampus activity in response to negative emotional pictures relative to controls (Sheline et al., 2009 ). Sheline and colleagues speculated that over-activity in such structures may impede effortful attempts at emotion regulation, ultimately leading to or perpetuating negative emotional states (Sheline et al., 2009) . The results of the current study suggest that the chronic activation of the hippocampus associated with Neuroticism may contribute to depressive symptoms through dysfunctional emotional regulation.\nDepression has long been known to be associated with structural and functional abnormalities of the hippocampus. Interestingly, although associated with hippocampal volume loss (Videbech and Ravnkilde, 2004) , both depression (Videbech et al., 2002) and the subjective experience of negative emotion more generally (Garrett and Maddock, 2006) have also been associated with greater rCBF in the hippocampus. This divergence suggests that hippocampal volume loss does not necessarily translate into lower activity in this structure. Indeed, in individuals suffering from post-traumatic stress disorder, the symptom severity is associated with decreased hippocampal volume, but greater blood flow to the hippocampus (Shin et al., 2006; Shin et al., 2004) . Thus, the hippocampal volume loss associated with depression does not preclude the possibility that greater hippocampal activity could also be associated with subsequent depressive symptoms.\nOur study joins a growing interest in a lifespan approach to the structural and functional neural correlates of personality. Although neuroticism remains a strong risk-factor for depression into old age (Weiss et al., in press) , research on the resting-state neural correlates of Neuroticism have focused primarily on young and middle-aged samples (Johnson et al., 1999; Deckersbach et al., 2006; Kim et al., 2008; Zald et al., 2002) . Differences in brain structure and function across the lifespan suggest that the neural correlates of Neuroticism for older adults may not necessarily be the same as the correlates for younger ones. And, indeed, the neuroanatomical correlates of Neuroticism appear to differ by age (Wright et al., 2007; Wright et al., 2006) . In addition, the neural correlates of Neuroticism that we identified were not identical to those previously reported for either men (Kim et al., 2008) or women (Deckersbach et al., 2006) . This may be due, in part, to differences in sample size, questionnaire measures used, or age of the sample. Thus, in developing targeted treatments for disorders, it is crucial to identify the neural regions involved at different stages of the life course.\nIn the current study, we sought the most robust associations that replicated over two measurement occasions to minimize chance or situation-specific associations. Multiple assessments of both rCBF and personality reduce state effects and increase the reliability and validity of the identified associations. In addition, the scan at follow-up of the BLSA neuroimaging study was the third scan these participants completed. Thus, the neural associations are more likely to be stable characteristics of the resting-state activity for individuals high in Neuroticism, than idiosyncratic fluctuations due to testing conditions. The correlational nature of our study, however, prohibits definitive claims of causality for the role of the hippocampus in mediating Neuroticism and subsequent depressive symptoms. Our longitudinal design, however, helps rule out some alternative possibilities. First, because Neuroticism and hippocampal activity at baseline were measured prior to depressive symptoms at follow-up, depressive symptoms could not have caused the increased baseline hippocampal activity. Further, controlling for concurrent depressive symptoms at baseline did not account for the mediational effect, suggesting that at least part of the increased hippocampal activity among women high in Neuroticism is independent of concurrent depressive symptoms. Finally, the fully-crossed longitudinal design of our study also allowed us to test for the reverse of our hypothesized model -that hippocampal activity mediates depressive symptoms at baseline and Neuroticism at follow-up -and statistically rule out this path of associations. Although an improvement over cross-sectional designs, we did not manipulate any of our variables of interest and therefore cannot directly test for causality. Thus, in light of the correlational nature of the study and relatively small sample size, our findings should be interpreted with prudent caution until they can be replicated in larger samples and/or using experimental designs. Our findings do, however, provide a framework for future experimental studies of Neuroticism and depression.\nPersonality traits are stable, highly heritable risk factors for psychiatric disorders. An understanding of the neural mechanisms underlying these traits provides an avenue for examining the biological origins of mood and anxiety disorders. Despite their importance to this ultimate goal, little is known about the resting-state neural correlates of these normal individual differences in emotional processing, especially the extent to which these neural correlates differ by sex. Identifying the biological underpinnings of a general tendency to experience negative affect (i.e., Neuroticism) may provide insight into the neural mechanisms responsible for disorders with a strong affective component. Knowledge of the mediators, both physiological and behavioral, between risk factors and depression may help in the development of effective pharmacological and lifestyle interventions across the lifespan. Correlations between rCBF and higher scores on Neuroticism for women (red) and men (green). Sagittal, coronal and axial views of the brain are shown. The yellow line represents the location or slice of the brain shown in the lower right hand corner. Path model of the mediation of the effect of Neuroticism on depressive symptoms through hippocampal activity. "}]