[{"section_title": "Abstract", "text": "Contracts serve as coordination mechanisms which allocate value, risk, and decision rights across buyers and sellers. The use of marketing contracts in agriculture, specifically for crop production, has been increasing over the past decade. This study investigates the determinants of agricultural marketing contract design employing data from the USDA's Agricultural Resource Management Survey. Models are estimated to analyze the association between producer and contractor characteristics, the decision to produce under contract, and the types of contract structures observed in practice, while controlling for the potential for endogenous matching between contracting parties. Results indicate that while certain producer characteristics are significantly associated with the decision to produce corn or soybeans under contract, there is no significant association between those characteristics and specific contract attributes."}, {"section_title": "INTRODUCTION", "text": "The proportion of U.S. agricultural production sold under contract is becoming increasingly large. In 2005, 41 percent of the value of U.S. farm production was sold under contract, compared to 28 percent in 1991 and just 11 percent in 1965 (MacDonald and Korb, 2008 . Numerous explanations for the increased use of contracting have been proposed, including supply-chain organization (Tsoulouhas and Vukina, 1999) , more discriminating consumers (Barkema, 1993) , more efficient relationships between buyers and sellers (Drabenstott, 1999) , information asymmetries (Hennessy, 1996) , quality control (Hueth and Ligon, 1999; Hennessy and Lawrence, 1999) , procurement considerations specific to the dynamics of agricultural decision making (Sexton and Zhang, 1996) , declining commodity prices (Fulton et al., 2003) , and the decoupling of farm support legislated in the 1996 farm bill (Coaldrake et al., 1995) . The risk preferences of producers have also been shown to impact the intensity of agricultural contracting decisions, with more risk-averse farmers preferring production contracts over the use of marketing contracts or spot markets in the U.S. hog industry (Zheng et al., 2008) .\nContracted crop production is usually coordinated through marketing contracts, which provide for more control and decision rights to the producer compared to the production contracts used in livestock production. Marketing contracts can serve as a method of price risk management to the producer and/or provide a premium to average spot market prices, 1 and are used most intensively for high-value or trait-specific versions of general commodities (e.g., high-oil corn and low-linoleic soybean). Additionally, they can also serve as coordination mechanisms in thin markets for specialty crops.\nIn general, a contract can be characterized by its allocation of value, risk, and decision-making rights among the contractor(s) and contractee(s) (Sykuta and Parcell, 2003; Sykuta and Cook, 2001) . That contracts are structured, in equilibrium, to efficiently allocate risk between the parties towards the goal of aligning incentives is an assumption based in the principal-agent approach to contract theory (Sheldon, 1996; Allen and Lueck, 1999) . There are two very general (and related) hypotheses stemming from the standard principal-agent approach, namely, (a) higher levels of risk in the contracted activity (i.e., agricultural production) should result in contracts more highly motivated by risksharing between the contracting parties, 2 and (b) optimal contract design will shift a relatively greater share of the risk to the less risk-averse party (Stiglitz, 1974) . Given these hypotheses, one would expect the preferences and characteristics of 1 MacDonald and Korb (2008) report premiums in the range of 10-20 percent above average U.S. spot prices received for corn and soybean from 1996-2005 using the USDA ARMS data. 2 See Allen and Lueck (1999) for further discussion and additional references. the contractor and contractee, as well as the characteristics of the commodity being contracted, to determine the attributes of the optimal contract.\nThe present study contributes to the literature by investigating the determinants of agricultural marketing contract design, specifically controlling for endogenous matching of principals, agents, and activities. The method advanced by Ackerberg and Botticini (2002) to control for endogenous matching is applied to data from the USDA's Agricultural Resource Management Survey (ARMS). The ARMS data set lends itself well to this purpose, as it is administered to thousands of producers every year by the Economic Research Service and the National Agricultural Statistics Service and is designed to provide an accurate representation of the agricultural sector in the U.S. (ERS, 2008) . The survey contains a section devoted to marketing and production contracts which includes questions regarding the structure of each contract, as well as characteristics of the contractor. Furthermore, socioeconomic data are available for each farm included in the survey, providing a variety of measures which can be used as proxies for farm-level productivity and risk preferences.\nWe construct and estimate several models to analyze the association between producer and contractor characteristics and the decision to produce under contract and the types of contract structures that arise in practice, while controlling for the potential for endogenous matching between contracting parties and crops. Our results indicate that while producer characteristics are significantly associated with the decision to produce corn or soybeans under contract (regardless of the specific design of the contract), there is no significant association between the same producer characteristics and the specific attributes of the contracts, such as its specific pricing terms."}, {"section_title": "BACKGROUND", "text": "While the theoretical work on contracts has been an important and relatively recent development in the economics literature, empirical work in this area has produced mixed results. Experimental and survey-based contributions to the literature have also been provided, illustrating some support for the relationship between the risk attitudes of the producer and the contract attributes in crop and, to a larger extent, livestock contracting examples (Lajili et al., 1997; Parcell and Langemeier, 1997; Roe et al., 2004) . However, inferences based on theoretical models, survey responses, or derived from experimental designs may differ from the results obtained by analyzing observed contract data.\nThere exists a large body of literature, both theoretical and empirical, focused on land-tenure contracts.\n3 A l l e n a n d L u e c k ( 1 9 9 9 ) p e r f o r m e d a n empirical analysis of the role of risk in contract choice based on a large data set of land rental agreements between landlords and farmers in North America. Using an ordinary-least-squares (OLS) framework, they found little support for the hypothesis that risk-sharing is an important determinant in shaping rental agreement contracts and concluded that transaction costs are likely the more relevant factor due to the availability of highly developed crop insurance, credit, and commodity markets for the management of price and production risks. Ackerberg and Botticini (2002) built and improved upon previous work on land-rental contracts using a data set on crop-sharing agreements in Italy from the 1400s. They proposed a model which recognized the potential for endogenous matching of the contracting parties based on their preferences/characteristics, as well as on the characteristics of the commodity being produced. Using estimation methods which control for such endogenous matching, they found evidence of risk-sharing motivations in their data set which would not have been evident had the effects of endogeneity not been controlled.\nOther authors have focused on the impacts of contractor, or principal, characteristics on the design of agricultural production and marketing contracts. Sykuta and Cook (2001) outlined a theoretical framework that suggests differences in the attributes of contracts offered through producer-and investorowned firms are motivated by relative levels of trust in the organization on the part of producers. Using a survey of crop producers in Missouri, James and Sykuta (2006) provided evidence of a producer preference for marketing to cooperatives over private or investor-owned firms stemming from a higher level of trust in cooperative organizations, with the effect being greater for the marketing of soybeans compared to corn. Roe et al. (2004) found a similar preference for cooperative firms in the choice of marketing contracts by hog producers in their experimental survey approach.\nAnalysis specific to marketing contracts and crop production has been more limited, with the bulk of the work focusing on the marketing of specialty crops such as fruits and vegetables (Fraser, 2005; Hueth and Ligon, 1999; Sexton and Zhang, 1996) . An exception is the study by Lajili et al. (1997) , who employed a theoretical model to derive some testable hypotheses regarding the relationships between asset specificity, risk aversion, leverage, and the level of cost and risk sharing built into crop production and marketing contracts. Using experimental data from a survey design, they found that more highly leveraged farms preferred contracts over shorter periods of time with higher levels of risk sharing, while other observed farmer characteristics, such as age and farm size, did not have a significant effect on preferences over a menu of contracts."}, {"section_title": "METHODOLOGY AND DATA", "text": "Following Ackerberg and Botticini (2002) , we begin by supposing that there exists a general relationship where the attributes of the optimal contract (y) are determined by the characteristics of the activity being contracted (c), the principal (p), and the agent (a). Such a relationship is represented by a regression as in (1):\nwhere the α's denote coefficients associated with the respective characteristics, and ε is an error term. A fundamental problem for estimating (1) arises when the agent's characteristics (a) are unobservable. Unfortunately, this is precisely the situation faced by researchers when attempting to fit (1) to investigate the hypotheses postulated by contract theory. This is true because according to contract theory, the principal and the agent's risk preferences are crucial determinants of the contract attributes, but such preferences are typically unobservable. Other unobservable agent characteristics that may be important to determine the attributes of the optimal contract are his/her productivity and opportunity cost of effort.\nIf the relevant agent characteristics are unobservable, (1) cannot be estimated as such. However, one may substitute the unobservable characteristics with observable variables or proxies (o) correlated with them as in (2), and estimate regression (3) instead:\nwhere γ o ≡ α a β o and ε o ≡ α a ε a + ε. For example, income, wealth, age, off-farm income, and the debt-to-asset ratio are often used as proxies for risk aversion (Huffman and Just, 2004; Mishra and El-Osta, 2002; Allen and Lueck, 1999; Lajili et al., 1997; Smith and Baquet, 1996) , while education and experience are commonly used proxies for risk-aversion (Velandia et al., 2009; Sherrick et al., 2004) and farm-level productivity (Lockheed et al., 1980) . Succinctly, the problem with estimating (3) by means of standard methods (e.g., OLS) is that the coefficients are biased if agents endogenously match with activities and/or principals. If such endogenous matching exists, bias in the coefficients arises because of the correlation between the regressors in (3) and the residuals (ε o ).\nTo see why regressors may be correlated with residuals (ε o ) in (3), suppose for example that there is endogenous matching between agents and crops because agents with certain characteristics tend to select activities with specific features. This association between crops and agents is represented by the matching equation (4):\nwhere (4') follows from (2). But (4') implies that the covariance between regressor c and ε o in (3) equals α a β a Var(ε a ). Since regressors are correlated with the residual in (3), estimation by means of standard methods will yield biased coefficient estimates for such a regression (Greene, 2003, p. 75) .\nTo control for the potential bias induced by endogenous matching, Ackerberg and Botticini (2002) proposed using a two-stage estimation approach to account for endogeneity. More specifically, their approach consists of replacing the actual values of the potentially endogenous activity and principal variables in equation (3) with their respective estimated values. The latter are obtained by fitting matching equations like (4') across non-overlapping geographic regions so as to achieve identification.\nThe present analysis is performed by means of the approach introduced by Ackerberg and Botticini (2002) , employing data from the Agricultural Resource Management Survey (ARMS) which is conducted annually by the U.S. Department of Agriculture. ARMS data include detailed information on marketing contracts used by farmers to sell their commodities, and to the best of our knowledge it provides the largest data set available for this type of analysis. Farmers identify the price, quantity, and value for each commodity sold under contracts. The main version of the survey also includes more detailed questions about the specifications of the marketing contracts, such as the quantity and pricing mechanisms, and characteristics of the contractors.\nDue to availability of information about contract attributes, the analysis is based on ARMS data from the main version of the survey for the years 2003, 2004, and 2005 . The sample is further restricted to farmers in the states of Illinois, Indiana, Iowa, Minnesota, Missouri, and Ohio who produced corn and/or soybeans. The subsample chosen should prevent the results from being driven by the substantial differences in technological and environmental resources found across the farms in the entire sample. Table 1 summarizes the sample statistics for the main variables used in the analysis. The dataset used in estimating the decision to contract models are at the farm level, and includes 1,647 farm operations. The dataset used to estimate the contract attribute models is at the contract level, and includes a total of 1,054 contracts for corn and soybean production. Since the ARMS data include survey weights indicating the number of farms in the U.S. that is represented by each farm in the survey sample, means and standard deviations calculated using the jackknife approach are also reported in Table 1 . 4 Such estimates are useful because they are representative of all marketing contracts used by U.S. corn and soybean producers. For a similar reason, all of the estimations performed and reported in the following tables are weighted using the jackknife method.\nBinary dummy variables CornContractD, SoyContractD, FormulaD, QualityD, and QuantityD represent the contract characteristics being investigated (i.e., variable y in regression (1)). CornContractD (SoyContractD) equals one if the farmer enters into a formal contract for corn (soybeans), and equals zero otherwise. FormulaD equals one (zero) if the contract does (does not) stipulate a commodity price calculated by a formula. QualityD equals one (zero) if the contract does (does not) specify that the price be based on quality attributes of the commodity. Finally, QuantityD equals one (zero) if the contract does (does not) provide for a specific quantity of the commodity.\nActivity characteristics (i.e., variable c in regression (1)) are measured by the proportion of the value of the farm's production obtained from corn and soybeans (CornProp and SoyProp, respectively) at the decision to contract level, and, at the contract attribute level, by a binary variable equal to one if the contract is for corn and equal to zero if the contract is for soybeans (CornD).\nThe characteristics of the principal (i.e., variable p in regression (1)) are mainly captured by a binary variable describing the organizational structure of the contractor, equal to one if the contractor is a cooperative and equal to zero otherwise (CoopD). The OtherContD variable acts as a proxy for the market power of the contractor(s) available in the area.\nFinally, the variables employed as proxies for the unobservable agent characteristics (i.e., variable o in regression (1)) are the value of the farm's total production (VFP), the farm household's net wealth (HHNW), the total income earned off the farm (OFI), the farm operation's debt-to-asset ratio (DTA), the age of the farm operator (Age), the farm operator's years of experience (Experience) and education (Education), and a set of binary variables equal to one if the farm is defined as a hobby farm (HobbyD), if the farm purchased crop insurance CropInsD are postulated to be related to the agent's behavior toward risk, whereas Experience, Education, and HobbyD are posited to be associated with the agent's productivity. Ceteris paribus, farmers with greater levels of net wealth (HHNW), off-farm income (OFI), and value of farm production (VFP) are likely to be willing to bear greater levels of risk under the common assumption of decreasing absolute risk aversion. In contrast, following the findings of Lajili et al. (1997) , operations with high debt-to-asset ratios (DTA) are assumed to induce farmers to take on less risky activities relative to similar operations with lower leverage levels. 5 Similarly, other things equal, older farmers (Age) are likely to be less willing to take on risks that may imperil their retirement income due to their life-cycle stage (Fukunaga and Huffman, 2009) .\nCropInsD is clearly associated with the farmer's attitudes toward risk, but its relationship with risk taking is ambiguous a priori. This is true because CropInsD reveals a preference for insurance, and as such a smaller willingness to take on risks. However, it may also be argued that a farmer who purchased insurance is more willing to take on additional risks. Moreover, choices with respect to risk management activities combine to form a risk management portfolio with the use of individual tools (i.e. contracting or insurance) impacting the use of alternatives (Velandia et al., 2009) .\nProductivity is expected to be positively associated with experience (Experience) and education (Education), and to be lower for hobby operations (HobbyD). Additionally, the hobby farm dummy also controls for differences in farm type (i.e., hobby vs. \"commercial\" farms).\nConceptually, a farmer's optimal contract can be considered at two different levels, namely, (a) whether to enter a formal contract or not, and (b) conditional on contracting, the optimal contract structure. The two levels of analysis are discussed in respective order in the next subsections."}, {"section_title": "The Decision to Contract", "text": "A farmer's decision of whether to enter into a formal contract is examined by estimating logit model (5) The CropProp v a r i a b l e d e s c r i b e s t h e r e l a t i v e i n t e n s i t y o f t h e f a r m ' s production of the commodity which is potentially being contracted, which is assumed to be an endogenous choice of the farm operator. This endogeneity is controlled for through the OLS estimation of a matching equation like (4') for each state, outlined in equation (6) Evidence for endogeneity exists if the coefficient estimates from (6) are statistically different across states. Thus, we also estimated (6) across the pooled sample including state dummies interacted with each of the regressors. Individual t-tests performed on the interaction term coefficients indicated that effects differ across states, providing evidence for endogeneity and justification for our twostage approach.\n6 Contract equation (5) is then estimated using the predicted values of CropProp from the estimated matching equations.\nState dummies are not included in the estimation of (5) to satisfy exclusion restrictions. To justify this exclusion, the advocated model assumes that relationship (1) holds regardless of the state. This assumption is similar to, e.g., assuming the same production function for a cross section of farmers when estimating production parameters. It is not possible to prove or disprove this assumption, because to do so would require fitting relationship (1) on a state-bystate basis. The required data on principal characteristics (p) are not available. To make this assumption more tenable, we restrict our attention to corn and soybean contracts for relatively homogeneous states within the Corn Belt region.\nTo account for the additionally variability introduced by the use of estimates from the first-stage in obtaining the estimation results for the secondstage, we have implemented a two-stage jackknife procedure to adjust the secondstage standard errors. For each jackknife subsample, first-stage estimates were computed and fitted values were generated for the entire sample. Then, secondstage estimates were computed for each of the first-stage subsamples. Reported standard errors are based on the resulting sampling distribution of the secondstage estimates.\nAmong the set of risk-related explanatory variables in the logit model for corn, only the crop insurance (CropInsD) dummy was found to be statistically significant. Farmers who purchase some form of crop insurance were found to be more likely to enter into marketing contracts for corn. The presence of crop insurance increased the probability of contracting corn by an estimated 13.17 percent based on the marginal effects implied by the adjusted coefficients.\nThis result is consistent with previous research which has indicated the potential for more intensive use of marketing options in the presence of crop insurance (Paulson et al., 2008; Coble et al., 2000) . The explanation behind these results is fairly intuitive. Yield insurance covers the yield risk that could exacerbate losses under a marketing contract, ultimately reducing the risk of the farmer not being able to deliver on a contract. Revenue insurance covers both yield and price risk, thus reducing the incentive to enter into a marketing contract to manage price risk. In the case of productivity-related explanatory variables for the decision to contract corn production, the hobby farm dummy (HobbyD) was found to negatively impact the decision to contract and was statistically significant at a 10 percent level. The estimated coefficient implied that hobby farms were, on average, 11.77 percent less likely to use contracts for corn production. Hobby operators may be less inclined to contract their corn production, as they may assign a relatively larger weight on the negative aspects of contracts (e.g., the potential liability burden and the loss of managerial freedom associated with contracting). None of the other farm characteristics, such as the net wealth of the household (HHNW), off-farm income (OFI), and the operator's age (Age), experience (Experience), and education (Education) were estimated to have significant effects on the probability of producing corn under contract. The results for soybean contracts are reported in Table 3 . 9 The intensity of soybean production is estimated to be significantly and positively associated with the decision to contract soybean after adjusting for endogeneity, with an increase of 10 percent (0.10) in the proportion of soybean production on an operation increasing the probability of using contracts by an estimated 7.76 percent on average.\nLarger farms, as measured by the value of production (VFP), are estimated to be more likely to contract, with an increase of $100,000 in the VFP leading to a 1.56 percent greater probability of using contracts. Operations with greater debtto-asset ratios are also significantly more likely to grow soybean under contract, which is consistent with the hypothesis that more highly leveraged farms are more likely to engage in risk management activities. The effects of the CropInsD and HobbyD v a r i a b l e s a r e s i m i l a r t o t h o s e f o r c o r n c o n t r a c t s . F a r m s w i t h c r o p insurance are significantly more likely to produce soybean under contract, as the presence of crop insurance is estimated to increase the probability of soybean contract use by 8.32 percent. Hobby farms are significantly less likely to enter into contracts for soybean, with an estimated average marginal effect of -15.22 percent on the probability of contracting soybean for those operations defined as hobby farms. The relationships between farm size, type, and the propensity for contracting are consistent with the observations of MacDonald and Korb (2008) in analyzing the ARMS data.\nAs with the results for corn contracts, other farm characteristics such as HHNW, OFI, Experience, and Education were not found to be insignificant explanatory variables in the decision to use marketing contracts for soybean production. The lack of significance of these farm characteristics was robust to a number of alternative specifications for both the corn and soybean contract models.\nNote that the crop intensity variable (CornProp) was found to be positive and significant for corn contract decisions prior to the adjustment for endogeneity. However, once the matching equation (6) is included and the estimates in the contracting decision equation (5) are adjusted, the crop intensity variable was found to be non-significant. The opposite effect was found for the decision to contract soybean, with the crop intensity variable (SoyProp). Adjusting for endogeneity results in a coefficient estimate for the SoyProp variable implying an effect four times as large as the naïve estimate. Moreover, the naïve estimate was only significant at the 10 percent level, whereas the adjusted estimate was significant at 5 percent. Among the limited subset of other variables that were estimated to have a statistically significant effect on contracting decisions, the magnitudes of the coefficient estimates and corresponding marginal effects also differed. At the very least, this implies that endogenous matching may be a concern and the failure to adjust for this effect could lead to biased results and inaccurate inferences related to the relationship between the farm or agent characteristics on the decision to produce corn or soybean under contract. Table 4 reports the parameter estimates and goodness-of-fit measures 10 for the specific contract attribute models defined by equation (7). The second and third columns show the estimates corresponding to the naïve and adjusted logit models where the dependent variable is whether the price received under the contract is determined by a formula (FormulaD). The use of a formula implies a larger degree of price uncertainty relative to a contract which specifies a single deterministic price. Therefore, one would expect more risk-averse producers to prefer contracts that outline a single price. Similarly, producers would be expected to be more willing to accept contracts with formula prices (i.e., more price risk) with a cooperative organization that garners greater levels of trust (James and Sykuta, 2006) . However, neither producer risk nor productivity characteristics nor the organizational structure of the contractor were found to significantly impact whether the contract included a formula-based pricing mechanism."}, {"section_title": "The Contract Attributes", "text": "To examine the impacts of the commodity type, the contractor, and the characteristics of the operator on the contract attributes, regression (3) is specialized to the logit model (7): The estimation results from the state-level and pooled matching equations are not the main results of interest for our analysis and, therefore, not provided. They are available from the authors upon request.\nfor Attribute = {Formula, Quality, Quantity} and Year = {2004, 2005}. The specific contract attributes analyzed are whether the price received by the farmer is determined by a formula (FormulaD) or based on quality attributes of the commodity delivered to the contractor (QualityD), and whether the contract is for a specified quantity of product (QuantityD).\nEndogeneity of the contractor and crop type variables is controlled for through the logit model matching equations (8) and (9) (8) and (9) are estimated by state, and a logit regression is then used to estimate (7) excluding state dummies and using the predicted values for CropD and CoopD. As before, the matching equations were also estimated across the pooled sample with state dummies interacted with the regressors to test for endogeneity. Similar to the decision-to-contract analysis, the individual t-tests on the interaction coefficient estimates provided evidence of endogeneity, again justifying our two-stage approach.\nThe insignificance of the explanatory variables held even after the estimation procedure was adjusted to account for potential endogeneity. The fourth and fifth columns of Table 4 report, respectively, the naïve and adjusted estimates of the effects of producer and contractor characteristics on the likelihood of prices received under the contract being conditional on quality attributes of the contracted product (QualityD). Similar to contracts with formula pricing, tying price to quality attributes of the commodity may expose the farmer to more price risk driven by quality uncertainty. This implies that, all else equal, more risk-averse producers would tend to enter into contracts where price is independent of quality attributes. However, as in the case of formula pricing, the ARMS data provide no statistically significant evidence of the utilization of contracts with quality-contingent prices differing across producers or contractor types. Again, the insignificance of the crop, contractor, and farm characteristics applied to the results from both the naïve and adjusted estimation procedures.\nFinally, the sixth and seventh columns of Table 4 report the naïve and adjusted estimates for the regressions where the dependent variable is whether or not the contract outlines a specific quantity to be delivered by the producer (QuantityD). Specifying a quantity exposes the producer to a greater share of the commodity production risk, so one would expect more risk-averse producers to be more likely to enter into contractual arrangements that do not specify a quantity to be delivered to the contractor. The QuantityD results differ slightly from those of the other attribute models shown in Table 4 in that more highly educated producers are more likely to use contracts where quantities are specified. Farmers with higher educational levels 11 were estimated to increase the likelihood of contracting by 12.8 percent. As for the other characteristics included in the analysis, no evidence of any significant effects was found indicating whether marketing contracts outlining specific quantities to be delivered are more or less likely to be used.\nThe regression results are surprising in that contract theory predicts that the risk preferences and characteristics of the contracting parties should impact the resulting contract. A number of arguments could be used to explain our findings. First, other than organizational structure (CoopD), we lacked data on the principals. It is possible for contractors to be relatively more risk averse than producers, in which case the (unobserved) risk preferences of the former may be the main drivers of the contract outcomes. A related explanation is the potential market power of the contractors. If only one or a limited number of contractors are located within feasible proximity, producers may lack the ability to negotiate specific contract terms. In this instance, the characteristics and preferences of the contractor would tend to determine the specific contract designs, with the producers effectively being faced with take-it or leave-it offers. Additionally, as was previously stated, our ability to separate the allocation of value at the contract level was limited by the nature of the data. The contract specifications associated with higher levels of relative risk (e.g., formula prices or specific quantities) may use higher price premiums to compensate for the additional price or production risk.\nFinally, the observation of insignificance may be due to the choice of crops and regions examined. As highlighted by Allen and Lueck (1999) , there exists highly developed commodity, credit, and, for corn and soybean, subsidized insurance markets that can be used to manage and mitigate price and production risks. The importance and ability of risk-sharing to be achieved through contract design may be dominated by the opportunities afforded by these other risk management alternatives. "}, {"section_title": "RESULTS AND DISCUSSION", "text": "Results corresponding to the estimation of regressions (5) and (7) are discussed in respective order in the following two subsections. 8 results of the logit model estimation imply that more intensive corn operations (i.e., those with larger CornProp values) are more likely to enter into contracts for corn. However, after adjusting for endogeneity, the effect of the farm's corn intensity is found to be statistically insignificant. The effect of adjusting for endogeneity was also found to impact the statistical significance of the value of production (VFP) and debt-to-asset ratio (DTA) variables. Thus, not correcting for endogeneity could lead to misleading conclusions related to the effects of these agent characteristics on contracting decisions."}, {"section_title": "CONCLUDING REMARKS", "text": "While contract theory postulates that there exists a link between certain characteristics of the principal and agent and the resulting contract between the parties, there seems to be limited support for this relationship in the scant empirical literature devoted to marketing contracts used for crop production. We add to the empirical literature on marketing contracts by applying the econometric method proposed by Ackerberg and Botticini (2002) to ARMS survey data for corn and soybean producers in six Midwestern states from 2003 through 2005. The method accounts for the potential impact on estimation and inference of endogenous matching between agents, contractors, and activities. The estimation of the contracting equation is performed using instrumental variables to correct for the potential impact of endogenous matching. Our results at the contract decision level illustrate that the failure to account for this potential endogeneity can impact the magnitude of the coefficient estimates as well as the interpretation of those estimates with respect to their statistical significance.\nWe find evidence of producer characteristics impacting the decision to grow corn or soybean under formal contract agreements. These effects are largely consistent with both theoretical predictions and those based on survey data and experimental approaches reported in previous studies. For example, farmers who purchase crop insurance are more likely to produce corn and soybean under contract while small hobby farms are less likely to use marketing contracts. Farm size and leverage are found to have positive and significant impacts on the use of contracts for soybean production. However, we find almost no evidence of observed producer or contractor characteristics impacting the attributes of the marketing arrangements at the contract level, more specifically pricing, quality, and quantity provisions within the contract.\nOur findings indicate that factors other than the proxies used for farmer risk preferences may play a more dominant role in determining the specific structure of agricultural marketing contracts for corn and soybean in the Midwest, which is a result consistent with previous work in other areas. For example, the risk preferences of the contractor (principal), which are also largely unobserved and for which proxies do not exist in the ARMS data, have been shown to impact the attributes of land-tenure contracts observed in practice (Fukunaga and Huffman, 2009; Huffman and Just, 2004; Rainey et al., 2005) . Monopoly power of the contractor might also limit the menu of contract options available to producers as well as their negotiating power with respect to contract terms."}, {"section_title": "12", "text": "These results should be interpreted with care due to the limitations of the data under study. In particular, the lack of information about the value derived from the specific contracts that are comparable across observations makes it difficult to separate the effects of compensation (allocation of value) from those of producer and contractor characteristics. Also, the majority of principal and agent characteristics that are postulated to affect contract choice and design (e.g., risk preferences) are unobserved and therefore observed proxy measures are used in their place. Consequently, the explanatory power of our models is limited by how well the observed variables proxy the true unobserved characteristics.\nNotwithstanding the aforementioned qualifications, our results lead to potentially important implications for both contract theory and contract design as they are applied to production agriculture. If in fact observed producer and contractor characteristics are not determining factors in the design of marketing contracts, further theoretical and empirical research is warranted to uncover and identify their underlying motivations. Moreover, to the best of our knowledge, ARMS represents the largest data set available allowing for this type of analysis. Despite the existing data limitations, it would be exceedingly difficult to collect primary data that would be as rich and include a more representative collection of agricultural producers in the U.S."}]