[{"section_title": "", "text": "prospective cognitive decline, however, has not been uniformly established. Although unrelated to rate of cognitive decline in the Rotterdam Study (21) , aPWV was found to predict accelerated decline in learning and memory in the Baltimore Longitudinal Study of Aging (22) . Findings from the Baltimore Longitudinal Study of Aging may reflect influences of aortic stiffness and associated central pressures to subtle cognitive changes in mid-to late life.\nTo characterize the potential contribution of central arterial stiffness to cognitive declines among well-functioning older adults, we evaluated the relationships of aPWV with global cognitive function and performance in several cognitive tasks over 6 years in the Health, Aging, and Body Composition (Health ABC) Cognitive Vitality Substudy. This study extends on previous work by characterizing associations of aPWV with longitudinal cognitive decline among older adults who were initially free of functional limitation."}, {"section_title": "Methods", "text": ""}, {"section_title": "Population", "text": "From 1997 to 1998, the Health ABC study enrolled 3,075 Medicare-eligible well-functioning men and women aged 70-79 years from Pittsburgh, Pennsylvania, and Memphis, Tennessee. The population was 52% women and 42% black with a mean age of 73.6 years. Participants were recruited from Medicare-eligible adults with contact information provided by the Centers for Medicare & Medicaid Services (formerly the Health Care Financing Administration) on a random sample of white and all black beneficiaries in predesigned zip code areas surrounding the study centers. Other household members aged 70-79 years were also eligible for recruitment. Exclusion criteria included reported difficulty walking one quarter of a mile, climbing 10 steps without resting, or performing basic activities of daily living or need for a walking aid.\nThe Cognitive Vitality Substudy was initiated in Year 3 of Health ABC. Participants were selected from the top 20% of performers on an endurance walk test (23) in Year 2 from each of eight demographic groups defined by sex, race, and study site (Memphis or Pittsburgh). An equal number were then drawn at random from the remaining members of each group yielding 951 black and white women and men aged 71-82 years who received additional cognitive testing. Substudy participants were slightly younger (75.5 vs 75.7 years), more likely to be female (54% vs 50%) and white (65% vs 55%), and have less than 12 years of education (30% vs 23%) compared with the Health ABC participants who were not part of the substudy. Substudy exclusion criteria included self-reported difficulty seeing large print or grasping a pen. The Institutional Review Boards of the University of Pittsburgh, Pennsylvania, and University of Tennessee at Memphis approved the study, and written informed consent was obtained from each volunteer. Of the 951 participants in the substudy, 727 had valid PWV data at baseline and cognitive data at Year 3. Of the 727 participants, we excluded those with evidence of cognitive impairment at Year 3 (Teng-modified Mini-Mental Status Exam [3MS] score less than 80; N = 75) or decline prior to Year 3 (decrease in 3MS score of 5 or more points; N = 100), leaving 552 participants for analysis (mean age 73.1 ± 2.7 years, 48% men and 42% black)."}, {"section_title": "Pulse Wave Velocity", "text": "Aortic PWV was measured noninvasively via simultaneous Doppler-recorded carotid and femoral pulse waveforms (model 810A, 9.0-to 10-MHz probes, Parks Medical Electronics, Inc.). A minimum of 10 beats were recorded for each simultaneous recording site. Three separate runs were recorded for each participant, and all usable runs were averaged to calculate the final aPWV measure. The distance between the carotid and femoral recording sites was measured above the surface of the body with a tape measure. The time delay between the feet of the pressure waves at each site was divided by the associated distance to calculate aPWV in centimeters per second. Replicate measures of aPWV in 14 participants revealed intraclass correlations of .88 between sonographers and .84 between readers (15)."}, {"section_title": "Cognitive Tests", "text": "Cognitive function was assessed at Years 3, 5, 7, and 9. The Modified Mini-Mental Status Exam (3MS) (24) is a commonly used evaluation of global cognitive function, including orientation, attention, calculation, language, and short-term memory. Scores can range from 0 to 100 points, with lower scores indicating poorer performance. The Buschke Selective Reminding Test (SRT) (25) is a multipletrial list-learning task used to measure verbal learning and memory. In this task, the examiner presents a list of 12 written words and reads each word aloud. The participant is then asked to recall the words presented. For the next trial, the examiner repeats the words the participant failed to recall and then asks the participant to provide the full list of 12 words. This procedure is repeated five times. Delayed recall is scored as the number of words recalled 20-30 minutes after the sixth trial. The Boxes and Digit Copying (BDC) tests are timed tests of psychomotor speed (26) . The participant is asked to complete as many boxes and copy as many digits as possible within 30 seconds for each test. Psychomotor speed is scored as the sum of total boxes and digits completed (r = .77). Finally, the Pattern and Letter Comparison (PLC) tests are timed tests of perceptual speed (26) . The participant is asked to determine whether pairs of patterns and letters are the same or different within 30 seconds for each test. Perceptual speed is scored as the sum of correct pattern and letter comparisons (r = .64)."}, {"section_title": "Covariates", "text": "We considered as covariates variables that were identified in the literature as potential confounders of the relationship between aortic stiffness and cognitive function or were associated with both baseline aPWV and Year 3 3MS score in this cohort at a significance level of 0.15. Selected covariates included demographic variables (age, race, sex, education [years of school, ≤12 vs >12 years] and clinic site), risk factors (body mass index, history of smoking, physical activity, total cholesterol, resting heart rate, mean arterial pressure, and depressive symptoms), and chronic conditions (prevalent hypertension, coronary heart disease, cerebrovascular disease, and diabetes mellitus). All covariates were obtained from the baseline visit with the exception of depressive symptoms, which were evaluated at Year 3. Body mass index was calculated as measured weight in kilograms divided by measured height in meters squared. Physical activity was assessed by questionnaire and used to calculate the kilocalories expended for all forms of walking and exercise, stair climbing, and vigorous activity in the previous week; participants with at least 1,000 kcal expended were defined as active. Total cholesterol was determined from fasting blood samples collected at the baseline clinic visit. Systolic and diastolic blood pressures were each measured twice and averaged; mean arterial pressure was calculated as diastolic pressure + 1/3 (systolic pressure − diastolic pressure). Depressive symptoms were assessed using the Center for Epidemiological Studies-Depression 10-item scale (27) . Presence of hypertension and other conditions at baseline was determined from participant reports of diagnosis and use of specific medications or procedures."}, {"section_title": "Statistical Analysis", "text": "Differences in baseline characteristics across tertiles of aPWV and 3MS score were tested with chi-squared tests for categorical variables and analysis of variance or KruskalWallis tests for continuous variables. Separate linear regression models were used to evaluate the association between aPWV as the independent variable and performance on each cognitive test as the dependent variable. In these models, scores for each cognitive test were standardized to allow for direct comparison of regression coefficients. Logistic regression was used to test the association of aPWV with cognitive decline, defined as five points or more decline on the 3MS (28), and greater than 1 SD more than the mean change on the SRT, BDC, and PLC from Year 3 to Year 9. Multivariate linear and logistic regression models were built using a backward procedure (p out = .05) to adjust for vascular risk factors and chronic conditions after entering in aPWV and demographics.\nBecause the relationship of hypertension with cognitive decline may differ in normal aging and preclinical dementia, we repeated logistic regression models of cognitive decline after including in the sample participants with evidence of cognitive impairment or decline at Year 3 (n = 175). These analyses tested interactions of aPWV and cognitive status, categorized as normal cognitive function versus cognitive impairment or decline.\nFinally, mixed models were used to confirm the associations of aPWV with decline in each cognitive test. The models included as outcomes all cognitive data available throughout the study period, improving statistical power and reducing potential bias due to nonrandom censoring, relative to logistic regression models. To account for an apparent learning effect in the verbal memory test from Year 3 to Year 5, models of decline in this test were restricted to Years 5, 7, and 9. Simple models of decline in each cognitive test included a random intercept for subject, a random slope with time, and clinic site, aPWV and the interaction of aPWV with time as fixed effects. A second model was further adjusted for demographics and the interactions of each covariate with time. Full models were built using a backward procedure (p out = .05) to additionally adjust for vascular risk factors and chronic conditions and the interactions of each covariate with time. Analyses were repeated with adjustment for baseline performance on each cognitive test. No structure was imposed on the covariance matrix of the random effects. Continuous covariates were centered to reduce multicollinearity and simplify interpretation of model coefficients. Analyses were performed in SAS 9.1 (SAS Institute, Inc., Cary, NC) and Stata 10 (STATA, Houston, TX)."}, {"section_title": "Results", "text": "Mean age (SD) of this cohort at baseline was 73.1 (2.7) years; 48% were men and 42% black. Mean (SD) aPWV was 886 (389) cm/s. Participants with higher aPWV were more likely to be black, hypertensive, less active, and have higher body mass index, heart rate, and mean arterial pressure (Table 1 ). In linear regression models adjusted for demographics, aPWV was inversely associated with global cognitive function, psychomotor speed, and perceptual speed but was unrelated to verbal memory. Further adjustment for risk factors and chronic conditions in the backward procedure did not substantially change the coefficients for aPWV in full models of each cognitive test (Table 2) .\nOf the 552 participants in the sample, 406 completed cognitive testing at Year 9 and were included in logistic regression models of cognitive decline (mean age: 73.0 ± 2.7 years, 47% men and 42% black). Sixty-four participants declined 5 points or more on the 3MS. Cognitive decline greater than 1 SD from the mean change related to a decline of 3 points or more on the SRT (n = 49), 20 or more on the BDC (n = 49), and 5 or more on the PLC (n = 68). Fully adjusted, with each SD higher aPWV, the odds ratio increased by a factor of 1.42 for risk of decline in psychomotor speed (Table 3 ). The association of aPWV with psychomotor speed decline was attenuated (odds ratio = 1.10, 95% confidence interval = 0.82, 1.47) after inclusion of participants with evidence of cognitive impairment or decline at Year 3; however, interactions of aPWV with cognitive status were nonsignificant. aPWV was not associated with risk of decline in global cognitive function, verbal memory, or perceptual speed in logistic regression models adjusted for demographics.\nResults of mixed models of cognitive decline in the full sample were consistent with results of logistic regression models (Table 4) . Fully adjusted, the calculated contribution of each SD higher aPWV to psychomotor speed decline was modest though statistically significant: 0.298 points per year (95% confidence interval = 0.099, 0.498). aPWV was not associated with decline in global cognitive function, verbal memory, or perceptual speed in mixed models adjusted for demographics. Estimates changed minimally after additional adjustment for baseline cognitive performance."}, {"section_title": "Discussion", "text": "In this community-dwelling cohort, aPWV was inversely associated with global cognitive function, psychomotor, and perceptual speed but was not related to verbal memory. Higher aPWV was also associated with accelerated decline in psychomotor speed over 6 years. These data suggest a contribution of central arterial stiffness to cognitive decline independent of hypertension and other traditional vascular risk factors.\nAlthough several studies of older adults have identified an inverse association between arterial stiffness and cognitive function cross-sectionally, few have evaluated the relationship of arterial stiffness with several cognitive tasks or longitudinal cognitive decline. The task-specific associations in this cohort are consistent with a mediating role of cerebral small-vessel disease (20) , a common manifestation of ischemic injury that preferentially affects executive function and processing speed while sparing verbal memory (29, 30) . Executive function and processing may be particularly vulnerable to vascular injury (9,10) because much of the deep white matter is perfused by arterioles with few interconnections available to preserve blood supply in the presence of ischemic injury (31) . Several pathways have been hypothesized to associate arterial stiffness with cerebral microvascular disease and cognitive decline (32) . First, the loss of cushioning capacity of the stiffened aorta allows damaging central pulse pressures to be transmitted to the fragile small vessels of target organs (7, 8) . Highly pulsatile flow may accelerate the narrowing of the cerebral vasculature, impeding delivery of energy substrates and nutrients to active brain cells. The resulting state of chronic hypoperfusion may directly injure cerebral white matter or allow toxic metabolic byproducts to accumulate within the brain and blood vessels (32) . Moreover, generalized thickening of the cerebrovascular endothelium and associated endothelial dysfunction may contribute to thrombosis and microinfarcts as apparent in malignant hypertension (33) . Concurrent breakdown of the blood-brain barrier may allow toxins, proteases, or other substances in the blood to enter the brain interstitial space and injure surrounding neurons and glial cells (34) .\nIn contrast to our findings, aPWV did not predict cognitive decline in the Rotterdam study (21) ; however, in the Baltimore Longitudinal Study of Aging, elevated aPWV was associated with accelerated decline on tests of language and memory. The effect size that we identified for 3MS decline was modest and nonsignificant, although aPWV has previously been found associated with longitudinal MiniMental State Examination decline in older adults reporting memory problems (35) . Inconsistent associations across studies may in part reflect important differences in selected cognitive assessments, for example, memory tasks that are more demanding of executive control and attention may be more sensitive to cerebrovascular alterations in aging (10) . It is also possible that in older adult cohorts, a contribution of aortic stiffness to subtle cognitive changes may be partially obscured by the inclusion of participants with preclinical dementia. Findings from the Baltimore Longitudinal Study of Aging and the current study of well-functioning older adults are consistent with an influence of aortic stiffness to age-associated cognitive decline in mid-to late life.\nIt is important to acknowledge that the modest effect sizes that we identified for aPWV may not be considered clinically relevant cognitive change; however, reported associations may be underestimated due to adjustment for hypertension and other vascular risk factors known to contribute to vascular stiffening (36, 37) . Rather, the significance of aPWV in this analysis may be interpreted in relative terms: The effect of a 1 SD increase in aPWV on rate of psychomotor speed decline was equal to that of 2.4 years older age. Similarly, in a previous publication, the contribution of a 1 SD increase in severity of white matter hyperintensities to rate of decline on an executive cognitive task was equal to that of 2.5 years older age (29) . From an etiological perspective, the independent association of aPWV with cognitive decline in this cohort is consistent with a potentially clinically important mechanistic influence of central arterial stiffness to cognitive decline in aging as stiffened vessels may transmit damaging central pressures into the fragile cerebral microvasculature (7) .\nSeveral limitations of this study should be considered. Our analyses do not account for unmeasured progression of aortic stiffness from the time of aPWV measurement to the first cognitive assessment. Also, a potential ceiling effect in the 3MS may have obscured subtle declines in global cognitive function among this initially high-functioning cohort. Estimated associations of aPWV with cognitive decline may be sensitive to nonrandom withdrawal of participants who experienced the greatest functional declines throughout the study period; as expected, participants who completed final Notes: Model 1 unadjusted. Model 2 adjusted for age, sex, race, education, and clinic site. Model 3 additionally adjusted for body mass index, mean arterial pressure, cholesterol, heart rate, smoking status, physical activity, depressive symptoms, prevalent hypertension, coronary heart disease, cerebrovascular disease, and diabetes mellitus. CI = confidence interval; OR = odds ratio. * Decline 5 points or more in global function, 3 points or more in verbal memory, 20 points or more in psychomotor speed, and 5 points or more in perceptual speed. Notes: Model 1 adjusted for clinic site. Model 2 additionally adjusted for age, sex, race, education, and interaction of each covariate with time. Model 3 additionally adjusted for body mass index, mean arterial pressure, cholesterol, heart rate, smoking status, physical activity, depressive symptoms, prevalent hypertension, coronary heart disease, cerebrovascular disease, diabetes mellitus, and interaction of each covariate with time. CI = confidence interval; OR = odds ratio.\nfollow-up (n = 406) were slightly younger at baseline (73.0 vs 73.5 years) and less likely to have cerebrovascular disease (4% vs 8%) and hypertension (47% vs 58%) relative to noncompleters (n = 146). Follow-up assessment of aPWV and executive function were not available to compare rate of change in aPWV with rate of cognitive decline or to evaluate the association of aPWV with decline in the executive domain.\nStrengths of this study include the large communitydwelling population, repeated assessment of performance in several cognitive tasks, ability to account for several important confounders, and a reliable and valid measure of aortic stiffness that predicts morbidity and mortality in older adults (15) .\nIn this initially well-functioning cohort, central arterial stiffness was inversely associated with performance in several cognitive tasks and predicted longitudinal decline in psychomotor speed independent of hypertension and other vascular risk factors. Neuroimaging studies of older adults are warranted to characterize the hypothesized preferential vulnerability of executive-related networks to microvascular disease in the presence of vascular stiffness. Further work is needed to evaluate whether reduction of central arterial stiffness and/or associated central pressures may reduce risk of cognitive decline beyond that expected by brachial blood pressure lowering. As the cognitive consequences of central arterial stiffening continue to emerge, strategies to combat this covert degenerative process of arterial aging should emphasize the long-term control of modifiable vascular risk factors."}, {"section_title": "Funding", "text": "This research was supported by National Institute on Aging (NIA; contract numbers N01-AG-6-2101, N01-AG-6-2103, and N01-AG-6-2106) and in part by the Intramural Research Program of the National Institutes of Health, NIA."}]