[{"section_title": "", "text": "Treatment of severe infections in children often requires prolonged intravenous antibiotic use. Peripherally inserted central catheters (PICCs) facilitate such treatment given their potential for home use, and they have become standard of care for prolonged parenteral antimicrobial therapy (PAT) at many institutions. 1,2 Outpatient PICC use is more cost-effective than hospitalization and has comparable outcomes. 3,4 Unfortunately, children may develop complications associated with a PICC, including displacement and/or malfunction (6%-37%), leakage (2%-11%), occlusion (4%-34%), premature removal (.33%), and bloodstream infections (.15%). 1,[4][5][6][7][8][9] Though studies have demonstrated the safety and efficacy of PICC use in children, none have studied outpatient rural use. However, adverse health outcomes are more frequent in rural populations. 10,11 Children from rural settings are more likely to require readmission after hospitalizations and to reside in areas lacking social and/or physical resources than their urban counterparts, and they are less likely to belong to a medical home. 11,12 Given the lack of data on rural PICC use as well as the rural nature of our state, we studied the safety of home PICC use for treating infections in children in rural settings. We hypothesized that children from rural locales would have higher complication rates than those in urban settings."}, {"section_title": "METHODS", "text": ""}, {"section_title": "Study Design", "text": "We conducted a retrospective cohort study of children ,18 years of age discharged from an academic medical center in the Southwestern United States with a PICC placed for outpatient PAT. Patients were admitted between January 1, 2005, and March 1, 2014. We identified patients through analysis of 43 different International Classification of Diseases, Ninth Revision and Current Procedural Terminology codes indicative of PICC placement, with analysis of the electronic medical record (EMR) to identify patients discharged on PAT with a PICC. In addition, participants were required to have follow-up at our institution and complete information on outcome through PICC removal. We recorded demographic data, antibiotic(s) used, duration and indication for the PICC, and type and timing of complications. To classify rural versus urban residence from the zip code in the EMR, we used rural-urban continuum codes (RUCCs) from the US Department of Agriculture. 13 RUCCs are a validated classification scheme used to categorize counties into 9 groups by degree of urbanization, size, and proximity to a metropolitan area (Table 1). [14][15][16] The driving times in hours and miles to the nearest level 1, 2, or 3 trauma center and our institution were calculated by using Google Maps and the patients' addresses in the EMR. All patients had either weekly home health or clinic visits. Patients were given a 24-hour contact number for on-call pediatric infectious disease physicians. All data were entered into a research electronic data capture platform hosted at our university. 17 "}, {"section_title": "Power Calculations", "text": "On the basis of review of 7 publications in which researchers summarize complication rates with pediatric PICCs, 1,4-9 we anticipated a complication rate of 35.4%. Assuming an SD of 0.474 (from a previous study of PICC use for PAT) 7 and a 2-sided a of .05, we anticipated 178 participants were necessary to demonstrate with 80% power a statistically significant difference of 20% between rural and urban patients."}, {"section_title": "Statistical Methods", "text": "For direct comparison of demographic features and adverse outcomes, participants were dichotomized into residence in more urban regions (RUCCs 1-3) and residence in more rural regions (RUCCs 4-9), an approach validated in the literature. 14 Welch' s t test was used for tests of statistical significance (P value ,.05 considered significant). With linear and logistic regression models, we assessed for differences between outcome and response variables across all RUCCs as a whole. This project was approved by our human research review committee (#15-576)."}, {"section_title": "RESULTS", "text": "Eight hundred and sixty-six patients were identified, accounting for 1066 PICC placements. Of these, 845 placements were ineligible for inclusion, leaving 221 PICC placements in 184 patients meeting inclusion criteria (Fig 1). The maximum number of separate PICC placements in 1 patient was 5, with 37 patients receiving .1 PICC for separate courses of outpatient PAT. The mean age of eligible participants was 9.8 years (median 10.3 years, interquartile range [IQR] 5.3-14.0 years), with 60.6% boys. No significant differences between the rural and urban cohorts were noted for any clinical or demographic variables, including duration of PICC use ( Table 2). The most common indications for PAT were osteoarticular infections (57.9%) and cystic fibrosis exacerbations (23.5%). The most common antibiotics used were tobramycin (25.3%), nafcillin (24.7%), and cefazolin (20.4%). PICCs were used for a mean of 26.1 days at home (median 25 days, IQR 13-37 days). The mean driving distance from our institution was 76.7 miles (median 27.8 miles, IQR 9.7-138 miles, maximum 317 miles), with a mean driving time of 1.3 hours (median 0.6 hours, IQR 0.33-2.3 hours, maximum 10.3 hours). The mean driving distance to the nearest level 1, 2, or 3 trauma center was 26.7 miles (median 12 miles, IQR 6.5-30.5 miles, maximum 170 miles), with a mean driving time of 0.6 hours (median 0.4 hours, IQR Rural residence did not appear to affect the decision to discharge a patient with a PICC, nor was it associated with loss to follow-up, both of which could produce selection biases. Rural residence (RUCCs 4-9) among the 95 patients excluded from our analysis who had a PICC placed but were not discharged was 33.7%, which is not significantly different from the frequency of rural residence in the cohort discharged with a PICC overall (31.6%; P 5 .363). In addition, no significant difference was found between the percentage of rural patients lost to follow-up (31.6% of the 26 patients lost to follow-up) and rural patients with follow-up who were included in the analyses (34.6%; P 5 .384)."}, {"section_title": "DISCUSSION", "text": "We believe our study is the first in which the safety of PAT with a PICC in children discharged to rural locales is assessed. We did not observe any variance in complication rates related to rural or urban residence, consistent with a recent study of PICCs in adults. 18 These findings persisted when rural status was assessed in a dichotomous fashion and a regression model across all RUCCs. The overall complication rate for our patients was 21.3%, which is consistent with previous reports. 1,[4][5][6][7][8][9] The mean time of onset for complications after PICC insertion in our cohort was 24.7 days, which is later in the course of therapy than previously reported. [5][6][7][8][9] Our urban and rural cohorts were similar in composition to each other, which makes demographic and clinical differences an unlikely explanation for our findings. In addition, the duration of PICC use (an independent risk factor for complications) 19,20 did not differ between the cohorts, nor was there a differential loss to follow-up or differential discharge rate among rural compared with urban patients. Our study' s biggest limitation was a lack of access to medical records outside our system. Complications seen at outside hospitals would not be documented in our EMR, which would serve to underestimate the frequency of complications in the rural  cohort. In addition, geographic and climatic differences between states may affect the generalizability of our results. In our study, we did not find any difference in complication rates among children living in rural or urban settings receiving outpatient PAT with PICCs. In future studies, researchers should identify methods to decrease complication rates and decrease the need for PICC use (eg, earlier transition to oral therapy)."}, {"section_title": "CONCLUSIONS", "text": "In our study, we demonstrate an equivalent safety profile for outpatient PAT with PICCs in selected children who reside in rural and urban areas. Our study may be applicable to other rural states where patients frequently reside far from higher levels of care."}]