[{"section_title": "How does psychology compare with other fields?", "text": "During the 1993-96 period, nineteen percent of the students who received doctorates in psychology reported debt in excess of $30,000 at the time of graduation-far more than those with degrees in the social sciences, the next highest S&E field, where 8 percent reported debt amounts in that range. In addition, a smaller percentage of psychology doctorate recipients reported being free of debt at graduation than those in the social sciences-27 percent vs. 37 percent (figure 1). Other S&E fields had even higher proportions of debt-free doctorate recipients. Fields with debt levels similar to psychology were found outside science and engineering, and include architecture and law."}, {"section_title": "How does type of degree or program relate to debt levels?", "text": "Psychology differs from other S&E fields in a number of ways. It has a strongly developed professional practice component, for which training is provided by freestanding schools of psychology and by professional programs in traditional university settings. Both focus on training in practice subfields (e.g., clinical, counseling, and school psychology) that are not closely tied to research subfields (e.g., personality, experimental, and developmental psychology). The past two decades have also seen the establishment and growth of a practice-oriented Doctor of Psychology (Psy.D.) degree. The Psy.D. and Ph.D. are granted by both traditional universities and professional schools. In short, doctorate education in 1 Alan Rapoport is a senior analyst in the National Science Foundation's (NSF) Division of Science Resources Studies (SRS); Jessica Kohout is Director of the Research Office at the American Psychological Association (APA); Marlene Wicherski is a research consultant at the American Psychological Association. 2 Student debt covers expenses incurred during undergraduate or graduate education for tuition, fees, living expenses, supplies, and transportation. psychology has a strong research component and professional practice features like those found in law, business, and medicine. About 30 percent of psychology doctorate recipients receive Psy.D. degrees, and about 15 percent of psychology Ph.D. recipients receive their degrees from professional schools (tables 1 and 2). Data for psychology doctorates from a national census of recipients of U.S. research Ph.D. degrees were examined, separating those with degrees conferred by professional schools from those conferred by traditional universities. 4 Recipients of 4 The annual Survey of Earned Doctorates collects data on the number and characteristics of all individuals who receive research doctoral degrees from U.S. institutions, including information on education-related indebtedness at the time of graduation. See NSF, 2000. Science and Engineering Doctorate Awards, NSF 00-304. Arlington, VA. Although later data (1998) are available, data are used only through 1996 in order to make comparisons with the results from Issue Brief 98-318."}, {"section_title": "NOTE:", "text": "Environmental Psychology Doctorate Recipients: How Much Financial Debt...page 2 6 Data are from the Survey of Earned Doctorates, sponsored by NSF and four other Federal agencies. Category groupings were suggested by APA."}, {"section_title": "Do debt levels vary among different psychology subfields?", "text": "To determine which psychology subfields might account for the field's greater likelihood of debt and higher debt levels than other S&E fields, all psychology research Ph.D.s were sorted into the following eight groups 6 : psychology, other psychology Doctorate recipients in these subfield groupings had different debt profiles. Clinical psychology Ph.D. recipients (accounting for 40 percent of all psychology Ph.D.s) were the least likely (21 percent) to report being debt-free at Ph.D. conferral and the most likely (30 percent) to report debt exceeding $30,000. At the other debt extreme were those who majored in edu-Ph.D.s from professional schools were much more likely to carry debt in excess of $30,000 than graduates of traditional universities (41 percent vs. 15 percent); they were also less likely than their university counterparts to be debt-free (19 percent vs. 28 percent) (table 1). Differences between holders of research doctorates and those with professional doctorates, and between types of schools, were further examined using data collected by the American Psychological Association (APA). 5 These data strengthen the previous findings. Graduates of professional schools were less likely than graduates of university psychology departments to be debt-free, and more likely to report higher levels of debt (table 2). Professional schools and Psy.D. programs focus on training for practice, with about 85 percent of the doctoral degrees in both awarded in clinical psychology. According to the American Psychological Association data, 64 percent of Ph.D.s in clinical psychology from professional schools and 59 percent of Psy.D. recipients in clinical psychology reported debt exceeding $30,000, sharply higher than the 26 percent of clinical psychology Ph.D.s graduating from departments in traditional university settings. Furthermore, Ph.D.s in clinical psychology from psychology departments were less likely to be debt-free and more likely to report higher levels of debt than those graduating from the same departments, but specializing in other areas of psychology. 5 The annual APA Doctorate Employment Survey questions new psychology doctorate recipients of all types about their entry into the labor force and the relevance of their graduate training to their employment. The response rate for the 1997 survey used here was 51.9 percent, with slight variations by type of doctorate and type of school. However, estimates from this survey are quite similar for comparable variables and aggregates to those derived from the Survey of Earned Doctorates for Ph.D.s.   98-318, op. cit. 8 Although graduates in counseling and school psychology were similar to those from clinical programs in reporting high debt, they were more similar to their colleagues in the research subfields in the percentage reporting no debt. cational psychology, 43 percent of whom reported being debt-free, and only 9 percent reported debt exceeding $30,000 (table 3). The subfield differences notwithstanding, average debt levels of new Ph.D.s in psychology were higher than in other S&E fields. In six of the eight subfields, the percentages of debt-free respondents were below those of any other broad S&E discipline, and the percentages with debt exceeding $30,000 were larger. 7 In one groupdevelopmental and child psychology and human, individual, and family development-the debt burden was similar to that in the social sciences. Only in educational psychology (2 percent of all psychology Ph.D.s) was the percentage reporting no debt larger than that in some other S&E disciplines; the percentage with debt greater than $30,000 was similar to that of the social sciences. APA data showed roughly similar patterns (table 4). Graduates from clinical programs in traditional university settings were more likely than their colleagues in psychology research fields to report debt and to report high debt. 8 Across all psychology subfields, however, a larger percentage of Ph.D. recipients reported debt exceeding $30,000 than did Ph.D. recipients in other S&E fields."}, {"section_title": "How do different support modes relate to debt patterns?", "text": "A recent NSF study on modes of support of S&E doctorate recipients provides more information as to why psychology Ph.D. recipients are more likely to report having debt than other S&E Ph.D. recipients. 9 Loans play a larger role as a form of financial support for Ph.D.s in psychology than for those in other S&E fields. Ten percent of 1995 psychology Ph.D.s reported loans as their primary mode of support, and 22 percent reported loans as their secondary mode. In other S&E fields, loans constituted the primary means of support for no more than 2 percent of the respondents, and the secondary means for no more than 9 percent. Moreover, although 51 percent of psychology Ph.D.s reported having loans, only 28 percent did so in the social sciences, the S&E field with the next highest proportion, followed by the health sciences, with 22 percent. APA data amplify type of school and degree differences. Although only about 13 percent of Ph.D.s from traditional psychology departments reported loans as their major source of financial support, 44 percent of professional school graduates did so. Ph.D.s from traditional psychology programs tended to use their own or family funds, research or teaching assistantships, or grant support. Compared to their professional school counterparts, who were more apt to rely on loans and report debt, their level of indebtedness was substantially lower. This Issue Brief has examined some of the variations in debt profiles that set psychology apart from other S&E fields. It has demonstrated that a focus on training in practice subfields, particularly  "}]