[{"section_title": "Introduction", "text": "Soil health or quality is critical to well-functioning ecosystems that can provide a number of services [1,2]. For more than two decades, scientists have called for the broader recognition of the multi-functionality of soils [3][4][5], a move not only beyond the narrow focus on productivity but also beyond erosion [6]. The importance of on-and off-site impacts of soil health and its relationship to sustainability was recognized in the US by the National Research Council, some 22 years ago [7]. The concept of soil quality (or health) is defined as \"the capacity of a soil to function, both within its ecosystem boundaries and with the environment external to that ecosystem\" [8]. Changes in soil these tools have been used to guide soil health management. Specially, we determine, for AU and the US: (1) the amount of farmer participation that exists in soil testing and farm planning; (2) the nature of soil testing and farmer motivation to capture information on soil health; (3) whether farmers use soil testing for decision-making, including the adoption of soil building practices; (4) limitations to widespread use of soil information and soil testing for soil health management; and (5) approaches to improving farmers' access to soil information, and its potential use for the adaptive management of agroecosystems."}, {"section_title": "Approach", "text": "We examined national records from both AU and the US, reviewed the available literature on farmer use of soil information, and supported our investigations with interviews of scientists and practitioners, as well as focus group results. We also made one critical assumption: available soil test information is thorough enough to serve as a proxy for (at least some) indicators of soil health. We understand that soil testing has historically focused on chemical indicators of soil health, such as soil pH and macronutrients, while largely ignoring important physical and biological indicators [19]. Now that organic carbon is more widely available and affordable in most laboratories, we believe our assumption is more reasonable. Readily available soil testing in both countries does allow detection of many soil health issues, such as soil acidity or alkalinity, loss of major nutrients, toxicity and changes in organic carbon [20][21][22][23][24]. We data-mined a number of databases in Australia: the Australian Bureau of Agricultural Resource Economics and Sciences (ABARES) [25]; the Australian Bureau of Statistics (ABS) [26] ( Figure A1); and documents produced by the Federal Government of Australia, including ABARES and ABS. We reviewed the data collected from: ABARES surveys, as part of the Farms Surveys series (1988-1989, 2001-2002, 2004, 2006 and 2009); ABS survey data from the Agricultural Resource Management Survey (ARMS); the Land and Management Practices Survey (LAMP); and the Rural Environment and Agricultural Commodities Survey (REAACS) (from 2007 to 2013). We examined soil testing, farm planning and conservation practice application. In the United States (US), the commodity chosen for assessing the use of soil information by farmers was corn due to its dominance as a crop in terms of land area and fertilizer use ( Figure A2). We used publications produced from the United States Department of Agriculture, the Economic Research Service (USDA, ERS), the Agricultural Resource Management Study (ARMS) Corn Crop Production Practices and Cost Report Phase 11 Survey and ARMS data online from 1996 to 2010 [27]. A number of USDA National Agricultural Statistical Service (NASS) ARMS data from 2000, 2005 and 2010 were accessed, which examined the areas specifically planted with corn that were subject to soil testing and fertilizer application. Tailored reports were provided by Jodie Mewett (ABARES) and Rachael Brown (USDA, ERS) for data not available online or where the sampling population could not be determined online. All Figures and Tables have been constructed by authors from the data sources as cited. We also contacted a number of the authors of these reports to delve further into their methodology and data sets, as well as garner their opinions on the current situation on soil information gathering and use by farmers. In addition, throughout this review, results of farmer focus groups with US farmers in California (CA) and Illinois and Iowa (IL-IA) (held at the border of the two states) are reported. Some of these CA focus group results, particular on farmer preferences for the presentation of soil quality information, along with a full methodology, were published by Andrews et al. [28]. The IA-IL focus groups were funded by USDA Sustainable Agriculture Research and Education (SARE) and culminated in the design and development of an educational website [29]. At each location, in the northern and southern Central Valley of California and in the Quad City area at the border of Iowa and Illinois, four focus groups of farmers and other agricultural professionals, with approximately 10 participants, were held in 2000-2001. Only the farmer focus groups' results are reported here (three groups in total). Focus groups were asked a series of pre-planned, open-ended questions. The questions varied somewhat between CA and IL-IA due to different overall objectives for the studies. However, many questions were similar enough to allow for combined analysis. Efforts were made to hear from all participants. Responses were recorded and transcribed. Themes were identified using NVivo ® v.1.2 software (QSR International, Melbourne, Australia) qualitative analysis software (Note: reference to trade names and companies is made for information purposes only and does not imply endorsement by the USDA or the University of New England). Response themes and supporting quotes are presented throughout the review and discussed in relation to other published survey information. Although this qualitative data was gathered approximately 15 years ago, this part of the information has not been published previously. Due to the lack of major changes in data use and policy during this time and because of the similarity to more recent farmer comments garnered in less rigorous ways, we assume that the information is still relevant today. Additionally, this study falls within the two-decade time frame for this review."}, {"section_title": "Farmer Participation in Soil Testing and Farm Planning", "text": "\n"}, {"section_title": "Soil Testing Trends", "text": "Using the REAACS data, we found a trend toward reduced soil testing, particularly among grazing enterprises, in AU from 2007 to 2013 ( Figure 1). The figure represents the percent of farm businesses performing soil tests for pH and nutrients ( Figure 1) by extracting them from an online data portal, called Monitor, and by requesting specific adjustments, made by Jodie Mewett, to include population size and 2012-2013 data [25]. groups in total). Focus groups were asked a series of pre-planned, open-ended questions. The questions varied somewhat between CA and IL-IA due to different overall objectives for the studies. However, many questions were similar enough to allow for combined analysis. Efforts were made to hear from all participants. Responses were recorded and transcribed. Themes were identified using NVivo ® v.1.2 software (QSR International, Melbourne, Australia) qualitative analysis software (Note: reference to trade names and companies is made for information purposes only and does not imply endorsement by the USDA or the University of New England). Response themes and supporting quotes are presented throughout the review and discussed in relation to other published survey information. Although this qualitative data was gathered approximately 15 years ago, this part of the information has not been published previously. Due to the lack of major changes in data use and policy during this time and because of the similarity to more recent farmer comments garnered in less rigorous ways, we assume that the information is still relevant today. Additionally, this study falls within the two-decade time frame for this review.\nUsing the REAACS data, we found a trend toward reduced soil testing, particularly among grazing enterprises, in AU from 2007 to 2013 ( Figure 1). The figure represents the percent of farm businesses performing soil tests for pH and nutrients ( Figure 1) by extracting them from an online data portal, called Monitor, and by requesting specific adjustments, made by Jodie Mewett, to include population size and 2012-2013 data [25].  In Australia, (a) the percentage of grazing and (b) broadacre businesses performing soil tests for soil pH and nutrients in previous financial year (Data source: [30][31][32][33]). Data collected by ABS (2007-2013) on soil testing indicates only whether the practice occurred in the previous year ( Figure 1). The question response options were either, \"Yes\", \"No\" or \"Not applicable\", except when the ABS data were publicly released, and then the responses to the soil testing question were reported as the proportion who indicated \"Yes\" they were soil or plant testing, and none of the other responses. Also, by the question specifying the period of soil testing as the previous year it could be underestimating the participation of farmers whose soil testing was conducted outside that period. To illustrate the issue, we found that one researcher asked farmers whether they did soil testing in the last five years. About 65% of respondents indicated they had, while 28.5% had not [34]. The responses led the researcher to write \"…suffice to say that soil testing  In Australia, (a) the percentage of grazing and (b) broadacre businesses performing soil tests for soil pH and nutrients in previous financial year (Data source: [30][31][32][33]). Data collected by ABS (2007-2013) on soil testing indicates only whether the practice occurred in the previous year ( Figure 1). The question response options were either, \"Yes\", \"No\" or \"Not applicable\", except when the ABS data were publicly released, and then the responses to the soil testing question were reported as the proportion who indicated \"Yes\" they were soil or plant testing, and none of the other responses. Also, by the question specifying the period of soil testing as the previous year it could be underestimating the participation of farmers whose soil testing was conducted outside that period. To illustrate the issue, we found that one researcher asked farmers whether they did soil testing in the last five years. About 65% of respondents indicated they had, while 28.5% had not [34]. The responses led the researcher to write \" . . . suffice to say that soil testing is not a common undertaking . . . \" [35]. Nevertheless, this response rate is more than double that reported by ABS. We strongly suggest that these survey questions be rephrased to capture soil testing occurring at longer-than-annual intervals. In surveys of grain growers, landholders were asked about soil testing frequency. Results showed approximately 30% of grain farmers annually test soils [36,37]. An additional 37% of grain farmers stated they routinely did soil testing every two or three years [36,37]. This means that the remaining 33% of grain farmers were either soil testing at an interval greater than three years or not at all. ABS surveys also do not provide information about the motivation, nature or intensity of soil testing. In earlier versions of this survey (pre-2007), landholders were asked to respond to the statement: \"Which of the following farm practices are part of your farm management program, and for the wheat-sheep and high rainfall zone farms only-soil or plant tissue test to determine fertilizer or soil conditioner requirements.\" However, this statement raises other issues in that it was not time-bound, and did not specifically ask when soil testing occurred, only if it was part of their farm management practice. Additionally, the motivation behind the soil testing is assumed in the wording of the statement. It is possible that any farmers performing soil tests for other reasons, such as soil monitoring, could answer in the negative. In post-2007 surveys the ABS question on soil testing was altered to \"Have you undertaken any soil testing on this holding between [financial years]?\" with a Yes/No response, followed by \"What did the soil testing include? (Please tick all that apply): pH, Nutrient levels, Organic Matter levels, Salinity (E.C.), Other.\" So in the post-2007 survey instrument there was some indication of the type of soil tests being performed, but again no idea of sampling intensity or the farmer's motivation to undertake testing. Finally, in the most recent ABS survey on Land Management and Farming 2013-2014, the question on soil testing is no longer asked [38]. From the 2001 US ARMS survey, Lambert et al. [39] determined that less than 30% of US corn farmers were soil/tissue testing, and even fewer (under 20%) were using available soil maps. In fact, the testing of soil nitrogen (N), phosphorus (P), and potassium (K) has declined since 1996, despite the relatively constant fertilizer application area and amounts of fertilizer applied ( Figure 2). The examination of three reports for 1996, 2001 and 2010 [40][41][42] on characteristics of corn production costs showed that N fertilizer was applied to almost 100% of the planted area. Amounts have remained steady at an average of 158 kg N/treated hectare with corn accounting for 46% of the US fertilizer consumption in 2010 [43]. In the 1996 ARMS survey of the US Corn Belt states, an area comprising over half of all corn producers and producing 70% of all US corn, only 14% of farms tested soil for N, with just over half of those farms using the recommended level [41]. ARMS surveys (conducted every five years), like the AU surveys, by confining responses to soil testing to the previous or current year in a particular field, could be underestimating participation in soil testing for those farmers not soil testing during that period. In Australia, despite a five-fold growth in the number of soil samples analyzed from the early 1990s, it is still a tool used at low intensities. The estimates in Figure 3 were based on the most likely farmer participation rates of 30% of the known cropping area for that year, calculated from ABS statistics, and equate to approximately five soil samples per 100 ha. In 1998, Plank [44] also showed that the volume of soil samples analyzed in the US for commercial purposes was 2 M in 1996, but given that the US has 2.22 M farms [45], the number of soil samples per farm is probably quite low. The IPNI report for 2000-2001 also indicated highly variable sampling density across the US with, on average, one sample per 67 ha, ranging from one sample per 9 ha in Georgia to one sample per 1214 ha in Wyoming [46]. Placing recent US figures on soil testing volume [47,48] through commercial laboratories, and assuming they are only applied to cropland, the number of soil samples per 100 ha is greater than in Australia. However, at 10 soil samples per 100 ha (with 30% farmer participation), it is still not at a high density [45]. The trends in soil testing show the number of farmers involved is not growing even though the volume of soil tests analyzed seems to indicate it has grown (Figures 1-3).   Another way of examining this data is to hypothesize why farmers appear to be doing only limited soil testing, both in terms of frequency and intensity of sampling. One soil scientist interviewed suggested that by avoiding soil testing, farmers were also avoiding the need to address the declining soil condition [53]. This assumes that some farmers either do not foresee the long-term benefits of building soil health or have economic pressures that do not allow them to think beyond the short term. Farmers in the US focus groups, seemingly in agreement with the latter reason for this avoidance behavior, identified economic pressures as a deterrent to performing soil building practices.   Another way of examining this data is to hypothesize why farmers appear to be doing only limited soil testing, both in terms of frequency and intensity of sampling. One soil scientist interviewed suggested that by avoiding soil testing, farmers were also avoiding the need to address the declining soil condition [53]. This assumes that some farmers either do not foresee the long-term benefits of building soil health or have economic pressures that do not allow them to think beyond the short term. Farmers in the US focus groups, seemingly in agreement with the latter reason for this avoidance behavior, identified economic pressures as a deterrent to performing soil building practices.  Another way of examining this data is to hypothesize why farmers appear to be doing only limited soil testing, both in terms of frequency and intensity of sampling. One soil scientist interviewed suggested that by avoiding soil testing, farmers were also avoiding the need to address the declining soil condition [53]. This assumes that some farmers either do not foresee the long-term benefits of building soil health or have economic pressures that do not allow them to think beyond the short term. Farmers in the US focus groups, seemingly in agreement with the latter reason for this avoidance behavior, identified economic pressures as a deterrent to performing soil building practices. \"I think the more and more farming becomes tougher economically, then everybody continues to look shorter and shorter term. . . . So, sometimes that limits what you think might be the optimum, long-run approach.\" (-CA farmer) Soil testing could become expensive and time-consuming for farmers, especially if undertaken at the frequency and intensity required for monitoring soil health."}, {"section_title": "Farm Planning and Conservation Plans", "text": "Tabulating the number of written farm plans in AU reveals that the percentage of landholders involved has remained static in recent years at 20% [54] but has declined from the levels recorded in the early 1990s (36% and 30%, respectively) [55,56] (Table A1). Hodges and Goesch [57], in their 2004-2005 ABARE survey of Australian farms, found that just over 20% of farmers have a farm plan. Those plans included details on production activities (80%), natural resource management (75%), business activities (63%), people management (30%) and references to regional NRM priorities (25%). This data showed that soil and plant testing was part of the farm management program for 59% of the surveyed farmers across all Australian farms in 2004-2005 [57]. Involvement in a natural resource management initiative (e.g., National Landcare Program, National Heritage Trust, National Action Plan for Salinity and Water Quality) seems to correlate with a higher adoption or use of sustainable land management practices, which includes the monitoring of pasture conditions (15% higher than NRM non-participants), soil and plant tissue tests (24% higher than non-participants) and monitoring of water tables (10% higher) [57]. For those landholders involved in Landcare activities in 2004-2005, an overwhelming majority (89%) stated they learned about the causes, signs and treatment of land degradation. Similarly, 82% said they learned skills to monitor degradation or implement conservation practices on ground works [54]. However, the data is unclear about what types of degradation and monitoring schemes they were informed by. The influence of Landcare on farmer participation in soil testing is not likely to be as significant given that recent Landcare membership is under 20% Australia-wide compared with a peak in membership in at 41%, (2001)(2002) [25]. The programs available to support farmers to write a farm plan are also diminished in their activity, as publicly funded schemes have become outsourced to private enterprise or fee-for-service providers such as education providers, including Profarm courses run by Tocal College in New South Wales, AU [58]. In contrast to the 2004-2005 ABARE report [57], their 2012 report on drivers of practice change tallied the percentage of landholders with a written property plan at 31% Australia-wide, an 11% increase in just seven years [59] (Table A1). The later report also found that property management plans were more focused on the financial side of the business (76%) or farm production activities (77%) than on the management of natural resources (51%), which seems to indicate a 24% decline when compared with the previous report [59]. However, the margins for error of these reports were not available. When farmers were asked how frequently they refer to their planning documents when making a decision, 35% of farmers responded that they \"always\" refer to their plans when it comes to farm financial decisions, while only 14% of farmer respondents \"always\" refer to their plans for natural resource decisions [59]. Therefore, if consultation of such plans is minor, then the guidance they provide over soil health management is also small. To receive financial assistance for conservation on US working lands, land managers must meet a set of eligibility requirements. To qualify for conservation programs promulgated by USDA NRCS, including Conservation Stewardship Program (CSP) and Environmental Quality Improvement Program (EQIP), farmers are expected to have a conservation plan, which can be completed with technical assistance, and to keep full documentation of planned conservation activity. While all US citizens owning or managing private lands are able to receive technical assistance, including assistance in developing a conservation plan, from USDA NRCS conservationists, free of charge, in practice most farmers who go through the conservation planning process are program applicants. An overview of technical and financial assistance for US hectares planted with corn in 2010, as surveyed in ARMS (published online 23 April 2015) is presented in Table A2. The participation in these activities is also separated into owned versus rented hectares (Table A2). In both cases, but more noticeably for rented land (10%), there is a lower level of participation (average overall 13%). For CSP, an even smaller contribution occurs, with 3.8% of hectares receiving payments (Table A2). Twenty-one percent of the area planted with corn has a written conservation plan, while less than 10% of these hectares have a nutrient management plan (NMP) ( Table A2) [60]. However, in the US, NMPs are mandatory for manure management (and regulated by each state) but can also be used for synthetic fertilizer as part of conservation management. If the reported number is for mandatory (manure) NMPs only, it could explain the low number. In 2010, although EQIP was obligated to spend $839 M to treat 5.2 M hectares of cropland nationally, it represents only a small proportion of the cropland area [60,61]. Ribaudo [60] assessed the distribution of EQIP contract obligations by resource concern (2008-2010). He found that: 13% of funding was spent on soil erosion prevention; 7% was spent on soil condition; and 36% of funding was spent on water quality and quantity, with the remainder spent on other resources, such as air quality and wildlife habitat. No similar data were readily available for CSP. In 2010, CSP was obligated to spend $320 M and enrolled 10 M hectares of land. This is almost double the 5.2 M hectare enrollment target set by the 2008 Farm Bill [60]. With only a small proportion of Australian and US farmers participating in soil testing and farm/conservation planning, it seems that the majority of farmers are soil-information poor, or at least they are not informed as to the condition of their soil by soil testing or by farm planning to highlight those soils at risk of land degradation. They could be relying on observational indicators for concerns such as soil erosion, but few studies have examined farmer use of these indicators [62][63][64]. Hence, a majority of land managers may be unaware of the deteriorating nature of their soil beyond the most basic of indicators. Without specific soil property information, farmers may similarly be unaware of what to do to impede the loss of soil condition."}, {"section_title": "Nature of Soil Testing and Farmer Motivation to Participate", "text": "The previous section revealed limitations of national-level reporting on farmers' soil testing practice which, in this section, has led to our reliance on regional studies or direct communication with those involved in soil testing, e.g., scientists, soil testing facilities and government employees. For instance, we contacted the International Plant Nutrition Institute in the US (IPNI) and the Australasian Soil and Plant Analysis Council (ASPAC) in AU for information on the volume of soil tests and the type of soil measures being undertaken. This section examines the nature of soil testing, motivation for its use (both perceived and actual), frequency and intensity of undertaking, as well as the types of soil properties most likely to be measured. Lastly, it focuses on the growing farmer interest in soil measures which examine soil health, and in particular, soil biological activity. There is much assumed about farmers' soil testing practices, especially their reasons for soil testing, which we discovered is not supported by national-level data which do not ask about farmers' motivation to undertake a soil test. However, as a 2012 report [43] on agricultural resource and environmental indicators demonstrates, the perceived reasons why farmers test soil continue to be promulgated as: \"US farmers have used BMPs (such as soil testing for nitrogen and timing nitrogen application) to reduce fertilizer costs, increase profitability, protect the environment and conserve natural resources.\" [43]. It also seems that scientists and industry organizations differ in their opinion on farmers' interest in soil testing and their reasons for doing so. When these two groups analyzed the same set of data on farmers' participation in soil testing, there were two contrasting views published. One paper stated, \"It is apparent that soil testing is a relatively common practice in Australia, both in terms of number of farms and cropping area.\" [36], while another publication said: \" . . . soil testing is used sparingly as a tool to underpin fertiliser decisions. Some grain producers typically conduct soil tests at least once every 3 years on a selection of individual fields, but it is broadly understood that many grain producers use soil testing rarely or not at all.\" [65]. Clearly, what one group (scientists) considers routine is quite different to another (industry bodies). The contrast in perception of soil understanding between scientists and farmers is well documented in Ingram et al. [66,67], and even though farmers may have the \"know-how\" they do not necessarily have the \"know-why\". They found advisors were critical of farmers' soil management, saying \"they did not know how to examine their soil to determine how much cultivation is required\". Not only are researchers confounded by how often soil testing and monitoring occurs, it appears that farmers are too. Part of the issue is that soil health monitoring at the farm level does not usually occur in a formal, documented manner, with the previous section showing the low level of farmer participation in farm planning (Tables A1 and A2). A qualitative study of grain farmers in northwest NSW, AU, showed [64] farmers felt they were \"continually monitoring their soil\", yet only 16% had retained soil test records at the paddock level or knew of its current status [64]. In response to the direct, open-ended question \"How do you monitor the soil?\" most farmers mentioned soil testing (67%) and visual appraisal (52%) [64]. Crop yield and protein level were mentioned by less than a quarter of farmers interviewed [64]. A small qualitative study (n = 15) of grazing farmers in Billabong catchment, NSW, showed that while they relied strongly on soil testing to support their management decisions such as the amount of lime to apply, they only focused on a few results such as phosphorus, aluminum and soil pH even though the soil tests would have provided more data on their soil [68]. These examples demonstrate awareness of soil function beyond productivity that still falls short of the ability to manage soil sustainably. Certainly, in retrospect, the target set in 1999 in the Commonwealth Discussion Paper on Sustainable Land Management [69] under \"indicators for capacity building for improved natural resource management\" seems overly ambitious, and given the nature of national-level reporting, impossible to determine: By 2005 there should be a 75 per cent increase in the number of landholders and regional communities actively monitoring resource condition-for example, by soil testing and water and biodiversity monitoring-to guide their management practices. This is especially true as national surveys in Australia are no longer asking farmers if they test soil and also in light of the often informal or observational nature of soil testing and monitoring [38]. Nevertheless, a push to mobilize farmer interest in soil health and understanding was reinvigorated in Australia by a funding program, which operated from 2005 to 2008, called Healthy Soils for Sustainable Farms. A study, conducted as part of that program in the Lachlan and Macquarie valleys of NSW, asked landholders to rate a number of factors according to importance for their land management decision-making. Organic matter and soil structure were rated as \"highly important\" by 89% of those surveyed (n = 132 in 2005 and n = 131 in 2008) [70,71]. Despite these ratings, approximately a quarter of all broadacre agricultural businesses indicated they were soil testing in 2010-2011, with 72% of those including tests for organic carbon or 18% of all broadacre agricultural businesses [72]. Unfortunately, ABS does not ask landholders whether they measure soil structure. A review for the National Soil Research, Development and Extension (RD & E) Strategy [51] confirmed the dearth of physical and biological soil testing. The review showed that the 531,000 AU soil samples analyzed in 2012 were 87% chemical properties (including soil pH, nutrients, electrical conductivity and soil organic carbon (SOC), although this also has a biological component). Physical and (non-SOC) biological soil testing constituted 12.5% and 0.5% of the samples, respectively. However, this does not rule out the possible use of observational indicators for physical and biological monitoring by farmers. In the US, the International Plant Nutrition Institute (IPNI) has collated the laboratory results of approximately 75% of North American testing laboratories, and has published these about every five years since 1990 [46,[73][74][75][76][77][78]. They have clearly stated that the value of such a report is \"in calling attention to broad nutrient needs, in motivating educational and action programs, and in reminding farmers and their advisors of the importance of a soil testing program to monitor soil nutrient status\" [46], but they were also careful to point out that it is not at the farm level but across a state. It also provides an insight into the volume of soil testing in North America, and the types of tests undertaken, which have clearly increased in volume, especially in the Corn Belt of the US, which comprises 68% of the 2009-2010 soil sample volume ( Figure 4). In their 2010 report, they indicated that 4.4 M soil samples were tested for P, K, and pH, while testing for Mg and S was done in about 2.6 M soil samples [75]. Their reports predominately focus on P, K and soil pH.  We visited a private US soil testing laboratory, Ward Laboratories [80] in Kearney, Nebraska, in May 2015. It is a typical soil testing facility. This laboratory processed over 350,000 soil samples in 2014, mainly for the basic level of soil testing which includes: pH, macro-and micro-nutrients and salts. Although anecdotal, communication with the laboratory personnel indicated that soil testing is a process usually undertaken on a cycle of three to five years per field, or maybe annually if there is irrigated land. Similar to our AU findings, this US laboratory emphasized soil chemical characterization and provided only a limited understanding of soil biology, soil structure or soil texture. At the time, they were undertaking a major expansion of their facilities, which in itself is evidence of an increasing demand for soil information by the farming and ranching public. This expansion includes the addition of some biological assays (in 2014 about 1% of all annual samples) to mirror the interest many innovative farmers have in these tests. Similarly, innovative US farmers, who use various combinations of organic, no-till, rotation and cover crop conservation practices, were frustrated with the limited amount of information available to them via conventional soil testing. During the US farmer focus groups, these frustrations became apparent. The interest in soil biology is evident in many US conservation-related agencies. For example, soil biological health as a way of measuring soil performance has been recognized by the USDA NRCS in several ways. Training in soil quality or health has been available to employees since 1998. The CSP has included a soil quality component as part of eligibility since its inception. CSP rewards those who are already conserving resources and are willing to do more. The additional conservation We visited a private US soil testing laboratory, Ward Laboratories [80] in Kearney, Nebraska, in May 2015. It is a typical soil testing facility. This laboratory processed over 350,000 soil samples in 2014, mainly for the basic level of soil testing which includes: pH, macro-and micro-nutrients and salts. Although anecdotal, communication with the laboratory personnel indicated that soil testing is a process usually undertaken on a cycle of three to five years per field, or maybe annually if there is irrigated land. Similar to our AU findings, this US laboratory emphasized soil chemical characterization and provided only a limited understanding of soil biology, soil structure or soil texture. At the time, they were undertaking a major expansion of their facilities, which in itself is evidence of an increasing demand for soil information by the farming and ranching public. This expansion includes the addition of some biological assays (in 2014 about 1% of all annual samples) to mirror the interest many innovative farmers have in these tests. Similarly, innovative US farmers, who use various combinations of organic, no-till, rotation and cover crop conservation practices, were frustrated with the limited amount of information available to them via conventional soil testing. During the US farmer focus groups, these frustrations became apparent. \"It is astonishing to me after all the years I've been doing this that they're still only giving me a one page soil test. . . . You need a more sophisticated tool than that.\" (-CA farmer) \"I might as well be speaking to [crop advisors] in Russian, about worrying about carbon levels or this or that, or C to N ratios, I mean they don't care.\" (-CA farmer) \"You get your samples and you take some of the recommendations, you put what they say and it doesn't really help you.\" (-CA farmer) The interest in soil biology is evident in many US conservation-related agencies. For example, soil biological health as a way of measuring soil performance has been recognized by the USDA NRCS in several ways. Training in soil quality or health has been available to employees since 1998. The CSP has included a soil quality component as part of eligibility since its inception. CSP rewards those who are already conserving resources and are willing to do more. The additional conservation activities are called \"enhancements\" [81]. Cornell's Soil Health Assessment [82] a service by which producers in the northeastern US can have chemical, physical and biological soil properties tested, is an available enhancement for CSP applicants in New York State. In 2015, another soil quality assessment, this one focusing on soil respiration and still under investigation by researchers, is currently available nationally as an enhancement (SQL15) [83]. Although farmers contractually agreeing to perform this assessment must collect samples and send them to participating laboratories, they are not required to act upon the information garnered by the tool. Many soil building practices are possible enhancements as well, including cover cropping, intercropping and controlled traffic. The number of nationally available soil quality enhancements has grown from seven in 2010 to 19 in 2015, mirroring the increased emphasis on the topic within the USDA NRCS agency. During the focus groups with California farmers, participants communicated the need for monitoring information. \"I don't really know if I'm going in the right direction or the wrong direction on everything I'm doing. . . . it takes a long time to impact your soil.\" (-CA farmer) When asked about their preferences for soil quality information, these innovative farmers wanted both an overall assessment of soil health over time and individual indicator information [28]. They indicated that this approach offered them adaptive management options as well as the ability to address specific resource concerns. Another US farmer recently shared with us how he used the soil information and insights he gathered to inform his practices. Much of his soil testing was to determine soil health. He was particularly interested in how active the soil biota were in mineralising N, and he used this information to consider his fertiliser practices. His particular interest in collecting and examining soil information shows that there is probably a small niche of farmers motivated to undertake such data collection and interpretation [84]. A regional survey of Australian grain growers in 1994-1995 shed some light on farmer motivations for soil testing. The proportion of respondents using soil testing to detect the change in soil condition was 11%. This was half of the 22% of responding grain growers that indicated an awareness of declining soil fertility in the previous five years [85]. The GRDC Farm Practices Baseline Report 2010 [36] also had questions in their survey that examined the motivation behind soil testing. They found that it was largely to determine fertilizer requirements, not for soil monitoring, but the question was closed so no other options could be offered and confounded by including \"other predictive tools\" (Q158 \"And of your arable land, what percentage of it, has its fertiliser use based on soil tests or other predictive tools?\") [36]. Nevertheless, it seems unlikely that the majority of farmers' current use of soil testing conforms to the strictest notion of soil monitoring, i.e., the nature and level of soil sampling is not conducted in a way that would enable determination of soil change [86]. Admittedly, we cannot examine the commitment to soil testing as we were unable to undertake cohort analysis of the national data so we cannot be sure if the farmers who indicate they are soil testing, in the various surveys, are undertaking re-measurement on the same areas."}, {"section_title": "Evidence of Farmers Using Soil Information at the Farm Level", "text": "The rationale often advanced for soil testing is to provide useful input into farmers' decision-making about land management or problem identification. We would also add there needs to be a clear decision-making process, in which, if certain soil properties exceed or are below thresholds, specific actions are required to bring the soil condition back to acceptable levels. Even so, this type of information, while valuable, may not be enough for farmers to know what management changes are required to restore soil health. For instance, to indicate the positive outcomes of soil health management information, comparing soil measures, such as soil carbon or soil compaction, in the same or similar soils under various management systems and/or for records to be kept over extended time periods, i.e., monitoring, is necessary."}, {"section_title": "Can Soil Testing Be Linked to Decision-Making?", "text": "In an attempt to link soil testing to decisions about altering specific land management practices (e.g., applying fertilizer), we compared fertilizer application rates and methods used to determine the amount required, using ABS REAACS survey data from 2007 to 2013 ( Figure 5). Results show that 38% of those farmers who apply fertilizer are doing so on the basis of soil testing (farmers could select more than one method). Of course, that means 62% of farmers who apply fertilizer do not use soil testing guidance. Further, soil testing by farmers as a decision-making tool is trending downwards over time ( Figure 5). In an attempt to link soil testing to decisions about altering specific land management practices (e.g., applying fertilizer), we compared fertilizer application rates and methods used to determine the amount required, using ABS REAACS survey data from 2007 to 2013 ( Figure 5). Results show that 38% of those farmers who apply fertilizer are doing so on the basis of soil testing (farmers could select more than one method). Of course, that means 62% of farmers who apply fertilizer do not use soil testing guidance. Further, soil testing by farmers as a decision-making tool is trending downwards over time ( Figure 5). The ARMS Corn Production Practices and Costs Report, for 2005 and 2010, contain data on US fertilizer application rates and decision-making ( Figure 6). At the field level, despite the wide use of fertilizer and relatively affordable soil testing prices, decisions regarding amounts of fertilizer were not guided by soil testing (Figure 6). In fact, despite almost 100% of corn farmers using N fertilizer, almost 70% of farmers were most likely to apply N based on \"routine practice\" (Figure 6).  The ARMS Corn Production Practices and Costs Report, for 2005 and 2010, contain data on US fertilizer application rates and decision-making ( Figure 6). At the field level, despite the wide use of fertilizer and relatively affordable soil testing prices, decisions regarding amounts of fertilizer were not guided by soil testing (Figure 6). In fact, despite almost 100% of corn farmers using N fertilizer, almost 70% of farmers were most likely to apply N based on \"routine practice\" (Figure 6). "}, {"section_title": "Links Between Soil Information and Adoption of Soil-Building Practices for Soil Health Management", "text": "The role of soil information, through soil testing or farm planning, is to provide the necessary impetus to change, if soil health is compromised, by adopting a practice that will counteract the negative developments, e.g., loss of organic C, nutrient depletion and increasing acidity. There are a number of widely accepted land management practices which have established links to soil health improvements. For example, no-till and stubble retention protect the soil from loss of soil condition by wind and water erosion, conserve soil moisture, and prevent loss of soil carbon [17]. In AU, it appears a number of these practices have been adopted by broadacre cropping farmers. For example, approximately 78% of crop and/or pasture land was under minimum or zero-tillage in 2010-2011, which is an increase of 55% from the 1995-1996 levels of 20% [88]. Interestingly, much of this adoption occurred without direct and localized evidence of soil degradation at the farm-scale. So even if soil health is a motivational factor for certain practice change, it does not seem necessary for farmers to collect soil test information in order to determine if the practice is required nor, once implemented, to determine if the soil health benefits are realized. Again, there is no information available about whether farmers are using alternative means of gathering information, such as observational data. However, if this is the case, it is unlikely that it is documented in any formal way by the farmers themselves either. The benefits of improving soil health may prove to be persuasive for practice change, but a range of financial, environmental, social and personal motivators also play a role in achieving it [89]. Cropping practices can be at least partially motivated by environmental factors. Ecker et al. [57] states that \"improvement in soil quality\" was an important part of farmers' environmental motivation, along with \"reduce The amount of nitrogen applied to this field was based on: routine practice. Figure 6. Decision-support tools used by US corn growers to determine nitrogen application rates, as reported in ARMS surveys in 2005 and 2010 (Data Source: [87]).\nThe role of soil information, through soil testing or farm planning, is to provide the necessary impetus to change, if soil health is compromised, by adopting a practice that will counteract the negative developments, e.g., loss of organic C, nutrient depletion and increasing acidity. There are a number of widely accepted land management practices which have established links to soil health improvements. For example, no-till and stubble retention protect the soil from loss of soil condition by wind and water erosion, conserve soil moisture, and prevent loss of soil carbon [17]. In AU, it appears a number of these practices have been adopted by broadacre cropping farmers. For example, approximately 78% of crop and/or pasture land was under minimum or zero-tillage in 2010-2011, which is an increase of 55% from the 1995-1996 levels of 20% [88]. Interestingly, much of this adoption occurred without direct and localized evidence of soil degradation at the farm-scale. So even if soil health is a motivational factor for certain practice change, it does not seem necessary for farmers to collect soil test information in order to determine if the practice is required nor, once implemented, to determine if the soil health benefits are realized. Again, there is no information available about whether farmers are using alternative means of gathering information, such as observational data. However, if this is the case, it is unlikely that it is documented in any formal way by the farmers themselves either. The benefits of improving soil health may prove to be persuasive for practice change, but a range of financial, environmental, social and personal motivators also play a role in achieving it [89]. Cropping practices can be at least partially motivated by environmental factors. Ecker et al. [57] states that \"improvement in soil quality\" was an important part of farmers' environmental motivation, along with \"reduce[d] soil loss\" and \"reduce[d] water run-off runoff.\" These environmental concerns, however, ranked second behind financial motivators. Nevertheless, the survey instrument used pre-determined, pre-categorized responses to close-ended (yes or no) questions. This approach can be misleading: it may not necessarily reflect the farmer's full intentions. In a smaller qualitative study by CAAANZ, reported in Kancans et al. [85], the researchers were able to more deeply assess some environmental motivations around soil condition, with farmers' statements, such as: \"Soil to me is the key to the whole system. I wanted to change the system to improve the soil\""}, {"section_title": "n=2151 2005 n=2290", "text": ""}, {"section_title": "(-AU farmer)", "text": "A number of the study participants commented on improvements in soil health, which were largely observational, including the re-appearance of earthworms, which were not necessarily informed by soil test results [90]. A longitudinal study of farmers' adoption of no-till with stubble retention found the following adoption rate influences, in priority order: lower fuel and labor costs (at seeding); soil conservation, i.e., less soil erosion; and soil moisture conservation [91,92]. In California, US, farmers' adoption of no-till or reduced till seemed to have similar motivations: the adoption rate increased in proportion with rising fuel costs, while stricter air quality regulations had a much smaller effect [93]. Interestingly, despite soil conservation being a primary driver of no-till adoption, there is not a lot of quantitative evidence, as collected by farmers, to demonstrate that soil erosion and other soil health concerns have lessened under no-till, despite the scientific research that indicates it does [1]. Nevertheless, farmers do speak of reduced fuel and labour costs as a primary result of fewer field passes [91]. The reason most farmers gave for non-adoption of no-till in one study was \"lack of observed benefits\" [91]. Kelly et al. [68] noted that farmers in their study believed healthy soil to be more a \"means to an end\" than an \"end in itself\"; rather, their goal is a soil capable of producing sustained yields. This sentiment was echoed in the forward of a prototype for a Soil Health Management Plan which stated: \"Soil health is not an end in itself. Soil, water, sunlight and air are the primary natural resources for agricultural production\" [94]. It was proposed to incorporate the Soil Health Management Plan into farm planning in Victoria, AU, which, as we explained earlier, was at the most 30% of farm businesses that have a farm plan in Australia (Table A1). This concept of sustainability was also echoed by the US focus group farmers, who made statements such as: \"A lot of times it will be less expenses. And [healthy soils] will be more manageable, soil structure is better... Your plants are healthier. You need less inputs. Your plants just grow better.\" (-CA farmer) \" . . . whatever you've done to that field or whatever condition it's in, it requires probably the least input and gives you the best results.\" (-CA farmer) In the US, we examined cover crop usage and the role of soil health and soil information usage in leveraging its adoption. There are numerous scientifically documented benefits of cover crops on soil health such as sequestering atmospheric carbon in plant tissue, providing habitat for soil biota, and stabilizing or enhancing soil aggregate strength [95]. However, while 82% to 94% of crops are grown in some sort of rotation, conservation crop rotations that incorporate cover crops remain uncommon [96]. Only about 3% to 7% of US farms use cover crops in rotations. Additionally, since these operations do not put all of their land into cover crops, only 1% of cropland acreage uses cover crops [96]. The USDA Conservation Effects Assessment Project (CEAP) estimates that from 2003-2006, cover crops were used on less than 1% of the Upper Mississippi Basin region, which drains approximately 49 M hectares, including large parts of the states of Illinois, Iowa, Minnesota, Missouri, and Wisconsin [97]. Singer [98] surveyed 875 farmers in Illinois, Indiana, Iowa, and Minnesota (in the US Corn Belt) on their cover crop use in the autumn of 2005, finding that 8% of the farmers planted cover crops that year, while 11% had used cover crops within the previous five years. Given these low rates of adoption of cover crops, Wallander [96] suggests that \"further research could help identify the types of incentives that may be needed to promote wider adoption of cover crop rotations.\" Likewise, a small group of 36 farmers, scientists, extension specialists, and policy experts convened by the National Wildlife Federation in June 2012 devised a \"Roadmap\" for addressing the barriers to cover crop adoption [61]. Their report identified research priorities to increase farmer adoption. The study of the \"environmental impact of cover crops was 5th on the priority list, after benefit-cost analysis, establishment options, impact on commodity crop yield and species selection and combination, in order of priority.\" This may suggest the benefits are relatively well recognized compared with how to implement the practice. Nevertheless, none of the publications reviewing research needs suggested that being better informed about soil condition, e.g., by soil testing, could encourage more people to adopt the practice by enabling documentation of soil health benefits. To examine landholders' interest in cover crops and their motivation for planting them, the Conservation Technology Information Center (CTIC), along with funding from the USDA NIFA Sustainable Agriculture Research and Education program (SARE), published two cover crop surveys, in 2012-2013 [99] and 2014-2015 [100]. The 2012-2013 survey was administered to no-till field day participants throughout the Corn Belt and Great Plains regions. The 2014-2015 survey was administered online and was accessible to all US farmers. However, the researchers caution that both their participant groups are likely to be skewed toward farmers already interested in cover crops, due to the field day topics and locations of advertisements in no-till and cover cropping magazines. Out of 1200 respondents in 2014-2015, 84% had grown cover crops [100], which is in stark contrast to earlier state-wide surveys which show cover crop adoption at less than 12%. This bears out the caution from the researchers but also points to the types of growers most likely to adopt the practice, which could assist educators with whom and how to approach the topic. From 2010 to 2013, there was a 30% increase per annum in reported cover crop area sown for those surveyed cover crop users [99]. Both types of respondents, those growing cover crops and those who did not, ranked time and labor as their biggest concern with cover crops [99,100]. However, when cover crops growers were asked to list their top three benefits, the leading benefit was \"increases in overall soil health\" (22%), followed by \"increases in organic matter\" (21%), and \"reduces soil erosion\" (15%) [100], all three responses pertain to soil health. Despite soil health being cited as the key reason for adoption, it is unlikely many of these growers have documented evidence showing changes in soil health given the low participation in traditional soil testing (at about 30% of farmers [39]). Interestingly, farmer participants in these surveys said agricultural retailers could help them assess soil change as well as help them use that information in their nutrient management plans. This is similar to the CA focus group theme that, while interested in soil health, they would rather pay consultants to do the soil testing for them. This makes sense given that there are fewer people managing greater land areas, as indicated by the decline in numbers of farms, especially in Australia which has declined by 40% (1981-2011) [101], and the US which has declined by 15% (1982-2012) [45]. Thirty percent of the cover crop survey respondents who were actively using cover crops reported receiving some level of cost-share assistance to do so [100]. Of those surveyed, only 9% said they would only plant cover crops with financial assistance [100]. The authors concluded that incentive payments were important to a minority of farmers, but most growers would continue the practice without any financial assistance [100]. Perhaps more importantly, economics ranked well below the numerous soil health impacts, such as improved soil health, SOM and reduced erosion, in farmers' lists of benefits for both users and non-users of cover crops [100]."}, {"section_title": "Use of Soil Testing Data in Application of Lime", "text": "Soil pH plays an important role in regulating nutrient availability and influences the environment for soil biological activity. Therefore, liming acidic soils is a practice of considerable value to soil health. The AU National Land and Water Resources Audit (NLWRA) estimated soil affected by soil acidity was 50 M hectares of surface soil, with 11 M hectares of highly acidic soils requiring 2 t/ha/yr to increase or maintain a pH Ca of 4.8 in 2001 [102]. Current liming rates are well under the levels required to arrest the problem [103]. Therefore, we examined the use of lime as it relates to soil testing in Australia. In the REAACS ABS survey from 2007-2013, questions were asked about testing for soil pH, and the management of soil acidity. Only 9% of the affected area (1.8 M ha of agricultural land) was treated with lime across Australia [33]. Over half of the lime applied in AU during 2012-2013 was in Western Australia. Even though annual applications of lime have risen sharply over the last 10 years to just over 1.6 M t lime/year in 2014 sold (and presumed applied), the application of another 2.5 M t lime/year is presumed to be required to abate soil acidity in Western Australia. Notably, Gazey et al. [103] showed that when Western Australian farmers increased the frequency and intensity of soil testing, it led to increased applications of lime. A relatively high proportion of those agricultural businesses reporting soil and land issues were aware of soil acidity and soil compaction, but few farmers tested soil physical properties (Figure 7). For those businesses reporting soil activities, a similar proportion were also liming or soil testing (Figure 7a,c). The 2006-2007 ABS survey of land management practices [104] showed lime applications (Figure 7c,d) performed by 30% of all agricultural businesses. Over these two sampling periods there appears to be an increase in lime application, although the testing of soil acidity has remained constant (Figure 7a,c). However, it is impossible assign attribution to increased problem awareness through soil testing and increased remediation activities from these data as no cohort analysis exists. When the actual proportion of those reporting testing soil pH and liming was calculated as a proportion of all agricultural businesses, results suggested awareness and actions overall were limited to about one quarter of landholders (Figure 7b,d) [104,105]. However, in more recent surveys (2012-2013), the application of lime and soil testing has seemingly declined, with only 9% of all agricultural businesses applying lime, while 16.7% of all agricultural businesses had tested soil pH in the same period [33]; however, this could be more related to the post-2007 surveys having a defined period to report on. Even though annual applications of lime have risen sharply over the last 10 years to just over 1.6 M t lime/year in 2014 sold (and presumed applied), the application of another 2.5 M t lime/year is presumed to be required to abate soil acidity in Western Australia. Notably, Gazey et al. [103] showed that when Western Australian farmers increased the frequency and intensity of soil testing, it led to increased applications of lime. A relatively high proportion of those agricultural businesses reporting soil and land issues were aware of soil acidity and soil compaction, but few farmers tested soil physical properties (Figure 7). For those businesses reporting soil activities, a similar proportion were also liming or soil testing (Figure 7a,c). The 2006-2007 ABS survey of land management practices [104] showed lime applications (Figure 7c,d) performed by 30% of all agricultural businesses. Over these two sampling periods there appears to be an increase in lime application, although the testing of soil acidity has remained constant (Figure 7a,c). However, it is impossible assign attribution to increased problem awareness through soil testing and increased remediation activities from these data as no cohort analysis exists. When the actual proportion of those reporting testing soil pH and liming was calculated as a proportion of all agricultural businesses, results suggested awareness and actions overall were limited to about one quarter of landholders ( Figure  7b,d) [104,105]. However, in more recent surveys (2012-2013), the application of lime and soil testing has seemingly declined, with only 9% of all agricultural businesses applying lime, while 16.7% of all agricultural businesses had tested soil pH in the same period [33]; however, this could be more related to the post-2007 surveys having a defined period to report on.  "}, {"section_title": "Limitations to Widespread Use of Soil Information for Soil Health Management", "text": "In Australia, one study found two impediments to a structured soil health management plan: high cost and insufficient one-on-one expert advice or assistance to support a change [71]. Work \nIn Australia, one study found two impediments to a structured soil health management plan: high cost and insufficient one-on-one expert advice or assistance to support a change [71]. Work conducted by Bramley and Cook [106] suggested that trying to use soil testing results for two different purposes, crop production and soil resource assessment (e.g., soil health), was problematic due to differences in soil sampling intensity needs. Additionally, they state that bias towards those farmers who are more proactively managing their soil is not representative of soil condition. Their conclusion stated that \"if we get soil testing [suited] for the purposes of crop and fertiliser management it will . . . become a more useful tool for soil resource assessment. This assumes . . . also that soil testing becomes a more common practice for a wider cross section of producers.\" US focus group participants mentioned a number of barriers to the adoption of soil building practices. One theme was the issue of economic costs: \"I think the more and more farming becomes tougher economically, then everybody continues to look shorter and shorter term. . . . So, sometimes that limits what you think might be the optimum, long-run approach.\""}, {"section_title": "(-CA farmer)", "text": "This echoes the concerns farmers had with cover crop expenses in the CTIC survey [100]. Another very prominent theme in the US focus groups was the uncertainty of land tenure: Although it is well known that land tenure affects management decisions [107], this does not seem to be considered a soil health issue. In the US, farm land is approximately 60% owned and 40% rented. However, this percentage changes regionally. Some of the highest rental rates are found in the most intensively cropped regions, such as the Corn Belt and Central Valley, CA (which were the strategic locations of our focus groups), where rental rates are often greater than 50% [107]. This leaves farmers with low incentives to invest in the health of soils they may not be working next season. It seems that those who do engage in soil testing and farm planning would do so regardless of the incentives. However, others will require incentives to see the environmental and economic imperative of gathering information to aid in sustainable management. Alternatively, farmers may need assistance from crop advisors or agricultural retailers to do testing or monitoring and provide management advice from that information. A recent convert to data collection, including soil testing, is a farmer in Iowa: \"I was excited to join the Soil Health Partnership (in 2014) because of the emphasis on data collection,\" Smith said. \"Documenting the benefits will help promote the practices.\" [108]."}, {"section_title": "Specific Impediments to Soil Testing", "text": "Cary et al. [102] examined a number of sustainable practices based on Rogers' attributes [109] of a land management practice that facilitate adoption, including: relative advantage, compatibility, complexity, \"trialability\" and observability. Regular (Note: regular in most cases is not defined and neither is the time period it applies to, and hence it could be interpreted differently by landholders) soil testing scored well for risk and complexity, but rated poorly under relative advantage, \"trialability\" and observability. Soil and plant testing for fertilizer requirements scored poorly under complexity, and was similar under the remaining categories when compared with regular soil testing. A US study also stated that despite the advances in soil laboratory procedures and analysis, fertilizer response calibrations, and computer use for data processing and reporting, soil testing still suffered from poor credibility due to the wide variety in recommendations [110]. Although we made the assumption that soil testing was a reasonable proxy indicator of soil health management, during the course of this investigation, barriers to widespread use of soil testing for this purpose became apparent. The application of soil testing data as a sensitive and reliable tool for detecting soil change is met by a number of obstacles, which are: (1) Soil sampling intensity:"}, {"section_title": "‚", "text": "Site-specific issues are missed with bulked or zonal sampling [106]. ‚ Soil spatial variability is too great and sampling intensity too low to give accurate information for many properties [46,111,112].\nStandard soil sampling depth (0-20 cm) by farmers can be too deep to identify changes in soil surface properties, or equally too shallow to detect sub-soil changes. (2) Soil sampling frequency: ‚ Soil testing may be too infrequent [112] for adaptive management uses.\nThe trajectory of change may be difficult to plot with only a few sampling points over time ‚ Records of soil tests are not retained to allow comparisons to be made over time [64]. ‚ Soil testing may be conducted every three to five years but not necessarily in the same paddock.\nThe slow rate of soil change in certain soil properties, coupled with the lack of outward visibility of some types of soil health loss, such as declining soil pH, can be misleading [11].\nMonitoring soil health is difficult without a baseline taken before management changes were implemented. (3) Lack of holistic focus: ‚ Conventional soil testing does not monitor the changing nature of soil structure or soil architecture in terms of water availability and habitat for soil biota, a major source of soil health improvement [113]. ‚ Soil testing is very much focused on soil chemical properties and, indeed, a landholders' focus is often only on a few key measures such as macronutrients (P, and N), and soil pH [74,75,78].\nThe metric of soil health performance is often related to the productivity function of soil by relating it to yield, rather than improving other functions such as soil biological activity and the flow-on consequences of that particular decision [113,114]. A few ideas worth exploring are the blending of observational indicators with conventional soil testing data, standardizing of observational indicators, and developing closer working relationships between farmers and soil professionals. In the 1990s, there were a series of developments in the US [62,115,116], many sponsored by USDA-NRCS,that sought to assist the farmer or crop advisor in gathering their own soil information. Guidelines for developing a soil health scorecard for local areas were among the products developed by the NRCS-Soil Quality Institute [117]. These products and a number of state Soil Health Cards are still available online [116]. Another tool developed in the 1990s by ARS and NRCS was the Soil Quality Test Kit [115,118], which was intended for use by farmers and conservationists. Such tools were advised to be used in conjunction with \"routine soil test information that currently focuses almost exclusively on soil chemical or fertility parameters.\" [119]. In light of the current review, revisiting these tools, with the aim of training consultants and educators, may be warranted."}, {"section_title": "Missed Opportunities for National Surveys", "text": "Issues that we encountered during this review offered insights into the gaps in national-level reporting of soil testing in terms of understanding farmers' participation (both frequency and intensity), and the nature of soil testing and motivation behind it. The data gaps had implications for the type of conclusions that could be drawn from this data. One recurring issue concerned difficulties in attribution, either between or within surveys, especially examining links between soil testing and farmers' use of soil testing data in terms of their soil health management behaviors over time. In AU and the US, there was only one question which asked about soil testing in relation to fertilizer application. However, even with this question we do not know if the sample population from each survey period was the same or different. While specific concerns were discussed above, overall they can be summarized as: closed questions with built-in rationales for soil testing, unknown or unreported population size, no cohort analysis over time, rarely any examination of the relationship between soil testing practice and other soil building practices, changes over time in sampling areas, intensity and survey questions, unrestricted versus time-bound questions which made questions incomparable over time, surveys being conducted every five years and only asking about the previous or current year, inconsistent reporting due to a shift in reporting language from the original question intent, and limited reporting of findings on soil testing, even when data had been collected. Also, for the purposes of comparisons, reporting units were different between AU and US. ABS uses the actual number of businesses, extrapolated from a sample population (about one-fourth of all agricultural businesses), while in the US, data is reported as a percentage of farmed area, and is extrapolated from a smaller sample size of farmers' fields. More could be gleaned from these surveys if motivations for soil testing, and frequency or intensity of soil testing were addressed. We further suggest that questions about motivations for practice change be included to help educators with designing assistance. A few relatively small changes could potentially provide much-needed information about farmer information use."}, {"section_title": "Improving Farmers Connection to Soil Information", "text": ""}, {"section_title": "Information Availability for Farmers", "text": "For soils in particular, access to information of local relevance is complicated by a disconnection between data sets and user location. The sampling effort in AU is greater in coastal zones, resulting in patchiness in data coverage and quality; it is also limited to the decade around 1990-2000, when most of the sampling effort was made [51]. The US has much better coverage of soil data, with most farmland covered by 1:12,000-or 1:24,000-scale soil maps, but this data has been accumulated over many decades of soil surveys, with no reported information on management at the time of sampling. Further, these data are on inherent, taxonomic soil properties, not the impacts of management on soil health. In 2014, the Australian Soil RD & E Strategy [51] called for a national database of soil information to support farmers' management decision-making. The proposed model for soil information delivery would have national-level coordination, with delivery to various audiences, including farmers, from a central online repository. One option under consideration is to include soil testing data collected by private enterprise as part of the database, if data is available for the queried soil type and land management practice. In Australia, the current soil data held in public institutions is described as \"patchy, incomplete and out-of-date\" by one researcher [120]. This national database approach is similar to the USDA NRCS Web Soil Survey [121] for the delivery of US soil taxonomic, inherent property, and capability information. Also underway, as part of a joint USDA NRCS and USDA Agricultural Research Service project, is the development of a dynamic soil properties database to be developed by mining the primary literature for the effects of agronomic management on soil quality indicators. The website portal will allow users to access soil change information, using extrapolation techniques of the data to query locations that consider soil type and climate factors. The database will also be used to inform modeling efforts and perform meta-analyses of management effects. Ultimately, it seems that both countries are moving in the same direction to provide landholders with soil change information. However, neither country has achieved this goal at this time."}, {"section_title": "Connecting Farmers to Soil Information Sources", "text": "Increasing farmers' access to and use of soil information means engaging farmers more directly with existing soil information sources. Familiar traditional extension activities are still major information sources for agricultural land managers with field days and training courses as the key sources of information on sustainable land management practices [59], e.g., CTIC no-till field days in the central US. Of course, online mediums also offer opportunities for people to access expertise when they need it and when they are ready. Sixty-seven percent of US farms had Internet access in 2013, with 70% of farms having access to a computer. Farms using computers for their farm business increased to 40% in 2013 compared to 37% in 2011 [122]. E-extension [123,124] is being trialled in various topic areas such as crop nutrition and plant protection in AU, and US and in organic agriculture in the US, with some success in providing timely, useful information to the intended audience as well as sharing materials among educators and dealing with the loss of expert knowledge on the ground [125]. The US target audience is the community of practice, including farmers and educators. Despite the increasing volume of information available online, the ability to engage with it is limited, due to its often static nature and frequently non-engaging presentation. Improved information flow (both in relevance and accuracy) to landholders is difficult when soil information is archived or in some cases \"lost\" (not updated, due to program completion or funding cuts, e.g., Water Australia (1990-2009) [126] and National Water Resources Audit (1997-2008) [127]. In Australia, information available online is increasingly stripped back or de-contextualized so it is only presented at regional or state scale, rather than at a useful scale for a land manager (e.g., Australian Bureau of Statistics data on Land Management and Farming in Australia [26]). Similarly, reporting may be only online with no downloadable version, while older publications (and, with them, the accompanying institutional memory) can be lost entirely. In the US, the use of digital archives is common, but potential audiences may not know to request archival information. Increasingly, social media platforms such as Twitter are used by organisations to promote their activities (e.g., FAOKnowledge [128]). The NRCS USDA soil health web portal has a wealth of information, short videos and activities in state areas [129], but the general message is about raising awareness on the topic. Digital media are particularly useful for raising awareness of issues, to catch viewer attention and to stimulate interest, but online media are less powerful for practice change and discussion (e.g., Twitter is used by USDA NRCS to highlight their work and show how landholders are involved and can get involved in programs [130]). We must remember that information provision is not the same as creating a dynamic learning environment. Both the ABS and USDA NASS databases on soil and land management practices can be interrogated. Unfortunately, the scale is not applicable to the typical land manager. Furthermore, available data does not include soil change information. The ABS data does allow for graphing functions, but lacks visual appeal, and it is static and is onerous to manipulate. One alternative to these large databases is the use of applications (apps) for mobile devices, such as SoilMapp™, developed by CSIRO in Australia, and SoilWeb, developed by the University of California Davis [131]. Both apps use GPS (geographically located) and are relatively easy to navigate. Both sets of data were collected over many decades. SoilMapp™ (CSIRO, Canberra, Australia) has been in the public domain for nearly three years and has been downloaded some 3600 times, but the audience is unclear, as are the developers' intentions for its use. SoilWeb uses NRCS US soil data on inherent properties, which are critical for interpretation but do not tell the story of soil change at the human time scale. These databases are also great education tools on soil types and their characteristics. However, by themselves, their value is limited by the lack of soil change information and other predictive capabilities. At present there do not seem to be many online platforms that offer an interactive way of examining soil data and interpreting it for various users, with some small exceptions [132]. The soil quality website does allow farmers to compare their own soil testing data to data held in the website. The output is a graph of data collected for that locality, which shows, through traffic-light indicators, unacceptable and acceptable levels of the soil property in question, with variation according to broad soil texture classes. The website stipulates that for some soil properties, target values are known, and one-off sampling can be used to determine if a soil meets the target value. However, for other soil properties, target values are not defined and subsequent monitoring over time is required so that trends can be established. In the US, the National Soil Survey Center (NSSC USDA NRCS) offers a number of online soil portals that can be used, around soil survey and soil health, mostly to produce soil maps and tabulate soil data. These include Web Soil Survey [121], Soil Data Access, and Dynamic Soil Properties, which are all built from the same soil database, with over 2.5 M data records, called the National Soil Information System, (NASIS). Web Soil Survey (WSS) provides both soil maps and the soil data explorer provides access to soil data for your \"area of interest\" and determines the suitability of the soils for a particular use. Web Soil Survey has soil maps and data available online for more than 95% of US counties. Web Soil Survey is operated by the USDA NSSC and has 152,000 unique users each month and produces 493,000 customized soil reports per month [133]. As we have learned from several of the studies above, direct human interaction with face-to-face communication is still needed. Unfortunately, a capacity constraint for both knowledge generation and exchange is the aging nature of the workforce, both in agriculture and the service industries of education and extension [51]. Fortunately, the US Farm Bill targets beginning farmers in many of their assistance programs. Nevertheless, US farmers are aging, and in the last census of 2012, the average age was 58.3 years, with 33% of US farmers aged 65 years and over [45]. Australia's farmers also tend to be considerably older than other workers. In 2011, almost a quarter (23%) of Australian farmers were aged 65 years or over, compared with just 3% of people in other occupations [101]. The aging of the farming community in both countries also has implications for how knowledge is presented, as many have yet to widely adopt digital technologies."}, {"section_title": "Developing Social Networks for Knowledge Exchange", "text": "With an aging and smaller workforce comes the loss of experiential and expert knowledge which could be addressed in part with succession planning and the use of mentoring, but to date there seems to be little consideration of how to train the next generation of soil conservationists. Mentoring in universities, government and farming communities is a worthwhile endeavour to stem the loss of expertise and local experience. Alternately, using existing or developing knowledge networks (such as those that currently exist in NSW, Australia, with retired soil scientists) or remotely accessed nation-wide databases may in some way address these concerns. Hunt et al. [134] identified a positive feedback loop between reduced government involvement and declining employment opportunities, with fewer graduates and undergraduates studying those fields, further reducing the number of skilled professionals and tertiary resources for the study and practice of sustainable agriculture. A recent evaluation of the Australian Soil RD & E staff re-enforced the limited investment in soil knowledge exchange, showing 12.5% of its workers in extension and 6% in teaching, with the majority of staff in research (39%) and postgraduate training (26%) [51]. At the same time, there also seems to be an increase in farmers undertaking formal post-secondary school qualifications. Over the three decades to 2011, for instance, the proportion of Australian farmers with post-secondary qualifications more than doubled, from 15% to 38% [101]. The proportion of farmers with a certificate-level qualification doubled over this period, while the proportion with a bachelor's degree or above increased six-fold. Making the connection between scientists and land managers requires great effort for developing social networks. While innovative farmers and enterprising scientists interested in outreach will pair up to do on-farm research and have field day discussions and even join e-extension communities of interest, beyond these subgroups communication is all too infrequent in our experience. Broadacre and grazing farmers in the Border Rivers-Gwydir (BRG) CMA region were found to be more likely to seek out other farmers for information on natural resource management rather than go to the CMA or to Landcare (Figure 8). They cite the strength of their ties as a factor [135]. The more worrying trend is the decline in these regional-level organisations as sources of information, especially Landcare (Figure 8). At its peak in 2002, Landcare had 40% of landholders involved, and in the last survey conducted in 2012, membership had slipped to just over 20% of Australian farmers. Soils-focused groups such as Soils for Life [136] and SoilCare (NSW) [137] exist because of farmer interest in managing soils better and a desire to share experiences and knowledge. These groups have developed largely outside the major RD & E structures, isolated from existing knowledge sources with few communication links to recognised research and development. communities of interest, beyond these subgroups communication is all too infrequent in our experience. Broadacre and grazing farmers in the Border Rivers-Gwydir (BRG) CMA region were found to be more likely to seek out other farmers for information on natural resource management rather than go to the CMA or to Landcare (Figure 8). They cite the strength of their ties as a factor [135]. The more worrying trend is the decline in these regional-level organisations as sources of information, especially Landcare (Figure 8). At its peak in 2002, Landcare had 40% of landholders involved, and in the last survey conducted in 2012, membership had slipped to just over 20% of Australian farmers. Soils-focused groups such as Soils for Life [136] and SoilCare (NSW) [137] exist because of farmer interest in managing soils better and a desire to share experiences and knowledge. These groups have developed largely outside the major RD & E structures, isolated from existing knowledge sources with few communication links to recognised research and development. In the US, farmer groups are not subsidized by the government. However, US farmers have formed interest groups and have regular field days on conservation management topics, such as no tillage and organic agriculture (National Corn Growers Association Soil Health Partnership [138]). US farmer interest often dictates which information sources and networks have the most influence. For users of cover crops, the most relied-on sources of information (with equal importance) are: farm media, the USDA or local conservation district representative, and university extension educator, while for non-users the greatest influence for advice on cover crops was that from neighboring farmers, followed closely by the USDA or local conservation district representative and agricultural retailer [100]."}, {"section_title": "Conclusions", "text": "For positive changes in soil health and agroecosystem sustainability to occur, the farmers are the most important people of influence, because ultimately it is their actions that will determine the state of the soil [66]. Researchers, educators and policy-makers must address the best \"means to an end\" by which they can achieve this. We argue that the link between the use of soil information, here indicated by the use of soil testing and farm plans to monitor soil health and improve soil management, and, ultimately, ecosystem sustainability, has yet to be proven, but essential to establish. Hence, the way forward must include a better understanding of how farmers currently gather and use soil information, by addressing the limitations of current national data sets.  In the US, farmer groups are not subsidized by the government. However, US farmers have formed interest groups and have regular field days on conservation management topics, such as no tillage and organic agriculture (National Corn Growers Association Soil Health Partnership [138]). US farmer interest often dictates which information sources and networks have the most influence. For users of cover crops, the most relied-on sources of information (with equal importance) are: farm media, the USDA or local conservation district representative, and university extension educator, while for non-users the greatest influence for advice on cover crops was that from neighboring farmers, followed closely by the USDA or local conservation district representative and agricultural retailer [100].\nFor positive changes in soil health and agroecosystem sustainability to occur, the farmers are the most important people of influence, because ultimately it is their actions that will determine the state of the soil [66]. Researchers, educators and policy-makers must address the best \"means to an end\" by which they can achieve this. We argue that the link between the use of soil information, here indicated by the use of soil testing and farm plans to monitor soil health and improve soil management, and, ultimately, ecosystem sustainability, has yet to be proven, but essential to establish. Hence, the way forward must include a better understanding of how farmers currently gather and use soil information, by addressing the limitations of current national data sets. Soil testing, as currently available to farmers, is necessary to document soil health change or improvement, but due to its low application (frequency and intensity), along with known limitations, is probably insufficient for this purpose. Even so, despite its flaws, the type of soil information delivered by soil testing, focusing on nutrients and soil pH, is underutilized, engaging less than 30% of farmers, at any one time, in both countries,; at least appears that way from the national-level reporting of soil testing practice. Anecdotally, we can show there is a small core of farmers interested in gathering soil information and applying it to managing soil health, such as the innovative farmers who participated in the US focus groups. Less evident is the commitment to soil testing over time by farmers and how it is used by farmers in their farming practice. Despite the recurrent language, in policy and other documents, that suggests farmers' monitoring of soil health is necessary to guide decision-making and land management practices [51], the reality of their practice, as shown in this paper, has been difficult to establish. The US and AU databases fell very short of providing information on farmer motivations for soil testing. Even when questions about motivation were asked, the answers to those regional survey questions were not reported [97,139]. While this information is not the primary goal of these surveys, a few relatively minor changes, made in consultation with agricultural educators, could provide the much-needed information. Additionally, we found sharply contrasting conclusions made about the same set of data [36,65], as well as claims that appeared to be unsubstantiated by the evidence presented. There is little wonder that the understanding of what farmers do with soil information and why is rather limited. Fortunately, there were some regional studies, in the US and AU, to draw upon and compare with the national survey results. As a proxy for soil health assessment, we maintain that soil testing was a reasonable \"gateway indicator\". However, there are many well-documented concerns on soil testing and its reliability [21,110,112], which may be one reason its use seems low. One study reported that farmers felt they continually monitored soil health, yet formal documentation of soil testing results was minimal, and instead they often relied on visual appraisals (52% of AU farmer respondents reported) [64]. A greater emphasis on observational indicators may gain strong acceptance from farmers. Participants in a US survey reported wanting assistance from crop advisors or agricultural retailers to do testing or monitoring and provide management advice from that information [62]. It seems clear that those farmers who perform soil testing require clear \"how to\" guidance. Those who do not use soil tests may prefer to pay consultants to perform testing for them. We found obvious growth in soil building practices, such as no-till in the US and AU and cover crops in the US [91,92,99,100]. Improving soil health is seemingly a persuasive motivator for those farmers currently using these practices, regardless of policy incentives and farm-level information on soil health benefits. However, for those farmers yet to adopt such practices it seems they will require incentives to undertake soil building practices, as well as understanding the environmental and economic imperative of gathering information on their soil health. For instance, one US study concluded that incentive payments were very important to some farmers, but found that when environmental benefits were apparent, they continued the practice without subsidy [140]. However, for continued growth in soil building practices by farmers, the benefits must be observable, whether by ocular estimate or through laboratory tests. The adoption of sustainable natural resource management practices relies on a number of social, political, economic and institutional factors to intervene and influence landholders' motivation and capacity to change [89,102]. Identifying land degradation or loss of soil condition, through soil information, would seem a critical first step to land management change, but as shown in the adoption of no-till, it has occurred without such information at the farm scale. Farmers seemingly recognize the long-term commitment needed to build soil health, but our understanding of their interest in soil health status is limited due to the nature of national-level data collection on soil testing practice. Policy-makers can address this knowledge vacuum by supporting improved national-level reporting and data analysis. Educators and other agricultural professions can provide guidance and consultation to farmers on how to assess soil health changes in response to management. Ultimately, it is farmers who must make the needed practice changes. To make and maintain management improvements, farmers want to be confident that the benefits to their soil are real. Soil assessment and monitoring can benefit us all if undertaken with clear guidelines and within supportive structures. Table A1. Reported participation (%) by Australian farmers in developing a farm plan, soil or tissue testing either in relation to a farm plan or as individual activity. a Figure A1. b Proportion of farms that reported that the practice was applicable to the farmer's location, enterprise mix or situation. RSE relative standard error as a percent of the estimate Table A2. The number of US corn hectares, whether owned or rented, participating in working-land government programs, including EQIP, CSP and land retirement (CRP), and having plans for erosion, nutrient and pest management, or having other cost-share arrangements for 2010. (Data source: [27]). "}]