[{"section_title": "Abstract", "text": "We estimated the economic benefits resulting from controlling soybean aphid infestation by using a multi-regional competitive dynamic equilibrium model. Results indicate that the reduction of soybean production resulting from a soybean aphid infestation is largely absorbed by reducing soybean exports, due to the higher price elasticity of export demand compared to domestic demand. Producer benefits resulting from controlling soybean aphids would increase by between $949 million and $1.623 billion in ten years under various scenarios. Results also suggest that it is economically more efficient to control soybean aphids when the rate of intrinsic growth is relatively lower, the supply price elasticity of soybean acreage is relatively more elastic, and insecticide treatment costs per acre are lower. However, if the discovery of the gene Rag-1 (TF04048) leads to new cultivars that withstand the soybean aphid, our estimates will overestimate the actual damages. Even so, our analysis demonstrates that it is critical to control soybean aphids early in their infestation cycle to avoid a rapid increase in damages."}, {"section_title": "", "text": "70-80°F, while the developmental time is lengthened when temperatures exceed 81°F; soybean aphids are intolerant to temperatures above 95°F (North Central Soybean Research Program 2004, Rice, O'Neal, and Pedersen 2005) . Consequently, more soybean aphids were found in the northern states, where weighted-average soybean yields are the highest, at 42 bushels per acre (during the 2000-2002 period), than in the southern states, where weighted-average yields are the lowest, at 30 bushels per acre.\nSoybean aphids cause damage, including plant stunting, reduced pod and seed counts, and puckering and yellowing of plant leaves. Additionally, soybean aphids are capable of transmitting viruses, including alfalfa mosaic, soybean mosaic, and bean yellow mosaic (Grau et al. 2002) . Soybean aphid-induced yield reductions associated with grower strip trials (without the treatment of an insecticide) have ranged from more than five to nineteen bushels (Ostlie 2005, McCornack, Ragsdale, and Venette 2004) , while the timely treatment of insecticides on soybean aphids could make a difference (reducing the loss) of between five to more than ten bushels per acre (North Central Soybean Research Program 2004) . However, the potential for an extremely rapid population increase makes timely treatment of insecticides a difficult mitigation issue (Potter and Hansen 2003) . Therefore, the USDA has established a soybean aphid tracking system, which reports the number of soybean aphids per plant in soybeanproducing states (http://sbrusa.net). The reported economic threshold for insecticide treatment of soybean aphids is 250 aphids per plant, with more than 80 percent of plants infested.\nWhile there is an increasing need to respond to invasive pests, empirical analyses of invasive pests are often hampered by a lack of data. For our study, we use the USDA Agricultural Resource Management Survey (ARMS), which collected information on the detection of soybean aphid on the sampled soybean field, insecticide treatments, and scouting. First, our study measures the effects of the U.S. soybean aphid infestation on the volumes of U.S. soybean production, its domestic demand, and exports. The reduction of soybean production resulting from a soybean aphid infestation includes reduced yield, increased production costs due to increasing insecticide application, and reduced acreage due to acreage conversion from soybean production to alternative crop production. Even though a soybean aphid infestation reduces soybean quality, the costs associated with the reduced soybean quality are not included in our research due to the lack of information. Second, we estimate the economic benefits of controlling for soybean aphids.\nTo achieve these goals, soybean-producing states are divided into three regions based on the distributions of buckthorn and soybean yields. A logistic growth model is used to estimate the dispersion rate of infested soybean acreage with the soybean aphid. We then apply a competitive dynamic economic-equilibrium simulation model by incorporating the logistic growth function into an equilibrium condition obtained from integrating three regional soybean supply functions, a domestic soybean demand function, and an export soybean demand function. Since soybean aphids do not colonize the soybean plant and lay their eggs on the common buckthorn, soybean aphids can reappear on the same field in the year following treatment with insecticides. This implies that controlling soybean aphids is a pest management problem, rather than an optimal-control problem, and therefore, in the following section, a competitive dynamic-economic model is established."}, {"section_title": "The Model", "text": "We address the economic impacts of the soybean aphid within the context of a multi-region, dynamic equilibrium framework, assuming both differential regional logistic acreage infestation growth functions and their regional soybean yield effects. We begin first by assuming that the regional soybean supply functions, the U.S. domestic demand function for soybeans, and the U.S. soybean export demand function are linear, similar to Piggott and Wohlgenant (2002) , and expressed as follows:\nwhere Q (t) represents the quantity of soybeans in year t; P (t) represents the expected price of soybeans in equation (1), the U.S. domestic soybean price in equation (2), and the domestic soybean price of an importing country in equation (3), where all prices are identical at equilibrium; α and β are supply/demand parameters; the variable A i (t) represents the soybean acreage infested in the ith region during year t; and the variable Ỹ i represents the per acre reduction in soybean yield (or yield loss) associated with the aphid infested acres. The variable Z i represents aphid control measures such as scouting and insecticide application, q si represents the reduction in soybean production as farmers switch acreages from soybean production to corn or some other crop production, while q wi (t) represents the reduction in soybean production as a result of increased insecticide application cost for managing the soybean aphid. The subscripts s, c, and x represent soybean domestic supply, domestic demand, and exports, respectively. Following Huffaker and Cooper (1995) and Kim, Wang, and Yang (2005) , we assume a logistic growth function for the soybean acreage infested with aphids as follows:\nwhere the variable g i represents the intrinsic growth rate of infested acreage in the ith region, E i (t) represents the pest management efforts such as treatment with insecticides, and V i represents the maximum acreage available for soybean aphid infestation. A solution of the first-order differential equation (4) is presented as\nand t 1 represent the base period. The typical pattern of a logistic growth model shows small initial changes in growth rates which then accelerate up to an inflection point, after which the growth rate slows down toward a limiting value as A i approaches V i . Consequently, economic costs resulting from a soybean aphid infestation are assumed to be less significant during the early periods of infestation, but increase as the rate of aphid infestation accelerates. Inserting equation (5) (2), and the export demand, Q x (t), in equation (3). The result is then represented as follows: Similarly, the equilibrium quantities of domestic production, domestic demand, and export demand are obtained by inserting equation (6) into equations (1) through (3) and solved as follows: (7) [ ]\nThe dynamic equilibrium solutions presented in equations (6) through (9) are consistent with optimal solutions derived from revenue maximization subject to a quantity constraint such that total domestic production equals the sum of domestic demand and export demand.\nProducer surpluses at equilibrium by time period are then obtained by using equations (1), (6), and (7), represented as follows:\n, and where r is the rate of time preference, t 1 is the base period, and T is a terminal time period. Similarly, the U.S. soybean consumer surpluses (CS) are represented by using equations (2), (6), and (8), as follows: 3 Annual soybean price and loan rate, domestic soybean demand, domestic production, and exports were also acquired from USDA-ERS.\nAn application of a competitive dynamic equilibrium model presented in the previous section also requires advanced knowledge on the intrinsic growth rate for the soybean aphid in each soybean-producing region, a soybean acreage response function, and various soybean price elasticities. Sources and/or parameter estimation procedures are provided for each as follows."}, {"section_title": "Intrinsic Growth Rate", "text": "McCornack, Ragsdale, and Venette (2004) estimated the intrinsic growth rate for the soybean aphid under controlled lab experiments as varying between 0.368 and 0.474 under normal temperature conditions. However, the intrinsic growth rate declines as the adoption of control measures such as scouting and insecticide treatment increase . Furthermore, the soybean aphid is intolerant to temperatures above 95°F, and the distribution of buckthorn, the soybean aphid's wintering host, varies across regions, which suggests that intrinsic growth rates of the soybean aphid are also quite different among the three regions. Voronov (2005) proposed an estimation procedure for the intrinsic growth rate with observed data, which is appropriate for estimating the intrinsic growth rate associated with a complex logistic growth model such as a logistic net growth model (Kim et al. 2007) . 4 For a conventional logistic growth model as we specified in equation (4), however, Voronov's procedure produces biased estimates of the intrinsic growth rate. Therefore, we derive the intrinsic growth rate directly from equation (5) for each soybeanproducing region as follows:\nwhere t 1 and t 2 represent the initial and terminal time period, respectively. Application of equation (12) requires an advanced knowledge of the soybean acreages infested in the initial and terminal time periods and the maximum soybean acreages available for aphid infestation.\nFor the first time, in 2002 the USDA Agricultural Resource Management Survey (ARMS) questionnaire asked respondents whether the soybean aphid was detected on the sampled soybean field. Therefore, the year 2002 is selected as the terminal time period [t 2 in equation (12)] for estimating the intrinsic growth rate. Soybean acreage infested with the soybean aphid in 2002 was reported to be A 1 (t 2 ) = 744,100 acres for Region 1, A 2 (t 2 ) = 335,200 acres for Region 2, and A 3 (t 2 ) = 39,300 acres for Region 3 (Table 1) .\nMeanwhile, no information is available as to when soybean aphids were introduced into each region, so the initial time period t 1 in equation (12) \nwhere t 1 and t 2 represent the initial and terminal time periods, respectively.\nbean acreage had increased to more than 70 million harvested acres in 1978, which is comparable to the current level of soybean acreage. Therefore, we select the year 1972 as an initial time period [t 1 in equation (12)] for the estimation of the intrinsic growth rate by comparing the annual harvested soybean acreage to the maximum acreage available for soybean aphid infestation (i.e., V i ). 5 The estimated intrinsic growth rates for soybean aphids (with the initial time period in 1972 and the terminal time period in 2002) are g 1 = 0.4845 for Region 1, g 2 = 0.4602 for Region 2, and g 3 = 0.3861 for Region 3. Next, once the intrinsic growth rates for soybean aphids are estimated, we estimate the infested acreage-response function with soybean aphids [i.e., equation (5)] by using the estimated intrinsic growth rates for each of the three regions. Since the economic simulation analysis is to measure the economic effects of soybean aphid infestation in coming years, compared to the base year period, we selected the years 2000-2002 as the base period for simulation. Using soybean summary data presented in Table 1 , the infested acreage-response functions for each of the three regions are represented as follows: (13 \nSince equation (12) is undefined for A i (t 1 ) = 0, we assume that only one acre was infested with soybean aphids during the initial time period, so A i (t 1 ) = 1.\n6 When the initial time period is chosen as 1987, the estimated intrinsic growth rates for the three regions are g 1 = 0.9690, g 2 = 0.9204, and g 3 = 0.7722, which appear very high. "}, {"section_title": "Soybean Acreage Response Functions", "text": "The variable q si (t) represents reduced soybean production due to producers switching acreages from soybean to other commodity production as a result of reduced yields associated with an aphid infestation. The reduction in soybean production as a result of acreage conversion from soybean to corn or cotton production is estimated by using results from an earlier econometric study by Lin et al. (2000) . Lin et al. estimated regression coefficients for soybean acreage response to changing soybean net returns assuming the theoretical restrictions of linear homogeneity and/or symmetry. 7 Reduced soybean production due to produc- where %SOY is the percentage of soybean normal flex acreage planted to soybean, SNR is expected per acre net returns for soybeans, CRNR is expected per acre net returns for corn, WNR is expected per acre net returns for wheat, and CNNR is expected per acre net returns for cotton.\ners switching acreages from soybean to other crop production in the ith region, q si (t), is estimated by\nwhere θ i is the parameter associated with the variable SNR (see footnote 7), S i (t) is the acreage allocated for soybean production in the ith region, and P (t) is an expected price of soybeans per bushel. However, futures market prices for soybeans (for the next ten years) are not available for simulation analyses using equation (16). Furthermore, q si (t) is considered as a supply shifter in our model (see footnote 2), so therefore we use the observed soybean price per bushel in the previous year for the expected soybean unit price in equation (16). 8 "}, {"section_title": "Increased Insecticide Treatment Costs", "text": "The variable q wi (t) represents reduced soybean production due to increased insecticide treatment costs. First, let P*(t) be a unit price associated with Q* si (t), which represents potential production without a soybean aphid infestation (see Appendix) . Then the inverse supply function is represented by\nAn increase in soybean production costs per acre, as a result of increased insecticide treatment, is represented by w i A i /V i , where w i is the per acre 8 For the case where E (P t ) = P t , the supply curve in equation (1) rotates to the left as farmers switch acreage from soybean production to other crop production, and therefore the equilibrium price and quantities would differ from those presented in equations (6) through (9). cost of applying an insecticide for the purpose of controlling soybean aphids in the ith region. Adding w i A i /V i to both sides of equation (17) results in the following:\nwhere P(t) = P*(t) + w i A i /V i , and Q si (t) is the soybean production associated with P(t). The reduced soybean production associated with an increase in insecticide treatment costs is estimated from equation (18) as follows:"}, {"section_title": "Soybean Price Elasticities", "text": "The price elasticities for domestic soybean demand and export demand are from USDA's Food and Agricultural Policy Simulator ( Table 2 ). The price elasticity of domestic soybean demand, -0.16, is within the range of -0.13 and -0.29, which were recently estimated by Piggott and Wohlgenant (2002) . The price elasticity of domestic soybean demand, obtained from the Food and Agricultural Policy Research Institute (FAPRI), is -1.17, which is greater than other estimates. Meanwhile, the price elasticity of soybean export demand, -0.79, is greater in absolute value than Piggott and Wohlgenant's estimate of -0.63, but less than the FAPRI estimates, which range between -1.07 and -1.44. Regional soybean supply price elasticities are from a USDA study by Lin et al. (2000) , 9 and range between 0.2 for Region 2 and 0.3 for Region 1. These estimates are also within a reasonable range when compared with estimates from FAPRI for Regions 1 and 3. However, the FAPRI estimates for Region 2 are twice that of USDA estimates (Table 2) . Other previous studies are based on aggregate analyses using estimates that range between 0.12 ~ 0.14 by Piggott, Wohlgenant, and Zering (2001) and 0.3 by Meilke and 9 Lin et al. (2000) used the November soybean futures price at the Chicago Board of Trade in mid-March as the expected per-bushel price of soybeans. Expected price is further adjusted on a state-specific 5-year average basis-specifically, by the difference between the future prices and cash prices received by farmers in the delivery month of the futures-thus arriving at a farm-level equivalent price. Jay (1997), which are also within a reasonable range."}, {"section_title": "Results", "text": ""}, {"section_title": "Scenarios for Simulations", "text": "Using data presented in Tables 1 and 2 , parameters associated with the domestic supply, domestic demand, and export demand of soybeans are estimated and presented in Table 3 . Using these parameters, simulation analyses were conducted for five scenarios. Scenario 1 assumes that there was no insecticide treatment on soybean aphid infested acres and that soybean yield declines by 26 percent on average. Scenario 2 assumes that all soybean aphid infested acres are treated with an insecticide at $12 per acre, while yield declines by 12 percent on average. Scenario 3 assumes that all infested acres are treated with an insecticide (as long as the yield loss is greater than the costs associated with an insecticide treatment) at $25 per acre, and that soybean yield declines by 12 percent on average. Since soybean yields are relatively lower in Region 3 (Table 1) , economic benefits resulting from an insecticide treatment would be less than the treatment cost of $25 per acre. Therefore, under the third scenario, when treatment costs are $25 per acre, then only soybean acres in Regions 1 and 2 are assumed to be treated with an insecticide. In addition, soybean yields in Regions 1 and 2 are reduced by 12 percent (with insecticide treatment costs of $25 per acre), while soybean yields in Region 3 decline by 26 percent (with no insecticide treatment). While the North Central Soybean Research Program (2004) reports that insecticide treatments cost $12 per acre (on average), Suszkiw (2005) reports that an average treatment cost ranges from $12 to $25 per acre. Therefore, both a lower and upper bound for insecticide treatment costs are used in our simulation analyses.\nScenarios 4 and 5 are associated with sensitivity analyses. Scenario 4 is the same as Scenario 2, except that the intrinsic growth rates are increased by 25 percent to g 1 = 0.6056, g 2 = 0.5753, and g 3 = 0.4826. Meanwhile, Scenario 5 is the same as Scenario 2, but the supply price elasticity of soybean acreage is increased by 25 percent, so the supply intercept and slope parameters are assumed to be α 1 = 1,261.275, α 2 = 353.675, α 3 = "}, {"section_title": "Results and Policy Implications", "text": "During the base year period of 2000-2002, the U.S. soybean industry produced nearly 2.8 billion bushels of soybeans, 64 percent of which was used for domestic demand and the remainder exported, while more than one million acres were infested with soybean aphids. Producers' and domestic consumers' surpluses at the base year were estimated to be nearly $13 billion and $30 billion, respectively (Tables 4 through 8 ). The largest economic damage associated with a soybean aphid infestation occurs under Scenario 1 (assuming no insecticide treatment), where reductions in producer and consumer surpluses reach $1.2 billion and $546 million, respectively, in five years, and $4.9 billion and $2.3 billion, respectively, in ten years (Table 4) . Meanwhile, the reduction in soybean production (∆Q * s ) reaches 71 million bushels in five years, but it reaches 329 million bushels in ten years, which accounts for about 12 percent of U.S. soybean production during the base year period. This reduction, however, is largely absorbed by reducing soybean exports due to a higher price elasticity of export demand than for domestic demand (Table 2) .\nWhen acres infested with soybean aphids are treated with insecticides at $12 per acre (Scenario 2), reductions in producer and consumer surpluses reach $829 million and $373 million, respectively, in five years, and reach $3.6 billion and $1.6 billion, respectively, in ten years (Table  5) . Soybean production would decline on average by some 47 million bushels in five years (∆Q * s ), but by 236 million bushels in ten years. When costs associated with insecticide treatment increase to $25 per acre (Scenario 3), both producer and consumer losses would grow to $956 million and $430 million, respectively, in five years, and $3.9 billion and $1.8 billion, respectively, in ten years (Table 6 ). Meanwhile, soybean production declines by 55 million bushels in five years (Table 6), but by 261 million bushels in ten years.\nThe soybean aphid-infested acreage initially grows slowly, then its growth begins to accelerate up to an inflection point, and thereafter the increase of infested acreage begins to slow. That is, aphid-infested soybean acreage would increase to 10.3 million acres in five years, but it would increase to 43.5 million acres in ten years, which accounts for 60 percent of soybean acreage harvested during the base year. Furthermore, reductions in producer and consumer surpluses presented in Tables 4, 5 , and 6 also increase slowly at the beginning, but begin to accelerate as time progresses as a result of employing a logistic aphid-infested acreage growth function. Therefore, it is important to get the timing right for controlling soybean aphids."}, {"section_title": "Sensitivity Analyses", "text": "Economic effects of a soybean aphid infestation on producers and consumers will vary across the relative sizes of the parameters in our model. Therefore, we conduct sensitivity analyses associated with two major parameters in our model, including the intrinsic growth rate of soybean aphid infestation and the price elasticities of soybean acreage supply.\nFirst, we assume that the rate of intrinsic growth in each region increases by 25 percentfrom g 1 = 0.4845, g 2 = 0.4602, and g 3 = 0.3861 to g 1 = 0.6056, g 2 = 0.5753, and g 3 = 0.4826-while insecticide treatment cost remains at $12 per acre (Scenario 4). The effects of an increased rate of intrinsic growth can be found by comparing the results presented in Table 5 for Scenario 2 with results in Table 7 for Scenario 4. Results show that as the intrinsic growth rate of soybean aphids increases by 25 percent, acreage infested with soybean aphids increases by 32 percent in ten years, from 43.5 million acres to 57.5 million acres, which would lead to a further reduction in soybean production of 84 million bushels, which is largely absorbed by reducing soybean exports. Furthermore, producer surplus would further decline by an additional $1.26 billion, due largely to the increase in acreage infested with soybean aphids (over that for Scenario 2), while consumer surplus would further decline by nearly $600 million, largely due to an increased soybean price from $6.54 per bushel to $6.96 per bushel during the same time period (as a result of reduced soybean production).\nNext, we assume that the price elasticity of soybean acreage in each region increases by 25 percent-from ε 1 = 0.298, ε 2 = 0.198, and ε 3 = 0.221 to ε 1 = 0.3725, ε 2 = 0.2475, and ε 3 = 0.2763-while insecticide treatment costs remain at $12 per acre and the rates of intrinsic growth remain the same as g 1 = 0.4845, g 2 = 0.4602, and g 3 = 0.3861 (Scenario 5). 10 The effects of increasing the supply price elasticity of soybean acreage by 25 percent can be found by comparing results a Estimates here include production losses from both infestation and acreage conversion. b A 3 percent rate of discount is used. c Estimates measure change in economic benefits from the base year period. a Estimates here include production losses from infestation, acreage conversion, and increased treatment costs. b A 3 percent rate of discount is used. c Estimates measure change in economic benefits from the base year period. presented in Table 5 for Scenario 2 with results in Table 8 for Scenario 5. Results indicate that as the supply price elasticity increases by 25 percent, the reduction in soybean production is slowed by 24 million bushels in ten years, the rise in soybean price is slowed by $0.11 per bushel, and the reduction of producer surpluses is slowed by $983 million. Table 9 provides a summary of the economic benefits resulting from controlling soybean aphids, where the economic benefits for each scenario are defined as the difference between producer or consumer surplus, respectively, under each scenario, and those for the scenario without insecticide treatment (Scenario 1). Both producer and consumer benefits resulting from insecticide treatment increase steadily over time under Scenarios 2, 3, and 5. However, the economic benefits resulting from controlling soybean aphids increase as the insecticide treatment costs decline, the price elasticity of acreage supply becomes more elastic, and the intrinsic growth rate declines. When the rate of intrinsic growth increases by 25 percent (Scenario 4), it is not economical to treat soybean aphids with insecticides. Even though consumer surplus is more than twice that of producer surplus at the base year, our results indicate that producer benefits resulting from controlling soybean aphids far exceed consumer benefits over time.\nResults also suggest that before soybean growers face severe economic losses from this invasive insect, greater efforts should be made to develop new higher-yielding seed varieties that are resistant to the soybean aphid. However, without the successful development of soybean aphid resistant varieties through germplasm and breeding 11 in the near future, soybean growers are very likely to suffer greater economic losses from soybean aphid infestations in the future. For example, in 2004, scientists from USDA's Agricultural 11 These techniques include selective hybridization, but they do not include a genetically modified organism (GMO) whose genetic material has been altered using techniques in genetics generally known as recombinant DNA technology. Research Service (ARS) and the University of Illinois collaborated on the discovery of a single gene, tentatively named Rag1, which confers resistance to soybean aphids (Suszkiw 2005 . This development has set the stage for seed companies to breed existing high-yielding but susceptible cultivars that should withstand the soybean aphid (using backcrossing procedures) without help from insecticides (Hill, Li, and Hartman 2006) ."}, {"section_title": "Conclusions", "text": "Soybean yields in the United States have been affected by a soybean aphid infestation. We estimate the economic benefits resulting from controlling soybean aphid infestation by using a multi-regional competitive dynamic equilibrium model. Soybean-producing states are divided into three regions based on the distributions of buckthorn, the invasive species' only known wintering host, and soybean yields. The dispersion rate of infested soybean acreage with soybean aphids is modeled as a logistic growth function. The volume of U.S. soybean production, its domestic demand, and exports, as well as a logistic growth function for acreage infestation, are incorporated into a dynamic economic-equilibrium model.\nWe conducted simulation analyses for five scenarios. The first scenario assumed that there is no insecticide treatment on soybean aphid infested acres and that soybean yield on infested acres declines by 26 percent on average. The second scenario assumed that all soybean aphid infested acres are treated with an insecticide at $12 per acre, while yield declines by 12 percent on average. The third scenario assumed that all infested acres are treated with insecticides (as long as the yield loss is greater than the costs associated with an insecticide treatment) at $25 per acre, and soybean yield declines by 12 percent on average, while the yield on untreated acres (for Region 3) declines by 26 percent on average. The fourth scenario was assumed to be the same as the second scenario, but the rates of intrinsic growth increase by 25 percent, and the fifth scenario was also assumed to be the same as the second scenario, but supply price elasticities are increased by 25 percent.\nResults for this study indicate that the reduction in soybean production resulting from a soybean aphid infestation is largely absorbed by reducing soybean exports, due to the higher price elasticity of export demand (i.e., -0.79) compared to the domestic demand price elasticity (-0.16). Results also indicate that under the assumed parameters we used, soybean producer surplus losses would grow at between $46 million and $95 million following the first year of infestation, but would grow to between nearly $3.6 billion and $4.9 billion following ten years, depending upon the costs of treating soybean plants with an insecticide, the rate of intrinsic growth, and the price elasticities of soybean supply. Since infestedacreage increases are modeled by a logistic acreage infestation function, soybean producers suffer greater economic losses as the intrinsic growth rate of infested soybean acreage rises and infested acreage increases as time progresses. Consequently, it is important to control soybean aphids early on to avoid the rapid growth phase of the infestation. Finally, results also suggest that it is economically efficient to control soybean aphids when the rate of intrinsic growth is lower, when the price elasticity of soybean acreage supply is more elastic, and when insecticide treatment costs per acre are lower.\nConsidering the relatively moderate economic losses to producers during the earlier period of infestation and the successful discovery of Rag-1, which confers resistance to soybean aphids, the damages we estimate for the later infestation phases may be avoided due to the development of new soybean varieties. However, given the likely growth rate for potential economic losses, and associated impacts on the export market for U.S. soybeans, continued research on long-term effective control options is likely warranted. This research could help to develop optimal policies for disease prevention control as well as to determine efficient strategies for compensating farmers for potential losses through crop insurance and other farm support programs."}]