[{"section_title": "Abstract", "text": "Students' Critical Thinking Skills can be nurtured by implementing a teaching model in which students are provided with the opportunity to inquiry work, Inquiry-Student Team Achievement Divisions (INSTAD) teaching models may work effectively. This research aims to investigate: (1) the influence of INSTAD teaching model towards critical thinking skills compared with Guided Inquiry teaching, STAD and conventional teaching model; (2) the influence of academic achievement on critical thinking skills; (3) the interaction of teaching models and academic achievement on critical thinking skills. A nonequivalent control group design with pretest and posttest were used to get data on Critical Thinking Skills using an essay test based on Facione' critical thinking skills indicator. Participants in this research are 194 student eleventh grades in Surakarta, Indonesia. An intact group technique was applied to determine the sample of this study after passing the normality and homogeneity test, then each sample group was divided into the High Academic group (HA) and Low Academic group (LA). The data analysis technique using AnCova with the significantly value 0.05%. The result indicates that:\n(1) compared with other three metods, INSTAD has higher potential to improving students' critical thinking skills; (2) Students in HA group have higher students' critical thinking skills than students in LA group; (3) INSTAD can improving students' critical thinking skills in HA group until on equal with guided-inquiry teaching in HA group. The conclusion is INSTAD was confirmed the most effective improving students' critical thinking skills in HA and LA groups."}, {"section_title": "I. INTRODUCTION", "text": "The Critical Thinking Skills is the required skills that students need to respond to external challenges in the era of the rapid technological developments in the 21st century [1] . Facione [2] classifies critical thinking into several aspects: (1) Interpretation; (2) inference; (3) evaluation; (4) explanation; (5) analysis; (6) self-regulation. The interpretation aspect requires students to be able to categorize, explaining the meaning of a term. The analysis aspect is related to researching ideas, identifying and analyzing arguments. The evaluation aspect relates to the skills to assess opinions. The inference aspect consists of the skills to look for evidence and alternatives. The explanation aspect is the skills to express results, justify procedures, and present. The selfregulation aspect relates to the skills to monitor students' self-learning [2] . Fong, et al. in [3] states that students who have critical thinking tend to be more competent than students who are less critical.\nThe fact confirms that students' critical thinking skills in Indonesia are still relatively low compared to other countries. These can be confirmed by the achievement of Indonesia in Trends in International Mathematics and Science Study (TIMSS). Based on the five times Indonesia's participation in TIMSS (1999 TIMSS ( , 2003 TIMSS ( , 2007 TIMSS ( , 2011 TIMSS ( , 2015 , the level of Indonesian students in sequence are standing on 32 from 38 countries, standing on 37 out of 46 countries, standing on 35 out of 49 countries, standing on 39 out of 43 countries , and standing on 44 out of 49 [4] .\nThe low critical thinking skills of students which are not immediately addressed will caused on the low students' learning outcomes [5] . In line with the statement of Odlerová & Bednáriková [5] , Kaddoura in [6] also stated that the critical thinking skills in the field of education have necessary skills that are helping students to solve the problems met in the learning process. A short-term goal of students trained the critical thinking skills in the learning process is to strengthen students' conceptual understanding [7] . Therefore, the low students' critical thinking skills is a problem that must be solved.\nThe other urgently issue to be resolved is the students' critical thinking skills gap between HA and LA [8] . The differences in academic achievement caused by a student's cognitive development are not always consistent with their age [9] . Lai & Biggs [10] stated that the variation in students' academic achievement is due to the needs time to learn between LA and HA are not similar. Students capacity to reach the mastery levels is varied [8] .\nThe critical thinking skills gap between students in HA group and LA group that's not overcome soon have an impact on the LA students who can not reach the mastery stage like the HA students [11] . Özden [9] states that the critical thinking skills gap was happened because of the effects of studies time allocation given to the students. The same studies time allocation in the classroom between HA and LA students cause LA students to get less time to reach the mastery level so that less than optimal in developing critical thinking skills than HA students [12] . Therefore, the critical thinking skills gap between HA and LA students needs to be overcome. learning process. An implemented Scaffolding and mastery learning in collaborative learning proves to effectively accommodate HA students to help LA students in learning through discussions, demonstrations, and peer tutor [13, 14] . Optimization Scaffolding will strengthen LA students' conceptual understanding so that the critical thinking skills gap between HA and LA students can be minimized [15] . In addition, scaffolding and Mastery learning provide balanced learning time between HA and LA students [10] .\nThe issues of critical thinking skills' improvement and teaching practices have been addressed by many researchers [16] , but mostly discusses only single teaching models such as inquiry-based teaching, constructivist-based teaching, problem-based teaching, and project-based teaching [17] [18] [19] [20] . According to Ozden [9] , if a students group with sufficiently balanced academic achievement is given the exact same teaching method, then students' critical thinking skills will indicate a normal distribution curve. The critical thinking skills gap between HA and LA students will reduce if the study time given to LA students is tailored to their needs. One of the teaching models that can provide the amount of time that adjusts the learning needs of HA and LA students is the INSTAD model. Supported by Prayitno & Suciati in [11] , who states that the INSTAD teaching model has the potential to solve the problem of learning time between HA and LA through scaffolding activities in a collaborative learning environment.\nBased on the description above, it is necessary to conduct research that analyze: (1) the influence of INSTAD teaching model towards critical thinking skills compared with Guided-Inquiry teaching, STAD (STAD) and conventional teaching model; (2) the influence of academic achievement on critical thinking skills; (3) the interaction of teaching models and academic achievement on critical thinking skills.\nThe rest of this paper is organized as follow: Section II describes proposed research method. Section III presents the obtained results and following by discussion in section IV. Finally, Section V concludes this work.\nII. RESEARCH METODHOLOGY Based on research purpose, a quasi-experiment method with Pre and Posttest nonequivalent design were applied. The independent variables in this study are INSTAD, Guided Inquiry, STAD, and conventional teaching model. Moderator variables in this study are students' academic achievement that is divided into High and Low academic students group. The dependent variable of this research is students' critical thinking skills as measured at the end of treatment.\nThe research participants were 194 students eleventh grades in Surakarta, Indonesia. An intact group technique was applied to determine the sample groups of this research after it passing the normality and homogeneity test. Kolmogorov Smirnov parametric statistical prerequisite analysis was used for testing data normality, the score was 0.20, whereas the Levene homogeneity test indicate that homogeneous variants were at 0.052. The results of the normality and homogeneity test shows that sample groups have a normal and homogeneous category.\nGroups sample then tested again using ANOVA test to minimize the bias data. The results of the ANOVA test indicate significance variants were at 0.882 within not differ significantly. After obtaining the conclusions of ANOVA test results, groups of classes were directly selected according to sample needs in this research. Group 1 was Class of XI-Science 1 was chosen as an experimental model class INSTAD in which there are 33 students, Group 2 was Class of XI-Science 2 as Guided Inquiry model in which there are 33 students, Group 3 was Class of XI-Science 3 as STAD model in which there are 34 students, and Group 4 was Class of XI-Science 4 as a conventional model in which there are 32 students.\nThen each sample group was divided into the HA and LA group based on the average school examination score. From the categorization results obtained a group of HA students in INSTAD class as many as 15 people and LA students as many as 17 people. HA students in the Inquiry class as many as 16 people and LA students as many as 16 people. In the STAD class HA students as many as 15 people and LA students as many as 17 people. Meanwhile, HA students in conventional class as many as 15 people and LA students as many as 16 people.\nBased on HA and LA group classification, obtained the lowest sample group only has 15 students. So, to equalize the amount of data analyzed from each sample group, each sample class was selected for 15 HA students and 15 LA students. All students in the class will still get the same treatment even though the data analyzed only comes from 15 students from each HA and LA group.\nThe instrument to measuring students' critical thinking skills using an essay test as arranged based on a rubric of facione' critical thinking skills. Before the test being used to collect data of students' critical thinking skills, it has passed qualitative validation by expert validator i.e., lecturer of science education expert, an expert in biology science concentration anatomy of human physiology, and one practitioner of education.\nThe students' critical thinking skills data were analyzed using AnCova test of 5% significance level with pretest score reviewed as a covariate. Prior to the testing of AnCova, a prerequisite test is performed using a normality test using the Kolmogorov-Smirnov test and homogeneity test using Levene's test. Then the LSD test was further used for the mean difference between variables. The Kolmogorov-Smirnov normality test indicated the pretest score was 0.067 and posttest score of 0.055, whereas the Levene homogeneity test indicates that homogeneous variants were at 0.275. The conclusion of the normality and homogeneity test shows that the sample has a normal and homogeneous category."}, {"section_title": "III. RESULT", "text": "The result of the AnCova of students' critical thinking skills on the source of teaching model, academic achievement and interaction of teaching models with academic achievements are presented in Table I . Based on the results of AnCova test (see Table I ), the significance value of the model data source obtained sig number. = 0,000. The result has indicate there is significant influence of teaching model on critical thinking skills . The differences influence of each model of teaching to critical thinking skills then analyzed through further testing of LSD on the level of sig. 5%. Further LSD test results of teaching models data source are presented in Table II . Table II shows the results of the LSD Test for data source models have a different notation. These results indicate that there is a differ significantly students' critical thinking skills between INSTAD, Inkuiri, STAD and Conventional teaching models.\nTable II also shows a difference between pretest and posttest score. The improvement percentage of critical thinking skills of the INSTAD model was 159%, The improvement percentage of critical thinking skills of the Gudied-Inquiry model was 148%, The improvement percentage of critical thinking skills for the STAD model was 82%, and 71% for the conventional model. This fact indicates the INSTAD model has the highest potential for critical thinking empowerment\nThe result of AnCova test (Table I) indicate the significant values from academic achievement data source obtained 0.000. This mean there is an influence on academic achievement toward students' critical thinking skill. The results of the different influence on academic achievement on critical thinking skills are visualized in Table III . The average comparison which showed in Table III indicates the critical thinking skills HA students has a significantly different with LA student. The pre-tes score of LA group has on equal with LA group. HA group have critical thinking skills corrected average of 71.369, 10% higher than the LA group which only has a corrected average of 66.010. These results indicate that HA group have higher critical thinking skills than group LA. If observed in percentage form, then the improvement average pretest to posttest of HA students is 113% while the improvment average pretest to posttest of LA students is 119%. This result indicates that the improvement of critical thinking skills of LA students has higher than that of HA students.\nThe results of the AnCova test in Table I also indicates the significant value of the interaction between the model and academic achievement are 0.022. That's result confirmed there was an interaction of teaching model with academic achievement toward critical thinking skills. The position of each interaction of the teaching model with academic achievement tested using LSD test with 0.05 significance level is presented in Table IV . Table IV shows every interaction between the teaching model and academic achievement has varying notation. the applied of INSTAD in HA students get the same notation as the interaction of the guided inquiry model with HA students. These facts indicate the interaction of INSTAD HA and guided inquiry HA have equal potential for improving critical thinking skills. Interaction INSTAD LA has a significant difference with INSTAD HA interaction, but not significantly different from the guided inquiry with HA students. Interaction guided inquiry LA was significantly different from INSTAD LA and guided Inquiry of HA students. While the LA students' critical thinking skills applied by INSTAD model is able to be in the same level with HA students given the guided inquiry model, although not yet equivalent to INSTAD HA application. The interaction of STAD HA is not significantly different from STAD LA, but significant differences from conventional HA and LA. The STAD LA teaching model is not significantly different from the conventional HA but differs markedly from conventional LA."}, {"section_title": "IV. DISSCUSSION", "text": "The INSTAD model have merging of inquiry-based and cooperative STAD based teaching character [8] . INSTAD Model is able to train critical thinking skills through scientific method activities and scaffolding techniques that inquiry and STAD teaching models have. The inquiry character of the INSTAD model trains critical thinking through problem-solving activities and scientific work activities. Students' habits of finding solutions by conducting an independent inquiry into the observed problem proved able to trace the critical thinking skills [17] .\nScientific work activities in a collaborative group have become a differentiator of the INSTAD model from the guided-inquiry. The guided inquiry model is applied in traditional groups. Discussion thought processes, and behavioral assessment also occurs in inquiry strategies that are applied in traditional groups, although not as effective as INSTAD models. The application of inquiry-based activities in a traditional group has less effective in empowering the critical thinking skills of all group members [8] . This leads caused the significance value of the application of guidedinquiry models are lower than INSTAD towards the improvement of students' critical thinking skills.\nGuided-inquiry teaching is confirmed to improve critical thinking skills better than STAD and conventional. According to Hwang [21] , Guided-Inquiry teaching can improve students' cognitive thinking and teaching achievement. Students who are able to process their cognitive thinking skills optimally are confirmed to have higher critical thinking abilities than those who are not optimal. This is in line with the opinion of Özden [9] , that students who are able to improve their cognitive thinking ability to achieve high-order thinking skills will have a positive effect on their teaching outcomes and critical thinking skills.\nGuided-Inquiry teaching has a phase that encourages work using the steps of the scientific method of solving problems [22] . The steps of the scientific method contained within the inquiry have been shown to improve students' critical thinking skills [23] . The steps of the scientific method that do not appear in both STAD and conventional models, so that the potential to improve critical thinking skills is lower than Guided-inquiry. This is in accordance with the opinion of Gholami [18] which states that students' critical thinking skills cannot be mastered if students are not given the opportunity to develop the ability to apply, analyze, evaluate and synthesize a phenomenon.\nThe results of the study also showed that the application of the STAD model proved to be less able to improve students' critical thinking skills, although the corrected average results obtained were still higher than conventional models. This fact is in accordance with Verenikina's [24] opinion that the STAD model is not specifically developed to optimize critical thinking skills, however, the potential for scaffolding contained in STAD is expected to optimize activities that train students' critical thinking skills.\nThe results of the further average comparison to test the influence of academic achievement on critical thinking skills indicated that HA group students had higher critical thinking skills than LA group. This result was in line with Fong, et al. in [3] which states, there is a correlation between academic achievement with critical thinking skills. Students with high critical thinking skills have higher academic achievement than those with low critical thinking skills. This result also in line with the results of research by Prayitno & Suciati [11] which showed that HA students had better teaching achievement than LA students.\nThe different findings are detected in the results of the comparison of the corrected average of data sources derived from academic achievements in Table III . Percentage difference in the shift in the corrected average score in critical thinking skills from pretest to posttest showed the critical thinking skills improvement in group LA was higher than HA group. These findings indicate that the applied process of scaffolding model runs optimally. Okur & Doymus [25] states the scaffolding process through tutorials by HA students who have mastered critical thinking skills to LA students who have not mastered critical thinking skills runs optimally, as result, LA students are able to enter the Proximal Development Zone (ZPD) equivalent to HA students.\nThe result of interaction test between the teaching model and academic achievement toward teaching model shows that INSTAD model in HA group has the higher potential to increase critical thinking skills than other interaction. The result of interaction test between the teaching model and academic achievements toward students' critical thinking skills shows INSTAD model in AA group has the potential to improve critical thinking skills higher than other interaction. the other interesting LSD test results were interaction The INSTAD model in the LA group indicated a potential difference that was not significant with guided-Inquiry in the HA group. This fact shows the critical thinking skills of the LA group with INSTAD Model improved optimally until equivalent to the application of guided-inquiry in HA group.\nThese findings are in accordance with Prayitno, et al. in [8] , INSTAD teaching model has created to improve the thinking ability of LA students to the level of HA students. The effectiveness of the INSTAD model in improving the critical thinking skills of HA students and LA students is done through the optimization of two ways there are scientific method and scaffolding. The scaffolding process in applying the INSTAD model emerges through peer tutors in small groups of HA and LA students. Peer tutors will greatly help optimize the empowerment of critical thinking skills when all students in small groups carry out scientific method [8] . LA group students who have a longer time to master the concept get help from HA students who are relatively faster, whereas LA students can reach their ZPD. Therefore, the LA group can still improve their critical thinking skills optimally even in the same learning time as the HA group.\nThe INSTAD model has been proven to facilitate mutual learning among students [11] . Peer tutorials in the collaborative group on the INSTAD model provide sufficient learning time for LA students so that they were able to achieve mastery levels as HA students [26] . Unlike the case with the Guided-inquiry model is applied using traditional groups or groupings at random [22] . The random grouping has an impact on the group condition where cannot be ascertained consisting of HA and LA students. The imbalance of collaborative groups in inquiry work was the cause of peer tutors between HA and LA groups in the Guided-Inquiry model was not optimal.\nThe inability of LA students in inquiry work causes their critical thinking skills being difficult to be empowered, so creating the critical thinking skills gap between LA and HA students. The critical thinking skill gap was shown LSD test results of the interaction between Guided-inquiry LA and HA show both interactions have the different notation. The LSD test results also indicate that the interaction of Guided-Inquiry LA only achieves critical thinking skills corrected average lower than INSTAD HA, INSTAD LA, and Guided-Inquiry AA interactions. This is in line with Verenikina [24] , which states that peer tutoring between students was more effective if performed among HA students to LA students\nThe INSTAD model has a capable phase of empowering the critical thinking skills of HA and LA students [8] . The most important phase is to divide the students into collaborative groups at the beginning of the learning process. The teacher must be a guarantee that the grouping should not be randomly, but have to consider the academic level of students to optimize the scaffolding process [26] .\nThe Scaffolding process which done by HA students to LA students can provide students to inquiry work, both for students with low and high academic achievements [27] . HA students tend to think critically in order to help LA students reach ZPD. Therefore, grouping should be based not only by the academic achievement, but also the engagement or motivation of students to do scaffolding. Moreover, inquiry process must be guaranteed that it precisely occurs in each cooperative group [8] .\nThe other phase is the inquiry work in a collaborative group. This phase requires students to plan concept construction, constructing, monitoring and evaluating concepts. This process needs an extra effort of teacher to actively check the learning process in all groups. This phase emphasizes the independence of students in teaching and learning activities by determining the planning of constructing concepts that is about the right way to construct it.\nThe fifth phase is team recognition. Team recognition or team rewards can motivate students to to do scaffolding. By being given group-based awards, LA students will be more motivated to get the maximum possible results. Likewise, HA students become more motivated to help LA students get maximum critical thinking skills."}, {"section_title": "V. CONLUSSION", "text": "The INSTAD has more potential than Guided-Inquiry, STAD and conventional teaching towards improving critical thinking skills. High Academic students have higher critical thinking skills than low academic students, but lower academic have more improvement than higher academic ones. The interaction between INSTAD teaching models and high academic achievement students have higher critical thinking skills than other interaction, and interaction between INSTAD and low academic students has equal critical thinking skills level with guided-inquiry in high academic ones. These findings mean that INSTAD more effectively improving critical thinking skills in high and low academic achievement students than guided-inquiry, STAD, and conventional teaching."}]