[{"section_title": "Introduction", "text": "Siltcoos Lake is a large (1280 hectares), shallow (mean depth 3.3 m; maximum depth 6.7 m) lake located on the Central Oregon Coast, just south of Florence and bordered by Dunes City, Oregon. The outflow and water level of Siltcoos Lake is regulated by a dam on the Siltcoos River 4 km upstream from the Pacific. Several permanent streams feed the lake from its 176 square kilometer watershed including Fiddle Creek, Maple Creek, and Woahink Creek, the outflow from Woahink Lake. Much of the watershed is forested and used for timber harvest, residential development, and limited agricultural production. The lake is popular for recreational activities, particularly fishing for wild coastal Coho salmon, rainbow trout, cutthroat trout, largemouth bass, bluegill, crappie, and yellow perch (Buckman 2004). The lake is also the domestic drinking water source for approximately 125 of the 1330 residents of Dunes City and numerous residents outside the city limits within Lane and Douglas Counties (LCOG 2002). During the fall of 2007 a dense bloom of the potentially toxigenic blue-green algal species Anabaena planktonica prompted Dunes City, the South Coast Water District, the Lane County Health Department, and the Oregon Department of Human Services to issue an advisory against usage of Siltcoos Lake water for drinking and other domestic use (DHS 2007). Residents dependent upon Siltcoos Lake were forced to find alternate domestic water sources for a total of 52 days. This incident was part of a long history of water quality problems including dense algal growth and excessive growth of the non-native aquatic macrophytes Brazilian elodea (Egeria densa), parrotsfeather (Myriophyllum aquaticum), and two-leaf water milfoil (Myriophyllum heterophyllum) (Pfauth and Sytsma 2005;Johnson et al. 1985;McHugh 1979). Because of the water quality problems, the Oregon Department of Environmental Quality (DEQ) placed the lake the 303(d) list of impaired water bodies; specifically due to violations of the \"aquatic weeds and algae\" water quality criterion (DEQ 1998;DEQ 2006). Dunes City has acted on water quality concerns for both Siltcoos and Woahink Lakes by issuing a temporary building moratorium (Dunes City 2006a), a septic tank maintenance ordinance (Dunes City 2006b), and an ordinance limiting phosphorus use (Dunes City 2007). Preliminary assessments (Johnson, et al. 1985, LCOG 2002 indicate multiple sources of water quality problems including excess nutrient and/or sediment loading from residential development, poorly functioning on-site septic systems, private forestry and agricultural practices and introductions of non-native aquatic plant species. This report summarizes data collected by Portland State University and project partners between June 2008 and May 2009 to better define water quality conditions within the lake as well as potential nutrient sources. Physical, chemical, and biological data were collected at lake and tributary sites over the one year period. Data were evaluated across sites, depth and the season. The information collected will contribute to total maximum daily load (TMDL) development for the Midcoast Lakes and can be used to identify and prioritize restoration activities in the Siltcoos Lake watershed."}, {"section_title": "Methods", "text": "Details of data collection and analysis methods and data quality are available in the companion Data Quality Report (Sytsma and Miller 2009). Briefly, data was collected at six lake sites and six tributary sites during ten sampling events (Table 1, Figure 1). The timing of data collection was designed to quantify variation in water quality across three time periods: 1. the late summer/early fall period which is most likely to have cyanobacterial blooms based on data collected by Dunes City in 2007 2. the dry summer period leading up to the potential cyanobacterial bloom period 3. and the rainy season during which watershed nutrient and sediment loading are greatest. Six lake sites were monitored during each sample events. Sites were selected to quantify the spatial variation in water quality that could be caused by nutrient inflows from tributaries, and to continue monitoring at sites established by Dunes City and DEQ. Two of the six tributary sites, Fiddle Creek and Woahink Creek, were monitored during each of the ten sampling events. Maple Creek was also monitored during all ten sampling events; however, data was collected from the \"Maple Creek at Canary Road\" site during the first two sampling events and the \"Maple Creek at Train Trestle\" site during the remaining eight sampling events. Two smaller creeks, Lane and Duck Creek, were monitored during the March 2009 sampling event to assess nutrient concentrations during the high flow period.  Data collected included physical, chemical, biological parameters (Table 2). All parameters were monitored at all 6 lake sites with the exception of algal species and macrozooplankton which were monitored at the Kiechle Arm, Fiddle Arm, and Maple Arm sites. Total nitrogen and total phosphorus were measured in stream sites along with temperature, dissolved oxygen, pH, conductivity, and turbidity. Data were graded according to the project's data quality objectives (Sytsma and Miller 2008) and are stored in a Microsoft Access Database. Table 2. Water quality parameters monitored in Siltcoos Lake and tributary streams."}, {"section_title": "Parameter", "text": "Site type Analysis lab Total nitrogen Lake, stream CCAL Nitrate plus nitrite nitrogen Lake CCAL Ammonia nitrogen Lake CCAL Total phosphorus Lake, stream CCAL Soluble reactive phosphorus Lake CCAL Dissolved silica Lake CCAL Dissolved organic carbon Lake CCAL Dissolved color Lake PSU-CLR Alkalinity Lake PSU-CLR Chlorophyll-a Lake PSU-CLR Algal species Lake (3 sites) PSU-CLR Macrozooplankton Lake (3 sites) PSU-CLR Light extinction Lake Field Secchi disc transparency Lake Field Temperature Lake, stream Field Dissolved oxygen Lake, stream Field pH Lake, stream Field Conductivity Lake, stream Field Turbidity Lake, stream Field"}, {"section_title": "Water quality conditions", "text": ""}, {"section_title": "Temperature and stratification", "text": "Water temperature is a fundamental component of water quality as it influences chemical and biological activity rates, equilibrium dissolved gas concentrations, and the suitability of habitat for aquatic organisms. Surface water temperatures in lakes are determined by solar radiation intensity and the heat absorbing qualities of water. Temperatures deeper in a water column are primarily determined by vertical mixing of surface waters by wind energy. If wind energy is not sufficient to mix less dense warm surface water with cooler, denser water deeper in a water column, the water column stratifies into layers separated by a thermocline. A thermocline is generally considered stable where there is a 1˚C change over 1 m depth (Wetzel 1983). Stratification is a very important because density differences prevent the mixing of dissolved gases and nutrients across the themocline. This can result in depletion of dissolved oxygen below the thermocline which leads to the loss of habitat and the release of sediment nutrients. The State of Oregon regulates temperature to protect aquatic life in streams, lakes, and reservoirs. The regulations for temperature in natural lakes (OAR 340-041-0028 (6)) states that: \"Natural lakes may not be warmed by more than 0.3 degrees Celsius (0.5 degrees Fahrenheit) above the natural condition unless a greater increase would not reasonably be expected to adversely affect fish or other aquatic life. Absent a discharge or human modification that would reasonably be expected to increase temperature, DEQ will presume that the ambient temperature of a natural lake is the same as its natural thermal condition.\" Since there are no known discharges or human modifications that are expected to substantially increase temperature in Siltcoos Lake, we presume that temperatures in the lake are the same as the natural thermal condition. Surface water temperatures exceeded 20˚C during the summer and dropped below 10˚C in the winter ( Figure 2). There was less than a 1.4˚C difference in surface water temperature between sites during each sampling event with the greatest spatial differences during mid-summer sampling events. The similarity between sites indicates that surface water temperature monitoring at a single site is sufficient to characterize seasonal changes in temperature for the entire lake. Thermal stratification was detected in Siltcoos Lake during the summer and fall periods. Thermal stratification was measured at the Maple Arm site during the December 2008 and May 2009 sampling events and at the Fiddle Arm site during the May 2009 sampling event. Stratification observed during the winter and spring was likely due to colder, denser water flowing in from Maple and Fiddle Creeks under the warmer surface waters of the lake. Since the Maple Arm site is the most wind protected of all the sites it tended to be the least vertically mixed. No large differences in dissolved oxygen or pH were observed with depth, which also indicates that Siltcoos Lake was well mixed during the survey period. Although no stratification was observed during the summer or fall, there is the potential that an extended period of calm winds could lead to temporary stratification, dissolved oxygen depletion at the sediment interface, and release of nutrients which could fuel further algal growth. "}, {"section_title": "pH and alkalinity", "text": "pH is a measure of the relative strength of acids and bases in a waterbody. When dissolved acids such as tannic, humic, and carbonic acids are stronger than dissolved bases such as carbonates, bicarbonates, and hydroxides; pH will be acidic or less than pH 7. When dissolved bases are stronger than dissolved acids; pH will be alkaline or greater than pH 7. pH is important to water quality because most aquatic organisms require a narrow range in pH for growth, survival, and reproduction. Highly acidic or alkaline waters can also affect nutrient availability and metal toxicity. Alkalinity, a measure of the concentration of dissolved bases in water, is related to pH in two important ways: 1) it determines pH when aqueous carbon dioxide (CO2 (aq)) is saturated with atmospheric carbon dioxide (CO2 (g)) and 2) it buffers pH against changes in CO2 (aq) concentrations. Lower CO2 (aq) concentrations cause higher pH and vice versa. In most lakes, CO2 (aq) is supersaturated with respect to the atmosphere because respiration, which produces CO2 (aq), is greater than photosynthesis, which consumes CO2 (aq). In addition, since photosynthesis only occurs during the day and respiration occurs both day and night, pH will increase during daylight hours and decrease during the nighttime. Daily changes in pH will be greatest in low alkalinity lakes when algal production is high. The cycle is exacerbated during calm weather since rates of equilibration between CO2 in the water and the atmosphere are reduced. Alkalinity in Siltcoos Lake ranged from 15 to 17 mg as CaCO3/L during the summer and fall of 2008 and decreased to 12 mg/L during the winter of 2009 ( Figure 6). There was little variation between sites except during the December 2008 event when alkalinity ranged from 14 to 16 mg/L. Alkalinity concentrations in Siltcoos Lake are low; therefore, the lake has low pH buffering capacity and is very susceptible to high pH during periods of high algal production, especially during calm winds. Equilibrium pH values calculated from atmospheric equilibrium dissolved carbon dioxide concentrations, alkalinity, and temperature (Hofmann et al. 2010) ranged from 7.23 to 7.42. In order to protect aquatic life in Siltcoos Lake and other Mid-Coast waterbodies DEQ requires that pH values remain between 6.5 and 8.5 (OAR 340-041-0225). Surface water pH measured in Siltcoos Lake ranged from 7.03 to 8.27 and did not fall outside the DEQs acceptable pH range (Figure 4). There was very little difference in pH with depth which confirms that the lake was well mixed vertically. The largest deviation from equilibrium pH values occurred during the May 2009 sampling event when surface water pH at the most sites was almost 1 pH unit greater than equilibrium. pH at the \"Near Outlet\" site was close to equilibrium on that date, however. The two likely reasons were that: one, it was the first site monitored on the date, therefore, algal production had less time to raise pH; and two, the site is very exposed to winds which increases the rate of CO2 equilibration with the atmosphere. pH measurements were also conducted at the Kiechle Dock site during eight of the ten sampling events over a minimum of 24 hours and maximum hourly intervals. Variation in pH ranged up to 1.4 pH units during each sampling event ( Figure 5). As was the case at the other 6 sampling sites, the greatest deviation from equilibrium pH and the largest daily variation was observed during the May 2009 sampling event. pH values were highest late each day and lowest early each morning following along with cycles of primary production. pH measurements fell below the pH 6.5 criterion during the October 2008 sampling event and rose above the pH 8.5 criterion during the May 2009 sampling event. Most of the measurements during the sampling events, however, fell within the acceptable pH range. "}, {"section_title": "Dissolved oxygen", "text": "Adequate dissolved oxygen is important for maintaining suitable habitat for aquatic life. Temperature and barometric pressure determine the saturated concentration of dissolved oxygen. Lower temperature and higher barometric pressure result in higher dissolved oxygen concentrations. Deviations from saturated concentrations occur when the production of dissolved oxygen by photosynthesis is out of balance with consumption by algal and bacterial respiration. Since photosynthesis only occurs during the day while respiration occurs around the clock, there are daily cycles of higher dissolved oxygen concentrations late in a day and lower concentrations at early in the morning. Like pH, larger deviations from equilibrium are more likely during calm periods when equilibration rates across the air-water interface are lower. Siltcoos Lake is managed by the Oregon DEQ for \"Cold-Water Aquatic Life\" which requires that: \"…dissolved oxygen may not be less than 8.0 mg/L as an absolute minimum. Where conditions of barometric pressure, altitude, and temperature preclude attainment of the 8.0 mg/L, dissolved oxygen may not be less than 90 percent of saturation. At the discretion of the Department, when the Department determines that adequate information exists, the dissolved oxygen may not fall below 8.0 mg/L as a 30-day mean minimum, 6.5 mg/L as a seven-day minimum mean, and may not fall below 6.0 mg/L as an absolute minimum\" (OAR 340-041-0016 (2)). Surface water dissolved oxygen concentrations in Siltcoos Lake remained above the 8 mg/L criterion during all sampling events at all sites ( Figure 6). Lower concentrations were observed during warmer water conditions as expected. Variation between sites ranged up to 1.5 mg/L per sampling date. As was the case with pH values, some variation was likely due to site specific conditions, and some due to times of measurement. There was little difference in concentrations with depth which confirms that the lake was well mixed. Dissolved oxygen measurements were also conducted over at the Kiechle Dock site during eight of the ten sampling events over a minimum of 24 hours and a maximum of hourly intervals. The range of concentrations during each sampling event was less than 1.5 mg/L except for the early October 2008 event which ranged by nearly 2 mg/L ( Figure 7). Higher concentrations were measured late in each day and lower concentrations were measured early each morning. Concentrations fell below the DEQ criterion during three of the sampling events; however, the median concentrations and less than 25% of the measurements during each event fell below the criteria. Dissolved oxygen saturation also fell below the DEQ criteria of 90% saturation during the three sampling events. Median values were above the criteria, but more than 25% of the measured values were below the criteria. Based on routine dissolved oxygen measurements conducted during the daytime, one would conclude that Siltcoos Lake met the 8.0 mg/L absolute minimum criteria; however this was not the case for nighttime measurements during the three sampling events.  "}, {"section_title": "Water transparency and photic zone", "text": "Water transparency is an important water quality parameter because it determines the amount of light available for photosynthesis in a water column. This depth range, from the surface to approximately 1% of surface light intensity, is called the photic zone. Transparency is determined by the density and size of algal cells, the density of inorganic particles, and dissolved material that impart color to the water. Since transparency in many lakes is most closely related to algal biomass, it is often used as a measure of the trophic status of a lake. Water transparency in Siltcoos Lake was assessed in two ways: one, by measuring Secchi disc transparency; and two, by calculating light extinction coefficients from underwater photosynthetically active radiation (PAR) measurements. Both measures were well correlated with each other in Siltcoos Lake (r=0.84; p<0.001). The photic zone was calculated from Secchi disc and PAR measurements according to Kirk (1994). Fifty-eight percent of the variation in Secchi disc transparency could be explained by chlorophyll-a concentration (p<0.001), a measure of algal biomass (Figure 8). A higher percentage of the variation in Secchi disc transparency could be explained by turbidity (r 2 =0.85, p<0.001), a measure of inorganic particles and algal biomass. Only 16% of the variation in Secchi transparency could be explained by water color (p<0.01). The relationship with dissolved organic carbon, a measure of the light absorbing qualities of water, was not significant (p=0.35). Relationships between the same set of parameters and light extinction coefficient calculations based on PAR measurements were similar, but not as strong as relationships with Secchi transparency. Secchi disc transparency in Siltcoos Lake ranged from less than 1.5 m during late October, 2008, to greater than 2.5 m during June, July, and early August 2008 ( Figure 9). These values are indicative of a mesotrophic to eutrophic lake (Carlson 1977). There was less than 0.5 m variation between sites on sampling dates with the exception of two sampling events. On June 25, 2008, the Secchi transparency at the \"Near Outlet\" site was 1 m shallower than the other sites. This was likely because it was measured during the early morning under low light conditions. Extinction coefficients at the \"Near Outlet\" site were not different than other sites on that date. There was also higher spatial variation during the March 11, 2009, sampling event when greater transparency was observed at the Fiddle and Maple Arm sites than the main lake sites. This may have been due to inflow of clearer water from Fiddle and Maple Creeks during the winter. The photic zone calculated from both Secchi transparency and PAR measurements ranged from less than 4 m to greater than the depth of the lake (Figure 10). Estimates based on Secchi and PAR measurements were similar during the summer and fall periods. During the two winter sampling events, however, estimates based on PAR measurements were less than estimates based on Secchi measurements. "}, {"section_title": "Nutrients", "text": "Algae, cyanobacteria, and other photosynthetic organisms require over 20 elements for growth and survival (Frausto de Silva and Williams 1991). Nitrogen (N), and especially phosphorus (P), are often in shortest supply in relation to demand in lakes; thus their concentrations often limit phytoplankton growth (Schindler et al. 2008;Lewis and Wurtzbaugh 2008). The chemical forms of N and P also play a role in the competition between phytoplankton species in lakes. For example, most algae require N as ammonium (NH4 + ) or nitrate (NO3 -) while some cyanobacteria species can utilize dissolved N gas (N2). This gives cyanobacteria a competitive advantage when NH4 + and NO3concentrations are depleted and P is not limiting. Because of the central role of N and P in regulating algal production and competition in lakes, water quality management is often focused on reducing N and P delivery to lakes from watersheds and sediments. Bio-available and total nutrients were monitored at 6 sites in Siltcoos Lake during 10 sampling events. Total nutrient were also monitored in tributary streams and will be discussed later in the report. The bio-available nutrients monitored were phosphate (PO4 3-) measured as soluble reactive phosphorus, NH4 + , nitrate plus nitrite (NO3 -+ NO2 -) which is nearly all NO3in lakes, and dissolved silica (Si). Si is a nutrient required for building diatoms cell walls and can limit their growth. Total nitrogen (TN) and total phosphorus (TP) concentrations were also monitored which consist of the bio-available N and P forms mentioned above plus N and P absorbed to particles, in biomass, and in dissolved compounds. TN and TP are useful indicators of trophic state since they are often correlated with algal biomass (Smith 1982). Low ratios of TN to TP are indicative of conditions that favor N2-fixing species of cyanobacteria (Smith et al. 1995;Nõges et al. 2008). With the exception of dissolved Si, bio-available nutrient concentrations were near or below lab reporting and detection limits during most sampling events ( Figure 11). Concentrations of NO3 -+ NO2were substantially higher during the winter and spring sampling events; however, concentrations of NH4 + , the most bio-available form of N, remained below lab reporting limits during the survey period. Higher concentrations of NO3 -+ NO2were measured in the Fiddle Arm site than other sites during the two winters sampling events. This indicates that either there was higher bio-available nitrogen loading from Fiddle Creek than other creeks, or that there was less demand for nitrogen in Fiddle Arm. SRP concentrations were only greater than lab reporting limits during the two winter sampling events. Since bioavailable N and P concentrations were below or near lab reporting limits, we can infer they were in high demand at all sampling sites through the year. Si concentrations increased steadily through the summer and winter followed by a decrease in the spring. The increase indicates that demand by diatoms was less than the supply from inflows and remineralization within the lake. The decrease observed during the spring is consistent with higher demand when diatoms were able to compete with other types of phytoplankton for N and P. In addition, the slower increase in Si concentrations at the Fiddle Arm site during the summer suggests that diatoms may have been able to compete with other algae for a longer period of time than at other sites, possibly due to higher loading of N and P at the Fiddle Arm site. Concentrations of dissolved Si were higher an order of magnitude higher than concentrations shown to limit diatom growth (Welch and Jacoby 2004). TN and TP concentrations followed a similar seasonal pattern as Si concentrations: an increase through the summer and winter followed by a decrease in the spring (Figure 12). TP concentrations in Siltcoos Lake throughout most of the survey period were consistent with a eutrophic lake (Carlson 1977). Concentrations of TN and TP were higher at the Fiddle Arm site than other sites throughout much of the summer period which indicates that there was either a higher nutrient load or that water currents concentrated algae in Fiddle Arm. TN:TP ratios ranged between 10:1 and 20:1 by weight during the summer and fall and up to 25:1 during the winter (Figure 12). N2-fixing cyanobacteria species such as Anabaena spp. and Aphanzomenon flos-aquae are thought to be more common in lakes with N:P values less than 30:1 (Nõges et al. 2008) or 22:1 (Smith et al. 1995).  "}, {"section_title": "Phytoplankton biomass", "text": "Phytoplankton are a diverse set of photosynthetic organisms that inhabit the water column of lakes and oceans. The most common groups of phytoplankton in lakes are diatoms (Bacillariophyceae), green algae (Chlorophyta), golden algae (Chrysophyceae), cryptophytes (Cryptophyceae), dinoflagellates (Dinophyceae) and blue-green algae (Cyanobacteria). Although cyanobacteria are technically bacteria, they function like algae since they can photosynthesize in oxygenated water (Wetzel 1983). Phytoplankton are an integral part of the food base that supports aquatic life in lakes; however, excess biomass and undesirable species can create water quality problems. For instance, high primary production can lead to pH and dissolved oxygen problems. In addition, some cyanobacteria species are capable of producing toxins. Phytoplankton biomass and species composition are determined by many factors including nutrient supplies, light, temperature, and predation pressure. Although the relationships between these factors are complex, high nutrient supplies are required to support high algal biomass and most undesirable algal species (Wetzel 1983). Phytoplankton biomass, measured as chlorophyll-a, was assessed in surface water samples collected at the six routine Siltcoos Lake sites. Chlorophyll-a is a photosynthetic pigment common to all phytoplankton and provides a reasonable and easily measured estimate of phytoplankton biomass. The State of Oregon's criterion for \"Nuisance Phytoplankton Growth\" is based on chlorophyll-a and states that in natural lakes that don't stratify, concentrations shall not exceed 15 µg/L in a minimum of three samples over three consecutive months (OAR 340-041-0019). Chlorophyll-a concentrations ranged from less than 5 µg/L during June and July of 2008 to greater than to greater than 35 µg/L during late October, 2008 ( Figure 13). These concentrations clearly indicate eutrophic conditions during six of the ten sampling events (Carlson 1977). Concentrations exceeded Oregon's 15 µg/L criterion on several dates at several sites; however, concentrations only remained above the criterion for three consecutive samples at the Fiddle Arm site, and for slightly less than three months (83 days). The Fiddle Arm site tended to have higher chlorophyll-a concentrations which indicates that there may have been elevated nutrient supplies from Fiddle Creek. Lake-wide average chlorophyll-a concentrations were not significantly related to TN or TP when using data from all sampling dates; however, when the two winter dates were excluded, TN explained 96% of the variation in chlorophyll-a (p<0.001) and TP explained 66% of the variation (p<0.05) ( Figure 14). The exceptionally strong relationship between TN and chlorophyll-a indicates that phytoplankton in Siltcoos Lake were limited by N concentrations during much of the year. This observation is consistent with inferences derived from TN:TP ratios and the presence of N2 fixing cyanobacteria. It is important to note that although N appears to be the limiting algal production, N mitigation alone will not decrease algal biomass because cyanobacteria have the endless supply of N2 gas from the atmosphere (Schindler et al. 2008;Lewis and Wurtzbaugh 2008). To improve water quality conditions in Siltcoos Lake, P loading must be reduced to the level where P is limiting algal production. "}, {"section_title": "Phytoplankton species composition", "text": "Phytoplankton species composition was assessed in surface water samples collected from the Kiechle Arm, Maple Arm, and Fiddle Arm sites. Phytoplankton were identified to genus when possible at 200 and 400X magnification. Natural units were counted in at least ten random fields of view with at 200X magnification. Individual cells were counted for the colonial species Dinobryon, Asterionella, and Fragillaria. Individual vegetative cells, heterocysts, and akinetes were counted in Anabaena sp. natural units (filaments). A minimum of 41 natural units and 144 cells were counted in each sample. Aphanizomenon flos aquae vegetative cell counts were estimated from counts of natural units (filaments) based on a relationship of 19 vegetative cells per filament observed by Aquatic Analysts in the December 2008 samples. Large seasonal changes in phytoplankton cell densities were observed during the survey period ( Figure 15). Densities were highest during the late summer and fall, and again during the spring. There were substantial differences in cell densities between sites with higher densities at the Fiddle Arm site during late summer and fall sampling events and higher densities at the Kiechle Arm site during the December 2008 sampling event. These patterns in cell counts are consistent with seasonal and spatial patterns in chlorophyll-a concentrations. One possible explanation for this observation is that the buoyant algae that were common during this period were concentrated in the southern part of the lake by prevailing wind patterns. Winds along the Central Oregon Coast are consistently from the north during the summer and early fall and from the south during the winter (Knight and Burningham 2003). Higher nutrient loading to the Fiddle Arm could also explain the variation between sites. Cyanobacteria, diatoms, green algae, dinoflagellates, Chrysophtes, and unidentified flagellates were present in the Siltcoos Lake samples (Figure 16). Cyanobacteria constituted over 80% of the cell counts during five of the ten sampling events at all three sites. Unidentified flagellates were the next most abundant group of algae and constituted a large percentage of community during the two winter sampling events. Although the flagellates were not positively identified to species, they likely consisted of the Crytophyte species Rhodomonas minuta and Cryptomonas sp. Chrysophytes, primarily Dinobryon sertularia and D. bavaricum, made up most of the remainder of the phytoplankton community. Five species of cyanobacteria were common in Siltcoos Lake: three species of Anabaena, Aphanizomenon flos aquae, and Gloeotrichia echinulata. Although the three Anabaena species were not identified to species, they were morphologically similar to A. planktonica, A. flos aquae, and A. circinalis. Large Gloeotrichia echinulata colonies (up to 2 mm in diameter) were observed in the field during the summer of 2008, however, few were observed in the phytoplankton samples. This may have been because large colonies are less likely to be encountered in random fields of view at high magnification. Anabaena sp. and Aphanizomenon flos aquae colonies can also be large, but disperse into individual filaments upon preservation. "}, {"section_title": "Kiechle Arm", "text": "There are two important aspects of all cyanobacteria species abundant in Siltcoos Lake: they are capable of utilizing N2 gas and they are capable of producing toxins. The former is important because it indicates that N is less available than P for algal growth; the latter is important for human health. To protect human health, the Oregon Department of Human Services (DHS) recommends posting a health advisory if total toxigenic cyanobacteria cells densities equal or exceed 100,000 cells/mL, or if scums containing toxigenic cyanobacteria are observed (DHS 2009). Anabaena sp. cell densities never exceeded 27,000 cells/mL during the survey period (Figure 17). Although Aphanizomenon flos aquae cells were not enumerated by PSU, Aquatic Analysts Inc. counted 12,060 A. flos aquae cells/mL and 635 filaments/mL in a composite sample collected from the Fiddle, Maple, and Kiechle Arm samples on December 10, 2008. If we apply Aquatic Analysts observed 19:1 ratio between A. flos aquae cells and A. flos aquae filaments to filament counts by PSU (Figure 17), A. flos aquae cell counts never exceeded 16,600 cells/mL during the course of the survey. Microcystis sp. and Planktothrix sp. are cyanobacterial species that are more likely to be toxic than other cyanobacteria, therefore DHS recommends posting at a cell count of 20,000/mL. Microcystis sp. was likely present in the May 2009 samples at low densities; however, intact colonies were not observed and the small individual cells were not positively identified. "}, {"section_title": "Marozooplankton abundance and composition", "text": "Zooplankton are small animals that live at least part of their life in the open water of lakes or oceans. Most lake zooplankton belong to one of three groups: cladocerans, copepods, and rotifers. They are all important components of a lakes food web in that they consume phytoplankton, bacteria, and detritus, and are consumed by zooplanktivorous fish and larger zooplankton. In some lakes, zooplankton are tightly coupled into a food chain with piscivorous fish at the top and nutrients at the bottom. Diamond Lake in the Central Oregon Cascades is a classic example of such a lake in which the removal of zooplanktivorous fish lead to an increase in large zooplankton, a decrease in phytoplankton, and improvement in water quality (Eilers et al.). This tight control from higher trophic levels down to phytoplankton (top-down control) is not always the case, however (Brett and Goldman 1996). Phytoplankton biomass and production are often more closely related to nutrient supply (bottom-up control) than zooplankton predation. The degree of coupling at the interface between zooplankton and phytoplankton trophic levels is often hard to predict; however when food quality for herbaceous zooplankton is low, trophic coupling is low (Danielsdottir et al. 2007). Since much of the phytoplankton population in Siltcoos Lake consisted of low food quality large filamentous, potentially toxigenic cyanobacteria; control of phytoplankton biomass and production by zooplankton is not probable. Nevertheless, zooplankton populations in Siltcoos Lake can give indications of the ability to support zooplanktivorous fish populations. Zooplankton samples were collected from the Kiechle Arm, Maple Arm, and Fiddle Arm sites by towing a 64-µm mesh 20-cm diameter Wisconsin style plankton net from 1 m above the sediment to the surface. Samples were not collected from the Fiddle Arm site during the 6/25/08 sampling event. Cladocerans were identified to genus or species and counted. Copepods were identified and counted to order. Rotifers were not identified or counted. Lengths of the first ten adult cladocerans or copepods encountered in each sample were measured. Daphnia sp. and Bosmina longirostris were the most common cladoceran species encountered. At least two species of Daphnia were encountered: a species with a pointed head and species with a round head. The round-headed species ranged to greater than 1.4 mm in length and tended to be slightly longer than the pointed head species (Figure 18). Rarely encountered cladoderan species included Holopedium sp., and Diaphanasoma sp., and the zooplanktivorous Leptadora sp. Calanoid copepods, cyclopoid copepods, and immature copepod nauplii were also encountered. Calanoid copepods were highly variable in size and ranged up to more than 1.2 mm in length. Cyclopoid copepods were considerably smaller than the calanoids. Copepods, primarily small copepod nauplii, constituted over 90% of zooplankton abundance during the July through October 2008 sampling events and over 50% of the abundance during the June 2008 and May 2009 events (Figure 19). Cladocerans were only abundant during the December 2008 and March 2009 sampling events. Similar seasonal patterns were observed at the three sites; however, Bosmina longirostris constituted a larger percentage of the count at the Maple and Fiddle Arm sites than the Kichle Arm site. Total macrozooplankton density did not exhibit a clear pattern across the seasons; however, cladoceran density was substantially higher during the winter and spring (Figure 20). In addition, total zooplankton, cladoceran, and copepod density tended to be higher at the Maple Arm site than the other two sites. One possible explanation is that the Maple Arm site is the closest to macrophyte beds which can serve as refugia from fish predation. Without fish grazing estimates, we cannot tell if the lack of cladocerans during the summer and fall was due to consumption by fish or due to a lack of a high quality food source. However, given the high proportion of low quality algae (filamentous, toxigenic cyaonbacteria), the probability of trophic-decoupling at the zooplankton phytoplankton interface is high, which suggests that the likelihood of success of fisheries biomanipulation to reduce phytoplankton would be low.  "}, {"section_title": "Nutrient sources and loading", "text": "Nutrients are supplied to lakes from watershed, lakeshore, and internal sources. Watershed nutrient sources include runoff from agriculture and forestry practices, residential development, and soil weathering. Nearshore sources include poorly functioning on-site septic systems, residential fertilizers, and nearshore development. Internal nutrient sources include sediment resuspension, sediment nutrient mobiliziation, and biological uptake from sediments. There are two primary components that are necessary to measure and model nutrient loading rates from tributaries to a lake: flow and concentration. TN and TP concentrations were measured in the main tributaries to Siltcoos Lake over the course of the study; however, flow was not measured. As a result, nutrient loading rates from tributaries to Siltcoos Lake cannot be calculated from the available data. There is sufficient data from similar watersheds and septic systems, however, to derive rough loading estimates that highlight the relative importance of different nutrient sources. This discussion will cover nutrient concentrations measured in Siltcoos Lake tributaries, nutrient loading rates from tributaries based on estimated for the nearby Tenmile Lakes tributaries, and septic loading based on population and literature estimates. Internal nutrient loading rates will be discussed."}, {"section_title": "Tributary nutrient concentrations", "text": "TN and TP were monitored in Siltcoos Lake tributaries during ten events. Although flow was not consistently measured during the survey period, water level in Fiddle Creek was monitored at half hour intervals between 10/22/08 through 5/12/09 to determine whether samples were collected during high or low flows, and during increasing or decreasing water levels ( Figure 21). We assumed that seasonal changes in the flows in the other tributaries followed the same general patterns as in Fiddle Creek. The water level monitoring period corresponded to the last four sampling events. Nutrient samples collected during the unmonitored period were assumed to be collected during baseflow, or near baseflow conditions. The December 2008, March 2009, and May 2009 sampling events occurred during declining hydrographs and at considerably lower water levels than during peaks. Since these samples were collected during declining water levels, they may underestimate wintertime concentrations during storm events. Nutrient concentrations in Fiddle and Maple Creeks were similar across the monitoring period ( Figure 22). TN concentrations were higher during the winter while TP concentrations were higher during the summer. Concentrations of both nutrients were considerably lower in Woahink Creek than Fiddle and Maple Creeks over the entire time period. TN and TP were also monitored in Duck and Lane Creeks during the March, 2009 sampling event. Lane Creek, which flows into Siltcoos Lake from the east, had nutrient concentrations similar to Fiddle and Maple Creeks. Lane Creek, which flows into Siltcoos Lake from the west, had lower nutrient similar to Woahink Creek. "}, {"section_title": "Nutrient loading from the watershed", "text": "Nutrient export rates from watersheds are determined by many factors including watershed size, slope, soils, vegetation, land use, stream channel morphology, and weather. Siltcoos Lake's watershed is 16,359 ha (63.2 mi 2 ) excluding the surface area of Siltcoos and Woahink Lakes. Approximately 10% of the land area is within the Woahink Creek subwatershed ( Figure  23Error! Reference source not found.). Over 90% of the land cover in the watershed was forested in 2006 according to the NOAA Coastal Change Analysis Program (CCAP) ( Table 3). The CCAP program estimates land cover according to 24 cover classes based on 30-m resolution satellite imagery (NOAA 1984 within the Woahink Creek watershed was developed according to the CCAP land classification scheme. The remainder of land area, less than 5%, consisted of wetlands and barren land. Models such as EPA's Better Assessment Science Integrating Point and Nonpoint Sources (BASINS) model and USDA's Soil and Water Assessment Tool (SWAT) model use these watershed characteristics and others to describe and predict nutrient export rates from watersheds. Sufficient data, particularly flow data, is not available to develop and calibrate these types of models for Siltcoos Lake's watershed. We therefore applied areal loading rates developed by the Oregon DEQ for the Tenmile Lakes Watershed to obtain a general idea of TP loading rates to Siltcoos Lake. We focused on TP loading rates to Siltcoos Lake because TP load reduction rather than TN loading reduction are necessary to improve water quality in Siltcoos Lake (see the discussion in the Phytoplankton Biomass section of this report). The Tenmile Lakes watershed is approximately 30 km south of Siltcoos Lake and has similar topography, land cover, land use, and climate as the Siltcoos Lake watershed. DEQ developed the loading rates using the SWAT model and calibrated the model using extensive flow and nutrient concentration data collected in three subwatersheds over 4 years (DEQ 2007). Annual loading rates normalized by watershed area ranged from 0.45 kg TP/ha/yr for the Murphy Creek watershed to 1.82 kg TP/ha/yr for the Benson Creek watershed and 2.30 kg TP/ha/yr for the Big Creek watershed. This large difference in TP export rates between Murphy Creek and the other two watersheds is thought to be due to the extensive wetlands present along the lower 2.5 km of Murphy Creek (DEQ 2007). The other two creeks have been channelized and therefore lack extensive wetlands. Channelization increases the quantity and rate of sediment and nutrient export from a watershed. Nutrients can move from septic tanks into ground and surface water via two primary pathways: via drainfield leachate from properly functioning septic systems and via overcharge from failing septic systems. Phosphorus loads from properly functioning systems are generally negligible since phosphorus is bound to soil particles below drainfields while nitrogen loads can be significant since nitrogen remains mobile in the soil (Alhajjar et al. 1989). The most significant pathway for loading from septic systems into ground and surface waters is failing septic systems (EPA 2007). Failure rates in the US typically range from one to five percent per year, but can be higher in certain areas (De Walle, 1981)."}, {"section_title": "NOAA Coastal Change Analysis Program landcover types", "text": "Onsite septic tanks are the primary source of sewage treatment for more than 1500 people within the Siltcoos Lake watershed. Given the assumption that all septic tank effluent that reaches surface water is due to septic tank failure, a rough estimate of nutrient loading from septic tanks to the Siltcoos Lake watershed was calculated from the number of septic tanks within a watershed, the number of persons per septic system, the septic system failure rate, and per capita nutrient loading from failing septic systems (EPA 2007). Values and data sources are summarized in Table 5. Although there is considerable uncertainty in each of the factors and consequently the nutrient loading estimates, comparisons with estimates of nutrient loading from watershed runoff are useful for targeting nutrient reduction strategies. Since complete, spatially referenced data on septic systems are not available, we used site address data to estimate the spatial distribution of septic systems. We assumed one septic system per site address. Dwellings within the Siltcoos Lake watershed are concentrated in the Woahink Lake subwatershed and northern shoreline of Siltcoos Lake (Figure 24). Fifty-five percent of the house addresses lie within the Woahink Lake sub-watershed. The remainder of houses and septic systems are scattered along the shores of Siltcoos Lake and along Fiddle and Maple Creeks. The estimated annual TP loading rate from the Siltcoos Lake watershed due to failing septic systems ranged from 69 to 344 kg/yr based on failure rates of 1 and 5% (Table 6). Fifty-five percent of the load was contributed by septic tanks within the Woahink Lake watershed. The TP load from failing septic systems to Siltcoos Lake was estimated to be just 1% of the total TP load coming from septic or watershed sources when using the high watershed loading rate based on the Tenmile Lakes tributary of Big Creek (Table 7). Using the lower watershed loading estimates from Murphy Creek, septic systems contributed up to 15% of the total load. Although watershed nutrient loading estimates are more uncertain in the Woahink Lake watershed due to differences with the Tenmile Lake watershed, it is clear that TP loading from septic systems is more important to the TP budget of Woahink Lake than Siltcoos Lake.  "}, {"section_title": "Internal phosphorus loading", "text": "Some of the phosphorus delivered to a lake basin comes in a form unavailable for phytoplankton growth or is more than needed for phytoplankton growth at the time of delivery. This excess phosphorus is either flushed out of a lake or deposited in sediments. Although there is a net flux of phosphorus to lake sediments on an annual basis, the pool of phosphorus stored in sediments can become available for phytoplankton growth under certain conditions. This pathway of phosphorus delivery to the water column is called internal loading and can be a large part of the load. In shallow unstratified lakes like Siltcoos there are several pathways in which phosphorus can be delivered from the sediments into the water column (Welch and Jacoby 2004):  Dissolution of iron and aluminum bound phosphorus at high pH during high photosynthetic activity  Dissolution of bound phosphorus during calm weather periods when the sediment-water interface is anoxic  Mineralization of organic phosphorus to dissolved phosphorus by bacteria  Resuspension of sediment particles by wind resulting in desorption of phosphorus from the particles due to a high concentration gradient between the particles and water or due to high pH In addition, macrophytes can act as a phosphorus pump to the water column through uptake from the sediments and release during decomposition, although most phosphorus is translocated back into roots. Another internal phosphorus loading pathway is via akinete forming cyanobacteria species (Hense and Beckmann 2006). Akinetes are resting spores that form when conditions are unfavorable for growth. Akinetes sink to the sediment for months to decades until conditions are favorable for growth. These cells are not completely dormant, however, and can take up and store phosphorus for later growth in the water column. The three most abundant cyanobacterial species observed in Siltcoos Lake during 2008 and 2009, Anabaena sp., Aphanizomenon flos aquae, and Gloeotrichia echinulata are all akinete forming species. All of these internal phosphorus loading rates to Siltcoos Lake are not known and would be very difficult to estimate. It is possible, however, that internal loading rates may be sufficient to delay improvement of water quality if external loading sources were reduced."}]