[{"section_title": "", "text": "(Regional Aquifer-System Analysis) (U.S. Geological Survey professional paper ; 1400-A) Bibliography: p. 1. High Plains Aquifer.\nI. Weeks, John B. II. Series. III. Series: Geological Survey professional paper; 1400-A. GB1199.3.H53S86 1988 For sale by the Books and Open-File Reports Section, U.S. Geological Survey Federal Center, Box 25425, Denver, CO 80225"}, {"section_title": "PREFACE", "text": "The Regional Aquifer-System Analysis of the High Plains was conducted by U.S. Geological Survey personnel in each of the eight States in the High Plains Colorado, Kansas, Nebraska, New Mexico, Oklahoma, South Dakota, Texas, and Wyoming. To provide assistance, technical support, and additional information, contracts were awarded to the Kansas Geological Survey, New Mexico Natural Resources Department, Oklahoma Water Resources Board, and Texas Department of Water Resources. In addition, valuable information was provided by many other State and local agencies throughout the High Plains. Their contributions are an integral part of this investigation without which this study would not have been possible.\nThe U.S. Geological Survey coordinated its investigation of the High Plains aquifer with a concurrent study by the Economic Development Administration of the Department of Commerce. The Six-State High Plains Ogallala Aquifer Area study conducted by the Economic Development Administration was authorized by Congress in 1976. This study was charged with the responsibility of examining the feasibility of increasing water supplies to insure the economic growth and vitality of the High Plains. Together, these two studies provide a comprehensive evaluation of the High Plains aquifer and the potential impacts of declining ground-water supplies on the region. The Economic Development Administration study has developed and proposed alternative strategies to alleviate or mitigate those impacts and the U.S. Geological Survey has provided hydrologic data and models needed to evaluate the effects of those strategies on the ground-water resource."}, {"section_title": "CONVERSION FACTORS", "text": "The following report uses inch-pound units as the primary system of measurements and metric units for water-chemistry measurements. The units commonly are abbreviated using the notations shown below in parentheses. Inch-pound units can be converted to metric units by multiplying by the factors given in the following list. In 1978, the U.S. Geological Survey initiated a study called the High Plains Regional Aquifer-System Analysis to evaluate the historical and future effects of ground-water development on the High Plains aquifer. Results of this study were published in a series of reports that presented: (1) The geohydrology of the High Plains aquifer, (2) the use of satellite imagery to map irrigated acreage and estimate groundwater use, (3) the use of digital models to simulate ground-water flow in the High Plains aquifer, and (4) the projected effects of future pumpage on the High Plains aquifer. This report summarizes the information presented in the series of reports.\nThe High Plains aquifer underlies 174,000 square miles in parts of Colorado, Kansas, Nebraska, New Mexico, Oklahoma, South Dakota, Texas, and Wyoming. About 20 percent of the irrigated land in the United States is in the High Plains, and about 30 percent of the ground water used for irrigation in the United States is pumped from the High Plains aquifer. During 1980, about 170,000 wells pumped almost 18 million acre-feet of water to irrigate nearly 14 million acres.\nThe High Plains aquifer is a water-table aquifer that consists mainly of near-surface sand and gravel deposits. The Ogallala Formation, which underlies about 80 percent of the High Plains, is the principal geologic unit forming the aquifer. The maximum saturated thickness of the aquifer is about 1,000 feet, and the average saturated thickness is about 200 feet. Ground water generally flows from west to east at an average of about 1 foot per day and discharges naturally to streams and springs, and by evapotranspiration in areas where the water table is near land surface. Precipitation is the principal source of recharge to the aquifer. Estimates of recharge rates range from 0.024 inch per year in parts of Texas to 6 inches per year in areas of dune sand in Kansas and Nebraska.\nDuring 1980, 3.25 billion acre-feet of drainable water was stored in the aquifer. Approximately 65 percent of the water in storage was in Nebraska, and 12 percent was in Texas. New Mexico, the State with the smallest water resource in the High Plains, had only 1.5 percent of the volume of water in storage.\nThe quality of water in the High Plains aquifer generally is suitable for irrigation use but, in many places, the water does not satisfy Environmental Protection Agency drinking-water regulations. Excessive concentrations of dissolved solids, fluoride, chloride, and sulfate occur in parts of the aquifer in all States.\nThe concentration of dissolved solids is 250-500 milligrams per liter in 62 percent of the area of the High Plains aquifer; the concentration exceeds 1,000 milligrams per liter in 3 percent of the area of the aquifer. Generally, dissolved-solids concentrations are lowest in areas covered by sand because recharge is relatively high and the sand contains few highly soluble minerals. In most areas of the High Plains aquifer where the concentration of dissolved solids exceeds 1,000 milligrams per liter, the chemical composition of the water is affected by the underlying bedrock.\nGround-water irrigation in the High Plains began in the late 1800's, but development was sparce until the 1940's. By 1949, about 2 million acres, mostly in the southern High Plains, were irrigated; and during 1980, about 14 million acres were irrigated and more than one-half of the total acreage was in the northern High Plains. Annual pumpage of ground water for irrigation increased from about 4 million acrefeet during 1949 to nearly 18 million acre-feet during 1980.\nPumpage has caused areally extensive water-level declines in the aquifer. As of 1980, water levels had declined more than 10 feet in 50,000 square miles and more than 50 feet in 12,000 square miles from predevelopment levels. Water-level declines of as much as 200 feet had occurred since irrigation started, and the volume of water in storage in the aquifer had decreased by 166 million acre-feet. About 70 percent of the depletion occurred in Texas; about 16 percent of the depletion occurred in Kansas.\nWater-level declines reduce saturated thickness of the aquifer which may affect well yields. The largest decreases in saturated thickness generally occur where the aquifer has been pumped for irrigation the longest. From predevelopment to 1980, saturated thickness of the High Plains aquifer decreased more than 25 percent in 14,000 square miles in parts of Kansas, New Mexico, Oklahoma, and Texas. In the High Plains of Texas where saturated thickness has declined more than 50 percent, the average number of acres irrigated per well decreased from 118 during 1958 to 62 during 1980. This decrease in acres irrigated per well is the result of decreasing well yields caused by declining water levels and decreasing saturated thickness.\nDigital computer models of the High Plains aquifer were used to project aquifer response to estimated future pumpage. The High Plains aquifer system was modeled in three parts the southern, central, and northern High Plains. For each part of the High Plains, separate models were constructed to simulate the system prior to large-scale development for irrigation (predevelopment-period models) and after the beginning of large-scale development (development-period models). Water levels from the predevelopment models were the initial conditions for the development-period models. Likewise, water levels from the development-period models provided the initial conditions for pro jecting future water levels in the High Plains.\nThe models were used to project aquifer response to pumpage to the year 2020. Pumpage was simulated using 5-year averages between 1980 and 2020, and the models were used to calculate future water Al A2 REGIONAL AQUIFER-SYSTEM ANALYSIS levels in the High Plains. Pumpage estimates for three strategies were simulated: (1) The baseline strategy assumed that only existing waterconservation and water-use technology, practices, and public policy would affect future water use; (2) management strategy 1 assumed that future water use would be reduced by voluntary actions; and (2) management strategy 2 assumed that future water use would be further reduced by water-conservation measures imposed by governmental agencies. Simulation of baseline pumpage from the High Plains aquifer showed that, between 1980 and 2020, water-level declines in excess of 100 feet would occur in areas totaling about 15,500 square miles in parts of all States except South Dakota and Wyoming. The maximum 1980-to-2020 water-level decline was projected to be nearly 250 feet in northern Texas.\nTotal pumpage for management strategy 1 was only 3 percent more than that for the baseline strategy. Consequently, simulation of management-strategy-1 pumpage from the High Plains aquifer resulted in water-level declines that were similar to those projected for the baseline strategy.\nSimulation of management-strategy-2 pumpage from the High Plains aquifer resulted in significantly different water levels than those projected for the baseline strategy. Between 1980 and 2020, waterlevel declines for management strategy 2 would exceed 100 feet in 9,100 square miles. The maximum water-level decline projected from 1980 to 2020 was about 180 feet in Kansas.\nThe saturated thickness projected for 2020 was more than 50 feet greater for management strategy 2 than for the baseline strategy in areas that total 1,830 square miles because of the lower water use assumed for management strategy 2. The maximum difference in saturated thickness projected for 2020 between management strategy"}, {"section_title": "INTRODUCTION", "text": "The High Plains aquifer underlies about 174,000 mi2 (see Conversion Factors for definitions of abbreviated units) in parts of eight States Colorado, Kansas, Nebraska, New Mexico, Oklahoma, South Dakota, Texas, and Wyoming. The High Plains aquifer is the shallowest and most abundant source of water in one of the major agricultural areas in the United States. About 20 percent of the irrigated land in the United States is in the High Plains, and about 30 percent of the ground water used for irrigation in the United States is pumped from the High Plains aquifer. During 1980, about 170,000 wells pumped 18 million acre-ft of water from the aquifer to irrigate about 14 million acres.\nThe irrigated agricultural economy of the High Plains is dependent on the aquifer for continued growth and prosperity. However, declining water levels and decreasing well yields threaten the future of ground-water irrigation."}, {"section_title": "HIGH PLAINS REGIONAL AQUIFER-SYSTEM ANALYSIS", "text": "National concern about the economic impact of declining water supplies in the High Plains was responsible for the initiation of this regional study of the High Plains aquifer. This study began in 1978 as one of the first studies within the Regional Aquifer-System Analysis (RASA) program of the U.S. Geological Survey. The purposes of the High Plains RASA were to provide: (1) Hydrologic information needed to evaluate the effects of continued ground-water development, and (2) computer models to predict aquifer response to changes in ground-water development. The results of this study will provide water-resources planners and managers with information needed for groundwater resource management and models of the aquifer capable of evaluating water-management alternatives.\nThe results of the High Plains RASA are summarized in this report, Chapter A of Professional Paper 1400. Chapters B, C, D, and E of Professional Paper 1400 describe the results of the High Plains RASA in detail. Chapter B (Gutentag and others, 1984) presents the geohydrology of the High Plains aquifer including its depositional history and relation to bedrock, the quantity and quality of ground water, and the history of ground-water development. Chapter C (Thelin and Heimes, in press) describes the use of satellite imagery to map irrigated acreage and the use of irrigated acreage to estimate ground-water use. Chapter D (Luckey and others, 1986) discusses the digital models used to simulate ground-water flow in the High Plains aquifer. Chapter E (Luckey and others, in press) projects the effects of future pumpage on the High Plains aquifer for three pumpage scenarios.\nIncluding the five chapters of this Professional Paper, the data, methods, and results of the High Plains RASA are documented in more than 130 publications. These publications were prepared by the U.S. Geological Survey, and its cooperators and contractors, in a joint effort to advance the scientific understanding of the High Plains aquifer. The Selected References section at the end of this report includes these publications."}, {"section_title": "GEOHYDROLOGY", "text": "The first regional study of the High Plains was conducted by the U.S. Geological Survey at the beginning of the twentieth century (Johnson, 1901) . The study provided a reconnaissance of the geographic, physiographic, and hydrologic features of the area. The conclusions of the study pointed to the vast ground-water resources of the area but held little promise for agricultural development of the region because of limited rainfall, high evaporation, and few surface streams.\nSince that time, technological advances have provided the means to recover the ground-water resource."}, {"section_title": "A3", "text": "However, hydrologic studies of the region did not keep pace with ground-water development. Many waterresource studies of small areas such as counties or groups of counties were made, but few studies of larger areas within the High Plains have been made. In fact, prior to the High Plains RASA, only one other regionwide hydrologic study (Lohman, 1953) had been made since the study by Johnson (1901) .\nPrevious studies provided the initial geohydrologic framework for the Regional Aquifer-System Analysis of the High Plains aquifer. Results of previous investigations provided a wealth of information for areas within political boundaries but without continuity across those boundaries. In developing the geohydrologic framework of the High Plains aquifer, this investigation assembled, organized, and assimilated the geohydrologic information available from many previous studies. The principal published sources of information used in the High Plains RASA are listed in the reference section of the appropriate chapter of this Professional Paper."}, {"section_title": "PHYSICAL SETTING", "text": "The High Plains occupies the southern part of the Great Plains physiographic province which lies between the Rocky Mountains on the west and the Central Lowland on the east. The region extends from southern South Dakota to northwestern Texas. The High Plains, which is characterized by flat to gently rolling terrain, is a remnant of a vast plain formed by sediments that were deposited by streams flowing eastward from the Rocky Mountains.\nMost of the High Plains has a middle-latitude dry continental climate with abundant sunshine, moderate precipitation, frequent winds, low humidity, and a high rate of evaporation. Mean annual precipitation increases eastward across the High Plains by about 1 inch every 25 mi, from less than 16 inches in Colorado, New Mexico, and Wyoming to about 28 inches in eastern Nebraska and central Kansas. Normally, about 75 percent of the precipitation falls as rain during the growing season. However, much of the rain results from local thunderstorms, so large variations in rainfall can occur from place to place and year to year.\nPersistent winds and high summer temperatures cause high rates of evaporation. Mean annual evaporation from Class A pans ranges from about 60 inches in northern Nebraska and southern South Dakota to about 105 inches in western Texas and southeastern New Mexico. Because of the large evaporative demand, little precipitation is available to recharge the ground-water system. Except in areas with sandy soils where water can readily percolate down to the water table, most of the water that enters the soil is returned to the atmosphere by evapotranspiration."}, {"section_title": "HYDROGEOLOGIC UNITS", "text": "The High Plains aquifer consists mainly of nearsurface deposits of late Tertiary or Quaternary age described by Gutentag and others (1984) . The principal geological units in the High Plains aquifer are shown in figure 1. The Tertiary rocks include part of the Brule Formation (of the White River Group), Arikaree Group (or Formation), and Ogallala Formation. The Quaternary deposits consist of alluvial, dune-sand, and valleyfill deposits. Except for dune sand in figure 1, the Quaternary deposits are combined and shown only in areas where they do not overlie Tertiary aquifer units. In northern Texas, some Permian collapse structures, filled with Triassic, Jurassic, and Lower Cretaceous rocks that have secondary permeability, are considered part of the High Plains aquifer; however, they are minor and are not shown in figure 1.\nThe Ogallala Formation is the principal geologic unit in the High Plains aquifer and underlies about 134,000 mi2 of the study area ( fig. 1 ). Maximum thickness of the Ogallala is about 700 ft. The Ogallala was deposited by aggrading streams that filled and buried valleys eroded into pre-Ogallala rocks. Braided streams flowed eastward from the mountains and transported rock debris, which was deposited as a heterogeneous sequence of clay, silt, sand, and gravel. Within the Ogallala, zones cemented with calcium carbonate are resistant to weathering and form ledges in outcrops. These ledges form the escarpment that typically marks the boundary of the High Plains. The most distinctive of these layers, the Ogallala cap rock (commonly called caliche or mortar bed), is near the top of the Ogallala Formation. The cap rock underlies large areas in Texas and New Mexico, and may be as thick as 60 ft.\nThe Brule Formation is included in the aquifer in parts of Nebraska, Colorado, and Wyoming. The Brule is mainly a massive siltstone that contains beds of sandstone, volcanic ash, claystone, and fine sand. Maximum thickness of the Brule is about 600 ft. The Brule Formation generally has little permeability. However, in some areas the permeability of the formation has been increased by joints, fractures, and solution openings. In those areas, the Brule Formation is considered part of the aquifer ( fig. 1 ).\nThe Arikaree Group (or Formation) is part of the High Plains aquifer in large areas in Nebraska, South Dakota, and Wyoming ( fig. 1 ). The Arikaree is mainly a finegrained sandstone that contains localized beds of "}, {"section_title": "SUMMARY OF HIGH PLAINS REGIONAL AQUIFER-SYSTEM ANALYSIS", "text": ""}, {"section_title": "A5", "text": "volcanic ash, silty sand, and sandy clay. Maximum thickness of the Arikaree is about 1,000 ft where it is part of the aquifer. Dune-sand deposits, consisting predominantly of very fine to medium wind-blown sand, are part of the High Plains aquifer. Areas covered by dune sand are shown in figure 1. Of the 174,000 mi2 underlain by the High Plains aquifer, about 19 percent is covered by dune sand. The most extensive area of dune sand is in westcentral Nebraska where the deposits cover an area of 20,000 mi2 and have a maximum thickness of about 300 ft. Large areas south of the Arkansas River in Kansas also are covered by dune sand. Throughout the High Plains, dune sands are important recharge areas for the aquifer.\nValley-fill deposits consist of unconsolidated gravel, sand, silt, and clay associated with the most recent cycle of erosion and deposition along present streams. These deposits are as much as 60 ft thick. Saturated valleyfill deposits that overlie Tertiary or Quaternary aquifer deposits are considered part of the High Plains aquifer. The valley-fill deposits and associated streams form stream-aquifer systems that link the High Plains aquifer to surface streams, particularly along the Platte, Republican, and Arkansas Rivers.\nBedrock units in contact with the High Plains aquifer range in age from Permian to Tertiary ( fig. 2 ). Although some bedrock units will yield large quantities of water to wells, the bedrock units generally are much less permeable than the High Plains aquifer. Bedrock of marine origin generally contains evaporite deposits and saline water that affects the quality of water in the overlying aquifer. This is particularly true in areas underlain by Permian bedrock and areas south of the Canadian River underlain by Lower Cretaceous rocks."}, {"section_title": "GROUND-WATER HYDRAULICS", "text": "Ground-water flow and storage are controlled by the hydraulic characteristics of the aquifer. Water flows from areas of recharge to areas of discharge in response to differences in the altitude of the potentiometric surface.\nRecharge to the aquifer, which generally is under water-table conditions, is entirely from precipitation and seepage from streams. Because evapotranspiration demand greatly exceeds precipitation, little or no recharge occurs except in sandy soils with large infiltration rates, high permeability, and low field capacity.\nRecharge rates in the High Plains are highly variable. Estimated recharge rates from previous studies range from 0.024 in./yr (0.1 percent of precipitation) in parts of Texas to 6 in./yr (20 percent of precipitation) in sandy soils in Kansas (Gutentag and others, 1984, table 7) . During this study, recharge to the aquifer was estimated by computer model simulations. The simulated average annual volume of recharge from predevelopment to 1980 was about 5.7 million acre-ft or 0.6 inch over the area of the aquifer. About 80 percent of the recharge occurred in the northern High Plains (north of lat 39° N.) where evapotranspiration is least and dune sands are prevalent.\nHydraulic conductivity and specific yield are the two principal hydraulic characteristics that control groundwater flow in unconfined aquifers. Hydraulic conductivity and specific yield vary both horizontally and vertically according to the variation in sediment types. The hydraulic conductivity of most (68 percent) of the High Plains aquifer is 25-100 ft/d (Gutentag and others, 1984, fig. 10 ), although the value is as high as 300 ft/d for individual lithologic units and averages 60 ft/d. The specific yield of most (76 percent) of the aquifer is 10-20 percent (Gutentag and others, 1984, fig. 11 ), although the value ranges from 3 to 35 percent for individual lithologic units within the aquifer and averages 15 percent.\nIn the High Plains aquifer, water generally flows from west to east in response to the slope of the water table. Based on average values of hydraulic gradient and aquifer characteristics, the velocity of water moving through the aquifer is about 1 ft/d.\nWater from the High Plains aquifer discharges naturally to streams, springs, and seeps, and directly to the atmosphere by evapotranspiration. Streams that originate in the High Plains generally are ephemeral in upstream reaches and perennial where channels are incised to the water table. Ground-water discharge through springs and seeps mainly occurs along the eastern boundary of the High Plains. Ground-water discharge by evapotranspiration is greatest in stream valleys where the water table is near land surface. In the sand hills in Nebraska, evaporation from numerous lakes in hydraulic connection with the aquifer may equal or exceed seepage into streams.\nDuring this study, ground-water discharge from the High Plains aquifer was estimated by computer-model simulations (Luckey and others, 1986) . The simulated average annual ground-water discharge for predevelopment conditions was 2.87 million acre-ft (3,960 ft3/s). About 80 percent of the discharge occurred in the northern High Plains (north of lat 39° N.).\nSaturated thickness of the aquifer is as much as 1,000 ft in west-central Nebraska. During 1980, about 46 percent of the High Plains aquifer had less than 100 ft of saturated thickness, whereas only 5 percent had more than 600 ft of saturated thickness. Significant areas where the saturated thickness of the aquifer was greater figure 3 . Salt dissolution in Permian rocks, which resulted in collapse features that have been filled with younger sediments, has affected the thickness of the High Plains aquifer. Evaporite beds in the Permian rocks underlying the High Plains are susceptible to dissolution by ground water. Sinkholes associated with salt dissolution have formed since Permian time, and collapse structures occur in large areas in southwestern Kansas, western Oklahoma, and northern Texas (areas with more than 200 ft of saturated thickness shown in figure  3 ).\nDrainable water in storage in the High Plains aquifer depends on the thickness and specific yield of the sediments. The variability in the distribution of water in storage can be inferred from the saturated-thickness map shown in figure 3. The total volume of drainable water in storage (product of specific yield, saturated thickness, and area) in the High Plains aquifer in 1980 was estimated to be 3.25 billion acre-ft (Gutentag and others, 1984, table 8) . About 65 percent of the water in storage was in Nebraska, where recharge is greatest because of the presence of dune sands. About 12 percent of the water in storage was in Texas, 10 percent in Kansas, 4 percent in Colorado, 3.5 percent in Oklahoma, 2 percent each in South Dakota and Wyoming, and 1.5 percent in New Mexico."}, {"section_title": "GROUND-WATER QUALITY", "text": "The quality of water in the High Plains aquifer generally is suitable for irrigation use; however, the water does not meet U.S. Environmental Protection Agency (1976, 1977) primary and secondary drinkingwater regulations in many places. Concentrations of sulfate, chloride, selenium, fluoride, nitrate, and dissolved solids in water from the High Plains aquifer exceed the primary and secondary drinking-water regulations at some sites (Krothe and others, 1982; Feder and Krothe, 1981) .\nExcessive fluoride concentrations (greater than 2 mg/L) are a widespread problem in the High Plains aquifer. Fluoride concentrations exceed drinking-water regulations in parts of Colorado, Kansas, Nebraska, New Mexico, Oklahoma, and Texas. Some fluoride in water in the High Plains aquifer is derived from the solution of fluoride minerals in the sand and gravel that make up most of the aquifer. However, excessive concentrations (2-8 mg/L) occur where the aquifer contains volcanic-ash deposits or where it is underlain by Cretaceous (especially Lower Cretaceous) rocks. Fluoride is a concern in drinking water; commonly occurring concentrations of fluoride are not of concern in irrigation water.\nThe High Plains aquifer is the only source of water for irrigation in most of the High Plains. The agricultural economy of the High Plains depends on the availability of large quantities of ground water of suitable quality for irrigation. Excessive concentrations of dissolved solids affect plant growth. Most crops can tolerate water with as much as 500 mg/L dissolved solids without adverse effects; if leaching or drainage is adequate, concentrations of 500-1,500 mg/L are not likely to be harmful (U.S. Salinity Laboratory Staff, 1954) .\nThe concentration of dissolved solids in most (85 percent) of the water in the High Plains aquifer contains less than 500 mg/L. About 27 percent of the volume of water in the aquifer contains less than 250 mg/L dissolved solids. Only 3 percent of the volume of water in the aquifer contains more than 1,000 mg/L dissolved solids. Except in local areas, the concentration of dissolved solids in water from the High Plains aquifer generally is less than 3,000 mg/L.\nThe chemical composition of water in the High Plains aquifer depends on the concentration of dissolved solids. In general, water in the High Plains aquifer that contains less than 250 mg/L dissolved solids is calcium bicarbonate type water. Ground water that contains more than 500 mg/L dissolved solids in this area generally is a mixed type, with calcium, sodium, sulfate, and chloride most prevalent.\nGenerally, dissolved-solids concentrations are least in areas covered by sand, because recharge is relatively high and the sand contains few readily soluble minerals. As shown in figure 4 , water in the High Plains aquifer contains less than 250 mg/L dissolved solids in parts of Colorado, Kansas, Nebraska, and Wyoming. A large part of this area is covered by sandy soils and dune sands ( fig. 1) . In most areas of the High Plains aquifer where the concentration of dissolved solids exceeds 1,000 mg/L (fig. 4) , the chemical composition of the water is affected by the underlying bedrock.\nIn a small area in Colorado, the concentration of dissolved solids in water from the High Plains aquifer exceeds 1,000 mg/L (fig. 4) . In this area, the aquifer is underlain by bedrock that contains gypsum (calcium sulfate). Sulfate is the dominant anion in water from the aquifer. The sulfate probably is derived from the solution of gypsum at the bedrock contact or from bedrock material contained in the aquifer.\nPermian bedrock, which contains salt beds and saline water, underlies the High Plains aquifer in parts of Kansas, Oklahoma, and Texas ( fig. 2) . Water in the aquifer More than 1000 FIGURE 4. Dissolved-solids concentration in water from the High Plains aquifer (modified from Krothe and others, 1982) .\nin these areas typically contains 250-500 mg/L dissolved solids, but concentrations exceed 1,000 mg/L near Permian outcrops in Oklahoma (fig. 4) . Water in the aquifer generally is sodium chloride type, which indicates that saline water from the Permian bedrock is entering the aquifer. The concentration of dissolved solids in water from the High Plains aquifer in northeastern Nebraska exceeds 1,000 mg/L in two small areas (fig 4) . In these areas, the aquifer contains reworked bedrock material of marine origin. The solution of minerals from the reworked bedrock probably affects the concentration of dissolved solids in water from the aquifer.\nPart of the aquifer in the southern High Plains of New Mexico and Texas is underlain by Lower Cretaceous bedrock ( fig. 2 ) deposited in a deep-water marine environment. Water in these rocks is very mineralized. The concentration of dissolved solids in water from parts of the aquifer in the southern High Plains exceeds 1,000 mg/L with unusually large proportions of magnesium, sodium, chloride, and sulfate. This probably is caused by the movement of solutes from the marine bedrock into the aquifer.\nThe concentration of dissolved solids in water from the High Plains aquifer exceeds 1,000 mg/L near outcrops of Late Cretaceous age in southeastern Wyoming (fig. 4) . In this area, the concentration of dissolved solids in water from the bedrock is as large as 1,250 mg/L. Water from the bedrock in this area, which is under artesian pressure, may be moving upward into the High Plains aquifer.\nThe concentration of dissolved solids in water from the High Plains aquifer near streams is affected by irrigation practices. In stream valleys where the water table is near land surface, the salts that accumulate in the soil due to evapotranspiration are dissolved and flushed with irrigation water and transported to the aquifer. As shown in figure 4 , the concentration of dissolved solids in ground water along the Arkansas, Platte, and Republican Rivers generally is 500-1,000 mg/L and exceeds 1,000 mg/L along parts of the South Platte and Arkansas Rivers. These relatively large concentrations are due to irrigation."}, {"section_title": "GROUND-WATER DEVELOPMENT", "text": "The High Plains aquifer is the principal source of water for irrigated agriculture in the region. Rapid development of irrigation in the High Plains in recent years has transformed the area into one of the major agricultural regions of the United States. About 95 percent of all water pumped from the High Plains aquifer is used for irrigation."}, {"section_title": "IRRIGATION PUMPAGE", "text": "Ground-water irrigation in the High Plains began in the late 1800's with the use of windmills. However, ground-water development was sporadic until the drought of the 1930's. Spurred by the drought, technological advances in well drilling and pumping plants, low-cost energy, favorable crop prices, and available financing, ground-water irrigation developed rapidly after the 1930's. By 1949, about 2 million acres, mostly in the southern High Plains, were irrigated.\nDuring the 1950's, irrigation development was spurred again by severe drought. In addition, development of natural-gas fields underlying the High Plains made inexpensive energy readily available, and irrigation development spread throughout large parts of the High Plains. Prior to the 1960's, most irrigation wells were drilled in areas where the water table was less than 100 ft below land surface. Since the early 1960's, development of efficient turbine pumps has allowed areas with deeper water to be developed.\nDuring the 1960's, development of center-pivot irrigation systems, which were adaptable to sandy soils and rolling terrain, made land available for irrigation that previously was not suitable. This resulted in a large increase in irrigated acreage in the northern part of the High Plains. During 1980, about 14 million acres were irrigated in the High Plains of which more than 5 million acres were in Nebraska.\nHistorical information on ground-water pumpage for irrigation was needed to calibrate computer models of the High Plains aquifer. Data on ground-water pumpage were not available for the entire High Plains from predevelopment to 1980. Therefore, ground-water pumpage was estimated from irrigated acreage, irrigation demand, and irrigation-system efficiency. Irrigation demand is the amount of irrigation water, in addition to precipitation, required by an individual crop growing in a given area. Ground-water pumpage was estimated by dividing irrigation demand (in feet) by efficiency of the irrigation systems (dimensionless), and multiplying by irrigated area (acres).\nEstimates of irrigated acreage were obtained from the Census of Agriculture (U.S. Department of Commerce, 1949-78) which provided data on irrigated acreage by crop type. Irrigation demand was calculated from consumptive-use formulas for all irrigated crops grown in a given area, based on average climatic conditions (Heimes and Luckey, 1982) . The Blaney-Criddle formula (U.S. Department of Agriculture, 1967) was used to estimate irrigation demand on the High Plains because: (1) This formula was developed for semiarid areas, (2) climatic data for the formula commonly are available, and (3) data on crop growth-stage coefficients used in the formula are readily available."}, {"section_title": "SUMMARY OF HIGH PLAINS REGIONAL AQUIFER-SYSTEM ANALYSIS All", "text": "Irrigated acreage in the High Plains, based on Census of Agriculture data from 1949-78, is shown in figure  5 . The graph shows that the rate of growth of irrigated acreage has decreased in some parts of the High Plains and increased in other areas. In Texas, irrigated acreage increased rapidly until 1959, but there was little change between 1959 and 1978. This is primarily the result of declining water availability in the southern High Plains of Texas. In contrast to Texas, irrigated acreage in Nebraska increased slowly during the early years and rapidly during later years primarily because of technological advances and the availability of large quantities of ground water. The total acreage irrigated by ground water in the High Plains increased from slightly more than 2 million acres in 1949 to about 13 million acres in 1978. This rapid increase in irrigated acreage in the High Plains has resulted in a corresponding increase in ground-water pumpage.\nGround-water pumpage in the High Plains, estimated for 1949-78, is shown in figure 6 . An average irrigation system efficiency of 65 percent was assumed for the calculation of pumpage presented in figure 6. System efficiency generally ranges from about 40 to 90 percent and depends on many factors, such as type of irrigation system, crop type, soil, and climate. A dramatic increase in pumpage during the 30 years is shown by figure 6 . During 1978, estimated pumpage from the High Plains aquifer for irrigation was about 23 million acre-ft which is almost 20 million acre-ft more than the estimated pumpage for irrigation during 1949."}, {"section_title": "WATER USE", "text": "Calculations based on irrigation demand and irrigated acreage give reasonable estimates of ground-water pumpage, but changes in irrigation techniques caused by increased energy costs and decreasing water availabililty are likely to decrease the accuracy of estimates of ground-water pumpage based on this approach. Consequently, a sampling program was designed to provide an estimate of ground-water pumpage for irrigation during 1980 based on measured data. A pilot program was conducted in 1979 to test methods and instrumentation (Luckey, Heimes, and Gaggiani, 1980) to be used during the 1980 pumpage-sampling program.\nThe 1979 ' -\\ 1949 1954 1959 1964 1969 1974 1978 1949 1954 1959 1964 1969 1974 1978 FIGURE 5. Acreage irrigated by ground water in the High Plains, 1949-78. "}, {"section_title": "A12", "text": "REGIONAL AQUIFER-SYSTEM ANALYSIS a statistical approach to sample ground-water pumpage for irrigation, (2) test instrumentation and develop procedures for measuring the annual volume of ground water pumped from selected irrigation wells, (3) determine the relation between the annual volume of ground water pumped and the acreage irrigated, and (4) develop a suitable approach to map irrigated cropland for the entire High Plains in order to extend the sample. For the 1979 pilot program, 250 sites were monitored and the annual volume of ground water pumped at each site was determined. Irrigated cropland maps were required to estimate the volume of water pumped, and several approaches to mapping irrigated cropland were evaluated. Landsat imagery proved to be the most efficient and least costly approach for mapping irrigated cropland in the High Plains . For 1980, monitoring sites were randomly selected in 15 counties. Discharge, time-of-operation of wells, croptype, and crop-acreage data were collected at each of the sites during the 1980 growing season. These data were used to determine the average depth of irrigation water applied (application) at each site and to evaluate the effects of climate, water availability, crop types, and irrigation-system types on application. The relations between irrigation demands (calculated using the Blaney-Criddle formula) and measured applications were used to estimate the applications in unsampled areas of the High Plains. Estimates of application were combined with 1980 irrigated-acreage data mapped from Landsat imagery (Thelin and Heimes, in press ) to calculate the volume of water pumped during the 1980 growing season in the High Plains (Heimes and Luckey, 1983) .\nThe estimated volume of ground water pumped for irrigation in the High Plains is summarized by State in table 1. The estimated total volume pumped during 1980 in the High Plains was 17,817,000 acre-ft applied to 13,385,000 acres. Three States (Kansas, Nebraska, and Texas) accounted for about 88 percent of this pumpage. Texas, with 29 percent of total pumpage, was the most developed area in the High Plains. South Dakota, with only 0.1 percent of the pumpage, virtually was undeveloped.\nThe estimated 1980 pumpage is 75 percent of the 1978 pumpage estimated from irrigation demand, irrigation efficiency, and Census of Agriculture irrigated acreage. Although there is a difference in dates, the irrigated acreage estimates are within 5 percent. If the two pumpage estimates should be about equal, the efficiency used in the 1978 estimate (65 percent) would have to be 87 percent which is large compared to published efficiency estimates (U.S. Department of Agriculture, 1976) . The authors consider the sampling approach used to estimate pumpage to be more accurate than that based on irrigation demand and efficiency because of uncertainties in calculating irrigation demand and estimating "}, {"section_title": "EFFECTS OF DEVELOPMENT", "text": "Irrigation demand for crops grown in the High Plains generally is much larger than recharge from precipitation. Estimates of natural recharge range from 0.024 in./yr in parts of the southern High Plains of Texas to 6 in./yr in sand-dune areas in Kansas. Irrigation demand for most crops commonly grown in the High Plains is more than 1 ft per year, with the greatest demands occurring in the southern part and the least demands occurring in the northeastern part. The ratio between irrigation demand and recharge to the aquifer could be as small as 2 in areas with large recharge rates or more than 100 in areas with small recharge rates. Consequently, pumpage for irrigation in large areas of the High Plains greatly exceeds the rate of natural replenishment. Any long-term withdrawal of water from the aquifer that greatly exceeds the recharge rate will result in long-term declines in water level and decreases in saturated thickness."}, {"section_title": "WATER-LEVEL CHANGES", "text": "Water levels have declined since widespread irrigation development began. The date when significant irrigation development began varies within the High Plains. In general, predevelopment conditions ended about 1940 south of the Canadian River, 1950 North of the Canadian River, water-level declines exceeding 50 ft occurred in northern Texas, western Oklahoma, and southwestern Kansas. Large areas of water-level decline also occurred in eastern Colorado, northwestern Kansas, and southern Nebraska. Declines in these areas were less severe, primarily because irrigation development started later.\nWater-level rises in Nebraska ( fig. 7 ) are due to recharge from surface-water irrigation and leakage from canals and reservoirs. In Kansas and Oklahoma, waterlevel rises probably represent recovery from abnormally low water levels during the drought of 1933-40. In Texas, water-level rises are attributed to clearing sandy soils of native vegetation for cultivation, which increased the rate of recharge from precipitation. Significant declines in water levels (more than 10 ft) occurred in 29 percent of the area of the High Plains aquifer, and significant rises in water level (more than 10 ft) occurred in only 1 percent of the area. A total of 50,000 mi2 (32 million acres) of the aquifer had waterlevel declines in excess of 10 ft, and more than 12,000 mi2 (7.7 million acres) had water-level declines in excess of 50 ft."}, {"section_title": "SATURATED-THICKNESS CHANGES", "text": "Saturated-thickness changes (in percent) that occurred from predevelopment to 1980 in the High Plains aquifer are shown in figure 8. Significant (more than 10 percent) increases in saturated thickness, mostly in Nebraska, occurred in only 1 percent of the area, or about 1,700 mi2 (1.1 million acres). Significant (more than 10 percent) decreases in saturated thickness occurred in 25 percent of the area, or about 44,000 mi2 (28 million acres); saturated thickness decreased more than 25 percent in 14,000 mi2 (9 million acres). About 166 million acre-ft of water was removed from aquifer storage from predevelopment to 1980. About 16 percent of the depletion occurred in Kansas and 70 percent occurred in Texas. No significant changes in saturated thickness of the High Plains aquifer occurred in South Dakota or Wyoming.\nIncreases in saturated thickness occurred in Nebraska and Texas ( fig. 8 ). In Nebraska, recharge to the High Plains aquifer from surface-water irrigation and leakage from canals and reservoirs has increased saturated thickness in two areas. In Texas, the increase in saturated thickness was the result of increased recharge caused by clearing sandy soils of native vegetation.\nAreas of significant decreases in saturated thickness generally occurred where the aquifer has been pumped for irrigation for a long time. Large-scale irrigation development began in the southern High Plains of New Mexico and Texas about 1940. As of 1980, saturated thickness had decreased more than 25 percent in more than one-quarter of the High Plains of New Mexico and Texas. Saturated thickness also had decreased more than 25 percent in parts of Kansas and Oklahoma where large-scale irrigation development began about 1950. In Colorado, northwestern Kansas, Nebraska, and "}, {"section_title": "A16 REGIONAL AQUIFER-SYSTEM ANALYSIS", "text": "Wyoming, most of the irrigation development has taken place since 1960. A large area of 10-25 percent decrease in saturated thickness occurred in Colorado and Kansas, and several smaller areas occurred in Kansas, Nebraska, and Wyoming ( fig. 8 ). In these areas, groundwater pumpage is beginning to substantially decrease saturated thickness. Changes in saturated thickness are important because large changes in saturated thickness are directly related to changes in well yield. In Texas, more than 10-percent decrease in saturated thickness occurred in 74 percent, or 26,000 mi2 (17 million acres), of the High Plains aquifer, more than 25-percent decrease in saturated thickness occurred in 29 percent of the aquifer, and more than 50-percent decrease in saturated thickness occurred in 8 percent of the aquifer. Saturated thickness decreased more than 50 percent in large parts of Castro, Crosby, Floyd, Hale, Lubbock, Farmer, and Swisher Counties, south of the Canadian River. The impact of this depletion of the aquifer is illustrated by figure 9, which shows the decrease in the average number of acres irrigated per well in these seven Texas counties from 1958 to 1980. Each data point on the graph is the average for all seven counties for each year of data. The average number of acres irrigated per well in these seven counties decreased from 118 in 1958 to 62 in 1980. This decrease in acres irrigated per well is the result of decreasing well yields caused by decreasing saturated thickness. From 1958 to 1980, the number of irrigated acres in the seven counties decreased from 2.5 to 1.9 million, and the number of wells increased from about 21,000 to 30,000. Decreased well yields and increased pumping lifts in these seven counties have undoubtedly caused significant increases in farm-operation expenses. Similar declines in well yields can be expected as ground-water development continues in other areas of the High Plains."}, {"section_title": "DIGITAL MODELS", "text": "Digital models of ground-water flow in the High Plains aquifer were developed and calibrated by Luckey and others (1986) . The High Plains aquifer system was divided into three parts for simulation as shown in figure  10 . The southern High Plains included most of the area (29,000 mi2) south of approximately lat 35 ° N., the central High Plains included the area (48,500 mi2) between lat 35° and 39° N., and the northern High Plains included the area (96,500 mi2) north of lat 39° N. Separate ground-water flow models were constructed for each part of the High Plains."}, {"section_title": "MODEL CALIBRATION", "text": "The models of the High Plains aquifer simulate ground-water flow in two dimensions for a heterogeneous, isotropic, unconfined aquifer. A two-dimensional model was used because, on a regional scale, the vertical components of flow are small and probably can be neglected without causing significant errors in the results. A computer program was used to solve the finite-difference approximations to the ground-water flow equation for a regular network of nodes spaced 10 mi apart in both the north-south and the east-west directions (Luckey and others, 1986, p. 3-8) .\nFour general categories of information were needed for use in the models: (1) Aquifer geometry (vertical and areal extent of the aquifer), (2) boundary conditions (hydraulic conditions at the limit of the aquifer), (3) aquifer parameters (hydraulic conductivity and specific yield), and (4) aquifer stresses (recharge and discharge). In addition, some model simulations required specification of an initial water-level configuration. The models integrate the input data and calculate water levels and outflow from the aquifer.\nFor each area of the High Plains, models were constructed to simulate the system prior to large-scale irrigation development (predevelopment-period model) and after the beginning of large-scale development (development-period model). "}, {"section_title": "A18", "text": "REGIONAL AQUIFER-SYSTEM ANALYSIS the hydrology, the development-period models were used to refine the concepts needed to estimate future water levels in the High Plains aquifer. Prior to extensive agricultural development, the ground-water system in the High Plains was in a state of dynamic equilibrium with long-term natural recharge balanced by discharge along the eastern boundary and to streams (steady-state conditions). The predevelopment-period models simulated steady-state conditions and calculated a water-level configuration using estimates of the altitude of the base of aquifer, hydraulic conductivity, and predevelopment recharge. The estimated predevelopment recharge rate and hydraulic conductivity were varied in individual simulations until the calculated predevelopment water level was similar to the observed predevelopment water-level map, which was based on observation-well data, and the computed outflow to streams was comparable to the observed streamflow from gaging-station records.\nThe calculated predevelopment water levels were used as the initial conditions for the development-period models. Revised estimates of hydraulic conductivity and recharge from the predevelopment-period models were incorporated into the development-period models. In addition, the development-period models required information on the specific yield of the aquifer and aquifer stresses that occurred as a result of development. The distribution of specific yield was estimated using lithologic logs and was not varied during calibration. Pumpage for irrigation and return flow from irrigation were the predominant stresses resulting from development. Pumpage was calculated using reported irrigated acreage, calculated irrigation demand, and estimated irrigation efficiency. Return flow from irrigation was assumed to be a function of the difference between total pumpage and calculated irrigation demand. The development-period models integrated the input data and calculated the water-level configuration and the outflow from the aquifer. The inputs, particularly return flow from irrigation, were varied until the best correspondence between observed and calculated water levels or water-level changes was achieved."}, {"section_title": "MODEL SENSITIVITY", "text": "A sensitivity analysis was performed on the groundwater flow models to determine how changes in model input parameters affect simulation results (Luckey and others, 1986, p. 47-52) . Separate sensitivity analyses were made for the predevelopment-and the development-period models. The sensitivity analyses consisted of uniformly changing values of input data and determining the change in water levels and groundwater discharge calculated by the models.\nThe sensitivity analysis for the predevelopmentperiod models indicated that the models were about equally sensitive to changes in recharge or changes in hydraulic conductivity. The analysis further indicated that recharge and hydraulic conductivity are highly interrelated and, as long as the two are in balance, the models will have small mean residuals (difference between observed and calculated water levels). Hence, the models could be used to accurately determine recharge only if the hydraulic conductivity is accurately known.\nThe sensitivity of the development-period models to changes in hydraulic conductivity, specific yield, and net pumpage (pumpage minus return flow to the aquifer) was evaluated. The development-period models were sensitive to changes in net pumpage and specific yield and insensitive to changes in hydraulic conductivity. Specific yield and net pumpage also are highly interrelated, and one cannot be accurately determined through a model analysis unless the other is accurately known. If neither is accurately known, calibration of the models can only insure that specific yield and net pumpage are in balance.\nCalibration of the models verifies that appropriate parameters are in balance. Because hydraulic conductivity and specific yield were estimated independently of the models, they were known more accurately than recharge and net pumpage prior to model calibration. However, the sensitivity analyses demonstrated the interrelation between hydraulic conductivity and recharge for the predevelopment-period models and between specific yield and net pumpage for the developmentperiod models. Therefore, the model-calibration process provided estimates of the distribution of recharge and net pumpage that are about as accurate as the estimates of hydraulic conductivity and specific yield.\nA model of the southern High Plains using 5-mi grid spacing was developed to test the effect of grid size on model results . The 5-migrid model was calibrated for the predevelopment and development periods.\nCalibration of the 5-mi-grid and 10-mi-grid models for the southern High Plains did not produce identical water-level configurations, although the mean of the differences was near zero (difference between water levels calculated by the 5-mi-grid and 10-mi-grid models). Simulations using the 5-mi-grid model resulted in the same conclusions that were obtained from the 10-migrid model, indicating that grid size probably does not significantly affect the calibration and sensitivity analysis of the models of the High Plains aquifer."}, {"section_title": "EFFECTS OF FUTURE PUMPAGE", "text": "The calibrated models for the three areas of the High Plains were used by Luckey and others (in press) to SUMMARY OF HIGH PLAINS REGIONAL AQUIFER-SYSTEM ANALYSIS A19 project aquifer response to estimated pumpage from 1980 to 2020. The pumpage estimates were based on projections of future withdrawal of water made by the Economic Development Administration (EDA), U.S. Department of Commerce."}, {"section_title": "PUMPAGE ESTIMATES", "text": "The EDA study estimated pumpage from much of the High Plains aquifer for 1977 ,1985 ,1990 , 2000 , and 2020 (High Plains Associates, 1982 High Plains Study Council, 1982) for several different water-resource management strategies. Pumpage estimates for three of those strategies were used to project future water levels in the High Plains. The three management strategies simulated were:\n1. Baseline strategy a water-use projection based on a continuation of existing water conservation and use technology, practices, and public policy; 2. Management strategy 1 a water-use projection based on voluntary actions to reduce water use through research, education, and incentives; and 3. Management strategy 2 a water-use projection based on mandatory programs of a regulatory nature to reduce water use. The baseline strategy assumes a continuation of current government policies and economic trends with no new State or Federal programs undertaken that have not already been implemented or authorized. Management strategy 1 assumes faster adoption of new techniques to conserve water and voluntary measures to reduce irrigation water use. Management strategy 2 assumes that, in addition to the voluntary water conservation measures assumed under management strategy 1, mandatory water conservation measures would be imposed by governmental agencies. Under management strategy 2, water application rates for 1985, 1990 , and 2000 were assumed to be reduced to 90, 80, and 70 percent of those projected for management strategy 1, respectively. Between 2000 and 2020, water application rates were assumed to continue to be 70 percent of those projected for management strategy 1.\nPumpage was simulated using 5-yr averages between 1980 and 2020. The pumpage estimates were based on the EDA projections made by the High Plains Associates (1982) . Pumpage estimates for intervening years were based on linear interpolation of the EDA projections. Pumpage estimates for areas not included in the EDA study (primarily South Dakota and Wyoming) were based on assumed irrigated acreage and application rates.\nThe pumpage from the High Plains aquifer simulated for each management strategy and each 5-yr interval is summarized in figure 11 . Average annual pumpage simulated for each 5-yr interval varied little between the baseline strategy and management strategy 1; however, average annual pumpage for management strategy 2 was as much as 27 percent less than for the baseline strategy. The total pumpage simulated for the baseline strategy between 1980 and 2020 was 628 million acreft including 113 million acre-ft in the southern High Plains, 158 million acre-ft in the central High Plains, and 357 million acre-ft in the northern High Plains. The total pumpage simulated for management strategy 1 between 1980 and 2020 was 647 million acre-ft including 109 million acre-ft in the southern High Plains, 178 million acre-ft in the central High Plains, and 360 million acre-ft in the northern High Plains. The total pumpage simulated for management strategy 2 between 1980 and 2020 was 497 million acre-ft including 88 million acreft in the southern High Plains, 138 million acre-ft in the central High Plains, and 271 million acre-ft in the northern High Plains. Lower water use for management strategy 1 results in larger total pumpage than for the baseline strategy because more acreage would be irrigated."}, {"section_title": "COMPARISON OF PROJECTIONS", "text": "Pumpage was simulated using the projection models of the southern, central, and northern High Plains. However, return flow from irrigation (that part of pumpage that returns to the aquifer) was not considered in the projection models. During the model calibration process, return flow was assumed to be a function of water applied in excess of the irrigation requirement. Because pumpage estimates for most of 1980 to 2020 were less than estimated irrigation requirement, return flow was assumed to be negligible (and not simulated) during the projection period.\nThe projected 1980-to-2020 water-level change, assuming baseline-strategy pumpage from the High Plains aquifer, is shown in figure 12 . Between 1980 and 2020, most of the High Plains will have water-level declines in excess of 10 ft. Declines are projected to exceed 100 ft in about 15,500 mi2 in parts of all States except South Dakota and Wyoming. The maximum 1980-to-2020 water-level decline is projected to be almost 250 ft in northern Texas. In two small areas in the southern High Plains (not shown in figure 12 ), water levels are projected to rise more than 10 ft (Luckey and others, in press, fig. 6 ).\nThe average water-level decline from 1980 to 2020 for the baseline strategy in the entire High Plains is projected to be about 32 ft, and the median decline is projected to be about 13 ft; the median indicates that water-level declines will exceed 13 ft in one-half of the High Plains. The average 1980-to-2020 water-level decline for the baseline strategy is projected to be 32 ft in the southern High Plains, 26 ft in the central High Plains, and 36 ft in the northern High Plains. The median 1980-to-2020 water-level decline for the baseline strategy is projected to be 13 ft in the southern High Plains, 11 ft in the central High Plains, and 14 ft in the northern High Plains. The projected 1980-to-2020 water-level declines are in addition to the water-level declines of as much as 200 ft that occurred in the High Plains prior to 1980 (Luckey and others, 1981) . The projected saturated thickness remaining in the High Plains by 2020, assuming baseline-strategy pumpage, is shown in figure 13 . Saturated thickness is projected to exceed 100 ft in 72,500 mi2 (42 percent) and 200 ft in 37,600 mi2 (22 percent) of the High Plains.\nAreas where projected saturated thickness would exceed 200 ft in 2020 are significantly smaller than they were in 1980 (compare figs. 3 and 13). The average saturated thickness for the entire High Plains was about 200 ft in 1980. By 2020, the saturated thickness averages 154 ft for the entire High Plains, 36 ft for the southern High Plains, 104 ft for the central High Plains, and 217 ft for the northern High Plains. The maximum saturated thickness projected for 2020 exceeds 800 ft in 1,650 mi2 in the northern High Plains, 400 ft in 400 mi2 in the central High Plains, and 100 ft in 1,500 mi2 in the southern High Plains.\nThe projected 1980-to-2020 water-level changes, assuming management-strategy-1 pumpage from the High Plains aquifer, are virtually the same as for the baseline strategy. The maximum water-level decline from 1980 to 2020 is projected to be about 230 ft in northern Texas. Although the maximum decline is smaller for management-strategy-1 pumpage than for FIGURE 13. Projected saturated thickness by 2020 assuming baseline-strategy pumpage."}, {"section_title": "SUMMARY OF HIGH PLAINS REGIONAL AQUIFER-SYSTEM ANALYSIS A23", "text": "baseline-strategy pumpage, there generally is little difference in water-level declines between the two strategies because total management-strategy-1 pumpage is only 3 percent more than total baseline-strategy pumpage. The average 1980-to-2020 water-level decline projected for the baseline strategy is 32 ft, and the average decline projected for management strategy 1 is 33 ft. The median water-level decline projected for the same period is 13 ft for both strategies. Water-level changes projected for management strategy 2 are significantly different from the baseline strategy. The projected 1980-to-2020 water-level change in the High Plains aquifer, assuming managementstrategy-2 pumpage, is shown in figure 14 . Water levels are projected to decline more than 10 ft in 86,370 mi2 and more than 100 ft in 9,100 mi2 of the High Plains. The maximum water-level decline from 1980 to 2020 is projected to be about 180 ft in northern Texas.\nThe mandatory reduction in water use will reduce water-level changes compared to those for the baseline strategy. The average 1980-to-2020 water-level decline projected for management strategy 2 is 26 ft, and the median decline is 11 ft. The average water-level decline from 1980 to 2020 is projected to be 26 ft in the southern High Plains, 22 ft in the central High Plains, and 28 ft in the northern High Plains. The median decline is projected to be 11 ft in the southern High Plains, 10 ft in the central High Plains, and 11 ft in the northern High Plains.\nSmaller declines result in significantly more saturated thickness projected for management strategy 2 than for the baseline strategy. The average saturated thickness by 2020, assuming management-strategy-2 pumpage, is projected to be 160 ft in the entire High Plains, 42 ft in the southern High Plains, 107 ft in the central High Plains, and 225 ft in the northern High Plains. The average saturated thickness by 2020 is projected to be 154 ft assuming baseline-strategy pumpage. The difference in saturated thickness between the baseline strategy and management strategy 2 is shown in figure  15 . More than 50 ft of saturated thickness could be saved in several areas that total 1,830 mi2 as a result of the mandatory reduction in water use assumed for management strategy 2. The maximum difference between the baseline strategy and management strategy 2 is projected to be 68 ft in 2020. The difference in saturated thickness is projected to exceed 10 ft in 23 percent of the High Plains.\nThe total volume of water removed from storage in the aquifer from 1980 to 2020 is projected to be 429 million acre-ft for management-strategy-two pumpage of 497 million acre-ft. The difference (68 million acre-ft) between the volume of water removed from storage and the volume pumped is supplied by reduced ground-water discharge to streams and the atmosphere. The volume removed from storage was 80 million acre-ft in the southern High Plains, 121 million acre-ft in the central High Plains, and 228 million acre-ft in the northern High Plains. Prior to 1980, the total volume of water removed from storage was 166 million acre-ft.\nLower pumpage simulated for management strategy 2 results in smaller water-level declines, larger saturated thickness, and more water in storage by 2020 than for the other strategies. The average water level would be 6 ft higher and average saturated thickness would be 6 ft greater for management strategy 2 than for the baseline strategy. From 1980 to 2020, the total volume of water removed from storage in the High Plains aquifer is projected to be 530 million acre-ft assuming baseline-strategy pumpage and 429 million acre-ft assuming management-strategy-2 pumpage. The difference of 101 million acre-ft that results from less water use projected for management strategy 2 is adequate to supply the 2020 pumpage (assuming management strategy 2) in the High Plains for nearly 9 years. Waterlevel-decline, saturated-thickness, and change-in-storage projections are summarized by management strategy in the following The projected declines in water levels and saturated thickness will reduce well yields. Luckey and others (in press, fig. 26 ) estimated the percentage change in probable well yields from 1980 to 2020 based on the difference in probable well yield in 1980 and that projected for 2020 assuming baseline-strategy pumpage. In general, declines in well yields are projected to be least in the northern High Plains and greatest in the southern High Plains. In about 17 percent of the High Plains, probable well yields are projected to decrease by more than 75 percent from 1980 to 2020. In 42 percent of the area, well yields are projected to decrease by more than 25 percent by 2020. "}, {"section_title": "A26", "text": "REGIONAL AQUIFER-SYSTEM ANALYSIS may be the result of decreasing well yields caused by declining water levels and decreasing saturated thickness."}]