[{"section_title": "", "text": "executive functioning deficits more frequently fail to complete multi-step instructions by their teachers and to finish complex tasks (Gathercole, Lamont, & Alloway, 2006). These deficits are also thought to interfere with children's mathematics as well as reading achievement (Swanson & Beebe-Frankenberger, 2004). For example, working memory and cognitive flexibility deficits have been reported to constrain children's counting abilities, fact retrieval (Geary, Hoard, Nugent, & Bailey, 2012;Noel, 2009), and mathematics problem solving (Andersson, 2008;Swanson, Jerman, & Zheng, 2008). This may occur due to the children struggling with (a) storing and then manipulating symbolic information and (b) shifting between several strategies or following multistep solution procedures (Toll et al., 2011;Van der Sluis et al., 2007). Working memory or cognitive flexibility deficits also have been reported to interfere with children's reading fluency and comprehension monitoring (Cain, Oakhill, & Bryant, 2004;Sesma, Mahone, Levine, Eason, & Cutting, 2009). This may occur as the children struggle to hold and integrate information from their long-term memories while also trying to process and make inferences about assigned texts (Locascio, Mahone, Eason, & Cutting, 2010;Swanson & Beebe-Frankenberger, 2004). Children with learning difficulties are known to be at higher risk of having executive functioning deficits (August & Garfinkel, 1990;Gathercole, Alloway, Willis, & Adams, 2006)."}, {"section_title": "Limited Evidence of a Causal Relation between Executive Functioning", "text": ""}, {"section_title": "Deficits and Learning Difficulties", "text": "Yet whether and to what extent executive functioning deficits are causally related to the onset of learning difficulties-and so constitute potential targets of early intervention efforts -is presently unclear. Methodologically, most existing work has relied on cross-sectional designs (Gathercole, 2005) and has not fully accounted for potential confounding factors that may explain any initially observed relations between executive functioning deficits and children's reading or mathematics difficulties (Jacob & Parkinson, 2015). 1 Potential confounds include background characteristics of children (e.g., prior academic achievement, prior behavioral functioning, gender, age, race/ethnicity) and their families (e.g., household income and other indictors of socioeconomic status) (Friso-van den Bos, van der Ven, Kroesbergen, & van Luit, 2013;Jacob & Parkinson, 2015). Children's own prior academic functioning and their family's socioeconomic status (SES) have been identified as particularly strong potential confounds (Jacob & Parkinson, 2015). Additional factors that might be related to children's academic achievement and so should be statistically controlled include participation in programs that are designed to mitigate the early impacts of economic deprivation, as well as childcare attendance (Geoffroy et al., 2010;Jyoti, Frongillo, & Jones, 2005). Due in part to these aforementioned methodological limitations, the existing work has been characterized recently as providing \"no compelling evidence\" (Jacobs & Parkinson, 2015, p. 30) as to whether children's executive functions are causally related to their academic achievement. Establishing that deficits in executive function (a) temporally precede learning difficulties in reading or mathematics and (b) are uniquely predictive of these difficulties after accounting for strong potential confounds would provide stronger preliminary evidence of the hypothesized causal relations (Finkel, 1995), and so might inform intervention design efforts to help young children with reading or mathematics difficulties. (These intervention design efforts would then be experimentally evaluated to provide unambiguous causal evidence.) Substantively, few studies have been conducted that included multiple subcomponents of executive function in their analyses (Jacob & Parkinson, 2015). This has resulted in ambiguity as to which of the multiple subcomponents (e.g., working memory, inhibitory control, cognitive flexibility) constitute comparatively more promising targets of interventions designed to prevent or remediate learning difficulties. Theoretically, working memory deficits might constitute especially strong impediments to young children's academic achievement, particularly in mathematics (Toll et al., 2011). This is because many classroom tasks given in the primary grades (e.g., counting, solving single-digit addition and subtraction problems) often require children to store as well as manipulate information. In contrast, other types of executive functioning deficits, including in cognitive flexibility, may not be as important during the primary grades. For example, relatively fewer classroom tasks during these grades require solving multi-step problems, thereby placing fewer demands on children with cognitive flexibility deficits (van der Sluis, de Jong, & van der Leij, 2004). Yet whether working memory or cognitive flexibility deficits should receive greater emphasis in early intervention designs is presently unclear because of the lack of studies that have simultaneously examined the predictive utility of both types of deficits in explaining children's risk for learning difficulties (Jacob & Parkinson, 2015). Additionally, and although prior studies have examined whether and to what extent executive functions are related generally to children's achievement in reading or mathematics, less clear is whether specific executive functioning deficits are related to learning difficulties in both reading mathematics, particularly after accounting for the strong potential confounds of children's background characteristics (Jacob & Parkinson, 2015). Thus, it remains to be empirically established whether these deficits are more likely to constrain children's mathematics than reading achievement. Relatedly, finding that executive functioning deficits increase children's likelihood of experiencing learning difficulties in both both mathematics and reading would suggest that these deficits may constitute especially important targets of early intervention efforts for at-risk children. Currently, very few of the available studies have analyzed population-based as well as longitudinal samples, thereby limiting both generalizability of the field's knowledge base as well as evidence of unique predictive relations between children's executive functioning deficits and their later risk for academic struggles. For example, Jacob and Parkinson's (2015) synthesis of 67 studies reported an average sample size of 237, with 23 of these studies examining the relation between executive function and academic achievement longitudinally."}, {"section_title": "Purpose", "text": "We examined whether and to what extent executive functioning deficits uniquely predicted kindergarten children's risk of later experiencing reading or mathematics difficulties. To address recently identified methodological and substantive limitations in the existing work, we (a) analyzed a population-based and multi-year longitudinal sample of U.S. schoolchildren, (b) included measures of two types (i.e. working memory, cognitive flexibility) of executive functioning deficits, (c) examined these hypothesized relations predictively instead of concurrently, and (c) statistically controlled for strong potential confounds, including the autoregressors of prior learning difficulties as well as family SES and children's own prior behavioral functioning. Simultaneously adjusting for autoregressive learning difficulties in both reading and mathematics should result in especially strong statistical control for potential confounds. By examining whether and to what extent executive functioning deficits temporally precede reading and mathematics difficulties and remain uniquely predictive of these difficulties following statistical control for many potential confounds during the primary grades, our study's analyses should help clarify to what extent executive functioning deficits may be potentially causally related to the onset of these difficulties. Examining these relations during the primary grades should help clarify whether executive functioning deficits constitute potential targets of early intervention design efforts for young children with or at risk of experiencing reading or mathematics difficulties."}, {"section_title": "Method Database", "text": "We analyzed the restricted version of the nationally representative Early Childhood Longitudinal Study, Kindergarten class of 2011 (ECLS-K: 2011) dataset. The ECLS-K: 2011 is maintained by the National Center for Educational Statistics (NCES) of the U.S. Department of Education's Institute of Education Sciences. Analyzed data were collected in the fall of 2010, fall and spring of 2011, and spring of 2012. These dates generally corresponded to children being enrolled in kindergarten and first grade. The entire ECLS-K: 2011, which consisted of around 18,080 children, served as our analytical sample. Table 1 displays the analytical sample's descriptive characteristics, with and without sample weighting."}, {"section_title": "Criterion Variables", "text": "Learning difficulties in reading or mathematics-Field staff from NCES administered untimed, item response theory (IRT)-scaled reading and mathematics assessments that displayed strong psychometric properties (Tourangeau et al., 2015). Specifications for the assessments were based on the 2009 NAEP Reading and 1996 NAEP Mathematics Frameworks. We analyzed scores from the spring of kindergarten and first grade administrations of these assessments. The reading achievement assessments contained items relating to basic skills (print familiarity, letter recognition, beginning and ending sounds, sight vocabulary, and recognizing common words), vocabulary knowledge (including receptive vocabulary and vocabulary in context), and reading comprehension. For both the kindergarten and first grade reading achievement assessments, most items were related to basic reading skills as opposed to vocabulary knowledge and reading comprehension. The mathematics achievement assessments contained items relating to declarative, procedural, and conceptual knowledge. Additional content included: (a) number sense and number properties; (b) basic mathematical operations; (c) measurement; (d) geometry and spatial sense; (e) data analysis, statistics, and probability; and (f) patterns, algebra, and functions. Theta reliabilities for the reading and math assessments were .95 and .94, respectively. To evaluate whether deficits in working memory or cognitive flexibility uniquely predicted kindergarten children's later risk of experiencing learning difficulties in reading or mathematics, including after statistical control for autoregressive prior histories of reading or mathematics difficulties, children's scores on the reading and mathematics assessments were dummy coded as \"1\" when the scores were in the bottom 10% of the entire distribution of scores at either first grade or kindergarten assessment. One dummy variable was created for each of the two assessments. Children with scores in the top 90% of the reading and mathematics achievement assessments were the respective reference groups. The use of a 10% cutoff has been used in prior research to identify children experiencing learning difficulties as well as disabilities (Dirks, Spyer, van Lieshout, de Sonneville, 2008;Geary, 2011;Murphy, Mazzocco, Hanich, & Early, 2007;Mazzocco, 2001). A 10% cut off is also consistent with the estimated prevalence of mathematics and reading disabilities as well as specific language impairment in samples of young children (e.g., Geary, 2011;Landerl & Moll, 2009;Moll;Kunze, Neuhoff, Bruder, & Schulte-Korne, 2014;Shaywitz, Shaywitz, Fletcher, & Escobar, 1990;Tomblin et al., 1997). (As a further robustness check, we also used the alternative cut offs of 15% and 25% to identify children with reading or mathematics difficulties as well as those with executive functioning deficits. We also estimated these relations continuously. Please see the Appendix's Supplemental Tables 1-3 for these results, which were consistent with those reported in the study's main text.)"}, {"section_title": "Predictor Variables", "text": "We were especially interested in whether and to what extent executive functioning deficits in working memory or cognitive flexibility by the spring of kindergarten predicted reading or mathematics difficulties by the spring of first grade. Working memory deficits-Working memory was measured by using the Numbers Reversed subtest of the Woodcock-Johnson III Tests of Cognitive Abilities (Mather & Woodcock, 2001). The Numbers Reversed task has been used extensively in psychological research as part of a Working Memory cluster score (Flanagan, McGrew, & Ortiz, 2000). Floyd et al. (2006) found that working memory scores based largely on the Numbers Reversed scale positively correlated with other measures of working memory. Reliability coefficients for the Numbers Reversed subtest have been consistently found to be above .90 (Mather & Woodcock, 2001). This assessment had children repeat back sets of single-digit numbers in the reverse order that the numbers were presented. For example, if the test administrator presented the numbers \"3, 5, 7\", a child who said \"7, 5, 3\" correctly answered the item. A child was given five two-digit sequences. Testing was stopped if the child provided incorrect answers for three consecutive sequences. Otherwise, the child was given five three-digit sequences. The procedure was repeated with progressively longer sequences (to a maximum of eight digits) until three consecutive sequences were answered incorrectly. Item-level data were available for this task, with a total of 30 possible items (five two-digit sequences, five three-digit sequences, four four-digit sequences, four five-digit sequences, four six-digit sequences, four seven-digit sequences, and four-eight digit sequences). Responses were coded as \"correct,\" \"incorrect,\" or \"not administered.\" Scores were recoded into W scores as recommended by the measure's publishers (Mather & Woodcock, 2001). The W scale is a standardized scale that has a mean of 500 and a standard deviation of 100. Use of the W scale was advantageous in our study because it measured both correct responding and task difficulty, and helped track growth over time (Tourangeau et al., 2015). The W scale is an equal-interval scale that allows the child's ability level and the difficulty of the items to be measured on the same scale (Jaffe, 2009). Consequently, a one-unit change on the scale represents a one-unit change in the child's ability level, regardless of where in the distribution the child's particular score resides. A change in the W scale represented growth in the trait being measured instead of simply a change in relative rank order. Cognitive flexibility deficits-Cognitive flexibility was measured using the Dimensional Change Card Sort (DCCS; Zelazo, 2006). The DCCS has been used repeatedly to study executive function in childhood (Benson, Sabbagh, Carlson, & Zelazo, 2013;Carlson, White, & Davis-Unger, 2014;Kloo et al., 2008;Leyva et al., 2015;Obradović, 2010;Schmitt, McClelland, Tominey, & Acock, 2015;Wade et al., 2014;White et al., 2011;Zelazo et al., 2014). The original form of the DCCS was designed for use with three-to fiveyear-old children. However, the measure has also been used with older samples (e.g., Cutuli et al., 2010;Masten et al., 2012;Obradović, 2010). The DCCS was administered in the spring of both kindergarten and first grade. The task required children to sort 22 different picture cards on the basis of different rules. The cards had a picture of either a red rabbit or a blue boat. Children were asked to sort the 22 cards on the basis of the sorting rule that they were given (either by color or by shape). Each child was given four cards as a practice task, and then the DCCS was administered. The task was presented as a game. Children first played the Color game (i.e., sort by color), and then the Shape game (i.e., sort by shape). If a child performed well enough on the Shape game (i.e., sorts four of six cards correctly), then the child was asked to play the Border game. In the Border game, were sorted on the basis of whether or not they have a black border. The child was asked to sort cards with black borders by color and cards without black borders by shape. Item-level data were available for each of the three games (six variables for each game). The DCCS has very strong testretest reliabilities, with intra-class correlations generally ranging from .90-.94. We identified children whose scores on the two executive functioning measures were in the bottom 10% of the distribution as having working memory or cognitive flexibility deficits. Specifically, children whose scores on either measure were in the bottom 10% of the distribution were coded as a \"1\" indicating a deficit. Those children in the top 90% of the score distribution were coded a \"0,\" indicating no deficit. Our cut-off of 10% was more conservative than cut-off scores used in earlier work to identify children with executive functioning deficits (Alloway, Gathercole, Kirkwood, & Elliott, 2009). Use of a 10% cut off is also a fairly restrictive criterion to identify children with or at risk for having disabilities (Forness et al., 1998;Morgan, Farkas, Tufis, & Sperling, 2008) including those who may have deficits in executive function (Geary, Hoard, Byrd-Craven, Nugent, & Numtee, 2007;Murphy, Mazzocco, Hanich, & Early, 2007)."}, {"section_title": "Control Variables", "text": "We statistically controlled for additional factors that might themselves be predictive of reading or mathematics difficulties and so, if not included as covariates, might potentially confound any observed predictive relations between these difficulties and executive functioning deficits. In addition to children's prior history of reading or mathematics difficulties, we also controlled for children's prior behavioral functioning, their or their family's socio-demographic characteristics, and their family's participation in governmental assistance or childcare (Friso-van den Bos, 2013; Geoffroy et al., 2010;Jacob & Parkinson, 2015). Prior behavioral functioning-The ECLS-K: 2011 uses a modified version of the psychometrically validated Social Skills Rating System (SSRS; Gresham & Elliot, 1990) to measure children's behavioral functioning. We used subscale measures of children's behavioral self-regulation and externalizing and internalizing problem behaviors as statistical controls when examining the relation between executive functioning deficits and learning difficulties. Kindergarten teachers rated the children's behavior in the spring. The Approaches to Learning subscale consisted of seven items that examined how often a student displayed behavioral self-regulation (e.g., works independently, easily adapts to changes in routine, persists in completing tasks, pays attention well, follows classroom rules) (e.g., Li-Grining, Votruba-Drzal, Maldonado-Carreno, & Hass, 2010). The Internalizing Problem Behaviors subscale consisted of four items (e.g., is the child lonely, sad, or anxious), while the Externalizing Problem Behaviors subscale consisted of five items (i.e., e.g., argues, fights, acts impulsively, gets angry). For each subscale, teachers rated children's behavior on a four-point scale from \"never\" to \"very often.\" Higher scores indicated that the behavior occurred more frequently. The internal consistency reliability coefficients for the Approaches to Learning, Internalizing, and Externalizing subscales were .91, .78, and .89, respectively. Continuous scores from the three subscales were used as covariates in the study's analyses. Covariate adjustment for prior behavioral self-regulation should help statistically control for other types of executive functioning including attention and inhibitory control (Fuhs, Farran, & Nesbitt, 2015). Behavioral self-regulation is known to strongly predict young children's academic achievement (e.g., Duncan et al., 2007), including that of children at risk (Lin et al., 2014;Morgan et al., 2008). Socio-demographic characteristics-Parents identified their child's age (in months), gender, and race or ethnicity in the kindergarten parent interview. The child's race was reported in one of the following categories: White, non-Hispanic; Black, non-Hispanic; Hispanic; Asian; or Other. NCES calculated a household's socioeconomic status (SES) using a composite of variables indicating each parent's or guardian's education level and occupation as well as the parent-report household income. The family's SES was included as a continuous variable in the analysis. We also included as a predictor whether the household was below the federal poverty level. Use of governmental assistance, childcare-During spring of their child's kindergarten year, parents were asked whether they had received food stamps at least once in the past 12 months. To determine whether Women, Infants, and Children (WIC) assistance had ever been provided to the household, the parental respondent was asked two questions: \"Did the household receive WIC assistance while the mother was pregnant,\" and \"did the child receive WIC assistance as an infant or a toddler?\" The respondent was also asked about the childcare arrangements. We included as a variable whether the child regularly attended a center-based child care program. Parents were also asked whether they had received temporary assistance for needy families (TANF) in the last 12 months."}, {"section_title": "Missing Data", "text": "Due to the ECLS-K: 2011's large sample size and large amount of data collection over a multi-year time frame, there was some missing data between kindergarten and first grade. However, the ECLS-K: 2011 data provided detailed and extensive information on many child, parent, teacher, and school variables including those that missingness was likely conditional upon (e.g., family SES, children's academic achievement and behavior). We used multiple imputation (MI), a technique that retained the largest possible sample size for the study's analyses. Use of MI is advantageous because it incorporates uncertainty into the standard errors of imputed values by accounting for variance from the imputed solutions (Acock, 2005;Allison, 2001;Rubin, 1996), and, along with maximum likelihood, provides the best general method for achieving unbiased regression estimates in the presence of missing data. Use of multiple imputation is considered \"statistically rigorous\" (Rendall, Ghosh-Dastidar, Weden, Baker, & Nazarov, 2013, p. 485). Missingness ranged from 0% to 30% across the study's predictors. We imputed the missing data five times to create five data sets, which allowed us to estimate five sets of model parameters. We then combined these five sets of estimates into one using standard formulas derived by Rubin (1987)."}, {"section_title": "Data Analyses", "text": "We analyzed the data using autoregressive logistic regression models. All analyses were performed with SAS Version 9.3. We standardized all continuous variables in the models to facilitate their regression coefficient interpretation. We used standard alpha levels (i.e., p < . 05, .01, and .001) for the study's main analyses. Table 2 displays the results of these analyses in terms of odds ratios. For each population of interest, odds ratios were calculated for the risks of having reading difficulties or, separately, mathematics difficulties in first grade. The odds of an event occurring are the ratio of the probability of it occurring, divided by the probability of it not occurring. An odds ratio is the ratio of these odds for individuals with one score on an independent variable compared to those with a different score on this variable. (When the independent variable is composed of two groups, the odds ratio is the ratio of the odds for each group.) An odds ratio of 1.0 indicates no effect by the predictor variable on the outcome. An odds ratio greater than 1.0 indicates a positive predicted effect, while an odds ratio below 1.0 indicates a negative predicted effect. Table 2's Model 1 displays the predictive relations between two types of executive functioning deficits and two types of learning difficulties, statistically controlling for autoregressive prior histories of learning difficulties. Model 2 simultaneously adjusts for additional potential confounds, providing extensively covariate-adjusted estimates of the extent to which executive functioning deficits uniquely increased kindergarten children's risk of experiencing learning difficulties in reading or mathematics by the end of first grade. We also undertook a dominance analysis (Budescu, 1993) in order to compare the relative magnitudes of the contribution of working memory and cognitive flexibility deficits to learning difficulties. Dominance analysis uses pseudo R squared to measure the fit of the model for logistic regressions. It first establishes the baseline pseudo R squared with all predictors except those sought to be compared. Then, each of the additional predictors being compared is separately added into this subset model to get the contribution of each additional predictor. The one with larger contribution dominates. The pseudo R squared we used in our analysis is Nagelkerke's R squared. This analysis gave similar results to that based on comparing the relative magnitudes of the coefficients of each of the executive functioning predictors. As briefly noted previously, we also conducted a supplementary set of analyses (please see the Appendix's Supplementary Tables). As a robustness check, we used (a) two additional cut points for executive functioning deficits and reading or mathematics difficulties (i.e., lowest 15% and 25%) and (b) continuous instead of dichotomous variables for working memory, cognitive flexibility, and reading or mathematics achievement. We also examined whether children's executive functions and academic achievement co-varied in kindergarten. We did so because establishing whether two variables co-vary is a less stringent but still necessary condition for causality (Finkel, 1995)."}, {"section_title": "Results", "text": "Model 1 in Table 2 shows that prior histories of learning difficulties in both reading and mathematics were strongly predictive of both types of difficulties. Further, after controlling these prior learning difficulties, kindergarten children with working memory or cognitive flexibility deficits were at elevated risk for learning difficulties in reading as well as mathematics by the end of first grade. The odds of having reading difficulties in first grade increased by, respectively, 2.66 and 1.35, for kindergarten children with working memory or cognitive flexibility deficits. Similar odds for mathematics difficulties were, respectively, 3.38 and 1.79. The relative magnitude of these coefficients suggests that while both are statistically significant, the effects of working memory deficits were stronger than those of cognitive flexibility deficits for predicting both reading and mathematics difficulties. This relative magnitude of effects was supported by the dominance analysis of Model 1 shown in Table 3. Working memory deficits contributed more strongly than cognitive flexibility deficits to children's later risk for learning difficulties. The logistic regressions in Model 2 of Table 2 continued to statistically control for the sameand other-domain autoregressors while also including additional potential confounds. Model 2's results indicated that additional factors were also predictive of experiencing learning difficulties in reading or mathematics in first grade. Two of these factors were consistently related to children's risk of learning difficulties in either academic domain-family SES and kindergarten children's own behavioral self-regulation. For example, the odds that kindergarten children with greater behavioral self-regulation (e.g., those 1 SD above the M) would experience reading or mathematics difficulties as first graders were about 40% lower (1 -.62 or 1 -.61) than for kindergarten children with typical behavioral self-regulation. Gender and race/ethnicity intermittently predicted children's risk for learning difficulties. Model 2's results indicated that working memory and cognitive flexibility deficits continued to uniquely predict kindergarten children's increased risk for learning difficulties in both reading and mathematics in first grade. This is despite statistical controls for the autoregressors of prior histories of reading and mathematics difficulties, sociodemographics, three types of behavioral functioning including approaches to learning, and additional factors. Specifically, the covariate-adjusted odds that kindergarten children with working memory deficits would experience reading and mathematics difficulties in first grade were 2.17 and 2.87 times larger than for otherwise similar kindergarten children without working memory deficits. Kindergarten children with cognitive flexibility deficits had odds of experiencing reading or mathematics difficulties that were, respectively, 1.27 and 1.71 times those without such deficits, even after statistically controlling for many potential confounds. Overall, Model 2's results indicated that executive functioning deficits were uniquely predictive of experiencing later learning difficulties. This general relation was evident across two specific types of executive functioning deficits and across two specific types of learning difficulties, as well as following extensive statistical control for many potential confounds including two types of autoregressors. We subsequently tested several additional interrelations and found that executive functioning deficits (whether in working memory or in cognitive flexibility) were more strongly related to mathematics difficulties than reading difficulties (p-value levels of .0023 for reading and .018 for mathematics). Based on the dominance analysis of Model 2 presented in Table 3, children's mathematics or reading difficulties in first grade were more strongly predicted by earlier deficits in working memory than in cognitive flexibility (p-value level of .001). The study's supplemental analyses indicated that these relations between working memory or cognitive functioning deficits and children's learning difficulties were robust to various criterion specifications. When examined continuously instead of dichotomously, and despite extensive statistical control including for the strong confounds of prior reading and mathematics achievement, kindergarten children's working memory and cognitive flexibility continued to uniquely predict their first grade reading and mathematics achievement. Children's executive functions and academic achievement co-varied by the spring of kindergarten."}, {"section_title": "Discussion", "text": "Our results indicated that kindergarten children with working memory and cognitive flexibility deficits were at increased risk of experiencing reading and mathematics difficulties in first grade. These predictive relations were not explained by many potential confounds, including children's prior histories of reading or mathematics difficulties, their own prior behavioral functioning including self-regulation, and their family's SES. These confounding factors were themselves strongly predictive of kindergarten children's risk for learning difficulties."}, {"section_title": "Limitations", "text": "Our study has several limitations. First, the ECLS-K: 2011 dataset does not include a measure of IQ. This also has been identified as a potential confound of a causal relation between executive function and academic achievement (Jacob & Parkinson, 2015). However, prior work has also found that IQ is highly correlated with academic achievement (Rohde & Thompson, 2007). For example, Naglieri and Bornstein's (2003) synthesis indicated that IQ and academic achievement correlated as highly as .74. Our analyses did control for children's prior histories of very low achievement in both reading and mathematics. Second, data from the ECLS-K: 2011 sample were available only to the end of first grade. We were therefore unable to report whether these predictive relations continue to occur or fluctuate as children age. For example, it may be that cognitive flexibility deficits begin to interfere more strongly with children's academic achievement as they continue past the primary grades. Third, the ECLS-K data are non-experimental. Although the ECLS-K: 2011 data allow for hypothesis generation and may also provide preliminary evidence of a potential causal relation, they do not allow for unambiguous causal inferences. Experimental studies, including those that help address those methodological limitations recently identified by Jacob and Parkison (2015), are necessary to conclusively establish that remediating executive functioning deficits results in greater academic achievement. Fourth, the ECLS-K: 2011 data include direct measures of working memory and cognitive flexibility but not direct measures of other specific executive functions. We therefore were unable to examine whether other types of executive functioning deficits (e.g., in attention or inhibitory control) were also uniquely predictive of children's increased risk for learning difficulties. We did include the ECLS-K: 2011's measure of behavioral self-regulation as a control, which measures the frequency of children's attention, persistence, and other behaviors involving attentional capacity and inhibitory control, and so should have correlated with these other types of executive functions (Brock, Rimm-Kaufman, Nathanson, & Grimm, 2009;Cole, Usher, & Cargo, 1993;Fitzpatrick & Pagani, 2012;Fuhs et al., 2015;Neuenschwander, Rothlisberger, Cimeli, & Roebers, 2012;Riggs, Blair, & Greenberg, 2004)."}, {"section_title": "Study's Contributions and Implications", "text": "Our findings support and extend the extant knowledge base. We find that learning difficulties in both reading and mathematics become highly stable as early as the primary grades. This has been reported previously (e.g., Morgan et al., 2009), but often using analyses of smallerscale convenience samples (e.g., Juel, 1988). Our analyses of the recently released ECLS-K: 2011 data indicate that policymakers, researchers, and practitioners should continue to consider very low levels of academic achievement in either reading or mathematics as highly stable conditions in the general population of U.S. schoolchildren, even by the primary grades. Our results therefore provide additional empirical support for efforts to help children experiencing the early onset of learning difficulties. These screening and intervention efforts likely need to be introduced as early as kindergarten. Factors that might be included in screening efforts to identify children at risk for reading and mathematics difficulties as they age should include family SES, having working memory and cognitive flexibility deficits, displaying lower behavioral self-regulation, and, most importantly, already experiencing either type of learning difficulties-particularly persistently experiencing these difficulties (e.g., Morgan et al., 2009a). These last three types of factors are modifiable through school-based interventions (Dahlin, 2013;Diamond, Barnett, Thomas, & Munro, 2007;Flook et al., 2010;Holmes, Gathercole, & Dunning, 2009;García-Madruga et al., 2013;Riggs, Greenberg, Kusché, Pentz, 2006). Also consistent with prior work, but again replicated using more recent ECLS-K: 2011 data, our results indicate that only one type of behavioral functioning uniquely increases children's risk for learning difficulties. Specifically, less frequent behavioral self-regulation but not more frequent externalizing or internalizing problem behaviors is predictive of very low levels of academic achievement (e.g., Morgan et al., 2009;Lin et al., 2013). Our analyses of a population-based and longitudinal sample indicate that interventions designed to reduce the frequency of externalizing or internalizing problem behaviors may themselves be unlikely to reduce young children's risk for learning difficulties. Instead, multicomponent interventions that also remediate low behavioral self-regulation might be more effective in helping to address learning difficulties. Our study addresses recently identified limitations in the education field's understanding of the general relation between children's executive function and academic achievement. For example, Jacob and Parkinson (2015) identified only eight studies that accounted for the strong confounds of children's background characteristics when investigating this general relation. The lack of these types of studies has resulted in the extant work being viewed as providing \"no compelling evidence\" of a causal relation between executive function and academic achievement (Jacob & Parkinson, 2015, p. 30). By designing our study in a way that responded to these identified methodological limitations, our findings contribute to the field's knowledge base by providing stronger preliminary evidence for a potential causal relation between executive functioning deficits and learning difficulties during early childhood. We do so by establishing the executive functioning deficits (a) temporally precede very low levels of achievement in both reading and mathematics and (b) continue to be predictive even with extensive statistical controls for strong potential confounds. Evidence of these two conditions helps to establish that two variables are causally related (Finkel, 1995). Our study internally replicated evidence of this general relation. Specifically, our results indicate that a relation is evident between two specific types of executive functioning deficits and two specific types of learning difficulties, as well as following statistical control for many potential confounds including for the strong confounds of the same-and other-domain autoregressors as well as prior behavioral self-regulation. In addition to addressing identified methodological limitations in the field's understanding of the general relation between executive functioning deficits and learning difficulties, our study also helps address substantive limitations. This includes the substantive limitation regarding the relative contributions of specific subcomponents of executive function to children's academic achievement. To date, rigorous studies have mostly not included multiple subcomponents of executive function in the same regression analyses (Fitzpatrick & Pagani, 2012;Jacob & Parkinson, 2015). Consequently, it has been unclear which specific subcomponents of executive function are most strongly related to children's academic achievement. This is an important substantive limitation because of the resulting ambiguity regarding which of these subcomponents (e.g., working memory vs. cognitive flexibility) constitutes the most promising target of early interventions efforts to prevent or remediate learning difficulties. Consistent with prior work (e.g., Toll et al., 2011), our study results indicate that, relative to deficits in cognitive functioning, deficits in working memory are more strongly predictive of experiencing learning difficulties during early childhood. Thus, early intervention efforts designed to prevent or remediate learning difficulties may be more effective if they target deficits in working memory than in cognitive flexibility. An additional substantive limitation of the existing knowledge base has been the lack of rigorous research establishing that executive function is related to both reading and mathematics achievement. For example, Jacob and Parkinson (2015) reported that the currently available studies have not found that executive function was uniquely predictive of both reading and mathematics achievement after covariate adjustment for potential confounds. 2 We find this to be the case. Jacob and Parkinson's (2015) synthesis found only limited evidence that the relation between executive function was stronger for mathematics than for reading achievement. They further reported that neither working memory nor cognitive flexibility displayed a stronger relation with mathematics than for reading achievement. Our study's results help to clarify the nature of these hypothesized causal relations. We find that the relation between executive functioning deficits is relatively stronger for mathematics than for reading difficulties. We also find that working memory deficits increase kindergarten children's risk for reading as well as for mathematics difficulties more strongly than cognitive flexibility deficits."}, {"section_title": "Conclusion", "text": "Results from our analyses of a nationally representative and longitudinal sample indicate that executive functioning deficits are uniquely predictive of kindergarten children's risk for later experiencing learning difficulties. This general relation is evident across two specific types of executive functioning deficits and across two specific types of learning difficulties, as well as following extensive statistical control for strong potential confounds including two types of autoregressors and prior behavioral self-regulation. Working memory deficits are a relatively stronger risk factor for very low academic achievement than cognitive flexibility deficits. Our findings provide empirical support for experimental evaluations of schoolbased, multi-component interventions designed to address the early onset of learning difficulties through the remediation of executive functioning deficits, particularly in working memory."}, {"section_title": "Supplementary Material", "text": "Refer to Web version on PubMed Central for supplementary material. funding from the National Institute of Child Health and Human Development, National Institutes of Health (R24HD041025-11). No official endorsement should thereby be inferred."}, {"section_title": "Highlights", "text": ""}, {"section_title": "•", "text": "Executive functioning deficits in kindergarten uniquely predict reading and mathematics difficulties in first grade\nExecutive functioning deficits more strongly predict mathematics difficulties than reading difficulties, although these deficits predict both types of difficulties\nWorking memory deficits more strongly predict mathematics and reading difficulties than cognitive flexibility deficits  "}]