[{"section_title": "Abstract", "text": "The discovery that the apolipoprotein E (apoE) ε4 allele is genetically linked to both sporadic and familial late-onset Alzheimer's disease (AD) raises the possibility that a dysfunction of the lipid transport system could seriously affect lipid homeostasis in the brain of AD subjects. The presence of the ε4 allele has been associated with lower levels of apoE in both serum and brain tissues of normal and AD subjects. In an attempt to reverse the apoE deficit in AD, we identified and characterized several apoE inducer agents using a low-throughput in vitro screening assay. The most promising of these compounds is called probucol. Administration of probucol, an old cholesterol-lowering drug, in a pilot trial in mildto-moderate sporadic AD led to a significant increase in cerebrospinal fluid (CSF) apoE levels and a decrease in CSF in both phosphorylated tau 181 and beta-amyloid 1e42 concentrations without significant modifications of lipid hydroperoxide levels."}, {"section_title": "Introduction", "text": "In the last 10 years or so, it has become obvious that the number of patients with Alzheimer's disease (AD) has increased noticeably around the world. To fully understand the situation, we need to take a look at life expectancy over the past few centuries. Fig. 1A illustrates changes in human life expectancy since the beginning of the Christian era nearly 2000 years ago. Eighteen hundred years were necessary before a modest increase in life expectancy could be detected in European populations (Finch, 2012) . However, life expectancy drastically changed these past 200 years where it nearly doubled at the turn of the current millennia (Wilmoth, 2000) .\nAccording to recent data from the World Health Organization, a new case of AD occurs every 7 seconds worldwide. In the United States, it is estimated that there are >5.1 million patients with AD (US Alzheimer's Association, 2010), whereas it exceeds 6 million cases in Europe. Germany, Italy, and France are at the top of the list, the latter currently having >900,000 cases. Recent research findings from Asia indicate that there are >6 million cases in China alone. Fig. 1B gives the most cautious projections, based on US data, as to the number of cases expected by 2050 (US Alzheimer's Association, 2010). Furthermore, roughly two-thirds of patients with diagnosed AD are women.\nSporadic AD is now considered to be a multifactorial disease with a preeminent genetic component. The identification of specific mutations and polymorphisms in genes associated with common AD has certainly changed our perception of the nature of the molecular changes controlling the pathophysiological process that characterizes the disease. The early-onset familial autosomal form of AD accounts for roughly 1%e2% of all cases worldwide, whereas the sporadic form of AD, representing 98%e99% of the remaining cases, is generally believed to be of late onset, occurring after 65 years of age."}, {"section_title": "Vascular changes and AD", "text": "Converging evidences indicate a strong relationship between lipid homeostasis alterations and vascular changes in the brain of demented subjects. These associations include recognition that apolipoprotein E (apoE) ε4 allele, apoJ and ABCA7 genes (all being involved in cholesterol transport) are major genetic risk factors for vascular dementia and familial and sporadic AD; epidemiologic studies linking genetic and environmental vascular risk factors to dementia; awareness that small strokes do precipitate clinical dementia in cognitively normal elderly people with AD pathology; modulation of the degradation of the APP and tau metabolism by pharmacologic manipulations of cholesterol metabolism; association between hypercholesterolemia and amyloid deposition in young adults without symptoms of dementia; and abnormal appearance of microvascular endothelial cells in brain areas affected by AD (Poirier, 2003 ).\nThe precise mechanisms by which any or all these lipid-related risk factors affect the pathophysiology of AD remain to be clarified. However, several independent epidemiologic and clinical studies examining the effect of cholesterol-lowering drugs such as probucol, simvastatin, and pravastatin on the incidence and/or progression of AD suggest a protective effect in subjects with varying risk of vascular diseases (Jick et al., 2000; Poirier, 2003; Wolozin et al., 2000) , particularly in the case of older statins such as pravastatin and simvastatin (Bettermann, 2011; Wolozin et al., 2007) . Many of these studies support the notion of a subtle but significant interplay between cardiovascular (environmental and genetic) risk factors and the onset and/or progression of AD."}, {"section_title": "Genetics and risk levels", "text": "Although >695 genes (and 2973 different polymorphisms) have thus far been examined and many have been proposed as putative genetic determinants of sporadic AD, none (except apoE) has yet been definitively accepted as such, in view of the lack of robustness of the associations observed between independent populations (Bertram et al., 2007 and http://www.alzgene.org). Meta-analyses (n ¼ 320) of these genetic variants have been performed systematically in recent years. These studies have reached 3 conclusions: (1) except for the ε4 polymorphism of the apoE gene and other polymorphisms at this locus (promoter polymorphisms), very few genes are consistently associated with sporadic AD and they are all minor genetic determinants (Bertram et al., 2007) ; (2) except for few genetic variants studied in detail, such as the insertion/deletion of the a2-macroglobulin (59 publications), most genes have been studied by only 1 or 2 laboratories; and (3) most of the time, very few genetic variants have been analyzed for each gene and they often differ from one study to another. To overcome some of these intrinsic problems, beyond the sharing of data using international databases, the study of AD genetics, like that of most multifactorial diseases, has turned toward very high-throughput genotyping analyses. Populations exceeding several hundreds, even thousands of samples have been used to generate sufficient statistical power to characterize the polymorphisms in the genes involved with the disease among the hundreds of thousands of polymorphisms in each individual. This type of approach has been recently successful in AD with the characterization of the APOJ, CR1, PICALM, BIN1, ABCA7, and CD33 loci as new genetic determinants of AD (in addition to the well-established apoε4 variant) (Harold et al., 2009; Lambert et al., 2009; Seshadri et al., 2010) with at least 1 independent genome-wide association study (GWAS) replication for each major candidate. However, if the estimate that 60%e80% of the AD risk in twin studies is because of genetic factors is correct, a non-negligible part of the additional genetic susceptibility loci remains to be identified. Table 1 summarizes some of the top consensus candidate genes associated with (1) the familial autosomal form of the disease and (2) the sporadic (common) form of the disease. The case of the butyrylcholinesterase (BuChE) gene is particular in that it was identified by GWAS using amyloid-deposition imaging and not disease status as pairing association criteria (Ramanan et al., 2013) . What is most interesting in this list of genetic risk factors is the high number of lipid-related genes. Fig. 2 illustrates some of the known biologic functions of the top 6 genes in Table 1 in the context of cholesterol homeostasis. ApoE and apoJ (also referred to as clusterin) were originally cloned in the early 1990s from a complementary DNA differential screening of messenger RNAs (mRNAs) expressed in the AD hippocampus (May et al., 1990) . Analysis of the expression of both mRNAs in experimentally deafferented hippocampus of rats revealed a time-course profile that clearly indicates a strong association between apoE and apoJ overexpression and active compensatory synaptogenesis (May et al., 1990; Poirier et al., 1991) . ApoE and apoJ are normally synthesized and secreted by astrocytes and microglia in the brain and bind to high-density lipoproteins (HDLs) to facilitate cholesterol and phospholipids mobilization and transport toward cell surface receptors belonging to the lowdensity lipoprotein (LDL) receptor family (Beffert, 2003) . As mentioned earlier, butyrylcholinesterase, which is best known for its ability to degrade acetylcholine both in the central nervous system and in periphery (Giacobini, 2000) , is also involved in lipoprotein remodeling (Annapurna et al., 1991; Iwasaki et al., 2007) . Internalization of the apoE-HDL particles by members of the LDL receptor family occurs primarily in specific clathrincoated pit structures in the plasma membrane where both BIN1 and PICALM gene products were shown to facilitate endocytosis of large complexes (McMahon and Boucrot, 2011) . Once internalized via endocytic processes, the HDL complex is degraded and the cholesterol is released and esterified via the acylCoA:cholesterol acyltransferase for midterm storage purpose (Fig. 2) . When intracellular concentration of cholesterol exceeds physiological requirements, a portion of the cholesterol is returned to the plasma membrane using the ABCA1/A7 reverse intracellular transport system for final transfer to surface-bound HDL complexes. This molecular cascade involves 6 of the top 10 genetic risk factors for AD identified by GWAS these past 5 years. In contrast with the disease-causing autosomal dominant genes, which specifically target the APP or its processing (via the presenilins), the socalled risk factors involved in sporadic AD are primarily related to the immune system and the lipid metabolism."}, {"section_title": "ApoE and cholesterol transport in AD", "text": "The brain is a major site of apoE mRNA expression in humans, marmosets, rats, and mice, exceeded only by the human liver. Transcripts for apoE are distributed throughout all regions of the brain and have been localized to astrocytes and microglia by in situ hybridization. Accordingly, apoE was shown to be synthesized and secreted mostly by glial cells (>95%) and to serve as a ligand for the members of the LDL receptor family in the brain (Herz and Beffert, 2000) . Primary cultures of hippocampal neurons from rat embryos and pro-simians have the capacity to internalize apoE-containing lipoproteins. Over the years, several explanations have been devised to address the pathophysiological role of apoE in the brain of ε4 carriers. These working hypotheses can be divided on the grounds of their respective target metabolic cascades. The first one revolves around the concept that apoE4 directly and indirectly compromise amyloid metabolism and causes a toxic accumulation of the amyloid beta over time. This hypothesis has been reviewed extensively recently (Kim et al., 2009 ) and will not be addressed in the present review. The second hypothesis implicates tau protein metabolism and assumes that apoE is released in the cytoplasmic compartment, where it interferes directly with the cytoskeletal architecture of neurons (Brecht et al., 2004) . Finally, the third hypothesis, which stems in part from our understanding of the role of apoE in the cardiovascular system, postulates that this core apolipoprotein acts as a key player in the maintenance of lipid homeostasis in the mature brain and that carriers of the apoε4 allele display reduced levels of apoE compared with non-ε4 carriers (Poirier, 2005) .\nThe major physiological differences between apoE4 and -E3 are attributed to the amino acids at 2 key positions in the peptide chain, numbered 112 and 158, each of which can either be arginine (R) or cysteine (C). In periphery, the presence of R112 in apoE4 causes its preferential binding to triglyceride-rich lipoproteins (chylomicrons and very low-density lipoproteins), whereas apoE3 binds preferentially to HDLs. These differences in lipoprotein binding by apoE3 and -E4 greatly influence lipoprotein clearance and LDL/HDL ratios in periphery, which are risk factors in cardiovascular disease. However, it should be noted that the brain is entirely devoid of LDL and highly dependent on HDL to maintain cerebral lipid homeostasis. The semidominant nature of the association between the apoε4 allele and sporadic AD has been firmly established only recently (Genin et al., 2011) ."}, {"section_title": "Apoε4: a case of evolutionary underperformance", "text": "Apoε3 variant appears to have spread during later stages of human evolution after originating from the ancestral apoε4 gene. According to DNA sequences representing 4 distinct ethnic groups, apoε3 is estimated to have spread some 225,000 years ago. The depth of the tree is estimated at 311,000 years ago (range 0.176e0.579) (Fullerton et al., 2000) . Although these sequence analyses do not inform when ε3 originated as a mutation, they imply that ε3 arose before anatomically modern Homo sapiens first migrated from Africa about 100,000 years ago. This range also allows ε3 to be present in Neanderthals (from 300,000 years ago) and in earlier ancestors of Africa from which H. sapiens is thought to have diverged. Only 1 apoE genotype has been reported in chimpanzees that closely resembles human apoE4 with arginine (R) at positions 112 and 158 (Table 2) (Hanlon and Rubinsztein, 1995) . All other primates examined so far have arginine at 112 and 158 (Finch and Sapolsky, 1999) . Because of these similarities between human apoE ε4 and primate apoE and because of the sequence analysis of the genealogical depth of human apoE alleles, human apoE ε4 is considered the ancestral allele in primates (Hanlon and Rubinsztein, 1995) . It should be noted that rodent apoE and that of many other mammals belong to the apoE type 4 family. Interestingly, apoE ε2 allele, which was shown to confer significant protection against sporadic AD, also happens to be overrepresented in human centenarians (Blanche et al., 2001; Frisoni et al., 2001) , clearly pointing toward a role in longevity and successful aging. These and other observations argue against the hypothesis that apoE ε4 allele exerts its main effects in the AD brain through gain of toxic activity as proposed by some investigators."}, {"section_title": "Synaptic plasticity and integrity in AD as a function of apoE ε4 allele dose", "text": "In the nervous system, the importance of the polymorphic nature of apoE has recently been revealed, with regard to function in neuronal plasticity and with respect to pathologies such as dementia of the Alzheimer type (Poirier, 1994) . ApoE ε4 allele was shown to be strongly associated with the familial and sporadic forms of AD (Poirier et al., 1993; Strittmatter et al., 1993) . The apoε4 allele can affect the rate of progression of the disease, the extent of the neuronal cell loss, cholinergic activity, accumulation of amyloid plaques in hippocampal and cortical areas, and total beta-amyloid production and deposition in the brain of AD subjects. ApoE ε4 carriers were also shown to exhibit poor synaptic remodeling and defective compensatory plasticity in vulnerable brain areas in AD (Arendt et al., 1997; Beffert et al., 1998) , particularly in cholinergicrich region . Actually, the role of apoE in the maintenance of synaptic integrity and plasticity is so central to brain physiology that the ability of a subject to recover from traumatic brain injuries is highly dependent on apoε4 allele dose (Friedman et al., 1999; Lichtman et al., 2000) .\nThe effect of apoE genotype on synaptic plasticity and recovery is not restricted to the AD condition. Whereas the apoE ε4 allele is associated with poor clinical outcome in patients with Parkinson's disease (Li et al., 2004) , stroke (Nicoll et al., 1996; Slooter et al., 1997) , amyotrophic lateral sclerosis, or other type of neurodegenerative disease (Hogh et al., 2000; Sorbi et al., 1995) , apoE ε2 allele was found to be protective against several neurodegenerative diseases, including sporadic and familial late-onset AD (Corder et al., 1994) ."}, {"section_title": "ApoE genotype versus apoE levels", "text": "The notion that human ε4 allele carriers are unable to maintain effective apoE concentrations in blood, brain, or cerebrospinal fluid (CSF) relatively to other isoform carriers has gained momentum in recent years. The original concept stems from observations made by Utermann et al. (1980) >30 years ago about the fact that humans expressing the apoE ε4/3 and apoE ε4/4 genotype display the lowest apoE blood levels of all living humans, whereas those with an apoE ε2/2 genotype (centenarian candidates) belong to a small group of humans with the highest blood concentration of apoE (for a review, see Poirier, 2008) . This is true for blood (Gupta et al., 2011; Panza et al., 2003; Poirier, 2005; Soares et al., 2012; Utermann, 1985) , brain tissues (Beffert et al., 1999; Bertrand et al., 1995) (Glockner et al., 2002) , and CSF (Cruchaga et al., 2012 ) (GWAS study in Alzheimer's Disease Neuroimaging Initiative [ADNI]) in humans and in fresh brain tissues from apoE ε4 knock-in mice ) when using liquid chromatography followed by tandem mass spectrometry (LC/MS/MS) quantitative methodology. Fig. 3B summarizes key published findings. Recently, cross-sectional analysis of the subjects enrolled in ADNI revealed a progressive reduction of plasma apoE concentrations as a function of disease progression, that is, normal cognitive controls > nonconverting mild cognitive impairment (MCI) > converting MCI ¼ AD (Fig. 3C) . Similar observations were recently reported in the CSF of ADNI subjects, with a highly significant decline in CSF apoE levels: CTL > MCI > AD.\nThe notion that compromised apoE levels in the central nervous system of apoE ε4 carriers contributes significantly to the pathophysiological process in AD was further extended by work performed in apoE knockout mice. The complete absence of apoE in the knockout mice is associated with progressive age-related cognitive deficit in the Morris swim maze (Champagne et al., 2002; Davignon et al., 1982; Oitzl et al., 1997; , a marked loss of cholinergic innervation with age (Kleifeld et al., 1998; Van Uden et al., 2000) and a pronounced loss of synaptic integrity after 10e12 months of age (Chapman et al., 2000; . Furthermore, long-term potentiation (Krzywkowski et al., 1999) , synaptic plasticity, and terminal proliferation (Champagne et al., 2005; are markedly compromised in apoE-deficient mice in presence of abnormally high concentrations of tau phosphorylation (Gordon et al., 1996) ."}, {"section_title": "ApoE as a potential therapeutic target?", "text": "The bulk of these observations led scientists to develop assays to identify potential apoE inducer agents that could be used in vivo for the treatment (and conceivably the prevention) of sporadic AD. Some of the most interesting apoE-inducing candidates identified so far include indomethacin (Aleong et al., 2003) , a potent antiinflammatory drug used in the past to treat mild-to-moderate AD (Rogers et al., 1993) ; estrogen, the controversial hormone that exhibits protective effect (Craig et al., 2005) ; and probucol, the cholesterol-lowering drug used to treat familial hypercholesterolemia (Champagne et al., 2003) . More recently, the Liver X receptor LXR) agonist T0901317 (Riddell et al., 2007) and the Retinoid X receptor (RXR) agonist bexarotene (Cramer et al., 2012) were both identified as modulators of the signaling cascade that regulate the acute synthesis of apoE, ABCA1/G1, and the LDL receptor family in the brain (for a review, see Leduc et al., 2010) .\nSupporting the notion that apoE induction might be beneficial for AD treatment; the potent apoE inducer bexarotene was shown to restore cognitive abilities in amyloid precursor protein (APP) transgenic mice as does LXR agonist T0901317 in a different APP mouse model. Although the bexarotene cognitive benefit was recently replicated (Fitz et al., 2013) , it is not clear that these effects have anything to do with resorption of fibrillary amyloid or the amyloid metabolism itself. The nuclear activators are used for the treatment of cancer, where moderate toxicity is tolerated but are not safe enough for long-term use in either prevention or treatment of AD. Safer apoE inducers are needed, and the lipid-lowering drug probucol could be used as such an agent.\nProbucol is an old cholesterol-lowering drug formerly given to treat hyperlipidemias and still used in many Asian countries. Added to rat and mouse diet (1% w/w), it achieves plasma concentrations that mimic those of high human doses (w1 g per day) and induces cortical and hippocampal apoE synthesis (Champagne et al., 2003) . Probucol was shown recently to suppress enterocytic Ab in the cerebral vessels of mice on a high-fat diet (Pallebage-Gamarallage et al., 2012) and to prevent cognitive and synaptic impairment resulting from intravascular Ab injections (Santos et al., 2012) .\nA few years ago, our team ran a small pilot proof-of-concept study of the then-standard dose of probucol (500 mg b.i.d.) in 12 people with mild-to-moderate AD who were not taking cognitive enhancers. We found a probucol-related increase in serum apoE (Poirier and Panisset, 2002) as reported earlier in cardiovascular trials (McPherson et al., 1991; Quinet et al., 1993) and saw a similar increase in CSF apoE after 1 month of treatment. Testing probed the stabilization of scores on Alzheimer's disease Assessment ScaledCognitive (ADAS-Cog) and MMSE and improvement on the Disability Assessment of Dementia scales over the 6-month trial. Cumulative probucol dosage (pill count) correlated in a dose-dependent fashion with CSF apoE levels (Fig. 4A) . We also found that serum probucol levels measured by LC/MS/MS correlates well with changes in ADAS-Cog after 6 months (not shown). Cumulative dosage correlated similarly with ADAS-Cog change (Fig. 4B ). Fig. 4C shows correlation between changes in CSF apoE levels after 1-and 6-month improvement on the ADAS-Cog. Recently, we reassessed CSF levels of total tau (Ttau), phosphorylated tau (p-tau) 181, and Ab42 using the widely used Innogenetics Alzbio3 kit on a Luminex apparatus. Fig. 4D illustrates the result of a contrast analysis between apoE alteration and changes in p-tau concentrations in the brain, the ladder serving as a marker of neuronal damage. These findings Fig. 3 . Apolipoprotein E (ApoE) levels in different regions according to apoE genotype or diagnosis. (A) Human hippocampal and frontal cortex apoE levels as a function of disease status and APOE genotype (adapted from Beffert et al., 1999) . Data represent average AE standard error of the mean. Statistical analysis: p < 0.05 for both APOE genotype and pathology effect (analysis of variance [ANOVA]) in the hippocampus; not significant, p ¼ 0.12 for APOE genotype (ANOVA) in the frontal cortex. (B) Plasma apoE levels as a function of APOE genotype in mild-to-moderate Alzheimer's disease (AD) cases (p < 0.001, adapted from Poirier, 2005) . (C) Baseline plasma apoE levels as a function of disease progression and diagnosis (p < 0.001, adapted from Soares et al., 2012) . The diagnosis was established at the follow-up, which was no later than 48 months after the first visit. ApoE levels are lower in patients with AD and mild cognitive impairment (MCI) compared with healthy age-matched controls. Data represent means and 95% confidence intervals. MCInp, MCI patients who were not diagnosed with dementia at the follow-up; MCIp, patients with MCI who were diagnosed with dementia at the follow-up; and HCS, healthy control subjects.\nextended earlier results showing that apoE increase predicted decreased Ab load, reflecting the amyloid scavenging properties of apoE-HDL complexes (Poirier, 2003) and the removal of amyloid peptides from the brain to the CSF. Overall, improvement in CSF apoE concentration in probucol-treated subjects correlates well with cognitive performance, decline in p-tau, and scavenging of total amyloid into the CSF."}, {"section_title": "Conclusions", "text": "Clinical trials with potential treatments for AD have ended in repeated failures, without any new agents approved since 2003. Despite the obvious need, attempts to develop new drugs or especially prevention strategies have often encountered safety concerns. To avoid such problems, the field has turned increasingly to safer lifestyle interventions. These have achieved some success in other applications but usually require sustained behavioral interventions that may be of questionable \"real-world\" utility. More typically, even strong evidence fails to dissuade most people from health-adverse behaviors. Pharmacoprevention strategies may be more effective, but new drug development has been impeded by the enormous resources needed for discovery and testing of new agents (e.g., development times for new products often exceeding 13 years). Drug \"repurposing\" may offer a more efficient alternative as suggested in this short review. Furthermore, familiar generic drugs have known safety profiles that can deter unexpected risks.\nGiven the many efforts by others based on the amyloid cascade hypothesis, we believe that a rationally justified, gene-based, alternate approach seems timely."}, {"section_title": "Disclosure statement", "text": "All authors declare no conflicts. Written informed consent was obtained from all participants involved in the different studies discussed in this review. Approvals for the different studies were obtained from the Douglas Mental Health Institute Human Research Ethic Committee. "}]