[{"section_title": "Abstract", "text": "Historically, African languages have been in a disadvantaged position and issues related to dialect are not fully understood and acknowledged. In this study, we examined the influence of dialects and code-switching on the literacy and numeracy achievements of isiXhosa Grade 1 learners with Multilevel Modeling (MLM), when controlling for other factors, such as between-school variance, socio-economic status, and sex. The project used stratified random sampling to select Afrikaans, English, and isiXhosa schools in three districts in the Western Cape. A total of 2 497 learners were assessed, of whom 768 were in isiXhosa schools. Dialects and codeswitching had a significantly negative influence on both literacy and numeracy scores of isiXhosa learners. The findings highlight the importance of investigating dialectic issues in isiXhosa and the implications that dialects have for decolonisation. African language decolonisation requires the development of classroom resources for these languages, increased African educational research, and finding ways to address the complexities of dialects in pedagogical frameworks."}, {"section_title": "Introduction", "text": "IsiXhosa has had the longest lexicographical development of the African languages in southern Africa. The earliest written isiXhosa lexicography dates back to 1776 (Nkomo & Wababa, 2013) . About 16 isiXhosa lexicographical works were published between 1776 and 2008. Given the number of isiXhosa dicti lexicography, one would expect but many mistranslations and dialectic issues persist (Moropa & Kruger, 2000) . There are several isiXhosa-speaking commun many as 12 groupings, which are also associated with specific dialects of isiXhosa (Nyamende, 1994) . To better understand isiXhosa as a language, it is important to address the historical events that led to what we know today as standardised isiXhosa. Theodorus van der Kemp was the first missionary to live with an isiXhosa tribe people in 1799 while they were ruled by Chief Ngqika (Nyamende, 1994) . Van der Kemp learned the Ngqika dialect with the Ndlambe and Thembu dialects into the Ngqika dialect. The missionaries who succeeded Van der Kemp also began to t the Ngqika dialect in schools. These pioneering processes led to this dialect becoming what is known today as the standardised isiXhosa language. With the further development of the written isiXhosa language, the Ndlambe and Thembu dialects were also 1994). The Ngqika, Thembu, and Ndlambe dialects are recognised as the official written and taught isiXhosa and enjoy a higher status among isiXhosa speakers (Gxilishe, 1996; Mtsatse, 2018) . Mtsatse (2018) has reflected on Lodge's (1995) framework Language is a sum of its dialects as the official isiXhosa. This is in contrast to other dialects not proper isiXhosa. A diagram of the standardisation of specific isiXhosa dialects is presented in Figure 1 . Figure 1 shows that the standard isiXhosa Ngqika and Thembu. Although not illustrated in the figure, the Ndl to be closely related to these two dialects. taught in schools and used in government documents and communications in Eastern and Western Cape. On the right side are spoken in different parts of Eastern Cape by communities from different tribes. Despite the fact that there are several isiXhosa dialects, the official isiXhosa is spoken in a smaller geographical area (between the Great Kei and Idutywa dialects. The choice of one dialect to be the standardised isiXhosa is a product of colonialism Mtsatse and Combrinck: Dialects matter the number of isiXhosa dictionaries published and its long history of one would expect that isiXhosa as a language would be relatively standardised, but many mistranslations and dialectic issues persist (Moropa & Kruger, 2000) . There are speaking communities in South Africa, grouped according to tribes, with as many as 12 groupings, which are also associated with specific dialects of isiXhosa To better understand isiXhosa as a language, it is important to address the hat led to what we know today as standardised isiXhosa. Theodorus van der Kemp was the first missionary to live with an isiXhosa tribe; he lived with the isiXhosa people in 1799 while they were ruled by Chief Ngqika and lived along the Tyume River e, 1994). Van der Kemp learned the Ngqika dialect that shares many similarities with the Ndlambe and Thembu dialects, wrote it for the first time, and translated into the Ngqika dialect. The missionaries who succeeded Van der Kemp also began to t the Ngqika dialect in schools. These pioneering processes led to this dialect becoming what is known today as the standardised isiXhosa language. With the further development of the written isiXhosa language, the Ndlambe and Thembu dialects were also included (Nyamende, and Ndlambe dialects are recognised as the official written and taught isiXhosa and enjoy a higher status among isiXhosa speakers (Gxilishe, 1996; Mtsatse, on Lodge's (1995) framework for standardising Language is a sum of its dialects. However, in isiXhosa three dialects are recognised mostly as the official isiXhosa. This is in contrast to other dialects that are seen to be A diagram of the standardisation of specific isiXhosa dialects is A reconstructed figure illustrating dialect issues in isiXhosa (Mtsatse, 2018, adapted from Lodge shows that the standard isiXhosa is comprised of mainly two dialects, namely Ngqika and Thembu. Although not illustrated in the figure, the Ndlambe dialect is also seen closely related to these two dialects. Together, these dialects form the official isiXhosa taught in schools and used in government documents and communications in Eastern and side are dialects that have not been standardised; these dialects are spoken in different parts of Eastern Cape by communities from different tribes. Despite the fact that there are several isiXhosa dialects, the official isiXhosa is spoken in a smaller een the Great Kei and Idutywa-Bashee Rivers) compared to the other one dialect to be the standardised isiXhosa is a product of colonialism onaries published and its long history of that isiXhosa as a language would be relatively standardised, but many mistranslations and dialectic issues persist (Moropa & Kruger, 2000) . There are grouped according to tribes, with as many as 12 groupings, which are also associated with specific dialects of isiXhosa To better understand isiXhosa as a language, it is important to address the hat led to what we know today as standardised isiXhosa. Theodorus van der lived with the isiXhosa and lived along the Tyume River shares many similarities and translated the Bible into the Ngqika dialect. The missionaries who succeeded Van der Kemp also began to teach the Ngqika dialect in schools. These pioneering processes led to this dialect becoming what is known today as the standardised isiXhosa language. With the further development of the included (Nyamende, and Ndlambe dialects are recognised as the official written and taught isiXhosa and enjoy a higher status among isiXhosa speakers (Gxilishe, 1996; ing a language. owever, in isiXhosa three dialects are recognised mostly to be non-standard or A diagram of the standardisation of specific isiXhosa dialects is adapted from Lodge, 1995) mainly two dialects, namely ambe dialect is also seen these dialects form the official isiXhosa taught in schools and used in government documents and communications in Eastern and t have not been standardised; these dialects are spoken in different parts of Eastern Cape by communities from different tribes. Despite the fact that there are several isiXhosa dialects, the official isiXhosa is spoken in a smaller compared to the other one dialect to be the standardised isiXhosa is a product of colonialism that persists, perhaps to the disadvantage of those who do not speak the officially recognised dialect.\nIn this paper we explore how being taught in an unfamiliar dialect influences literacy and numeracy skills in Grade 1. Considering that dialectic changes and code-switching are significant indicators of scholastic performance, it is essential to discuss the implications of this as well as how the issue of dialects is linked to decolonisation."}, {"section_title": "Language planning in South Africa", "text": "Language planning in South Africa was one of the critical obligations undertaken after 1994 to rebuild national pride and to restore the values of integrity, respect to cultures and races, and to recognise the importance of diversity. To implement this mandate, practical measures to grow the status of African languages were sought and language policies were developed (Department of Basic Education (DBE), 2010; Yu & Dumisa, 2015) . Agencies, policies, and bodies, for example the Pan South African Language Board (PanSALB), were also established to develop and promote African languages. PanSALB was set up as a statutory body to monitor and implement the use and status of all official languages in South Africa. This body has structured lexicography units for each official language to ensure terminology standardisation and to promote multilingualism (Edwards & Ngwaru, 2011) . Although language planning was high on the reconciliation agenda, Alidou et al., (2006) have noted that most of the terminology work in African languages was in fact done during the apartheid era and remains in use today. Additionally, Webb (2013) has emphasised that nothing of real substance has changed since 1996 with regard to the state of the African languages. There seems to be very little evidence from government that the country's language policy has actively developed the African languages in terms of codification and graphisation. Other than in formal schooling structures, African languages are not used meaningfully in parliament, courts of law, universities, schools, and the printed media (Webb, 2013) . The fact that African languages are not used in formal societal structures creates the impression that Afrikaans and English continue to enjoy a higher linguistic status. To a disproportionate degree, the status of African languages remains the same as it was during apartheid. Cele (2004) , Foley (2004) , Tshotsho (2013), and Webb (2013) have further criticised the language policies as being too politicised, which has resulted in their poor implementation. The implementation challenges are attributed to two factors-the difficulties of balancing the interests of all 11 official languages and the slow linguistic development of African languages, which includes standardisation and making these languages relevant to advance literature, science, and technology. The standardisation of African languages remains problematic and the complexities of dialects make the commonalities in Nguni and Sotho clusters, as well as their differences, difficult to navigate (Edwards & Ngwaru, 2011) . From the translator's perspective, it is the differences in orthography that makes it challenging to standardise African languages. Prinsloo (2011) has proposed that it should be the right of the language speakers, rather than the right of the language, that guides the true essence of the debate around African languages in South Africa. There are also linguistically diverse societies within cultures, and, because of migration African languages and their dialects are no longer limited to specific geographical regions, cultures, or tribes. In the new democratic South African classrooms there are often learners with multiple home languages (DBE. NEEDU, 2013) . Languages spoken at home could be based on the standardised form of the language, or could use dialects, and/or mixtures of dialect and/or additional languages. Through social change, African languages have evolved, developed, and become different orthographies within one language, leading to different dialects (Prinsloo, 2011) . The dialectisation of African languages is a complicating factor when one is deciding on which dialect can be used or classified as the standardised language in which learners can be taught."}, {"section_title": "National and international studies of literacy and numeracy achievement", "text": "Large-scale assessments in South Africa include the Annual National Assessments (ANAs), the Progress in International Reading Literacy Study (PIRLS), and the Western Cape Systemic Testing. In 2010, DBE introduced a systemic evaluation, the ANAs. Some of these results showed that the participating learners were inadequately equipped in their home languages (DBE, 2012 (DBE, , 2014 . Learners in the Foundation Phase were assessed in their home language and the results revealed that achievement was lower for African language speakers (with the exception of Afrikaans). PIRLS is one of the few comparative studies of African languages in South Africa . Although the assessment is administered in Grades 4 and 5, the learners are assessed in their language of learning and teaching (LoLT) in the Foundation Phase (Howie, Van Staden, Tshele, Dowse, & Zimmerman, 2012; . As seen with the ANAs, learners who wrote the test in Afrikaans and English achieved the highest average scores in South Africa and outperformed those writing in the African languages. The PIRLS 2016 results revealed that most Grade 4 learners writing in an African language (80% and more) were not able to read for meaning .\nThe Trends in International Mathematics and Science Study (TIMSS, 2015) reported that South African Grade 5 learners ranked as the second lowest when compared to the other 48 countries that participated in the most recent TIMSS cycle (Isdale, Reddy, Juan, & Arends, 2017) . In TIMSS 2015, Grade 5 learners who spoke the language of the test at home performed better, once again highlighting the importance of literacy and how strongly it is related to numeracy achievement (Isdale et al., 2017) . In both PIRLS and TIMSS, South Africa was one of the lowest performing countries and significantly below the international average. The findings of national and international studies show that problems are experienced in the South African school system, especially for learners who are taught in African languages in the Foundation Phase. The increase in cross-language assessments has posed dynamic challenges in the complex South African context and has raised the issue of how literacy is defined in African languages. For this reason, it is essential that crosslanguage assessments ensure that the content and scope of items are equitable for all participants across regions, cultures, and languages.\nWe must consider strict methodological guidelines that also cater for the complexities of African languages and find ways to decolonise African languages. Decolonisation in this context refers to researching and understanding how African languages are taught and assessed. This includes studying the limitations of current pedagogical practices and finding methods for teaching and assessing the African languages in ways that reflect their complexities, and then developing these languages for academic use."}, {"section_title": "Dialects and classroom practice", "text": "Literature on the influence of dialectic use in the classroom and learner performance in the South African context is limited to mostly postgraduate studies. The earliest study by Nomlomo (1993) explored the attitudes of teachers and learners towards isiXhosa and its different dialects. The study was qualitative and used a small, non-generalisable sample. One of the main findings was that teachers believed dialects should not be used in the classroom and that learners who were in schools further away from the area where the standardised isiXhosa was spoken, had lower class averages. A study by Spofana (2011) found that teachers used a dialectic vocabulary for instruction and learning purposes. In his study learners also responded in the classroom using their own dialect and used a dialectic vocabulary when completing classroom writing tasks. A recent study by Maqam (2015) found that Grade 8 learners were penalised for using their dialects in answering assessments, even though the teachers used dialects during lessons. Teachers, parents, and learners in Spofana's study also had negative attitudes towards the standardised isiXhosa and felt that it was culturally and politically inappropriate for a standardised version to be imposed on them. The limitation of Spofana's study was that only one dialect was explored in three schools. While the studies mentioned here add to our knowledge, more research is needed to understand the role of dialects in the classroom. Following De Beaugrande (1999) and Richter (2010) , in this study we aimed to explore the influence of dialects using theoretical underpinnings in language planning theory in which inclusive dialectic practices, social justice, and decolonisation of languages are emphasised. Our use of the term decolonisation refers to an examination, deconstruction, and redress of the pedagogical application of isiXhosa."}, {"section_title": "Research objective and questions", "text": "The main objective of the study was to quantify the influence of code-switching (dialects and different languages) on the literacy and numeracy achievements of Grade 1 learners in Western Cape.\nThere are three research questions related to the main objective.\n• Do isiXhosa Grade 1 learners require more code-switching to understand the assessment questions?\n• When controlling for other factors, what influence does the necessity of changing dialects and languages have on the literacy and numeracy achievements of isiXhosa Grade 1 learners?\n• Which variables are significant predictors of literacy and numeracy achievements of Grade 1 learners in Western Cape?"}, {"section_title": "Method", "text": "Assessors experienced in working with young children who spoke the language of the test as a home language, were recruited and trained to administer the assessments. These were done face-to-face, with the assessor asking a question up to three times. Computer Adaptive Testing (CAT) algorithms, based on Rasch models, were programmed into the application. The application was used on a tablet and the assessors tested each child with a booklet, asking the child a question and pointing to the booklet while recording the answer on the tablet. When a child answered a pre-set number of questions incorrectly, the application automatically skipped to the next section. At the end of the year, the children continued answering sections at the point they had reached at the beginning of the year. Children were not asked questions they would find too difficult but had another opportunity at the end of the year to answer question that were previously skipped.\nThe standardisation of test administration is pivotal to the validity of any study or intervention since unstandardised processes can cause confounding results. However, during the piloting of the International Performance Indicators in Primary Schools (iPIPS) instruments in Western Cape during 2015, it was found that, for the isiXhosa learners, the verbatim reading of the questions was not always feasible. Some isiXhosa learners came from homes where dialects other than the standardised version were spoken, while other learners came from multilingual environments. Therefore, so as not to disadvantage learners and to gain more accurate assessment results, assessors were trained to first read the standardised isiXhosa version of the question. If the assessor learned, by speaking with the child, that the child struggled with the standardised dialect or formal isiXhosa, the assessor was allowed to rephrase the question to accommodate dialectic complexities. At the end of the assessment assessors noted how often this was done so that the influence of changing dialects could be controlled when we were analysing the results. The aim was to gauge the proficiency of the learners in literacy and numeracy and therefore dialectic issues should not be the reason the child could not answer a question. For example, measuring a learner's ability to count from one to ten is part of the numeracy construct, and not whether they count in standardised or dialectic isiXhosa. The experience in this study highlighted the challenges of implementing cross-cultural assessments in the South African context, as well as the often-ignored complexities of dialects in the classroom environment."}, {"section_title": "Instruments", "text": "The questions used in the assessments were based on the iPIPS instruments, originally developed at the Centre for Evaluation and Monitoring (CEM) at Durham University in 1999. The assessments were adapted to the South African context and translated into three South African languages (Archer, Scherman, Coe, & Howie, 2010; Tymms, Howie, Merrell, Combrinck, & Copping, 2017) . Both Afrikaans and isiXhosa translators used the standardised form of the languages at the level a Grade 1 learner would understand. The vocabulary and terminology were aligned to the Curriculum Assessment Policy Statements (CAPS) (DBE, 2011) . Since CAPS specifies the use of standardised isiXhosa, other dialects were not used in translations. It was expected that learners in Grade 1 would have been taught according to CAPS and would therefore have learned standardised isiXhosa from Grade 0 or Grade 1.\nEvidence of the reliability and predictive validity of the iPIPS instruments has been shown in previous studies (Tymms, 1999; Tymms, Merrell, Henderson, Albone, & Jones, 2012) . During this study, the reliability and validity of the instruments were again investigated, especially considering the potential complications of translations that Tymms et al., (2017) have pointed out. Applying Rasch Measurement Theory (Linacre, 2016) showed differential item functioning (DIF) between languages for a third of the items in the reading and numeracy sections. Items exhibiting DIF between languages were excluded from the analysis.\nCertain sections, such as vocabulary and rhyming, could not be equated between the languages and were not directly compared (see Tymms et al., 2017) . Overall, the numeracy items for the total sample had a reliability of .78 for learners and .96 for items (42 items when excluding DIF items). The 63 literacy items had a learner reliability of .73 and an item reliability of .97.\nParents and/or guardians completed a home questionnaire that included questions about household assets and basic necessities, such as running water, as well as luxury items such as satellite television. The home questionnaire was answered by 72% of parents."}, {"section_title": "Sample", "text": "In total, 2 497 learners in 112 schools participated at the beginning and end of 2016, of which 31% were in isiXhosa schools (772 learners in 37 schools), as shown in Table 1 . A stratified, random sample of schools in three districts in Western Cape participated in the study. For each district, the sample was stratified in terms of language, classroom, and sex. From each school a random sample of 25 Grade 1 learners was selected. An equal number of isiXhosa, English, and Afrikaans schools was randomly selected in the districts, followed by an equal number of learners selected per class. Since schools were randomly selected in districts, the schools represent a broad range of socio-economic learning environments. The sample included both public and independent schools. According to data provided by the Western Cape Department of Education (WCED), 98% of the learners in the isiXhosa schools came from homes where isiXhosa was the main language spoken. Parents indicated similar answers on the study's home questionnaire, where 96% of parents of learners in isiXhosa schools indicated that this was also their home language.\nBased on the answers of the parents whose children attended the isiXhosa schools, 56% of households were in a lower socio-economic grouping, having only the basic necessities, or in some cases not even these (running water, electricity, and flush toilets.). This is in comparison to the learners from the Afrikaans schools (52%) and the English schools (13%), where fewer households were classified as being in the lower socio-economic group. Figure 2 shows the percentage of parents in each language group who reported not having electricity, running tap water, and flush toilets. The graph shows that a lack of basic resources was reported at higher frequencies in the isiXhosa group when compared to the other language groups. "}, {"section_title": "Data analysis", "text": "The analysis was conducted using the Statistical Package for the Social Sciences (SPSS) version 24 (IBM Corporation, 2016) for descriptive statistics and the Hierarchical Linear Program (HLM) (Raudenbush, Bryk, & Congdon, 2013) for MLM. The overall achievement per language group (isiXhosa, Afrikaans, and English) is reported in terms of means and standard deviations. Predictor variables were related to research and policy and had moderate to high correlations with achievement (see Enders, 2010; Dong & Peng, 2013) . The predictor variables at learner level were sex (male and female), socio-economic status (SES) (low, middle, and high), having attended Grade R, code-switching between dialects and codeswitching between languages. At school level, district (ordered from lowest performing to highest) and language of the test (ordered from lowest achievement to highest) were used. The outcome variables were literacy and numeracy scores at the end of the year. Literacy and numeracy were viewed as two distinct constructs, and separate models were built for each. A "}, {"section_title": "Results", "text": "The overall achievement and code-switching are reported in terms of descriptive statistics. The main achievement results are reported for all three language groups who participated in the study. The MLM models were applied to quantify the influence of code-switching on literacy and numeracy achievements for the Grade 1 participants when for controlling other variables."}, {"section_title": "Achievement results for iPIPS", "text": "In Figure 2 and Figure 3 the mean achievement for the Grade 1 participants per language group for literacy and numeracy is shown for the beginning and end of the year. In literacy achievement, the isiXhosa group started with the lowest mean at the beginning of the Grade 1 year (M = 18%, SD = 9) and also had the lowest mean at the end of the year (M = 35%, SD = 16) but made progress similar to that of the Afrikaans group (17-18% increase). The English group had the highest mean achievement for literacy at both the beginning of the year (M = 29%, SD = 15) and the end of the year (M = 54%, SD = 21). The Afrikaans group scored significantly higher at the beginning and end of the year in literacy when compared to the isiXhosa group, and the learners who wrote in English scored significantly higher than both the isiXhosa and Afrikaans groups (p = .000). Regarding literacy, the isiXhosa group started at a disadvantage in Grade 1, when compared to the other two groups (Figure 3 ). Numeracy End Year SD = 11) than the learners who wrote in isiXhosa and Afrikaans. The isiXhosa and Afrikaans groups were not statistically different from one another in their end-of-year numeracy achievement (p = .78) but the learners who wrote in English achieved significantly (p = .000) higher marks than the other two groups.\nCode-switching and influence on achievement\nAssessors completed two questions related to code-switching at the conclusion of each assessment session and rated their answers on a scale of never, sometimes, or most of the time. The first question asked was: How often did you change to another dialect or speak informal language? And the second question was phrased as: How often did you repeat the question by using a word or phrase from another language? (different from the language of the assessment).\nIn Figure 5 and Figure 6 the frequency of changing dialects, as well as using phrases and words from other languages, are shown per language of the test. Assessors reported that, for 57% of learners assessed in isiXhosa, they sometimes (31%) or most of the time (26%) had to switch to other dialects or informal isiXhosa to facilitate the assessment. In contrast, code-switching was rarely reported for learners assessed in Afrikaans (79% never or rarely) and English (86% never or rarely). In 69% of the isiXhosa assessments, the assessor had to rephrase the question sometimes or most of the time, using a word or phrase from another language. Rephrasing does not necessarily mean another dialect, but the formal standardised isiXhosa may have been too difficult for the Grade 1 learners to understand. Both dialect and phrasing influence the way in which learners interpret the assessment question.\nThe study had a multi-stage cluster sampling design with hierarchical groups that were interdependent. MLM was chosen as the best method for considering the cluster effects and data dependence. Two-level modelling was used, with learners at level 1 and schools at level 2. The proportion of explained variance (PEV) showed that between-school differences accounted for 21.04% of the variance in literacy achievement and 30.68% in numeracy Most of the time Sometimes Never or rarely achievement (intraclass correlation coefficient). Considering the large between-school variance, MLM was applied, as recommended (see Hox, 2010; Raudenbush & Bryk, 2002; Wang, Xie, & Fischer, 2012) . Level 1 predictors were grand-mean centred and a restricted maximum likelihood model was applied, first to calculate a null model and thereafter with the predictors added.\nIn Table 2 , the MLM results are presented with literacy end-of-year achievement as the outcome variable. The results are shown for the total sample (n = 2 497) as well as the isiXhosa sample (n = 772). For the total sample, which included all three languages of the test, all the coefficients were statistically significant (p < 0.05), except for switching language (using words or phrases from another language). At school level, the language of the test had a predictive coefficient of 5.26% (SE = 1.22), with isiXhosa being the lowest scoring test language (reference group).\nThe result indicates that being tested in Afrikaans or English could increase achievement by as much as 5%. The district of testing had an effect of 2.77% (SE = 1.23) at school level, so being in a higher performing district could increase literacy achievement by as much as 3%. At the learner level, sex was a significant indicator with girls achieving 3.57% (SE = 0.84) more in literacy than boys, when controlling for other variables. Having attended Grade R also indicated a potential gain of 5.10% (SE = 1.81) and SES was another strong indicator of increased literacy achievement (a potential 5% increase when being in a higher SES group). In all three language groups, when a learner needed the dialect changed or informal language to be used to understand the question, there was a potential loss of 2.93% (SE = 1.15). Using words or phrases from another language was not significant for the total sample (p = 0.14).\nWhen the PEV of the estimated literacy model is subtracted from the null model, a percentage of 2.54% remains.\nThe model was thereafter applied to the isiXhosa group separately (right-hand side of Table  2 ), and differences emerged. District was not significant at the school level for the isiXhosa group, whereas sex had a large predictive influence for the isiXhosa learners; girls could score as much as 5.44% (SE = 1.27) more than boys. Grade R attendance was not significant for the isiXhosa group, indicating that it is potentially not as effective in the isiXhosa schools as in schools of the other language categories. Socio-economic status (SES) was a significant predictor (3.74%), but not as large as it had been for the total group. When learners did not understand the assessment question and the assessor had to change to a different dialect, a large negative impact was observed for the isiXhosa group, with a potential reduction of 4.15% (SE = 1.29) in literacy achievement scores. Switching languages (using phrases or words from another language) could indicate a lower literacy achievement score for isiXhosa learners by as much as 3.29% (SE = 1.32).\nIn Table 3 , the model as applied to the end-of-year numeracy results for all three language groups are shown in the first column. The language of the test and the district were not significant at school level for the total sample. Sex was not significant, nor was switching languages in the numeracy model, applied to all three languages. A learner having attended Grade R could indicate a potential gain of 3.40% (SE = 1.02) and SES was again significant (2.60%), but not as large as was found in the literacy model. Changing dialects was significant but using a different language was not. The proportion of explained variance is 17.55% when the estimated model percentage is deducted from the null model (p = .000). Between-school variance explained 16.40% of the variance in isiXhosa Grade 1 numeracy achievement in the null model, as shown in Table 3 . There was less variance (differences) between isiXhosa schools than for all the languages combined (PEV = 30.68%), which is to be expected since a single language group should be more homogenous. The isiXhosa numeracy model showed that only SES, changing dialects, and using words or phrases from another language were significant predictors. The district, sex, or even having attended Grade R were not significant predictors of isiXhosa Grade 1 numeracy achievement (see Table 3 ). The numeracy model, when applied to the isiXhosa group, showed that changing dialects and using informal language had the largest negative impact on scores. The model indicates that linguistic complexities and dialects could play a more significant role in numeracy achievement for the isiXhosa group."}, {"section_title": "Discussion", "text": "The overall achievement among the three groups shows the potential disadvantage faced by the isiXhosa learners when compared to the other language groups included in this study. The isiXhosa learners start at a lower achievement level in Grade 1 and do not reach the same achievement as the other groups by the end of the year (with the exception of numeracy, in which their achievement is similar to the Afrikaans group). This achievement gap is probably the result of a host of differences among the groups, including socio-economic circumstances and linguistic complexities. The isiXhosa learners were more likely to come from homes that do not have basic living necessities such as running tap water and electricity. Dialectic issues further complicate the teaching and learning in isiXhosa schools. As concluded by Mtsatse (2018) , some isiXhosa foundation phase teachers have little to no knowledge about how to teach early reading in isiXhosa and use dialects as an aid in teaching practice.\nThis study examined specifically how code-switching to dialects and other languages influenced literacy and numeracy achievements of Grade 1 learners, using an international assessment. The more frequently the assessor had to change dialects or use other languages for the learner to understand a question, the lower was the overall achievement in both literacy and numeracy. The isiXhosa learners required significantly more code-switching than other language groups, which means they are more disadvantaged by language complexities. When the assessor had to change dialects or use informal language for the isiXhosa learner to understand assessment questions, a potential reduction of 4% in achievement could occur. A similar result was found when it was necessary to use words or phrases from other languages (2-3% potential reduction in achievement). While going to school in a higher performing district and attending Grade R could increase literacy achievement for the total sample, the same was not found for the isiXhosa group. The isiXhosa group's models did not indicate any advantage to being in a school in a different district or having attended Grade R.\nThe findings may indicate that learners who speak a dialect different from the standardised isiXhosa, or who do not have adequate isiXhosa language skills in Grade 1, start their schooling career at a significant disadvantage. A further implication is that learners who have lower linguistic abilities may be more likely to underachieve because they cannot compensate for the complexity of the classroom language environment. Learners raised in multilingual homes may lack orderly and adequate exposure for linguistic development (Flores, 2017; McLachlan, Nicholson, Fielding-Barnsley, Mercer, & Ohi, 2013; Skutnabb-Kangas, Phillipson, Mohanty, & Panda, 2009) . Languages develop in specific social and environmental contexts (O'Connor & Geiger, 2009) . Therefore, the linguistic profiles of learners from diverse backgrounds may not be as comparable as was once assumed (see Brooks, 2018) and the comparability of African languages with other languages has not been fully investigated. African languages are underdeveloped for modern demands because of colonisation, socio-economic disadvantages, and the long-term consequences of apartheid (Higgs & Van Wyk, 2011; Phatudi & Moletsane, 2013; Skutnabb-Kangas et al., 2009) . Acknowledging dialects, investigating their role, and working towards the decolonisation of African languages are social justice issues that affect the lives and futures of learners who speak African languages. The research presented here aims to raise awareness of these critical issues.\nThe isiXhosa language was written up by missionaries, using European syntax and enshrining a few dialects as the officially accepted and standardised version of the language. Other researchers have found that teachers speak their own dialect in the classroom and do not necessarily use the standardised isiXhosa (Mtsatse, 2018) . IsiXhosa dialects not included in the standardised form of the language continue to be marginalised and unacknowledged, and this may further lower literacy and numeracy achievements of those who do not speak the standardised isiXhosa, or learners with lower linguistic abilities. Decolonisation of isiXhosa and other African languages would require the empowerment of the languages through the standardisation of African languages, teacher training and development, as well as resource allocation. Currently, African language teaching and learning is highly influenced by English and Afrikaans reading research. Calling for decolonisation of African languages will have to include more research to understand how early reading literacy develops in isiXhosa. Furthermore, there is a need to explore teaching practices that are designed specifically for the orthography and morphology of African languages, so that a structured pedagogy can be developed (DBE, 2017) ."}, {"section_title": "Conclusions and implications", "text": "The pedagogy of isiXhosa should be decolonised by developing the writing and lexicon of the language and all the dialects in an African context and by involving home language speakers. Teachers should be trained to be sensitive to the dialectic complexity and the potential multilingualism of their classroom environment. Cross-cultural assessments have some validity in African languages, but their limitations should also be examined and acknowledged. Books and passages should be developed by home language speakers in these languages and in the various dialects. The text should be contextualised not only for the language but also for the dialects and the environment in which the learners find themselves.\nResearchers also have an important role to play in devising methodologies that will advance the decolonisation of isiXhosa. African researchers should be supported and trained so that they can develop methodologies suited to the unique African environment. Awareness of the pervasive influence of Western ideologies and the importance of decolonisation should also be promoted. South Africa has a desperate need of educational researchers from diverse African communities who have both the educational experience and pedagogical knowledge, coupled with deep insights into research methodology and its application in Africa. African languages such as isiXhosa need individuals to champion the cause of the language, a role that educators and researchers should undertake. Researchers and funders need to acknowledge the role of dialects and consider this in their methodologies and instrument design. There are no easy answers when it comes to dealing with dialectic issues but the necessity of investigating them and finding ways of addressing them is supported by the research presented here. This study tested only Grade 1 learners in three districts in Western Cape, and the results can be generalised only to those three districts. More research is needed to understand the continued complexity of dialects and how best to address the needs of learners in all African languages."}]