[{"section_title": "", "text": "If autocorrelation in abundance is exogenous, resulting from environmental drivers that are spatially structured (Fig. 1a, arrow 1), then traditional, non-spatial statistics describe the abundance-environment relationship perfectly well. Creatures are more abundant here, vs. there, because here it is hotter, or wetter, or there is more phosphorous. Troubles arise if autocorrelation is endogenous, arising from the biology of the creatures in question. For example, metapopulation dynamics could make close populations more similar in abundance than far ones (Fig. 1a, arrow 3), creating spatial patterns of abundance irrespective of environmental gradients. But would these patterns confound abundance-environment relationships? I have generally thought (Fig. 1b) that space structures environmental variables, which then structure populations, but that endogenous spatial autocorrelation is probably relatively inconsequential over broad spatial scales because population processes are fairly local.  Bahn & McGill (2007) recently asked a clever question that upset my complacency: what if environmental variables predict spatial variation in the abundance of organisms because the two have similar spatial structures, and not because environment actually influences abundance? To address this question, they used 190 widespread species from the North American Breeding Bird Survey. They compared observed variation in abundance with the predictions of three models. The first was a typical niche model: abundance as a function of environmental (mainly climatic) variables. Their niche model should capture direct effects of the environment, whether spatially structured or not (Fig. 1, arrow 2). A second model related abundance to geographical coordinates (latitude and longitude). This model would presumably capture environmental effects that show long autocorrelation (Fig. 1, arrow 4 plus arrows 1→2 and 1→2→3). A third model related local abundance to the distanceweighted abundance of conspecifics at sites within 200 km, which would capture short-distance autocorrelation in abundance, both exogenous and endogenous ( Fig.1, arrow 3). Bahn & McGill found that variation in avian abundance can plausibly be related entirely to spatial autocorrelation! Latitude and longitude statistically accounted for just as much variance in bird abundances as did the environmental variables. Combining environment and latitude/longitude explained no more. Thus, the variation in abundance that is related to geographical coordinates is indistinguishable from the variation that can be related to environmental variables. The average abundance of neighbours was an even stronger predictor of local abundance. Consequently, spatial interpolation outperformed niche models, irrespective of environmental gradients. Bahn & McGill also constructed artificial species ranges, centred randomly in North America, and assuming Gaussian distributions of abundance in space. Environmental variables predicted the variation in abundance in simulated ranges nearly as well as in real ranges, even though there is clearly no causal relationship between environment and a simulated range. Thus, Bahn & McGill's data appear to be consistent with a simple, disturbing hypothesis (Fig. 1c): abundance-environment correlations may simply result because both variables are similarly structured in space. The direct effect of environment on local abundance may be very small. Rather, neighbourhood abundance may determine local abundance. Consequently, simple interpolation yields good predictions of abundance. But this is an extreme interpretation. Even Bahn & McGill do not suggest that spatial variation in abundance contains no environmental signal at all. One might even argue that Bahn & McGill's results show nothing that we did not already know. Sites close in space tend to be environmentally similar. Biotic processes such as dispersal make ranges more-or-less continuous. So it is entirely predictable that neighbouring abundances should be similar too. But autocorrelation (and interpolation) cannot explain why abundance, both here and nearby, is n, vs. 2n or n/2. Abundance-environment relationships do (potentially) explain that variation. There are techniques designed to examine statistical relationships in the presence of autocorrelation (e.g. Lennon, 2000;Fortin & Dale, 2005), which Bahn & McGill did not use. However, most of these models test for a marginal effect of environmental variables, after controlling for autocorrelation. In essence, they first interpolate abundance, and then test for environmental effects. If spatially structured environmental variables control abundance, they will induce exogenous autocorrelation, and methods that control for autocorrelation will mask the environmental effects. We are no farther ahead in distinguishing effects of environment vs. endogenous autocorrelation on abundance. I suspect that Bahn & McGill's data are also consistent with a model in which environment determines neighbourhood abundance, and population processes modify abundance locally (Fig. 1d). I think this because the space-only model (Fig. 1c) cannot explain why niche modelling successfully predicts abundance in disjunct areas, or why ranges shift when climate changes. The practical utility of interpolation as a tool to predict abundance falls off rapidly with distance, whereas niche models do not necessarily do so. Bahn & McGill's work seems both cautionary and promising. First, they question to what extent biology-environment relationships exist because the variables depend similarly upon space, rather than because biology depends upon environment. Explanations of global-scale patterns of species richness face the same problem. Richness typically varies fairly smoothly (i.e. has positive autocorrelation) over long distances (e.g. H-Acevedo & Currie, 2003) as do climatic variables. Perhaps richness correlates strongly with climatic variables at this scale because their autocorrelation structures are similar (Lennon, 2000). Storch et al. (2006) and Rahbek et al. (2007) recently showed that some of the variance in broad-scale variation in species richness results from the fact that species ranges are typically spatially continuous over long distances. In other words, empirically, autocorrelation accounts for some of the variance in species richness. Second, Bahn & McGill's work suggests an opportunity. The notion that environment has little direct effect on broad-scale variation in abundance will be quite indigestible to many ecologists. Yet, the processes that give rise to spatial autocorrelation appear to provide better predictive power than current nonspatial models can offer. A challenge for the future will be to exploit this largely untapped source of information."}]