[{"section_title": "Introduction", "text": "COVID-19 is a newly identified infectious disease of global importance for public health. SARS-CoV-2 belongs to the group of giant single-stranded RNA viruses and is easily transmitted between humans. 1 Such high infectivity suggests animal origin. 2 Possible sources of infection include bats, snakes, minks, as well as asymptomatic human carriers who have not yet developed signs of infection. 1, 3, 4 Transmission is through respiratory droplets or fomites, but the airborne and orofecal transmission is also likely. 5 The course of the disease can range from mild (minor respiratory tract infection) to severe pneumonia, acute respiratory distress syndrome (ARDS) associated with multiple organ failure, and death. 6 The most characteristic symptoms of COVID-19 are fever (in about 90% of patients), cough, and dyspnoea. 5, [7] [8] [9] The digestive tract may be an alternative route of infection, and the virus has been isolated from saliva and feces. [10] [11] [12] Older individuals and those"}, {"section_title": "Types of Coronaviruses", "text": "Coronaviruses are a large family of encapsulated, singlestranded, zoonotic RNA viruses. These pathogens can affect the respiratory and gastrointestinal tracts, as well as induce hepatic or renal damage, and neurological disorders. 1, 20 The most common are coronaviruses causing respiratory disease, and they belong to the group of alpha and beta-coronaviruses. Four of these (HCoV229E and HCoV-NL6 (alpha-coronaviruses) and HCoV-HKU1 and HCoV-OC43 (beta-coronaviruses)) are commonly found in humans. 1 They are most commonly responsible for mild upper respiratory tract infections, bronchitis, or pneumonia. With a rapidly progressive clinical course of SARS-CoV-1, SARS-CoV-2, and MERS-CoV (Middle East respiratory syndrome coronavirus), severe pneumonia, acute respiratory distress syndrome, septic shock, and death are observed. 6, [21] [22] [23] Molecular studies have shown that SARS-CoV-2 has approximately 79% sequence identity to SARS-CoV-1, which confirms the high phenotypic similarity of both beta-coronaviruses. Moreover, they bind to the same receptor of the angiotensin II converting enzyme (ACE2); however, there are some differences due to amino acid mutations in some key domains of this receptor. 24 Short incubation period, droplet transmission, and asymptomatic course influence the high infectivity of SARS-CoV-2, contributing to high rates of transmission worldwide. 1, 25 Besides, SARS-CoV-2 is quickly mutated and recombined, resulting in new forms that can spread from animals to humans. 26 "}, {"section_title": "Epidemiology", "text": "Initially, SARS-CoV-2 was reported only in China, and the first cases involved a small area covering the Chinese seafood market in Wuhan, Hubei Province (December 2019). 25 However, the virus quickly spread throughout the world. About six weeks later, the World Health Organization (WHO) announced that the infection caused by this pathogen is a threat global public health. 27 Currently, the SARS-CoV-2 pandemic affects all populations and poses a serious challenge to public health organizations. 28 "}, {"section_title": "Transmission of SARS-CoV2 Infection", "text": "As previously mentioned, acute complications such as life-threatening respiratory failure may occur in the course of many coronaviruses, including SARS-CoV-1, SARS-CoV-2, and MERS-CoV. Although MERS-CoV and SARS-CoV-1 have a higher mortality rate due to more severe complications than SARS-CoV-2, the infection caused by SARS-CoV-2 spreads much faster than MERS-CoV and SARS-CoV-1. 10, 29, 30 The main mode of transmission for SARS-CoV-2 is via droplets, similar to MERS-CoV and SARS-CoV-1; however, patients with COVID-19 present the highest viral load just before first signs or at the onset of clinical symptoms, which explains the rapid spread of the pathogen and the development of a pandemic. 23 This fact underlines the importance of rigorous infection control and the strict use of PPE (personal protection equipment). 10 Rapid transmission of SARS-CoV-2 (much higher than observed in SARS-CoV-1) suggests zoonotic origin. 23 The most likely natural reservoir of SARS-CoV2 is bats, as well as other wildlife animals such as snakes or minks. [1] [2] [3] [4] The infection is spread primarily by respiratory droplets, as well as transmission between symptomatic and asymptomatic individuals. Moreover, the virus can be transmitted through contact with excretions and secretions of the infected patient. 12, 31 Individuals with confirmed disease, or who have had exposure with infected patients should immediately be submit your manuscript | www.dovepress.com"}, {"section_title": "DovePress", "text": "Clinical Interventions in Aging 2021:16 44 quarantined. 32 Asymptomatic carriers present a dangerous route of transmission. A similar viral load is present in both symptomatic and asymptomatic patients, which indicates the potential role of viral transmission by people without any clinical symptoms. 33 Therefore, any person exposed to an infected patient should be isolated, even in the absence of clinical signs.\nThe mean incubation period of SARS-CoV-2 (the time from the point of infection to the occurrence of the first symptoms) also influences the quick route of viral transmission; usually lasting 5 days [5.2 days (95% CI = 4.1-7.0 days) (n = 138), 34 5.2 days: range from 2.1 to 11.2 days (n = 8579)]. 35 The risk of infection diminishes 14 days after contact with an infected patient (this time corresponds with the estimated maximum incubation period). 36 Data describing the possibility of vertical infection are controversial. Zhang et al reported observations of 4 newborns which suggested the possibility of vertical transmission from mother to child. However, in infected newborns, there were no serious complications or need for mechanical ventilation or treatment in the ICU. Thus, newborns are susceptible to SARS-CoV-2, but their symptoms are milder compared to adults. 37 Conversely, research by Liu et al describing 19 pregnant infected women did not confirm a mother-child transmission during childbirth. Besides, no perinatal complications of pregnant women during the third trimester of pregnancy or newborns were found. All newborns were born healthy and had no SARS-CoV-2 infection. 38 Therefore, the concept of vertical transfer of SARS-CoV-2 deserves further investigation. 37"}, {"section_title": "Disease Severity-Dependent Course of Infection", "text": "Patients with SARS-CoV-2 present a broad spectrum of symptoms, from mild/moderate infection to severe and rapidly progressive and life-threatening disease. 17, 18 Epidemiological data from the Chinese population show that about 81% of patients have mild symptoms (including mild pneumonia), and 1.2% of patients are asymptomatic. 39"}, {"section_title": "An Age-Dependent Course of Infection", "text": "The most vulnerable to infection is the senior group. The risk of an acute course of the disease increases with age, and patients over 60 years present the most severe complications. 15, 34 They are more susceptible to the infection than children, more frequently suffer from dyspnea, and rapidly progressive disease (ARDS, septic shock). As a result, the elderly are the most frequently hospitalized group of patients in intensive care units (ICU). 5, 15, 34 Studies of the Chinese population showed that patients with severe COVID-19 complications, were on average, seven years older than patients with mild symptoms, and more frequently present with higher comorbidities. 5 Physiological changes characteristic of normal aging, declining physical performance, malnutrition, cognitive decline, and depressive state explain this phenomenon. 40 It is worth noting that polypragmasia, due to overprescription of medication in the setting of poorly coordinated care, is more often observed in this group of patients. These factors increase the risk of drug side effects with a negative influence on overall health. 13 It is also worth emphasizing that the course of infection can be atypical in the elderly and patients with immunodeficiency, with a high risk of serious complications even in mild disease. 13, 15, 34 In children, the disease is usually mild or asymptomatic, 34 especially in neonates. 37, 38 In this group of patients coronaviruses cause fewer clinical symptoms and are rarely fatal. 19 In infants, the course of the disease is usually mild or asymptomatic. 37, 38, 41 In older children, COVID-19 may co-exist with other viral or bacterial infections and should be treated alongside SARS-CoV-2. 42, 43 Most children have documented home contacts, and the symptoms often appear quicker than in adult household members. Children, unlike adults, are less frequently hospitalized due to severe complications of SARS-CoV-2. 6 Thus, current data indicate that in the pediatric population, SARS-CoV-2 infection is rarely symptomatic and is less severe than in adults. 19"}, {"section_title": "Comorbidity-Dependent Course of SARS-CoV-2 Infection", "text": "Increased morbidity of COVID19 is observed in patients with chronic diseases such as diabetes, hypertension, and COPD. 7 DovePress essential questions about the possibility of higher viral pathogenicity in this population. 14 Recently, vitamin D is widely discussed in the context of its positive influence on immune function. The meta-analysis of Martineau et al has shown that vitamin D supplementation protects against acute respiratory tract infection overall. Patients who were vitamin D deficient and those not receiving bolus doses experienced the most benefit during adequate supplementation of this vitamin. 44 "}, {"section_title": "Clinical Symptoms", "text": "The clinical signs may vary between different populations, due to the influence of environmental and genetic factors. The disease course may be mild or moderate. The virus typically affects the respiratory tract, and patients complain of fever, cough (most often dry), sore throat, fatigue, and malaise 5,7-9 (Table 1) . Dyspnea increases with the progression of the disease. Headaches and myalgia may also occur. If pneumonia develops, it can be mild and responsive to treatment, or severe requiring oxygen therapy or mechanical ventilation. 5, 8 The disease infrequently begins with extra-pulmonary (eg, gastrointestinal) symptoms. Recent studies have confirmed the tropism of SARS-CoV-2 to the gastrointestinal tract (detectable on intestinal biopsy and fecal matter). 45 Angiotensin II receptors (ACE-2) enable the entry of SARS-CoV-2 into lung tissue and enterocytes in small intestines; this explains symptoms such as diarrhea, vomiting, nausea, and abdominal pain. 46 ,47 Viral genetic material has been found in the stool, and elimination time from the gastrointestinal tract is more prolonged compared to the respiratory tract. 12,31 SARS CoV-2 infection can also lead to direct damage to intrahepatic bile ducts due to the high expression of ACE2 receptors on 59.7% of cholangiocytes. For comparison, these receptors are present only on 2.6% hepatocytes. 48 SARS-CoV-2 has also been confirmed in the saliva and thus can be a potential route of infection. 45 Therefore gastroenterological symptoms may co-exist with upper respiratory tract symptoms and may account for further transmission of the SARS-CoV-2 through the digestive tract. However, side effects of medications used for anti-viral treatment should always be excluded. 49 Thus, the oral route may be an alternative way of transmission, especially with exposure to infected wild animals or asymptomatic carriers. 4,23 SARS-CoV-2 infection may cause loss of smell, which is observed in 20-60% of patients with the confirmed disease (data according to the European Rhinologic Society). Moreover, this often occurs before fever and can be the predominant sign of infection. 50 A multicentre study of the 417 infected patients with mild to moderate COVID-19 showed that almost 86% of patients present with olfactory dysfunction, and 88.0% reported dysgeusia. These symptoms were more common in women. Sensory and olfactory disorders were present before other symptoms in 11.8% of patients. 51 "}, {"section_title": "Clinical Interview", "text": "History of presenting symptoms and travel history must be elicited in order to estimate the risk of the SARS-CoV-2 infection. It is essential to obtain information about exposures in people with international travel."}, {"section_title": "Clinical Examination", "text": "The symptoms are lightly expressed in mild disease. Patients with severe symptoms often report shortness of breath. Auscultatory small-bubble rales are mainly heard at the base of both lungs, accompanied by increased vocal tremors over the inflammatory lung tissue area and diminished resonance. Pleural effusion is rare, but if it is present, diminished respiratory sounds, the abolition of vocal tremor, and diminished percussion notes are observed. 52 "}, {"section_title": "Imaging Examination", "text": "Lesions present on chest X-ray or CT depend on disease severity, varying from small infiltration at early stages (normal or slight and bilateral patchy shading, slight interstitial infiltrations, or changes more strongly expressed in the peripheral part of the lung), 8 to massive interstitial pneumonia. 5 The progression of pulmonary infiltrates is observed in almost 50% of the patients, and it progresses rapidly (3.5 days on average). The resolution of inflammatory infiltration is found in approximately 25% of cases, while 25% of patients do not show significant changes on imaging studies. 9 Pulmonary infiltration is the most common sign on chest CT. It is usually described as bilateral spotty shadings or ground-glass changes. 5, 9 They are bilaterally distributed, more pronounced in the periphery, and are most often noted in more than two lobes. 9,53 However, they are similar to that of other coronaviruses infection, such as SARS-CoV-1 21 and MERS-CoV. 22 CT imaging is essential in recognizing and monitoring pulmonary changes in COVID-19. Chest CT may be more sensitive (98% sensitivity) in detecting SARS-CoV-2 infection than RT-PCR (71% sensitivity). 54 In the early stage of the chest X-ray may be present slight and patchy shading more strongly expressed in the peripheral part of the lung. In advanced disease, numerous infiltration and consolidative modifications on both sides are observed. CT usually shows spotty bilateral shadowing, mainly in the peripheral part of the lung; however, milky-glass shading or interstitial changes (>80% of patients have more than two lobes involved) are also detected. 5, 8, 9 Molecular Diagnostics SARS-CoV-2 Infection Biological Material\nThe complete genome sequence of SARS-CoV-2 is available; thus, genetic material may be isolated from lower and upper respiratory tract samples. Specimens may be obtained from the saliva, feces or blood (in sepsis). 11, 31, 45, 49 Thus, a variety of specimens (such as nasopharyngeal swabs, sputum, tracheal extracts, lung tissue, blood, and feces) can be taken for viral RNA detection.\nThe most common method for the identification of SARS-CoV-2 is swabbing nasopharyngeal or oral cavity. 55 PCR is most sensitive if the material is obtained from the lower respiratory tract (usually aspirate from the trachea or bronchoalveolar lavage (BAL)). 29, 56 The possibility of detecting viral RNA by RT-PCR in a single nasopharyngeal swab is not high; therefore, tests should be repeated. 11, 57 The accuracy of the PCR assay increases with repeated sampling giving rise to a lower number of false-negative results. 18 Samples should not be taken from the nostrils or tonsils. Swab sticks should be sterile and made of synthetic, non-cotton material. Sputum (if occurring in the course of the disease) may be used for virus detection, but should not be induced due to the increased risk of infection by aerosol. Procedures for obtaining nasopharyngeal swabs, recommended for detection of SARS-CoV-2, are considered as aerosol-generating procedures. For this reason, Clinical Interventions in Aging 2021:16 submit your manuscript | www.dovepress.com DovePress they should be performed in specific facilities with adequate protection of medical staff. 58, 59 Analysis of subsequent saliva samples in recovering persons showed a decreasing viral load in the collected material. 45 SARS-CoV-2 genetic material has been found in the stool of patients with gastrointestinal symptoms. 12, 31 Although the virus can be detected in saliva or feces, this is not a standard method of virus identification since it is not observed in all patients infected with SARS-CoV-2 (such determination is more often performed in scientific research). 12,31"}, {"section_title": "Molecular Diagnostics", "text": "Quantitative determination of coronavirus material by real-time RT-PCR (reverse transcriptase-polymerase chain reaction) and sequencing of the genetic material of the virus is the gold standard in diagnosing COVID-19. 55 Real-time RT-PCR is characterized by high specificity and sensitivity and is useful for confirming active infection (the period of virus replication). 29, 56 Positive of RT-PCR results indicate the presence of a virus and is considered as evidence of a current infection. A negative result may reflect the lack of infection, if the material for the tests was collected correctly and promptly, at the time of the highest viremia. However, the result should be repeated, and if negative results are repeated samples confirms the lack of viremia. However false-negative result might also present and can result from sampling before or after the highest viremia, various sites of collection (PCR is less sensitive for a nasal swab than for a nasopharynx swab), inappropriate material collection for swab tests, which leads to the breakdown of genetic material, improper transport destroying the viral nucleic acids, eg, inadequate temperature, sample contamination, and incorrect performance of the RT-PCR assay. 55, 56 With a positive RT-PCR test and minor symptoms, quarantine, as well as symptomatic treatment, is indicated. 61 The RT-PCR analysis should be repeated if symptoms worsen or new symptoms characteristic for SARS-CoV-2 infection appear. 45 Viremia increases along with worsening of clinical state, increasing severity of clinical symptoms (rising fever, dyspnea, sputum production, and weakness), and the progression of inflammatory changes in chest imaging studies. 60 "}, {"section_title": "Biochemical Study", "text": "During the course of the SARS-CoV-2 infection, several changes are observed in serum biochemistry. Leukopenia (defined as WBC <4000/µL) is found in about one-third of patients. Less often, leukocytosis or normal white blood cell count is observed. 62 Leukopenia is more notable in patients with severe COVID-19. Quite characteristic for SARS-CoV-2 infection is lymphocytopenia (defined as lymphocyte count <1500/µL), which is usually observed in more than 80% of patients. 5, 62 Lymphocytopenia also correlates with disease severity. Approximately 20% of patients manifest liver disorders (with elevated ALT and AST), and increased inflammatory markers. 5"}, {"section_title": "Differential Diagnosis of Pulmonary Changes in COVID-19", "text": "It is crucial to know that a positive bacterial or viral test for pathogens other than COVID-19 does not exclude the presence of SARS-CoV-2. This may be explained by a low SARS-CoV-2 viral load. Studies indicate that patients with SARS-CoV-1, MERS, or SARS-CoV-2 virus may be coinfected with other respiratory pathogens. 43 Therefore, identification of other viral (influenza A and B, parainfluenza, adenoviruses and rhinoviruses, RSV (respiratory syncytial virus), SARS-CoV-1, hMPV -human metapneumovirus, endemic human coronavirus, eg, HKU1, OC43, NL63 and 229E, arboviruses (dengue/chikungunya viruses) in endemic areas), bacterial (Mycoplasma, Chlamydia, Legionella), or parasitic pathogens does not exclude COVID-19 infection. 63"}, {"section_title": "Treatment of SARS-CoV-2 Infection", "text": "General Recommendations COVID-19 should be suspected in any patient with symptoms of severe respiratory infection such as fever, cough, or shortness of breath. The possibility of infection increases if the patient had contact with an infected person within 14 days of symptom onset or contact with a person who has returned from the area of local COVID-19 transmission. 36 To date, clinical data of the treatment of SARS-CoV-1 acute respiratory distress syndrome has shown that early diagnosis of suspected cases and prompt implementation of preventive and therapeutic measures are crucial for preventing and ceasing epidemics. "}, {"section_title": "Recommendations for Medical Personnel", "text": "Caring for an infected patient requires proper security of medical staff by using personal protective equipment appropriate to the performed procedures (WHOct). Depending on the clinical situation, surgical masks, filter masks (eg, N95 masks), or providing a higher level of protection can be used. Highly filtration masks such as N95 masks and protective clothing (glasses and aprons) should be used in public healthcare institutions, particularly in places where healthcare professionals have direct contact with infected patients (WHOct) (National). In these situations, eye protection glasses, gloves, and long-sleeved aprons (preferably disposable) are also necessary. It is important not to touch the eyes, nose, and mouth after putting on gloves and avoid contaminated surfaces, such as door handles or light switches. Contact with an infected person should be associated with frequent hand hygiene, and each time disinfection of reusable equipment (National).\nRegardless of the course of the disease, isolation is necessary for every patient to stop spreading the virus (at home, in hospital, in nursing homes, orphanages, or other facilities). Such patients should be given clear instructions regarding hygiene rules and a proper home or institutional conditions of isolation. Each of them should be informed to which hospital they should go in case of health deterioration (ECDC)."}, {"section_title": "Treatment Strategies of COVID-19", "text": "Treatment of SARS-CoV-2 infection depends on the clinical severity, age, and risk factors for possible disease complications. 61 Symptomatic treatment (antipyretic) and home isolation (no hospitalization is required) is indicated in mild infection. Combined therapy, including pharmacological and supportive treatment (eg, oxygen therapy or mechanical ventilation), should be implemented in severe cases. 68, 69 Currently Tested Therapies in COVID-19 RCTs Recent data report conflicting information about the use of anti-viral (eg, lopinavir/ritonavir), antimalarial (chloroquine or hydroxychloroquine), and anti-inflammatory drugs. Some studies report positive effects of antibiotics such as azithromycin. Remdesivir and tocilizumab should be considered in patients with exacerbation of the disease. 15 Due to insufficient literature on the efficacy and safety of available drugs, the decision to use them must be made carefully by the physician. 16 Current evidence indicates that we are still at a loss for targeted therapy against COVID-19 infection in clinical practice. Several drugs have been trialed in vitro and others are still being investigated in clinical trials. There is a lack of conclusive data for available therapies with the exception of antivirals and glucocorticoids. Inadequate study power, study duration, and lack of control groups are important key factors decreasing the quality evidence of some available studies. These are summarized in Table 2 ."}, {"section_title": "Severe Course of SARS-CoV-2 Infection", "text": "Alarming symptoms in the course of SARS-CoV-2 infection include obstruction of the respiratory tract or lack of breath, severe respiratory distress, central cyanosis, shock, convulsions, and coma. 13 In addition to pharmacological treatment, respiratory protection and complementary oxygen therapy are needed to achieve SpO2 saturation>94%. The right fluid supply is also crucial for proper patient hydration. However, it is of notice that aggressive fluid administration increases the risk of saturation worsening. 13, 65, 66 Poor prognosis risk factors include older age, high SOFA score (Sepsis-related Organ Failure Assessment), 64 and D-dimer value above 1 μg/mL. These factors can enable the identification of patients with poor prognosis at admission to the hospital. In such patients, treatment should be immediately implemented, and strict monitoring should be considered. 13 During treatment, it is crucial to achieving adequate saturation (SpO2>94%) and proper hydration of patients. 87 Close monitoring of patients should include vital signs examination, risk assessment of rapidly progressing respiratory failure and sepsis, as well as treatment of concomitant chronic diseases or their temporary suspension depending on the patient clinical condition and drug interactions. 88 "}, {"section_title": "Challenges to General Practitioners in the COVID-19 Outbreak", "text": "The data of other epidemics (eg, an influenza outbreak in Ontario) have showed the critical importance of engaging early and effectively with primary care. 93 General practitioners provide medical surveillance in the community; however, they are at higher risk of SARS-CoV-2 infection (Figure 1) . They have had contact with many patients daily, mainly during the first days of the disease, when the information about COVID-19 spreading and safety procedures were scant. They had close contact with Overall "}, {"section_title": "Summary", "text": "In the face of rapidly spreading disease and a large number of infected people, it is necessary to use effective procedures to prevent and control infections. Quick diagnostic methods are required to enable the selection of patients and contact persons. The lack of early identification of patients with COVID-19 can paralyze the functioning of medical facilities, disrupt public health systems, and cause substantial economic losses. More advanced research and data analysis of numerous groups of patients are needed to describe the transmission and treatment options accurately. Even recently, we know more and more about COVID-19, still many questions remain unclear. There is a concern whether a cured patient is still susceptible to re-infection and whether the subsequent disease will have milder or more severe course. However, information indicating a confirmed virus source of origin and its pathogenesis may initiate medical studies and give direction to new drug synthesis and vaccine production.\nCommunication between the primary care system and national organs enables to plan the essential elements, which allow decreasing the spread of the infection. The most susceptible to infection patients (older people, pregnant women, immunocompromised patients, or patients with a chronic medical condition resulting in increased risk from coronavirus infection) should have the possibility to continue their treatment in the primary care system. On the other side, it is also essential for enabling vulnerable GPs and other medical specialists authorized to use telehealth item numbers to provide care for their patients using telehealth. Moreover, precise and practical guidelines are urgent for the improvement of adequate measures to prevent SARS-CoV-2 infections among general practitioners."}, {"section_title": "Ethical Approval", "text": "None."}, {"section_title": "Funding", "text": "We declare no funding."}, {"section_title": "Disclosure", "text": "The authors report no conflicts of interest for this work. "}]