[{"section_title": "Abstract", "text": "This review addresses epidemiological, public health, and social policy implications of categorizing young children and their adult female caregivers in the United States as food secure when they live in households with \"marginal food security,\" as indicated by the U.S. Household Food Security Survey Module. Existing literature shows that households in the US with marginal food security are more like food-insecure households than food-secure households. Similarities include socio-demographic characteristics, psychosocial profiles, and patterns of disease and health risk. Building on existing knowledge, we present new research on associations of marginal food security with health and developmental risks in young children (<48 mo) and health in their female caregivers. Marginal food security is positively associated with adverse health outcomes compared with food security, but the strength of the associations is weaker than that for food insecurity as usually defined in the US. Nonoverlapping CIs, when comparing odds of marginally food-secure children's fair/poor health and developmental risk and caregivers' depressive symptoms and fair/poor health with those in food-secure and -insecure families, indicate associations of marginal food security significantly and distinctly intermediate between those of food security and food insecurity. Evidence from reviewed research and the new research presented indicates that households with marginal food security should not be classified as food secure, as is the current practice, but should be reported in a separate discrete category. These findings highlight the potential underestimation of the prevalence of adverse health outcomes associated with exposure to lack of enough food for an active, healthy life in the US and indicate an even greater need for preventive action and policies to limit and reduce exposure among children and mothers. Adv. Nutr. 4: 51-61, 2013. "}, {"section_title": "Introduction", "text": "\"Food security-access by all people at all times to enough food for an active, healthy life-is one of several conditions necessary for a population to be healthy and well nourished\" (1, 2) . Food insecurity has been associated in the U.S. population with adverse child and adult health outcomes in a large number of studies since the U.S. Household Food Security Survey Module (HFSSM) 10 was initially developed in 1995-1997 (3-17) . Evidence has recently accumulated indicating that people in households with \"marginal food security\" (a less severe condition not considered a separate category of nutritional risk), but usually classified as food secure in the U.S. government's prevalence estimates, may also face a greater likelihood of impaired health and nutrition (18) (19) (20) (21) (22) (23) (24) (25) . This raises important questions about how households with marginal food security, and the people living in them, should be treated when estimating the prevalence of the lack of consistent access to enough food in the U.S. population. The answers to these questions are relevant to epidemiological assessments of the prevalence of exposure to lack of enough food (and its consequences), and to public health programs, systems, and policies that address health and nutrition in U.S. households, communities, and the population as a whole.\nGaining a clearer understanding of marginal food security is important for several reasons. From an epidemiological perspective, lack of clarity around marginal food security increases the likelihood of potential underestimation of the prevalence and magnitude of adverse health outcomes associated with exposure to lack of consistent access to enough food. From a public health perspective, poor understanding of marginal food security leaves a gap in the knowledge needed for targeting preventive and ameliorative action programs to limit and reduce exposure to inadequate nutrition. From a public policy perspective, not having a clear understanding of marginal food security impairs policy makers' ability to gauge the effectiveness of nutrition assistance and non-nutrition assistance programs in reducing and preventing food deprivation as well as other policies aimed at supporting families and improving community food systems."}, {"section_title": "Aims and objectives", "text": "This review specifically addresses epidemiological, public health, and social policy implications of categorizing young children and their adult female caregivers living in U.S. households with marginal food security as free from exposure to lack of access to enough food for an active, healthy life, i.e., as food secure. Our first aim is to briefly describe the construct of marginal food security and summarize its prevalence within the U.S. child and adult populations. Our second aim is to review the modest body of literature addressing marginal food security in the US and associating it, compared with food security and food insecurity, with health outcomes in children and adults. And our third aim is to report on new empirical research in which we examine associations of \"marginal food security\" with health and developmental risk in a sentinel sample of young U.S. children (<48 mo) and with their adult female caregiver's health. We also will compare the strength of associations between marginal food security and adverse health outcomes with associations of food insecurity and food security with those outcomes. Although we hypothesize associations between marginal food security and adverse child and caregiver health outcomes to be positive and significant, we expect an ordinal \"dose-response-like\" effect, with marginal food security also posing substantial health risks but acting similar to a lower \"dose\" of toxic exposure to the risks posed by food insecurity.\nOur primary goal is to determine whether, from a U.S. population perspective, marginal food security poses risks to public health more like food insecurity, or whether it is more like food security. An important objective is to clarify the nature of marginal food security in the U.S. population and in so doing also clarify the nature of food insecurity. We hypothesize that the adverse child health and development impacts and maternal health impacts of marginal food security are substantial and clinically important, so that this seemingly mild category of difficulties with consistent access to food would be more accurately and usefully treated not as part of the overall \"food-secure/high food security\" category, as it currently is, but separate from it. However, it is not yet clear that from epidemiological, public health, or public policy perspectives it would be accurate and useful to include marginal food security as part of the \"food-insecure/ low food security\" category. An important goal of this study is to shed light on how marginal food security should be treated in scientific and public policy agendas relative to these other 2 more clearly understood categories.\nWe emphasize that this is not a \"systematic review\" and we do not attempt to include all studies touching on the concept of marginal food security. We searched for studies addressing marginal food security in the U.S. population using standard academic procedures but did not conduct a systematic review. Therefore, we intentionally limit our consideration to the U.S. population only."}, {"section_title": "Background", "text": "Food security was measured and analyzed in other developed and developing countries for some time before measures for food security and food insecurity were developed for the U.S. population. There is no doubt that development of food security measures for the US benefited tremendously from the pioneering work that had already been done in other countries (3, 4, (26) (27) (28) . In 1990 the U.S. Congress passed the National Nutrition Monitoring and Related Research Act mandating that the federal government initiate a process for developing food security measures for the U.S. population (3, 4, 29) . The USDA and the National Center for Health Statistics were tasked with developing a competitive contract research project to develop valid and reliable food security measures for the U.S. population. The federal government chose to have the resulting HFSSM administered by the U.S. Census Bureau in its ongoing annual Current Population Survey (CPS). In 1997 the Food Security Measurement Project reported the results of its measurement development activities and the USDA began tabulating and reporting estimates of prevalence and levels of food security and food insecurity for the U.S. population by sociodemographic characteristics annually (3, 4) .\nThe USDA Economic Research Service (ERS) provides survey tools for researchers and other parties interested in measuring food security in the US, guidance on survey implementation, and scoring and scaling survey responses (26, 27) . The HFSSM includes questions pertaining to the whole household, adult household members, and children in the household (26) . The 18-item standard scale can be administered to households with adults and children present and can be subdivided into separate 10-item adult and 8-item child scales. An abbreviated, 6-item, household-level scale has also been validated for situations in which the other scales cannot be used (28) . None of the HFSSM scales asks questions about individual household members except for single-person households and households with only one adult or one child. The scales provide information about the household as a unit and about all adults or all children in the household in aggregate. However, they do not use a census of all household members and thus cannot be used to obtain information about, e.g., individual children in households with more than one child (1, 26, 27) .\nBased on responses to the standard 18-item scale, households with children are categorized as having full food security if respondents affirm <3 scale items, low food security if 3-7 items are affirmed, and very low food security if $8 items are affirmed. Households, including those with children, affirming 1 or 2 items (practically always 1 or 2 of the first 2 items) in the standard 18-item scale are termed marginally food secure and, though considered different in some respects from households affirming no items, are included among households reported as food secure in calculations of food security prevalence estimates. 11 The first 2 items in the 18-item scale are: 1) \"(I/We) worried whether (my/our) food would run out before (I/we) got money to buy more.\" Was that often true, sometimes true, or never true for (you/your household) in the last 12 mo? and 2) \"The food that (I/we) bought just didn't last, and (I/we) didn't have money to get more.\" Was that often, sometimes, or never true for (you/your household) in the last 12 mo? Both items are coded affirmative if either \"often\" or \"sometimes true\" is selected.\nIn 2010, based on population-weighted data from the CPS, 19.9% of households for whom food security status was determined affirmed the first of these items and 15.4% affirmed the second (2). Overall, 12.6% of households with children and 8.0% of those without affirmed only one or both of these 2 items in the HFSSM and were categorized as having marginal food security (2) . There were 9.9 million children (age <18 y) and 22.2 million adults (age $18 y) living in households with marginal food security in 2010, with 3.1 million of the children ages <5 y. Approximately 38% of all people living in households with marginal food security in the US in 2010 were children or elderly (ages $65 y). 12 Research related to marginal food security in the US Researchers at the USDA/ERS describe the condition of marginal food security, and the prevalence in the U.S. noninstitutionalized population of affirmation of 1 or 2 of the first 2 scale items, in annual reports on food security in the US. The most recent report (released in 2011, retrospectively examining 2010) states that most households with marginal food security \"affirmed one or both of the first two items, indicating uncertainty about having enough food or about exhausting their food supply, but did not indicate actual disruptions of normal eating patterns or reductions in food intake\" (2) . The authors also state that those households \"lacked 'assured ability to acquire acceptable foods in socially acceptable ways' , a condition that the Life Sciences Research Office includes in its definition of food insecurity\" (2, 29) . The ERS researchers note that \"Research examining health and children's development in these marginally food-secure households generally indicates that outcomes are either intermediate between those in highly food-secure and food-insecure households or more closely resemble those in food-insecure households\" (2, 18, 30, 31) .\nTwo studies using data from the U.S. Early Childhood Longitudinal Study-Kindergarten Cohort to test for associations of food security status with academic achievement and health in kindergarten children also reported findings related to marginal food security (18, 22) . The first found that children begin experiencing the effects of food insecurity even at the least severe levels and that children with any level of food insecurity score lower and learn less during the school year. The authors conclude that affirming 1 or 2 items on the Household Food Security Scale is as important a risk factor for academic difficulties as being classified as food insecure by affirming 3 or more items (18) . The second study, using longitudinal data from the U.S. Early Childhood Longitudinal Study-Kindergarten Cohort to investigate how food insecurity over time relates to changes in reading and mathematics test performance, weight and BMI, and social skills in children, found that \"Using the standard threshold of $3 affirmative responses to the USDA food security module had less value in predicting mathematical test performance than a threshold of $1 affirmative responses on the module\" (22) . These authors report that \"Also, households affirming 1 or 2 responses (labeled marginally food secure) were more similar in mean baseline characteristics to households affirming >2 responses than households affirming no responses.\" They conclude that reporting any affirmative response on the module signifies increased food insecurity (22) .\nResearch conducted as part of the Pregnancy, Infection and Nutrition Prospective Cohort Study to identify risk factors of preterm birth used sets of multivariate logistic regression models with socio-demographic characteristics and psychosocial indicators as predictors of food insecurity, defined separately in the standard manner (with marginally food-secure households included in the food secure category), and with marginally food-secure households included in the food-insecure category (20) . In bivariate results, women in marginally food-secure households were significantly different from women in food-secure households on all socio-demographic characteristics and on all psychosocial indicators examined. In adjusted multivariate models, several socio-demographic and psychosocial indicators were significantly associated with higher odds of both marginal food security and food insecurity. The authors conclude that households affirming 1 or 2 scale items are different from those affirming none (20) .\nIn a study using data from the Fragile Families and Child Wellbeing Study on randomly selected births occurring between 1998 and 2000 in 75 birth hospital locations in 20 U.S. cities to test for associations between food insecurity and risks of depression and anxiety in mothers and behavior problems in their preschool-aged children, both marginal food security and food insecurity were significantly positively associated with mothers' experience of major depressive episodes and generalized anxiety disorder in adjusted multivariate regression models (21) . These researchers also found both marginal food security and food insecurity positively associated with several behavior problems in the mothers' 3-y-old children, including aggression, anxiety/depression, and inattention/hyperactivity (21) . Though the significant adjusted ORs (AORs) for association between food insecurity and outcomes were larger than those for associations of marginal food security with the same outcomes, the Cis for the AORs overlapped in all cases, making it impossible to infer that there were significant differences in the magnitude of associations of the 2 predictors with outcomes (21) . The authors concluded, however, that \"Although mothers seem to buffer their young children from the nutritional impacts of household food insecurity, they may not necessarily buffer children from the psychological impacts\" (21) .\nUsing CPS data from the HFSSM for 2003-2005, another study compared socio-demographic characteristics and food purchasing behaviors of food-secure, marginally foodsecure, and food-insecure households to examine the question \"Are marginally food-secure households more like food-secure or food-insecure households, or are the three categories empirically distinct?\" (19) Hypothesizing that marginally food-secure households are more like food-insecure households than food-secure households in the characteristics and behaviors examined, the study used binomial and multinomial logistic regression to test this hypothesis. The findings indicated that marginally food-secure households were generally significantly different from food-secure households on socio-demographic characteristics and food purchasing, in the CPS data, and more similar to food-insecure households overall than to food-secure households. The author recommended combining marginal food security with the classic definition of food insecurity (19) .\nTwo other studies involved marginal food security while testing for associations between food insecurity and health conditions using data from the NHANES. The first used data from NHANES 1999-2002 to test for associations between food insecurity and diabetes mellitus (24) . With data from the adult scale of the HFSSM, these researchers created a 3-category food security status variable as follows: food security (0 affirmed items), mild food insecurity (1-5 affirmed items), and severe food insecurity (6-10 affirmed items), effectively combining marginal food security (1-2 affirmed items) and low food security (3-5 affirmed items) to form their \"mild food security\" category. This research found mild but not severe food insecurity positively associated with obesity in women and severe but not mild food insecurity positively associated with diabetes mellitus in women and men combined (24) .\nThe second of these studies used data from the standard 18-item scale, categorized in the usual way in NHANES 1999-2006 to test for associations between food security and metabolic syndrome (MetS) in adults and adolescents (23) . The researchers found marginal food security and very low food security, but not low food security, positively associated with MetS in adults but no food security categories associated with MetS in adolescents (23) .\nPerhaps the most extensive examination of marginal food security association with child health to date involved creation, testing, and validation of a clinical screen for food insecurity comprising the first 2 items in the standard 18-item scale (25) . This research used data from the ongoing Children's HealthWatch research program that included the standard 18-item scale in a household survey administered to female caregivers of young children (<48 mo) in hospital settings between 1998 and 2005 in 7 U.S. cities (5, 6, (10) (11) (12) (13) (14) (15) (16) . The motivation for this study was the need for \"efficient methods for identifying young children in food-insecure households to ensure that families have access to nutrition-related services that provide healthy food and alleviate caregiver stress\" (25) . A successful screen would identify (test positive, as food insecure) the highest proportion of all truly food-insecure families tested. Because the researchers were more concerned to avoid false-negative screen results (identifying food-insecure families as food secure with the screen) than false-positives (identifying food-secure families as food insecure with the screen), they selected the screen from the 4 available alternatives using the first 2 questions (question 1 only, question 2 only, question 1 AND question 2, question 1 OR question 2) with the highest sensitivity, while maintaining acceptable specificity (i.e., keeping false-positives acceptably low). Testing the alternative screens against the standard 18-item screen as a \"gold standard,\" the researchers found the highest sensitivity (97%) using affirmative responses to question 1 OR question 2 (25) . The specificity of this alternative (for which positive screen results are the same as marginal food security) was calculated as 83% within an acceptable range for the intended purposes of the screen.\nTo test convergent validity of the resulting 2-item food insecurity screen, the researchers used 2 sets of logistic regression models to test for associations of food insecurity identified by the 2-item screen and food insecurity based on the standard 18-item scale separately, with several child and maternal health outcomes. The results of the 2 sets of models were very similar, with significant positive associations between food insecurity and the same subset of health outcomes using either method of determining food security status. A second validity test was conducted by stratifying the data by food security status determined using the 18-item scale and estimating the same set of models with food security status determined by the 2-item screen as predictor, using only households categorized as food secure by the 18-item scale. The results of these models also were very similar to results obtained using the full dataset with either food security predictor (25) . This study provides evidence that households with marginal food security are more like households with low food security than food-secure households and that marginal food security is associated with several adverse child and maternal health outcomes (25) .\nThe results of the research reviewed here, considered as a whole, provide strong support for treating marginal food security as a legitimate and serious indicator of lack of access to enough food for an active healthy life. It also consistently indicates that people living in households with marginal food security are more like those in food-insecure households than those in food-secure households in many ways important to public health.\nNew research conducted to further clarify the nature of marginal food security and its associations with child health and development and female caregivers' health and depressive symptoms is described in the following sections. This research also used data from the Children's HealthWatch research program and extends the research described above on the development of the 2-item clinical screen for food insecurity."}, {"section_title": "Methods for new research", "text": "Participants Data are from a household survey administered June 1998 to December 2011 by the ongoing Children's HealthWatch research (4-6). Surveys and medical chart audits were completed at central-city medical centers in Baltimore, Boston, Little Rock, Los Angeles, Minneapolis, Philadelphia, and Washington, DC (Los Angeles and Washington, DC are currently inactive sites). Institutional Review Board (IRB) approval was obtained at each site before beginning data collection and was renewed yearly. Trained interviewers administered surveys to caregivers accompanying children ages <48 mo at acute/primary care clinics and hospital emergency departments (EDs) (Fig. 1) .\nThe Children's HealthWatch interview includes questions about the child's and adult caregiver's household, living arrangements, socio-demographic characteristics, public nutrition and non-nutrition assistance program participation; the child's health status, hospitalizations, and developmental risk factors; the caregiver's health and depressive symptom status; anthropometric measurements of the child; and (33, 34) . Using questions in the interview on housing, living arrangements, and household energy and utility situations, we developed and validated indicators for housing security and energy security (11) (12) (13) used in this study."}, {"section_title": "Sample characteristics", "text": "In these data, 92% of caregivers are the reference child's biological mother (data not shown). The remaining 8% includes biological fathers, other relatives (e.g., grandmothers and aunts), and foster parents. Although mothers' foreignborn status and race/ethnicity vary, all children in the study are U.S. citizens. Families with private health insurance were omitted from the analytic sample, because private insurance is a strong proxy for higher income level (Fig. 1) .\nHigher proportions of mothers in marginally food-secure and -insecure households are foreign-born, Hispanic, have less education, and are unemployed than in food-secure households. Higher proportions of marginally food-secure families receive the Supplemental Nutrition Assistance Program (previously Food Stamp Program), Temporary Assistance for Needy Families (cash assistance), housing subsidies, and Low Income Home Energy Assistance Program (energy assistance) than food-insecure or -secure families. The proportions of marginally food-secure families experiencing housing and energy insecurity are intermediate between the proportions of food-secure and -insecure families ( Table 1) ."}, {"section_title": "Predictor variable: food security status", "text": "The primary predictor variable for this study is food security status in trichotomous form, with mutually exclusive categories (high food security, marginal food security, and low food insecurity) assigned using responses to the standard 18-item scale as described above. In secondary analyses, we used 2 separate, dichotomous, food-security status variables as predictors: one including households with marginal food security together with those with high food security (as usually reported by the USDA/ERS) and the second including households with marginal food security together with those with low food security/food insecure."}, {"section_title": "Outcome variables", "text": "Outcome variables included mothers' reports of her and her child's health status as \"fair/poor\" compared with \"excellent/ good\" (from the NHANES RAND health-status question), whether the child had been hospitalized since birth, a composite variable indicating whether the child was at risk for underweight (weight for age <5th percentile or weight for length <10th percentile for the CDC age/sex standardized growth trajectories), whether the child was overweight, whether the child was admitted on the day of the interview (for interviews conducted in EDs only), whether the mother reported depressive symptoms measured by a 3-item maternal depressive symptom screener (32) , and whether the mother reported substantial concerns about the child's developmental status on the Parents' Evaluation of Developmental Status (PEDS; added to the interview in 2004), a well-validated, reliable, standardized instrument meeting the American Academy of Pediatrics' standards for developmental screening (33, 34) .\nWe used the PEDS scored in 2 separate ways: first, children having any important concerns reported, then those who had 2 or more important concerns were considered to be at developmental risk (both appear in the literature; however, the latter is considered a more stringent criterion for developmental risk) (33) (34) (35) . The sensitivity and specificity of the PEDS are better for children >4 mo than for infants; therefore, PEDS data were analyzed only for children over 4 mo old (4 mo < age < 48 mo) (34, 35) .\nWe also created and used a composite indicator of child wellbeing indicating whether each child was free from adverse conditions on any of the child health outcome measures. Thus, a \"well child\" has its health reported by the mother as \"excellent/good\" (vs. fair/poor), has not been hospitalized since birth, is not at risk of underweight, is not overweight, and has no reported PEDS developmental concerns (36) ."}, {"section_title": "Analytic plan", "text": "To determine whether marginal food security is a predictor of adverse child and maternal health conditions compared with food security and food insecurity, separate multivariate logistic regression models were estimated for each of the outcome variables described above using the 3-category food security predictor. Covariates included in each model were selected on the basis of previous research results and bivariate correlation with both the outcome and predictor variables (1,2,5-7,10-16). Covariates controlled in all multivariate logistic regression models included research site, mothers' race/ethnicity, foreign-born status, marital status, education level, employment status, and age and whether the child was breastfed at all. In secondary analyses, to clarify the implications for estimation of associations of food insecurity with health outcomes of combining marginally food-secure households with food secure-households (the standard approach) vs. combining them with food-insecure households, 2 sets of logistic regression models were estimated using the same outcome variables and covariates with each of the 2 dichotomous forms of the food security status predictor described above."}, {"section_title": "Results", "text": "Of the 41,515 caregiver-child dyads 13 in the analytic sample (Table 1) , 25,660 (61.8%) lived in households with high food security (respondent affirmed no scale items), 6176 (14.9%) in households with marginal food security (respondent affirmed 1 or 2 items), and 9679 (23.3%) in food-insecure households (respondent affirmed 3 or more items). In bivariate analysis, there were significant differences in all outcome measures except risk of underweight and overweight across the 3 food security categories (Table 2) in a stepwise order for most variables.\nIn multivariate logistic regression models using the 3-category food security status variable as predictor and adjusting for potential confounders, both marginal food security and insecurity were positively and significantly associated with higher odds of child fair/poor health status, hospitalizations, both measures of PEDS developmental concerns, and with mothers' depressive symptoms and fair/poor health status compared with children and mothers in food-secure households ( Table 3) .\n14 Food insecurity but not marginal food security was associated with lower odds of the child having \"well child\" status compared with children in food-secure households and neither food insecurity nor marginal food security was associated with risk of underweight or being overweight. Both marginal food security and insecurity were significantly negatively associated with admission from the ED, a counter-intuitive result (Table 3) . For all child outcomes that were significantly associated with both marginal food security and food insecurity (child fair/poor health, hospitalizations, \"well child\" status, both PEDS1 and PEDS2, and admission from ED), the AORs for food insecurity suggest stronger associations than those for marginal food security. Moreover, for child fair/poor health and PEDS1, the 95% CIs for the AORs for marginal food security and food insecurity did not overlap (Table  3 ). Both marginal food security and food insecurity were significantly and positively associated with higher odds of caregiver depressive symptoms and caregiver fair/ poor health status compared with mothers in food-secure households, with the AORs for food insecurity notably larger than those for marginal food insecurity. Also, for both these maternal outcomes, the 95% CIs for the 2 predictor categories did not overlap (Table 3) . Judging by the nonoverlapping CIs for these 2 outcomes, and the 2 child outcomes noted above, the associations between food insecurity and these outcomes appeared to be statistically greater than those for marginal food security with the same outcomes. However, marginal food security remained a significant predictor of adverse outcomes for mother and child compared with food security. In the 2 sets of multivariate logistic regression models using dichotomous food security indicators, one set in which households with marginal food security were combined with food-secure households (the current standard approach) and a second set in which marginally food-secure households were combined with food-insecure households, similar results emerged as in the models using the trichotomous predictor, with a few notable differences ( Table 4) . Compared with child/caregiver dyads in food-secure households, those in food-insecure households, using either form of the dichotomous food security status predictor, had significantly greater odds of adverse results for the same outcomes as observed with the trichotomous food security predictor (child health fair/poor, child hospitalizations, being a \"well child,\" both PEDS outcomes, admission from the ED, and mothers depressive symptoms and fair/poor health status) compared with children and mothers in food-secure households (Tables 3 and 4). The only outcomes in these 2 sets of models for which the AOR CIs did not overlap were caregiver depressive symptoms and caregiver health fair/poor. Judging by those nonoverlapping CIs, caregivers appeared to have significantly greater odds of having depressive symptoms and of reporting their own health as fair/poor when the standard definition of food insecurity was used than when marginally food-secure households were combined analytically with food-insecure households (Table 4) .\nThough the AORs for associations between food insecurity defined in the standard manner (marginally food secure combined with food secure) and adverse child outcomes were noticeably greater in magnitude than those obtained using marginally food-secure households combined with food-insecure households, the CIs for the corresponding AORs for these child outcomes all overlap, implying no apparent significant differences in the associations between food insecurity and the child health and developmental outcomes between the 2 forms of food insecurity represented in the 2 sets of models (Table 4) ."}, {"section_title": "Discussion", "text": "Several studies addressing marginal food security, directly or indirectly, were reviewed. Although the research reviewed spanned a broad and heterogeneous spectrum, some core themes emerged. The clearest of those is that households with marginal food security are in important ways more like food-insecure households than food-secure households in socio-demographic characteristics, psychosocial profiles, and patterns of children's developmental status and health risk. But evidence also emerged from the reviewed research and from the new research presented that marginal food security is not the same as food insecurity, as food insecurity is currently measured, and it probably would not be accurate or effective to combine marginally food-secure households with food-insecure households in estimating and reporting food security prevalence for the U.S. population. Although some of the research reviewed specifically recommended combining marginal food security with food insecurity, the results of the new research presented here argue against doing so. Results from that research provide strong support for separating marginal food security from both food security and food insecurity and treating it as a separate discreet category of its own. The results of the new research support some but not all of our research hypotheses. We hypothesized that marginal food security would be positively associated with adverse health outcomes in both mothers and children, compared with similar food-secure dyads, and that the magnitude of observed associations between marginal food security and health outcomes would be intermediate between those observed with food security and food insecurity. This hypothesis was generally supported by the logistic regression models using a trichotomous food security status variable that isolated marginal food security from food security and food insecurity. In these models, marginal food security was positively associated with 4 of the 8 adverse child outcomes examined and negatively associated with one other child outcome (admit from ED), as was food insecurity, and the magnitudes of those associations were intermediate between those for food insecurity and food security as hypothesized. The negative associations with admit from ED seem paradoxical but may be a result of greater reliance on EDs for nonemergency care by food-insecure families with greater financial stress who are more likely to be uninsured, whereas food-secure families sought care in EDs more often for true emergencies.\nOur hypothesis that associations between marginal food security and adverse child and caregiver health outcomes would reflect an ordinal dose-response-like effect, with marginal food security also posing a significant risk but acting similar to a lower \"dose\" of exposure to the risks posed by food insecurity, was supported by the research results but only partially confirmed. CIs for AORs representing associations of marginal food security and food insecurity with 4 of the 10 outcome measures did not overlap, indicating ordinal dose-response relationships for those 4 outcomes (child and caregiver fair/poor health, PEDS1 developmental risk, and caregiver depressive symptoms) ( Table 3) .\nThis work elucidates how marginal food security should be treated relative to the categories of food security and insecurity in estimating prevalence of exposure to lack of enough food but produced some unexpected results. In the 2 sets of logistic regression models using dichotomous food security predictors, with marginal food security combined first with food security then with food insecurity, there were no apparent significant differences in magnitude of associations of food insecurity with the child health outcomes between the 2 forms of the food security predictor, but effect size was attenuated (Table 4) . Thus, from the purely statistical perspective of estimated associations between food insecurity and child health and developmental risk outcomes, these results suggest that it may not matter much whether marginal food security is combined with food security or insecurity. However, the results have some troubling clinical and public health implications. The AORs for associations between food insecurity and the child health outcomes that were significant are generally larger when marginal food security is combined with food security in the usual way, but their CIs all overlapped with those for the smaller AORs for the other form of the predictor (Table  4 ). Yet considering marginal food security as part of food security can lead to a smaller proportion of the population of young children being identified as at risk for inadequate nutrition (Table 4 , column headings). The same was not the case, however, for the 2 caregiver outcomes. The AORs for associations of food insecurity with both caregiver depressive symptoms and fair/poor health were greater when marginal food security was combined with food security in the usual fashion than with marginal food security combined with food insecurity, and the CIs for the 2 sets of AORs did not overlap. This strongly suggests that the associations of food insecurity with the odds of caregiver depressive symptoms and fair/poor health are significantly greater when food insecurity is defined in the usual way (Table 4) . That result argues against combining marginal food security with food insecurity, because doing so could lead to an underestimation of the associations between food insecurity and these 2 maternal health outcomes.\nLimitations Several limitations should be considered when interpreting these results. The cross-sectional design precludes the determination of cause-effect relationships. Though we controlled for important confounding variables, other unmeasured confounders may exist. Despite the use of questions independently validated by other researchers or by the current research group in earlier subsamples whenever possible, respondents may have over-or under-reported negative child outcomes. Because this study assesses low-income families in emergency rooms and hospital-based clinics, their children are already at elevated risk for developmental and health concerns and may not be representative of all low-income children. However, we excluded urgently ill or injured children, so some of the highest-risk children were not included, which also may help explain the paradoxical relationship with admission on the day of the ED visit. Excluding these families may contribute to underestimating the impacts of marginal food security."}, {"section_title": "Conclusion", "text": "This review and the new research described aim to address 2 related but different questions. The first is about the nature of marginal food security and its implications for child and maternal health from epidemiological, public health, and public policy perspectives. The second is about the implications, from those same perspectives, of the way marginal food security is combined with food security and insecurity in estimating and reporting the prevalence of exposure to lack of enough food in the U.S. population. The former addresses the meaning and implications of failing to recognize, acknowledge, and act on the reality that marginal food security is not the same as food security and that a growing body of evidence shows it is harmful to children's and adults' health. The latter addresses the accuracy and completeness of information available for making important public health and policy decisions regarding the allocation of scarce resources and for judging the effectiveness of public health programs and policies. The research reviewed and described here clearly indicates that marginal food security is not an inconsequential condition and there are very real negative policy and planning consequences of treating it as such.\nThe research presented and reviewed strongly supports producing and reporting prevalence estimates for marginal food security separately at the household level together with the numbers of adults and children living in marginally food-secure households by demographic characteristics while preserving all the information currently reported. Even though marginal food security is briefly described and characterized and overall proportions of respondents affirming only 1 or 2 HFSSM questions reported in the annual reports on food security in the US, it would be far more useful to have marginal food security reported separately and more prominently and completely in those reports. This would provide much-needed information for researchers, public health workers, advocates, and policy makers and help clarify the nature of marginal food security and food insecurity as related but separate serious public health issues."}]