[{"section_title": "Abstract", "text": "surface temperature anomaly patterns among the 1993, 2008, and 2015 cases, the spatial distribution of salinity anomalies was much more consistent during these extreme flood years. Thus, our study suggests that preseason salinity patterns can be used for improved seasonal prediction of extreme precipitation in the Midwest."}, {"section_title": "Introduction", "text": "In the spring of 2015, an extreme rainfall event affected the Southern US and triggered record-breaking floods. The extreme rainfall marked the wettest spring in the state records of Oklahoma and Texas, where the total precipitation more than doubled the springtime rainfall climatology . The resultant flooding caused extensive losses in the economy and agriculture, and claimed more than 20 lives (NOAA National Centers for Environmental Information 2016). The anomalous rainfall propagated northward in the summer of 2015 and resulted in above normal precipitation in the US Midwest and the Great Lakes. The excessive precipitation refilled the Great Lakes and brought the lake levels back to historical averages. According to the NOAA National Centers for Environmental Information (2016) , the year 2015 was the second wettest year on record for the Midwest.\nThis 2015 extreme event has been attributed to the coexistence of an intensified Great Plains Low-Level Jet (GPLLJ) and an anomalous upper tropospheric trough over the Southwest US (Wang et al. 2015) . The coupling between the two circulation systems can create a Abstract The role of the oceanic water cycle in the record-breaking 2015 warm-season precipitation in the US is analyzed. The extreme precipitation started in the Southern US in the spring and propagated northward to the Midwest and the Great Lakes in the summer of 2015. This seasonal evolution of precipitation anomalies represents a typical mode of variability of US warm-season precipitation. Analysis of the atmospheric moisture flux suggests that such a rainfall mode is associated with moisture export from the subtropical North Atlantic. In the spring, excessive precipitation in the Southern US is attributable to increased moisture flux from the northwestern portion of the subtropical North Atlantic. The North Atlantic moisture flux interacts with local soil moisture which enables the US Midwest to draw more moisture from the Gulf of Mexico in the summer. Further analysis shows that the relationship between the rainfall mode and the North Atlantic water cycle has become more significant in recent decades, indicating an increased likelihood of extremes like the 2015 case. Indeed, two record-high warm-season precipitation events, the 1993 and 2008 cases, both occurred in the more recent decades of the 66 year analysis period. The export of water from the North Atlantic leaves a marked surface salinity signature. The salinity signature appeared in the spring preceding all three extreme precipitation events analyzed in this study, i.e. a saltier-than-normal subtropical North Atlantic in spring followed by extreme Midwest precipitation in summer. Compared to the various sea 1 3 baroclinically unstable region over the Southern US that dynamically sustains the heavy rainfall events (Wang and Chen 2009; Harding and Snyder 2015) . Such a circulation feature is further attributed to the interplay between anthropogenic forcing and the developing El Niño in the tropical Pacific (Wang et al. 2015; Steinschneider and Lall 2016) .\nWhile the atmospheric circulation provides a background condition for the precipitation, extreme rainfall cannot be sustained without moisture transport from the oceans (Trenberth et al. 2003; Stohl and James 2004; Chan and Misra 2010) . Over the ocean, the net moisture source regions are primarily located in the subtropics, where evaporation is enhanced by the prevailing wind but precipitation is depressed owing to the presence of subtropical high pressures (e.g., Schmitt 1995; Wu et al. 2009; Lagerloef et al. 2010a; Schanze et al. 2010; Gimeno et al. 2012 ). On a yearly basis, evaporation exceeds precipitation by 1-3 m, resulting in a net moisture export from the subtropics (Schanze et al. 2010; Trenberth et al. 2011) . Climatologically, about a third of the subtropical moisture converges on land and becomes an integral part of the terrestrial water cycle (Gimeno et al. 2010; van der Ent et al. 2010) . Thus, the variability of the subtropical water cycle can significantly modulate precipitation on land (Gimeno et al. 2013; Castillo et al. 2014; Li et al. 2016a, b) .\nOur recent study has shown that the springtime water cycle in the subtropical North Atlantic significantly influences the moisture abundance for synchronized precipitation in the Southern US and modulates summer precipitation in the US Midwest (Li et al. 2016b ). In the spring, increased moisture export from the subtropical North Atlantic tends to converge in the Southern US and thus elevate soil moisture content in the local area (Li et al. 2016b) . Throughout the season, the increased soil moisture content is preserved because of the 3-6 month soil moisture memory in the Southern US (Wu et al. 2007; Dirmeyer et al. 2009 ). Soil moisture in this region actively couples with the overlying atmosphere ), which in turn influences the regional water cycle both thermodynamically and dynamically (Li et al. 2016b) . Along with the summertime intensification of the northward-flowing GPLLJ, the anomalously high precipitation propagates into the US Midwest (Li et al. 2016b ). The North Atlantic water cycle-induced US precipitation change documented by Li et al. (2016b) closely resembled the seasonal evolution of precipitation anomalies in 2015, and allowed its accurate forecasting (Schmitt et al. 2015) . This motivated us to explore the contribution of the North Atlantic water cycle to the 2015 extreme precipitation event, which lay beyond the analysis period covered in Li et al. (2016b) .\nFurthermore, the water cycle variability in the subtropical North Atlantic leaves an imprint on sea surface salinity (SSS), in that the freshwater flux is the ultimate source of SSS variations (Schmitt 1995; Mignot and Frankignoul 2003; Lagerloef et al. 2010a; D'Addezio and Bingham 2014) . The close connection between salinity, the subtropical water cycle, and terrestrial precipitation enables SSS in certain regions of the subtropical oceans to be utilized as a rainfall predictor (Li et al. 2016a, b) . Evidence is presented in Li et al. (2016b) that SSS in the northwestern portion of the subtropical North Atlantic provides even higher predictive skills for US Midwest summer precipitation than SSTbased predictors. Predicting precipitation extremes remains challenging but of immense socioeconomic value. We will further evaluate the performance of SSS in predicting the 2015 events, as well as the extreme precipitation events in the historical records.\nThe rest of the manuscript is organized as follows. Section 2 describes the data and methods used in this study. In Sect. 3, atmospheric moisture flux in the 2015 extreme event is presented, and the contributions of the subtropical North Atlantic water cycle to the rainfall extreme are quantified. Section 4 analyzes subtropical salinity signals associated with the 2015 extreme events, as well as the predictability of historical extremes using the salinity precursors. Conclusions obtained in this study are summarized in Sect. 5."}, {"section_title": "Data and methods", "text": ""}, {"section_title": "Precipitation and atmospheric reanalysis datasets", "text": "The precipitation data used in this study are from the National Oceanic and Atmospheric Administration (NOAA) Climate Prediction Center (CPC) US Unified Precipitation for and from the Real-Time US Daily Precipitation Analysis for the 2007-2015. The dataset is at 0.25° × 0.25° spatial resolution (Higgins et al. 2000) . Seasonal mean precipitation is derived from the accumulated daily precipitation for the spring (March-April-May; MAM) and summer (June-July-August, JJA) seasons. To study the moisture transport between ocean and the conterminous US, we calculated atmospheric moisture flux 1 g ∫ p s 0 q ⃗ Vdp using six different reanalysis datasets (Table 1 ). The moisture flux calculated from the six datasets is averaged over their overlapping periods (Table 1) to minimize the uncertainties introduced by the choice of reanalysis datasets (Li et al. 2013) . The moisture flux diver-\nrepresents the net moisture input or output for each grid cell. From the MFD, we derived the divergent component of the moisture flux by solving the Poisson equations (Lynch 1988) . The divergent component and MFD enable us to identify the net moisture output regions associated with the anomalous precipitation (Chen and Pfaendtner 1993) . The units of MFD have been converted to mm day −1 , in order to be consistent with precipitation.\nFurthermore, to explore the sea surface salinity (SSS) and sea surface temperature (SST) precursors of the extreme events, the UK Met Office EN4.1.1 salinity archive (Good et al. 2013) and Extended Reconstructed SST (ERSST) dataset (Smith et al. 2008) were used, respectively. The source data of EN4.1.1 salinity are observation based, including the World Ocean Database 2005, the global temperature-salinity profile program, and the Argo float data. The salinity profiles from these observational sources are quality controlled. The data used in this study are the objectively analyzed data with 1° × 1° spatial resolution and monthly temporal resolution. The SSS refers to salinity at 5-m depth. The linear trend in the salinity data was removed prior to the analysis."}, {"section_title": "CEOF analysis", "text": "To study the seasonally evolving modes of precipitation variability in the conterminous US, combined empirical orthogonal function (CEOF) analysis is applied to the spring (MAM) and summer (JJA) precipitation (Weare and Nasstrom 1982; Bretherton et al. 1992 ) during the 1950-2015 period. The JJA precipitation usually has higher temporal variance than its MAM counterpart (Higgins et al. 2007; Wang et al. 2010a) . To avoid the dominance of JJA precipitation variability in the combined vector, we normalized both the MAM and JJA precipitation anomalies by their standard deviation prior to the analysis. The normalized MAM and JJA precipitation was first concatenated to form a combined data matrix P:\nThen, the pair-wise covariance between all possible combinations of the precipitation fields were calculated to obtain the covariability matrix R = PP T . The ith eigenvectors of R (i.e., the i-th CEOF mode) can be calculated as\n, where E i MAM is the ith CEOF mode of MAM precipitation, and E i JJA is the ith CEOF of JJA precipitation. The eigenvalue corresponding to the ith eigenvector (E i ) is λ i , and the explained variance by the ith CEOF mode is\n%. In addition, by projecting P to E i , we are able to derive the ith principle component (Weare and Nasstrom 1982; Bretherton et al. 1992) .\nIn addition, we composited the MFD and the divergent component of moisture flux on the CEOF principal component (PC) indices to examine the regional moisture balance and moisture transport associated with the precipitation variation. The composite samples are the years when the PC index exceeds one standard deviation (STD). The significance levels of the composite moisture flux are determined using the two-sample Hotelling's t-squared test (Hotelling 1931) . It is assumed that the divergent component (u, v) is distributed as two-variate normal distribution. The samples from the subset of PC >1STD is distributed as X ∼ N 2 u 1 , Σ 1 with mean vector u 1 and covariance matrix Σ 1 ; while the samples from subset PC<-1STD have the distribution Y ∼ N 2 u 2 , Σ 2 . The null hypothesis is 1 = 2 , meaning that the divergent component of moisture flux does not differ between the two opposite phases of a CEOF mode. The null hypothesis can be tested using the t-squared statistics:\nHere, n x and n y are the number of high and low PC cases.\ny i and W −1 is the inverse matrix of W which is\nThe null hypothesis can be Hotelling 1931) . In this study, we have also tested the composite using |PC| <1STD criteria as contrast samples, and we (1996) found the results do not change (not shown in the following)."}, {"section_title": "Contribution of North Atlantic water cycle to 2015 warm-season extreme precipitation", "text": ""}, {"section_title": "Atmospheric moisture flux during the 2015 extreme rainfall events", "text": "The 2015 extreme event is manifested in the seasonal mean precipitation (Fig. 1a, b ). In the spring (MAM), significant above-normal precipitation is observed over the Central and Southern US (Fig. 1a) . The increases in precipitation are most significant over Texas and Louisiana, where the 2015 MAM precipitation exceeds climatology by more than 2 mm day −1\n, equivalent to a 50% increase in the areaaveraged seasonal-mean precipitation (Fig. 1a) . In the summer, the positive precipitation anomalies in the Southern US weaken, but migrate northward to the US Midwest and the Great Lakes (Fig. 1b) .\nThe US precipitation anomalies in the 2015 spring and summer can be explained by the atmospheric MFD in the local atmospheric columns (Fig. 1c, d ). In the spring, there are 2.5 mm day −1 increases in moisture flux convergence (MFC) in the Southern US corresponding to the observed 2 mm day −1 precipitation increase (Fig. 1c) . Thus, the net moisture input from nonlocal sources is more than enough to sustain the extreme precipitation and can fully explain the observed precipitation anomaly. In the summer, the anomalous MFC moves northward, along with the excessive precipitation. The spatial distribution of the MFC anomaly generally follows the precipitation anomaly, except for the eastern portion of the Great Lakes (Fig. 1d) . In these areas, the MFC anomaly (0.5-1 mm day −1 ) contributes approximately 30% of the observed precipitation anomaly (1.5-2 mm day −1 ), suggesting that local moisture recycling is a necessity to maintain the wet summer of 2015 (Fig. 1d) .\nThe increased springtime MFC in the Southern US coincides with an increased moisture export from the subtropical North Atlantic (Fig. 1c, e) . Examination of the divergent component of moisture flux suggests that the excessive ). Despite prevailing westerlies (e, f), US east coast dwellers are well aware that it is the east winds that bring in rain from the ocean (c, d) moisture inflow into the Southern US comes mainly from two regions in the subtropical North Atlantic located along 40°N and the Southern edge of the subtropical oceans (15°-20°N) (Fig. 1c) . Along 40°N, MFD increases by 2-2.5 mm day −1 in the spring of 2015. The excessive moisture from the subtropical North Atlantic tends to be transported into the Southern US (mostly Texas and Louisiana, the areas with maximum rainfall increases) along an intensified and westward movement of the subtropical high circulation (Fig. 1e) , although the exact moisture transport pathway should be identified using a Lagrangian moisture tracking method. In addition, the anomalous MFD (2.5 mm day −1 ) over the Southern edge of the subtropical oceans contributes moisture to a relatively smaller area along the Gulf Coast (Fig. 1c) .\nIn the summer, the MFD at 40°N is weakened or even reversed to MFC off the US coast. The largest oceanic moisture sources are located in the Southern portion of the subtropical oceans, where MFD anomalies exceed 3 mm day −1 and the divergent component of the moisture flux is directed to the Midwest. Thus, the excessive moisture for summer precipitation is from the climatological moisture source region for the Midwest (Gimeno et al. 2012) . The results are consistent with our previous study about the seasonal evolution of precipitation across the Southern US and Midwest (Li et al. 2016b) .\nIn contrast to the subtropical North Atlantic, the Pacific Ocean did not contribute a significant amount of moisture to the 2015 extreme precipitation. With the ongoing El Niño in the tropical Pacific, MFD increases in the subtropical oceans (Fig. 1c) . The increased moisture flux from the subtropical North Pacific mainly converges in the tropical oceans (Fig. 1c) , consistent with the typical circulation pattern induced by ENSO events (e.g., Seager et al. 2012; Xu et al. 2015) . However, the moisture from the North Pacific barely converges onto the Southern US, indicating that the El Niño induced water cycle change does not directly influence the MFC that is a pre-requisite for the 2015 extreme precipitation event (Fig. 1c) . Previous studies attributed the 2015 Southern US extreme rainfall to the atmospheric circulation change forced by the El Niño event (Wang et al. 2015) . The analysis here suggests that the water cycle in the subtropical North Atlantic plays the dominant role in sustaining the moisture supply for the excessive precipitation, which together with the ENSO-induced circulation change fuels the 2015 extreme event (see details in Sect. 3.3)."}, {"section_title": "The subtropical North Atlantic water cycle and its contribution to US precipitation", "text": "By performing a CEOF analysis, we show that warm-season extreme precipitation in 2015 is representative of a seasonal evolution mode of US precipitation throughout the historical records . Figure 2 shows the CEOF modes of spring and summer precipitation. The first CEOF mode shows a wet spring in the Southeastern US followed by a dry summer in the Central US (Fig. 2a, c) . In contrast, the second CEOF mode is manifested as a northward movement of precipitation anomalies in the central US from spring to summer. In the spring, above normal precipitation is located in the Southern US (Fig. 2b) . The excessive precipitation migrates northward to the Midwest in the summer. At the same time, dry summer conditions develop in the Southeastern US (Fig. 2d) . The mode of variability presented in the second CEOF closely resembles the seasonal evolution of the 2015 warm-season precipitation (Fig. 1a,  b) . The PC2 index in 2015 exceeds two STD of the mode time series (Fig. 2f) . Furthermore, the pattern correlation coefficients between 2015 spring (summer) precipitation anomaly and the CEOF-2 MAM (JJA) mode is 0.72 (0.41), both significant at a 0.001 level. It is worth noting that the similarity between the 2015 case and CEOF-2 is not solely caused by a disproportionate contribution from the 2015 case in generating the CEOF-2 mode. We computed the CEOF modes excluding the 2015 record and found that the spatial pattern and PC time series remain unchanged from those shown in Fig. 2 . Similarly, the pattern correlation between 2015 case and the CEOF mode-2 is 0.68 and 0.39 for MAM and JJA, respectively. The precipitation evolution pattern depicted by CEOF mode-2, and exemplified by the 2015 extreme event, seems to have become more dominant in recent decades. Figure 2f shows the PC of CEOF mode-2. According to our analysis, the STD of the PC increases by 68% (92%) in the 1986-2015 (1996-2015) compared to the 1950-1979 (1950-1969) period. This increase in CEOF2 mode variability indicates a stronger projection of the seasonal rainfall evolution pattern upon this northward migration mode (Fig. 2b, d ). The mode variability increase is consistent with the increased frequency of both drought and flooding in the Southern US, as well as more variable summer rainfall in the Southeast (Wang et al. 2010a; Li et al. 2011; Wuebbles et al. 2014; Feng et al. 2016) . Thus, extreme rainfall events, such as the 2015 case, are more likely to occur in recent decades than in the past. Given this context, a detailed analysis of the causes of CEOF mode-2 will provide insights for understanding extreme warm-season US precipitation.\nSimilar to the 2015 case, the variability of CEOF mode-2 is associated with the water cycle in the subtropical North Atlantic. Figure 3 shows the composite of springtime (MAM) and summertime (JJA) atmospheric moisture flux upon the PC2 time series. During the entire 1950-2015 period, above-normal spring precipitation in the Southern US coincides with an increased MFC in the local atmospheric column. The increased moisture inflow into the Southern US most likely originates from the northwestern portion of the subtropical North Atlantic (north of 20°N and west of 60°W), where MFD increases by 0.8-1 mm day −1 with PC2 exceeding one STD (Fig. 3a) . The divergent component of moisture flux suggests that the excessive subtropical water is directed towards the Southern US and constitutes about 1 mm day −1 moisture input to the local area (Fig. 3a) . In the summer, as the precipitation anomalies move northward, the MFC anomalies also migrate towards the Midwest. Accompanying the northward displacement of the MFC, the oceanic moisture sources shift westward and are located in the Gulf of Mexico (Fig. 3b) . According to previous studies, the Gulf of Mexico is a climatological moisture source region for summer precipitation in the Midwest (Schubert et al. 2004; Gimeno et al. 2010 Gimeno et al. , 2012 . Thus, the JJA mode is likely caused by the intensified/weakened moisture flux in the source regions. Overall, the moisture budget analysis suggests an important contribution from the water cycle in the subtropical North Atlantic to the variability of CEOF mode 2, a seasonal evolution mode resembling the 2015 extreme rainfall event.\nSince this mode of variability has significantly intensified in the second half of the record, we repeated the composite analysis for the 1950-1979 and 1986-2015 periods. According to the analysis, the most significant differences in the two moisture flux composites are located in the subtropical North Atlantic (Fig. 3c-f ). In the 1950-1979 composite, there is almost no increase in MFD in the subtropical North Atlantic, especially in the spring (Fig. 3c, d ). In the spring, along the northwestern portion of the subtropical ocean, the climatological MFD is weakened and shows an anomalous MFC, indicating that the subtropical ocean exports less moisture (Fig. 3c) . As a result, there is no significant springtime MFC anomaly in the Southern US (Fig. 3c) . In addition, the moderate wetting of the Midwest draws moisture mainly from the tropical Pacific (south of 15°N; Fig. 3d ). The 1950-1979 composite suggests that the water cycle in the subtropical North Atlantic does not closely connect to the moisture balance over the conterminous US during this period. Such a connection between the oceanic and terrestrial water cycles becomes more significant in the recent 30 years of the record. In the 1986-2015 composite, springtime MFD in the northwestern portion of the subtropical North Atlantic exceeds 1.6 mm day −1 , significant at a 0.05 level according to the student t test (Fig. 3e) . The increased moisture export is directed toward the Southern US and significantly increases local MFC (Fig. 3e) . Similar North Atlantic influence can be observed in the summer season. With an increase of MFD in the Gulf of Mexico by 1.8 mm day −1 , more moisture is transported and converges in the Midwest, leading to excessive summer precipitation there (Fig. 3f) .\nThe above analysis suggests that moisture from the subtropical North Atlantic is influencing the US moisture balance more significantly in recent decades. This enhanced Atlantic influence contributes to the recently increased variability of the CEOF mode-2 of US precipitation (Fig. 2f) , which can be translated to an increased likelihood of extreme rainfall events, such as the 2015 case. Thus, in addition to the ENSO teleconnection identified in previous studies (Meehl and Teng 2007; Wang et al. 2015) , the results here indicate that water cycle variability in the North Atlantic source regions can also fuel US extreme rainfall events during the warm season."}, {"section_title": "ENSO teleconnection and its relationship with the North Atlantic water cycle", "text": "In 2015, a strong El Niño event developed in the tropical Pacific. The ongoing El Niño induced an anomalous wave train in the mid-latitudes, which sets up a favorable background circulation for the extreme spring precipitation in the Southern US (Wang et al. 2015) . Since the ENSO teleconnection is a major driver of US precipitation variability (e.g., Ropelewski and Halpert 1987; Higgins et al. 1997; Barlow et al. 2001) , it is important to evaluate whether the contribution of the subtropical North Atlantic water cycle to the 2015 extreme US precipitation results from the covariability between ENSO and the water cycle. Thus, we analyzed the MAM and JJA moisture flux fields associated with El Niño events. Here, El Niño events were determined as years when MAM Niño 3.4 SST anomaly exceeds one STD. It is apparent from the composite shown in Fig. 4 that El Niño events are associated with anomalous MFC in the cold tongue which weakens the climatological MFD in this area. This leads to a reduction in moisture export from the local ocean (Fig. 4a) . The ENSO's impact on atmospheric moisture flux is most significant in the Pacific, and reflects a typical atmospheric teleconnection pattern, i.e., the Pacific-North-America (PNA) pattern (Alexander et al. 2002) . In the North Atlantic, the anomalous MFC occurs in the Inter American Seas, whereas there is almost no change in MFD in the subtropical North Atlantic (Fig. 4a) . The result is consistent with Castillo et al. (2014) , whose moisture tracking analysis shows no significant changes in North Atlantic subtropical moisture sources during El Niño years.\nIn addition, the Southern US tends to experience less moisture input from external sources during El Niño years (Fig. 4a, b) . Assuming a linear relationship between ENSO and MFD, Fig. 4b shows the anomalous MFD and the divergent component of moisture flux over the conterminous US given the 2015 El Niño intensity. Over the Southern US, the 2015 El Niño tends to reduce climatological MFC by 0.6 mm day −1 , and should thus counteract the observed extreme precipitation (Fig. 4b) . Overall, the ENSO composite moisture flux pattern in the North Atlantic and US sector differs from the 2015 case (Fig. 1a) , as well as from that composite on CEOF mode-2 (Fig. 3a, e) . Thus, the increased springtime moisture flux from the subtropical North Atlantic in 2015 is unlikely to have benefitted from the ongoing El Niño in the tropical Pacific. Our analysis of summertime moisture flux, however, suggests that the ongoing El Niño might have positively contributed to the excessive precipitation in the US Midwest and the Great Lakes in 2015. According to Fig. 4c , in the summer following springtime El Niño, the peak of MFC anomaly shifts to the west of the dateline. MFC slightly increases in the US Midwest and the Great Lakes, contributing to approximately 0.2 mm day −1 above normal precipitation in the area (Fig. 4c, d ). The positive contribution of El Niño to summertime Midwest precipitation is also noticed in previous studies (Ting and Wang 1997; Barlow et al. 2001; Schubert et al. 2004; Harding and Snyder 2015) . The increase in MFC following the 2015 El Niño is equivalent to 20% of the total rainfall increase during the 2015 summer (Figs. 1b, 4d) . Thus, the 2015 El Niño induced moisture flux variation plays a secondary but non-negligible role in the anomalous summer precipitation in the US, in addition to the water cycle in the subtropical North Atlantic."}, {"section_title": "Subtropical North Atlantic water cycle and its imprint on SSS", "text": ""}, {"section_title": "North Atlantic SSS precursor of 2015 US extreme precipitation events", "text": "The above analysis highlights the contributions of the North Atlantic water cycle to the CEOF mode-2 of US precipitation and the 2015 extreme precipitation event. The oceanic water cycle leaves an imprint on sea surface salinity (SSS), with increased net moisture export (i.e., MFD) corresponding to increased SSS (Schmitt 2008; Lagerloef et al. 2010a; Yu 2011; D'Addezio and Bingham 2014) . Our study suggests that a saltier springtime subtropical North Atlantic coincides with an increased ocean-to-land moisture transport to the Southern US, and thus above-normal spring precipitation in the South followed by an anomalously wet summer in the Midwest (Li et al. 2016b ). This seasonal evolution of US precipitation anomalies during the high SSS years is similar to the CEOF mode-2 and the 2015 case (Figs. 1a, b, 2b, d ). The significant correlation between SSS in the northwestern portion of the subtropical ocean 1 and the CEOF PC2 (R = 0.31, p < 0.02) supports the SSS-rainfall 1 The northwestern portion of the subtropical ocean is defined as the regions where local evaporation exceeds precipitation in the MAM and the divergent component of atmospheric moisture flux is directed northwestward towards the US continent (Li et al. 2016b) . relationship identified in Li et al. (2016b) . Furthermore, along with the extreme US precipitation in 2015, we observed increases in SSS over the subtropical North Atlantic (Fig. 5) . Specifically, the most significant SSS anomalies (>0.5 unit of PSS-78) are located along the climatological P-E = 0 isoline, which defines the boundary of the subtropical oceans (Fig. 5) . It is noteworthy that the SSS anomaly collocates well with the MFD anomalies (Figs. 1c, 5) , where the increased net removal of moisture from the ocean surface leads to excessive salt flux into the ocean. The results are consistent with Yu (2011) , who showed a predominance of freshwater flux (P-E) in modulating SSS variation in this area.\nThe high salinity in the spring of 2015 provides independent evidence to support our previous study (Li et al. 2016b ). In addition, the patterns of anomalous atmospheric moisture flux (Fig. 1c, d ) and soil moisture content (Fig. 6 ) in 2015 are consistent with the physical mechanisms proposed in Li et al. (2016b) , which is summarized and illustrated in Fig. 7 .\nInitially, the increased moisture transport from ocean to land elevated soil moisture content in the Southern and Central US during the spring season. In the subsequent seasons, the high soil moisture content is preserved due to the 3-6-month land surface memory. The high soil moisture content serves as a moisture source to the local atmospheric column by increasing boundary layer humidity in the Southern and Central US. With the prevailing southerly wind in the summer, more moisture will be converged into the US Midwest, which is thermodynamically favorable for heavier precipitation (Meehl and Washington 1988; Delworth and Manabe 1989; Ek and Holtslag 2004) .\nIn addition, the spatial distribution of soil moisture influences precipitation through atmospheric dynamics, i.e. the intensity of the Great Plains Low-level jet (GPLLJ). Specifically, the increased soil moisture in the Central US enhances the west-to-east soil moisture gradient along the slope of the Rocky Mountains. The soil moisture content gradient increases the zonal pressure gradient and forces the GPLLJ to intensify to balance the enhanced pressure gradient McCorcle 1990, 1991) . The intensified GPLLJ brings more Gulf of Mexico moisture northward, favors moisture flux convergence in the Midwest, and thus contributes to high precipitation dynamically.\nThe proposed mechanism is verified by the soil moisture content anomalies in the 2015 case (Fig. 6) . Specifically, (Fig. 6a, b) . In the summer, soil moisture anomalies expand northward along with the seasonal strengthening of the GPLLJ (Fig. 6c,  d ). The increased soil moisture content in the Central US can influence the precipitation both thermodynamically and dynamically, and thus lead to above-normal precipitation in the US Midwest and Great Lakes [see details of the moisture budget analysis in Li et al. (2016b) ]. The soil moisture anomalies in 2015 support the delay mechanism proposed in Li et al. (2016b) and Fig. 7 , which bridges the 3-month lag of Midwest precipitation following springtime SSS in the northwestern subtropical North Atlantic. Thus, the 2015 case confirms our conclusion that salinity in the northwestern portion of the subtropical North Atlantic is indicative of US precipitation variability and can be a useful predictor for summer precipitation in the US Midwest."}, {"section_title": "Salinity as a predictor of historic Midwest extreme precipitation events", "text": "The SSS precursor observed in 2015 also appeared in the springs of 1993 and 2008, two other years with record-high summer precipitation in the US Midwest (Lott et al. 2012) . Averaged over the Midwest (106-90°W, 37-49°N), precipitation anomalies exceed 4.3 and 1.3 standard deviations in the summer of 1993 and 2008, respectively. The extreme summer precipitation in these two years is preceded by wet springs in the Southern US (Fig. 8) , presenting a seasonal rainfall evolution pattern similar to the second CEOF mode (Fig. 2b, d) . Indeed, the 1993 and 2008 cases show high projection coefficients upon the CEOF mode-2 (Fig. 2f) , a mode that is significantly influenced by the water cycle of the subtropical North Atlantic. Since the water cycle provides a direct forcing on SSS variability in the subtropical oceans, the SSS precursor appeared in the subtropical North Atlantic in both springs, with above-normal SSS in the northwestern portion of the subtropical ocean (Fig. 9) . Specifically, the maximum increases in SSS in 1993 are located off the eastern coast of the US, where positive SSS anomalies exceeds 0.8 unit of PSS-78 (Fig. 9a) . In addition, the 2008 spring witnessed the most significant SSS increase in the Gulf of Mexico, the Gulf Stream extension region, and the center of the subtropical gyre (Fig. 9b) . Overall, the domain averaged SSS anomalies in the northwestern portion of the subtropical ocean are 0.15 (0.10) unit of PSS-78 in the spring of 1993 (2008), equivalent to 2.23 (1.49) standard deviation of SSS variation in this area (Fig. 9) . The lead time of salty subtropical North Atlantic in the spring to extremely wet summer in the Midwest suggests that SSS can be an indicator of extreme summer precipitation in the Midwest. Assuming a linear relationship between SSS and precipitation, the positive SSS anomaly in 1993 will be followed by a 0.7 mm day −1 increase in Midwest summer precipitation, which alone explains 37% of the observed precipitation anomalies. In contrast, the previously identified ENSO predictor (Mei and Wang 2011) can only explain 8%, insufficient to account for the observed 1993 extreme precipitation (Patricola et al. 2015) . Furthermore, the SSS-based prediction forecasts 0.47 mm day −1 precipitation anomalies in the summer of 2008. The predicted precipitation equates to 78% of the observed precipitation anomaly. The higher-than-normal springtime subtropical North Atlantic SSS occurs in five out of six historical extreme precipitation events in the Midwest. Meanwhile, in all of the 6 years with the saltiest subtropical ocean, a wet summer ensued in the Midwest.\nThe success of using SSS in predicting extreme Midwest precipitation suggests that SSS can add important predictive skills to the existing SST-based seasonal forecast of terrestrial precipitation. Our previous study showed that SSS in the northwestern portion of the subtropical North Atlantic is a more important predictor for US Midwest summer precipitation in comparison with SST and atmospheric circulation modes (Li et al. 2016b ). The superior rainfall predictive skill from SSS variations is even more apparent for extreme precipitation. Figure 10 shows the global SST anomaly (SSTA) in the spring and summer of 1993, 2008, and 2015 . Among the three cases analyzed in this study, the SSTA patterns differ significantly. In 1993, the spring SSTA is characterized by a 1 K warming in the eastern tropical Pacific (Fig. 10a) . The SSTA, however, almost completely decayed in the summer season when the extreme precipitation in the Midwest peaked (Fig. 10b) . Such an SSTA pattern is favorable for wet summers in the Midwest and does contribute to the observed extreme events (Ting and Wang 1997; Weaver et al. 2009 ). The SSTA pattern in 2008 is almost opposite to the 1993 case, i.e. a cold Pacific but warm Atlantic (Fig. 10c, d ). Previous studies suggested that a cold Pacific in combination with a warm Atlantic is favorable for drought in the US Midwest (Hoerling and Kumar 2003; McCabe et al. 2004; Schubert et al. 2004; Mo et al. 2009; Wang et al. 2010b) . The development of the 2008 extreme events with the backdrop of the drought-prone SSTA pattern indicates that the seasonal forecasts of extreme Midwest summer seasons tend to be biased when only based on typical SSTA patterns. Similarly, the SSTA patterns in 2015 spring and summer show distinctly different structures compared to the 1993 and 2008 cases. With the 2015 El Niño event, positive SSTA spanned the central and eastern Pacific. The warm SSTA also extended to the Gulf of Alaska and the California Coast (Fig. 10e, f) . Concurrent with the El Niño, a warming of the Indian Ocean by 1-1.5 K was seen (Fig. 10e, f) . Such an anomalously warm Indian Ocean is absent in the 1993 and 2008 cases, which complicates the prediction of 2015 Midwest summer precipitation based on SSTA modes. "}, {"section_title": "Discussions and conclusions", "text": "This study assesses the contribution of the oceanic water cycle to the extreme 2015 warm-season (MAM and JJA) precipitation event in the US. The record-breaking precipitation affected the Southern US in the spring and migrated northward to the Midwest and Great Lakes in the summer of 2015. Analysis of atmospheric moisture flux indicates that this extreme event is largely fueled by excessive moisture export from the subtropical North Atlantic. This North Atlantic contribution to 2015 US extreme precipitation differs from the typical changes in atmospheric moisture flux forced by ENSO variability. Thus, the influence of the North Atlantic water cycle on the extreme precipitation is independent of the impact exerted by the ongoing El Niño during the 2015 warm season.\nThe seasonal evolution of the precipitation in 2015 is representative of the second CEOF mode of US warm-season precipitation. Similar to the 2015 case, the rainfall variability depicted by the CEOF mode 2 is significantly influenced by the water cycle in the subtropical North Atlantic. Specifically, the excessive springtime precipitation in the Southern US is sustained by moisture from the northwestern portion of the subtropical North Atlantic. The oceanic moisture sources migrate into the Gulf of Mexico in the summer, which supplies moisture to abovenormal summer precipitation in the Midwest and Great Lakes region.\nOur analysis further showed that the interannual variability of the CEOF mode-2 has significantly intensified in the second half of the analysis period, suggesting that extreme precipitation events, like the 2015 case, are more likely to occur in recent decades. contribution of the subtropical North Atlantic water cycle to US precipitation (Gimeno et al. 2013 ). Conservation of water and salt assures that the water cycle in the subtropical North Atlantic leaves an imprint on SSS. The close relationship between the subtropical water cycle and precipitation in the US makes subtropical SSS a useful predictor of summer precipitation in the US Midwest (Li et al. 2016b ). The 2015 case provides independent evidence to support the predictability of Midwest precipitation based on springtime North Atlantic SSS. In the spring of 2015, abnormally high SSS is observed in the northwestern portion of the subtropical North Atlantic, which collocates with the increased moisture flux divergence. Furthermore, the changes in atmospheric moisture flux and land-surface variables in 2015 support the physical mechanisms proposed in our previous study (Li et al. 2016b) .\nBy comparing the springtime SSS and SST patterns in the extreme cases (i.e. 1993, 2008, and 2015) , we show that the SSS precursor, a saltier subtropical North Atlantic, appeared in all three spring seasons preceding the extreme events. In contrast, SST patterns were distinctly different among the three events. The SSS appears to be a more reliable predictor than SST in forecasting the summertime extreme precipitation in the US Midwest. Thus, our study calls for sustained monitoring of SSS using both in-situ and remote sensing tools (Lagerloef et al. 2010b ), which will help to improve the predictability of extreme rainfall events."}]