[{"section_title": "Abstract", "text": "Community and rich-club detection are a well-known method to extract functionally specialized subnetwork in brain connectivity analysis. They find densely connected subregions with large modularity or high degree in brain connectivity studies. However, densely connected nodes are not the only representation of network shape. In this study, we propose a new method to extract abnormal holes, which are another representation of network shape. While densely connected component characterizes network's efficiency, abnormal holes characterize inefficiency. The proposed method differs from the existing hole detection in two respects. One is to use Hodge Laplacian to obtain a harmonic hole in the linear combination of edges, rather than a subset of edges. The other is to use the kernel density estimation of persistence diagram of random networks to determine the significance of a hole, rather than using the persistence of a hole. We applied the proposed method to find the abnormality of metabolic connectivity in the FDG PET data of ADNI. We found that, as AD severely progressed, the brain network had more abnormal holes. The localized holes showed how inefficient the structure of brain network became as the disease progressed."}, {"section_title": "", "text": "Index Terms-Hole, Brain connectivity, Alzheimer's disease, Kernel density estimation, Hodge Laplacian Data used in preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (adni.loni.usc.edu).\nAs such, the investigators within the ADNI contributed to the design and implementation of ADNI and/or provided data but did not participate in analysis or writing of this report.\nA complete listing of ADNI investigators can be found at: http://adni.loni.usc.edu/wp-content/uploads/how_ to_apply/ADNI_Acknowledgement_List.pdf. "}, {"section_title": "INTRODUCTION", "text": "Functional specialization has been often studied in brain imaging analysis. By introducing the concept of network, the research interest of brain imaging analysis has been extended from functional specialization of local regions to the functional integration in the whole brain connectivity [1] . Although the complex graph theoretic measures such as smallworldness and modularity have been widely used for finding the global characteristics of brain connectivity, we still want to know which parts of brain are related to the specific cognitive function or neurodegenerative disease. In this sense, community and rich-club detection have been proposed to extract functionally specialized subnetwork [2, 3] . They find densely connected subregions with large modularity or high degree in the whole brain connectivity. Those regions are usually considered to be related with the specific cognitive function, and weakened by the disease progression. However, it is rarely mentioned how the shape of brain network is changed after the deterioration of connections in the regions.\nIn this paper, we propose a hole detection method to find the shape change during the disease progression. Hole is also a connected component, but there is a path that any node in the hole can return to itself, and the path consists of at least four consecutive edges. Like a connected component, a hole is also the fundamental shape descriptor defined in algebraic topology [4] . While densely connected component represents the network's local efficiency, the hole with many consecutive edges characterizes the network's inefficiency. The concept of hole defined in topological data analysis has been already used for brain network analysis [5, 6, 7] . In the topological data analysis, a persistent hole that lasts for a long threshold is considered as a signal of network and a hole with short duration of threshold is considered as a noise. In this sense, the existing hole detection methods find the significant hole using the persistence of the hole. However, we determine the significance of hole using the probability map of persistence diagram because not only the persistent hole, but also the hole that appears and disappears at abnormal thresholds are impor-tant to determine the shape of brain network. The kernel density estimation is used for obtaining the probability map of persistence diagram.\nThe proposed method finds a harmonic hole represented by the weighted sum of edges based on Hodge Laplacian [8, 5] , while the existing method usually finds a hole in the binary representation of edges, i.e., a subset of edges [6, 7, 9] . The weights of the harmonic hole are proportional to the contribution of edges to the hole. Moreover, while the existing method can not find the unique representation of a hole, i.e., there are many other possible subsets of edges for representing a hole, the harmonic hole method finds the unique representation of a hole. In experiments, the proposed method was applied to FDG PET data of Alzheimer's disease neuroimaging initiative (ADNI) and showed that the proposed method can find the abnormal shape of network as AD progressed."}, {"section_title": "METHODS", "text": ""}, {"section_title": "Network construction", "text": "The ADNI FDG-PET dataset consists of three groups, 181 normal controls (NC), 168 mild cognitive impairment (MCI), and 135 Alzheimer's disease (AD) subjects (Age: 73.75\n.9, range 56.1´90.1). The MCI group was divided into two groups, 91 stable MCI (sMCI) and 77 progressive MCI (pMCI), depending on whether a subject remained stable or progressed to AD after three years. Details of data sets and preprocessing are in [10] . The whole brain image was parcellated into 94 regions of interest (ROIs) based on automated anatomical labeling (AAL2) except for cerebellum [11] . Each ROI serves as a node and its measurement is obtained by averaging FDG uptakes in the ROI. The distance between two nodes was estimated by the diffusion distance on positive correlations between measurements of two ROIs. The diffusion distance considers an average distance of all direct and indirect paths between two nodes via random walk. Suppose that a weighted network N pV, E, Lq consists of p nodes in a set V and q edges in E, and an edge distance matrix L P R pˆp . The entry of L \" rlpe ij qs is the distance of the edge e ij P E connecting two nodes v i and v j (v i , v j P V ). Given a threshold ą 0, Rips complex, denoted by R N p q, is the collection of nodes V , edges satisfying lpeq ă , e P E and triangles satisfying lpe ij q, lpe jk q, lpe ki q ă , e ij , e jk , e ki P E, v i , v j , v k P V . When the sequence of thresholds is given by 0 \" 0 ď 1 ď 2 ď¨¨¨, the sequence of Rips complexes is estimated by R N p 0 q Ď R N p 1 q Ď R N p 2 q Ď¨¨¨. This procedure is called the Rips filtration [4] . Fig. 1 ) [9] . The number of holes in R N p q is the first Betti number, denoted as β 1 ."}, {"section_title": "Hole", "text": ""}, {"section_title": "Definition 1. Holes in R N p q is a subset H Ď E where consecutive edges form a cycle, but are not a boundary of any consecutive triangles (See", "text": ""}, {"section_title": "Definition 2.", "text": "If a hole appears at the threshold ξ and disappears at τ p0 ď ξ ď τ ă 8q, it is encoded into a 2-dimensional point t \" pξ, τ q P R 2 . Given weighted network N pV, E, Lq, if m holes appear and disappear during the filtration of N , they are represented by a set of m points P \" tt 1 , . . . , t m u . The scatter plot of P is called a persistence diagram (PD) of N [9] . Because ξ i ě τ i for @i, the points are always in the upper regions of the diagonal line y \" x in R 2 ."}, {"section_title": "Kernel density estimation of persistence diagram", "text": "Let u 1 , . . . , u m P R 2 be an independent, identically distributed random sample from an unknown density p. Kernel density estimation can be expressed aŝ\nwhere K : R 2 Ñ R is a smooth kernel function and h ą 0 is the smoothing bandwidth that controls the amount of smoothing. The kernel function should satisfy two requirements, normalization ş 8 8 Kpuqdu \" 1 and symmetry Kp´uq \" Kpuq for all u.\nSince a point t \" pξ, τ q in a persistence diagram is bounded by ξ, τ ą 0 and ξ ă τ , we cannot directly apply the traditional kernel function. Thus, we transform t \" pξ, τ q to uptq \" pvptq, wptqq \" p´logpτ`ξq,´logpτ´ξqq on the entire real plane. The function u is one-to-one transformation. The Jacobian of the transformation function u išˇˇB Then, we can write the kernel density of persistence diagram pptq \"p m puqˇˇˇˇB pv, wq Bpξ, τ qˇˇˇˇ( 1)\nWe use the student's t-distribution for the kernel K because it is more robust to errors with heavier trails than normal distributions "}, {"section_title": "Hodge Laplacian for hole localization", "text": "Since the boundary of an edge is two nodes, we denote an \nwhere \" p¨q is 1 if p¨q is 0, and 0 if p¨q is 1 [8, 5] . Let a hole t \" pξ, τ q is abnormal. If we choose in rξ, τ s, the null eigenvectors of H 1 p q include the harmonic hole of t. While t is a subset of edges, the harmonic hole is the weighted sum of edges (See Fig. 1) . If H 1 p qz \" 0, the harmonic hole is represented by ř q i\"1 z i e i , where z \" rz i s. The absolute value |z i | is proportional to the contribution of e i to the hole. If it is large, the edge is an unique path on the hole. Otherwise, alternative paths exist on the hole. To find the harmonic hole of t, we estimate H 1 p 1 q, H 1 p 2 q, and H 1 p 3 q for ξ \" 1 ă 2 ă 3 \" τ and find their common null eigenvector."}, {"section_title": "RESULTS", "text": "We generated 5000 random networks in a group by permutations and estimated the kernel density of persistence diagram in Definition 3. The kernel density of persistence diagram of NC, sMCI, pMCI, and AD were shown in Fig. 2 . 27, 26, 25, and 35 holes were found in NC, sMCI, pMCI, and AD, respectively. The blue and red dots represented holes and abnormal holes, respectively. Among them, only pMCI and AD had an abnormal hole (p ă .05). t 1 was an abnormal hole of pMCI and t 2 and t 3 were that of AD. The duration of the hole t 3 was not persistent enough, however, it was selected as an abnormal hole by the proposed method. To see the hole structure of sMCI, we chose t 4 in (b) which has the smallest p value in sMCI (p \" 0.122). t 1 , . . . , t 4 are shown in Fig. 3 ."}, {"section_title": "DISCUSSION AND CONCLUSIONS", "text": "The brain regions of NC and sMCI may be well-connected to each other because there was no abnormal hole in NC and sMCI. pMCI and AD had similar abnormal hole where the connections between two large modules, the frontosubcortical and parieto-occipital regions, were disturbed by right interior, middle, superior temporal gyrus (ITG, MTG, STG), right supplementary motor area (SMA), posterior cingulate cortex (PCC) and paracentral lobule (PCL). The results show that the abnormal hole was found in the functional connectivity when AD severely progressed. By the localization of abnormal holes, we can see how the shape of network after the deterioration of brain. However, further discussion is needed on the biological meaning of abnormal holes. We"}]