[{"section_title": "Abstract", "text": "Background: Affective and emotional symptoms such as depression, anxiety, euphoria, and irritability are common neuropsychiatric symptoms (NPS) in pre-dementia and cognitively normal older adults. They comprise a domain of Mild Behavioral Impairment (MBI), which describes their emergence in later life as an at-risk state for cognitive decline and dementia, and as a potential manifestation of prodromal dementia. This selective scoping review explores the epidemiology and neurobiological links between affective and emotional symptoms, and incident cognitive decline, focusing on recent literature in this expanding field of research.\nMethods: Existing literature in prodromal and dementia states was reviewed, focusing on epidemiology, and neurobiology. Search terms included: \"mild cognitive impairment,\" \"dementia,\" \"prodromal dementia,\" \"preclinical dementia,\" \"Alzheimer's,\" \"depression,\" \"dysphoria,\" \"mania,\" \"euphoria,\" \"bipolar disorder,\" and \"irritability.\"\nResults: Affective and emotional dysregulation are common in preclinical and prodromal dementia syndromes, often being harbingers of neurodegenerative change and progressive cognitive decline. Nosological constraints in distinguishing between pre-existing psychiatric symptomatology and later life acquired NPS limit historical data utility, but emerging research emphasizes the importance of addressing time frames between symptom onset and cognitive decline, and age of symptom onset.\nAffective symptoms are of prognostic utility, but interventions to prevent dementia syndromes are limited. Trials need to assess interventions targeting known dementia pathology, toward novel pathology, as well as using psychiatric medications. Research focusing explicitly on later life onset symptomatology will improve our understanding of the neurobiology of NPS and neurodegeneration, enrich the study sample, and inform observational and clinical trial design for prevention and treatment strategies."}, {"section_title": "Background", "text": "The role of emergent neuropsychiatric symptoms (NPS) as a risk factor for all-cause dementia is increasingly being recognized. Evidence links NPS in advance of dementia to a greater likelihood of cognitive impairment (Mortby et al., 2017) and cognitive decline (Geda et al., 2014) compared to those without NPS. Affective and emotional dysregulation symptoms are among the most common NPS presenting in mild cognitive impairment (MCI) (Peters et al., 2012) , and are, along with other NPS, associated with poorer outcomes overall (Cerejeira et al., 2012) and higher conversion rates from MCI to dementia (Palmer et al., 2007) .\nWhile the early presentation of NPS in the course of neurodegenerative disease has traditionally raised suspicion of behavioral variant frontotemporal dementia (bvFTD), evidence also suggests that NPS can emerge in advance of any dementia syndrome (Taragano et al., 2009) . Historically, these symptoms have been viewed through the lens of psychiatric nosology with insufficient attention given to their late life onset and consequently their frequent misclassification as idiopathic psychiatric illness (Woolley et al., 2011) , potentially exposing patients to inappropriate medications or delays in dementia diagnosis (Jalal et al., 2014) . Cognitive patterns alone may not adequately differentiate between psychiatric and neurodegenerative disease (Ting et al., 2010) .\nMild Behavioral Impairment (MBI) is characterized by later life acquired, sustained and impactful NPS of any severity that cannot be better accounted for by other formal medical and psychiatric nosology. MBI is an \"at risk\" state for incident cognitive decline and dementia, and for some, MBI is the index manifestation of neurodegeneration, observed in advance of cognitive impairment (Ismail et al., 2016) . Importantly, MBI distinguishes between chronic psychiatric symptomatology and formal psychiatric illness, versus new onset psychiatric symptoms in older adults, the latter of which are core to the MBI construct of the at-risk state. MBI has been formally described in the International Society to Advance Alzheimer's Research and Treatment -Alzheimer's Association (ISTAART-AA), MBI proposed research diagnostic criteria, which classify MBI into the domains of decreased drive/motivation, affective/emotional dysregulation, impulse dyscontrol and agitation, social inappropriateness, and delusions and hallucinations (Ismail et al., 2016) . Assessment of MBI has been operationalized with the development of the MBI checklist (MBI-C), which was tailored specifically to the MBI criteria, including explicit observations of symptoms being later life in onset, and sustained for 6 months -these requirements are not explicit in many NPS rating scales (Ismail et al., 2017a) . The affective/emotional dysregulation domain is a core feature of MBI, and includes symptoms of anxiety, depression and dysphoria, euphoria, and irritability. In this review, we will explore the epidemiology and neurobiological links between affective and emotional symptoms and incident cognitive impairment and all-cause dementia."}, {"section_title": "Depression and dysphoria", "text": "Increasing evidence in both cognitively normal (CN) older adults (without objective cognitive impairment) and in MCI suggests that emergent depression is a risk factor for dementia (Rosenberg et al., 2013) and may constitute a prodrome . This is true for both Alzheimer's disease (AD) dementia and all-cause dementia (Barnes et al., 2012; Steenland et al., 2012; Geda et al., 2014) . In a meta-analysis of 57 MCI studies, depression was found to be common, with a prevalence of 25% in community samples and 40% in clinical samples (Ismail et al., 2017b) , and associated with increased risk of progression to AD dementia Lopez-Anton et al., 2015) . Another recent study assessed the association of subsyndromal depression (SSD) with cognitive decline over four years in a sample of MCI patients from the Alzheimer's Disease Neuroimaging Initiative (ADNI). Compared with individuals without depressive symptoms, the SSD group exhibited accelerated decline on cognitive measures (Gonzales et al., 2017) . This suggests that in early stages of AD, depressive symptoms may be clinical indicators of AD pathology and/or impact AD pathogenesis Donovan et al., 2014; Geda et al., 2014; Gonzales et al., 2017) .\nVery recent research has moved the field rapidly forward, and underscored the importance of incipient depressive symptoms in emergence of dementia syndromes. A 28-year follow up of a 10,189 person cohort from the United Kingdom described the emergence of sustained depressive symptoms to increase the risk of incident dementia, but longstanding sustained depressive symptoms offered no increased risk (Singh-Manoux et al., 2017) . A 14-year longitudinal Australian study of 4,922 cognitively intact men demonstrated that depression is more likely to be a marker of incipient dementia than a truly modifiable risk factor due to a time-dependent link between onset of depression and incidence of dementia.\nThe association between depression and dementia was only apparent during the initial five years of follow-up, and was not observed if depression emerged more than five years before the onset of dementia (Almeida et al., 2017) . Similarly, a Finnish nationwide nested case-control study of 27,948 pairs also established the importance of the time window between psychiatric symptoms and dementia. Hospital treated behavioral and mental disorders, including depression and other mood disorders, were associated with a higher risk of AD in the five-year but not the tenyear time window (Tapiainen et al., 2017) . The authors suggested that some of these disorders may have represented misdiagnosed prodromal symptoms of AD. This highlights the importance of proper differential diagnostics among older persons and the importance of appropriate time window in psychiatric and neuroepidemiology research (Tapiainen et al., 2017) .\nDespite converging evidence for the relationship between depression and dementia, the neurobiology of depressive symptoms in preclinical dementia syndromes has not been clearly established. According to one hypothesis, which enjoys some empirical support, clinically significant symptoms of major depressive disorder and subclinical depressive symptoms, in preclinical and prodromal AD, may indicate AD pathological changes in selectively vulnerable brain regions. In CN older adults, clinically significant depressive symptoms have been associated with AD-related changes: thinning of the entorhinal cortex, hippocampal volume reduction, and decreased cerebrospinal fluid (CSF) amyloid-beta 42 (Ballmaier et al., 2008; Gerritsen et al., 2011; Pomara et al., 2012) . A cross-sectional study in late life major depression found reduced hippocampal volume in depressed versus control participants but no differences in cortical amyloid (measured in vivo by positron emission tomography (PET) imaging) (De Winter et al., 2016) . In the aforementioned ADNI sample of participants with SSD and MCI, frontal and anterior cingulate atrophy was associated with global cognitive decline. These regions were postulated to govern cognitive decline in this highly vulnerable population (Gonzales et al., 2017) .\nStudies of subclinical depressive symptoms in CN older adults and across the AD spectrum have similarly shown associations with underlying structural and functional changes and more variably, with AD proteinopathies, A-beta and tau (Donovan et al., 2015; Babulal et al., 2016; Krell-Roesch et al., 2016; McCutcheon et al., 2016; Gatchel et al., 2017) . Donovan and colleagues, in a cross-sectional study of CN older adults, found that subclinical depressive symptoms on the Geriatric depression scale (GDS) were associated with lower hippocampal volume, while GDS symptom clusters grouping with dysphoria, apathy, and anhedonia were associated with decreased hippocampal volume and reduced cerebral 18F-fluorodeoxyglucose (FDG) metabolism (for apathy-anhedonia symptoms); these associations were independent of cortical amyloid burden (Donovan et al., 2015) . Similarly, Babulal and colleagues, assessing subclinical positive and negative affective symptoms by the GDS and other measures, found a longitudinal but not cross-sectional association between GDS and CSF and amyloid (Pittsburgh Compound B (PiB)) PET AD biomarkers (Babulal et al., 2016) . In contrast, clinicopathologic studies in mixed populations of CN and AD participants (Wilson et al., 2003 (Wilson et al., , 2014 and in MCI and mild AD participants (McCutcheon et al., 2016) have not shown robust relationships between depressive symptoms and amyloid plaques or neurofibrillary tangles (Wilson et al., 2003; Wilson et al., 2014; McCutcheon et al., 2016) . Together, these findings suggest that the neurobiology of depressive symptoms may differ based on depressive symptom severity and disease stage, and may not be mediated solely by AD proteinopathies.\nIn addition to AD, converging evidence supports depression as a risk factor and/or prodrome for vascular dementia (Barnes et al., 2012; Lin et al., 2017) . Depressive symptoms may be more common in vascular dementia than in AD dementia (O'Brien, 2003) , and depression has been associated with amnestic Geda et al., 2014) as well as both amnestic and non-amnestic MCI . The robust relationship between cerebrovascular disease and depressive symptoms may underlie this association (Alexopoulos et al., 1997; Krishnan et al., 1997) . In particular, disruption of frontosubcortical circuits, whether by vascular lesions or in FTD, is one mechanism hypothesized to underlie the association between depression and vascular and FTD pre-dementia syndromes."}, {"section_title": "Anxiety", "text": "There has been a growing body of research supporting an association between anxiety and reduced cognitive function in older adults, indicating clinically elevated anxiety symptoms to be associated with poorer global cognition, episodic memory, and executive functioning (Beaudreau and O'Hara, 2008) . Anxiety symptoms are commonly associated with neurodegenerative diseases, and prevalence estimates range between 8% and 71% (Seignourel et al., 2008) . Clinically elevated anxiety has also been linked to cognitive decline in older adults (Sinoff and Werner, 2003; DeLuca et al., 2005; Gallacher et al., 2009) , leading some to conclude that anxiety symptoms may predict cognitive decline in older adults without dementia (Pietrzak et al., 2012) . Anxiety symptoms are common in MCI (Apostolova and Cummings, 2008; Spalletta et al., 2010) , and co-morbid presentation of anxiety in MCI has been shown to increase the risk of progressing to AD (Palmer et al., 2007; Palmer et al., 2010; Rabins et al., 2013; Mah et al., 2015) .\nSystematic reviews and meta-analyses are less conclusive, however, with some providing support for anxiety as a risk factor for dementia (Gulpers et al., 2016) , while others provide mixed results (Cooper et al., 2015) . For instance, Gulpers et al. (2016) conducted a systematic review and meta-analysis of 20 studies demonstrating anxiety predicts incident cognitive impairment (relative risk [RR]: 1.77, 95% CI: 1.02-2.42, z = 2.05, p = 0.040) in the community, with greater age being a driver of results, suggesting anxiety to be a prodromal symptom. However, co-morbid anxiety in subject with MCI seen in the clinical setting did not predict conversion to dementia in this study (RR: 1.21, 95% CI: 0.90-1.63, z = 1.28, p = 0.200) (Gulpers et al., 2016) . Conversely, Cooper et al. (2015) provided mixed results, identifying only one higher quality epidemiological study that showed anxiety to predict AD (Palmer et al., 2007) , while in three clinical studies (Robert et al., 2006; Rozzini et al., 2007; Devier et al., 2009 ) anxiety was found not to predict conversion (pooled odds ratio [OR] from clinical studies: −0.11, −0.34 to 0.11). Nonetheless, a recent meta-analysis by Li and Li (2017) of 11 studies showed a pooled hazard ratio of conversion to dementia for co-morbid anxiety and MCI compared to those without anxiety (hazard ratio (HR): 1.18, 95% CI: 1.07-1.31, p = 0.002). Heterogeneity was substantial in these studies, and confounding the results is the fact that rating scales used to assess anxiety did not reliably distinguish between anxiety as part of a psychiatric illness, or anxiety as a new-onset phenomenon, with little information to determine whether psychiatric symptoms were brief and episodic, or sustained symptoms representing a change from baseline state.\nWhile the manifestations of anxiety in prodromal patients are still under investigation, worried appearance, fearfulness, tension, restlessness and fidgeting are all common manifestations of anxiety in people with dementia (Ferretti et al., 2001) . What remains unclear is the degree to which anxiety symptoms reflect a psychopathological reaction to cognitive and functional decline, or whether they arise from biological changes in emotionrelevant neural circuits (Levenson et al., 2014) . Levenson et al. (2014) conclude that there is strong evidence to support the latter, based on findings of heightened intrinsic connectivity in the salience networks in AD (Balthazar et al., 2013) and hypometabolism in the medial temporal lobe, superior temporal gyrus and insula (Hashimoto et al., 2006) , both which have been linked to increases in anxiety. Further evidence comes from the National Alzheimer Coordinating Center (NACC) registry in a study of 2,416 CN participants over the age of 50 assessing NPS and conversion from a Clinical Dementia Rating Scale (CDR) of 0 to >0 (Masters et al., 2015) . The Hazard Ratio of conversion in participants with anxiety was 2.83 (CI: 1.93-3.19) compared to those without anxiety. Additionally, the authors described a three-phase progression of NPS within those with cognitive decline: first, irritability, depression, and nighttime behavior changes; next, anxiety, appetite changes, agitation, and apathy; and last, elation, motor disturbances, hallucinations, delusions, and disinhibition, suggesting anxiety to be an emerging phenomenon with progressive neurodegeneration (Masters et al., 2015) . Findings from the ADNI have further provided mechanistic evidence linking NPI-Q measured anxiety symptoms in amnestic MCI and conversion to AD (Mah et al., 2015) . Mah et al. (2015) found that anxiety, over and beyond depression or memory decline predicted a greater decline in entorhinal cortex volume. However, it was not unequivocally determined in this study whether anxiety symptoms were causative, mediating or a consequence of neurodegeneration.\nA number of potential hypotheses for a causal pathway between anxiety and cognitive impairment have been described including: (1) hypercortisolism, (2) cardiovascular disease, (3) lowgrade inflammation, (4) brain-derived neurotrophic factor suppression, and (5) depletion of cognitive reserves (as reviewed in Gulpers et al. (2016) ). According to the hypercortisolism hypothesis, anxiety is a state of heightened stress and thus higher cortisol levels. Cortisol levels are in turn related to symptom severity and poorer outcomes on neuropsychological tests (Erickson et al., 2003; Leininger and Skeel, 2012; Mantella et al. 2008; Rosnick et al., 2013) . Further, cortisol-induced overstimulation of glucocorticoid receptors in the medial temporal lobe have also been linked to hippocampal atrophy (Sapolsky, 2000; Erickson et al., 2003) , and stress has been postulated as a mechanism for hippocampal injury and volume loss (Sheline et al., 1999) . Animal studies have shown higher cortisol administration levels to increase amyloid and tau accumulation, both processes involved in AD pathology (Green et al., 2006) . Anxiety has also been linked to coronary artery disease and stroke, with anxiety implicated in the triggering of physiological reactions (e.g. increased heart rate, blood pressure, vasoconstriction, and platelet activity) that are associated with cardiovascular disease and ultimately vascular dementia (Sheps and Sheffield, 2001; Lambiase et al., 2014; Batelaan et al., 2016) . Chronic low-level inflammation is another related causal hypothesis, in which elevated cytokines such as interleukin-6 and tumor necrosis factor are observed in stress-related states such as anxiety, and in turn shown to be linked to negative effects on cognitive functioning (Furtado and Katzman (2015) ; Reichenberg et al., 2001) . Furthermore, anxiety disorders have also been linked to decreased brain derived neurotrophic factor (BDNF) levels or polymorphisms (Domingos da Silveira da Luz et al., 2013) . BDNF is needed for synaptic plasticity, learning and memory, and neuronal repair and is decreased in AD and MCI (Teixeira et al., 2010) . BDNF signaling is necessary for antidepressant response, and BDNF deletion attenuates this response (Castrén and Kojima, 2017) . The Framingham Heart Study identified higher stratified BDNF levels as a protective factor for dementia, emphasizing its importance as a marker and target (Weinstein et al., 2014) . Finally, it has been proposed that chronic and recurrent anxiety disorders throughout the life-course may lead to avoidance behaviors, which in turn may result in lowered cognitive reserve as a result of less mental and social stimulation, therefore increasing the risk of dementia (Stern, 2012) ."}, {"section_title": "Elation, euphoria, and mania", "text": "A constellation of elation, euphoria, and mania can represent a pre-dementia syndrome. \"Secondary mania,\" mania due to an etiology other than bipolar disorder, causes the majority of new onset mania in older adults (Krauthammer and Klerman, 1978; Brooks and Hoblyn, 2005) , which include neurodegenerative disorders, such as predementia syndromes and dementias (Krauthammer and Klerman, 1978; Brooks and Hoblyn, 2005) .\nEvidence from cohort studies as well as retrospective data suggests that those with late onset mania are at an increased risk for development of cognitive impairment and dementia. Patients who develop their first manic episode after age 58 have higher rates of cognitive impairment, which is variably reversible (Young and Klerman, 1992; Brooks and Hoblyn, 2005) . A large cohort study of 37,768 men aged 65-85 years with bipolar disorder had an adjusted hazard ratio of 2.3 (HR = 2.30, 95% CI 1.80-2.94) for development of dementia (Almeida et al., 2016) . Subgroups, who developed bipolar disorder over the age of 70 or within the past five years had the greatest risk for development of dementia (Almeida et al., 2016) , very similar to the evidence for depressive symptoms (Almeida et al., 2017) . A retrospective case series of patients over the age of 65 admitted for mania, found 22 of 92 (24%) had evidence of cerebral organic impairment (Stone, 1989; Almeida et al., 2016) . Another case series showed that 8 of 25 (32%) older adults with mania went on to develop cognitive impairment within 5-7 years (Dhingra and Rabins, 1991) .\nCN individuals with symptoms of elation may be at elevated risk of developing AD. A survival analysis of 11,453 CN individuals from the NACC database showed that positive ε4 carrier status and symptoms of elation, among other NPS, conferred greater risk of development of AD (Burke et al., 2016) . Another NACC database study showed those with amnestic MCI had higher rates of elation and aggression as compared to non-amnestic MCI (Apostolova et al., 2014) . However, symptoms of elation, euphoria, and mania are relatively rare in AD type dementia as compared to FTD, with an estimated prevalence of 2.2-3.5% (Burns, 1992; Lyketsos et al., 1995) .\nThe pathophysiology of late onset bipolar disorder is thought to be different from early onset bipolar disorder with the late onset group having higher rates of neurologic and vascular brain abnormalities (Young and Klerman, 1992; Tohen et al., 1994; Fujikawa et al., 1995; Sami et al., 2015) . Vascular mania has been suggested as a subtype of secondary mania, when it occurs in the presence of co-morbid cerebrovascular disease or cognitive impairment (Steffens and Krishnan, 1998; Sajatovic et al., 2015) . The association of cerebrovascular disease with late onset mania implies a possible prodrome to vascular dementia. Lesions in a number of different brain regions have been associated with the development of secondary mania, including bilateral orbitofrontal, right temporoparietal, right basal and medial temporal lobe, basal ganglia, thalamic and right frontotemporal (Bakchine et al., 1989; Danel et al., 1989; Turecki et al., 1993; Robinson, 1997; Starkstein and Robinson, 1997; Brooks and Hoblyn, 2005; Cerami et al., 2011) . A case control series by Ramirez-Bermudez et al. (2016) showed that when compared to healthy normal adults, a group with first onset mania after age 50 had higher rates of white matter hyperintensities in the right frontal and the left temporal brain regions. A number of scientists hypothesize that damage to the right orbitofrontal region is a unifying finding in the development of secondary mania (Starkstein and Robinson, 1997; Brooks and Hoblyn, 2005) .\nDisruption to orbitofrontal neurocircuitry appears common to both to secondary mania and bvFTD. More recently, two cases of sporadic FTLD with the same progranulin mutation and one case of FTLD with a C9ORF72 gene hexanucleotide expansion mutation developed symptomatology meeting criteria for a bipolar disorder diagnosis prior to clinical presentation of Frontotemporal lobar degeneration (FTLD) (Cerami et al., 2011; Floris et al., 2013) . There have also been case reports of bipolar disorder mimicking BvFTD, with failure to progress to \"probable\" BvFTD after 3-7 years of observation (Dols et al., 2016) ."}, {"section_title": "Irritability", "text": "Irritability is common among neurobehavioral symptoms in neurodegenerative disease and causes increased burden on patients, caregivers, and the community alike (Sousa et al., 2016) . Among cognitively impaired individuals without dementia in the Cache County cohort, irritability/lability was, among all NPI domains, second only to depression/dysphoria in prevalence (Peters et al., 2013) . Irritability was the third most prevalent NPS regardless of dementia in a populationbased longitudinal study of aging conducted in England and Wales, with sleep problems more prevalent in people without dementia and apathy more prevalent in people with dementia (Savva et al., 2009 ). It has now been shown that irritability is among the neurobehavioral symptoms which portends more rapid decline in several datasets including NACC (Leoutsakos et al., 2015; Forrester et al., 2016) ; the Spanish ZARADEMP cohort (Lobo et al., 2008) and the Mayo Clinic Study of aging (Geda et al., 2014) . Hence, as with other emergent behavioral symptoms, monitoring emergent irritability in the clinic would seem of the utmost importance.\nWhether emergent irritability observed in the dementia prodrome should be regarded as a manifestation of a mood disturbance or one of behavioral dysregulation/disinhibition is unclear phenomenologically as there is support for both possibilities from cluster analyses (Leoutsakos et al., 2015) . It might be hoped that studies of the neurobiology of irritability would ultimately serve to clarify this question thereby offering improved treatment strategies. However, such studies have suffered from this ambiguous phenomenology as well. Disinhibition together with emotional lability in dementia has been associated with orbitofrontalsubcortical circuit dysfunction (Tascone and Bottino, 2013) . The same can be said when irritability falls within agitation in AD. i.e. even with AD, associations have been made with deficits in frontal, anterior cingulate, and posterior cingulate cortices as well as the amygdala and hippocampus (Rosenberg et al., 2015) . A specific association between irritability on the NPI scale has been made with lower fractional anisotropy of the anterior cingulate in a sample of MCI and AD patients (Tighe et al., 2012) . On the other hand, when irritability is grouped with affective symptoms (depression) or psychosis, no clear evidence for specific neurobiological substrates emerges (Tascone and Bottino, 2013) . Recently, however, an FDG-PET study in AD demonstrated that irritability had common metabolic changes to agitation (right temporal, right frontal, bilateral middle, and posterior cingulate gyri) but differed in specific regions (right insular, precentral, and postcentral gyri) (Weissberger et al., 2017) , reflecting neurodegeneration in regions associated with core AD pathology (Rosenberg, 2017) . It is noteworthy that to date, most of the work on the neurobiology of irritability comes from the dementia literature with little data addressing emergent irritability in the predementia stages in spite of its prevalence. That said, a very recent ADNI study of biomarker positive preclinical AD participants (amyloid and tau positive, MMSE ∼29,) assessed relationships between NPS and two-year interval change in metabolism measured by FDG-PET. Sleep behavior and irritability predicted posterior cingulate hypometabolism at two years, \"supporting the emerging conceptual framework in which NPS constitute an early clinical manifestation of AD pathophysiology\" (Ng et al., 2017) ."}, {"section_title": "Conclusions/Future directions", "text": "Symptoms of affective and emotional dysregulation, ranging from depression and dysphoria, anxiety and worry, to elation, euphoria and irritability, are common in preclinical and prodromal dementia syndromes, and are often harbingers of progressive cognitive decline (Pietrzak et al., 2012; Donovan et al., 2014; Geda et al., 2014; Ismail et al., 2016; Almeida et al., 2017; Gonzales et al., 2017; Singh-Manoux et al., 2017; Tapiainen et al., 2017) . This spectrum of symptoms is associated with functional impairment and decreased cognitive and psychosocial function (Karttunen et al., 2011) , and has prognostic utility in CN older adults and in MCI for several dementia sub-types (Barnes et al., 2012; Steenland et al., 2012; Geda et al., 2014) . It remains important to clarify, however, whether the affective and emotional dysregulation symptoms . https://doi.org/10.1017/S1041610217001880 Downloaded from https://www.cambridge.org/core. IP address: 54.70.40.11, on 06 Dec 2019 at 22:24:46, subject to the Cambridge Core terms of use, available at https://www.cambridge.org/core/terms have quantitative (i.e. severity of symptoms) versus qualitative (i.e. a particular pattern of symptoms) relationships to dementia risk and progression. In an ADNI study of SSD, the chronic SSD group exhibited accelerated decline on measures of global cognition, memory, processing speed, and semantic fluency, as well as accelerated frontal lobe and anterior cingulate atrophy, compared to the nondepressed group (Gonzales et al., 2017) . Thus, in this sample chronicity of low-grade symptoms, as opposed to severity, was associated with cognitive decline.\nHowever, DSM (and the aforementioned ADNI Gonzales et al. study) are silent on natural history of symptoms (i.e. chronic vs. new-onset), and the signal may thus be muddied by a heterogeneous population with varied symptom natural history. The MBI construct is predicated on the emergence of symptoms in later life as distinct and discrete from chronic and recurrent psychiatric illness with recurrent late life episodes. Overall, we believe that context is required to determine if symptom pattern or symptom severity (or both) reflect underlying neurobiology. For example, the recent paper by Almeida et al. (2017) described a graded association between severity of depressive symptoms and the risk of dementia, but that depressive symptoms were often a prodromal manifestation of dementia, as opposed to a chronic, recurrent depressive syndrome. In contrast, Rosenberg et al. (2013) determined that severity was not a predictor of cognitive decline in the NACC cohort. Further studies in this area are required that emphasize the age of onset, severity, and qualitative pattern of symptoms.\nThe neurobiology of affective symptoms in pre-dementia syndromes is varied and poorly understood. Converging data point toward underlying changes in brain structure and function in selectively vulnerable regions, and accumulation of disease specific pathology (i.e. proteinopathies and/or cerebrovascular lesions) (Ballmaier et al., 2008; Gerritsen et al., 2011; Pomara et al., 2012; Donovan et al., 2015; Babulal et al., 2016; Krell-Roesch et al., 2016) . Previous work has largely involved investigating the neurobiology and prognostic utility of affective symptoms in the context of standard psychiatric diagnostic criteria, rather than study of endophenotypes and clusters of symptoms. This is in part due to the lack, until recently, of rating scales to capture early mild behavioral disturbances. As demonstrated in this review, the lack of adequate measures to assess symptoms of anxiety, depression and dysphoria, euphoria, and irritability in preclinical disease states and that specify late life onset and persistence has impeded conclusive evidence with regards to the role of these NPS as a risk factor for cognitive impairment and dementia. Certainly, robust evidence from several large longitudinal and case-control epidemiological studies has highlighted the need for a determination of the age of onset of symptoms and of the timewindow between onset of symptoms and decline in cognition to properly ascertain risk (Almeida et al., 2017; Singh-Manoux et al., 2017; Tapiainen et al., 2017) . The Mild Behavioral Impairment Checklist (MBI-C) (Ismail et al., 2017a ) (available at www.MBItest.org) has specifically been developed to address this need, in order to systematically study NPS in pre-clinical states to determine their prognostic utility for cognitive decline and dementia.\nDiverse symptoms of affect and emotional dysregulation commonly co-occur in older adults and can be challenging to systematically describe outside of the context of classic psychiatric diagnostic framework and phenomenology. Both the emotional dysregulation domain and the MBI-C as a whole comprehensively capture this spectrum of symptoms and thus provide an operationalized way to assess and track them (Ismail et al., 2017a) . Further, the structure of the checklist provides the opportunity to differentiate the prognostic utility of this domain as whole as well specific symptoms within it such as anhedonia, dysphoria, sadness, and anxiety (Ismail et al., 2017a) .\nAdding to this complexity, the neurobiology of symptoms of affective and emotional dysregulation may differ in CN older adults compared to MCI, based on severity of the affective symptoms and the specific pre-dementia syndrome, and also in cases where symptoms are superimposed on a life-long recurrent affective or anxiety disorder. Future prospective studies of emotional dysregulation symptoms using the MBI framework in the clinical scenarios above are needed to further disentangle their prognostic utility and neurobiology. Studies will need to distinguish NPS reflecting core \"typical\" mechanisms of neurodegeneration versus those reflecting novel pathways, as such distinction carries implications for treatment. If NPS are a manifestation of typical neurodegenerative pathology, then treatment would involve agents that modify that same pathology. However, if NPS are manifestations of alternative pathology, interventions will be required for those alternative pathologies to modify outcome and course. The inconsistencies in the evidence stem, in part, from the inconsistencies in assessing natural history of symptoms i.e. chronic and recurring NPS versus new onset or emerging NPS. As the evidence base grows, the field will be able to better determine mechanisms, and distinguish between these two groups and their prognostic differences (if any). In addition to mechanistic studies, we suspect that intervention studies will concurrently illuminate this area, and provide further evidence on the mechanisms above.\nOverall, while study and understanding of affective symptoms in MBI remains in early stages (say, compared to the understanding of MCI); new evidence is constantly emerging and informing the field that has importance implications for prevention and treatment. For example, the aforementioned paper by Almeida et al. (2017) describes a lack of antidepressant effect to decrease dementia incidence. In contrast, the paper in Neurology by Lu et al. (2009) describes donepezil delaying progression from MCI to dementia in MCI participants with depressive symptoms. However, if treating NPS is the same as treating AD, then why are participants with significant NPS excluded from dementia clinical trials? In fact, should older adults with NPS be preferentially screened for dementia, and included in disease modifying trials? More studies are required to answer these questions, and the binary division into NPS versus dementia is likely inadequate, requiring additional variables to ascertain risk and suitability for trial enrolment, including the natural history and age of onset of NPS, as well as genetic risk.\nIn summary, symptoms of affective and emotional dysregulation are common harbingers of neurodegenerative change and progressive decline in several pre-dementia syndromes. Despite this, there are limited interventions to prevent and treat these symptoms and the ensuing dementia syndromes. Further, detailed study of emotional dysregulation symptom domains with the MBI-C framework is critical for not only increased understanding of neurobiology, but also toward the development of prevention and treatment strategies for at-risk individuals."}, {"section_title": "Conflict of interest declaration", "text": "Z. Ismail has received consultation/advisory board funding from Eli Lilly and Merck. M. Cantillon has had research support from Pfizer, Lilly, Lundbeck, Takeda, Novartis, Impax, Prevacus, CogRx, and the Critical Path Institute that includes FDA funding."}, {"section_title": "Description of authors' roles", "text": "All authors contributed to manuscript preparation and revisions."}]