[{"section_title": "DCPS Plan for Federal Stimulus Funds in 2010", "text": "\nStudents are also showing tremendous progress compared to other urban districts (NAEP/TUDA), where DCPS students ranked number one in growth for the first time and increasing math scores at a higher rate than any other tested urban district in the country. Both low-income and Hispanic fourth grade students led the nation in gains as well, and black fourth graders achieved the second highest gains within tested TUDA districts. Eighth graders were close behind, coming in second only to San Diego in growth. DCPS has never grown at this rate in both fourth and eighth grade.\nTitle I Funds to Support Innovation and Yield Academic Growth, $16.95M Innovation in Out-of-School Time ($4.55M) Recently increased attention, research and innovation in the subfield of out-of-school time shows the immense impact that this time has on student achievement in school. In fact, research suggests that the skill loss that occurs during this time for poor and minority students is directly related to the achievement gaps that hold them back. Secretary of Education Arne Duncan has called national attention to the discrepancy between the length of the school day in the U.S. and the length in countries whose children will compete with ours in later years. One of our most valuable but underestimated resources to reverse student performance trends of the past is time, and in alignment with Secretary Duncan's provisions for stimulus funds, DCPS will use $4.55M to provide this time through one of the most innovative out-of-school time programs in the country.\nAfterschool Coordinators Building Programs: We are now one of the only districts in the country to introduce the position of full-time afterschool coordinator in schools that needed this support. In the past, teachers were taking on this job by adding hours to full teaching schedules in order to oversee all afterschool activities in a school. Yet this is full-time work, and such a model was not supporting them to be successful. Full-time coordinators are responsible for building and managing high quality afterschool programs in their schools, and they are expanding the power of afterschool time in ways the system was not able to do before. Academic Power Hour: In the past, while some afterschool programs may have worked effectively on improving reading, writing and math skills, most did not. There was not a clear or sustained way to ensure that what happened afterschool was aligned to the academic goals of the school day. Now, through an Academic Power Hour afterschool, especially for students below grade level we are ensuring that this added academic time is valuable. The curriculum is consistent with what students are learning in school and the assessments illustrate whether or not they have learned these skills. This hour also ensures that we are not stigmatizing students who are behind. All students have the opportunity after the Power Hour to engage in extracurricular activities that, while not academic, have been showing to increase performance in school (such as arts programs).\n\n\nTitle I Required Set-Asides ($6.3M) Especially in light of the layoffs that were not able to be circumvented through stimulus funding, we hope this will clarify to the community and others some of the pre-set conditions we are adhering to in our allocation of stimulus funds. Required set-asides include everything from ensuring sound program administration of the funds to ensuring that staff become highly qualified under the guidelines of No Child Left Behind. In addition, under a separate guideline DCPS provides services to students (whose DCPS neighborhood schools are Title I) attending private schools. The important guidelines that mandate allocation of this category of stimulus funds ensure that the most basic of federal requirements are met in any state of the economy.\n\nReforming Special Education with IDEA Part B Stimulus Funds $13.1M Unfortunately the failings of DCPS to serve special education students require little provision of rationale for reform. We spend over $160M per year to pay for private education for the students failed by DCPS. We spend more on the approximately 2,800 children who are in non-public placements than we do on the almost 7,000 special education students who attend our schools. The District of Columbia also has the greatest number of due process complaints in the country and leads the nation in the overidentification of minority children diagnosed with disabilities, and almost 25 percent of our students are classified as special education. This is more than double the national norm. However, special education is seeing a radical turnaround that must and will continue despite the recession in order to fully comply with IDEA and provide an excellent education for students with special education needs. The results of the first two years are promising. For example, DCPS has made terrific progress meeting the provisions of the Blackman Jones consent decree. The results of reforms are beginning to show in academic achievement as well. The special education subgroup has made 11 percent gains in elementary reading over the past two years, and 14 percent in elementary math. At the secondary level, students have almost tripled their rate of proficiency in both secondary reading and math, in the past two years going from six to 17 percent proficient in reading, and five to 14 percent in math. These numbers show significant growth, but they also show how much work remains, and DCPS will apply $13.1M of stimulus funds toward this effort. Preserving Student Access to Special Education Providers ($7.5M) Investing in related service contracts with special education providers will allow us to better serve students in their least restrictive environment by lowering the student-to-service-provider ratio. Contracted psychologists, social workers, speech-language pathologists, orientation and mobility specialists, physical and occupational therapists, assistive technology coordinators, audiologists, and adapted physical education teachers serve many of our children who have special needs. They are essential to the implementation of the Individualized Education Plan (IEP), and stimulus funds are allowing us to preserve these services. Whenever possible, service providers work with students in their general education classroom to ensure they meet the goals set by the IEP team. The services these providers deliver allow students to access the curriculum and learn with their peers during their school day. In addition to providing IEP services, providers determine students' eligibility for services and add expertise to the school's multidisciplinary team regarding appropriate curriculum modifications to accommodate all students.\nIncreasing Equity and Preserving Resources: $39.3M In 2007 in DCPS, students in some schools had access to high quality art and music programs and all of the staff they needed, while students in other schools─often in the high poverty wards─did not have art teachers, music teachers, librarians or nurses. One group of elementary students wrote to the chancellor asking if she would be able to find them a nurse and music teacher. In addition, many students with mental health needs, or other, life-related obstacles to achievement, had no counselor to address those needs with them, and teachers often were left attempting to resolve these blocks to achievement while juggling a full classroom of students. This exacerbated the problems, created classroom management challenges that didn't need to exist, and ultimately fed into the overrepresentation of students in special education, students who needed a high quality general education but did not have disabilities or need special education services. In order to address this, we changed our school budgeting formula in order to prioritize equity and introduce a standard for core staffing so that no child would go without art, music and PE instruction, or the services that only a counselor can provide. For many years the system was using the Weighted Student Formula (WSF), in which each school received a dollar amount based on the number of students in that school, and the principal created the budget without guidance or support from the central office. As a result, some schools were increasing the funding for their main offices while eliminating important positions such as art, music and PE teachers. Other schools with low enrollment were having a hard time funding for these core positions when they could not find outside organizations willing to fund programs like art and music. Because schools in some neighborhoods could more easily attract outside experts to provide art, music and other programs, students in high poverty neighborhoods never had the chance to take an art, music or PE class. Now, more students in every ward have these services, and under the mayor and deputy mayor, students have access to wraparound services through various city agencies. For example, the Department of Health ensures that students have the nurses they need, and stimulus funds supports the social workers funded through the core staffing formula. This staffing model is critical to our reforms and laced into the very way that schools run their budgets. While we did lose some of these positions due to the economy this year, stimulus funds are helping us to preserve the model so that we do not lose the very important ground we have gained over the past two years."}, {"section_title": "Overview", "text": "What is at Stake Two years ago, the problems of the District of Columbia Public Schools were so significant that many believed the system was beyond repair. According to the 2007 National Assessment of Education Progress (NAEP), only eight percent of eighth graders were on grade level in math, and 12 percent were in reading. With achievement gaps between black and white students at 70 percent in some schools and subject areas, and over 50 percent district-wide, many believed that students in Washington, DC just were not up to the task of learning."}, {"section_title": "Signs of Progress", "text": "Nothing could be further from the truth. In the past two years students of all backgrounds and circumstances have shown us through their academic growth that with the right supports from adults, they will learn to compete with any high-achieving students in the suburbs and across the nation. On almost every measure we have, children in Washington, DC are defying stereotypes with their results and challenging all educators to raise expectations for all students."}, {"section_title": "Local Test (DC CAS)", "text": "On our local test, the DC CAS, in 2009 principals and teachers drove growth across all grade levels in both reading and math. In secondary math the achievement gap between African-American and Caucasian students has closed by 20 percentage points. Virtually every subgroup under NCLB has increased proficiency rates, including students with special education needs, English Language Learners (ELL) and economically disadvantaged students."}, {"section_title": "Results from New Principals", "text": "Innovation and school leadership are also paying off. New principals with innovative strategies are outperforming the district as a whole, even with the district moving up in each level and subject in math and reading this year."}, {"section_title": "National Tests (NAEP/NAEP TUDA)", "text": "This progress is reflected on national tests as well. The National Assessment of Educational Progress (NAEP) is a gold-standard test administered from the outside, and according to data released in 2009, students are showing phenomenal growth whether DC is compared to other states (NAEP) or to other urban districts (NAEP/TUDA, Trial Urban Districts Assessment). When compared to other states in math, last year DC led the country in growth. DCPS had the greatest gains of any state in fourth grade math, and we were one of only five states to show increases in math for both grades: District of Columbia, Nevada, New Hampshire, Rhode Island, and Vermont. Our eighth graders grew at three times the national average, and fourth graders were the only group in the country to see gains in every subgroup, including African-American students, students on free and reduced lunch, and English Language Learners (who are outperforming the district as a whole on our local test)."}, {"section_title": "Competition for Charter Schools", "text": "The NAEP/Tuda also shows that in 2009 DCPS surpassed charter school performance in math. Two years ago we were 14 scale score points behind charter schools in eighth grade math, and this year we have a higher proficiency rate than charter schools at both the fourth and eighth grade levels."}, {"section_title": "Graduation Rate", "text": "The graduation rate is increasing at a faster rate compared to previous years, and in 2009 more than half of DCPS high schools increased their graduation rates, with 10 out of 16 high schools increasing by at least three percent. We are incredibly proud of the students, teachers, principals and staff who have worked tirelessly to achieve these results. However, we still have much work to do before DCPS overall performance will be competitive with the suburbs. With the help of stimulus funds i we are moving toward this goal through an extremely difficult period for the country."}, {"section_title": "Enabling Reform in a Nationwide Recession: American Recovery and Reinvestment Act", "text": "President Obama's American Recovery and Reinvestment Act holds us to our most basic responsibility: to educate our children no matter what challenges we face as adults. Understanding that the rights of children to a quality education cannot be compromised, with stimulus support DCPS is better able to protect children from these very difficult times by protecting their education, the most powerful strategy for ensuring future prosperity. In Washington, DC, even with significant two-year gains we are still far from where we need to be. Less than half of our public school students are proficient in reading and math, so we have more to do than maintain performance through a recession. We are in the midst of a necessary and radical turnaround that has to continue in order to educate all children according to their rights and abilities. A turnaround of this magnitude requires a combination of innovation, aggressive reforms to correct the systemic dysfunctions and inequities that hold children back, and the implementation of the best practices that will continue momentum that is turning the tide in DCPS. We must also maintain the ground gained last year by preserving the Comprehensive Staffing Model, a more equitable staffing model we implemented to allow all students access to art, music, and PE instruction, along with the counseling supports that mitigate obstacles to achievement. However, understanding that stimulus funds given as Title I dollars must adhere to the same rules that govern the spending of all federal Title I funding, we understand that stimulus funds cannot be used only to preserve staffing."}, {"section_title": "DCPS Plan for Federal Stimulus Funds in", "text": "Four Primary Focus Areas For FY '10 and FY'11, we have divided the $75.65M of stimulus funds into four primary focus areas to continue this effort: Title I Funds to Support Innovation and Yield Academic Growth: $16.95M Title I Required Set-Asides: $6.3M Reforming Special Education: IDEA Stimulus Funds, $13.1M State Stabilization to Preserve Jobs: Innovative Approaches to Increased Equity and Resources $39.3M\n\nImproving Data Collection ($5.4M) Any successful reform effort must be supported by sound data. Without access to up-to-date information for students, it is extremely difficult for teachers and related service providers to make the best decisions possible for every student they serve. To this end, we plan to clean the data we currently have and build a robust system infrastructure. Efforts are currently underway to ensure that all assessment data for students is accurately entered into the Special Education Data System (SEDS). With this funding, the project team can ensure that all the components of a student's specialized needs are accurately tracked and reported. The funds will be used to refine our database and create systems to support targeted reforms. One example of this is the Non-Public Unit Student Tracker. This data system will allow data-driven monitoring of students in non-public placements, monitor their progress, and ensure that their needs are being met."}, {"section_title": "Afterschool", "text": "When Mayor Fenty was given accountability for the school system in June, 2007, many schools did not even have full afterschool offerings for students. Most high schools did not have anyone fully devoted to afterschool programming, and students who wanted to participate in basic rites of passage such as yearbook and journalism clubs did not have the option. Students who fell behind in high school-putting them at higher risk for dropping out─did not have equal access to opportunities for catching up in the afterschool hours. Even for high schools that offered programs, engaging students afterschool was not always a school-wide priority, and the relationship to achievement was not widely understood. In the schools which offered programming, well-meaning non-profit organizations (some qualified, some not) in our schools with children during these hours, were not connected centrally to a set of procedures, priorities or objectives for learning. In a few instances students were even temporarily unaccounted for when they moved from one program to another, and there was no district-wide sign-in or sign-out system that helped us to know who was responsible for students at any given time. Organizations providing afterschool services in schools were not vetted, and their rate of success was not measured. Many volunteers in these programs were not even given the basic background check to screen for adults who should not be working with children. Stimulus funds will support the reforms we began after discovering the state of afterschool learning in the district. Reforms have been swift and we have made great gains: Accountability for Organizations Working in Schools: In Chancellor Rhee's first year, DCPS initiated a vetting process through which all Community Based Organizations (CBOs) were required to apply to work in our schools. To apply, organizations were required to identify how they would measure success. They were given one year to acclimate to the higher accountability they are being held to now in the 2009 -2010 school year. Stimulus funds will help us to sustain these higher expectations, holding CBOs accountable by evaluating the results in the first year and supporting the continuation and growth of good work."}, {"section_title": "Improving Afterschool Program Data:", "text": "In 2007 the chancellor's transition team discovered that 27 separate data systems held important student information, and these systems had no semblance of alignment or ownership assigned to updating information. Now, in addition to system-wide data overhauls, afterschool attendance for all student programs is entered into one primary student information system. This allows us to track which students are attending which programs and allows us to individualize academic instruction and measure the success of each afterschool program. Having this data at our fingertips allows us to better assess the district as a whole and drive our decisions about all work that occurs afterschool. Afterschool coordinators are also increasing the data flow between schools and the central office, teachers and the afterschool coordinators, and students. They are leading afterschool programming to assess students in a systematic way that did not exist before, and to ensure that even in the afterschool hours we are meeting the needs of students as individuals and at a variety of levels. For example, Turner-at-Green Elementary School is a school in Ward 8, the highest poverty ward in the District. The afterschool coordinator there is building a structure in which both academic and extracurricular enrichment occur during these hours. She meets regularly with teachers, administrators, the Community Based Organizations (CBOs) that provide enrichment programs in order to identify the students most in need of academic support, and to align that support with the learning that occurs during the school day. It is no coincidence that under the leadership of the school's principal and with the building of a strong afterschool program, Turner at Green met AYP in both reading and math last year for the first time since 2005, with eight percent gains in math and 13 percent gains in reading."}, {"section_title": "Saturday Scholars", "text": "To support students who are not on grade level in their basic reading and math skills, in 2007 we launched Saturday Scholars, a Saturday learning program in elementary schools. It is designed specifically to target support to children who need it, using data to identify these students and differentiating instruction to meet their needs. After a successful year in elementary schools we began expanding to secondary schools. This is critical added time students need in order to catch up, and principals have been creative with aligning academic plans with students' academic needs while making the Saturday experience different for children than the regular week. Using creative ways to attract students with festive environments for learning, at 33 sites principals drew about 1,600 children to their schools on Saturdays last year. Every year in which students fall behind increases their likelihood to give up on school and themselves in future years. Understanding that we must use every minute we have in order to give students the skills they will need to succeed, we look forward to continuing the work in out-of-school time that stimulus funds will allow."}, {"section_title": "Whole School Transformation: Catalyst Schools Project ($3.4M)", "text": "With about 50 percent of DCPS children attending schools outside their neighborhood boundaries, we have a robust system of public school choice. However, in every neighborhood, every parent deserves a high quality neighborhood school within the family's boundary. In 2009 the chancellor introduced the DC Catalyst Project as one of the initiatives to move us toward this goal. After a rigorous application process, 13 schools throughout the city were asked to participate in a transformation, through which each of the schools would adopt a school-wide theme program. The schools were asked to choose from among three themes: Science Technology, Engineering, and Math (STEM); Arts Integration; and World Cultures. The Catalyst Project was designed on three core beliefs. First, we must engage and develop educators in a meaningful way. Giving schools a themebased identity centers staff on a mission and allows the central office to effectively develop human capital in that school. Second, students crave relevance in their educational settings, and each of the themes we have chosen aims to connect students with the world around them. Third, schools need to be rooted in and connected to the communities around them. The Catalyst Project facilitates relationships with non-profits, businesses, and community organizations that align with the schools' themes. Leveraging private and federal dollars with stimulus funds, we intend to fund staff to support the development and implementation of this work at DC Catalyst schools for one planning year and two operational years, after which we will ask schools to incorporate sustainability plans into their broader DCPS Plan for Federal Stimulus Funds in 2010 school budgets. We anticipate that schools will both realize savings through reallocating budget dollars, and increase site budgets through increased enrollment. Advancing Teaching and Learning: The Teaching and Learning Framework and Professional Development ($5.2M) Research indicates that the most important factor influencing student achievement in school is the quality of the teacher in the classroom. Students' and teachers' experiences in our schools back this research. In one high school last year, a teacher was surprised to find students in her class who were not on her roster. When she asked them why they were there, they simply said they were learning from her, and they wanted to attend her class whether they received credit for it or not. Educators must be supported and developed as the knowledgeable, skilled, compassionate experts in teaching that we need them to be in DCPS. Yet in 2007 teachers reported that professional development was severely lacking in DCPS. For many years, teachers have been left to fend for themselves, and countless but disparate professional development workshop messages landed in their classrooms along with the ceiling tiles that needed repair. New teachers struggled to \"reinvent the wheel\" of classroom management and planning without significant or sustained support from DCPS, while veteran teachers have been thrown a variety of disconnected initiatives and professional development workshops that change with the tides of new administrations. But just as teachers are asked to meet every child's academic needs, our professional development strategy and implementation must support teachers' professional needs on all ends of the spectrum of performance. Stimulus funds will support professional development on a new Teaching and Learning Framework that will create this dynamic for the first time in DCPS history. Paired with stronger and more focused professional development than the district has ever seen before, the Framework gives teachers clear guidelines for what is expected of them in classrooms, and supports them to meet those expectations with students."}, {"section_title": "The Teaching and Learning Framework", "text": "In order to ensure continuous academic growth and high levels of student achievement, all teachers must engage their students in rigorous and relevant instruction that improves their academic and socialemotional skills and abilities. Guided by the district's core beliefs, the Teaching and Learning Framework will: Provide Clear Expectations for teachers The Framework defines the actions that effective teachers use to deliver high-quality instruction within a safe, engaging and productive classroom."}, {"section_title": "Align Professional Development and Support", "text": "The Framework aligns all professional development opportunities, providing teacher the support, resources and assistance they need to deliver on the expectations."}, {"section_title": "Support a Fair and Transparent Evaluation System", "text": "IMPACT, the new DCPS effectiveness assessment system for school-based personnel, is aligned to the expectations outlined in the Framework."}, {"section_title": "Professional Development", "text": "In alignment with larger systemic reforms prioritizing professional development for staff, and in combination of federal and other supports to build teacher capacity, stimulus funds support the core position of professional development specialist to build and retain a highly qualified staff. This is allowing us to provide job embedded professional development, which represents a departure from the previous model in which teachers received \"one stop shop\" development through workshops from people they did not know, and who did not know their teaching. Increasing professional development support by 400 percent in the DCPS budget is arguably one of the most significant reforms and radical breaks from the past that this district has seen in years. It is also tied to other targeted innovative reforms aimed to support and empower all teachers toward excellence to impact every child they teach."}, {"section_title": "Secondary Reading Interventions ($1.2M)", "text": "One of the most significant challenges urban districts face is the dropout rate that occurs in large part due to frustration that middle school students begin to feel when they are falling behind. If core literacy is not present, all other subject areas suffer, contributing to a devastating school experience in which one failure compounds upon another until students give up. In 2009 -2010 in a continuation of Read 180, we are targeting students who need secondary reading intervention in select middle and high schools, and in 2010 -2011 we would like to expand this into all high schools. The secondary reading intervention that both federal payment and stimulus funds support occurs in addition to students' regularly scheduled English classes, and takes an approach to reading that individualizes instruction in a developmentally appropriate way. Students in one classroom may be working on two to five separate activities depending on their reading levels, with some students reading together, other students on the computer, and others working independently with a teacher's assistance. Early Childhood Reforms ($2.6 million) Research consistently demonstrates how difficult it is to recover lost skills after the third grade year, and high quality early childhood education is one of the most important investments we can make in our children to prevent this challenge. Recent studies show that approximately 2,000 children in the District lack access to pre-school education programs and that the quality of pre-kindergarten services throughout the District is uneven. This contributes to deficits in children's language and early literacy development as well as later reading proficiency, particularly for children in low-income families. • DCPS is committed to expanding access to high quality early childhood education for all children in our school district. In the past two years alone, we have increased pre-kindergarten education seats by 700. We will use the stimulus funding to build upon this progress, creating 25 more preschool and pre-kindergarten classrooms which will serve an additional 425 students. • Stimulus dollars will also allow us to increase the quality of pre-school and pre-kindergarten classrooms. DCPS will invest in materials and instructional equipment to create exciting early DCPS Plan for Federal Stimulus Funds in childhood classrooms, including furniture, artistic materials, manipulatives, and technology to support teachers in conducting child assessments. • Local guidelines under the Pre-K Enhancement and Expansion Amendment Act of 2008 (Pre-K Act) require schools to seek early childhood school accreditation, and stimulus dollars will allow us to begin this important effort. Finally, many families are not used to having students attend schools as three and four year-olds, and others are not aware of these opportunities. DCPS will use stimulus funds to increase awareness about the benefits of early childhood education, particularly to families in the highest need wards. In this way we can increase the number of parents who are taking advantage of early childhood education services."}, {"section_title": "School Improvement and Restructuring ($2.3M)", "text": "No Child Left Behind holds us to our federal and moral obligation to turn around schools that have not instilled grade level proficiency for consecutive years and have entered Needs Improvement status, and to radically turn around schools that enter Restructuring status by failing to meet benchmarks for five years in a row. Some of the school improvement options include Pre-K to 8 reforms, a new Quality School Review (QSR) Process, the Full Service School (FSS) Model, and options to challenge students who are ahead and catch up those who are behind. When a school enters restructuring status, the school district has five options for turning around the school. These options include bringing in a partner with a proven track record for turning around failing schools, turning over staff, and adding a host of other improvement options under a plan for restructuring approved by the Office of the State Superintendent for Education (OSSE)."}, {"section_title": "Pre-K to 8 Reforms", "text": "2008 school consolidations, in addition to allowing us to allocate resources more wisely by consolidating under-enrolled schools, also allowed the district to move more schools to a Pre-K to 8 model. Multiple studies suggest that the Pre-K to 8 educational philosophy and configuration can foster higher achievement levels than the 6-8 configuration, especially in urban environments. The pre-K to 8 model has been shown to reduce discipline problems and increase stability and continuity within one school environment over the years, when it is implemented with the correct supports. Routines, teachers, principals, and other important influences on achievement remain consistent for students during the transitional years of pre-adolescence and adolescence. Students in seventh grade are in the same building with the familiar and stable environment of their earlier grades, and in an urban school system this stability and continuity are critical. The new grade configuration, however, is not enough to see all of the needed positive effects. Stimulus funds are allowing us to continue the support that this model needs. This support includes professional development on middle grades instruction, adolescent development, leadership development for principals, and the implementation of the advisory period that provides one-to-one guidance to each student from an adult in the building."}, {"section_title": "Quality School Reviews", "text": "In early reforms we implemented the Quality School Review (QSRs) to obtain a detailed picture of what was and was not working at struggling schools. When a school is reviewed through this process, a team spends time at the school to assess teaching and learning through an objective and thorough process. This critical review is the first step in identifying what the school needs in order to improve, and it must go far beyond a superficial check-off list of educational catch-phrases. Observations follow a detailed rubric that identifies not just whether DC's standards of learning are posted and addressed, but how the curriculum is being taught. When children are met in the classroom as individual learners, and when instruction not only follows curriculum and standards but is tailored to where children are─academically, socially and developmentally─and when students are engaged to meet high expectations, it is absolutely clear to a professional observer following the QSR process. For each school, teams meet with the principal and staff, conduct focus groups of parents, staff, and students, observe teaching and learning and follow up with interviews of teachers and students."}, {"section_title": "Full Service Schools", "text": "Full Service Schools (FSS) receive extra staff, such as a family care coordinator and a mental health counselor in order to improve the academic and socio-emotional outcomes of all students. The model works in conjunction with our new mayoral governance structure in that it allows us to leverage services from multiple city agencies to provide needed wraparound services. In 2007 there were no students benefitting from such a targeted and streamlined effort, and now more than 300 high risk students are receiving intensive services to help address their needs and help them overcome stubborn obstacles to their achievement, while also preventing the use of more restrictive levels of care. By integrating services, Full Service Schools strengthen students' social, emotional, and behavioral wellbeing; identify and address students' academic needs; improve school climate; and foster partnerships between families and schools. One teacher said, \"This is how I knew that FSS was working. When I received support from the maintenance workers to the school officer. In addition, there was a team of people: School Counselor, School Psychologist, etc. who came together. Attending FSS meetings opened my eyes to the expertise of the mental health team. I didn't recognize how important the social emotional side is to student achievement.\" There are 11 Full Service middle schools, including all middle schools in restructuring status under No Child Left Behind (NCLB). DCPS Full Service Schools are: Eliot-Hine, Hart, Jefferson, Johnson, Kramer, MacFarland, Ron Brown, Shaw, Sousa, Kelly Miller, and Stuart-Hobson. Since FSS implementation, attendance and intervention systems have been improved to track and meet individual student needs. In addition, the schools with the highest level of FSS implementation met their AYP targets in both reading and math for the overall school population and for special education students. We are pleased that stimulus funds will allow us to continue this important work."}, {"section_title": "Meeting the Needs of Students on Both Ends of the Spectrum: Advanced Placement and Credit Recovery", "text": ""}, {"section_title": "Increasing Access to Advanced Placement Courses", "text": "Even our most advanced students are not progressing at the rates they need to be in order to be competitive for college. Currently only nine percent of DCPS high school freshmen graduate from college within five years, and returning college students report that they are unprepared for the academic demands of college. In 2008, according to The College Board only 21.5 percent of DC students who took AP exams \"passed\" with a score of three or above out of five, on the tests they took for Advanced Placement (AP) classes, compared to the national pass rate of 56 percent. It is clear that access to, and quality of AP courses is critical in ensuring that our students become prepared for college. The more AP courses a student takes, the higher that student's odds are of attending a four-year college. ii With federal funding we will increase our AP course offerings across the District, and provide the school support to ensure that students are enrolling in these courses and taking the cumulative tests."}, {"section_title": "Credit Recovery", "text": "Two years ago in the District of Columbia Public Schools, almost half of our students were offtrack from graduating, putting each of these students at risk for dropping out. While early childhood and other system-wide reforms can prevent younger children from becoming a part of these statistics, the situation is dire for our oldest students who have fallen off-track. Eighty percent of the fastest growing 21 st century jobs will require post-secondary education iii , and they have little time to prepare them for college. Credit recovery gives students the chance to catch up, and when we increased the opportunities to participate, students took advantage of this chance. At the end of SY 07 -08, 155 students were enrolled, and by the end of SY 08 -09 that number had increased to 1,345. As of February, 2010 we have 1,721 enrolled. In a difficult economic time stimulus dollars are helping us to continue to offer this important chance for so many of our high school students who want to get back on track. Over the years, thousands of students have fallen behind in a system that has not set them up for success. As they look to lean on needed skills for survival and professional achievement, we are committed to ensuring that they have the high school diplomas they need to do so."}, {"section_title": "Grants Management and Accountability ($1.2M)", "text": "The District of Columbia Public Schools is the only school district in the country in high risk status with the Department of Education for the management of federal funds. To support ongoing correction and create more effective practices moving forward, stimulus funds will support the development of a grants accountability system to include a data management platform, a sound holding place for important grants-related archives, and staff who are dedicated to ensuring that the reporting and compliance requirements are met. This infusion of funds will increase accountability in grants management, DCPS Plan for Federal Stimulus Funds in providing staff capacity as well as evaluation systems to manage all grants, including stimulus dollars, non-stimulus entitlement grants, and other sources of federal funds should DCPS receive them. Parental Involvement ($.2M) The Office of Family and Public Engagement serves as a critical partner to ensure that parents and families have access to information and resources to support students' academic achievement. As a result, Title I schools will have an opportunity to develop an initiative that will support and facilitate its Parental Involvement Policy. Schools will be encouraged to create initiatives that are innovative and will influence student achievement. Each applying school will be invited to submit a proposal that focuses on innovation as well as parental influence on student achievement, and that outlines goals, activities, community partnerships, and measurement. Teacher Quality ($1.2M) Under No Child Left Behind (NCLB), teachers are required to meet a highly qualified certification for the subject area in which they teach. Title I dollars allow the District to manage this process for about 4,000 teachers. Stimulus funds are providing DCPS with the additional resources to support the recruitment and retention of highly qualified teachers in accordance with the law, teachers who can provide content area expertise and knowledge of best instructional practices. Homeless Program, and Support for Neglected and Delinquent Students and Other Title I ($1.4M) Students who are economically disadvantaged, homeless, or neglected overcome enormous obstacles on their way to achievement. With stimulus dollars DCPS can provide meaningful support to re-engage this population in their achievement, including increased capacity for case management, help with residency and enrollment, and a number of real-time needs that students encounter. This funding also covers services provided in consultation with private schools for students they serve who live in DCPS Title I attendance zones."}, {"section_title": "Data Reforms to Support Early Intervention for Three to Five Year-Olds ($.2M)", "text": "A portion of stimulus IDEA funds (Part B 619 IDEA funds) must be used to serve three to five year-olds. These dollars will help us to improve the data systems for Early Stages, a new state of the art early childhood center to identify children early and provide services immediately upon determination that a child needs intervention. As part of the Office of Special Education and opened this school year, Early Stages provides children aged three to five with free developmental screenings and evaluations to ensure young children with disabilities receive the services they need for a strong start to school and their future educational success. This is helping DCPS to address the overrepresentation of students in special education, and allowing students to develop and transition from special education long before they enter middle or high school. Accurate and complete data systems will be critical for the success of Early Stages. The database will track children and parents as they are initially interviewed, evaluated, and provided the services to meet their specific needs. This information will be used so we can better follow the identification and proper treatment of children with developmental delays and other specific learning disabilities, starting at a younger age. We look forward to applying stimulus funds to build data systems that support learning, identify learning issues early and reduce the over-identification of students for special education, and increase student access to critical support staff."}, {"section_title": "Preserving Core Positions", "text": "By shifting to a new school funding formula to the Comprehensive Staffing Model (CSM), we established a core list of positions (art, music and PE teachers, counselor or social worker, and professional developer for teachers) that no school should be without, allowing us to fund these positions centrally and work with principals to meet the individual needs of their communities. This was a significant change from previous practice, especially for students in low-income families. Stimulus funds meant to preserve jobs are being prioritized to fit this category so we may preserve the resources that children need."}]