[{"section_title": "Abstract", "text": "Abstract Normal aging and Alzheimer's disease (AD) cause profound changes in the brain's structure and function. AD in particular is accompanied by widespread cortical neuronal loss, and loss of connections between brain systems. This degeneration of neural pathways disrupts the functional coherence of brain activation. Recent innovations in brain imaging have detected characteristic disruptions in functional networks. Here we review studies examining changes in functional connectivity, measured through fMRI (functional magnetic resonance imaging), starting with healthy aging and then Alzheimer's disease. We cover studies that employ the three primary methods to analyze functional connectivityseed-based, ICA (independent components analysis), and graph theory. At the end we include a brief discussion of other methodologies, such as EEG (electroencephalography), MEG (magnetoencephalography), and PET (positron emission tomography). We also describe multi-modal studies that combine rsfMRI (resting state fMRI) with PET imaging, as well as studies examining the effects of medications. Overall, connectivity and network integrity appear to decrease in healthy aging, but this decrease is accelerated in AD, with specific systems hit hardest, such as the default mode network (DMN).\nFunctional connectivity is a relatively new topic of research, but it holds great promise in revealing how brain network dynamics change across the lifespan and in disease."}, {"section_title": "Introduction", "text": "As in the early years of life, the brain undergoes remarkable changes in the later stages of life, as brain structure and function tend to decline. This decline in brain structure and function is associated with a decline in cognitive abilities. Nearly 14 % of individuals over age 71 suffer from some form of dementia, and Alzheimer's disease is the most common (Plassman et al. 2007 ). Many factors influence the rate of brain aging, and the age of onset of Alzheimer's disease, including lifestyle factors such as diet and exercise (Scarmeas et al. 2009 ) and genetic factors such as APOE genotype (Corder et al. 1993) . Some studies have linked the rate of brain aging to dietary factors such as folate, homocysteine, and iron intake (Rajagopalan et al. 2011 (Rajagopalan et al. , 2012 Jahanshad et al. 2013; Madsen et al. 2013 ), levels of stressrelated hormones such as cortisol, and measures of cardiovascular health and obesity such as leptin, adiponectin, and body mass index (Ho et al. 2010; Rajagopalan et al. 2013 ). Brain decline and neuronal degeneration are inevitable with age, but determining how the trajectory of decline differs in people with dementia, and pinpointing when trajectories begin to diverge from those of healthy elderly individuals, is a critical step in developing interventions to slow or prevent this decline.\nFunctional connectivity assesses the integration of brain activity across distant brain regions, regardless of their structural connectivity. This method is also called \"resting state\" connectivity, although it can be assessed during a task as well. Articles on the topic may refer to it by the acronyms rs-fMRI or fc-fMRI. Various methods may be used to measure this type of functional synchonization or coherence, and different kinds of information can be collected, depending on whether subjects are performing a specific task, or no task in particular. Functional MRI methods can assess connectivity by measuring correlations in the BOLD (blood oxygenation level dependent) time-series of activations in different brain regions; other types of analysis focus on the mutual information between two different profiles of activation. Due to space constraints, we will focus on papers that assess connectivity through correlations in BOLD time series, although there are several other imaging approaches that can assess functional connectivity. Synchronized low-frequency fluctuations (~0.01-0.1 Hz) in the BOLD signal across distant brain regions were first discovered by Biswal et al. (1995) . This sparked the discovery of a number of temporally coherent networks that are remarkably consistent across individuals (Damoiseaux et al. 2006; Fox et al. 2005; Beckmann et al. 2005) . There are three main methods to assess functional connectivity (using the BOLD signal) that we will consider here: seed-based, ICA (independent components analysis), and graph theory.\nIn a seed-based approach, the researcher selects a \"seed\" of interest-such as a brain region or a specific 3D location in the brain-and extracts the time course of activation at that seed, or reference region. This time course is then tested for correlation with the time courses of the rest of the voxels of the brain, to search for matches (Fox and Raichle 2007) . Those regions that show a high degree of positive correlation with the seed are said to be functionally coupled. Brain regions that are negatively correlated with each other are thought to belong to opposing networks, whose functions switch.\nBy contrast, ICA (or independent components analysis) is model-free. This means that the researcher does not need to select a seed or reference region in advance. Instead, the entire four-dimensional fMRI data can be decomposed into time courses and associated spatial maps, describing the temporal and spatial characteristics of the components making up the data (Beckmann et al. 2005) . ICA seeks underlying components of activation-also called latent factors or sources-that are statistically independent of each other. Both seed-based and ICA approaches tend to reveal the same networks. Each method has advantages and disadvantages. Seed-based analyses are sometimes preferred because it can make group comparisons easier. There can be more variation in the components recovered by ICA, which can sometimes make group comparisons difficult. When you use the same seed (e.g. precuneus) for each subject, and you extract the same basic network (default mode network-explained below) this simplifies some statistical issues. Some networks that seedbased methods pull out as one coherent network get fractured into two or more networks by ICA. ICA is sometimes preferred however, because it is more data-driven-there is no model imposed on the data by the researcher, other than the networks being statistically independent. With ICA as well, there is also the issue of determining how many components to decompose the data into, and how to identify ICNs versus noise.\nGraph theory is a method of assessing relationships in data that is widely applicable. With brain imaging data it is frequently used to measure both structural and functional connectivity. When graph theory is applied to functional connectivity analyses using fMRI time series, the fMRI data is spatially parcellated according to a structural map of the brain, and correlations are computed between the activations in all pairs of regions. If the regions involved show correlations, they are considered to be linked, as if by a connection in a network. The set of regions and their connections may be considered as a network, or a graph of nodes and the links between them. The relationships between activation timeseries in these different brain regions may also be stored in a N×N matrix, for each person scanned, with each row or column corresponding to one of the brain regions in the parcellation. The relationship (or coherence) between activation signals in different brain regions can be described by computing the correlation of fMRI time series, or their mutual information-or any mathematical measure of the statistical relationship between the signals in the two regions. Once the matrix is constructed, a number of measures, such as path length, modularity, efficiency, and others, may be calculated to describe global and nodal network topology (Rubinov and Sporns 2010) . While graph theory can be used to probe the hubs of the same intrinsic connectivity networks (ICNs) that are detected by seed-based and ICA approaches, it is more often used to assess global and local connectivity.\nA number of ICNs can be reliably detected across individuals (Damoiseaux et al. 2006) . Many possible roles have been attributed to these ICNs: memory functions, organization and coordination of neuronal activity, and priming the brain for coordinated activity (Fox and Raichle 2007; Seeley et al. 2007 ). The cognitive correlates of the networks are not fully known, but we do know that these networks are present in the descent to sleep (Larson-Prior et al. 2009 ) and they are even detectable in developing fetuses (Thomason et al. 2013) . ICN connectivity is disrupted in a wide range of psychiatric and developmental disorders (Greicius 2008) , motivating the quest to understand how they contribute to cognitive function, and how they decline as we age.\nThe ICN that has received the most attention is the default mode network (DMN): this is a collection of brain regions whose activity increases in the absence of a task. As such, the DMN is also called the 'task negative' network, anti-correlated to the 'task positive' network (Fox et al. 2005 ). The DMN is generally thought to include the posterior cingulate cortex/precuneus, medial prefrontal cortex, inferior parietal lobules, lateral temporal cortices, and hippocampus (Buckner et al. 2008; Raichle et al. 2001) . There has been a great deal of interest in the DMN: many theorize that the activity of this network during rest is necessary for memory consolidation (Fox and Raichle 2007) . Numerous studies report overlap between DMN hubs and anatomical patterns of amyloid deposits in AD. This makes the DMN an area of great interest in Alzheimer's disease research Mormino et al. 2011 ).\nThere are a few analytical choices that have been debated in the field that can influence results. Global signal regression is an issue for seed-based approaches, and involves including the average whole brain signal as a regressor in the analysis. Including a global signal regressor is meant to account for a number of sources of physiological noise, but some are concerned that it introduces spurious negative correlations to the data (Murphy et al. 2009; Fox et al. 2009 ). For ICA, an issue that arises is how many components to output. The researcher can select a uniform number of components to output across subjects, but this may detract somewhat from the \"model-free\" nature of ICA. Alternatively, they may let the analysis program determine the optimal number of components, which may differ by subject, and some components may be fractured. Lastly, recent work has revealed that subject motion can produce artifactual temporal correlations in the observed functional signals, even after the traditional motion correction steps (Power et al. 2012; Van Dijk et al. 2012) . Power et al. (2012) proposed an additional step, \"scrubbing\"-regressing out high motion frames. Satterthwaite et al. (2012) replicated these results in seedbased analyses in a large cohort, additionally finding that motion affects ICA and graph analyses. Motion is often thought to be a more serious issue with pediatric populations, but it can be with aging populations as well. Examining subjects between 21 and 81, Mowinckel et al. (2012) found significant associations between age and motion and between motion and functional connectivity, suggesting that this is an issue of concern for aging studies as well as pediatric studies.\nCognitive decline with age is well documented (Levy 1994) , as are changes in brain volume (Raz et al. 1997 ) and function (Milham et al. 2002) . One consequence of the widespread loss of cortical and hippocampal neurons in Alzheimer's disease is a disruption in brain connectivity, both structural and functional . O'Sullivan et al. (2001) proposed that a physical cortical \"disconnection\", as evident on DTI scans , was in part to blame for cognitive decline (Daianu et al. 2013a, b) . Closely tied to this anatomical network decline is functional disconnection, as evidenced by the papers covered here. In this paper, we review recent work on changes in functional connectivity in healthy aging and in Alzheimer's disease. In this review we only discuss fMRI-based techniques, but we briefly mention other approaches as well."}, {"section_title": "Healthy Aging", "text": "The studies included in our Healthy Aging rsfMRI functional connectivity section are listed in Table 1 ."}, {"section_title": "Seed-Based", "text": "Using two seeds placed in the posterior cingulate cortex (PCC) and the ventromedial prefrontal cortex (vmPFC), Wu et al. (2011) probed age-related changes in the DMN in a sample of 18 young participants (22-33 years old) and 22 elderly participants (60-80 years old). As there are anterior and posterior components of the DMN (Damoiseaux et al. 2008; Andrews-Hanna et al. 2010) , the authors used an anterior and a posterior seed. In addition to investigating the connectivity of networks positively correlated with their seeds (PCC+and vmPFC+), they also investigated anti-correlated networks (PCC-and vmPFC-) . Across all networks, they found a distributed set of regions for which the younger subjects showed a stronger correlation (either positive or negative), indicating greater integrity and greater separation of networks in the younger subjects. The vmPFC-network did show stronger connectivity with the bilateral visual cortex and superior temporal gyrus in older subjects, however. In a multimodal study of 93 adults aged 18-93, Andrews-Hanna et al. (2007) found a significant reduction with age in functional connectivity between anterior and posterior hubs of the DMN (mPFC and PCC) (Fig. 1 ). This reduction was not explainable by increases in brain amyloid accumulation. Further, these reductions in functional connectivity were also associated with reductions in white matter integrity, as measured by fractional anisotropy (FA), and with impairments in cognitive function. Research such as this elegantly demonstrates the complex interplay of some of the factors involved in brain aging. Together, these seed-based studies indicate that the integrity of the DMN decreases with age. Functional connectivity does not decrease uniformly across the brain, however. Focusing specifically on the amygdala, St. Jacques et al. (2010) found increased connectivity between the amygdala and the frontal cortex with age, and decreased connectivity between the amygdala and posterior regions, suggesting a shift in how emotional stimuli are processed.\nUsing seeds (i.e., reference regions) in the bilateral hippocampi, Wang et al. (2006) and Allen et al. (2007) found widespread decreases in connectivity in subjects with Alzheimer's disease (AD) relative to controls. Both groups found decreases in hippocampal connectivity to frontal (BA 10, 24, 32), parietal (BA 7, 29), temporal (BA 22), and occipital (BA 19) regions. Zhang et al. (2009) investigated DMN connectivity in AD, using a seed in the posterior cingulate cortex (PCC). They similarly found decreased connectivity with regions spread across the frontal, parietal, temporal, and occipital cortex in subjects with AD. They also found increased connectivity between the PCC and clusters in frontal, temporal, and subcortical areas in subjects with AD, which they theorized was compensatory. Sheline et al. (2010b) used a precuneus seed to probe DMN connectivity, finding decreases across the frontal, parietal, and visual cortices and hippocampus in subjects with AD, as expected. Healthy elderly individuals who were PiB+(mean cortical binding potential>0.18) had decreases in the same areas as the AD group, in the same direction. Wang et al. (2007) used a variation of the seedbased approach: instead of assessing the time-series correlations voxel-wise, they parcellated the brain using the AAL atlas and averaged the time-series within each ROI and tested correlations among them. They found a significant decrease in anterior-posterior positive correlations in AD, while increases in positive correlations in AD were mainly limited to intralobe connections. There was also a significant decrease in the magnitude of negative connections in AD in parietal lobe. Most of these were connections thought to mediate the two anti-correlated networks (task-positive and task-negative; Fox et al. 2005) . Inability to switch between networks could lead to inefficient processing. Brier et al. (2012) went beyond the DMN network to include the dorsal attention network (DAN), the salience network (SAL), executive control network (CON) and the sensory-motor network (SMN) in a very large cohort (N=510). They generally found decreased connectivity within all networks with increasing CDR (clinical dementia rating) (Fig. 3) . Additionally, they found decreased anti-correlations between the networks, similar to Wang et al. (2007) . Altogether, the studies are consistent in finding decreased connectivity in the DMN and other networks in subjects with AD across broad brain regions, with some finding signs of possible \"compensatory\" connectivity."}, {"section_title": "ICA", "text": "One benefit of the ICA approach (independent components analysis) is that it is model-free: it does not require the researcher to select a seed, or reference region, of interest. Rather than identify areas of activation that correlate with a point or region of interest, ICA identifies independent profiles of spatial activation throughout the brain. Researchers can examine the same networks as they can through seed-based methods through template-matching. Examining the component corresponding to the DMN in 17 young and 21 older subjects, Koch et al. (2010) found decreased functional connectivity in the PCC and ACC (anterior cingulate cortex) in the older subjects. Using a variant of ICA, tensor PICA, Damoiseaux et al. (2008) examined the components corresponding to the DMN in ten younger and 22 older subjects. They found two components: one corresponding to anterior areas of the DMN, and one the posterior areas of the DMN. They found reduced activity in both of the DMN components with advanced age, and were further able to find an association between decreased activity in the anterior DMN component and evidence of cognitive decline. Just as with the seed-based studies, these ICA studies indicate \nUsing the ICA approach, Greicius et al. (2004) found similar results to seed-based investigations of the DMN in ADdecreased connectivity across widespread regions in frontal, parietal, and temporal cortices, and the hippocampus in subjects with AD. Sorg et al. (2007) examined the DMN and its anti-correlated network, the executive control network (ECN) in MCI (mild cognitive impairment) (although the salience network is also anti-correlated to the DMN). In the DMN component, they found reduced connectivity in MCI in major DMN hubs: the PCC and mPFC, as well as the angular gyrus.\nIn the ECN, they found reduced connectivity in the superior parietal lobule (SPL) and PFC in MCI, both hubs of that networks. Petrella et al. (2011) and Binnewijzend et al. (2012) both examined the DMN in AD and MCI longitudinally. Petrella et al. (2011) found that goodness-of-fit to a DMN template based on the healthy controls was a significant predictor of future conversion to AD in subjects with MCI (Fig. 4) . Binnewijzend et al. (2012) found significant differences in the connectivity patterns of AD patients and MCI patients who were stable after follow-up. Even so, they did not detect differences between AD patients and MCI patients who later converted to AD. Examining three subnetworks of the DMN, Damoiseaux et al. (2012) found decreased connectivity in the posterior DMN in AD, while they found increased connectivity in the ventral and anterior DMN subnetworks. Correction for gray matter atrophy changed the extent, but not the direction or significance of the results. Upon followup, all networks showed decreases in AD. Damoiseaux et al. (2012) interpreted these results to mean that some systems begin to disengage earlier, but all show signs of deterioration eventually. Going beyond just the DMN, Agosta et al. (2012) examined the DMN, ECN (fractured into ECN and a few \"fronto-parietal\" networks) and salience network in AD and MCI. In the DMN and frontoparietal components, they found both reduced connectivity in specific regions in AD compared to MCI and HC (healthy controls) and reduced mean connectivity across the whole component. Surprisingly, they found increased mean connectivity in AD in the ECN component, which was associated with cognitive scores. They suggested that Fig. 3 Network connectivity decreases with increasing CDR (clinical dementia rating). Each row shows the correlation map obtained for a given network using a representative seed ROI. For these maps, the left MT+was used as a seed region for the DAN; the dorsal mPFC for the CON; the dorsal anterior cingulate cortex for the SAL; and the supplementary motor area for the SMN. Reprinted with permission from Brier et al. 2012 this may be the brain's attempt to limit the clinical consequences of continuing tissue damage. Consistent with seedbased studies, the ICA studies of AD connectivity show distinct patterns of decreases, especially in the DMN. Results in the ECN appear to be less consistent, which may have to do with analytical choices or subject symptom severity."}, {"section_title": "Graph Theory", "text": "Seed-based and ICA approaches are somewhat similar, as they seek to extract temporally coherent networks. By contrast, graph theoretical approaches are more often used to describe functional relationships across all of the nodes (regions) of the brain. The spatial resolution or parcellation is chosen by the researcher, and can greatly affect the results (Zalesky et al. 2010) . Both Achard and Bullmore (2007) and Meunier et al. (2009) used the AAL parcellation (Tzourio-Mazoyer et al. 2002) to create 90×90 matrices describing the functional connectivity of 45 cortical and subcortical regions per hemisphere. Achard and Bullmore (2007) found decreased global connectivity in older subjects, and decreased nodal efficiency in frontal, temporal, limbic/paralimbic and subcortical regions. Meunier et al. (2009) focused on the modularity of functional networks. They reported that the size, composition, and topological roles of the regions changed with age (Fig. 2) . Some modules that were single, coherent modules in the young group were fractured into two modules in the older group. Additionally, while the frontal-striatal module appeared to be a critical module for coordinating activity in the young group, based on its intermodule connections, it was not in the older subjects. This role appeared to be taken over by the posterior module in older subjects. Brier et al. (2013) also reported age effects on modularity, finding decreased modularity with age, indicating a breakdown of the balance between integration within and separation between modules. Taken together, these studies point to shifts in the network topology in the aging brain with decreases in efficiency and integration being the result.\nAssessing the topology of the functional connectome as a whole, Supekar et al. (2008) found a significant loss in the small-world organization of the functional brain network in AD. Small-world organization is found in many biological networks and is characterized by a balance between integration and segregation, maximizing both global and nodal efficiency. They found a decrease in clustering coefficient in AD, both globally and locally in the bilateral hippocampi. Brier et al. (2013) also found a decrease in clustering with increasing CDR (clinical dementia rating), as well as reduced modularity. Sanz-Arigita et al. (2010) however, found no differences in clustering, instead finding shorter path length in AD. Both studies had similar sample sizes, the same parcellation, and controlled for the difference in edge density similarly, but Supekar and colleagues used wavelet analysis to isolate the contributing frequency components, and Sanz-Arigita and colleagues expressed the relationships between regions as synchronization likelihood, rather than correlation. Additionally, Supekar et al. (2008) employed spatial smoothing in their time-series data, while Sanz-Arigita et al. (2010) did not; instead averaging the time-series within each node according to the parcellation. Examining changes in synchronization, Sanz-Arigita et al. (2010) found increases in intraand inter-hemispheric synchronization in AD in the frontal lobe, and decreases in the parietal and occipital lobes (Fig. 5) . Jie et al. (2013) combined metrics of local clustering and topological structure to build an MCI classification method that has an accuracy of nearly 92 %, much higher than other methods using graph measures. Buckner et al. (2009) used graph theory to identify network hubs, then used PET imaging to show that β-amyloid deposition was significantly greater in those regions. They speculated that there may be an activitydependent mechanism that causes accumulation of β-amyloid in highly active areas, such as the hubs. Alternatively, amyloid build-up may impair the functions of neurons in Fig. 4 DMN goodness-of-fit is a significant predictor of conversion to AD. a The template mask used for the goodness-of-fit index. Color overlay created from DMN component in normal control subjects based on a onesample t test corrected for multiple comparisons using a family-wise error correction (p<0.05) and cluster size threshold of 10 voxels. b MCInc (mild cognitive impairment nonconverters) DMN. (C) MCIc (MCI converters) DMN. Cover overlays display the results of one-sample t tests in SPM8, corrected for multiple comparisons using a family-wise error correction (p<0.05). Adapted with permission from Petrella et al. 2011 specific regions, disrupting their ability to maintain synchrony with other systems. Graph theoretical results in AD are less consistent that those in seed-based and ICA approaches, most likely because of differences in analysis. With these differences in data type and analysis taken into account, graph theory appears to be a promising method in the analysis of functional connectivity in MCI and AD."}, {"section_title": "Alzheimer's and Mild Cognitive Impairment", "text": "The studies included in this section are also listed in Table 1 . For further reading, we encourage readers to refer to the review by Sheline and Raichle (2013) ."}, {"section_title": "Medications", "text": "While an exhaustive review of the effects of medications on functional connectivity is beyond the scope of this paper, here we will touch on a few studies examining the effects of several medications used in the treatment of Alzheimer's disease. Lorenzi et al. (2012) examined AD patients before and after 6 months of treatment with memantine. The group treated with memantine had greater DMN connectivity in the precuneus than the placebo group. Two studies from the same group, perhaps using overlapping subject pools, examined the effects of a 12-week course of donepezil on functional connectivity. Goveas et al. (2011) used hippocampal seeds to isolate a hippocampal network, and found that donepezil treatment was associated with increased connectivity to a number of regions, including the PCC, MFG, and subcortical targets. Further, they found that improvement on the MMSE (mini-mental state exam) and ADAS (Alzheimer's disease assessment scale) was associated with increased connectivity in the hippocampal network to the DLPFC, MFG, IFG, and others. Li et al. (2012) examined functional connectivity, using a PCC and MCC (middle cingulate cortex) seed, which are both substrates of the pathway targeted by donepezil. Following treatment, they found increased connectivity in the MCC network with the vMPFC, precuneus, vACC, precentral gyrus, IPC, and parahippocampus, while in the PCC network they found increased connectivity with the vACC and cuneus. Altogether these studies suggest promising effects of current Alzheimer's treatments, and show that functional connectivity can be a viable biomarker for tracking treatment-related changes in AD."}, {"section_title": "Amyloid Burden", "text": "Amyloid accumulation in the brain is fairly common even in healthy elderly individuals (estimates range between 20 % and 50 % of healthy elderly; Hedden et al. 2009 ). There is conflicting evidence on what effect amyloid (Aβ -beta-amyloid) build-up might have in cognitively normal individuals (Jack et al. 2009; Mormino et al. 2009 ). Amyloid burden can be detected by PET imaging (positron emission tomography) using the 11 C-labeled Pittsburgh Compound B (PiB), among other ligands (Johnson et al. 2007; Rabinovici et al. 2007) , and some types of PET scans are sensitive to both tau and amyloid pathology (Braskie et al. 2010; Protas et al. 2012) . Hedden et al. (2009) used a seed-based approach (PCC seed) to investigate effects of Aβ burden in 38 healthy elderly individuals. Regardless of whether they performed a group analysis or treated PiB uptake as continuous, the authors reported that individuals with a high amyloid burden showed reduced connectivity in DMN regions, including the lateral parietal and medial prefrontal cortices, and the hippocampal formation. Using an ICA approach, Mormino et al. (2011) found significant overlap between regions of Aβ deposition and regions of the DMN (Fig. 6 ). They also found that elevated PiB was associated with decreased DMN connectivity in the ventral mPFC, right angular gyrus, and left middle and superior frontal gyri. Drzezga et al. (2011) used graph theory to identify hub nodes in a functional connectivity analysis, while also using two types of PET protocols to assess amyloid burden and glucose metabolism in healthy elderly and MCI subjects. They found overlapping patterns of disruptions in functional connectivity and hypometabolism in PiB+MCI subjects, with PiB+asymptomatic subjects showing similar patterns to a lesser degree. Altogether these studies indicate that the early deposition of amyloid in DMN regions has functional consequences. It is not fully understood how elevated brain Aβ affects cognition in the healthy elderly, but these data indicate significant changes that suggest a prodromal phase or an intermediate step in decline."}, {"section_title": "APOE ε4", "text": "The APOE-ε4 allele has shown a consistent and strong association with Alzheimer's risk (Corder et al. 1993) . The APOE-ε4/ε4 genotype is associated with a 15-fold increased risk of Alzheimer's disease, relative to the APOE-ε3/ε3 genotype (Farrer et al. 1997) , with some variations based on a person's ancestry. Filippini et al. (2009) examined the functional connectivity of healthy, young APOE-ε4 carriers, using ICA to isolate the DMN. They found that young APOE-ε4 carriers had increased coactivation in the retrosplenial and medial-prefrontal regions, as well as the head of the hippocampus (MTL). Examining task-based connectivity of the MTL in healthy young carriers, Dennis et al. (2010) similarly found increased connectivity between the MTL and the parahippocampal gyrus. They additionally found decreased connectivity in APOE-ε4 carriers across a wide range of temporal and frontal regions. Turning to the healthy elderly, Bartrés-Faz et al. (2008) examined the functional connectivity Fig. 6 Overlap of β-amyloid deposition and DMN regions. One sample t-test of DMN best-fit components (yellow), 2-sample t-test comparing high-and low-PiB subjects (blue), and their overlap (red) are displayed. These maps highlight congruence and lack of congruence between the DMN and the brain regions showing high levels of Aβ deposition. The greatest amount of overlap is in the precuneus/posterior cingulate, medial prefrontal, and angular gyri. Although PiB uptake is more diffuse than the DMN, there is minimal overlap in retrosplenial and medial temporal portions of the DMN. Reprinted with permission from Mormino et al. 2011 of the hippocampus during an encoding memory task and found increased connectivity with the anterior cingulate, inferior parietal lobe, and caudate in APOE-ε4 carriers. Machulda et al. (2011) similarly examined healthy elderly carriers, during rest, focusing on the DMN and the salience network (SN). They found reductions in DMN connectivity across a number of temporal regions in the APOE-ε4 carriers, while they found increases in SN connectivity in the cingulate, MPFC, insula, striatum, and thalamus. Lastly, Sheline et al. (2010a) examined both positive and negative connectivity of the DMN in healthy elderly, PiB-individuals who were APOE-ε4 carriers. APOE-ε4 carriers had increased positive connectivity with the MPFC and increased anti-correlation with the anterior cingulate. APOE-ε4 carriers had decreased positive connectivity with the hippocampus and temporal regions. In a few regions, APOE-ε4 noncarriers had positive connectivity, while the APOE-ε4 carriers showed anticorrelations, and vice versa. These included the orbital cortex, occipital cortex, and some temporal targets. From these studies it appears that APOE-ε4 carriers exhibit increased connectivity in some of the regions that later show the most profound effects of Alzheimer's (e.g., the hippocampus, MTL), possibly as a sign of increased cognitive burden well before disease onset (Filippini et al. 2009; Dennis et al. 2010) . In healthy elderly carriers of APOE-ε4, connectivity with temporal regions is predictably decreased, although hippocampal results are less consistent. Additionally, the cingulate, MPFC, and striatum appear to be regions where APOE-ε4 carriers show increased connectivity. Hopefully, future work will be able to replicate these studies in larger cohorts and elucidate the mechanisms behind these changes in connectivity. Many neuroimaging studies of genetic polymorphisms and their effects on the brain are barely powered to detect effects, which may contribute to differences in what effects are found. To address this, imaging genetics consortia such as ENIGMA are meta-analyzing data worldwide with the goal of understanding the consistency and credibility of effects seen in smaller cohorts (Thompson et al. 2014 )."}, {"section_title": "Other Methods", "text": "In this paper we focused on functional connectivity studies using fMRI, but here we briefly summarize the other modalities researchers have used, to offer a few examples for further reading. Besides fMRI, other options for modeling functional connectivity include EEG (electroencephalography), MEG (magnetoencephalography), and PET (positron emission tomography). Jelic et al. (1997) found reduced EEG coherence in individuals homozygous for the APOE ε4 allele. Stam et al. (2007) used EEG data in a graph theoretical analysis, finding significantly increased path length in AD. Using MEG data and a graph theoretical approach, Stam et al. (2009) found lower clustering and path length in AD, disagreeing with their earlier study (Stam et al. 2007 ) but agreeing with a later one by the same group (Sanz-Arigita et al. 2010) . They explain that the discrepancy was due to analytical differences. Examining healthy aging, Grady et al. (2003) used PET imaging to show differences in functional connectivity during memory encoding between young and older adults, suggesting a shift in which cognitive resources are tapped with age. Turning to Alzheimer's disease, Grady et al. (2001) similarly used PET imaging and a memory task to show evidence of functional disconnection between the hippocampus and the prefrontal cortex in AD. These are just a few examples of studies using other methods to investigate functional connectivity in healthy aging and Alzheimer's disease."}, {"section_title": "Future Work", "text": "As seen from the studies presented here, functional connectivity has already contributed substantially to the field of Alzheimer's research. Changes in the DMN are detectable even before symptoms arise, and measures of functional connectivity are correlated with cognitive improvement following treatment, so functional connectivity is emerging as a promising biomarker for longitudinal studies and even interventional trials. The evidence for possible compensatory mechanisms is intriguing, and would also be well suited for follow up with a longitudinal study. Graph theory may also help in mapping how these effects are distributed across the connectome. In addition to examining the integrity of individual ICNs, future studies could examine how switching between networks is affected in AD. A third phase of the U.S. ADNI project (Alzheimer's Disease Neuroimaging Initiative) is in the planning stages (ADNI3)."}, {"section_title": "Conclusion", "text": "In addition to the well-documented changes in brain structure, function, and cognition, healthy aging and Alzheimer's disease are associated with changes in functional connectivity, as shown by the studies reviewed here. In healthy aging, functional connectivity declines with age, but this decline is not uniform across the brain. Whole connectome studies using graph theory have found decreases in whole brain connectivity, efficiency, and a shift in the balance between integration and segregation, and seed and ICA approaches have found decreases in DMN connectivity with age. However there is some evidence of increases in connectivity with age, possibly as neural strategies change or as compensatory mechanisms during the aging process. In Alzheimer's disease, the decline is exaggerated, with the DMN hit hardest. PET studies have found DMN hubs to be especially vulnerable to amyloid deposition, likely one factor contributing to the robust findings of decreased functional connectivity of the DMN in AD, but the reason for this vulnerability is unknown. Structure, function, and connectivity may be complementary modalities, although results in this field are not consistent. Regardless, changes in one can promote changes in the others, and each adds to a fuller understanding of the disease in question. Teasing apart each of the factors contributing to decline is not a task that one line of work can solve, but each of these studies here contributes to our knowledge. It is also important to consider that brain decline has multiple causes, and there is generally no one primary cause. There can be several different causes for decline-not just neuronal loss but also vascular, metabolic, and inflammatory changes. These studies bring us closer to an overarching goal in the field of Alzheimer's research: to determine when and how we can intervene to slow or stop decline, and to determine the earliest signs of decline and treatment response."}]