[{"section_title": "Abstract", "text": "Previous studies that have examined the potential for plasma markers to serve as biomarkers for Alzheimer disease (AD) have studied single analytes and focused on the amyloid-b and t isoforms and have failed to yield conclusive results. In this study, we performed a multivariate analysis of 146 plasma analytes (the Human DiscoveryMAP v 1.0 from Rules-Based Medicine) in 527 subjects with AD, mild cognitive impairment (MCI), or cognitively normal elderly subjects from the Alzheimer's Disease Neuroimaging Initiative database. We identified 4 different proteomic signatures, each using 5 to 14 analytes, that differentiate AD from control patients with sensitivity and specificity ranging from 74% to 85%. Five analytes were common to all 4 signatures: apolipoprotein A-II, apolipoprotein E, serum glutamic oxaloacetic transaminase, a-1-microglobulin, and brain natriuretic peptide. None of the signatures adequately predicted progression from MCI to AD over a 12-and 24-month period. A new panel of analytes, optimized to predict MCI to AD conversion, was able to provide 55% to 60% predictive accuracy. These data suggest that a simple panel of plasma analytes may provide an adjunctive tool to differentiate AD from controls, may provide mechanistic insights to the etiology of AD, but cannot adequately predict MCI to AD conversion."}, {"section_title": "", "text": "A lzheimer disease (AD) is the leading neurodegenerative disease of the elderly. It is characterized by synaptic loss, brain atrophy, loss of cholinergic innervation of the cerebral cortex and hippocampus, extracellular deposition of amyloid-b in the form of neuritic plaques, and intraneuronal accumulation of hyperphosphorylated tau. It is usually a devastating illness that leads to institutionalization and death in 10 years after diagnosis. AD is typically diagnosed on the basis of clinical criteria-that is, loss of cognitive function and the absence of competing alternative diagnoses. 1 However, clinical criteria may be quite insensitive to the early (and potentially more reversible) stages of the illness, and therefore, there has been great enthusiasm for incorporating biomarker data to achieve an earlier diagnosis. 2 The most recently revised research criteria for AD incorporate biomarker evidence, either cerebrospinal fluid (CSF) analysis, fluorodeoxyglucose positron emission tomographic scanning, or volumetric magnetic resonance imaging (MRI) scanning. 3 However, performing such tests in elderly demented patients, who bring with them a host of comorbidities, may not always be practical or cost-effective. Therefore, we have investigated the potential of a bloodbased biomarker to distinguish patients with AD from those with mild cognitive impairment (MCI) 4 and normal controls and whether such markers can predict conversion from MCI to AD. Such markers may provide a convenient and cost-effective way to achieve an early diagnosis of AD, or potentially as an outcome measure that can be repeatedly assessed in a clinical trial.\nSeveral investigators have studied the potential for peripheral biomarkers to diagnose AD. Previous studies have looked at a host of different blood markers, including various species of amyloid-b, [5] [6] [7] [8] [9] [10] [11] [12] apolipoprotein E (APOE) isoforms, 13 cytokines, [14] [15] [16] and other proteins. [17] [18] [19] However, few of these studies have yielded definitive results. For example, several studies show an increase, [20] [21] [22] whereas others show no change in various isoforms of plasma amyloid-b in AD patients. [23] [24] [25] [26] [27] The failure of a clear plasma biomarker to emerge from the numerous previous studies may be because a single plasma marker may not exist that can adequately distinguish AD from MCI or controls. There have been previous attempts to use arrays of peripheral biomarkers, with mixed results. [28] [29] [30] [31] [32] For example, the initial promising results of an 18-analyte signature developed on 83 patients 33 did not show good diagnostic accuracy on a subsequent separate set of subjects. 30 Most of the previous studies of arrays of plasma markers were either too small to detect differences or did not use powerful enough computational approaches to detect differences in the populations of proteins. We attempted to circumvent these problems by: (1) using a large and wellcharacterized population of AD, MCI, and control patients [the Alzheimer's Disease Neuroimaging Initiative (ADNI) database]; (2) by analyzing a large and diverse array (> 140) of potential serum markers; and (3) using a wide variety of statistical machine-learning algorithms to examine the ability of combinations of a large number of markers to distinguish between diagnostic categories."}, {"section_title": "METHODS", "text": "Data used in the preparation of this article were obtained from the ADNI database (http://adni.loni.ucla.edu). The ADNI study was launched in 2003 by the National Institute on Aging, the National Institute of Biomedical Imaging and Bioengineering, the Food and Drug Administration, private pharmaceutical companies, and nonprofit organizations, as a $60 million, 5-year public-private partnership. The primary goal of ADNI has been to test whether serial MRI, positron emission tomography, or other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of MCI and early AD. Determination of sensitive and specific markers of very early AD progression is intended to aid researchers and clinicians to develop new treatments and monitor their effectiveness and also lessen the time and cost of clinical trials.\nThe Principal Investigator of this initiative is Michael W. Weiner, MD, VA Medical Center and University of California-San Francisco, CA. ADNI is the result of the efforts of many coinvestigators from a broad range of academic institutions and private corporations, and subjects have been recruited from over 50 sites across the U nited States and Canada. The initial goal of ADNI was to recruit 800 adults, aged 55 to 90 years, to participate in the research, approximately 200 cognitively normal older individuals to be followed for 3 years, 400 people with MCI to be followed for 3 years, and 200 people with early AD to be followed for 2 years. For up-to-date information, see http://www.adni-info.org."}, {"section_title": "Patient Population", "text": "Subjects were recruited from 59 sites across the United States and Canada. Elderly controls, patients with MCI (defined by Petersen criteria 34 ) or AD (defined by NINCDS-ADRDA 1 ) were recruited and received a series of clinical, neuropsychological, and biomarker assessments. Patients underwent a battery of repeat assessments every 6 months for up to 36 months. Data used for the analyses presented here comprise data from 109 AD, 360 MCI, and 58 normal subjects. Eligible participants were in the age range of 55 to 90 years, fluent in English or Spanish, and had at least 6 years of education. Participants were enrolled into 1 of 3 groups: cognitively normal, amnestic MCI, or AD. Apart from these latter disorders, participants could have no other significant neurological disease. Normal individuals were free of memory complaints or depression and had a Mini-Mental State Examination (MMSE) score of 24 to 30 and a Clinical Dementia Rating (CDR) score of 0. MCI individuals could have MMSE scores of 24 to 30 and required a CDR of 0.5 and an informant-verified memory complaint substantiated by abnormal educationadjusted scores on the Wechsler Memory Scale Revised-Logical Memory II. Other cognitive domains and everyday functioning were intact. AD patients could have MMSE scores of 20 to 26 and CDR of 0.5 or 1.0."}, {"section_title": "Subjects Excluded From the Analysis", "text": "The 26 MCI and 2 AD subjects that were not diagnosed with moderate to high confidence by the physicians were excluded. These were subjects that were indicated as \"uncertain\" or \"mild\" in the ADNI database. The 18 MCI subjects that were not considered as AD-related, and were indicated as \"MCI-other\" in the ADNI database, were excluded. Among the rest of the subjects, the 2 AD subjects that were diagnosed as \"possible AD\" instead of \"probable AD\" were also excluded from the analysis. This left 109 AD, 360 MCI, and 58 normal subjects in the sample. Of the 360 MCI subjects, 253 subjects stayed in the study for at least 24 months. Among these 253, 101 subjects did not progress to AD, and the remaining 152 progressed to AD."}, {"section_title": "Plasma Samples", "text": "Plasma samples were taken after an overnight fast and at a standard time of day (8 AM) and collected in an EDTAcontaining purple-top tube. Samples were analyzed on the Luminex xMAP platform by Myriad Rules-Based Medicine (http://www.rulesbasedmedicine.com). A panel of 190 analytes that are potentially related to a diverse array of human diseases (including non-neurological disease, the Human DiscoveryMAP v 1.0) was quantitated. The Luminex assay involves antibody-based detection amplified using a reporter streptavidin-phycoerythrin conjugate. Fluorescent signal is detected using a flow-based laser apparatus to detect fluorescent polystyrene microspheres, which are loaded with different ratios of 2 spectrally distinct fluorochromes. Analytes are analyzed as several panels and multiplexed, 3 to 24 analytes at a time. Details regarding the assay technology and validation can be found at (http://adni.loni.ucla.edu/ wp-content/uploads/2010/11/BC_Plasma_Proteomics_Data_ Primer.pdf). Of the 190 potential analytes available, only 146 met ADNI quality control criteria and were analyzed further (listed in Supplemental Table 1 , Supplemental Digital Content 1, http://links.lww.com/WAD/A34). The other 44 analytes were mostly below the assay detection limit."}, {"section_title": "Analysis", "text": "There were 2 broad objectives in our analyses: 1. To identify the markers which differentiate the AD, MCI, and normal groups. 2. To identify the markers which are predictive of 24month progression from MCI-AD using baseline data from MCI subjects. To address each of the above objectives, first a univariate analysis was performed to identify markers that on their own significantly differentiate the disease state groups and the MCI-AD progressors from nonprogressors. This was followed by multivariate predictive modeling to determine optimal combinations of subsets of markers (signatures) that accurately differentiate AD and normal subjects, as well as optimal signatures that predict the 24-month progression from MCI to AD.\nUnivariate analysis was carried out using an ANCOVA, with age, education, and sex as covariates to the main outcome of AD, MCI, or normal. Although ApoE4 + status is a well-established marker for clinical status and progression in AD, adjustment for ApoE status was not performed, given the small number of ApoE4 + subjects in the healthy control group (5 subjects of 58) and potential confounding with the disease status. Future studies with larger subject pools may permit an appropriate analysis of the impact of ApoE status on the plasma signatures described herein. If the distribution of the markers was not approximately symmetric, appropriate transformation (eg, log10) was used before applying the ANCOVA. The outliers for each analyte were identified using the Tukey outlier criteria on the studentized residuals from the ANCOVA. On the basis of this criteria, samples that fall below Q1 À1.5(Q3 ÀQ1) and above Q3 + 1.5(Q3ÀQ1) are considered as outliers, where Q1 and Q3 represent the 25th and 75th percentiles, respectively, of the distribution. Statistical significance of the markers between clinical diagnosis groups was reported in terms of both the false-positive rate (P-value) and the more stringent false discovery rate (FDR) (q-value). 35, 36 FDR is the proportion of false positives (discoveries) among those changes declared significant and is the relevant criteria to use when evaluating significance of large number of analytes as in this data set.\nMultivariate analyses for identifying optimal diagnostic and prognostic signatures were carried out separately by first filtering out the most significant markers using a robust version of the Students t test. The optimal subsets of markers were derived by first evaluating the relative importance of each marker within the framework of random forests, 37 the partial least squares and bagging, 38 and simulated annealing. 39 Then the optimal size of the subsets was determined on the basis of the number of these most important markers that yielded maximal predictive accuracy. In some of these subsets, constraints were imposed on the pairwise correlations between the markers to be not >80%. These derived subsets were then used in one of the following classification algorithms: (1) diagonal linear discriminant analysis; (2) random forests; (3) support vector machines with radial kernel; (4) neural network; (5) partial least squares; (6) bagging; and (7) k-nearest neighbor.\nThe predictive performance of these optimal signatures was evaluated with respect to both internal and Those that are significant at the more stringent criteria of q < 0.05 are italicized. Results for all 146 analytes for each pair of AD, MCI, and normal groups are listed in Supplemental Tables 2A-C, respectively. A1Micro indicates a-1-microglobulin; AD, Alzheimer disease; ANG-2, angiopoietin-2; ApoA-IV, apolipoprotein A-IV; C3, complement C3; FasL, Fas ligand; IgM, immunoglobulin M; ILGFBP, insulin-like growth factor-binding protein; MCI, mild cognitive impairment; NL, normal; PAPPA, pregnancy-associated plasma protein A; PYY, peptide YY; SGOT, serum glutamic oxaloacetic transaminase; TTR, transthyretin.\nAlzheimer Dis Assoc Disord Volume 27, Number 3, July-September 2013\nPlasma Proteomic Markers for Alzheimer Disease pseudoexternal validation. First, the original data set were randomly divided into 2 subsets of two-third and one-third size, stratified to ensure similar distribution of the disease groups within these 2 sets. The first two-third training set was used to identify the predictive signatures, with performance estimated using an internal cross-validation procedure, and the second one-third test set (not used to build a model) was used to further test the performance of these signatures (this is referred as \"pseudoexternal,\" as it is not an independent cohort of samples). The internal cross-validation within the two-third training set to derive and evaluate the optimal signatures was carried out using 10 iterations of a fully embedded 5-foldstratified cross-validation procedure. This was carried out by first dividing the full two-third training data subset randomly into 5 equal parts, stratified to ensure that each of these parts had the same distribution of the groups (AD and normal, or MCI-AD progressors and nonprogressors) as was found in the original data set. Then each part was left out one at a time (that iteration's test set), and the remaining 4 parts were used as a training set for that iteration to filter the markers, derive the optimal signature, and fit the classification model as described above. The models constructed on the training sets were then used to predict the test sets, and the predictions from all the 5 test sets were pooled together to estimate the performance misclassification measures, sensitivity, and specificity. This entire procedure was iterated 10 times to yield robust estimates of sensitivity and specificity. It is to be noted that all of the steps in the analyses for deriving the optimal signature and fitting the predictive classification model were embedded within this cross-validation procedure. Such a rigorous derivation of optimal signatures is recommended also for high throughput data sets such as genomics, 40 and it provides a more accurate reflection of the true performance in a future cohort. For example, when the crossvalidation is done only in the final model-fitting step after the signatures are derived from the entire data set, estimates of sensitivity and specificity will be significantly biased upward. 41, 42 Therefore, performance measures reported by different publications should be compared with caution. Please note that the above procedure is the best one can do with only a single data set available, as is the case for the ADNI plasma data.\nThe performance of the optimal signatures from the internal cross-validation on the training set and the pseudoexternal validation on the test set were summarized in terms of the area under the receiver-operating characteristic curve (AUC), sensitivity, and specificity. Sensitivity refers to the ability to correctly identify AD (for AD vs. normal analysis) or MCI-AD progression (for MCI-AD progression analysis). Specificity refers to the ability to correctly identify normal subjects or subjects who would not progress to dementia of the AD type.\nA consideration was given to include more well-studied biomarkers for AD in our predictive models, such as amyloid-based positron emission tomography, fluorodeoxyglucose-based positron emission tomography, CSF amyloid, or tau. However, not all of these markers were tested on all the subjects, and using these as comparators to plasma markers would necessarily truncate the data set. The power of the plasma signatures is that they are derived from the large number of samples. Therefore, this comparison would likely not provide an accurate representation of the utility of these plasma signatures, although this could be of interest for subsequent research.\nAnalyses were performed using R, 43 version 2.12, and the contributed libraries for the different machine-learning methods were used in our analyses. 44, 45 "}, {"section_title": "RESULTS", "text": "The key baseline characteristics of the AD, MCI, and controls are summarized in Table 1 . The 109 AD, 360 MCI, and 58 normal subjects were not significantly different with respect to age and length of education (P > 0.05). The ADAS-Cog and MMSE scores for the AD showed progressive worsening of cognitive function across the spectrum of normal, MCI, and AD. Sex distribution was uneven between the groups (P < 0.05). As expected, over 50% of the MCI and AD subjects had 1 or more ApoE4 alleles, and <9% of the control subjects had at least ApoE4 allele (5 of 58 subjects)."}, {"section_title": "Disease State Comparison (AD vs. MCI vs. Normal): Diagnostic Biomarker", "text": "For disease state classification, both univariate and multivariate analyses were performed. The distribution of 141 of 146 analytes was approximately lognormal, that is, these analytes required log transformation before the univariate ANCOVA analysis. The distribution of other 5 analytes was approximately symmetric in their original scale; hence, these did not require any transformation. Most analytes have a few outliers; hence, these were excluded from the univariate ANCOVA analysis using the criteria stated under the statistical methods.\nUnivariate analysis demonstrated that 57 of 146 proteins were significantly different between AD versus normal at P < 0.05 false-positive rate, out of which 41 were significant at the more stringent q < 0.05 FDR criteria. Of the 146 proteins, 51 were significantly different between MCI versus normal at P < 0.05, out of which 42 were significant at the more stringent q < 0.05 criteria. Of the 146 proteins, 62 were significantly different between AD versus normal at P < 0.05, out of which 49 were significant at the more stringent q < 0.05 criteria.\nBecause of the high clinical utility of distinguishing between AD, MCI, and normal, markers were identified FIGURE 2. Plasma proteomic markers that are statistically significant on their own at the stringent q < 0.05 criteria between all pairs of AD, MCI, and normal (NL) groups are graphed here with the individual subject results overlaid on the box plots. Although these markers are statistically significant, none of these show impressive diagnostic accuracy even between AD versus NL. However, a clever optimal combination of some of these and/or other markers may have high predictive value (see text and additional figures). "}, {"section_title": "Alzheimer Dis Assoc Disord Volume 27, Number 3, July-September 2013", "text": "Plasma Proteomic Markers for Alzheimer Disease that differentiated these 3 states. Thirteen proteins were significant for all pairs at P < 0.05, of which 5 were significant at the more stringent q < 0.05 criteria within a FDR framework ( Table 2 and Fig. 1 ). These 5 markers are: (1) a-1-microglobulin (A1Micro); (2) heparin-binding EGFlike growth factor (HBELGF); (3) immunoglobulin M (IgM); (4) macrophage inflammatory protein-1 a (MIP-1a); and (5) pregnancy-associated plasma protein A (PAPPA). The log-transformed individual data points are shown in Figure 2 for the 5 analytes described above.\nAlthough the group means show significant differences across disease state, there is significant overlap across the diagnostic categories. To assess the ability of each of these markers to distinguish between disease states and to facilitate comparison with other markers, we computed receiver-operating characteristic curve parameters for the comparison between AD and control for each marker. The AUC values for the AD versus control subjects were all <72%, with reasonably good specificity (B85%) but poor sensitivity (B50%). The results for all the 146 analytes for each pair of AD, MCI, and normal groups are listed in Supplemental Tables 2A-C (Supplemental Digital Content  2 , http://links.lww.com/WAD/A35), respectively.\nThe multivariate analysis revealed several optimal diagnostic signatures with good predictive ability to differentiate AD and normal control subjects using the various methods described under the Methods section. The details around 4 of these optimal signatures are summarized in Tables 3-5 . The number of markers in these 4 signatures varied from 5 to 14, and the performances of these signatures were examined using both internal and pseudoexternal validation as described in the Methods section. As signatures with fewer markers are generally easier to implement in practice, preference was given to signatures with fewer markers as long as their performance was not significantly inferior to signatures with many markers. Sensitivity, specificity, and AUC of these signatures in the internal and pseudoexternal validation varied mostly between 74% and 85%. The optimal subsets of markers in these signatures were derived on the basis of their relative importance scores with respect to partial least squares, random forests, and bagging algorithms. 44 Random forests algorithm was the optimal classification model for the subsets of markers in the 4 reported signatures. Each of the 19 markers present in one or more of the four signatures graphed with individual subject samples overlaid on the box plots for the AD and the normal groups (Fig. 3) . A1Micro, apolipoprotein A-II (ApoA-II), ApoE, brain natriuretic peptide (BNP), and serum glutamic oxaloacetic transaminase (SGOT) are present in all the 4 signatures. Eotaxin-3, IgM, and placenta growth factor are present in 3 of the signatures, and interleukin-16 is present in 2 of the signatures. The relative importance of the markers within the subsets for each of the 4 signatures with respect to the random forests algorithm is summarized in Figures 4A-D . A1Micro, ApoA-II, ApoE, BNP, SGOT, and eotaxin-3 are consistently among the most important markers in these 4 signatures. To further investigate whether SGOT differences might be related to body weight, we examined the correlation between body weight and SGOT levels and found no significant correlation (Spearman rank correlation = À5%, P = 0.30).\nIt should be noted again that these signatures were developed using two thirds of the AD and normal control subjects from this data set. In addition to the internal crossvalidation and pseudoexternal validation (on the remaining one third) for evaluating their performance to classify AD versus normal controls (summarized above), these signatures were tested further for their ability to accurately identify the 360 MCI patients not used in this multivariate A1Micro indicates a-1-microglobulin; A2Micro, a-2-macroglobulin; ApoA-II, apolipoprotein A-II; ApoE, apolipoprotein E; BNP, brain natriuretic peptide; BTC, betacellulin; C3, complement C3; CRP, c-reactive protein; IgM, immunoglobulin M; IL-16, interlukin-16; ILGFBP, insulinlike growth factor-binding protein; MPO, myeloperoxidase; PAPPA, pregnancy-associated plasma protein A; PLGF, placenta growth factor; PYY, peptide YY; RAGE, receptor for advanced glycosylation end products; SGOT, serum glutamic oxaloacetic transaminase; TN-C, tenascin-C; TTR, transthyretin. "}, {"section_title": "MCI to AD Disease Progression: Prognostic Biomarker", "text": "The baseline levels of markers such as plasminogen activator inhibitor-1 (PAI-1) and PAPPA were significantly associated (P < 0.05) with 12-month progression, and markers such as ApoA-II and transthyretin (TTR) even appeared significant within a false-positive rate P-value approach with 24-month clinical follow-up. However, none of these were significant at the more stringent q < 0.05 criteria within a FDR framework. Multivariate analysis yielded signatures with only B55% accuracy for predicting a 12-and a 24-month disease progression. This prognostic biomarker performance improved to B62% predictive accuracy for patients who were ApoE4 positive (possible as there were sufficient MCI progressor and nonprogressor sample sizes to conduct this subgroup analysis that was not possible with the disease classification data). Canonical plots for 1 such poor signature in Figure 5 illustrate poor performance in training and test sets."}, {"section_title": "DISCUSSION", "text": "In the current study, we used a large and well-characterized population of AD, MCI, and control participants (the ADNI database) to study the potential of an array of 146 plasma biomarkers to distinguish between these 3 diagnostic categories. A multivariate approach was used to find a \"signature\" of biomarkers that optimally separate these categories. A univariate analysis showed that several markers showed statistically significant differences between the diagnostic categories. However, none of them showed particularly high sensitivity or specificity when checked for either internal or pseudoexternal cross-validation. In contrast, an array of 5 to 14 markers showed very good diagnostic performance in cross-validation studies. Four independent signatures were identified in different iterations, and 5 of the markers: APOA-II, APOE, BNP, SGOT, and A1micro appeared in all the 4 signatures. Box plots of each of the 19 markers (log transformed) present in 1 or more of the 4 signatures are provided. Individual subject sample results are overlaid. These graphs reflect that each marker on its own is not a strong diagnostic, but as a collection in one of the 4 signatures proposed here, provides 75% to 85% classification accuracy.\nThe particular markers identified by the current study are of interest, because several of them (BNP, SGOT, and A1micro) are not classically associated with AD. For example, A1micro, which demonstrated significance in both the univariate and multivariate analysis, is a liver-derived protein whose expression is upregulated during inflammatory states. [46] [47] [48] The progressive elevation of A1micro in AD versus MCI versus controls observed in the current study is consistent with the findings that AD is associated with central nervous system inflammation. Although there are several studies demonstrating increases in central nervous system inflammation in AD, 49, 50 we are not aware of any previous studies that have assessed the relationship between plasma A1micro and AD. Another marker not classically associated with AD, BNP, was identified in this study. BNP, although initially identified in brain tissue, is typically associated with myocardial stretch and congestive heart failure. Even though it is not known whether plasma BNP levels in the current study reflect brain or cardiac origin, CSF levels of BNP are significantly lower compared with plasma levels, suggesting that much or most plasma BNP is not brain derived. 51 Another marker identified in this study, SGOT (also known as aspartate transaminase), is typically associated with liver or skeletal muscle injury. SGOT levels were found to be lower in AD patients relative to control or MCI patients and showed significance (uncorrected for multiple comparisons) in the univariate and the multivariate analysis. Similar decreases in the SGOT levels in AD patients have been seen variably in other studies. 52, 53 One potential explanation is that because SGOT levels (as well as other liver function tests) are associated with body mass index, 54 and because AD patients may have a lower body mass index compared with controls, 55 then the lowered SGOT levels in the current study may be related to altered body mass in AD patients. However, we found that SGOT levels in this study did not vary with body weight. Eotaxin-3 is a chemokine usually associated with pulmonary inflammation, although recent findings have shown an association between CSF, eotaxin-3 (in a multivariate analysis 56 ) , and AD and between peripheral eotaxin-3 and Huntington disease. 57 Interestingly, a related molecule, eotaxin-1, was recently found to increase with age in an animal model, and high levels were found to impair cognitive function when artificially elevated in young animals. 58 The findings that BNP, SGOT, eotaxin-3, and A1micro show novel associations with AD, illustrate the hypothesis-generating potential of a broad-based multivariate approach to biomarker discovery.\nNeither a disease state differentiating signature nor an optimized signature for MCI-AD conversion showed high predictive accuracy for MCI-AD conversion over 12 and 24 months. These differ from previous work using a similar approach, but with cognitive, imaging, and CSF data. We previously showed that signatures comprised of only cognitive endpoints, or combinations of biomarkers that were optimized for disease state differentiation, showed good predictive accuracy for MCI-AD conversion at 12 months (AUC values of 65% to 70% 59 ). The reason for the differential performance of plasma markers for disease state differentiation and MCI-AD prediction is not known but may have to do with the complex relationship between values of these analytes and disease state. For example, for some markers, there seemed to be a transition state, with values showing their largest deviation from normal in the MCI state and seemed to \"normalize\" in AD (eg, HBELGF, MIP-1a, PAPPA, ANG-2, ApoA-IV, ILGFBP, and TTR). The scenario of maximal deviation of a biomarker in early disease with pseudonormalization has been seen with other AD markers, such as hippocampal activation on fMRI, 60 and may represent a compensatory response. Whether the changes seen in these markers also represent compensatory responses will have to be determined in future studies.\nThe current study illustrates the potential power of a multivariate analytical approach to develop relatively noninvasive and cost-effective diagnostic procedures to assist in the diagnosis of AD, as well as to open new avenues for research into the underlying biology of AD. It does not yet open an avenue for prognostic use but continued work is essential. Future work will hopefully address potential limitations in the present study. For example, it will be critical to test the 5 to 14 analyte plasma signatures against an independent data set to assess their predictive validity. In addition, the current work does not assess these biomarker signatures in other related disease states, such as vascular dementia, Lewy body disease, frontotemporal dementia, Creutzfeldt-Jacob disease, or Parkinson disease. As new disease-modifying therapies with significant adverse effect profiles begin to emerge, it will become imperative for clinicians to differentiate AD from these other dementias and from normal aging. Further evaluation of these multivariate blood-derived signatures identified in the current study in prospective studies will help determine whether these signatures can serve as such a diagnostic tool."}]