[{"section_title": "Abstract", "text": "Accumulating evidence demonstrating higher cerebrospinal fluid (CSF) α-synuclein (αSyn) levels and αSyn pathology in the brains of Alzheimer's disease (AD) patients suggests that αSyn is involved in the pathophysiology of AD. To investigate whether αSyn could be related to specific aspects of the pathophysiology present in both sporadic and familial disease, we quantified CSF levels of αSyn and assessed links to various disease parameters in a longitudinally followed cohort (n = 136) including patients with sporadic mild cognitive impairment (MCI) and AD, and in a cross-sectional sample from the Dominantly Inherited Alzheimer's Network (n = 142) including participants carrying autosomal dominant AD (ADAD) gene mutations and their non-mutation carrying family members. Our results show that sporadic MCI patients that developed AD over a period of two years exhibited higher baseline αSyn levels (p = 0.03), which inversely correlated to their Mini-Mental State Examination scores, compared to cognitively normal controls (p = 0.02). In the same patients, there was a dose-dependent positive association between CSF αSyn and the APOEε4 allele. Further, CSF αSyn levels were higher in symptomatic ADAD mutation carriers versus non-mutation carriers (p = 0.03), and positively correlated to the estimated years from symptom onset (p = 0.05) across all mutation carriers. In asymptomatic (Clinical Dementia Rating < 0.5) PET amyloid-positive ADAD mutation carriers CSF αSyn was positively correlated to 11 C-Pittsburgh Compound-B (PiB) retention in several brain regions including the posterior cingulate, superior temporal and frontal cortical areas. Importantly, APOEε4-positive ADAD mutation carriers exhibited an association between CSF αSyn levels and mean cortical PiB retention (p = 0.032). In both the sporadic AD and ADAD cohorts we found several associations predominantly between CSF levels of αSyn, tau and amyloid-β 1-40 . Our results suggest that higher CSF αSyn levels are linked to AD pathophysiology at the early stages of disease development and to the onset of cognitive symptoms in both sporadic and autosomal dominant AD. We conclude that APOEε4 may promote the processes driven by αSyn, which in turn may reflect on molecular mechanisms linked to the asymptomatic build-up of amyloid plaque burden in brain regions involved in the early stages of AD development."}, {"section_title": "Introduction", "text": "Intracellular neurofibrillary tau tangles and extracellular amyloid-β (Aβ) plaques are the main neuropathological hallmarks of Alzheimer's disease (AD), however, at autopsy more than 50% of these patients exhibit concurrent α-synuclein (αSyn) pathology [1, 16, 31] . Conversely, it has been shown that Aβ plaques promote the development of cortical αSyn lesions in individuals with Parkinson's disease (PD), and up to 50% of PD with dementia patients develop Aβ and tau pathology sufficient for a secondary pathological diagnosis of AD [19, 46] . α-synuclein, a 140 amino-acid protein encoded by the SNCA gene, is abundantly expressed neuronal presynaptic terminals [20] . The peptide corresponding to residues 61-95 of αSyn was originally discovered 25 years ago in Aβ plaques and named the non-Aβ component (NAC) [58] . Follow-up studies from the same group further demonstrated NAC immune-reactivity in diffuse Aβ plaques which may result in the formation of mature compact Aβ plaques [33] . Results from these studies suggest that αSyn might be involved in the development of AD from the very early stages of Aβ pathology formation. In support, a recent study demonstrated a positive correlation between cerebrospinal fluid levels of αSyn and Aβ plaque deposition in cognitively normal individuals with subjective memory complaints. The authors speculated that CSF αSyn levels may be related to pathophysiological mechanisms occurring early in the preclinical phase of AD [59] .\nThe relevance of correlating αSyn levels in the CSF to brain parenchymal concentration of αSyn in AD patients is nevertheless controversial due to the lack of autopsyvalidated studies assessing αSyn levels in paired CSF and brain tissue samples. Ideally, advancements in radiotracer chemistry could allow for ante-mortem imaging studies in which CSF αSyn concentrations could be correlated to αSyn load in the antemortem brain, similar to PiB-PET correlations between CSF Aβ levels and brain amyloid plaque load [13] . Hence the exact relationship between the low CSF αSyn and brain parenchymal Lewy bodies as occurring in patients with synucleinopathies like PD [68] and dementia with Lewy bodies (DLB) [37] remains unknown. Similarly, the relevance of slightly increased CSF αSyn levels in AD patients [26] to αSyn pathology in the brain is also unclear.\nIn a study of brains from AD patients devoid of Lewy bodies, intracellular levels of soluble monomeric αSyn were two-fold higher than in controls and significantly correlated to cognitive decline [28] . Potential alterations of CSF αSyn levels in the same subjects were not investigated. Although αSyn can interact with a multitude of cellular components, of which many have been shown to potentially contribute to neurodegeneration [66] , the molecular underpinnings of these findings in relation to the development of AD remain poorly understood.\nResults from studies of the AD mouse model Tg2576 crossed onto an SNCA knockout background proposed that loss of αSyn increased the Aβ plaque load in all forebrain areas by the age of 18 months [23] . In support, it was found that αSyn inhibited amyloid plaque formation in APPPS1 mice co-expressing the SNCA gene. The authors of the same study further demonstrated that the seeding activity of injected Aβ containing brain homogenates was reduced, and that Aβ deposition was suppressed in grafted tissue from the [A30P]aSYN transgenic mouse model [2] . The mechanisms underlying the inverse association between Aβ plaque formation and αSyn have yet to be determined, and may be complicated by the existence of various αSyn species (monomers, oligomers, fibrils) which individually may have differing effects on AD pathophysiology. For example, Larson et al. recently reported that increasing oligomeric αSyn selectively decreased presynaptic proteins and cognitive performance in the bigenic J20xTgI2.2 AD mouse model where both monomeric and oligomeric αSyn increase with age, [27] .\nIn addition to the overlapping neuropathological features between AD and synucleinopathies like PD and DLB, but not multiple system atrophy [42] , these disorders also share the APOEε4 allele as a strong genetic risk factor. The APOEε4 allele increases the risk of AD by up to 15-fold and the risk of DLB by up to 6-fold [7, 10] . Furthermore, the APOEε4 allele also increases the risk of PD and decreases the age of disease onset [30] . The exact molecular pathways underlying the increased risk of several neurodegenerative disorders in APOEε4-carriers have yet to be identified but the urgency to do so is clearly illustrated by the rather high frequency (~14%) of this allele in the normal population [32] .\nIn the current study we aimed to assess the pathophysiological relevance of αSyn levels in CSF to the development of AD, including surrogate markers of AD neuropathology, in a clinical setting. We further aimed to investigate potential effects of the APOEε4 risk allele on identified relationships. For our purposes we used two cohorts, a longitudinally followed cohort of patients with sporadic MCI and AD to investigate potential relationships between αSyn and disease progression. The second cohort was comprised of a cross-sectional sample from the Dominantly Inherited Alzheimer's Disease Network (DIAN) including participants with autosomal dominant mutations in the APP, PSEN1 and PSEN2 genes causing early-onset autosomal dominant Alzheimer's disease (ADAD), and their non-mutation carrying relative control participants [3] . The latter cohort was included to enable specific analyses of relationships between αSyn and the development of symptoms in subjects that will de facto develop Alzheimer's disease. Furthermore, inclusion of subjects with ADAD mutations also enabled us to assess potential associations between CSF αSyn levels and specific mutations in the genes encoding key components in the Aβ peptide production pathway i.e. the amyloid precursor protein (APP) and the presenilins 1 and 2 (PS1 and PS2)."}, {"section_title": "Materials and methods", "text": ""}, {"section_title": "Study participants", "text": "Subjects from two different cohorts were included in the present study. The longitudinally followed cohort totaling n = 136 subjects, including n = 52 subjects that were cognitively healthy controls and n = 84 patients who at baseline were diagnosed with sporadic MCI (n = 57) or AD (n = 27). Clinical diagnoses of MCI or AD were based on the International Working Group on Mild Cognitive Impairment Criteria [63] and the National Institute of Neurological and Communicative Disorders and Stroke and the Alzheimer's Disease and Related Disorders Association criteria [34, 35] . The clinical workup and results from parts of this cohort were previously reported [5, 6, 45] . Briefly, consenting participants were recruited by the Department of Neurology at Trondheim University Hospital in Trondheim, Norway on the conditions that individuals had adequate vision and hearing, did not exhibit high alcohol consumption or use of anti-coagulation medication, and had no psychiatric or malignant disease. Cognitively healthy control subjects were recruited from elderly caregivers who were not genetically related to the patients or from societies for retired people in central Norway. Cerebrospinal fluid was drawn at baseline and at intervals of 12-months follow-up examinations over two years. Control individuals had their CSF sampled at baseline only, due to restrictions pertaining to ethical permits; however, they were clinically assessed both at baseline and at the study-end. Cerebrospinal fluid sampling and CSF AD biomarker analysis (for research purposes only) including quantification of Aβ 1-40 , Aβ , total tau (t-tau) and tau phosphorylated at Thr181 (p-tau) levels were previously described [6] . Both patient and control groups were APOE genotyped from blood samples and underwent cerebral volumetric 3-Tesla MRI (3T-MRI) brain imaging at baseline and after two years. Upon completion of the study, MCI patients were re-classified into two groups based on their baseline and two-year follow-up diagnoses. Patients diagnosed with MCI at baseline and who remained diagnosed with MCI after two years were classified as MCI-MCI (n = 30), while patients who were MCI at baseline but that fulfilled the clinical criteria for AD after two years were classified as MCI-AD (n = 27). The studies performed on this cohort were approved by the regional ethics committee in Trondheim, Norway (2010/226) and Stockholm, Sweden (2016/771-31/4) and carried out in agreement with the Helsinki Declaration.\nParticipants in the second cohort were a cross-sectional sample from the multi-site Dominantly Inherited Alzheimer's Network (DIAN) (https://dian.wustl.edu/our-research/observational-study/). The DIAN registry includes mutation carrying and non-mutation carrying adult biological children from families in which one parent carries an ADAD causative mutation in the APP, PSEN1 or PSEN2 genes. At inclusion, and during subsequent visits, DIAN participants were assessed neuropsychologically, biochemically (CSF and plasma), and underwent structural neuroimaging using 3T-MRI, and functional neuroimaging using PET combined with either fluorodeoxyglucose (FDG-PET) or PiB to quantify brain glucose metabolism and Aβ deposition respectively [4] . Updated datasets are generated biannually in what are termed dataset \"freezes\". For the current study we examined subjects from the DIAN dataset freeze-10 including a total of n = 92 ADAD mutation carriers: n = 24 APP, n = 50 PSEN1, and n = 18 PSEN2 mutation carriers, as well as n = 50 non-mutation carriers who were genetically related to the mutation carriers but did not harbor ADAD mutations. Included subjects were considered as symptomatic if fulfilling the criteria for a Clinical Dementia Rating (CDR) score ≥ 0.5. The purposes of the current study involving DIAN participants were approved by the local ethics committee in Stockholm, Sweden (2016/2114-31/4) and the study was carried out in agreement with the Helsinki Declaration."}, {"section_title": "αSyn quantification", "text": "Quantification of CSF αSyn in samples from both cohorts was performed using a commercially available sandwich enzyme-linked immunosorbent assay (ELISA) (AnaSpec; California, USA) according to the manufacturer's instructions and using overnight incubation at 4°C for the sample incubation step. Samples were assayed alongside freshly prepared standard curves for each individual assay. Standards, study subject and internal control samples were run in duplicates and averaged. Spike recovery experiments were performed to assess matrix effects by adding known concentrations of the supplier-provided αSyn standard to diluted CSF resulting in a spike recovery range of 99-122%. Intra-and inter-assay coefficients of variation were determined by repeated analysis of pooled CSF samples as internal controls resulting in coefficients of variation of < 15% respectively for the two lots of assays used to quantify αSyn in the two cohorts."}, {"section_title": "DIAN participant MRI image acquisition", "text": "Structural MRI acquisition was performed using the Alzheimer Disease Neuroimaging Initiative (ADNI) protocol [21, 22] . Participating sites were required to pass initial and regular follow-up quality control assessments to insure acquisition conformity. Each participant received an accelerated 3D sagittal T1-weighted MPRAGE on a 3T scanner. A high quality, whole-brain image with 1.1 × 1.1 × 1.2 mm voxels was acquired in approximately 5-6 min. Before further image processing, images were screened for artifacts and protocol compliance by the ADNI imaging core."}, {"section_title": "DIAN participant PET image acquisition and processing", "text": "A subset of n = 132 ADAD participants (mutation carriers n = 85, non-mutation carriers n = 47) underwent PiB-PET imaging. Each site underwent an initial evaluation to ensure compliance with common PiB-PET ADNI protocols. Amyloid imaging was performed with a bolus injection of ∼15 mCi of PiB. Dynamic acquisition consisted of either a 70-min scan starting at injection or a 30-min scan beginning 40 min post injection. For analysis, the PiB-PET data within the common time frame between 40 and 70 min was used. The ADNI PET Core verified that all PET images were acquired using the established protocol and substantially free of artifacts.\nEach subject's PET data were motion-corrected and registered to their MRI using methods described in detail elsewhere [11, 49] . For each participant, the T1-weighted MRI image was segmented into grey and white matter tissue maps. An inclusive binary gray matter mask was subsequently applied to the resulting atlas to obtain individual gray matter atlases. An automated quantitative image analysis approach was applied using regions of interest generated with FreeSurfer [14] using an in-house software previously described [36, 40, 54] . A regional spread function based approach for partial volume correction of PET data was subsequently implemented using FreeSurfer regions [48] to generate partial volume corrected regional PET data. Partial volume corrected PiB data were used to quantify PiB retention, as it was demonstrated to produce accurate results [53] .\nRegional partial volume corrected PiB retention data was evaluated in all FreeSurfer regions of interest in Standardized Uptake Value Ratio (SUVR) units, using the brainstem as reference, as this was reported as optimum quantification procedure for PiB-PET in DIAN studies [53] . Overall brain PiB retention was given by the mean cortical PiB retention, calculated as the average PiB SUVR across four cortical regions (prefrontal, gyrus rectus, lateral temporal, and precuneus) as previously used [44] . In addition, exploratory analyses were performed across forty-two bilateral regions of interest from the FreeSurfer atlas. PiB positivity was defined by a mean cortical SUVR uptake using partial volume corrected data and the brainstem as reference region ≥0.72 cutoff value, equivalent to an SUVR of ≥1.42 if using the cerebellar grey matter, as previously described [56] ."}, {"section_title": "Statistics", "text": "Normal distribution of the data was assessed by use of the Shapiro-Wilk test. Accordingly, statistical tests applied for cross-sectional group comparisons were either non-parametric (Kruskal-Wallis tests followed by pairwise comparisons with the Mann-Whitney U test) or parametric (analysis of variance [ANOVA] or analysis of covariance [ANCOVA] with age entered as covariate when relevant, followed by pairwise comparisons when appropriate, performed with the Student's t-test). The Bonferroni correction was applied to account for multiple comparisons.\nIn the longitudinal cohort, CSF αSyn levels did not follow a normal distribution and were therefore log-transformed to achieve normal distribution of the data for which parametric tests were used. Longitudinal changes were assessed using the repeated measures multivariate analysis of variance (MANOVA) approach, and correlation analyses were performed by use of the Spearman's rank correlation test on non-log-transformed data. Data is presented as mean ± standard deviation or as median with range (min-max). A p-value of ≤0.05 was considered statistically significant.\nIn order to compare CSF αSyn levels between subjects with AD pathological versus non-pathological CSF AD biomarker levels receiver operating characteristic (ROC) curve analyses were performed for the longitudinal cohort using the clinical status (cognitively healthy controls versus a baseline AD diagnosis) as the dichotomous variable to establish biochemical cutoff values. Cutoff values were determined based on the highest Youden index defined as sensitivity + specificity − 1.\nIn the DIAN cohort, CSF αSyn levels did not follow a normal distribution hence we log-transformed the data so that the association between αSyn with estimated years from symptom onset (EYO) was evaluated using the Pearson's correlation test. For brain PiB-PET imaging-related CSF αSyn analyses, linear regression was applied to predict regional PiB-retention as a function of CSF αSyn and EYO as independent variables, separately in ADAD mutation carriers and non-mutation carriers. The same linear regression model was applied after mutation carriers were stratified into asymptomatic (CDR < 0.5) and symptomatic (CDR ≥ 0.5) mutation carriers, as well as for the subset of PiB-positive asymptomatic mutation carriers. Additionally, in mutation carriers the interaction of αSyn and APOEε4 status (positive/negative) was investigated to elucidate whether the relationship of regional PiB retention and αSyn is influenced by APOEε4 status. Finally, regional PiB retention was modeled as a function of αSyn and EYO separately in APOEε4-positive and APOEε4-negative mutation carriers.\nAll statistical analyses concerning CSF αSyn levels and their association to parameters unrelated to brain imaging were performed in JMP software v.12.1.0 (SAS Institute Inc.). Statistical analyses regarding associations between CSF αSyn and amyloid PET data in the DIAN cohort were performed using the R v.3.1.0 software (The R Foundation for Statistical Computing, http://www.r-project.org/). Graphical representations of significant linear associations were obtained with the ggplot2 package v.1.0.1, as implemented in R. The significance level for all statistical tests and models was set at p ≤ 0.05. On the brain volumes, display of regression standardized β coefficients of the significant associations between CSF αSyn and regional PiB-PET were performed using BrainNet viewer [67] (http://www.nitrc.org/projects/bnv/) implemented in MATLAB."}, {"section_title": "Results", "text": "Descriptive statistics of the longitudinally followed cohort of sporadic patients\nThe demographics and clinical characteristics of the longitudinal cohort were in part previously published [45] and are shown in Table 1 . The control group was significantly older than the MCI and AD patient groups, thus age was added as a covariate when including control subjects in the statistical analyses. At the two-year follow-up 48% of the subjects diagnosed with MCI at baseline had progressed to an AD diagnosis (MCI-AD), whereas 52% remained stable (MCI-MCI). The patient dropout rate at 24-months was 17% of the MCI-MCI patients, 7% of the MCI-AD patients, and 15% of the AD patients. As expected, the Mini-Mental State Examination (MMSE) scores differed significantly amongst the investigated groups with AD patients displaying the lowest scores (p < 0.001). In comparison to controls all individual patient groups exhibited altered levels of CSF AD biomarkers including Aβ 1-42 , Aβ 1-40 , Aβ 42/40 , t-tau and p-tau. A much lower frequency of APOEε4 carriers was observed in the control group (38%) compared to the MCI (66%) and AD patient groups (82%) (p < 0.001).\nHigher baseline CSF αSyn levels in MCI patients converting to sporadic AD We first sought to compare CSF αSyn levels between the diagnostic groups. At baseline, MCI patients that after 24 months fulfilled the criteria for an AD diagnosis MCI = mild cognitive impairment MCI-MCI = MCI patients who remained MCI at the 24-month follow up MCI-AD = MCI patients who converted to Alzheimer's disease at the 24-month follow up MMSE = Mini-Mental State Examination score a = mean ± standard deviation b = median (minimum-maximum) c = P-value reflecting potential differences between the groups Controls, mild cognitive impairment and Alzheimer's disease d = χ 2 test e = one-way ANOVA f = Kruskal-Wallis test -= non-significant ** = p ≤ 0.01 *** = p ≤ 0.001 (MCI-AD) exhibited the highest CSF αSyn levels compared to controls (Fig. 1a) , while CSF αSyn levels did not significantly differ between controls and the non-converting MCI patients (MCI-MCI), and the AD group (Fig. 1a) . No differences in CSF αSyn levels were noted between the patient groups at either the 12-month (Fig. 1b) or 24-month (Fig. 1c) follow-ups.\nAssociation between APOEε4 and higher CSF αSyn levels in sporadic AD patients As APOEε4 is a common genetic risk factor for both synucleinopathies and AD [7, 10, 30] , we assessed the effect of APOEε4 on CSF αSyn levels. Within the MCI patient group APOEε4 carriers exhibited higher αSyn levels compared to non-carriers at the 24-month follow up (Fig. 2c) . Additionally, MCI-AD APOEε4 carriers exhibited higher CSF αSyn than non-carriers at the 12-month (Fig. 2e ) and 24-month ( Fig. 2f) follow-ups. The MCI-AD APOEε4 carrying patient group also exhibited significantly higher CSF αSyn levels at baseline compared to APOEε4 carrying MCI-MCI patients and controls (Fig. 3a) , while no differences in CSF αSyn were found at the 12-month follow up (Fig. 3b) . However, at 24-months MCI-AD APOEε4 carriers again had higher CSF αSyn than MCI-MCI APOEε4 carriers (Fig. 3c) . This difference in CSF αSyn levels was absent when comparing APOEε4 non-carrier patient groups at any time point (Fig. 3d-f ) . Intriguingly, the elevated CSF αSyn levels found in MCI-AD patients exhibited a dose-dependent relationship with the APOEε4 allele at all three time points (Fig. 4a-c) .\nTo assess any longitudinal changes in CSF αSyn levels occurring within-or between the patient groups we performed repeated measures MANOVAs spanning the intervals of: baseline to 12-months, baseline to 24-months, and 12-months to 24-months (Fig. 5) . When all patients (diagnosed with MCI or AD at baseline) were grouped as either APOEε4 carriers or non-carriers, APOEε4 carriers showed increasing CSF αSyn levels (+ 17%) from baseline to 12-months, followed by a decrease (− 10%) from 12-to 24-months (Fig. 5a ). Patients that did not carry the APOEε4 variant consistently exhibited a longitudinal decline in CSF αSyn levels which reached statistical significance between the 12-and 24-months examinations (Fig. 5a) , thus proposing potentially different pathological processes for APOEε4 carriers versus non-carriers. These findings prompted us to also subdivide the MCI-AD patient group into APOEε4 carriers or non-carriers. We found a significant increase in CSF αSyn (+ 5%) in MCI-AD APOEε4 carriers from baseline to 12-months, while also observing elevated CSF αSyn in MCI-AD APOEε4 carriers versus non-carriers from 12-to 24-months (Fig. 5b) . Moreover, when the MCI-AD patient group was further subdivided by APOEε4 zygosity we found significant differences in CSF αSyn levels from baseline to 12-months, and 12-to 24-months (Fig. 5c) . A significant difference between APOEε4 homozygotes, heterozygotes, and non-carriers was also found in the AD group between 12-months and 24-months (data not shown)."}, {"section_title": "Links between CSF αSyn, AD biomarkers and cognition in sporadic patients", "text": "In the absence of established brain imaging tools to assess ante-mortem αSyn burden in the brain, we assessed potential correlations between CSF αSyn levels and established fluid surrogate markers of AD pathology and global cognitive test scores. At baseline, 12-months, and 24-months CSF αSyn showed a positive correlation to CSF Aβ 1-40 , t-tau, and p-tau in all patient groups and controls ( Table 2 ). All MCI patients showed a marked a b c Fig. 1 CSF αSyn levels in sporadic MCI and Alzheimer's disease cohort. Quantification of CSF αSyn levels at (a) baseline, (b) 12-months and (c) 24-months in the four longitudinally diagnosed patient groups: control = cognitively healthy controls, MCI-MCI = MCI patients who remained MCI at the 24-month follow up, MCI-AD = MCI patients who converted to Alzheimer's disease at the 24-month follow up, AD = patients diagnosed with AD at baseline. P-values were calculated using a one-way ANCOVA of log-transformed data with age entered as a covariate with post-hoc testing by use of the student's t-test. Bonferroni correction was used to account for multiple comparisons (a: n = 6 comparisons, b-c: n = 3 comparisons). Results are displayed without log-transformation or age-correction (raw data) strengthening in the correlations of CSF αSyn to CSF Aβ 1-40 , t-tau, and p-tau between baseline and 12-months, and were the strongest in the MCI-AD group compared to all other groups at 12-months (Table 2 ). In MCI-MCI patients the correlations of CSF αSyn to CSF Aβ 1-40 and p-tau strengthened from baseline to 24-months, while the MCI-AD group exhibited the strongest correlation between CSF αSyn and t-tau (all above Spearman's ρ = 0.9 respectively) ( Table 2 ). The AD group exhibited a modest increase in the correlations between CSF αSyn and CSF t-tau and p-tau between baseline and 12-months, but showed weakening of the correlation between CSF αSyn and Aβ 1-40 over the same time interval. Additionally, at 24-months the AD group was the only group of patients at any time point to exhibit a significant correlation between CSF αSyn and Aβ . At 24-months however, the AD group exhibited the weakest correlations between CSF αSyn and the CSF AD biomarker panel. Intriguingly, our analyses revealed a significant association between CSF αSyn levels and cognition, in which higher CSF αSyn levels were significantly correlated to lower MMSE scores in the MCI-AD group at baseline (Table 2) ; moreover, the correlation was solely attributable to APOEε4 carrying MCI-AD patients (ρ=-0.607, p=0.005) (non-carrier ρ=-0.618, p=0.140).\nαSyn levels in sporadic patients with or without pathological CSF AD biomarkers\nThe MCI and AD patients enrolled in the longitudinal cohort were diagnosed according to clinical guidelines [34, 63] without workup of CSF AD biomarkers to support the clinical diagnosis, however, for research purposes the CSF biomarkers were assessed. With the rationale to compare CSF αSyn levels between patients with pathological versus without pathological CSF AD biomarker levels, we employed ROC analyses to produce cutoffs for the core CSF AD biomarkers Fig. 4 Cerebrospinal fluid αSyn levels in MCI-AD patients at: a baseline (non-carrier n = 7, heterozygous n = 9, homozygous n = 11), b 12-months (non-carrier n = 7, heterozygous n = 8, homozygous n = 11), and c 24-months (non-carrier n = 7, heterozygous n = 8, homozygous n = 9). P-values are presented first as uncorrected followed by Bonferroni corrected (a-c: n = 3 comparisons). In a P-values were calculated using the non-parametric Kruskal-Wallis with post-hoc testing by use of the Mann-Whitney U test. Bonferroni correction was used to account for multiple comparisons. In (b-c) P-values were calculated using the one-way ANCOVA with age entered as a covariate with post-hoc testing by use of the student's t-test. Results are displayed without age-correction (raw data). MCI-AD = MCI patients who converted to Alzheimer's disease at the 24-month follow up conventional ratios thereof [47] . We then stratified the patients into groups with and without pathological CSF AD biomarker levels (Fig. 6 ). Cutoffs were determined by comparing AD biomarker levels between cognitively healthy controls and AD patients at baseline. The resulting ROC axes were labeled as sensitivity and 1-specificity; the accompanying results table provided the individual cutoff values, sensitivity, specificity, and the area under the curve (AUC) with its respective 95% confidence interval (95% CI) (Fig. 6 ). The cutoff values (Fig. 6 ) for each CSF biomarker were then used to compare CSF αSyn levels between CSF AD biomarker negative (CSF(−)) a b c Fig. 5 Longitudinal assessment of mean CSF αSyn values at baseline, 12-months and 24-months in (a) a pooled MCI and Alzheimer's disease (AD) patient group classified as either APOEε4 carriers (baseline to 12-months n = 58, 12-months to 24-months n = 47) or non-carriers (baseline to 12-months n = 21, 12-months to 24-months n = 19). b the MCI-AD patient group classified as either APOEε4 carriers (baseline to 12-months n = 19, 12-months to 24-months n = 16) or non-carriers (baseline to 12-months n = 7, 12-months to 24-months n = 7), c the MCI-AD patient group classified as either APOEε4 non-carriers (baseline to 12-months n = 7, 12-months to 24-months n = 7), heterozygotes (baseline to 12-months n = 8, 12-months to 24-months n = 7) or homozygotes (baseline to 12-months n = 11, 12-months to 24-months n = 9). P-values within patient groups over 1-year intervals are shown in red along the trend lines, and between-group p-values are indicated in black. P-values were calculated using repeated measures MANOVA analysis of log-transformed data. MCI-AD = MCI patients who converted to Alzheimer's disease at the 24-month follow up and positive (CSF(+)) subjects within the diagnostic groups (Fig. 7) . When utilizing the cutoffs for CSF t-tau (> 470 pg/mL) and p-tau (> 71.6 pg/mL) in the MCI and AD patients, we discovered significant differences where CSF(+) patients had elevated αSyn compared to CSF(−) patients (Fig. 7e-f) . Additionally, the CSF p-tau/ Aβ 42 cutoff (> 0.126) applied in the AD patient group showed that the CSF(+) group had higher CSF αSyn than the CSF(−) group (Fig. 7c) ."}, {"section_title": "Descriptive statistics of DIAN participants", "text": "In the ADAD mutation carrying participants from the DIAN study, n = 6 APP, n = 33 PSEN1 and n = 3 PSEN2 mutations were represented (data not shown). Of the n = 92 included ADAD mutation carriers 34.8% had cognitive symptoms (CDR ≥0.5). Specifically, 37.5% of APP, 42.0% of PSEN1 and 11.1% of PSEN2 mutation carriers were symptomatic (Table 3 ). More than half of the PSEN2 mutation carriers carried the APOEε4 allele, whereas a quarter of the APP mutation carriers and less than 20% of the PSEN1 mutation carriers were APOEε4 carriers (Table 3) . In all three ADAD mutation groups, there was a higher percentage of APOEε4 carriers amongst the symptomatic mutation carriers (p < 0.01). Further, we found significant variability in the EYO, MMSE and CDR scores, and CSF levels of Aβ 1-42 , Aβ 42/40 , t-tau, and p-tau between ADAD mutation carriers and non-mutation carriers (Table 3) . When the three ADAD mutation carrier groups where subdivided into symptomatic (CDR ≥ 0.5) and asymptomatic (CDR < 0.5) individuals it was found that age of examination, EYO and MMSE scores as well as CSF Aβ 42/40 and CSF levels of t-tau, and p-tau significantly differed between symptomatic versus asymptomatic in APP mutation carriers (Table  3) . Age of examination, EYO, MMSE and CDR scores, CSF Aβ 42/40 , Aβ 1-42 , t-tau, and p-tau significantly differed between symptomatic and asymptomatic PSEN1 mutation carriers, while no differences could be observed in the PSEN2 mutation carriers due to insufficient sample size (Table 3) .\nCerebrospinal fluid αSyn levels in ADAD mutation carriers are related to onset of cognitive symptoms\nAfter pooling all individual gene mutations into their respective groups (APP, PSEN1 and PSEN2 mutation carriers) we compared the CSF αSyn levels between the three groups and found no significant differences between the groups of ADAD mutation carriers or versus non-mutation carriers (Fig. 8a) . Upon subdividing the ADAD mutation carriers into either asymptomatic or symptomatic individuals we found that symptomatic mutation carriers had higher CSF αSyn compared to non-mutation carriers (Fig. 8b) ; no further differences were found when APOEε4 status was included as a covariate (data not shown). Importantly, the temporal trajectory of CSF αSyn versus EYO showed a weak-to-moderate increase in both ADAD mutation carriers (Pearson's R = 0.20; p = 0.056) and in non-carriers (Pearson's R = 0.31; p = 0.032), where the confidence bands around both trajectories showed a substantial overlap (Fig. 8c) ."}, {"section_title": "Cerebrospinal fluid αSyn and AD biomarker associations in the DIAN cohort", "text": "To assess links between CSF αSyn levels and AD brain pathology using surrogate CSF AD biomarkers in the DIAN participants we investigated potential correlations between CSF αSyn and CSF levels of Aβ 1-42 , Aβ 1-40 , Aβ 42/40 , t-tau, and p-tau in ADAD non-mutation carriers and the three ADAD mutation carrier groups sorted into asymptomatic and symptomatic subgroups (the n = 2 PSEN1 symptomatic patient group was excluded from analysis) ( Table 4) . We found no correlations between CSF αSyn and Aβ 1-42 when combining asymptomatic and symptomatic ADAD mutation carriers, but did find a positive correlation between CSF αSyn and Aβ 1-40 in non-mutation carriers, and both asymptomatic and symptomatic APP and PSEN1 mutation carriers. Inverse correlations between CSF αSyn and Aβ 42/40 were found in symptomatic APP and PSEN1 mutation carriers, but most notably in the symptomatic APP mutation carrier group (Table 4) . There were strong positive associations between CSF αSyn and t-tau in ADAD non-mutation carriers and in all three mutation carrier groups, both asymptomatic and symptomatic, with the strongest correlations found in asymptomatic PSEN1 and symptomatic APP mutation carriers (Table 4) . Asymptomatic PSEN1 mutation carriers also exhibited a significant positive relationship between CSF αSyn and p-tau while both non-mutation carriers and PSEN2 mutation carriers demonstrated a significant positive correlation between CSF αSyn and p-tau levels."}, {"section_title": "Associations between brain Aβ plaque load and CSF αSyn in the DIAN cohort", "text": "Data from PiB-PET examinations reflecting in vivo amyloid plaque burden were available for n = 132 of the DIAN participants (dataset freeze 10). The frequency of PiB-positive ((SUVR/brainstem) ≥0.72) subjects was; 49.1% (28/57) of asymptomatic mutation carriers, 89.3% (25/28) of symptomatic mutation carriers, and 4.3% (2/47) of non-mutation carriers. As expected, PiB-retention increased with EYO in mutation carriers, while no significant increase was noted in non-mutation carriers (data not shown). Potential associations between CSF αSyn levels and in vivo amyloid plaque burden in subjects from the DIAN cohort were investigated by analyzing the linear regressions of mean cortical PiB-retention versus CSF αSyn in ADAD mutation carriers and non-mutation carriers separately, as well as stratifying mutation carriers into asymptomatic and symptomatic groups, adding EYO as independent predictor in all regression models; these four models resulted in no significant associations between mean cortical PiB and αSyn (Table 5) Fig. 9a in which the regional regression β coefficients are displayed on a 3D brain surface. The strongest associations between CSF αSyn and amyloid plaque load in PiB-positive asymptomatic ADAD mutation carriers were found in regions including the posterior cingulate, superior temporal and frontal (Fig. 9a) . A potential effect of APOEε4 on the association between PiB and αSyn in ADAD mutation carriers was assessed by the linear regression model: Mean cortical PiB~αSyn + APOEε4 + EYO + αSyn*APOEε4, and results are presented on Table 5 . The interaction of αSyn*APOEε4 was significant, indicating that the relationship between PiB-retention and αSyn is different in APOEε4-positive than in APOEε4-negative ADAD mutation carriers. In APOEε4-positive ADAD mutation carriers, there was a strong positive association between αSyn and mean cortical PiB (β = 0.39, p = 0.032) ( Table 5 ), while this association was not significant in APOEε4-negative mutation carriers (β = − 0.10, p = 0.348) (data not shown). Exploratory positive associations between αSyn and regional PiB in APOEε4-positive ADAD mutation carriers in the 42 regions of interest are illustrated on the 3D brain display, showing strong associations in regions including the superior temporal, anterior and posterior cingulate, parietal and frontal regions (Fig. 9b) . The CSF αSyn-APOEε4-PiB relationship was specific and could not be replicated by replacing CSF αSyn with CSF t-tau levels (data not shown).\nThe positive significant associations between CSF αSyn and regional amyloid plaque load in PiB-positive asymptomatic ADAD mutation carriers are illustrated in Fig. 10 in regions of early amyloid plaque deposition within the frontal and temporal lobes (Fig. 10a-b) , contrasting with respective negative associations observed in few regions in the symptomatic mutation carriers, mostly restricted to areas of late amyloid plaque deposition including paracentral and postcentral regions (Fig. 10c-d) ."}, {"section_title": "Discussion", "text": "The role of αSyn in the context of AD pathophysiology is unknown. In this study we set out to investigate the Fig. 8 CSF αSyn levels quantified in participants from the DIAN cohort. a CSF αSyn levels grouped by ADAD gene mutation. b CSF αSyn in ADAD non-mutation carriers versus asymptomatic and symptomatic ADAD mutation carriers. Data point coloring represents the three ADAD genes as shown in (a). P-values are presented first as uncorrected followed by Bonferroni corrected (a-b: n = 3 comparisons). P-values calculated using the nonparametric Kruskal-Wallis test and a Bonferroni correction was used to account for multiple comparisons. c Correlation between CSF αSyn and the estimated years from symptom onset (EYO) in ADAD mutation carriers and non-mutation carriers; correlations are calculated using Pearson's correlation test after log-transformation of the CSF αSyn data and results are displayed without log-transformation or age-correction (raw data)\nrelevance of αSyn to both sporadic and familial AD by examining CSF levels of αSyn and potential associations to various AD disease parameters including cognition, CSF AD biomarkers, and in familial AD patients we also assessed potential relationships between CSF αSyn and brain amyloid plaque burden. Although the significance of CSF αSyn levels to brain parenchymal αSyn levels are still unknown, mainly due to the lack of ante-mortem αSyn brain imaging tools, we anticipate that CSF αSyn fluctuations mirror αSyn alterations in the brain. We studied subjects with MCI, sporadic AD and ADAD in order to pinpoint any potential pre-clinical, prodromal, or mid-to late stage disease pathways linking αSyn to AD pathogenesis. We further explored the impact of the AD risk allele APOEε4 on the identified associations. Numerous studies have reported αSyn pathology in approximately 50-60% of autopsied AD patients [1, 16, 31] . Patients with mixed pathologies as well as animal models expressing combined AD and αSyn pathologies tend to exhibit amplified deterioration, typically enduring more severe symptoms and shorter survival rates [9, 41] . Interestingly, Wirths and colleagues described co-accumulation of αSyn in Aβ plaques and dystrophic neurites only in patients with the Lewy body variant of AD rather than in 'typical AD' cases [65] . Furthermore, results from another study of 147 neuropathologically confirmed AD cases suggested that the majority of AD patients who exhibited very few or no neocortical neurofibrillary tangles, termed 'plaque-only AD' , exhibited Lewy body αSyn pathology, while patients with the Lewy body variant of AD were found to be 'plaque-only AD' cases, hence, 'plaque-only AD' and Lewy body variant AD were diagnostically indistingushable from one another [17] . Currently, the mechanisms driving comorbid αSyn and AD pathologies have yet to be elucidated making it impossible to predict comorbidity or to diagnose patients ante-mortem, however, we speculate that altered CSF αSyn may be a predictive feature of AD patients that already are harboring or that will develop αSyn co-pathology.\nThe identification of a molecular interaction between presenilin 1 (PS1), encoded by the PSEN1 gene, and αSyn was suggested to in part explain the clinical and pathophysiological overlaps between AD and synucleinopathies like DLB [64] . The relevance of this molecular interaction was illustrated by two previous reports demonstrating a strong association between ADAD-causing PSEN1 mutations and Lewy body pathology specifically in the amygdala [29, 31] . With a direct interaction between αSyn and PS1, the latter of which is a key player in Aβ peptide production [8] , it is tempting to speculate that αSyn may have a modulatory role in Aβ production and/or deposition. In support, our current study revealed an association between higher CSF αSyn levels and amyloid plaque burden in several brain areas of PiB-positive asymptomatic ADAD mutation carriers. [44] , exhibited a striking overlap with the brain regions for which we found significant positive correlations between CSF αSyn and PiB-retention. Similarly, a recent study of cognitively normal individuals with subjective memory complaints documented a positive association between CSF αSyn concentrations and brain Aβ deposition [59] . Rather surprisingly, our identified relationship between CSF αSyn levels and Aβ deposition in presymptomatic ADAD patients was not paralleled by any significant correlations between CSF αSyn and Aβ 1-42 levels. Instead, CSF αSyn levels were consistently positively associated with CSF Aβ 1-40 levels levels across all studied groups. The relevance of CSF Aβ in the presymptomatic stage of AD, during which Aβ deposition occurs, remains to be determined.\nIn support of our own results [61, 62] and those reported by other groups [60] we further identified strong positive correlations between CSF αSyn and CSF t-tau and p-tau in both studied cohorts. By stratifying the studied sporadic MCI and AD patients based on pathological CSF AD biomarker levels, we found elevated CSF αSyn levels in patients that exhibited pathological CSF tau but not Aβ levels. Similar to CSF levels of tau, CSF αSyn levels were previously proposed to potentially function as a marker of synapse loss and neurodegeneration [43] , however the lack of significantly altered levels of CSF αSyn in AD does not support this notion. A direct link between αSyn and tau pathology was instead suggested by findings showing that αSyn promotes GSK-3β-mediated tau phosphorylation [25] . The authors of the same study further demonstrated that αSyn directly interacted with both tau and GSK-3β. Another in vitro study employing rat PC12 cells demonstrated that extracellular αSyn in fact was involved in GSK-3β-mediated hyperphosphorylation of tau [15] . In a b c d Fig. 10 Significant associations between CSF αSyn and regional PiB-retention in PiB-positive asymptomatic (CDR < 0.5, n = 28) ADAD mutation carriers (blue) and in symptomatic (CDR ≥0.5, n = 25) ADAD mutation carriers (purple) . The significant associations between CSF αSyn and PiB are represented by the standardized β coefficient corresponding to independent predictor αSyn in the linear regression model for PiB~αSyn + EYO, where EYO is estimated years from symptom onset, in four brain regions (a-d)\ncognitively intact control subjects we found strong positive correlations between levels of CSF αSyn and both t-tau and p-tau, which in our view may challenge the notion that the relationship between αSyn and tau is indeed pathological. Due to our findings of a consistent correlation between CSF αSyn and tau levels across diagnostic groups including healthy controls, we speculate that the this association might be due to non-conventional exosome-related release mechanisms [12, 51] for both tau and αSyn, without any clear disease association. The exact relevance of the described seemingly robust relationship between levels of CSF tau and αSyn requires clarification, preferably in future studies assessing potential links between CSF αSyn and ante-mortem tau pathology using novel tau tracers and imaging techniques [50] . With the APOEε4 allele as a common denominator in terms or risk of disease for both AD and DLB [7] we were interested in assessing potential effects of this gene variant on CSF αSyn levels in the investigated cohorts. In subjects from the MCI-AD diagnostic group who exhibited elevated CSF αSyn levels compared to controls at baseline, homozygous APOEε4 carriers exhibited the highest CSF αSyn levels. This observation was absent in AD patients and control subjects. Hence, we observed an effect of the APOEε4 variant on CSF αSyn levels in the prodromal phase of sporadic AD, but no effect once patients were clinically diagnosed with AD. When considering any effect of the APOEε4 allele in ADAD mutation carrying DIAN participants, we found no differences in CSF αSyn between APOEε4 positive versus APOEε4 negative participants, or within the APP, PSEN1 or PSEN2 mutation carrying groups. However, presymptomatic Aβ deposition in ADAD mutation carriers was positively associated with CSF αSyn levels only in APOEε4 positive subjects. We hypothesize that an association between CSF αSyn and Aβ deposition at the presymptomatic stage of AD may be further supported by the APOEε4 variant which in previous studies has been shown to promote Aβ deposition even in cognitively intact individuals [40] .\nThe regulatory mechanisms governing αSyn levels in brain parenchyma and CSF are unknown. However, there is a clear difference between CSF αSyn levels in AD patients and those with synucleinopathies, where patients afflicted with the latter disorders consistently exhibit reduced levels [18, 24, 38, 39, 56, 57] suggesting a disease-specific process that disrupts the balance between the intracellular and extracellular pools of αSyn. Kallikrein-6, also called neurosin, is one of few reported extracellular proteases shown to cleave αSyn [52, 55] . Increasing the expression of kallikrein-6 in the brains of a mouse model of Lewy body disease promoted αSyn clearance and reduced αSyn pathology [52] . Further, we have shown that patients with synucleinopathies not only exhibited low CSF αSyn levels but also reduced levels of kallikrein-6 [62] . Thus, our previous results combined with those from animal studies suggest that an imbalance between αSyn and kallikrein-6 may promote synucleinopathy. Recently we also reported that the AD and MCI-AD patients examined in the current study did not exhibit altered levels of CSF kallikrein-6 compared to controls, whereas MCI-MCI patients had slightly lower CSF kallikrein-6 levels compared to controls [45] . Hence, the elevated CSF αSyn levels observed in the MCI-AD group were not paralleled by increased kallikrein-6 levels suggesting a potential imbalance between kallikrein-6 and αSyn in this group.\nWe conclude, CSF αSyn levels alone appear unfit to serve as a diagnostic marker for AD however higher CSF αSyn concentrations were associated with the progression from MCI to sporadic AD, and with the development of symptoms in subjects carrying ADAD mutations. Although not paralleled by significant correlations with CSF Aβ 1-42 , higher levels of CSF αSyn in the presymptomatic stages of ADAD were associated with Aβ plaque burden in several brain regions known to accumulate Aβ pathology during early stages of AD development. The presence of an APOEε4 allele in sporadic AD cases appeared to promote higher CSF αSyn levels which may accelerate the processes linking αSyn to Aβ deposition in AD. The APOEε4 allele may be involved in molecular processes governing CSF αSyn levels, which in turn appear associated with the presymptomatic build-up of Aβ plaque burden in the brain during AD development. Future studies assessing αSyn in paired CSF and autopsied brain tissues are needed in order to decipher the relevance of altered CSF αSyn levels in the pathophysiology of AD. "}]