[{"section_title": "Abstract", "text": "Alzheimer's disease (AD)-a complex disease showing multiple pathomechanistic alterations-is triggered by nonlinear dynamic interactions of genetic/epigenetic and environmental risk factors, which, ultimately, converge into a biologically heterogeneous disease. To tackle the burden of AD during early preclinical stages, accessible blood-based biomarkers are currently being developed. Specifically, next-generation clinical trials are expected to integrate positive and negative predictive blood-based biomarkers into study designs to evaluate, at the individual level, target druggability and potential drug resistance mechanisms. In this scenario, systems biology holds promise to accelerate validation and qualification for clinical trial contexts of use-including proof-of-mechanism, patient selection, assessment of treatment efficacy and safety rates, and prognostic evaluation. Albeit in their infancy, systems biology-based approaches are poised to identify relevant AD \"signatures\" through multifactorial and interindividual variability, allowing us to decipher disease pathophysiology and etiology. Hopefully, innovative biomarker-drug codevelopment strategies will be the road ahead towards effective disease-modifying drugs."}, {"section_title": "Original article", "text": "Systems biology blood biomarkers in AD trials -Hampel et al mensional quantitative datasets; and (ii) to examine the relationships between components using computational modeling. 3 The analysis of large and heterogeneous datasets poses a novel data analytical and modeling challenge, where the number of observations (n) is significantly smaller than the number of attributes (p). 4 This issue is even more prominent in systems biology using broad omic data. In this context, an unsupervised Formal Concept Analysis method, based on Galois lattices, may be used to extract all logical relations, and limit over-fitting issues. 5 Systems biology is currently regarded as an exploration tool for neurodegenerative diseases, including AD, that has the potential to discover new fundamental insights. While the current state of truly integrative systems-level semantic knowledge of preclinical AD is still in its infancy, when combined with valid and reliable biomarker discovery and validation, Systems biology will be a cornerstone for precision medicine. [6] [7] [8] Notably, since AD shows peripheral manifestations, it may serve as an ideal use-case for systems biology. Multiple systems are affected in AD, including systemic immune response and inflammation, 9, 10 renal and hepatic clearance, 11, 12 lipid and glucose metabolism, [13] [14] [15] and xenobiotics from gut microbiome. 16, 17 Moreover, intercellular communication systems-including the glymphatic system 18, 19 and extracellular vesicles 20, 21 -have been reported. The study of peripheral blood-an easily accessible, information-rich matrix in which these complex systems can be interrogated-is expected to expand our knowledge of the systems biology of AD. 22, 23 There are a growing number of studies investigating single omics levels (genomic/epigenomic, transcriptomic, proteomic, and metabolomic) of preclinical AD and many of these studies tell a consistent story within individual omic levels. Here, we attempt to concisely summarize the general convergent findings at each level. Since the initial identification of the ε4 allele of the gene encoding apolipoprotein E (APOE ε4) as a risk gene variant for AD, 24 numerous large-scale genome-wide association studies (GWAS) and meta-analyses of GWAS have been performed. [25] [26] [27] Moreover, recent studies using whole-exome sequencing, "}, {"section_title": "Systems biology blood biomarkers in AD trials -Hampel et al", "text": "whole-genome sequencing, and targeted sequencing have led to the identification of rare variants in other novel lateonset AD genes. 26 Besides the three identified causal gene mutations (amyloid precursor protein [APP], presenilin 1 and 2 [PSEN1 and PSEN2]) for autosomal dominant earlyonset AD, more than 40 susceptibility genes/ loci have been identified for late-onset AD. 26 Most of these genes encode for functional pathways that are not obviously related to the primary amyloid β (Aβ) and tau proteopathy. Accordingly, they are involved in orthogonal pathways such as immune response and inflammation (eg, ATP-binding cassette transporter A7 [ABCA7]), synaptic function (eg, Myc box-dependent-interacting protein 1 [BIN1]), and lipid metabolism (eg, phospholipase D3 [PLD3]). This list will surely be enlarged in the future as more genes/loci are discovered. For instance, a recent meta-analysis of AD on 9751 samples from Norway and the International Genomics of Alzheimer's Project (IGAP) identified four novel risk loci: heparan sulfate-glucosamine 3-dulfotransferase 1 (HS3ST1), immunoglobulin heavy variable 1-68 pseudogene (IGHV1-68), USP6 N-terminal like (USP6NL)/enoyl-CoA hydratase domain containing 3 (ECHDC3), and benzodiazepine receptor associated protein 1 (BZRAP1-AS). 28 Transcriptomics involves the measurement and study of the complete set of RNA transcripts, produced by the genome, and affecting protein expression and other cellular operations. 29 Whole-transcriptome sequencing (RNAseq) technology, using blood leukocytes, is a promising nextgeneration approach that has advantages for clinical trials. RNAseq is very efficient and has a broad range of detection. 30 Transcript expression goes beyond genome expression, reflecting state dependent demands on the organism, including long-noncoding RNAs (lncRNAs) and micro RNAs (miRNAs). Transcriptomic analysis can provide greater biological resolution viewed as coexpression networks 31 that may be more valid and reliable for measuring perturbations of AD-relevant metabolic pathways. 32 To date, transcriptomic studies in AD revealed alterations in lncRNA and miRNA expression reflecting aging and AD-related alterations in synaptic function, 33 neurovascular coupling, 34 immune response, 35 and energy metabolism and mitochondrial function. 36 Proteins are the key functional molecules in biological systems providing structural, functional, and regulatory control of cells, tissues, organs, apparatuses, and systems. Proteins change in response to the demands of the organism in real time and, as a result, the proteome is dynamic. While early attempts at measuring the key proteopathy of AD have been disappointing, 37 recent attempts using newer technologies have been more successful. 38 Accordingly, numerous studies showed consistent alterations of immune, 39 inflammatory, 40 neurotrophic, 41 and vascular-related proteins that may be promising candidates for proteomic blood biomarkers.\nThe metabolome consists of low-molecular weight compounds representing the end products of metabolism. With the advent of high-resolution mass spectrometry-based technologies over the past decade, numerous blood metabolomic AD markers have been reported, including those reflecting immune response, 42 neurotransmitter biosynthesis 43 lipid and energy metabolism, 44 and oxidative stress. 45 While the major findings highlighted above suggest several compelling lines of biological dysfunction, it is clear that integration across the multiple levels of inquiry will yield much more information about the global processes involved in the preclinical AD state. Consequently, there is scientific rationale for creating multiomics panels which span multiple levels of systems biology to yield more reliable and informative properties. Although relevant approaches are emerging, 46,47 the ultimate success of using systems-level biomarkers in clinical trials will depend on the construction of robust multiomic panels and their implementation by translational scientists. 48\ninfectious disease). This multistep path can facilitate and optimize the early diagnosis of disease. 49 The first steps necessary for developing blood-based biomarkers for AD diagnosis should aim at establishing the specific contexts of use (COUs), \"a statement that describes the manner and purpose of use for the biomarker in drug development\"( Table I) . 50\nmedicine approaches, either in prevention or dementia-stage trials, according to precision medicine. Current anti-Aβ trials require evidence of brain or CSF Aβ pathology as inclusion criteri for AD patients. 61 Emerging blood biomarker candidates showed promise for predicting the presence of Aβ pathology in the brain concordant with results shown by amyloid positron emission tomography (PET) investigations. 38 These tests might be used to identify patients eligible for anti-Aβ trials, either directly or more likely as a prescreen. This approach is useful to target other aspects of AD pathophysiology, and, if biomarkers (and treatments) are being developed successfully, they could then serve to guide treatment decisions (ie, \"biomarker-guided therapy\" with \"theragnostic\" biomarkers).\nAD-like Aβ pathology represented a positive development in this direction. 79, 80 The repeated failures of several potential disease-modifying drugs in Phase III clinical trials led to question the right target and the Aβ hypothesis. 81 However, it should be considered that, frequently, AD patients recruited for clinical trials were already at a too advanced and potentially irreversible (decompensated) clinical stage of the disease (systems failure) and were not precisely selected using validated and qualified biomarkers. 75 Nevertheless, the case remains that late-stage therapies are likely bound to show only minimal effects or fail. 82 Therefore, early preclinical disease stage therapeutic trials focusing on Aβ, tau protein, and other disease-aggravating targets would probably have a better chance of delaying/halting AD-related pathophysiology.\nAccording to this scenario, defining and validating appropriate biomarkers is crucial for obtaining an early diagnosis of AD and assess the efficacy of disease-modifying drug treatments for AD, 83, 84 as stated by the FDA and by the Euro-pean Medicines Agency (EMA). 85 The recent revision of the diagnostic criteria developed by the National Institute on Aging and the Alzheimer's Association (NIA-AA) Working Group shifts the definition of the AD \"construct\" from symptomatic to biological and, specifically, introduces the use of biological markers-in the \"A/T/N\" classification schemeas the new criteria reflecting AD pathophysiology. 86 The framework of the A/T/N scheme includes both a CSF and a neuroimaging biomarker in each of the three biomarker groups to identify the preclinical stage of AD and predict the following cognitive decline. 86 In particular, \"A\" refers to biomarkers of Aβ pathology, ie, the 42-amino acid-long Aβ peptide (Aβ 1-42 ) in the CSF or amyloid PET); \"T\" refers to biomarkers of tau pathology, ie, CSF phospho tau (p-tau) or tau PET; \"N\" refers to biomarkers of neurodegeneration or neuronal injury, ie, CSF total tau (t-tau), 18 F-fluorodeoxyglucose [FDG]-PET ( 18 F-FDG-PET), or structural magnetic resonance imaging (MRI). These advanced unbiased biological criteria are required to better design clinical trials aimed at identifying disease-modifying compounds. 86 \nWhen referring to both drug development and clinical trials, high costs, insufficient accessibility, and invasiveness of CSF biomarkers need to be critically assessed compared with blood-based biomarkers. 5 Once validated in independent large-scale cohorts, blood-based biomarkers will likely play a critical role to recognize-as early as in primary care settings-individuals with high risk of an early AD stage and to send these individuals to specialized centers where a confirmatory diagnosis can be done and the \"A + / T + /N + biomarker profile can be established. 86 The usefulness of blood-based biomarkers further increases when we consider the possibility that disease-modifying compounds, currently in Phase II/III clinical trials (eg, BAN2401 [Eisai], Aducanumab [Biogen] or Gantenerumab [Hoffmann-La Roche], or anti-tau therapies), might be approved in the coming future. In this scenario, blood-based biomarkers will increase the probability to get access to these treatments and will provide a fast and cost-effective rapid test to detect AD and, then, establish the eligibility of patients for inclusion into new clinical trials with new \"potential\" disease-modifying drugs.\nWhen considering the specific context in drug development, blood-based biomarkers should be validated and qualified for a specific COU, including assessment of mechanism of action (target engagement), dose optimization, efficacy maximization, and monitoring of both drug response and safety. 50, 85 Once a blood-based biomarker is validated for all or some of the above mentioned COUs, it can be implemented in clinical trials, designed to identify disease-modifying agents, and combined with specific neuropsychological tests assessing both episodic memory and other relevant cognitive domains (ie, executive dysfunction). 76 Different blood-based biomarkers have been studied in the last 5 years, although preliminary evidence of validation is available only for the Aβ 1-42 /40-amino acid-long Aβ peptide (Aβ 1-40 ) ratio, the β-site amyloid precursor protein cleaving enzyme 1 (BACE-1), t-tau, and p-tau. 50 Recent studies using ultrasensitive analytical assays (Single Molecule Array [SiMoA TM ] platform) and fully automated immunoassays showed that plasma Aβ 1-42 concentrations and, particularly, the Aβ 1-42 /Aβ 1-40 ratio predict the risk of progression to mild cognitive impairment (MCI) or dementia in cognitively normal individuals. 88 Recent studies showed that preconcentration of plasma Aβ peptides via immunoprecipitation substantially facilitated their immunological measurements. 89 Plasma Aβ 1-42 concentrations and Aβ 1-42 /Aβ 1-40 ratio correlate with conventional and validated AD biomarkers essential to detect an A + /T + /N + biomarker profile, 38,88,90,91 such as CSF Aβ 1-42 concentrations and brain Aβ deposition (as assessed by PET). 88, 90 The inverse correlation found between plasma Aβ 1-42 reduction and brain Aβ deposition might be useful for future clinical trials using monoclonal antibodies directed against Aβ (ie, Aducanumab). Indeed, the decrease of plasma Aβ 1-42 concentrations can predict Aβ positivity in subjective cognitive decline, MCI, and AD dementia. 90 In this regard, decreased plasma Aβ 1-42 and increased nerve growth factor precursor (proNGF) concentrations combined with inflammatory biomarkers predict the worsening of \"latent\" AD pathophysiology and the subsequent cognitive decline in Down syndrome. 93 The ability of Aβ 1-42 /Aβ 1-40 ratio to predict cognitive decline might be useful not only for early diagnosis, but also to monitor disease evolution differently from CSF Aβ 1-42 , which is stable over time and not useful for predicting disease progression. 85, 94 This novel evidence, when validated in long-term longitudinal (24 to 36 months) studies involving large cohorts, will be crucial to identify the specific COU of Aβ 1-42 /Aβ 1-40 ratio as a novel biomarker to assess the mechanism of action of disease-modifying drugs on the target Aβ (target engagement). We can hypothesize that a disease-modifying drug able to bind Aβ will prevent both plasma Aβ 1-42 reduction and brain Aβ deposition as well as related subsequent brain atrophy and cognitive decline.\nAnother approach is to demonstrate target engagement of drugs affecting Aβ processing such as γ-secretase modulators or BACE-1 inhibitors. 85 Plasma BACE-1 concentrations are higher in MCI individuals who progressed to AD, over a 3-year follow-up, compared with stable MCI. 95, 96 Plasma BACE-1 activity can predict disease progression; however, this novel COU needs to be validated in independent clinical trials.\nWhen moving to the \"tau scenario\" of AD, recent highly sensitive immunoassays have been assessed for their potential in using plasma t-tau as a reliable blood-based biomarker for subject/patient selection (screening in primary setting) and AD prognosis. 50, [97] [98] [99] It is known that: (i) plasma t-tau concentrations are significantly increased in AD patients compared with controls 100 ; (ii) blood-\nbased p-tau is increased in AD patients and MCI individuals compared with controls 101-103 and plasma p-tau 181 is a more sensitive and specific predictor of elevated brain Aβ deposition than t-tau 104 ; (iii) high baseline concentrations of plasma t-tau in the Alzheimer's Disease Neuroimaging Initiative (ADNI) cohort correlated with increased rates of atrophy (as assessed by MRI), hypometabolism (as assessed by 18 F-FDG-PET), and the consequent cognitive decline 98 ; (iv) higher baseline concentrations of plasma t-tau in MCI individuals are associated with greater cognitive decline at 15 months not correlating with brain Aβ deposition. 105 Whether the increased concentrations of plasma t-tau can be considered a specific biomarker for AD or just a prognostic marker for nonspecific cognitive decline is still debated. 85 Recently, Chen and colleagues, using a highly sensitive detection platform combined with antibodies directed against the N-terminus of tau protein, found that N-terminal-detected tau (NT1) in plasma was able to discriminate between controls and AD or MCI-AD patients. Plasma NT1 did not predict disease progression, but it could be considered a potential blood-based screening test for AD/AD-MCI useful to improve the selection of individuals eligible for clinical trials and to assess the clinical efficacy of tau-directed immunotherapies. 106 Overall, the above considerations indicate a COU for bloodbased biomarkers for better patient selection in clinical trials designed to assess the efficacy of investigative disease-modifying drugs. 50 This is a prospective scenario given the slow evolution of cognitive decline (12 to 24 months) in early AD, as indicated by psychometric test data. As a consequence, well-validated blood-based biomarkers, integrated into a single panel, will help examine target druggability and resistance mechanisms, thus increasing the predictability of cognitive outcome changes in response to drug treatments. This innovation will enable to reduce costs and resources required by clinical trial pipelines. 107\ngroup. In such cases, studying both biomarker-positive and -negative patients will be necessary to obtain regulatory approval for the use of the drug only in a biomarker-identified subgroup.\nTo foster investigation of targeted therapies using predictive biomarkers, regulators are prepared to discuss and advise on new, more sensitive end points as well as on statistical and pharmacometric modeling.\nblood-based tests for AD detection and diagnosis will be rapidly available, inexpensive, and easy to implement. 118 Supporting the international Alzheimer Precision Medicine Initiative (APMI) (available at: https://www.apmiscience. com/) and its cohort program (APMI-CP), 119 the Blood-Based Biomarker Interest Group (BBBIG) has been created to provide global standards and best practices for the assessment of blood-based biomarkers. In a multistage diagnostic process, it is envisioned that blood-based biomarker tests would provide the screening entry point preceding further second-stage CSF analysis, MRI, and PET neuroimaging. Further profiling steps, based on genomic/epigenomic exploratory analyses, may be implemented as part of multimodel interventions targeted to specific biologically defined patient subgroups. 118 There are many potential COUs for AD biomarkers including, but not limited to, identification of AD risk, risk for progression from MCI to AD, population screening, stratification into clinical trials, disease monitoring, pharmacodynamics, monitoring of individual safety and tolerability or treatment response monitoring. 120 With regard to the heterogeneous AD spectrum, blood-based biomarkers are particularly useful to specifically select individuals with Aβ pathology, using the Aβ 1-42 /Aβ 1-40 ratio. 121 The FDA recently granted Breakthrough Device Designation for a brain amyloidosis blood test to screen for risk of AD. 122 If approved, it would be the first blood-based screening test to predict brain amyloid PET scan results in adults with memory complaints or dementia.\nIt is conceivable that other blood-based biomarkers will indicate and identify individuals with more acute and faster disease progression (eg, NFL or tau and, possibly, an inflammatory biomarker, such as YKL-40). 123 In this respect, the selection of individuals into a clinical trial will be enhanced using pathophysiological blood-based biomarkers identifying patients at risk for progression and "}, {"section_title": "Contexts of use for blood-based biomarkers", "text": "Blood (plasma/serum) is unquestionably the most appropriate biological matrix for use in large exploratory studies. Given the benefits of blood-based biomarkers in terms of cost-and time-effectiveness, compared with the use of cerebrospinal fluid (CSF) or neuroimaging biomarkers, blood-based biomarkers can serve as the first step in a multistage approach similarly to the processes employed in other diseases (eg, cancer, cardiovascular disease, and Blood-based biomarkers may help tackle the burden of Alzheimer disease during early preclinical stages"}, {"section_title": "Diagnostic", "text": "A diagnostic biomarker would help distinguish AD patients from individuals with normal cognitive aging. Ideally, it would differentiate AD and other dementias as well. Currently, this can be challenging without the use of lumbar puncture, 51,52 expensive brain imaging, 53 or post-mortem histopathology. 54 It would also have to complement the diagnostic routines that are currently available in primary or in secondary health care. Each of these settings should be considered as two separate COUs due to differences in patients and routines. Diagnostic blood-based biomarkers for AD have been the most researched COU to date. 50, 55 Despite primary health care being by far the largest potential application area, most study populations are not representative of this setting. 49, 50 Population screening Screening for AD or for future risk of AD in the general population would have to meet the Wilson and Jungner general screening criteria, 56 requiring, for example, that: (i) useful treatments exist; (ii) facilities for diagnosis and treatment exist; (iii) an agreed definition of on who to treat as a patient to avoid \"diagnosis creep\" exists 57 ; (iv) the test is accurate enough so that the cost of false positives does not outweigh the benefits of the test. Presently, none of these criteria are fully addressed."}, {"section_title": "Stratification into clinical trials", "text": "Biomarkers that have been or could be accurately measured in blood are already used to define eligibility for prevention trials. For example, in familial AD, the presence of a diseasecausing mutation is an eligibility criteria for many trials. 58, 59 Genetic variants associated with late-onset AD increase the overall disease prevalence, but have poor disease penetrance. Certain gene variants, however, including APOE ε4, significantly increase the probability of developing AD; they have been used as eligibility criteria for clinical trials (available at: http://clinicaltrials.gov/show/NCT02565511 and http://clinicaltrials.gov/show/NCT03131453).\nThe idea is that selecting patients at high risk of cognitive decline in prevention trials can greatly increase power to detect treatment efficacy. 60 In the future, more complex and accurate blood tests may be used for this purpose. Additionally, target treatments tailored to specific genetic variants or blood profiles should be pursued to develop stratified"}, {"section_title": "SETTING(S) CONTEXT(S) OF USE", "text": ""}, {"section_title": "Drug research & development pipelines (biomarker-drug codevelopment programs)", "text": ""}, {"section_title": "Selection of trial participants", "text": "Assessment of drug mechanism of action (proof of mechanism) Dose optimization"}, {"section_title": "Dose response monitoring Efficacy maximization; minimization of toxicity and adverse events", "text": ""}, {"section_title": "Clinical management", "text": "Screening subjects for existing AD pathophysiology (filtering the access to CSF and/or PET)\nPredicting the clinical onset in subjects proven positive for AD pathophysiology to facilitate/ optimize enrollment in clinical trials and access to future disease-modifying therapies"}, {"section_title": "Assessment of diagnosis, disease stage, and prognosis", "text": "Monitoring the disease progression "}, {"section_title": "Disease monitoring", "text": "Biological markers of reflecting core aspects of pathophysiology and pathology, including Aβ peptides, tau protein, and regional brain volumes, are currently employed in clinical trials as secondary outcomes, since serial biomarker alterations can be standardized and precisely and objectively quantified across short time intervals compared with complex measures of cognitive decline. 62 If blood biomarkers were highly predictive of core pathophysiology and pathology, both cross-sectionally and longitudinally, they could also replace more established CSF and molecular neuroimaging biomarkers."}, {"section_title": "Treatment response monitoring", "text": "Disease monitoring biomarkers, accurately indicating the effect of therapy, should aid mapping of treatment response. In cases where they were required to evaluate safety and efficacy, they could be considered as companion diagnostic.\nThe appealing notion that codevelopment of treatments and companion diagnostics will be required for successful AD trials needs to be further substantiated."}, {"section_title": "Recommendations", "text": "Across all potential COUs, 1039 studies have been performed to develop blood tests for AD and related phenotypes. 50 Most investigations were academic discovery stage studies, with no blood-based tests conclusively validated and qualified to any meaningful COU for AD. A growing number of promising candidates have been discovered and partly validated in independent studies and are going to be further tested, 63 standardized, and qualified. It is not surprising, however, that a number of promising candidate tests have failed to replicate as well. [64] [65] [66] [67] For this reason, standardized reporting using the \"Transparent Reporting of a multivariable prediction models for Individual Prognosis Or Diagnosis\" (TRIPOD) 68 and preanalytical variable guidelines are recommended. 69 Similarly, the release of all negative findings, prediction model coefficients, study data, and analysis scripts is advocated to reduce barriers to future research and replication. 70 Finally, researchers are encouraged to follow the checklist for developing a clinically useful blood-based biomarker. 50 A key aspect of developing a blood test for AD is to decide on a COU and, then, to develop relevant evidence: this is designated as the \"industrial approach.\" However, most research in this area has followed the \"academic approach,\" that is, first developing a biomarker of disease status and then looking for other COUs (Figure 1) . A problem with the latter approach is that the evidence needed to demonstrate utility in a COU might differ from that typically found in a case-control cohort (eg, the cohort might not be representative of the COU [amyloid prevalence, disease stage]), the cohort might not have all the relevant measures, or the best biomarkers for each COU might differ. 49,70"}, {"section_title": "Positive and negative predictive biomarkers detecting target druggability and drugresistance mechanisms", "text": "Current drug therapies for AD are considered transiently (\"symptomatic\") biologically effective and could not substantiate clinically meaningful disease-modifying outcomes. [71] [72] [73] The US Food and Drug Administration (FDA) appealed for a new draft industrial guidance to develop AD drugs, including those for early-stage AD. 74 Thus, there is an urgent medical need for drugs slowing the progression of the pathophysiological cascade causing synaptic dysfunction and neurodegeneration in AD. 75, 76 The identification of new molecular targets involved in AD pathophysiology represents the essential step to investigate possible disease-modifying drugs counteracting the progression of the disease. Nevertheless, when considering pharmacological validation of new AD drug candidates, the need to develop newer transgenic models with more translational value to the human condition should be considered. Effective drugs in currently available AD animal models do not necessarily translate as disease-modifying drugs in humans. 77, 78 The introduction of transgenic rodent models of"}, {"section_title": "Context of use Context of use", "text": "Reproduced with permission from ref 50: Blood-based biomarkers for Alzheimer disease: mapping the road to the clinic. Nat Rev Neurol. Figure 1 . Potential collaboration points between academia and industry. Academic and industrial approaches to biomarker development are inherently different, but combining these approaches could be extremely useful. Close collaboration between industry and academia would allow sharing of expertise in product testing, access to cohorts and clinical data, and sharing of ideas and theories with regard to clinical end points and context. By merging the two approaches, a method whereby the context of use is the primary focus throughout the process can be established. This model enabled synergistic development of a new biomarker between academics and industrial partners, sharing a wealth of experience."}, {"section_title": "Regulatory viewpoint of biomarker-drug codevelopment towards individualized therapies for Alzheimer disease", "text": "CSF, as well as MRI and PET biomarkers, has been qualified by the EMA for the enrichment of study populations in pivotal clinical trials. 108 However, these diagnostic biomarkers are either considered invasive or expensive and there is a clear need for more practical, less invasive, and less costly blood-based biomarkers. 86, 109 Recently, plasma neurofilament light chain (NFL) protein emerged as a promising blood-based biomarker for neurodegeneration in neurodegenerative diseases as well as plasma Aβ measures. 38, 91, 110, 111 Whereas these examples for candidate blood-based biomarkers are considered promising, none of them can currently detect preclinical AD with reasonable diagnostic accuracy. Up to now, they have been mostly used as exploratory end points in clinical trials. However, their role as prescreening tools for selecting individuals (before more expensive and more invasive biomarkers are used) could be useful and, from a regulatory perspective, more qualification work in this direction is endorsed. 112, 113 Predictive biomarkers are used to identify treatment-responsive patient subgroups. The usefulness of a biomarker to identify patients eligible to be treated with a new drug depends on the statistical interaction between biomarker and drug, ie, on the difference in the effect size between biomarker-positive and -negative patients. The biomarker is called predictive with respect to a given drug if this difference is positive. Obviously, empirical demonstration that a biomarker is predictive in AD based on usual clinical data would require further corroboration in a well-powered clinical trial. Biomarker-drug codevelopment has been useful in recent years, especially in oncology, but remains a difficult task in AD due to the slow course of the disease and the lack of validated end points or surrogates, especially if early treatment at prodromal stages is contemplated.\nInvestigating pathway-based targeted drugs simultaneously in different pathologies in innovative study designs, such as recently proposed master protocols, could contribute to more efficient development. However, much effort is still required to explore and confirm reasonable predictive biomarkers based on clinical end points that are believed to predict the treatment effect. More sensitive clinical tools that can detect changes during early and preclinical stages of AD need to be developed. 114, 115 The difficulties in demonstrating the predictivity of a biomarker create regulatory challenges. If only biomarker-positive patients are studied and there is inadequate external evidence for a differential treatment benefit, (for example, compelling mechanistic data or external control natural history information), the utility of the biomarker is unknown due to the lack of evidence in the nonselected"}, {"section_title": "Industry viewpoint on the development of Alzheimer's disease clinical trials focused on blood-based biomarkers", "text": "Neurodegenerative diseases require a better understanding of their pathophysiology to precisely address the relevant altered pathways with compounds targeting the relevant molecules involved. This requires; (i) the identification of these pathophysiological pathways underlying clinical phenotypes and breaking down one uniformly appearing clinical disease into disease subtypes characterized by biomarkers that are representative of the molecular phenotype. Such an approach has been successfully applied in oncology where biomarkers are used to differentiate subtypes of eg, breast cancer or lung cancer for better response rates. 116 Furthermore, this may require (ii) monitoring of the pathophysiological response during treatment to understand whether a patient's disease is initially responding to a treatment and whether it continues and sustains response or (iii) monitoring whether an escape mechanism has been activated and the patient requires a different treatment approach.\nIn clinical trials for neurodegenerative diseases, this may require early identification of patients with an existing pathology but still absent of very discrete or unspecific symptoms, such as in AD, where biological indicators can precede the clinical symptoms by more than 10 to 15 years. 117 In cases where a specific pathophysiological pathway defining a disease subgroup is targeted by a particular compound, a companion diagnostic approach may be required to test the status of biomarker(s) related to the molecular pathway(s) involved in order to provide safe and effective treatment options. Development of such companion diagnostics often requires exceptional communication and seamless collaboration between two companies (ie, diagnostics and drug companies) with distinct proficiencies and disparate teams which, in practice, may present serious challenges during all stages of codevelopment from design and execution of clinical trials to market access and reimbursement, including Institutional Review Board oversight, study management, monitoring and complex submissions to regulatory agencies. Even though a companion diagnostic approach allows for personalized treatments and may reduce the incidence of adverse effects and overall costs via avoidance of unnecessary and/or inefficient treatments, it should also be recognized that there are several disadvantages associated with a companion diagnostic approach as well. For instance, requirement of a specific diagnostic test to be performed before any treatment may be initiated, or requirement of continuous testing for monitoring purposes could actually add to the cost of individual patient care. In addition, lack of availability or limited accessibility of such a test for every individual potentially eligible for the drug may cause unwanted delays in access to the treatment. Similar to other in vitro diagnostic tests, companion diagnostics must be accurate, reliable, and provide essential insights to be of clinical utility (Figure 2 )."}, {"section_title": "Implications and conclusions", "text": "Early detection and diagnosis of AD and other primary neurodegenerative diseases is a basis of timely and effective treatment. CSF biomarkers (CSF Aβ 1-42 and tau concentrations) and neuroimaging biomarkers (PET imaging of Aβ and tau aggregates, 18 F-FDG-PET, and structural MRI) are primarily used in academic expert clinical research centers and, therefore, not yet accessible as routine diagnostic tools in global primary care settings. There are international efforts to identify and validate innovative blood (plasma/ serum)-based biomarker candidates reflecting primary pathophysiological mechanisms associated with different neurodegenerative diseases, including AD. 118 Blood-based biomarker candidates have the potential to be regularly analyzed both in primary care settings and in the community. Repeated (serial) blood sampling is accessible and practical even in elderly individuals and frail patients. There is (i) an ongoing dynamic process to identify and validate blood biomarkers for early detection, diagnosis, and prognosis of AD; and (ii) an increasing confidence that"}]