[{"section_title": "Abstract", "text": "Connectomics has proved promising in quantifying and understanding the effects of development, aging and an array of diseases on the brain. In this work, we propose a new structural connectivity measure from diffusion MRI that allows us to incorporate direct brain connections as well as indirect ones that would not be otherwise accounted for by standard techniques and that may be key for the better understanding of function from structure. From our experiments on the Human Connectome Project dataset, we find that our measure of structural connectivity better correlates with functional connectivity than streamline tractography does, meaning that it provides new structural information related to function. Through additional experiments on the ADNI-2 dataset, we demonstrate the ability of this new measure to better discriminate different stages of Alzheimer's disease. Our findings suggest that this measure is useful in the study of the normal brain structure, and for quantifying the effects of disease on the brain structure."}, {"section_title": "Introduction", "text": "Neurological diseases affect a large and increasing portion of the population. Recent studies on brain structural and functional connectivity have focused on various diseases to investigate their impact on the brain connections. Different neurological diseases have been shown to alter brain connectivity: Alzheimer's disease (AD) (Rose et al., 2000; Data used in preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (adni.loni.usc.edu) . As such, the investigators within the ADNI contributed to the design and implementation of ADNI and/or provided data but did not participate in analysis or writing of this report. A complete listing of ADNI investigators can be found at: http://adni.loni.usc.edu/wpcontent/uploads/how to apply/ADNI Acknowledgement List.pdf 2005 Prasad et al., 2015; Yu et al., 2017) , late-life major depressive disorder (Smagula and Aizenstein, 2016) , epilepsy (Taylor et al., 2015) , Parkinsons's disease (Canu et al., 2015; Shah et al., 2017) , schizophrenia (Arbabshirani et al., 2013; Cabral et al., 2013) and other psychosis (van Dellen et al., 2015; Mighdoll et al., 2015) . Brain connectivity analysis has also proven to be useful in the study of the effects of aging on the brain (Damoiseaux, 2017; Wu et al., 2013; Salat, 2011; Fjell et al., 2016) .\nBrain structural and functional connectivities, as measured by diffusion-weighted MRI (dMRI) and resting-state functional MRI (rs-fMRI), respectively, reveal distinct features (Park and Friston, 2013) . While structural connectivity reflects the white matter axon bundles, functional connectivity measures the temporal correlation of blood oxygenation changes. Functional connectivity is based on the premise that brain regions that are activated synchronously, and therefore undergo similar oxygenation and deoxygenation variations, are related. However, functional connectivity may depend on the subject state (e.g., time of day, alertness, caffeine levels). Structural connectivity, on the other hand, is independent of the subject state, and can even be acquired ex vivo. Despite the fundamental differences in the processes that we observe via these two distinct measurements, structural and functional connectivities have been shown to be correlated (Damoiseaux and Greicius, 2009; Huang and Ding, 2016) . Strong functional connections are, however, commonly observed between regions with no direct structural connection (Koch et al., 2002; Honey et al., 2009) . Part of this variance has been shown to be due to the impact of indirect structural connections (Honey et al., 2009; Van Den Heuvel et al., 2009; Deligianni et al., 2011) , i.e. between regions that are physically connected through multiple direct fiber bundles. Such indirect structural connections are usually considered only during the network analysis (Sporns, 2013) , but not at the fiber tracking (tractography) step.\nDifferences in brain connectivity patterns between healthy and diseased populations are an indicator of change in the brain \"wiring\" and function due to the disease. In particular, AD has been found to impact connectivity (Rose et al., 2000; Buckner et al., 2005 Buckner et al., , 2009 Prasad et al., 2015; Yu et al., 2017) . The progressive neurodegeneration suffered in AD, possibly caused by the spread and accumulation of misfolded proteins along structural connections in the brain (Iturria-Medina et al., 2014) , affects the functional networks detected with rs-fMRI (Buckner et al., 2005 (Buckner et al., , 2009 Yu et al., 2017) and the brain connections reconstructed with dMRI (Rose et al., 2000; Prasad et al., 2015) . Accurately modeling structural connectivity could therefore reveal the effects of AD progression in white-matter degeneration.\nThe purpose of the present work is to derive a new structural connectivity measure that considers all possible pathways, direct and indirect, with the aim of accessing more of the information that is often only available through functional connectivity. To that end, we propose a connectivity computation method that models the white-matter pathways imaged via dMRI using the well-studied mathematics of electrical circuits (Chung et al., 2012; Aganj et al., 2014; Chung et al., 2017; Frau-Pascual et al., 2018) . Our method accounts for all possible white-matter pathways and is solved globally. It also does not require any parameter tuning and does not suffer from local minima, thereby producing consistent results with respect to the input data.\nWe evaluate the performance of the proposed conductance measure to test two different hypotheses, using a different dataset for each. First, we check the relationship between structural and functional connectivities, to test if our structural connectivity measure, which includes indirect connections, is more related to functional connectivity than standard measures are. Our results on 100 subjects of the WashU-UMN Human Connectome Project (HCP) (Van Essen et al., 2013) dataset support this hypothesis: our new connectivity measure provides a higher correlation to functional connectivity compared to standard methods. Second, we test if our measure can classify healthy and diseased populations. Through experiments on data from the second phase of Alzheimer's Disease Neuroimaging Initiative (ADNI-2) (Jack et al., 2008; Beckett et al., 2015) , our connectivity measure proves useful in finding differences between the different stages of AD. This could lead to the discovery of new imaging biomarkers that help us better identify the disease stage, predict the onset of disease from connectivity patterns, and deepen our insight into the human brain and how it is affected in development or by disease.\nWe present our conductance method for inferring a new structural brain connectivity measure from dMRI in Section 2 and put it into perspective with respect to standard tractography methods. We describe our analysis pipeline for the two datasets in Section 3 and present our results in Section 4. A discussion and conclusions follow in Sections 5 and 6, respectively. A preliminary abstract of this work was presented in (Frau-Pascual et al., 2018) ."}, {"section_title": "Methods", "text": "Brain connectivity has been previously modeled with the help of the established mathematical framework for macroscopic electrical circuits (Chung et al., 2012; Aganj et al., 2014; Chung et al., 2017) . In this work, we make use of a combination of differential Maxwell's equations and Kirchhoff's circuit laws, resulting in an equation similar to the heat equation proposed in (ODonnell et al., 2002) . As illustrated in Fig. 1 , we assign to each image voxel a local anisotropic conductivity value D, which is the diffusion tensor computed from dMRI (Basser et al., 1994; Tuch et al., 2001) . (See Appendix B for a formulation to use higher-order diffusion models.) By solving the partial differential equation (PDE) (Haus and Melcher, 1989 )\nfor a certain current configuration γ i,j between a pair of source (i) and sink (j) voxels (see below), we find the potential map φ i,j for that specific configuration. ∇ and ∇· are the gradient and the divergence operators, respectively. This PDE describes how a current would diffuse from a source point to a sink point following the orientational information provided by the diffusion tensors. It is nonetheless important to note that these potentials cannot be directly interpreted as connectivity. Therefore, in contrast to (ODonnell et al., 2002) , we further compute the electric conductance between each pair of voxels from potential maps, to which all diffusion paths between the pair contribute. The same measure can also be computed between a pair of regions of interest (ROIs) instead of voxels, by distributing the currents γ among the ROI voxels.\nWe solve the PDE for a 1-ampere current (without loss of generality) between a pair of voxels i and j: γ i,j = δ i − δ j , where δ k (x) := δ(x − x k ), with x k the position of voxel k and δ(·) the Dirac delta. To compute ROI-wise conductance, we distribute the currents among the sets of voxels I and J (the two ROIs) as:"}, {"section_title": "Efficient Computation of Potentials", "text": "For each source/sink current configuration γ i,j , we solve the PDE 1 in Eq.\n(1) to find the potentials (see Fig. 1 ). We first discretize the linear diffusion term −∇·(D∇φ i,j ) and γ i,j (see Appendix A for details on the discretization) and write it in the matrix form M φ i,j = γ i,j , which we then invert to solve φ i,j = M −1 γ i,j . We use the Neumann boundary condition: ∇φ i,j · e = 0 for all points on the boundary, where e denotes the (typically exterior) normal to the boundary.\nGiven N voxels (or ROIs), we need a potential map for each pair of voxels, leading to N 2 potential maps, hence an intractable problem. However, by exploiting the superposition principle that derives from the linearity of the derivative operator, we reduce the number of necessary potential maps to only N . We choose a reference sink voxel, s, and compute N potential maps, φ i,s , i = 1, ..., N , with i the source and s the fixed sink. Next, note that for a pair (i, j), we can compute the potentials φ i,j by linearly combining the potentials of i and j to the reference sink voxel (φ i,s , φ j,s ), as:\nGiven that we consider the same boundary conditions for all the PDEs, we can now compute the potential map for any pair simply as φ i,j = φ i,s − φ j,s . Note that in the computation of φ i,j for all the pairs (i, j), the inverse matrix M −1 needs to be computed and saved in memory only once."}, {"section_title": "Conductance as a Measure of Connectivity", "text": "The conductance between two points can be computed with Ohm's law as the ratio of the current to the potential difference. In our case, we set a 1-ampere current between two voxels (or ROIs) i and j, and the potential difference is φ i,j (x i ) − φ i,j (x j ). The conductance is therefore computed, voxel-wise, as\nFinally, per the aforementioned superposition principle, the conductance between any pair of voxels (i, j) is computed as\n1 We used the Finite Volume MATLAB toolbox (Eftekhari and Schller, 2015) , and extended it so it accepts tensor-valued D.\nFor ROI-wise connectivity, given that the potential map between two ROIs is φ\nHigh conductance (i.e. low resistance) between two points indicates a high degree of connectivity. Note in equations (5) and (7) that, as expected, the conductance is symmetric with respect to the pair of voxels or ROIs, i.e., C i,j = C j,i and C I,J = C J,I . As shown in Fig. 1 , by setting the conductivity (D) to zero outside the white-matter mask, we can compute voxel-wise conductance maps from a single voxel (in red) to the rest of the brain, as well as ROI-wise conductance maps from a single ROI (in red, indicated with arrow) to all the other ROIs 2 . Note that the ROIs are all at least weakly connected, given that indirect connections are all considered. Nevertheless, these maps can be thresholded to keep only connections stronger than a desired amount."}, {"section_title": "Comparison to standard connectivity computation", "text": "In standard connectomic approaches, tractography is often performed after dMRI reconstruction to extract streamlines that represent connections between different voxels of the image (see Fig. 2 ). Connectivity matrices are then generated from the streamlines between different ROIs that are previously determined via segmentation of the brain. Various connectivity measures can be used to quantify these connections, leading to different connectivity matrices, e.g.: plain count of the streamlines, number of the streamlines normalized by the median length, number of tracts passing through the ROI or only those ending in the ROI, etc. The optimal choice of the type of connectivity matrix usually depends on the tractography algorithm used (choice of seeds, deterministic/probabilistic, whether sharp turns are allowed, etc.). In our approach, however, only the conductivity input will vary. This reduces the number of decisions to make (parameters to tune) in the computation of the connectivity matrix."}, {"section_title": "Data analysis", "text": "We used two publicly available datasets in our analysis, from the WashU-UMN Human Connectome Project (HCP) (Van Essen et al., 2013) and the second phase of Alzheimer's Disease Neuroimaging Initiative (ADNI-2) (Jack et al., 2008; Beckett et al., 2015) . These (a) We model brain connectivity globally using a combination of differential Maxwell's equations and Kirchhoff's circuit laws, with diffusion tensors reconstructed from dMRI. (b) We first compute the potentials φ i,s , as depicted for five sources i (the reddest voxel) and a fixed sink s (the bluest voxel). (c) Then, potential maps are superposed to generate voxel-wise conductance maps C i,j as shown for five voxels i (the reddest voxel), or ROI-wise conductance maps C I,J as shown for five ROIs I (indicated by arrows). Figure 2 : Comparison of the structural connectivity computation by the proposed method vs. standard tractography. The diffusion tensors and the white and gray matter segmentation and parcellation are given to both connectivity methods. In our conductance connectivity approach, the connectivity matrix is computed by solving a PDE for each ROI. In the standard streamline connectivity approach, tractography is performed on the tensors or higher-order distributions and connectivity matrices are computed according to certain criteria.\ntwo datasets allowed us to evaluate the proposed method from different aspects: HCP data was used to measure the relationship between structural and functional connectivities, and ADNI-2 enabled the assessment of the utility of our measure in discriminating healthy and diseased populations. We preprocessed both datasets similarly.\nMR processing: We performed tissue segmentation and parcellation of the cortex into ROIs using FreeSurfer 3 (Fischl, 2012) . The parcellation used in this work is the Desikan-Killiany atlas (Desikan et al., 2006) .\nDiffusion MRI processing: The diffusion preprocessing pipeline used for ADNI-2 involved the FSL software 4 (Jenkinson et al., 2012) and included BET brain extraction (Smith, 2002) and EDDY (Andersson and Sotiropoulos, 2016) for eddy current and subject motion correction. For HCP, there were more steps involved (Glasser et al., 2013) , namely: B0 intensity normalization, EPI distortion correction with TOPUP (Andersson et al., 2003) , eddy current and subject motion correction with EDDY, and gradient non-linearity correction. From the preprocessed dMRI images, we reconstructed the diffusion tensors using the Diffusion Tensor Imaging (DTI) (Basser et al., 1994) recon-struction of DSI Studio 5 , which we then used as input to our conductance approach.\nTo compare with standard approaches (see Fig. 2 ), we also ran streamline (SL) tractography (Yeh et al., 2013) using DTI, for direct comparison with our approach, and using generalized q-sampling imaging (GQI) (Yeh et al., 2010) , which, as opposed to DTI, can model multiple axon populations per voxel. We generated 10000 fiber tracts and used default values for the rest of the parameters. Then, we computed connectivity matrices according to various connectivity conventions: plain tract count, tract count normalized by the median length, both considering tracts passing through the ROI or ending in the ROI.\nrs-fMRI processing: The rs-fMRI data, already projected to the surface and preprocessed as described in (Glasser et al., 2013) , was detrended (only linear trends removed), bandpass-filtered at 0.01-0.08Hz, and smoothed with a kernel with a full width at half maximum of 6mm. We stacked four sessions of rs-fMRI data, and computed the correlation matrix for the ROIs. Note that we used rs-fMRI only in our HCP experiments."}, {"section_title": "Results", "text": "We evaluated the performance of the proposed conductance measure through experiments that answer two different questions:\n(a) Relationship between structural and functional connectivity (Section 4.1): Is our structural connectivity measure, which considers both direct and indirect connections, more correlated to functional connectivity than standard measures are? (b) Discrimination of healthy and diseased populations (Section 4.2): Does our measure provide additional information that better distinguishes different stages of AD?\nIn the following subsections, we attempt to answer these questions using the HCP and ADNI-2 datasets, respectively."}, {"section_title": "HCP dataset", "text": "We evaluated our method on 100 subjects from the publicly available WashU-UMN HCP dataset (Van Essen et al., 2013) , which contains rs-fMRI and dMRI data, while comparing our approach with standard SL tractography in regards to the relation to functional connectivity."}, {"section_title": "Relationship with functional connectivity", "text": "To test the hypothesis that indirect connections can explain some of the variability between structural and functional connectivity, we compared the structural connectivity matrices -computed from our conductance and the standard approaches -to the functional connectivity matrix. We computed the Pearson correlation coefficient between the elements of the structural and functional connectivity matrices per subject, and then compared the (a) Distribution of correlations across 100 subjects. SL-based connectivity measures computed using DTI and GQI are compared: 'count' means plain count, 'ncount' means normalized fiber count by the median length, 'end' means that only fibers ending in the ROI are considered, and 'pass' that fibers passing through an ROI are also considered. The 'distance' method is our approach ran with constant isotropic tensors, and the 'MD-w distance' is our approach ran with isotropic tensors weighted by the mean diffusivity. For each box, the central line is the median, the left/right edges are the 25 th and the 75 th percentiles, the whiskers extend to the most extreme data points not considered outliers, and the outliers are plotted individually.\n(b) Histogram of the difference of structural/functional correlation, for conductance minus DTI SL and GQI SL tractographies. The SL-based connectivity measure giving the highest correlation with functional connectivity is used: tract count normalized by median length, considering tracts passing through an ROI.\ndistribution of these correlation values, as depicted in Fig. 3 (a) and reported in Table 1 .\nAs can be seen, functional connectivity is much more strongly correlated with the proposed conductance-based structural connectivity than with all the conventional SL-based connectivity methods. Next, to make sure that our method makes use of the actual whitematter fiber orientations, and not just the physical distance between ROIs, we repeated the experiments using isotropic tensors; once with a constant tensor magnitude (denoted by 'distance'), and again by weighting the tensor with mean diffusivity (denoted by 'MD-w distance'). Figure 3(b) shows the histogram of the correlations of functional connectivity with two SL-based connectivity approaches (DTI, GQI) subtracted (subject-wise) from correlations of functional connectivity with the proposed conductance-based connectivity. The positive range of values shows how much more the conductance connectivity is correlated with the functional connectivity than the conventional SL-based metrics are. A two-tailed paired t-test between these two distributions revealed a statistic of t = 37 and a significance value of p = 10 −60 in the DTI case, and t = 35 and p = 10 −58 in the GQI case."}, {"section_title": "Modeling of inter-hemispheric connections", "text": "One of the well-known issues in standard tractography methods is the mismodeling of inter-hemispheric connections, as such long tracts can be mistakenly cut short (Sinke et al., 2018) . As can be seen in Table 2 , conventional structural connectivity methods model a low quantity of cortical inter-hemispheric (only 6% of all) connections. Our conductance Table 1 : Cross-subject mean correlation of functional and the proposed conductance-based structural connectivities with all structural connectivity metrics. See the legend of Fig. 3 method results in a higher ratio of inter-hemispheric connections, close to that of functional connectivity measures and the MD-w distance. Next, we again considered the correlation of the different structural connectivity measures with functional connectivity, but this time separately for three connection groups of cortical inter-hemispheric, cortical intra-hemispheric, and all subcortical connections, with the results illustrated in Fig. 4 . Regarding the cortical inter-hemispheric connections, we observe a much lower correlation of the SL-based measures compared to the conductance-based measure. Note that our measures of distance have low correlations as well. This difference decreases for intra-hemispheric connections, although conductance-based connectivity still correlates much more than the rest. As for subcortical connections, we observe that the distance correlates much more with functional connectivity than SL-based connectivity measures do, and that the conductance-based connectivity has a very large standard deviation."}, {"section_title": "ADNI-2 dataset", "text": "Next, we tested the power of our global conductance-based structural connectivity measure in the detection of white-matter differences in populations with different stages of AD and in the classification of dMRI images according to the AD stage. A more accurate modeling of structural connections could lead to a better understanding of the progression of this and other diseases, and to the discovery of new imaging biomarkers for disease study. We analyzed 213 subjects of the ADNI-2 dataset (adni.loni.usc.edu) in different stages: 78 cognitively normal (CN), 89 with mild cognitive impairment (MCI), and 47 with AD dementia (Fig. 5) . The ADNI was launched in 2003 as a public -private partnership, led by Principal Investigator Michael W. Weiner, MD. The primary goal of ADNI has been to test whether serial MRI, positron emission tomography, other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of MCI and early AD."}, {"section_title": "Pair-wise classification of disease stage", "text": "We assessed the suitability of our conductance-based connectivity matrix for disease stage classification, which would allow inferring the disease stage from connectivity measures derived from dMRI. We used Feature Selection with a Random Forest classifier to choose the most relevant features (with importance higher than the mean), and then performed the classification with a Random Forest classifier with balanced class weight (Pedregosa et al., 2011) . We cross-validated with a shuffle split cross-validation strategy with 200 splits considering a 10% of the data for testing (Varoquaux et al., 2017) .\nWe classified each pair of stages and then all stages together, and report the results in Fig. 6 . We compare our conductance measure to different conventional SL-based connectivity measures, using DTI and GQI reconstruction methods. Note that, in general, classification performance is affected by class size, even though we used balanced weights in our classification. In all cases, our conductance measure has a higher prediction accuracy than conventional structural connectivity measures do, especially in the case of CN vs AD. When classifying all stages simultaneously, one must keep in mind that since we have 3 classes, a prediction accuracy of 0.5 is still informative. For the case of all-stage classification, Fig. 7 shows the confusion matrices for our conductance measure and the conventional structural connectivity measure (here only considering the measure from GQI with SL tractography, counting the number of tracts passing through an ROI normalizing by the median length). We observe that our conductance method correctly classifies 46% of the AD cases whereas the conventional SL connectivity measure does only 12%. For the rest of the disease stages, the two methods had comparable performance."}, {"section_title": "CN vs AD connectivities", "text": "Next, we searched for pairs of regions where the structural connectivity significantly differed between the CN and AD groups. Figure 8 shows, for each pair of ROIs, the pvalues resulting from a 2-sample t-test between the AD and CN groups. Connections with significant differences (p < 0.05, after Bonferroni correction) between the AD and CN groups for the conductance measure ( Fig. 8(a) ) involve regions that are known to be affected by AD, namely hippocampus and amygdala (Barnes et al., 2006; Prestia et al., 2011) . Regarding differences between the MCI and AD groups, only the connections of right pars opercularis with insula and amygdala were significant, and when considering the CN and MCI groups, no connection was significantly different.\nWe performed the same analysis on the conventional SL connectivity measures ( Fig. 8(b) ), and only some of the DTI measures revealed a few significantly different connections in the comparison of AD and CN groups. DTI counting the number of fibers passing through an ROI and the same normalized by the median length revealed differences in a few connections, as depicted in Fig. 8(b) . When counting the number of fibers either passing through or ending in an ROI, only the left middle-temporal to supramarginal connection was significantly different. No differences were found in the other pairs of groups, and none with any of the GQI SL measures. Prior to Bonferroni correction, both methods suggested many significant connections between all pairs of stages. However, only the proposed method revealed significant p-values in all cases after Bonferroni correction. This suggests that our method provides a higher statistical power and may potentially reveal a statistically significant effect with a smaller sample size."}, {"section_title": "Discussion", "text": "We have proposed a new approach to measure structural brain connectivity. Directly from the reconstructed dMRI data, our approach accounts for indirect brain connections that would not otherwise be inherently considered by standard SL techniques. The proposed methodology is solved globally and considers all possible pathways when quantifying connectivity. As such, it may also be including some implausible paths, as would also be the case for the conventional SL tractography-based connectivity measures. However, we expect the greater length of erroneous pathways, such as the ones that involve jumping from one true path onto another, to reduce the impact of such paths. Note that, although they have been shown to be related (Tuch et al., 2001) , we do not suggest that the electrical conductance is an appropriate model for the brain's biological wiring. We only take advantage of the mathematical framework provided by this model to account for indirect white-matter connections.\nAnother advantage of our method is that we have fewer decisions to make and parameters to tune in the connectivity analysis pipeline. Standard tractography-based connectivity analysis includes different steps that require a certain decision making when quantifying connectivity, such as: modeling of one or several fiber bundle populations, the choice of probabilistic or deterministic tractography, number of seeds, number of streamlines, the allowed turning angle, how we count the tracts, etc. This introduces a large amount of variability in the results, in a field where the scarcity of ground truth is one of the biggest challenges (Cheng et al., 2012; Maier-Hein et al., 2017) . Our methodology, however, computes connectivity from the diffusion tensors without the need for any parameter tuning. It is worth noting that, even though there is some variability in the results by conventional connectivity methods, our method consistently outperformed them.\nWe have shown in Section 4.1 that by using the proposed conductance method, which accounts for indirect pathways, one can compute structural connectivity measures that are significantly more correlated with functional connectivity than by using more standard approaches, with the latter showing a very low correlation in line with existing literature (Fjell et al., 2017) . This supports the hypothesis on the role of indirect connections in the relationship between functional and structural connectivity; part of the variance between these two connectivity measures lies within indirect connections, usually not accounted for in structural connectivity (Honey et al., 2009; Deligianni et al., 2011) . Although the conductance measure was significantly more correlated with functional connectivity than standard SL measures were, the mean correlation was merely 0.43 (see Fig. 3 ). The reason for this is that structural and functional connectivities describe different processes: while the former represents physical connections, the latter reflects how synchronously different regions in the brain function and considers such synchrony as a surrogate for connectivity. Nevertheless, increased similarity to functional connectivity -when considering all connections or only a subgroup of them (see Fig. 4 ) -implies that the proposed measure may be more informative about the brain function.\nWe observed through experiments that our approach reveals more cortical inter-hemispheric connections (see Section 4.1.2). These connections, which are mostly -but not always (Roland et al., 2017 ) -through the corpus callosum (Zarei et al., 2006) , have proved challenging for standard tractography methods (e.g. due to sensitivity to head motion) . In fact, inter-hemispheric connections have been shown to be affected by disease (e.g., AD) and correlated with clinical changes in some disorders Saar-Ashkenazy et al., 2016; Xue et al., 2018) .\nThe proposed conductance measure has also proven useful (see Section 4.2) in distinguishing normal and AD subjects and in better classification among AD stages. This could potentially lead to dMRI-derived biomarkers for early detection of AD.\nOur approach could be employed in a more general-purpose global connectivity analysis, as an alternative to classic tractography. However, the conductance values may not fit the definition of either streamlines or probability measures. As we have shown in Section 2, the proposed method can also enable the computation of voxel-wise and thus parcellationindependent connectivity (Moyer et al., 2017) , which allows us to compute the connectivity between any pair of points in the white matter.\nOne of the limitations of the proposed conductance measure is that it derives from tensors, and therefore does not make use of the information provided by higher-order models. Even so, we make use of the whole tensor and not just the main direction of the axon population. Therefore, our tensors are actually used as low-order orientation distribution functions (ODFs). Importantly, we have shown here that our approach outperforms the conventional SL-based method, even when the latter uses high-order ODFs. In addition, our approach can be extended to exploit multiple axon population models to deal with crossing and kissing fibers, using a multi-tensor approach or general ODFs (Seunarine and Alexander, 2014; Aganj et al., 2015) instead. We propose a framework to implement this with higher-order models in Appendix B."}, {"section_title": "Conclusion", "text": "In this work, we have proposed a new structural connectivity measure that is directly derived from the dMRI data and accounts for all possible pathways when quantifying connectivity between a pair of regions. The method is global, does not produce locally optimal solutions, and has no parameters to be tuned by the user. Using this methodology, we computed structural connectivity measures that were significantly more correlated with functional connectivity, when compared to more standard approaches. In the study of diseased populations, our novel connectivity measure better classified different stages of Alzheimer's disease. Our results suggest that the proposed method provides new information that is not accounted for in standard streamline-based connectivity measures, and highlights its potential for further development. BF has a financial interest in CorticoMetrics, a company whose medical pursuits focus on brain imaging and measurement technologies. BF's interests were reviewed and are managed by Massachusetts General Hospital and Partners HealthCare in accordance with their conflict of interest policies.\nFor the discretization of ∇ · (D∇Φ) of Eq. (1), we find the values of D on the mid points of the mesh before computing the divergence, as such mid points are where the gradient of the potentials are computed.\nFor tensor D =   D 11 D 12 D 13 D 21 D 22 D 23 D 31 D 32 D 33   in 3D, withD n,m,p = Dn,m,p+D n−1,m,p 2 , D n,m,p = Dn,m,p+D n,m−1,p 2 andD n,m,p = Dn,m,p+D n,m,p−1 2 , we have: Assuming thatû is the normalized b-vector and b = τ q 2 the b-value, with q and τ the q-vector and the diffusion time, the measured diffusion signal values according to the monoexponential model are S( q) = S 0 e −τ q 2 A(û) , (B.1)\nwhere q = qû and A is the apparent diffusion coefficient. Note that q 2 A(û) = − 1 τ ln S( q) S 0 .\nIn DTI, we approximate A as a quadratic function:\nDeriving with respect to q results in:\nFor HARDI, we can approximate the left-hand-side of Eq. (1) as follows:\nEquation (B.6) is no longer linear with respect to the potentials, and therefore Eq. (1) cannot be solved as easily with this model as in the case of DTI. Moreover, due to nonlinearity, the superposition property no longer holds either. Iterative optimization approaches may be used to approximate the solution to the PDE with Eq. (B.6)."}]