[{"section_title": "Introduction", "text": "The intertropical convergence zone (ITCZ) is a narrow, zonally elongated region of near-surface convergence located near the equator over the oceans, where there is widespread cloudiness and precipitation. It is often thought of in the global sense as the rising branch of the Hadley circulation located over the ocean where the easterly trade winds converge. The ITCZ can be identified using satellite observations of clouds, precipitation, or surface winds and also using dynamical fields in reanalysis data. Several studies have identified the characteristics and variability of the global annual and seasonal mean ITCZ (e.g., Waliser and Gautier 1993; Chan and Evans 2002; Berry and Reeder 2014) , but fewer studies have examined the highly dynamic day-to-day variability of the ITCZ. To do this requires instantaneous identification of the ITCZ, which is not a straightforward task in three-decade-long, high-temporal-resolution data [e.g., 3-hourly infrared (IR) images]. In the last decade a few studies have examined the day-to-day variability of the ITCZ in the east Pacific. Wang and Magnusdottir (2006) used visual identification of ITCZ structures in five years of satellite images (1999) (2000) (2001) (2002) (2003) to assess the breakdown of the ITCZ on synoptic time scales. They examined conditions year-round, but it was only during the boreal summer half-year (May-October) that the east Pacific ITCZ went through somewhat regular breakdown cycles while isolated from extratropical cold-air intrusions. Magnusdottir and Wang (2008) used spectral methods to isolate tropical, zonally elongated, cyclonic vorticity structures at 850 hPa in daily averaged reanalysis data over 23 years of the active season. Both the east Pacific and Atlantic boreal summer ITCZ are well represented, but the spring double ITCZ is weak and the methodology probably leads to mixing with signals from the South Pacific convergence zone (SPCZ). Bain et al. (2011) introduced a spatiotemporal statistical model (Markov random field model) to automate the detection of the instantaneous ITCZ in satellite images, automatically outlining the areal extent of the ITCZ at each time point. This allowed analysis of east Pacific ITCZ variability over a 30-yr period. They examined ITCZ seasonal evolution as well as possible trends in ITCZ latitude over the 30-yr period, determining that no significant trend is present in the observations. This has recently been confirmed for the east Pacific ITCZ in reanalysis data (Berry and Reeder 2014) . Bain et al. (2010) used the dataset of ITCZ labels (or areal extent) as well as the original IR satellite data to examine diurnal variability in cloud-top temperature within the east Pacific ITCZ for May-October. They found a signature of aerial shrinking of the ITCZ in early morning that is accompanied by an increase in high clouds. In the afternoon the ITCZ expands in area and there is a marked increase in midlevel clouds. The Markov random field (MRF) statistical model has recently been adapted to detecting the SPCZ (Haffke and Magnusdottir 2013) during the austral summer halfyear and a similar signature in diurnal cycle is observed for the tropical part of the SPCZ (Haffke and Magnusdottir 2015) .\nThe MRF approach requires that labeled training data are provided by human annotators in the form of handdrawn outlines of the ITCZ for each training image (using a stylus), with the drawback of requiring considerable human effort. In addition, when the ITCZ is weak, such as outside of the boreal summer months, it may be difficult to outline the boundaries of the ITCZ in instantaneous data. Henke et al. (2012) introduced an alternative approach that requires significantly less labeling effort and that is able to recognize the ITCZ in instantaneous data even at times when it is quite scattered and weak. In this approach a statistical pattern recognition model is trained based on a training set of images classified by human labelers according to their state. This is less taxing on the human expert since it is sufficient to indicate the ITCZ state per image rather than being required to outline the ITCZ boundary in detail. Henke et al. (2012) demonstrated the usefulness of this statistical model in analyzing 5 years of satellite data, particularly for automatically identifying the double ITCZ. Here we extend their study and analyze over 30 years of IR satellite images for occurrences of the ITCZ states, particularly in March-April when the double ITCZ is most frequently observed. For the east Pacific ITCZ we use the following set of states: a north of equator ITCZ (nITCZ), a south of equator ITCZ (sITCZ), an equatorial ITCZ (eITCZ), and a double ITCZ (dITCZ) when a convection zone is observed on both sides of the equator simultaneously. The fifth ITCZ state is when there is no zonally organized convection zone on either side of the equator or the ITCZ is absent (aITCZ).\nMany aspects of the observed double ITCZ are not well understood. Past studies have defined the double ITCZ using monthly mean variables such as cloud cover, rainfall, and horizontal wind convergence at the surface (Waliser and Gautier 1993; Zhang 2001; Halpern and Hung 2001; Lietzke et al. 2001; Liu and Xie 2002; Gu et al. 2005; Masunaga and L'Ecuyer 2010) . A double ITCZ in monthly mean surface wind convergence occurs year-round in the Atlantic and Pacific, although the Southern Hemisphere branch is often not accompanied by clouds (Liu and Xie 2002) . In the east Pacific a double ITCZ can be seen in monthly mean observations of clouds or precipitation in March and April, when a cold equatorial tongue of sea surface temperature (SST) is surrounded by sufficiently warm SST both north and south of the equator (Zhang 2001; Halpern and Hung 2001; Gu et al. 2005; Masunaga and L'Ecuyer 2010) . Lietzke et al. (2001) note that the presence of cool equatorial SST is the key factor regulating double ITCZ formation. The question remains as to what role the large-scale atmospheric circulation may play in ITCZ variability, including the double ITCZ, on short time scales such as the daily time scale.\nObservations have up to now revealed the cloud/ rainfall signatures of the double ITCZ only in boreal spring. Climate models tend to overrepresent the presence of the double ITCZ (Mechoso et al. 1995) . The double ITCZ and excessively cold equatorial SST in the Pacific is one of the most prominent biases in the current generation of global climate models (GCMs) (Li and Xie 2014; Hwang and Frierson 2013) . Lin (2007) shows that various feedback processes between SST and precipitation are not accurately represented in coupled atmosphere-ocean climate models, causing precipitation to be too closely linked to high SST throughout the tropics. In addition, models may not capture the atmospheric dynamics responsible for suppressing deep convection (Lin 2007) .\nBecause past studies have identified the east Pacific double ITCZ in monthly mean data it is unclear how often an instantaneous double ITCZ (dITCZ) occurs. For the west to central Pacific, Chen et al. (2008) find that the monthly mean double ITCZ is mostly a combination of north-only and south-only ITCZ, and the instantaneous double ITCZ occurs only 6% of the time over the time period 1996-2006. The relative frequency of the east Pacific instantaneous double ITCZ is unknown. Furthermore, we do not know whether the instantaneous double ITCZ is a unique feature with a corresponding unique SST distribution and an associated unique atmospheric circulation pattern, or simply a combination of features associated with the Northern Hemisphere ITCZ and the Southern Hemisphere ITCZ.\nThis paper shows results from applying the statistical model developed in Henke et al. (2012) to 3-hourly IR satellite images in the tropical east Pacific during 33 years from 1980 to 2012, focusing in particular on March-April, when there is the greatest variability of ITCZ states. Output from the method allows for a new look at the double ITCZ in the tropical east Pacific. The paper is organized as follows. Section 2 presents data and methods, where section 2b summarizes the statistical model that is a slight variation of the model for automatic detection of ITCZ states that was described in Henke et al. (2012) . Section 3 shows the distribution of ITCZ states in the east Pacific through the seasonal cycle, over all years. We then focus on March-April of each year. In section 3b we show composite fields according to ITCZ state in terms of cloud-top temperature (the variable used to detect the ITCZ state), but also in terms of precipitation rate from an independent satellite dataset. The SST distribution corresponding to ITCZ state is described in section 4a. The large-scale atmospheric circulation patterns associated with each ITCZ state are discussed in section 4b. In section 5 we discuss the connection between ITCZ state and convective activity in the SPCZ. Conclusions are presented in section 6."}, {"section_title": "Data and methods", "text": ""}, {"section_title": "a. Datasets", "text": "The ITCZ detection method described below requires high-resolution atmospheric-window IR satellite images. These data are obtained from the GridSat database that provides geostationary satellite data from Europe, Japan, China, and the United States that have been intercalibrated and consistently stitched together to provide long-term, global coverage appropriate for climate studies (Knapp et al. 2011) . GridSat includes global 3-hourly IR images from 1980 to 2012 at 8-km resolution.\nWe also use additional satellite observations and reanalysis data to characterize the regional and global atmospheric conditions and SST patterns associated with different ITCZ states. Daily SST is obtained from the NOAA Optimum Interpolation Sea Surface Temperature version 2 high-resolution dataset (Reynolds et al. 2002 ) at a 0.258 3 0.258 resolution for the years 1982 through 2012. Precipitation rate from both the Tropical Rainfall Measuring Mission (TRMM) and the Global Precipitation Climatology Project (GPCP) are used. The TRMM product is a daily 0.258 3 0.258 resolution precipitation rate, which is available from 1999 to 2012 (Huffman et al. 2007 ). The GPCP precipitation One-Degree Daily (1DD) data are of coarser resolution than TRMM precipitation at 18 3 18, but they are available daily from 1997 to 2012, providing a longer dataset (Huffman et al. 2001) . To supplement the satellite data we also use the three-dimensional velocity field and precipitation from the European Centre for Medium-Range Weather Forecasts interim reanalysis (ERA-Interim; Dee et al. 2011) ."}, {"section_title": "b. Statistical model for classifying ITCZ state", "text": "Tracking the ITCZ in 3-hourly geostationary satellite images yields a new perspective on ITCZ variability. Manually identifying the ITCZ is tedious at such high temporal resolution. An automated method is ideal as in that case the results are consistent and reproducible given the same input data. A human observer can easily recognize the zonally elongated cloud bands associated with convection in the east Pacific ITCZ using visible (VIS) or IR satellite images. However, it is hard to come up with a small set of simple characteristics to describe the ITCZ at all times because the location, orientation, east-west extent, and total area of the cloud bands change over time. While an expert observer can cope with these changes, for example, when the ITCZ migrates north and south over the course of a year or changes shape and position over the course of a day, these changes prove more challenging for automated methods.\nA new well-suited method for the task of automatically identifying the east Pacific ITCZ in IR and VIS satellite images at high temporal and spatial resolution was developed in Henke et al. (2012) . We will briefly summarize the method here and describe necessary modifications that were implemented for the current study.\nThe method is subdivided into two major components: (i) feature extraction, which is spatially identifying and segmenting the convection zones over the east Pacific basin on both sides of the equator (208S-208N, 1808-908W), and (ii) state tracking, consisting of inferring the ITCZ over time. For the first component, feature extraction, the ITCZ is localized in each hemisphere via a backbone path that maximizes the intensity value of the zonally summed pixels along the path. Subsequently, a region-growing algorithm is applied with seed points obtained from the backbone path to determine the spatial extent of the clouds associated with the ITCZ in each hemisphere while simultaneously suppressing other cloud formations. Examples of the backbone path and the segmentation mask based on a VIS image can be found in Figs. 2 and 3 of Henke et al. (2012) . A set of meaningful ITCZ features can be derived from the backbone path, the segmentation mask, and the complete satellite image. A subset of these features [see appendix B in Henke et al. (2012) ] serves as input to the second component, state tracking. State trackinga hybrid semisupervised approach, based on hidden Markov models and support vector machines-enables the classification of a time series of satellite images into mutually exclusive ITCZ states. First, the model parameters are learned based on a small subset of expertlabeled images with one label per day. This allows for a fully supervised situation for the VIS data where only one satellite image is available per day (for the entire longitudinal range) but a semisupervised situation for the IR, which has eight images available per day, only one of which has been manually labeled. Second, for an unknown image sequence, the current ITCZ state is estimated based on the previous state of the system (ITCZ state in the previous time step) and the current observations (image features at the current time step) leading to ITCZ classifications with similar accuracy as human expert labelers [for details on the algorithm and performance, see Henke et al. (2012) ].\nIn Henke et al. (2012) , the method was applied to a small set of GridSat data for February-May 2000-04 only, and ITCZ states were grouped in four classes: nITCZ, sITCZ, dITCZ, and aITCZ.\n1 The current study expands on the methods outlined in Henke et al. (2012) by including all available IR images in the GridSat dataset. The ITCZ state is assigned 3-hourly and yearround from 1980 to 2012. The longer dataset required a modification to the original algorithm: the inclusion of an additional fifth ITCZ state, the eITCZ state. It is needed to accommodate the cloud pattern seen during strong east Pacific El Niño years (most notable in 1981/82 and 1997/98) when convection in the east Pacific is located on the equator and covers a broad north-south band. This type of convection does not fit into one of the four states defined in Henke et al. (2012) and did not occur in the 2000-04 test period. Adding the eITCZ state required some additional manual labeling that includes eITCZ days (total learning set: February-May of 4 years) and minor modifications to the model. Although the VIS version of the method was also executed, in this paper we only use results based on IR images because of the longer temporal coverage.\nOnly images from February-May are used for manual labeling, but the method appears to produce accurate estimates of ITCZ states year-round, based on manual inspection of the results. For analysis, daily ITCZ state labels were often more desirable than the 3-hourly labels. Daily labels were assigned by choosing the state that occurred most often during the eight observational times each day. Figure 1 shows the time distribution of daily ITCZ states from 1980 to 2012, where the vertical axis shows the year increasing downward and the horizontal axis shows the month. The figure shows the seasonality and interannual variability of ITCZ states. January-April is characterized by considerable variability when the ITCZ state changes often and the nITCZ, dITCZ, sITCZ, and aITCZ states all occur frequently. The remainder of the year is less variable with the nITCZ state dominating (white in Fig. 1 ) with a few exceptions. Late 1982 and 1997 were characterized as parts of major El Niño events with high incidence of double and equatorial ITCZ states. These two El Niño events continue into early 1983 and 1998, respectively, with overwhelming incidence of the equatorial ITCZ (eITCZ). As discussed in section 2b, the equatorial ITCZ was introduced specifically to account for strong east Pacific El Niño events as the eITCZ only occurs when a warm mixed layer replaces the east Pacific equatorial cold tongue."}, {"section_title": "Results", "text": ""}, {"section_title": "a. Distribution of ITCZ states", "text": "The seasonality is further depicted in Fig. 2 , which shows the average fraction of time spent in each state by month. The eITCZ state has been excluded in this figure because it only occurs frequently during the two eastern Pacific El Niño events in 1998 and 1983. Figure 2 shows that the nITCZ is the most frequently observed state in all months and it is especially dominant in May through January. It is only in March and April that the dITCZ state is a close second. The number of days when the ITCZ is absent peaks in February. In May there is a sharp drop in the number of days classified as states other than nITCZ and the nITCZ state clearly dominates until the following January or February when the aITCZ state picks up again. Of all the months, March and April are perhaps the most interesting in terms of ITCZ state because this is when the occurrence of the dITCZ is comparable to that of the nITCZ. Overall, the distribution between states is the most similar in March-April. In sections 3b, 4, and 5 in this paper, our analysis of ITCZ states is focused on March-April only.\nIn addition to the seasonal changes in ITCZ state, Fig. 1 also indicates the interannual variability, which is further highlighted in Fig. 3 (for March-April only). While the seasonality described above holds true for most years, there are clear exceptions. From Fig. 1 , it can be seen that the rarely occurring eITCZ state dominates from January to May in 1983 and 1998. Both were strong east Pacific El Niño years. In some years, such as 1989, 1999, 2000, 2006, and 2009 , the sITCZ state is frequently present in March-April whereas in other years, such as 1980-83, 1993, 2003-05, 2007, 2008, and 2010-12, it This initial look at the distribution of ITCZ states confirms that the instantaneous double ITCZ is frequently present in March-April during most years. On average, the nITCZ is present 39% of the time, the dITCZ is present 34%, the sITCZ is present 8%, and the ITCZ is absent (the aITCZ state occurs) 12% of the time in March and April. The eITCZ state was frequently present only in 1983 and 1998. In those two years it was observed in March-April 76% and 96% of the time, respectively. From here on we will focus on these two months and describe conditions in the tropical east Pacific during each ITCZ state."}, {"section_title": "b. Composites of ITCZ states in March-April", "text": "Precipitation fields are frequently used to depict the time mean ITCZ both in observations and model output. Using our data we can make composites of the time mean of different ITCZ states in terms of IR temperature or cloud-top temperature as well as other independent observations such as precipitation. Here we show MarchApril composites of cloud-top temperature and GPCP precipitation rate for different ITCZ states (Fig. 4) . The GPCP product spans only a subset of the time period for which ITCZ states are available (1997-2012 vs 1980-2012) ; however, the distribution of states during the shorter time periods is representative of the entire time period (not shown). We also made composites of TRMM precipitation (see Fig. S1 in the supplemental material) and found that the spatial distribution of precipitation in the two datasets is similar, although GPCP has coarser spatial resolution and tends to estimate somewhat lower rain rates than TRMM. Here we focus on GPCP precipitation because it includes one of the two east Pacific El Niño events when the eITCZ state dominates. Figure 4 shows composites of IR temperature and precipitation by ITCZ state in March-April. Typically the east Pacific ITCZ is most active in June-July (Bain et al. 2011) when it is almost exclusively located north of the equator (also shown in Fig. 2 ). Although we focus on March-April here, for context, the June-July climatology in IR temperatures is shown in Fig. 4b . The nITCZ dominates during these months as is evident by the clearly defined deep cloud band in the Northern Hemisphere. This is compared to the March-April IR temperature climatology, shown in Fig. 4a . In MarchApril the time mean cloud band is shallower with a secondary minimum in cloud-top temperature south of the equator, indicating a mixture of ITCZ states occurring during these months. The June-July IR climatology has a similar pattern to the March-April nITCZ composite (Fig. 4e) , although the deepest convection is located in the far eastern Pacific in June-July whereas in March-April it is located farther west. Overall, Fig. 4 shows the unique cloud and precipitation pattern associated with each ITCZ state.\nAs discussed above and indicated by the number of days in the figure titles to Fig. 4 , the nITCZ is the dominant state throughout the year including March-April. Distinct cloud and precipitation bands occur in the Northern Hemisphere and are absent in the Southern Hemisphere (Figs. 4e,f) . Even though there are fewer sITCZ days, the opposite general pattern is clear in the sITCZ composites: well-defined cloud bands in the Southern Hemisphere and little cloud and precipitation in the Northern Hemisphere (Figs. 4g,h) . Henke et al. (2012) commented on the spatial offset in longitude of the northern and southern parts of the dITCZ in five seasons of output derived from VIS data. We see the same phenomenon in the longer time series derived from IR data (Fig. 4c) .\nWe averaged the ITCZ-state composite fields in longitude over 908-1308W and in Fig. 5 we show the meridional profiles for different ITCZ states. This longitudinal range is limited toward the west. By excluding the far western part of the domain we avoid influence from the SPCZ. In addition to IR temperature (Fig. 5a ) and precipitation (Fig. 5b) we also computed the composite of the vertical velocity v at 850 hPa from ERA-Interim (Fig. 5c ). Dynamical fields are not available from satellite observations; however, the reanalysis fields, although influenced by the underlying numerical forecast model, can provide additional valuable insight. The ITCZ states are clearly displayed in Fig. 5 and the three independent fields are consistent. Figure 5 shows that the meridional profile of the sITCZ state has higher rainfall rates, cooler IR temperatures, and stronger vertical velocity than the nITCZ and dITCZ states in the longitudinal average. During the dITCZ state horizontally elongated cloud and precipitation bands are present on both sides of the equator at the same time. The dITCZ composite shows warmer cloud-top temperatures of the cloud bands and therefore lower clouds when compared to the nITCZ and sITCZ states (see Figs. 4c,d ). Figure 5b shows that the precipitation rate is also lower during the dITCZ state compared to sITCZ and nITCZ states. Deep clouds, rainfall, and strong vertical velocity during dITCZ days are located closer to the equator (both sides) than during sITCZ or nITCZ days.\nDuring the aITCZ state only isolated convection takes place in the east Pacific (Figs. 4k,l) . Interestingly, the SPCZ is particularly active during the aITCZ state. This will be discussed further in section 5. The IR temperature and GPCP composites during the eITCZ state (Figs. 4i,j) show a wide cloud band just south of the equator in the central Pacific and directly over the equator in the eastern Pacific. IR temperatures are quite cold in eITCZ composites, indicating widespread deep convection. In past studies such as Gu et al. (2005) and Zhang (2001) this signature was noted in monthly means during El Niño years. The central Pacific cloud band south of the equator is associated with the SPCZ, which migrates equatorward and takes on a more horizontal orientation during strong El Niño years (Haffke and Magnusdottir 2013; Vincent et al. 2011; Folland et al. 2002) .\nTo summarize, each ITCZ state is associated with a unique cloud and precipitation pattern. While it is not surprising that the aITCZ and nITCZ states, for example, have quite different cloud, precipitation, and vertical velocity profiles, other results are more intriguing. One might expect the Northern Hemisphere ITCZ in March-April to have the same characteristics whether it is classified as a nITCZ state or as the northern branch of the dITCZ state, but this is not the case. The northern branch of the dITCZ is different from the nITCZ in terms of location and intensity (as measured by rain rate and IR temperature), indicating that different conditions are present during the dITCZ state. Thus the simultaneous presence of the ITCZ in the Southern Hemisphere impacts the northern branch of the dITCZ, causing it to be less intense and located closer to the equator."}, {"section_title": "Conditions during ITCZ states a. SST associated with ITCZ states", "text": "Past studies have indicated that the underlying SST distribution is key to controlling the occurrence of the double ITCZ in the east Pacific on monthly time scales (Zhang 2001; Halpern and Hung 2001; Gu et al. 2005; Masunaga and L'Ecuyer 2010) . To see if the same is true for daily ITCZ states, we constructed composites of SST based on the ITCZ state. Composites of daily SST anomalies for the ITCZ states are shown in Fig. 6 where the anomalies are deviations from the March-April SST climatology. Two states emerge as being associated with important SST patterns that bear a strong resemblance to ENSO-related SST patterns. The eITCZ state is associated with a typical El Niño SST distribution (Fig. 6d) . Perhaps more unexpected is the SST signature associated with sITCZ in Fig. 6c , which resembles a La Niña-type SST pattern. This is consistent with the preliminary results from Henke et al. (2012) , whose analysis was based on only five seasons, one of which was a La Niña year with increased frequency of sITCZ. SST signatures associated with the remaining states are considerably weaker and transitions to and from the nITCZ, dITCZ, and aITCZ states appear to be more atmospheric driven than transitions to eITCZ and sITCZ. Figure 7a shows the longitudinally averaged (over 908-1308W) SST composite by state as a function of latitude. The equatorial cold tongue and the profile south of the equator are quite similar in the four ITCZ states, varying by less than 0.58C on average, but the eITCZ has a different signature. Temperatures at the equator are coolest, on average, during sITCZ states (see also Fig. 6c) . The difference in the longitudinally averaged SST between the four states is only statistically significant north of 2.68N based on a Student's t test with a critical level of 0.05. This suggests that while the equatorial cold tongue SST is important for developing the mean double ITCZ on monthly time scales (Zhang 2001; Halpern and Hung 2001; Gu et al. 2005; Masunaga and L'Ecuyer 2010) , the occurrence of an instantaneous double ITCZ is less sensitive to this value. The largest difference in SST between the different states is in the Northern Hemisphere where, on average, a spread in average SST is present between 2.58 and 138N.\nPrevious studies (e.g., Raymond et al. 2006 ) have associated the location of the east Pacific ITCZ with regions of maximum meridional SST gradient, either poleward or equatorward of the maximum in SST depending on longitude (Bain et al. 2011) . It is therefore of interest to examine the latitudinal derivative of the SST profiles and these are displayed in Fig. 7b . Among the non-ITCZ states, the SST gradient has the largest values on each side of the equatorial cold tongue, differing in amplitude and not location. Gu et al. (2005) found in monthly mean data that during the double ITCZ, maximum rainfall is located poleward of the maximum SST; Lietzke et al. (2001) found that maximum rainfall in the monthly mean double ITCZ is located equatorward of the maximum SST. Gu et al. (2005) attribute this inconsistency to differences in the datasets used (TRMM-vs Microwave Sounding Unit-derived precipitation). Results here indicate that the relationship between the latitude of maximum SST, maximum rainfall, and minimum IR temperature is slightly more complicated and depends on the hemisphere being described (cf. Figs. 5 and 7) . Maximum rainfall and deep convection in the dITCZ are located equatorward of the maximum SST in the Northern Hemisphere and poleward of the maximum SST in the Southern Hemisphere. Furthermore, maximum SST is located closer to the equator during dITCZ cases compared to nITCZ or sITCZ cases, but the largest difference in SST profiles is between the Southern and Northern Hemisphere, regardless of state. Maximum SST is located around 28 closer to the equator in the Southern Hemisphere. This difference between hemispheres is minimized or nonexistent when comparing precipitation rate or IR temperature (cf. Figs. 5 and 7). While the difference in the location of maximum SST and maximum rainfall or IR temperature may be due to the datasets used, it can also indicate a lack of a simple relationship between SST and ITCZ position in the east Pacific on this time scale.\nNote that although the highest SST is found in the Northern Hemisphere, the same is not true for precipitation rate, again pointing to a disconnect between ITCZ activity and SST amplitude. Even during the sITCZ state when the highest precipitation rates are found in the Southern Hemisphere, SST is higher in the Northern Hemisphere.\nb. Large-scale circulation associated with the ITCZ state Small differences in SST patterns between the three ITCZ states (nITCZ, dITCZ, and aITCZ) suggest that atmospheric dynamics may play an important role in determining the occurrence of these states. To assess the large-scale atmospheric circulation associated with each state, composites of daily anomalies of streamfunction c and velocity potential x are computed using the following method. Daily c and x are calculated at 850 and 200 hPa using the daily averaged horizontal wind field from ERA-Interim. The daily values are averaged over all years and then we apply a 15-day running average to create a climatology. We use the climatology to compute daily c and x anomaly fields. Composites of the anomalies are then created based on ITCZ state during March-April, providing a global circulation pattern associated with each state at both levels.\nAfter an initial look at the composites, it was clear that anomalies for the eITCZ state were much larger than for the other states (Figs. 8i,j) , and the impact of this state on the climatology was overwhelming. We computed the daily c and x anomalies again, this time from a climatology in which days belonging to the eITCZ state were excluded. Composite anomalies from this second method are shown for the 850 hPa fields in Fig. 8 for the dITCZ, nITCZ, sITCZ, and aITCZ states. The c-and x-anomaly composites for the eITCZ state were computed using the original method (all data). Figure 8 only shows anomalies that are statistically significant based on a two-sided t test with a critical significance value of 0.05. We found that the 200-hPa c and x generally complement the fields of c and x at 850 hPa and therefore Fig. 8 only shows the 850-hPa level. The composites at 200 hPa are included in the supplemental material (Fig. S2) . Distinct c and x anomaly patterns emerge for each ITCZ state. The sITCZ and nITCZ states have opposite patterns in terms of c, particularly at upper levels (Fig. S2) . During the nITCZ (sITCZ) state, upper-level westerlies are weaker (stronger) at the equator and While the circulation patterns for the nITCZ and sITCZ states generally indicate opposite circulation anomalies, the dITCZ state has a circulation pattern that is quite different. The x anomalies (Fig. 8b) indicate a clear pattern of enhanced convection over the east Pacific, both north and south of the equator, accompanied by suppressed convection over Africa and the Indian Ocean. In fact, if the eITCZ is excluded, this is the only state where the x field suggests that convection should be enhanced in the east Pacific, and the maximum x anomaly lies quite close to the equator. This is consistent with the equatorward shift of the cloud and precipitation bands associated with the double ITCZ compared to their location for the nITCZ and sITCZ states. The c anomalies during the dITCZ (Fig. 8a) are rather small, although significant, and do not indicate a clear pattern.\nDuring the aITCZ state at 850 hPa there is divergence north of the equator in the central Pacific and convergence over South America. In the region of the SPCZ the c anomalies during the aITCZ state resemble those during the eITCZ state, although considerably weaker in amplitude. During the aITCZ case, SPCZ activity is enhanced and shifted equatorward and eastward, similar to what happens during El Niño. Velocity potential patterns, particularly at 200 hPa, indicate suppressed convection north of the equator in the central to east Pacific, and enhanced convection south of the equator in the central Pacific, near the SPCZ (Fig. 9) .\nStrong c and x anomaly patterns are present at both levels for the eITCZ composite (Figs. 8i,j) . They are quite different from the other states and largely resemble the circulation patterns seen during strong El Niño events. Velocity potential anomalies are consistent with enhanced deep convection in the east Pacific, as seen in strong negative (positive) x anomalies at 200 hPa (850 hPa) and a weakening of the Pacific Walker circulation."}, {"section_title": "Connection to the SPCZ", "text": "Enhanced SPCZ activity was apparent during the aITCZ state in IR and rainfall composites (Figs. 4k,l) . In addition, negative x anomalies at 200 hPa in the central Pacific, south of the equator in the SPCZ region, suggest enhanced convection during the aITCZ state (Fig. 9) . To further explore the potential connection between the Southern Hemisphere central Pacific and eastern Pacific, a dataset of SPCZ labels outlining the location and areal extent of the SPCZ every 3 h from 1980 to 2011 (Haffke and Magnusdottir 2013 ) is used to examine SPCZ activity during different east Pacific ITCZ states. For this analysis we focus on March only because the aITCZ state is more frequent in March than in April, occurring 18% of the time in March versus only 6% of the time in April. Times identified as eITCZ have been removed from this analysis because SPCZ anomalies during the other east Pacific ITCZ states were overwhelmed by SPCZ anomalies during the eITCZ state. Figure 10 shows composites of SPCZ anomalies by ITCZ state for March. SPCZ anomalies are computed by subtracting the composite of SPCZ activity during all days in March from the composite of SPCZ activity during each ITCZ state in March.\nThe SPCZ is suppressed during the dITCZ state and even more so during the sITCZ state, indicated by negative fraction of time present anomalies along most of the SPCZ (Figs. 10a,c) . During nITCZ events (Fig. 10b) the SPCZ looks more like climatology (not shown) but small negative anomalies are found equatorward and to the east of the typical SPCZ location. During the aITCZ state, SPCZ activity is enhanced, especially on the northeastern margin and slightly decreased on the southwest margin, indicating that SPCZ activity shifts eastward (Fig. 10d) . Negative x anomalies are collocated with the increased SPCZ activity at 200 hPa, indicating enhanced convection in this region (Fig. 9b) .\nThe connection between the central and east Pacific is also apparent in patterns of anomalous precipitation from ERA-Interim. Figure 11 shows composites of ERAInterim daily precipitation anomalies composited by ITCZ state for March and April. Precipitation anomalies were calculated using the method that was described in section 4b. When the ITCZ is suppressed (aITCZ state), precipitation is enhanced in the SPCZ but suppressed in the Northern Hemisphere western Pacific."}, {"section_title": "Concluding remarks", "text": "We classified the east Pacific ITCZ into five different states: nITCZ, sITCZ, dITCZ, aITCZ, and eITCZ based on the configuration of zonally elongated areas of convection.\nThree-hourly GridSat IR satellite images are examined and by using a statistical model the state of the east Pacific ITCZ was determined from 1980 to 2012. We find that the nITCZ state occurs more often than any other ITCZ state throughout the year and dominates in summer and fall when ITCZ-state variability is low. Variability is high in the boreal spring when all states occur frequently, especially in March and April. During this time the nITCZ state occurs 39% of the time, the dITCZ state occurs 34% of the time, the aITCZ state occurs 12% of the time, and the sITCZ occurs 8% of the time. To the best of our knowledge, this is the first time that the state of the east Pacific ITCZ has been assessed on daily and subdaily time scales over a 33-yr period. This study provides the first look at the frequency of the south-only ITCZ and the instantaneous double ITCZ in a long-term dataset.\nComposites of IR temperature, precipitation, and v based on ITCZ state during March-April highlight the structure of the cloud and precipitation bands associated with each state. The three independent fields are consistent and show that the dITCZ state has shallower convection and lower rain rates compared to the sITCZ and nITCZ states. In addition, the precipitation and cloud bands tend to be located closer to the equator during the dITCZ state compared to the nITCZ and sITCZ states.\nFrom composite analysis we find that only eITCZ and sITCZ states are associated with strong SST anomalies, suggesting that that these two ITCZ states are more strongly driven by ocean dynamics than the other states, which incidentally show more variability on the intraseasonal time scale. The similarity in SST between the nITCZ, dITCZ, and aITCZ states suggest that ocean variability may not be the dominant factor controlling the fluctuations between these daily ITCZ states. In contrast, we find that the large-scale atmospheric circulation pattern for each ITCZ state is locally quite unique. Composites of daily x anomalies by ITCZ state show patterns of suppressed and enhanced convection in the east Pacific that are consistent with cloud band and precipitation activity. During the nITCZ state a region of low-level divergence indicating suppressed convection is found in the Southern Hemisphere while during the sITCZ state surface divergence is found in the Northern Hemisphere. Interestingly, if the eITCZ is excluded, the dITCZ state is the only state in which the x composite indicates statistically significant anomalous low-level convergence, indicating enhanced convection in the eastern Pacific. The convergence at 850 hPa is located directly over the equator, consistent with the cloud and precipitation bands being located closer to the equator during the dITCZ state compared to the nITCZ and sITCZ states.\nWe note a clear connection between activity in the east Pacific ITCZ and the SPCZ in the west-central Pacific. When the east Pacific ITCZ is absent the SPCZ is enhanced, with anomalously high activity equatorward of the mean position. When the east Pacific ITCZ is active, particularly during the sITCZ state, the SPCZ is suppressed. This indicates changes in the Walker circulation connecting the western and eastern parts of the Pacific. The large scale-circulation, shown in x and c anomalies in Fig. 8 , also indicates this connection.\nThe dataset of east Pacific ITCZ state could be a valuable tool for assessing global climate models. Currently, it is not known whether climate models produce a distribution of states similar to what we find in observations. Furthermore, our results indicate that only the eITCZ and sITCZ states are strongly influenced by the underlying ocean. It would be of interest to examine similar features in the output from global climate models."}]