[{"section_title": "", "text": "A ѠђћѠђ ќѓ urgency aĴ ends the study of species of concern, like the Cerulean Warbler (Dendroica cerulea). Sharpened by Robbins et al. (1992) and Hamel (1992) , such concern prompted the U.S. Department of the Interior, Fish and Wildlife Service (USFWS) to commission a status assessment of the Cerulean Warbler (Hamel 2000a) . Shortly aĞ er the status review was published, a petition (Ruley 2000) was delivered to the USFWS urging that the species be listed as \"threatened\" under the Endangered Species Act of 1973. The account of the Cerulean Warbler in the Birds of North America series also appeared that year (Hamel 2000b) . Substantial aĴ ention is currently focused on the species, and the Cerulean Warbler Technical Group (CWTG) was formed in 2002 (see Appendix).\nThis overview consists of two parts. The fi rst, prepared primarily by P.B.H., aĴ empts to summarize current knowledge and suggest productive avenues to pursue in our eff orts to understand the biology and conserve populations of Cerulean Warblers. The second, wriĴ en by D.K.D. and P.D.K., is a summary of the structure and priorities of the CWTG, an organization that can spur and facilitate research and conservation action directed at this species and serve as a model for conservation of other forest birds (Appendix). Further information on Cerulean Warblers and activities of the Cerulean Warbler Technical Group can be found on the CWTG website (see Acknowledgments)."}, {"section_title": "Wѕюѡ Hюѣђ Wђ Lђюџћђё юяќѢѡ CђџѢљђюћ WюџяљђџѠӓ", "text": ""}, {"section_title": "Breeding season population trends and distribution.-Rangewide declines in populations of", "text": "Cerulean Warblers on the breeding grounds, estimated from the North American Breeding Bird Survey (BBS), established the species as worthy of conservation aĴ ention. Link and Sauer (2002) used Cerulean Warbler BBS data as a vehicle to describe a hierarchical method to analyze population trend data, establishing in the process an annual population decline of 3.04% during 1966-2000. The BBS data (Sauer et al. 2003 ) also showed that, since the late 1960s, the documented range of Cerulean Warblers has shiĞ ed to the northeast (Fig. 1) . That assertion results from the following analysis. In each year of the BBS, the center of the breeding range was calculated to be the abundance-weighted centroid of latitude and longitude of routes on which the species was recorded, adjusted for routes not run that year. Multivariate analysis of variance-of-range centroid latitude and longitude in the fi rst 10 years, middle 16 years, and last 10 years of the BBS indicated a highly signifi cant eff ect (for latitude: F = 18.05, df = 2 and 33, P < 0.0001, R 2 = 0.52; for longitude: F = 38.4, df = 2 and 33, P < 0.0001, R 2 = 0.70). Results further indicated that the centroid of longitude has moved ∼1° to the east in each of the three periods tested, whereas the centroid of latitude has moved ∼0.5° northward, principally between the early and middle periods tested. Two factors that warrant consideration in explaining that apparent range shiĞ are land-use and climate changes, either shortor long-term.\nField techniques.-Cerulean Warblers are very diffi cult to study in the fi eld, regardless of terrain, because of their canopy nesting and foraging habits. Fortunately, we have learned some important techniques that facilitate study of the species. For example, surveying for birds can be done eff ectively along streams from a canoe (Robbins et al. 1998) . We have determined that [Auk, Vol. 121 density aff ects their detectability on point counts (Jones et al. 2000) . We have learned that Cerulean Warbler males will respond to carved wooden decoys and can be captured in either elevated or ground nets. We have made progress on the challenging task of fi nding nests (Barg 2002) . We have made a solid start on study of their vocalizations (Woodward 1997); however, more of the call notes should be documented. We have developed primers that can be used with both nuclear and mitochondrial DNA to evaluate the genetic structure of local as well as rangewide populations (Veit 1999). We have developed stable isotope signatures of breeding populations (Girvan 2003) . Contributions of the group at Queen's University have been the genesis of much new information, not least of which is the fi rst aĴ empt at estimating the demographic status of a population (Jones et al. 2004 ). Finally, we have learned that these high-profi le birds of conservation concern can be surveyed by the \"citizen science\" model pioneered in the Cerulean Warbler Atlas Project (CEWAP; Rosenberg et al. 2002) .\nThese wonderful accomplishments off er hope that the remaining challenges will also be met. We still lack an eff ective way to capture females.\nWe cannot yet reliably locate, capture, and study fl edglings and recently independent young birds. We have only minimal understanding of plumage variability and of gender-specifi c diagnostic features useful for distinguishing more than two age classes.\nEcology.-We have made enormous strides in understanding Cerulean Warbler ecology, thanks to the work of multiple study teams in various parts of the range. We have learned, importantly, that the birds use upland habitats (particularly ridgetops) at least as frequently as boĴ omland habitats (Rosenberg et al. 2002 , Weakland and Wood 2002 , Bosworth and Wood 2003 , Nicholson 2003 . We have learned that vegetation structure at the microsite scale is critical to the birds (Jones and Robertson 2001), and we are making progress toward quantifying it explicitly (Jones et al. 2001 , Barg 2002 .\nGenetic study of population structure (Veit 1999) showed that the Cerulean Warbler population is properly considered a single genetic population (Veit 1999) . Dispersal of distances representing more than the radius of the entire breeding range has occurred within a single generation (Veit 1999) . Analysis of stable isotopes of the plumage has further suggested that individuals may make substantial movements between breeding seasons (Girvan 2003). Those fi ndings have enormous importance for conservation of the species, for they imply that a single population of birds is the target of conservation, and that adult birds are capable of considerable dispersal.\nWe have learned that Cerulean Warblers may respond to disturbance in diff erent ways in different parts of the breeding range. Study sites in southern Arkansas and in Ontario experienced severe modifi cation to vegetative structure as a result of winter ice storms. The Ontario population, by all accounts a large one, responded to the storm by a one-year reduction in reproduction in the breeding season following the storm (Jones et al. 2001) , whereas the Arkansas population declined to the point of disappearance from the study area (P. Hamel unpubl. obs.). Response of a third population, in the Cumberland Mountains of Tennessee, to an unprecedented tornadic episode is unreported.\nThe bold aĴ empt to estimate demographic parameters by Jones et al. (2004) is a signifi cant achievement. They concluded that survival and productivity as measured in the Ontario population may be insuffi cient to maintain its numbers. However, a defi nitive assessment will require additional eff ort at that and other sites to separate losses to mortality from losses to emigration. The work of Girvan (2003) demonstrated that emigration by adults occurs. Nevertheless, if the true survival rate of the Ontario study population is insuffi cient for the population to maintain itself, the estimated time to extinction is uncomfortably short (table 2 in Jones et al. 2004) . Those results are disturbing, because it has been my hope that the Ontario population (Rosenberg et al. 2002 ) is in fact serving as a source population for Cerulean Warblers. Especially sobering is the absence in their population of any nest parasitism by Brown-headed Cowbirds (Molothrus ater). In the western part of the breeding range, and portions of the range where landscapes include substantial proportions of agriculture, Cerulean Warbler populations experience measurable parasitism (Hamel 1998).\nManagement.-Habitat loss is assumed to be the primary factor driving the decline of Cerulean Warbler populations. One landscape-scale study examined distribution of the Cerulean Warbler in the Lower Mississippi Alluvial Valley (LMAV) and showed a positive association between occurrence of the birds and forest cover within 4-8 km, and a strong negative association to proportion of agricultural land at such distances (Hamel et al. 1998) . In West Virginia, abundance and territory density had a positive association with forest cover in the landscape and a negative association with large-scale edge created by mining activities (Weakland and Wood 2002, Bosworth and Wood 2003) . Population growth in the northeastern portion of the range has been aĴ ributed to natural regeneration of forest on abandoned agricultural lands (Oliarnyk and Robertson 1996) . Positive response of the birds to habitat management has been documented by D. A. Buehler (pers. comm.) in Tennessee and anecdotally by F. Thompson III (pers. comm.) in Missouri. That suggests that management activity, such as silviculture, can create or improve habitat for Cerulean Warblers (Hunter et al. 2001) . Two papers discuss habitat management for the species in boĴ omlands (Hamel 2004) and in upland forests (Hamel et al. 2004) . Monitoring Cerulean Warbler response to experimental manipulation of habitats is an important way for us to identify which elements of vegetation structure are important to the birds and how to produce them on the landscape.\nLimitations to our knowledge.-We lack vital information on the behavior and population ecology of Cerulean Warblers. Details of the mating system and seĴ ling paĴ erns of the sexes have been studied in several areas, but small numbers of birds (and inability to capture females [Auk, Vol. 121 reliably) has retarded progress in understanding dispersion, local movements, and dispersal of individuals. Similarly, the diffi culty of locating nests and, especially, of observing their contents has constrained our knowledge of incubation and nest life to a single study (Oliarnyk and Robertson 1996) . Published demographic information on the species is confi ned to that work, its successor (Jones et al. 2004), and Nicholson (2003) . None of us has been able to study juvenile survivorship, postbreeding dispersal, or other features of the postbreeding, molting, or premigratory periods. The species' association with canopy gaps and with particular plant species (Gabbe et al. 2002) are continuing issues awaiting resolution.\nHowever, most glaring is our ignorance of Cerulean Warbler distribution and ecology during the nonbreeding season (Hamel 2000a, b) . Only two studies from the South American wintering grounds have been published to date, from one Venezuelan study site (Jones et al. 2000 (Jones et al. , 2002 . Unpublished information on the nonbreeding biology has been presented to the CWTG and to its subcommiĴ ee, El Grupo Cerúleo, and a presentation was made at the VII Neotropical Ornithological Congress. Interestingly, those few contributions have clarifi ed some of the assertions made by Robbins et al. (1992) . We now have evidence to suggest that the South American range is shrinking from south to north, that the elevational range of the species is probably wider than the 500-1,500 m band previously considered, and that the species is not restricted to primary forest. Far more work needs to be done on the nonbreeding biology of the birds, including an assessment of habitat-specifi c fi tness (Rappole et al. 1989 , Marra et al. 1993 )."}, {"section_title": "HќѤ HюѠ TѕіѠ Bђђћ AѐѐќњѝљіѠѕђёӓ", "text": "Prior to Robbins et al. (1992) , two isolated fi eld studies of Cerulean Warblers were underway, in southern Illinois and in Tennessee. Since then, Cerulean Warbler research has been conducted in the LMAV (since 1992), in Ontario (since 1994), and in the Cumberland Mountains of Tennessee (through the 1990s). More recently, studies have begun in the Arkansas Ozarks, in southern Indiana, in West Virginia, in Pennsylvania, and in New York. In addition, the CEWAP (Rosenberg et al. 2002) , an eff ort to determine the species' population status and habitat requirements, was launched in 1997. These are eff orts of independent teams, each with knowledge of each other's work, but without coordination or central fi nancing. A replicated experimental breeding-season study proposed by the CWTG would constitute a coordinated, large-scale eff ort to address information needs. Those eff orts, and establishment of the CWTG, have arisen from the recognition that detailed information on Cerulean Warblers is required to beĴ er understand their biology and to translate that understanding into specifi c management and conservation actions that can benefi t this and other forest-breeding songbirds."}, {"section_title": "HќѤ DќђѠ TѕіѠ Fіѡ іћѡќ ѡѕђ Bџќюёђџ PіѐѡѢџђ ќѓ Bіџё CќћѠђџѣюѡіќћ іћ Gђћђџюљӓ", "text": "Despite the recent gains in our knowledge of Cerulean Warbler ecology, the reasons for their population declines remain unclear. Demographic studies across the range of the species, during both the breeding and nonbreeding periods, are necessary to identify the stage or season of the annual cycle where problems may lie. That information is critical to focusing eff ective conservation eff orts on behalf of the species. The work of Jones et al. (2004) is a very solid step in that direction.\nThe CWTG may further serve as an example for concentrating and coordinating research, monitoring populations, and implementing conservation of forest bird species (see Appendix). The underlying philosophy of this and similar ad hoc conservation groups, like the Louisiana Black Bear (Ursus americanus luteolus) Conservation CommiĴ ee, is twofold, summarized colloquially as (1) drawing circles to include and (2) leaving agendas at the door.\nWhat we hope to do next is to initiate additional, detailed demographic studies on the breeding grounds as identifi ed by the CWTG and on the nonbreeding grounds as identifi ed by El Grupo Cerúleo, and studies of the distribution and movements of the birds through Central America in migration, especially in spring. We can implement this work in such a way that conservation and management implications are reasonably clear. Our land managers can then put management-relevant fi ndings into action on the ground so that more habitat is produced that is suitable for increasing and sustaining numbers of Cerulean Warblers. The costs of these activities will be substantial but probably lower and more productive than expensive litigation. Jones et al. (2004) The basic premise of the group was to develop a broad-based, technically sound approach to conservation of the Cerulean Warbler, preempting the contentious and unproductive approach that could otherwise result if the species is listed. The eff ort was loosely modeled aĞ er the very successful Louisiana Black Bear Conservation CommiĴ ee, formed in the early 1990s for much the same purpose. Too oĞ en in the past, endangered species conservation issues and listing actions have been characterized by controversy, misinformation, mistrust, and gridlock. By seizing the initiative and bringing a number of key stakeholders and technical experts together, the CWTG seeks to keep the focus on identifying meaningful conservation solutions through sound science, clear communication, and trust. In December 2002, the CWTG met again at the National Conservation Training Center (NCTC) in Shepherdstown, West Virginia, at a workshop sponsored by the U.S. Geological Survey (USGS) and USFWS. Invitations to participate were extended to others knowledgeable or interested in Cerulean Warblers, broadening the representation from state agencies in particular, while maintaining a balance of participants from a wide variety of organizations. In addition, several biologists from Colombia, Ecuador, and Venezuela were brought to the workshop, broadening the scope of the group beyond the breeding grounds to consider issues relevant to conservation of Cerulean Warblers on the wintering grounds. In total, 65 people participated in the workshop.\nThe main purpose of the workshop was to develop a proactive, broad-based, and cohesive strategy for Cerulean Warbler conservation. The workshop opened with a day of short presentations, designed to provide information and generate discussion, but thereaĞ er participants worked primarily in smaller groups to discuss and re-evaluate the information and conservation needs prioritized in Knoxville and to develop action plans to address them. Goals formulated at the workshop, and progress toward accomplishing them, are summarized below.\nThe Breeding Season Research Group developed a research design involving multiple study areas across the breeding range, with replicate sites within study areas, and a common set of data collected across study areas. In the core of the breeding range, manipulative experiments would be implemented to address Cerulean Warbler response to forest management, but study areas elsewhere could address other land-use or landscape issues. That approach would increase knowledge of Cerulean Warbler demography and ecology across the breeding range and provide insights to the key factors that limit populations and to forest management prescriptions that could benefi t the species. In spring 2003, the project was endorsed by the Northeast and Southeast working groups of Partners in Flight as the highest research priority for forest songbird conservation. Planning is underway to implement this eff ort during the 2004 fi eld season.\nPriorities for the Breeding Season Surveys and Monitoring Group are to more completely map Cerulean Warbler distribution, to improve regional and global estimates of population size and trend, and to integrate inventory and monitoring eff orts with predictive modeling. Planned actions include fi lling gaps in coverage in the Cerulean Warbler Atlas Project (CEWAP) by implementing new surveys on national and private forestlands, monitoring Cerulean Warbler populations at hot-spots or at sites with historical data, working to improve the North American Breeding Bird Survey for Cerulean Warbler in particular and for conservation applications in general, and developing a strategy to model Cerulean Warbler distribution and abundance within regions and range-wide. Already, the major forestproducts companies and coal producers in the mid-Appalachians have come together in partnership with the National Council for Air and Stream Improvement (NCASI) The Non-Breeding Season Group, El Grupo Cerúleo, promotes a multispecies approach to habitat conservation on the wintering grounds, which includes other at-risk species that co-occur with Cerulean Warblers. Other goals are to develop a network of observers and a database to compile documented observations of Cerulean Warblers and beĴ er defi ne their winter range, to conduct a regional analysis of habitats and other available information to assess threats and conservation coverage, to develop and encourage fi eld research on Cerulean Warbler winter ecology and response to land-use changes, and to identify and encourage opportunities for outreach and education to communicate awareness of nonbreeding-ground and migratory bird issues, thereby promoting linkages between countries. In March 2003, this group met in Ecuador with biologists from throughout northern South America to discuss conservation of the Cerulean Warbler, other Neotropical migratory birds, and resident bird species of concern. They have already made substantial progress toward achieving several goals, including compilation of existing information on Cerulean Warbler on its wintering grounds, and development of a Geographic Information System database that will allow for assessment and monitoring of Cerulean Warbler habitats. The U.S. Department of Agriculture Forest Service (USFS) and The Nature Conservancy (TNC) recently joined together to provide funding for South American biologists to conduct new research on Cerulean Warblers, starting in winter 2003 and 2004.\nThe foundation was laid at the NCTC workshop to continue coordinated and collaborative actions on behalf of the species. CommiĴ ees were formed to [Auk, Vol. 121 further the tasks identifi ed by the work groups, and a steering commiĴ ee was appointed to spur action and chart future activities and directions. The Cerulean Warbler Technical Group is moving forward on the premise that the most successful conservation eff orts are those that bring together broad partnerships and leave personal agendas outside the door. This partnership is founded on the combined perspectives and resources of industry, state and federal government, nongovernmental organizations, and universities, in the United States as well as in Canada and South America. The CWTG is dynamic, strong, and eff ective, and has already made signifi cant achievements, promising much for the conservation of Cerulean Warblers and of forest songbirds in general."}]