[{"section_title": "L ist o f Tables", "text": "Rotary sonar scan sequences variables determined to be the optimal initial settings in a cohesive, fine-grained, estuarine environment. Cruise date, location, and station numbers. Percent water content by weight of wet sediment, percent organic content by weight o f dry sediment, and percent disaggregated sand-sized content by weight o f dry sediment. Depth listed is center o f 1-cm sample interval. Dashes indicate no data or bad data. Phi class mud content by weight as percent of dry mud as determined by disaggregated grain pipette analysis. Depth listed is center o f each 1-cm sample interval. Dashes indicate no data or bad data. Weights o f sediment for sieve intervals from 10.00 g o f wet sediment. Dashes indicate no data or bad data. Beryllium activity in dpm/gram dry sediment (including sand), ± confidence interval, corrected for decay between time of core collection and analysis. Zero values indicate no ?Be peak detected. Dashes indicate no data or bad data. 7Be inventory in units of dpm/cm2 integrated over the top 1 0 cm o f each core is displayed in the final row. Eroded mass and critical erosion stress calculated from erodibility experiments. Correlation r-values and p-values. Correlations with p < 0.1 or 0.1 < p < 0 . 2 highlighted by dark or light shading, respectively Cruise survey dates, day elapsed between sampling, and the tidal regime during the bathymetric surveys. Estimated mean speed of sound velocities for each survey based on Coppen's (1981) equation as a function o f temperature, salinity, and depth. Seabed elevation for ground control points, along with calculated bathymetric change between surveys. The December survey was used as the baseline bed elevation for this study. The overall average bathymetric change value between cruises was used as the shift variable to align seabed elevations with the December survey. Map o f Chesapeake Bay, highlighting the bathymetry and turbidity maximum zones throughout the region. The study area is 29 delineated by a star, located in the Clay Bank region o f the York River (modified from Newell et al., 2004)."}, {"section_title": "L ist o f Figures", "text": "The York River biological and physical gradient. X-rays: West Point ~ June 1981 (Schaffiier et al., 2001), Clay Bank STM ~ February 2009, Clay Bank no STM ~ March 2009, Ĝ loucester Point ~ February 2009, and Chesapeake ~ January 1995(Schaffiier et al., 2001. Study location for the VIMS rotary tripod ~ Clay Bank within the York River Estuary. The tripod location is delineated by the red 5 * triangle. A depiction of the real-time rotary sonar capabilities developed utilize IrisLink software and a communication cable, extending from the instrument to a radio modem, that deliver data back to 52 the lab at the Virginia Institute o f Marine Science. The two-way connection allowed for in-situ tuning o f the sonar images, as well as real-time observations. a) A Clay Bank 1 MHz rotary scan image, 1 meter above the bed (Range ~ 10m, 24dB gain), b) Diagram showing the 4 transects 54 analyzed for acoustic backscatter comparison. Wind speed, river discharge, and tidal data that correlated to the ê arly rotary sonar studies in the York River. Sidescan sonar surveys during rotary sonar deployment in order to correlate rotary sonar images to seafloor morphology changes. (a) The first survey showed well-developed longitudinal furrows extending up to 150m in length and 0.5 to 1 meter wide, occurring shortly after a large storm event with heavy winds. The left image highlights the location of the rotary tripod and the 56 image on the right shows a furrow with an old piling or similar structure within the bedform. (b) The second survey was conducted at the end o f the rotary sonar deployments and illustrates a smoother bottom and the same furrow with less definition. Time series o f backscatter amplitude at 5 meters from the rotary 5 7 transducer along o f the 4 transects (45°, 90°, 180°, and 225°)."}, {"section_title": "VIII", "text": "Conceptual diagram o f York River furrow morphologic change throughout the study. As winds increased during the rotary sonar deployment, sediment was deposited within the furrow and then was eroded after the stormy conditions subsided. Map o f York River Estuary. Location o f Clay Bank study site indicated by the black dot. Locations o f EPA long-term monitoring stations and NOAA tide gauge closest to Clay Bank indicated by red squares. The aerial photograph inset shows the Clay Bank MUDBED sites. The Yellow star depicts the secondary channel core location for this study. The VIMS Clay Bank Piling (green dot) and the MUDBED main channel core location (white dot) are shown for data comparisons between studies. Sediment mass profiles of (a) % water in wet sediment, (b) % organics in dry sediment, (c) % sand in dried sediment, (d) % water in wet mud matrix, (e) % organics in dry mud, and (f) % silt in dried mud. Size classes in figure reflect disaggregated sediment components. Percent mass as a function o f sieve size classes: (a) size distribution o f pellets that withstood sieving but not disaggregation, (b) size distribution o f \"disaggregated\" (i.e., coarse silt/fine sand and detritus that withstood disaggregation), (c) % organic o f pellets, (d) % organic of \"disaggregated\", (e) % pellets o f all \"collected\" >45 microns, (f) % pellets relative to total disaggregated mud. Beryllium-7 activity per mass of dry mud, corrected for time between coring and counting, for weekly sampling at the Clay Bank site between late April and late May, 2010. (a)-(e) Example digital x-radiographs from cores collected on the five weekly sampling cruises, (f) Relative pixel intensity, averaged across the widths of the images in (a)-(e) width, for depths from 1 to 14 cm. The width-averaged pixel intensity was normalized on a scale o f 0 to 1 such that the lowest widthaveraged intensity for each core was set to 0 , and the highest width-averaged intensity was set to 1 . Eroded mass as a function of critical erosion shear stress for weekly sampling at the Clay Bank site between late April and late * M ay, 2010. Conditions in the York River estuary in 2010: (a) USGS data for riverine discharge (3-day low-pass o f Pamunkey plus Mattaponi gaging stations). EPA monitoring data for (b) salinity and (c) total suspended solids (spatial averages o f observations collected at 1 1 2 stations LE4.1 and LE4.2). Location o f the VECOS monitoring station in relation to the 2008-2009 bathymetric surveys. The VIMS Clay Bank Piling and j t he MUDBED core locations are shown for data comparisons between studies. A bathymetry plot generated from the interferometric systems cover a ~ 4km section o f the York River Estuary. For this study, the survey area was divided into three blocks based on bathymetry and the availability for quality ground control points. The main channel block, delineated by the purple dashed line and the secondary channel/shoal region is highlighted by the lightblue dashed line. Between the main channel and secondary channel, no ground control points could be found and therefore the region in white is not further analyzed within this study. Location map o f ground control points (red circles) selected in Section 1 o f the study area. This region is consists of the main channel, southeast flank, and shoal. Location map o f ground control points (red circles) selected in "}, {"section_title": "4-14", "text": "Section 3 of the study area. This region is consists o f the secondary channel and shoal. Comparison analysis to assess the potential source o f error between the VECOS water depth data and water height elevation captured in real-time during the surveys with Hypack. The mean absolute difference between the VECOS and despiked/low-passed filtered data for the 5 surveys was 2.2 centimeters. Values for each month are found within their respective sub-plots. Note that the analysis for the February comparison was for only the last 1.5 hours o f the cruise. Time-series o f mean seabed elevation o f the (a) main channel and (b) secondary channel. Time-series o f transect analysis o f the Clay Bank main channel sub-section. Time-series o f transect analysis o f the Clay Bank secondary channel sub-section. Dickhudt et al.'s (2009) conceptual diagram depicting sediment transport processes in the York River estuary. Symbols courtesy of the Integration and Application Network ian.umces.edu/symbols/), University of Maryland Center for Environmental Science. April 2008 through March 2009, soft mud layer thickness contour maps for Clay Bank captured using a dual-channel echosounder . The shoreline and the boundaries o f the channel sub-environments are indicated with black lines. Soft mud layer thickness scale is in meters (0-22 cm). Months and years are shown at the bottom left side o f the maps. A reference figure is included at the bottom to indicate the location of each o f the channel sub-environments: main channel NE flank (MCNE), main channel (MC), main channel SW flank (MCSW), inactive oyster reef (IOR), secondary channel (SC), secondary channel flank (SCF). USGS riverine discharge data from the Mattaponi and Pamunkey Rivers between September 2008and August 2009(USGS, 2009 http://waterdata.usgs/nwis). Bathymetric map o f NOAA Digital Echo Sounder Data collected in 1947 (Survey H07181). Data was corrected for actual sound velocity and reprojected from NAD27 to NAD83, maintaining MLW as the vertical datum Original sound positions are delineated by the circles. The bathymetric raster was interpolated using the kriging method. The slump mounds within the main channel, used for the postage stamp analysis, are highlighted by the red circle. "}, {"section_title": "Abstract", "text": "The transport and fate o f fine-grained sediments is a critical factor affecting the physical, chemical, and biological health o f estuaries, coastal embayments, riverine, lacustrine, and continental shelf environments. A geophysical and sedimentological study o f the York River as a part o f the NSF Multi-disciplinary Benthic Exchange Dynamics (MUDBED) project was conducted to determine: 1 ) the primary drivers o f sediment erodibility within a fine-grained system, 2 ) if these drivers can be accurately measured through sedimentological and acoustic information, and 3) the spatial and seasonal variability o f erosion within the estuary. Previous studies indicate that increased erodibility within the York River Estuary is mainly due to recent ephemeral deposition, whereas lower erodibility is associated with eroded or biologically reworked conditions. By studying key physical and biological parameters in the York River estuary, we can more generally apply knowledge gained on relationships among sediment facies, seabed erodibility, and the recent history o f deposition, erosion, consolidation, and biological reworking. Three different experiments were conducted to look at erosion, deposition, consolidation, and biological reworking in the Clay Bank region o f the York River Estuary, each highlighting varying scales o f temporal change. The first experimental approach utilized an Imagenex 881A rotary sonar for one-to three-month deployments to examine surficial changes o f the seabed, from hourly to monthly timescales, and allow scientists to track movement o f sediment in and out o f the system using sonar imagery. Optimized parameters were determined for cohesive sediment environments and a real-time observing rotary sonar was created to analyze the seabed on an hourly basis. In the second experiment, cores were collected on a weekly basis to investigate relationships between sediment properties and erodibility during the post-freshet dissipation o f the mid-estuary turbidity maximum as well as over the spring-neap cycle. Grain size, water content, abundance o f resilient pellets, the occurrence of 7 Be, and x-radiographs were analyzed and compared to the results o f Gust microcosm erosion tests to further constrain the controls on erodibility. The third experimental approach utilized seven high-resolution bathymetric surveys conducted between September 2008 and August 2009 within a 3.75 km region at Clay Bank. Seabed height was shown to vary both spatially and temporally in association with the spring freshet, likely related to the presence and migration o f a local secondary turbidity maximum."}, {"section_title": "XIII", "text": ""}, {"section_title": "Chapter 1: Introduction", "text": ""}, {"section_title": "Background", "text": "Estuaries, coastal embayments, riverine shelves, and continental slope regions are often covered with muddy fine-grained sediment. Generally exhibiting a cohesive nature, muds have a defining \"stickiness\" that is difficult to predict and which fundamentally affects its mobility and the transport o f sediment . The sediment dynamics occurring within less cohesive sandy environments have been relatively well documented, with the finding that the dominant particle size o f the bed sediment drives the behavior o f the distribution and fate o f the grains (van Rijn, 1984a;van Rijn, 1984b;van Rijn, 1984c;Soulsby, 1997;. In contrast, less is known about the transport and dynamics o f fine-grained sediment, despite the importance o f particle dispersal within fine-grained environments. Previous studies have shown that fine-grained sediment can have a detrimental impact on water quality and ecology, especially in estuarine systems. Often a considerable amount of sediment enters the system via runoff, riverine input, and the bay or ocean. However, the amount o f sediment entering tidally energetic estuaries is often much less than that which is found within the water column. The surplus o f sediment in suspension is thought to be due to the repeated resuspension o f fine-grained sediment from the seabed . Large quantities o f suspended sediment can result in negative impacts within the estuary, including enhanced light attenuation, disruption and change of benthic community structure and distribution, modified transport o f organic carbon, and changes in the location and duration of eutrophication and hypoxia . In addition, contaminants are often concentrated in fine-grained systems. Due to physio-chemical attraction and large surface area, these fine cohesive particles are highly susceptible to contaminant adsorbtion (Olsen et al., 1993;. Previous studies have shown that the erodibility of sediment beds is a complex function o f grain size, water content, mineralogical composition, deposition and erosion history, and biological activity. A number o f techniques, including: laboratory flume tests, in-situ measurements using submersible flumes, and core analysis, have been developed to investigate controls on fine sediment erosion, but the general scientific consensus is that it is very difficult to predict (Parchure and Mehta, 1985;McNeil et al., 1996;Maa et al., 1993). More recent technology, incorporating Gust microcosms and Acoustic Doppler Velocimeters (ADVs), for example, has allowed for a deeper and a more field-oriented understanding o f sediment erosion (Thome and Hanes, 2002;Tolhurst et al., 2002;Betteridge et al., 2003;Porter et al., 2004;Dickhudt, 2008;. However, these techniques remain labor intensive and spatially limited in scope. If scientists were able to utilize remote sensing techniques to examine sediment erosion and deposition over various temporal and spatial scales, it would not only decrease the need for large-scale field operations but would allow for more continuous and widespread seabed measurements. Over the past few decades, hundreds o f studies have utilized geologic acoustic mapping in order to analyze the seabed. Many o f the early studies came about during the era o f World War II, using sonar to map the world's oceans (Jones, 1999). As acoustical theory and technology developed over the next few decades, improved measurements were collected and publications such as Heezen and Tharpe's (1957) \"Physiographic Map of the North Atlantic\" became available. Recent strides in technology have supplied researchers with equipment that can now provide measurement accuracies o f mapping on centimeter scale. Geologic mapping of the seabed has been found to be o f great importance for several applications including mapping and managing habitats, providing navigation information, as well as tracking environmental conditions on multiple spatial and temporal scales (Caiti et al., 2006). As o f late, estuaries have become a particular focus o f mapping for habitat assessment, for improving navigational safety, and for national security protection ."}, {"section_title": "Sediment Properties ~ Flocculation and Deposition", "text": "Depending on the degree o f convergent sediment transport and the strength o f waves and currents, fine-grained estuarine sediment particles can exist in four various states: mobilesuspended sediment (including various degrees of particle aggregation), high near bed sediment concentrations (e.g., fluid mud), unconsolidated sediment deposits, or consolidated sediment bed. If the fine-grained cohesive particles are in suspension, they are often susceptible to collision and cohesion with other sediment particles, resulting in particle flocculation and aggregation . Factors affecting the aggregation of particles can be a result o f physiochemical or biologic processes. Flocculation via particle collisions can be due to three mechanisms: Brownian motion for weak floes, small-scale fluid shear which forms stronger flocculates, and differential rates o f particle settling (Dyer, 1995). Conversely, biological processes may contribute to particle aggregation via biodeposition and organic binding. The size and abundance o f flocculates and aggregates depends on sediment concentration, grain mineralogy, pH, organic content, and ionic strength, as well as biological packaging. It is important to consider this because flocculation and biological aggregation greatly enhance settling velocity. When comparing flocculated/aggregated grains to individual primary particles, the settling velocity can range several orders o f magnitude greater (Dyer, 1995;Hill and McCave, 2001;Mikkelsen et al., 2007). If the amount o f deposition exceeds the rate o f resuspension/erosion of the seabed, accretion will result. In physically dominated regions, multiple lamination layers may be present within the seabed due to discrete deposition events. Schaffiier et al. (2001) defined the upper York River estuary as being predominately controlled by physical processes, where the primary sediment structures of the bed are laminations, and the majority o f the physical sediment disturbance occurs on a scale o f weeks to months. The authors found that the sediment record provided by these laminations supply a history o f the estuary, illustrating erosional pockets between depositional periods ranging from centimeters to 1 0 's o f centimeters in sediment thickness. It was found in this area, storms provided a major source of erosion o f the seabed, disturbing 10's -100's o f centimeters o f sediment. However, storms are infrequent, and therefore tides were identified as the primary mechanism for resuspending and eroding sediments during more quiescent periods (Schaffiier et al., 2001)."}, {"section_title": "Sediment Properties ~ Erosion", "text": "As stated previously, not all sediment is deposited and consolidated on the seabed. When the bottom shear stress, caused by the friction o f water flowing over the bed surface, exceeds the seabed's resistance to erosion, sediment is resuspended . Laboratory experiments have shown that the erosive potential o f a mud matrix can be correlated to bed density (Thom and Parsons, 1980), but grain size, degree of aggregation, sediment fabric, deposition/erosion history, and organic constituents also need to be considered. This concept differs from non-cohesive sandy systems where the erodibility o f the seabed depends primarily on grain size. Density and consolidation o f the cohesive grains is crucial in determining the magnitude o f the critical shear stress needed for erosion and resuspension. The greater the shear stress o f water acting on the sediment surface, the higher the erosion potential. If the stress produced by the velocity o f the wave orbitals and/or currents continues to increase, erosion and resuspension will continue until a maximum critical shear stress threshold is reached or the sediment matrix is consolidated enough to where the critical erosion shear stress o f the bed is no longer exceeded by the externally imposed bed stress . In estuarine systems, Dyer (1995) found that erodibility could be closely related to the nature o f the bed layers existing very near the surface o f the seabed. The author found that at slack water two bed layers were present, a thin fluid type mud and the underlying firm consolidated bed. The upper layer o f fluid mud was found to be easily erodible and resuspended by incoming tides. Conversely, the lower unit was more difficult to erode, needing more intense conditions (i.e. storms, biological reworking, and extreme tides) with higher stresses to invoke sediment resuspension (Dyer, 1995)."}, {"section_title": "Biostabilization and Biodestabilization.", "text": "Biostabilizers o f the seabed have been documented for decades and are effective at reducing sediment erodibility by stabilizing the surface. Various studies over time have researched the impact o f the mucilaginous secretions, known as extracellular polymeric substances (EPS), produced by diverse benthic creatures (Young and Southard, 1978;Dade et al., 1996;Taylor and Paterson, 1998;Noffke et al., 2001;Tolhurst et al., 2002). Organisms such as microalgae, worms, and crustaceans can pelletize sediment as they feed as well as excrete a protective adhesive matrix that allows for increased organism mobility, habitat protection, and desiccation prevention. The mucous layer can bind the sediment particles and strengthens the upper seabed matrix, thereby decreasing the rate o f erosion acting upon the surface . Dade et al. (1996) analyzed how Alteromonus atlantica, common marine benthic bacteria, affected kaolinite clay in terms o f yield stress. The authors found that as the bacteria began to secrete the exopolymer glue, the natural cohesive kaolinite particles became more resistant to shear stress resuspension. Fecal pellets and pseudofeces, often defined as biodeposition, can also have an impact on erodibility of the seabed, where it can either increase or decrease erosion .  stated that pelletization o f the seabed could be the cause o f varying rates o f erodibility within the York River. The author found that when erodibility o f the seabed was low, the surficial sediment o f the cores was dominated by fecal pellets; whereas at times o f high sediment erosion, less strongly aggregated fine-grained sediment was prevalent with little to no fecal pellets present (Dickhudt, 2008). Conversely, benthic organisms can have the opposite effect on the seabed by altering the bed roughness and erodibility potential of the surface sediment. As organisms create burrows, travel, or forage for food, the sediment may become weakened and susceptible to erosion (Eckman et al., 1981). The destabilization impact on the seabed can be a function o f the population density o f the benthic organisms, as well as seasonality (Schaffiier et al., 2001;Anderson, 2005). In addition, as benthic activity intensifies and the degree o f bioturbation increases, the friction of the seabed and the overlying water flow is altered and ultimately the amount o f sediment resuspended may increase (Widdows et al., 2000;Patterson et al., 2000). A previous study o f the Ems Do Hard estuary in the Netherlands showed the impact o f a benthic amphipod, Corophium volutator, on sediment transport (Komman and deDeckere, 1998). The authors found that in 1996 the sediment erodibility within the estuary was significantly different between March and August due to biological activity. A March diatom bloom resulted in high levels o f EPS concentrations within the sediment, which seemed correlated to the documented decrease in suspended sediment concentrations within the study area. As the diatom adhesive EPS matrix degraded and amphipod bioturbation and grazing increased, the sediment concentration within the Ems Dollard estuary increased, linking the impacts o f biological and physical forcings o f fine-grained systems (Komman and deDeckere, 1998)."}, {"section_title": "Turbidity Maxima", "text": "Fine sediment resuspension is commonly noted within estuarine turbidity maxima (ETMs) Dyer, 1995). Residual water circulation and salinity fronts are thought to be the primary mechanisms for forming ETMs in partially-mixed estuaries, while tidal asymmetry is thought to be increasingly important as tidal energy increases . Classically, the ETM in partially-mixed estuaries is a region o f high-suspended sediment concentrations that results from convergence near the salt limit (Postma, 1967;Burchard et al., 2004). In the York River, a primary ETM is often present near the head of salt in the region of the confluence o f the Pamunkey and Mattaponi Rivers.  found that the York's primary ETM is formed by both gravitational circulation and tidal asymmetry, with an additional factor being the inhibition o f turbulence by estuarine stratification. The ETM often moves with the tides, with the location further upstream after the flood tide and downstream after ebb tide (Dyer, 1995). Tides provide the main source of energy for the ETM for short-term resuspension, with spatial evolution o f the ETM occurring in response to changes in river discharge and the spring-neap cycle, and drastic changes of the ETM occurring during major storms and floods. In addition to primary turbidity maxima, some estuaries can develop a secondary turbidity maximum (STM). Estuaries such as the Hudson River, Danshuei River, Paxtuxent River, and the York River have all had STMs documented .  found that the STM in the York River Estuary is formed as a result o f four major mechanisms: resuspension o f bottom sediments, bottom residual flow convergence, tidal asymmetries, and the suppression o f turbulent diffusion due to stratification o f the water column. The York River STM identified by  is generally located about 40 kilometers up estuary, near the area known as Clay Bank. Because o f channel shoaling in the region, this location is conducive to STM development as it is often a stratification transition zone from well-mixed to partially stratified . Generally, STMs are ephemeral features whose appearance are largely controlled by the springneap tidal cycle and riverine discharge (and the effects of each on the estuarine salinity field). Both ETMs and STMs contain high amounts of mobile fine sediment that is constantly being deposited, reworked, and resuspended back into the water column. The sediment mass o f the turbidity maximums are variable and dependent on hydrodynamic, seabed, and biological factors."}, {"section_title": "Acoustic Mapping", "text": "Over the past two centuries, hydrographic surveys have been conducted to map bathymetry o f the world's oceans, coasts, and navigable waterways (Van Der Wal and Pye, 2003). Early mapping techniques utilized lead lines or sounding poles with triangular positioning in order to capture sounding depths (Cohen, 1970;Gustavson, 1975). With the advent o f acoustic technology, new mapping tools became available to increase the accuracy o f bathymetric maps using echo-sounders (Wright and Bartlett, 2000;Van Der Wal and Pye, 2003). Further advances in technology led to a shift to digital from paper data and allowed for a greater resolution via the development o f swath bathymetry, airborne laser, sidescan sonar, etc. Currently, many regions worldwide, especially estuaries due to their direct impact on human health, recreation, and industry, are being heavily surveyed. Regions such as San Francisco Bay, Narragansett Bay, Tay Estuary, and the Hudson River are prime examples o f extensively mapped areas (Valente et a l, 1992;Wewetzer and Duck, 1999;Foxgrover et al., 2004;Levinton and Waldman, 2006). Levinton and Waldman (ed., 2006) compiled various mapping studies to capture the dynamic interdisciplinary nature o f the Hudson River Estuary, evaluating parameters ranging from sub bottom seismics and surface bathymetry, to contaminant distribution and biological influences. By taking into account bathymetry, sub-bottom profiles, and sidescan imagery, scientists were able to infer and understand more about the Hudson system than if they only had one data set (Bell et al., 2006). The timing o f the mapping surveys is very important, and extreme events and extraneous conditions need to be taken into account while processing the data . Often these mapping efforts are time consuming and capture a snapshot in time; however, the spatial extent o f the acoustic surveys greatly exceeds what is possible via a typical coring field study. By using swath bathymetry, chirp, and sidescan, one is able to get a detailed image o f the seabed on a large spatial scale, but depending on the frequency of sampling, not always a good temporal trend. Within the last few years, scientists have begun deploying rotary sonars on the seabed in order to gain temporal information of particular areas of interest in various environments Mayer et al., 2007;. For example,  used a rotating sonar to investigate how directional properties of incident waves affected cross-ripple bed formation. They captured 8 -meter diameter images o f the seabed at 30-minute intervals during quiescent times and every 10 minutes during storm events. By monitoring the seabed on a sub-hourly basis during 11 storms,  were able to relate changes o f the seabed to unimodal incident wave directions. The combination o f spatial and temporal studies is crucial for a detailed understanding o f sediment transport and variable seabed changes, as well as providing valuable information to allow for better public policy and comprehension o f the world's waterways."}, {"section_title": "Isotope Dating", "text": "In order to estimate the sediment mixing and accumulation rates occurring within a particular system, including biological effects, researchers have utilized particle-reactive radionuclides such as 7Be and 137Cs as chronological dating tools. 7Be (53.3 day half-life) is useful in determining short-term rates of accumulation, seabed mixing and erosion (Dibb and Rice 1989a;Dibb and Rice, 1989b;Wallbrink and Murray, 1993;Cornett et al., 1994;Clifton et al., 1995;Papastafanou et al., 1995;Feng et al., 1999), while 137Cs (30.13 year half-life) is better suited for detecting yearly and decadal changes within the seabed (Papastafanou et al., 1995;Kostaschuk et al., 2008). 7Be is a naturally occurring radioisotope, formed by nuclear spallation as a consequence o f secondary cosmic rays neutrons bombarding oxygen and nitrogen. 7Be is usually produced in the stratosphere; however, a minimal portion o f the isotope is created in the troposphere (Turekian et al. 1983). In order for the cosmogenic nuclides to be transported to earth, the isotopic particles circulate from the stratosphere to the troposphere where they attach to aerosols and are deposited on earth generally by precipitation . Most commonly, the stratosphere-troposphere mixing occurs during the spring and fall. At this time the layer between the two atmospheric layers, the tropopause, thins and allows for a greater amount o f gas exchange to occur between the two layers (Turekian et al. 1983;Grew, 2002). Unlike the naturally occurring radioisotope 7Be, 137Cs is a thermonuclear byproduct. When nuclear weapons were tested throughout the 1950's and 1960's, large quantities o f 137Cs were released into the atmosphere until atmospheric H-bomb testing ceased in 1972 (Sharma et al., 1987;Walling et al., 1999). The rates o f atmospheric fallout varied over time but it was determined that the peak nuclear fallout occurred in 1963 ± 2 years (Sharma et al., 1987). The max 137Cs atmospheric fallout generally corresponds with the highest Cs activities present in the sediment, allowing this radioisotope to be used as a dating horizon marker. The novel approach to the 1963 marker application is the 137Cs has the monitoring ability to date upward mixing bioturbation (Bradshaw et al., 2006). Furthermore, 137Cs has been found to be a valuable tool in bioturbation studies, especially in fine-grained environments because of the easy absorption of the nuclide to clay particles and organic matter (Robbins et al., 1979)."}, {"section_title": "High-Resolution Core Characterization Methods", "text": "Within the last few decades, modem core logging systems have been developed to allow for continuous high-resolution data collection and incorporating multiple sensors capable of measuring a variety o f parameters (Gunn and Best, 1998). The VIMS GEOTEK core logger is outfitted with gamma-ray attenuation, P-wave velocity, and color spectrophotometer sensors. The gamma-ray sensor allows for measurements of sediment bulk density, porosity, and water content (Weber et al., 1997;Best and Gunn, 1999). The P-wave velocity sensor helps determine variations in grain size, assess core quality, and, along with the gamma-ray sensor, helps provide information needed to construct synthetic seismograms of the sediment core (Weber et al., 1997;Best and Gunn, 1999). Lastly, the color spectrophotometer is able to detect small-scale changes in sediment color variability, and if applicable identify paleoclimatic cycles and events (Rothwell and Rack, 2006). In 2004, Carbotte et al. combined geophysical mapping data (chirp and sidescan) with a collection o f shallow gravity cores to look at environmental changes within the Hudson River estuary. Measurements o f p-wave velocity, magnetic susceptibility, and gammaray attenuation were determined with a GEOTEK core logger. By combining the mapping and core logging data sets, the authors were able to map fossil oyster beds throughout the estuary and found that anthropogenic influences significantly impacted the paleo-oyster beds and the estuarine environment overall (Carbotte et al., 2004) In muddy environments, visualization o f the core sediment may not reveal as much information as a core collected within a sandy environment, due to the opacity o f the sediment (Rothwell and Rack, 2006). Therefore, x-radiography has been utilized to envision bed structures and infer fine-scale density changes within fine-grained cores, which cannot be seen with the naked eye. Through the use o f x-ray technology, processes such as sediment deposition, bioturbation, physical alteration, and erosion can be better recognized. Dickhudt (2008) collected x-rays concurrently with erosion cores, in order to compare properties o f the seabed to the dominating physical and biological parameters o f the study areas within the York River estuary. In the study, the author identified two end-member x-ray types, which were categorized by the dominating forces acting on the sediment bed. Laminated x-rays from Gloucester Point and Clay Bank were inferred to represent recent deposition and the samples were thought to be controlled by physical forcings. Laminated x-rays either had few to no bioturbators, or the physical parameters overwhelmed any biological activity at that site. Conversely, benthic biologically dominated systems produced mixed or mottled x-rays, indicating either high amounts o f biotic influence or little to no recent sediment deposition (Dickhudt, 2008)."}, {"section_title": "Estuarine Sediment Transport Modeling.", "text": "When sedimentological data is combined with mathematical modeling, scientists can develop a deeper understanding o f how various factors are likely to influence the estuary and seabed. When modeling estuarine sediment transport, it is important to understand the hydrodynamics o f the system, as well as the physics behind each transport mechanism. Sediment transport can be modeled various ways and in different dimensions, such as 3D, 2DH (horizontal), 2DV (vertical), 2D 2 layer, ID, point models, and Lagrangian (particle) models . Field data can be used to constrain sediment transport models, for example by helping to define sources of mud or providing measurements of suspended sediment concentrations for calibration. Field measurements can be used to adjust the model in order to provide a more realistic concept o f the influencing parameters within an estuary, and the model can be utilized to predict the rate of sediment transport, along with locations o f erosion and deposition. If field data is unavailable, mathematical models can still help determine dominate parameters within a system or set up various schematic tests to help in assessing hypotheses . In 2008, Rinehimer applied ID and 3D models to the York River estuary focusing on sediment transport in this muddy fine-grained environment. The models were implemented specifically to look at feedback mechanisms between sediment flux and erodibility. The ID model focused on the sensitivity o f erodibility to forcing and bed parameters o f the model and the influence o f spatial and seasonal variations. Rinehimer et al. (2008) found that when the cohesive sediment bed model was implemented for the York River, it performed well when a constant erosion rate parameter was utilized in conjunction with a depth-varying critical erosion shear stress. Furthermore, it was documented that the spring-neap tidal cycle impacted erodibility and bed consolidation, which then fed back to influence turbidity (Rinehimer et al., 2008). The 3D model calculated sediment concentrations and erodibility throughout the estuary and compared the results to observational data collected by Dickhudt (2008) (Rinehimer, 2008). By using an average grid spacing o f 170 meters along-channel and 140 meters across-channel, the ROMS model was run for a 200-day period that coincided with field data collection. Rinehimer (2008) found that areas o f persistently high concentration in the York River near Clay Bank were associated with transport convergence zones, recent deposition, and high bed erodibility."}, {"section_title": "Study Area", "text": "Over the years, many research projects have been conducted within the York River ( Figure. 1-1) making it an increasingly well-documented study locale. Though the studies have ranged from biological fauna to watershed management, many have looked at the physical and geologic properties o f the estuary. Most recently, these research initiatives have included various interdisciplinary components. Examples include research focusing on the biological and physical controls on seabed properties within the estuary Schaffiier et al., 2001;Hinchey, 2002;, tidal asymmetry, bed stress and stratification Scully and Friedrichs, 2003), turbidity maxima , and controls on bed erodibility and settling velocity Cartwright et al., 2009  . The main channel of the estuary averages about 10 meters in depth and is thought to be controlled by antecedent geology o f an incised Paleo-river valley . The main channel bifurcates near Page's Rock Light and a shallower (~ 5 meter deep) secondary channel, which is considered partially abandoned, extends northward on the western flank o f the main channel . Two shoals flank the channels and have an average depth o f ~ 2 meters. Researchers have found that physical seabed processes dominate in the upper regions of the York River estuary, whereas biological processes are more dominant closer to the mouth (Kniskern and Kuehl, 2003)  . Schaffner and Dellapenna  Moving seaward through the middle portion o f the York River estuary, the depth and cross-sectional area increase, and the middle York acts as a transition zone between the head and mouth o f the estuary. Due to the deeper water and gradients in physical energy, this is often a region of changing stratification and convergent sediment transport ) . There is also decreased physical reworking o f the seabed within the middle part o f the system, and biological activity begins to become more prevalent. Another distinguishing characteristic o f the middle part o f the estuary is the secondary turbidity maximum (STM). The STM migrates throughout the middle section o f the York and is present only at certain periods, typically following periods o f increased river discharge. The ephemeral deposition and physical mixing associated with the STM is very intense at the seabed and seasonally creates conditions that are unfavorable to benthic activity   (Figure 1 -3). Recently, several studies within the MUDBED project have been completed. Both Dickhudt (2008) and Rinehimer (2008)     analysis is provided which can also be utilized in other cohesive estuarine environments. Though it can be difficult to utilize rotary sonars in fine grained environments, this study found key tunable parameter sequences for cohesive estuarine environments, including using frequencies o f 675 and 1000kHz,. 0.5 m above the bed.\nThe York River estuary (Figure 3-1 The surficial sediments o f the main and secondary channels of the York River Estuary are muddy, with the percent clay plus silt generally exceeding 70% . In the muddy reaches o f the secondary channel, near the site of the present investigation, near-bed tidal suspensions can seasonally exceed 1 gram/liter . There are seasonally persistent along-estuary peaks in turbidity along the York River estuary associated with two major ETMs. The main ETM is typically located near the head o f the salt intrusion, while a secondary ETM is often found in the middle estuary, about 20 to 40 km from the mouth o f the York after the winter/spring freshet, when there tends to be a decrease in stratification at that location ). Radioisotope geochronology studies in the York River Estuary have shown that physical reworking, possibly associated with migration o f furrowed bedforms or transport events in response to major storms, may result in annual to decadal physical disturbance and reworking to depths as much as 1 m . Over seasonal or shorter time-scales associated with local ETMs, x-radiography and dual-frequency echo sounder surveys have identified ephemeral, migrating mud deposits on the order o f 10 cm that suppress macrobenthic activity and produce characteristic parallel laminations in x-rays (Schaffner et al., 2001;. In the absence o f these ephemeral deposits, biological reworking eventually leads to at a mottled pattern in x-radiographs characteristic o f at least moderate bioturbation (Schaffner et al., 2001;.  and  found that the seasonal deposition associated with the middle-estuary ETM led to low erodibility in the Clay Bank region o f the middle estuary, but that after the ETM and associated deposits dissipated, erodibility increased once more.\nThe York River estuary is located in southeastern Virginia on the Mid-Atlantic Coast of the United States (Figure 4-1), and was created by the drowning of a river valley approximately 12,000 years ago when glaciers melted during the beginning of the Holocene . Today, the estuary is formed at the confluence o f the Mattaponi and Pamunkey Rivers and empties into the Chesapeake Bay at its mouth. As the Chesapeake's fifth largest tributary, the York River watershed encompasses approximately 6900 square kilometers and is characterized as a humid sub-tropical climate, receiving an annual precipitation o f 1 1 2 -1 2 0 centimeters/year. Presently, the York's watershed is relatively less developed compared to many other Chesapeake Bay tributaries and is predominately bounded by rural landmasses with forest cover as a majority o f the land classification, totaling 61%. The other 39% of the watershed is classified as agriculture (21%), wetlands (7%), and barren land (1%). The remaining area is covered by water (Nichols et a l, 1991;. The estuary has a mean depth of 4.9 meters, with the deepest area is located near Gloucester Point where the depth exceeds 20 meters. The main channel o f the estuary averages about 1 0 meters in depth and is thought to be controlled by antecedent geology o f the incised paleo-river valley . The main channel bifurcates near Page's Rock Light and a shallower (~ 5 meter deep) secondary channel, which is considered partially abandoned, extends northward on the western flank o f the main channel . Two shoals flank the channels and have an average depth of ~ 2 meters. Although microtidal, the tidal currents within the river, particularly in the middle and upper portions of the estuary, have been documented as being strong enough to regularly resuspended bottom sediments . Over the years, many research projects have been conducted within the York River, ranging from studies o f biological fauna to watershed management practices, with many focusing on both physical and geologic properties o f the estuary. Most recently, these research initiatives have included interdisciplinary components, which have shed light on complex process interactions. Examples include research focusing on the biological and physical controls on seabed properties within the estuary Schaffiier et al., 2001;Hinchey, 2002;Kniskern and Kuehl, 2003;Rodriquez-Calderon and Kuehl, 2012), tidal asymmetry, bed stress and stratification Scully and Friedrichs, 2003), turbidity maxima , modeling (Rinehimer, 2008, and controls on bed erodibility and settling velocity Cartwright et al., 2009;. Researchers have found that physical seabed processes dominate in the upper regions of the York River sub-estuary whereas biological processes are more dominant closer to the mouth o f the river Schaffiier et al., 2001;Kniskern and Kuehl, 2003;and Gillett and Schaffiier, 2009). These previous studies distinguished several regions o f the river based on the relative influence o f physical versus biological processes along the estuarine gradient. The broadest of the generalizations classify the river into three areas: the upper, middle, and lower York River. Due to the influences o f the river discharge, tidal energies, along with the location o f the main estuarine turbidity maximum, little biological reworking takes place in the upper York, and the system there is physically dominated. Conversely, the physical energy decreases down river and biological conditions dominate in the lower York (Schaffiier et al., 2001). The specific study site for this investigation was located in the Clay Bank region o f the estuary (Figure 4-2). Located approximately 30 kilometers from the mouth o f the river and 6 meters in depth, the Clay Bank region is influenced by both physical and biological factors. Based on various environmental parameters, the study site is often impacted by pelletization and flocculation. In addition, the region is also the location o f an ephemeral deposit associated with the secondary turbidity maximum.  attributed the presence of the STM in the York River Estuary to four major mechanisms: resuspension o f bottom sediments, bottom residual flow convergence, tidal asymmetries, and the suppression o f turbulent diffusion due to stratification o f the water column. The York River STM identified by  is generally located about 40 kilometers up estuary, near the area known as Clay Bank. Because of channel shoaling in the region, this location is conducive to STM development as it is often a stratification transition zone from well-mixed to partially stratified . Rinehimer 2008 Both  and  inferred the presence o f the ephemeral deposit indirectly via sediment properties associated with near-surface sediment. In an effort to observe seasonal deposition and erosion directly via changes in bed elevation, this study utilized an interferometric swath mapping system."}, {"section_title": "Introduction", "text": "Precise observations o f the dynamic processes interacting at the sediment-water interface are crucial to understanding seafloor morphology and associated chemical and biological processes. The magnitude and frequency o f hydrodynamic forcing often dictates the resulting morphologic response. Large-scale events, including extratropical storms and nor'easters, can be a catalyst for abrupt changes that may dissipate quickly; conversely, daily processes acting on the seafloor (i.e. tides, waves, and currents) may not provide an instantaneous response, but rather yield gradual changes and environmental modifications over longer timescales. Rotary sonar technology has allowed for precise observations of seabed morphologic evolution. The transport and fate o f seafloor sediments are critical factors affecting the physical conditions, chemical composition, and the biological health o f ecosystems, especially in estuaries, along shorelines, and on continental shelf environments . The erodibility potential o f sediment beds is a complex function o f grain size, bed roughness, water content, mineralogical composition, deposition and erosion history, physical water column conditions, and local biological activity (Soulsby, 1997;. General models of sediment transport relate sediment mobility to hydrodynamic shear stress exerted on the bed by wave orbital and current velocities, the degree to which flow is turbulent, seafloor roughness, and sediment grain size (Soulsby, 1997). Transport o f sands, or non-cohesive sediment ($10% of grains smaller than 63 pm), is important to understand, as it is vital to harbor development (initial and maintenance dredging), navigational channel administration (safety o f commercial shipping and recreational boating), shoreline maintenance (beach nourishment), coastal protection (shoreline structures), engineered structures (platforms and pipelines), benthic habitat assessment, and commercial fisheries management. The sediment dynamics occurring within non-cohesive sandy environments has been relatively well documented (van Rijn, 1984a;van Rijn, 1984b;van Rijn, 1984c;Soulsby, 1997;. General models of sediment transport relate sediment mobility to hydrodynamic shear stress exerted on the bed by wave orbital and current velocities, the degree to which flow is turbulent, seafloor roughness, and sediment grain size (Soulsby, 1997). It is generally understood that the dominant particle size o f the bed sediment drives the behavior and distribution o f the grains within the system (van Rijn, 1984a;van Rijn, 1984b;van Rijn, 1984c;Soulsby, 1997;. Grains larger than 2mm are classified as gravel and their transport behavior is primarily dependent upon bed permeability rather than grain size. In beds composed o f mixed sand and mud, the effects of electrochemical and biological cohesion become important to transport processes if the relative mud composition exceeds 10%. Mixed sediments such as these are more resistant to erosion than either pure sands or pure mud (Soulsby, 1997). In contrast, muds (cohesive sediment) have a \"stickiness\" that is difficult to define or predict, which fundamentally affects its mobility and transport . Less is known about the transport and dynamics of fine-grained sediment, despite the importance of the particle dispersal within these environments. Often a considerable amount of sediment enters the system via surface runoff, riverine input, and oceanic influx. However, the amount o f sediment entering tidally energetic estuaries is often much less than that which is found within the water column. Even when sediment input is small, energetic tidal currents and waves can retain or resuspend sediment into the water column. The surplus of sediment in suspension is thought to be due to the repeated resuspension o f fine-grained sediment from the seabed . Large quantities o f suspended sediment have negative impacts within an estuary, including enhanced light attenuation, disruption and change of benthic community structure and distribution, modified transport o f organic carbon, and changes in the location and duration of eutrophication and hypoxia . In addition, contaminants are often concentrated in fine-grained systems. Due to physio-chemical attraction and large surface area, these fine cohesive particles are highly susceptible to contaminant adsorbtion (Olsen et al., 1993;. One method in which sediment transport can be estimated is by observation o f the seabed over a variety o f timescales. The objective o f this paper is to address the use o f rotary sonar technology to assess changes in bedform morphology and determine sediment patterns o f erosion and deposition within cohesive fine-grained environments.\nEstuaries receive a mix o f non-cohesive and cohesive sediment from locations ranging from the continental shelf to upland riverine sources 7. Fine sand and muddy particles are deposited, eroded, and transported throughout many tidal estuaries in a repeating, quasi-cyclical pattern based on the ebb and flow o f the daily and spring-neap tidal fluctuations interacting with seasonal and event-scale variations in freshwater input, waves, and wind forcing. This repetition is occasionally altered, as estuaries act as effective trapping mechanisms, characterizing the environment as sediment sinks (Meade, 1982;Wong and Moy, 1984;Dyer, 1988;Hobbs et a l, 1992;Shen and Haas, 2004). Fine-grained sediment strongly impacts estuarine ecosystems. As mud particles are suspended into the water column, light attenuation can significantly increase. Along with impacting light availability, intense fine sediment transport can diminish macrobenthic diversity and abundance, leading to a degraded habitat (Summerhayes et al., 1985;Angradi, 1999;Schaffher et al., 2001;Lowe and Bolger, 2002;Weigelhofer and Waringer, 2003;Salant and Renshaw, 2007). These adverse effects are further compounded as pollutants are introduced in the estuary. The greater percentage o f fines on the seabed and within the water column, the greater chance for pollutants to remain within the estuary as contaminants are attracted and absorbed onto muddy particles (Olsen et al., 1982). As estuarine watersheds become progressively more populated, chances for erosion and input of contaminants (either point or non-point sources) increase dramatically. Regions in estuaries where cycles o f fine sediment trapping and resuspension are clearly evident on event to seasonal time scales include estuarine turbidity maximums (ETMs), which are often associated with along-estuary changes in stratification associated with fronts, transitions in mixing and/or the landward limit o f the salt intrusion (ETM) Dyer, 1988;Wolanski et al., 1995;Li and Zhang, 1998;Geyer et a l, 2001;Sanford, et al., 2001). As well as the primary ETM near the transition to freshwater, a secondary ETM may form within estuaries due to a variety o f mechanisms, including: bottom residual flow convergence, tidal asymmetries, the suppression o f turbulence diffusion due to stratification o f the water column, and/or enhanced resuspension in a region o f high erodibility . Sediment erodibility has been studied extensively for decades in numerous coastal, estuarine and laboratory settings (Gorsline, 1984;Mehta, 1988;Amos et al., 1992;Harris and Wiberg, 2001;Uncles, 2002;Harris et al., 2003;Schaaff et al., 2006;Sanford, 2008;Ralston and Geyer, 2009). Non-cohesive sediments, by definition, are controlled by gravitational and frictional resistance to motion, and the erosion potential mainly depends on grain size. Conversely, cohesive sediments are more difficult and complex to predict and model due to the dependence o f erodibility on a greater number o f factors, with physical/geological effects including: particle size distribution, porosity, bulk density, and surrounding fluid properties, which include salinity and water temperature Aberle et al., 2004;Debnath et al., 2007). These variables factor into the inter-particle bonds resulting into cohesive forces between grains, which further depend upon the mineral composition. Classically, though, the dominant control on erodibility in cohesive sediment is thought to be its degree of consolidation, i.e., the strengthening o f the bed due to dewatering and the rearrangement o f particles which together increase overall cohesion (e.g., Mehta and McAnally, 2008). Although physical sediment properties are important to erodibility, additional variables and processes associated with the benthic community can either enhance or reduce erodibility. Biological effects include mechanical bioturbation, formation o f pellets by physical compaction, production o f shells and other detritus, construction o f sediment structures such as mounds, secretions which enhance cohesion such as extracellular polymeric substances (EPS), and direct biological suspension o f sediment into the water column (Edelvang and Austen, 1997;Austen et al., 1999;Andersen and Pejrup, 2002;Widdows et al., 2000;Perkins et al., 2003;Perkins et al., 2004;Underwood and Paterson, 2003). Pellets formed by benthic organisms that repackage sediment can be transported intact even during strongly turbulent conditions. Pelletized sediment typically has a lighter density than that o f a comparable sand sized particle, allowing it to remain in suspension longer . Organisms including annelids (i.e. Heteromastus filiformis, Mediomastus ambiseta, Streblospio benedicti), mollusks (i.e. Hydrobia, Macoma baltica), etc. are responsible for creating these biogenic pellets which can make up more than 50% o f the surficial sediment depending on the location and the current tidal condition (Kraeuter and Haven, 1970;Schaffner et al., 2001;Drake et al., 2002;Gillett and Schaffner, 2009). Numerous physical and biological properties of the seabed have been qualitatively associated with changes in bed erodibility, yet few field studies to date have been able to demonstrate in situ the temporal changes in mud properties which lead to significant changes in erodibility over key consolidation time scales o f several days to a few weeks. Some success has been seen in this regard in intertidal flat environments, where changes in erodibility have been conclusively related to colonization by benthic algae (e.g., Andersen et al., 2010). However directly observed quantitative associations between bed properties and erodibility in subtidal (i.e., light-limited) cohesive environments have been especially elusive. Furthermore, the studies that have attempted to relate erodibility to seabed properties in subtidal environments have tended to focus on spatial and/or seasonal time-scales (e.g., Stevens et al., 2007;Wiberg et al., 2013) rather than the key, local consolidation time-scale o f days to weeks. Constraining relationships between bed properties and erodibility based on in situ data is extremely important to the sediment transport community given that bed erodibility is one o f the most important, but least constrained parameters controlling the amount o f fine sediment in suspension in coastal and estuarine numerical models (Rinehimer et al., 2008;Sanford, 2008). Recent studies in subtidal cohesive environments have been inconclusive regarding even seasonal controls on erodibility in subtidal muddy environments. Stevens et al. (2007) compared erodibility at nine muddy bottom sites along the western margin o f the Adriatic Sea to water content, organic and inorganic carbon, colloidal carbohydrate and sand-to-mud ratio in late winter versus early summer. No consistent seasonal changes in bed constituents could be related to temporal changes in erodibility, and the spatial trends that were observed were contrary to expectations, in that erodibility decreased with greater porosity. For a muddy tidal channel-flat complex in Willapa Bay, Wiberg et al. (2013) found that spatial variations in porosity just below the sediment surface in winter was a significant predictor o f spatial variations in bed erodibility, but porosity was not related to erodibility in spring or summer.  related erodibility o f fine sediment to the surface content o f cores collected every one to two months over an 18-month period from the York River estuary, including percent water, total organics, colloidal carbohydrate, extracellular polymeric substances, and sand-silt-clay, but no relationships were found to be significant at 95% confidence. The only relationship significant at even 90% was increased erodibility with a lower clay: silt ratio. Based on upper seabed fabric revealed by x-radiographs,  concluded that seabed disturbance, in the form o f periodic deposition and erosion associated with ETM migration, was the dominant control on subsequent bed erodibility. The main goal o f this study was to investigate the influence o f sedimentological properties versus seabed disturbance on the erodibility o f a cohesive seabed within a subtidal, muddy estuarine environment over several weeks during a time period when bed consolidation was likely occurring. As far as we are aware, this represents the first in-situ study to successfully and quantitatively relate classic bed properties (i.e., water content and grain size) to evolving erodibility over this key consolidation time-scale in a subtidal cohesive estuarine environment. Logistics and recent findings o f others (e.g.,  Rodriguez, 2010; Rodriguez and Kuehl, 2012) favored the Clay Bank region o f the York River estuary for this examination. Previous work at this same site  had documented a dramatic decrease in bed erodibility before and after dissipation o f an STM, but these studies had been unable to quantitatively relate fine-scale properties o f the bed, such as water content and grain size, to changing bed erodibility. In addition, this study aimed to assess the role of spring-neap variations in tidal currents on the seabed erodibility. Previous coring efforts (e.g., ; Rodriguez and Kuehl, 2012) had been too coarse in time to capture spring-neap bed evolution, and undocumented spring-neap variation may have confounded previous attempts to relate erodibility to time-varying bed conditions. In the process, this study also proposed to resolve possible relationships between bed pelletization, consolidation and erodibility. Previous work Rodriguez, 2010) hypothesized that non-pelletized mud was associated with times o f high erodibility, whereas pellet-rich muddy beds were associated with times o f low erodibility. But observations at monthly or longer intervals likewise limited past quantitative investigations of pelletization."}, {"section_title": "Development and Use o f Rotary Sonar", "text": "In the past, in water SCUBA divers or optical instruments measurements were the only way to determine morphologic seabed changes. Initial field-based attempts to monitor the morphological state and evolution o f the seafloor relied on SCUBA divers marking the bed profile on a semi-buried Plexiglas board with a grease pencil (Inman, 1957). This technique was not useful during time o f high-suspended sediment concentrations, which obscured diver visibility and resulted in spatially and temporally limited observations due to the relatively short period o f time divers could be on the bottom. Data collection was also necessarily limited to fairweather conditions when diving was safe and bed evolution was least dynamic. Subsequent investigations utilized optical based systems, such as in-situ photography, which allowed for persistent observation o f a field site. However, these were also often insufficient to provide consistently clear images o f the seabed suitable for morphological interpretation due to the varying conditions o f sediment suspension. Acoustic instrumentation overcame these early observational challenges, and over the past fifty years, sonar has become increasingly common in oceanographic research (Blondel, 2009;Traykovski et al., 1999). Sonar technology first appeared in the early 1900's as a way to detect icebergs. Interest o f the sound navigation and ranging technology increased in the 1910's during the eve o f World War I to help military interests detect submarines by means o f echo location (Spindel, 1985). Since that time, towed side-scan sonar units have provided images of the seafloor around the world, with a resolution on the order of centimeters to meters. However towed side scan sonar is not designed for continuous monitoring o f a singular site and cannot easily make consistent timelapse imagery o f bed evolution."}, {"section_title": "Historic Applications o f Rotary Sonar", "text": "Since the 1970's, rotary sonar technology has been widely used by the offshore community for structural inspection and remotely operated vehicle navigation. Typically supplying a 360° image o f the seabed rather than a swath pattern, rotary sonars have provided observations o f the seabed morphology, allowing for insight into the acting hydrodynamic regimes affecting the surficial sediment of the seabed (Rubin et al., 1977). Within the scientific community, rotary sonars have primarily provided observations o f seafloor morphology supporting investigations o f interactions between seafloor sediments and hydrodynamic processes (Rubin et al., 1983). Notable sediment dynamics studies that have incorporated rotary sonar data include the Sandy Duck 97 experiment (Maier and Hay, 2009;Hay and Mudge, 2005), the Sediment Acoustics Experiments in Florida (SAX99 and SAX04) (Tang et al., 2009;Hay, 2008;) mine burial off Martha's Vineyard (Traykovski et al., 2007), shelf processes at the LEO-15 site in New Jersey (Traykovski, 2007;Traykovski et al., 1999) continental shelf analysis offshore o f California , lacustrine research , marine archaeology in the Black Sea , and lab experiments (Lacy et al., 2007). O f these studies, one o f the first was Rubin et al. (1983) who used a rotating side scansonar to analyze bedform migration on varying time scales from a fixed point above the bed surface (2 meters) in the San Francisco Bay. Radial scans o f the seafloor were taken at several locations for various lengths o f time ranging from a few hours up to 8 months. These unique studies characterized both large storm events and longer-term seasonal cycles. Images captured by the instrument revealed ripples (wavelengths > 30cm) visible in high-resolution imagery of the seabed on short timescales, while long-term migration o f sand waves were documented over an 8 month deployment (Rubin et al., 1983). A decade later,   the Martha's Vineyard Coastal Observatory (Traykovski et al., 1999), the Mid-Atlantic Coastal Ocean Observatory (Traykovski, 2007;Styles and Glenn, 2005), and the Southeast Coastal Ocean Observing System (Voulgaris and Morin, 2008) Additionally, we present a methodological approach for deployment o f rotary sonar instrumentation, and analysis o f resulting data."}, {"section_title": "Study Area-Cohesive Sediment Case Study ~ York River Estuary", "text": "The York River Estuary is a tidally-dominated system that forms at the confluence o f the Mattaponi and Pamunkey Rivers in southeastern Virginia (Figure 2-1). This tidally-dominated estuary is microtidal (tidal range ~ 0.7m) but the tidal currents within the system have been documented as strong enough to resuspend bottom sediments (Dellapenna et al., 1998, Maa andKim, 2002). Tidal currents within the river are on average greater than 60 cm s '1 but velocities tend to decrease near the river mouth to 40 cm s*1. The York River Estuary is defined as a cohesive sediment environment, with a predominate grain size of less than 63 pm, with muds occasionally exceeding 80% o f the total sediment. In terms of sediment resuspension, tides are generally the dominate processes acting upon the sediment, with waves increasing the erodibility in depths shallower than one meter . The main channel o f the York averages 10 meters deep throughout the estuary and is thought to be controlled by antecedent geology o f an incised Paleo-river valley . A secondary channel also exists in the estuary and begins where the main channel bifurcates near Page's Rock Light. A much shallower channel, which is considered partially abandoned, extends northward on the western flank o f the main channel . Additionally, the secondary channel is significantly shallower than the main channel, reaching an average depth of only 5 meters., Overall the region ranges from 2.5 -6 meters in depth, is generally free from boat traffic during the winter months, and suitable for instrument deployment and surveying. Furrows within the York River Estuary have been documented in both the main channel and secondary channel ) near the Clay Bank and Capahosic/Ferry Point regions. Furrows are rectilinear bedforms that are oriented parallel to water flow direction (Dyer, 1982). These sedimentary features were initially documented during a laboratory experiment when Allen (1969) (Cochonat et al., 1989), Saharan Rise (Lonsdal, 1978), Bahama Outer Ridge (Flood and Hollister, 1980), and Gulf of Mexico (Bryant et al., 2004)], deep lakes [Lake Superior (Flood, 1989;Viekman et al., 1992)], deltas [Mississippi delta front (Coleman et al., 1981)], Mediterranean Sea (Puig et al., 2008), and rivers and estuaries [Hudson (Flood and Bokuniewicz, 1986), Southampton (Flood, 1981), York River ]. In this study, we focused our survey efforts in the Clay Bank region within the secondary channel, where furrows have been found to be present at various times throughout the year. First identified as a ridge and furrow bedform system,  mapped these features in the York River Estuary in January o f 1995. The authors found that these features were present during conditions o f low river flow and had a spacing ranging from 0.7 to 7 meters. Over three years these rectilinear bedforms were mapped and were suspected to be transient in nature. Overall, Dellapenna et al. 2001 For this study, furrows were used as an evaluation marker, or stationary feature used for observation, in order to track sediment transition and movement processes within the middle of the York River estuary. Previous studies have shown that furrows act an area o f deposition and erosion, but the dynamics of how the two processes interact is not well understood (Viekman et al., 1992 and)."}, {"section_title": "Methods", "text": "A tripod-mounted Imagenex 881A rotary sonar, in conjunction with an ASL IRIS data logger, was used to assess the relationship between erosion and deposition on short-term scales (e.g. hourly and daily) in the York River Estuary (Figure 2-2). The 881A instrument is a tunable multi-frequency/ranging digital profiling imaging sonar, equipped with frequencies from 280 kHz to 1.1 MHz and radius range scales from varying increments o f 1 to 200 meters. Other variables, such as pulse length and absorption, can also be adjusted on the rotary sonar to obtain the best quality sonar images. For this study, a real-time data transfer was utilized in the data collection process, where a communication cable extended from the rotary sonar to a radio modem on the surface, which sent data back to the lab every hour. This two-way connection allows for in situ tuning o f the sonar settings and real-time observations, enabling strategic timing o f rapid response cruises to collect samples of the seabed following changes in bed conditions. In addition to the real-time connection, the rotary sonar was connected to an ASL Iris Data Logger for internal logging purposes and sonar run commands, which allowed for four independent programmable sequences to be run. The proprietary data logger software, IrisLink, providing the capabilities that allow for real-time data downloads, checking instrument status, and modifying instrument parameters for the optimization of the images based on the current conditions ( Figure 2-2). A variety o f frequencies and instrument heights above the bed were tested to determine the best parameters for a cohesive sediment environment. Frequencies o f 280, 500, 675,900, 1000, and 1175 kHz were tested. In addition, the instrument was placed 10, 25, 50, 80,100, 110, and 135 centimeters above the bed to determine optimal visualization of bedform features. Furthermore, a separate study was conducted at Clay Bank to determine the optimal parameter settings for gain and absorption to establish sequences that could be used during monthly deployments at the study area. In conjunction with this study, a YSI 6600 CTD Sonde was deployed simultaneously to see how the sonar responded to increasing and decreasing turbidity over tidal cycles, and to establish parameter sequences that could be used during monthly deployments at the study area. Once initial settings were chosen, the tripod was deployed for one month (between August 27, 2009to September 30, 2009 to obtain 360° surface images on an hourly basis, capturing a nearly continuous time series o f the seabed (Table 2- Hourly changes o f acoustic backscatter were calculated along four transects, at azimuths of 45°, 90°, 180°, and 225°, and analyzed to investigate exact points at 5m and 7m along of each transect to look at specific locations within the sonar's field of view (Figure 2-3b).\n\n"}, {"section_title": "Results and Discussion", "text": "Within the York River Estuary, optimal parameter settings for fine-grained environments were determined using the 881A rotary sonar. During the testing phase, it was concluded that 675, 1000, and 1175 kHz provided the best images of the seabed for fine-grained sedimentary environments. In addition, the optimal transducer position above the surface was at least 1 meter above the bed, where 1.0,1.1, and 1.35 meters yielded the best results. Furthermore, when the rotary sonar was deployed in the real-time setting over the course of a tidal cycle, there appeared to be no adverse effect to the images due to an increase in suspended sediment concentrations during maximum flow conditions. In order to correlate rotary sonar images to seafloor morphology changes, regional mapping surveys were conducted prior to the main analysis in During the first deployment, well-developed furrows were observed using sidescan sonar. It is important to note, that less than a week before the deployment a large storm event swept through the region, bringing high winds and large amounts of rainfall (Figure 2-4). An abundance o f longitudinal furrows were mapped using the sidescan sonar and general trends and observations were recorded at the start o f the first deployment. The sidescan sonar analysis identified 15+ furrows greater than 150 meters in length in the study region, most o f which had a width of between 0.5 and 1 meter. Observations showed that the most well-developed bedforms usually occurred in the presence o f an old piling or similar structure within the furrow channel . As the backscatter values increased during this time, the furrow began to narrow, providing a smaller acoustic shadow. In addition, the opposite slope of the furrow became more exposed, appearing acoustically brighter, thereby giving larger backscatter values. After this event, the wind shifted again back to the southeast, and the furrow appeared to return its previous state, when compared to the rest o f the deployment. Using rotating side-scan sonars in cohesive systems is still in its early stages, yet there are many applications for which this technology would be useful. These studies should include a more robust comparison o f data to hydrologic conditions, other localized scientific equipment (i.e. LISST, CTD, ADV, etc.), and a ground-truthing sediment analysis. Examples of possible future studies could include mapping movements of turbidity maxima to the more broad application o f monitoring channel morphology for shipping navigation.      February 2008"}, {"section_title": "Conclusions", "text": "Figure 2-4. Wind speed, river discharge, and tidal data that correlated to the early rotary sonar studies in the York River.\nSeven high-resolution bathymetric surveys were conducted between September 2008 and August 2009 in the Clay Bank region of the York River Estuary. This environment, which is composed o f mostly fine-grained cohesive sediment, is dynamic in nature and experiences event to seasonal-scale cycles in erosion and deposition as energy and circulation patterns change in response to storms, spring-neap tidal oscillations, and fluctuating fresh water discharge. Overall, the data presented here suggest that significant seasonal net deposition, averaging 0.19 ± 0.07 m, occurred over the secondary channel subregion o f Clay Bank in 2009 in response to the spring freshet and associated secondary turbidity maximum. This result is consistent with the timing and cause of depositional patterns inferred in this region by other investigators using different methods. Nonetheless, this is the first time that seasonal net deposition has been directly documented in the York River Estuary by changes in bed elevation rather than inferred indirectly by changes in bed properties. Although significant net deposition was broadly observed across the secondary channel region in this study, results from the main channel did not provide a regional signal of net change that exceeded the uncertainty bounds. to use as control points, uncertainties in individual bathymetric point measurements may be large. In this project we were fortunate to have high quality VECOS tide gauge data continually available immediately adjacent to our study region. The times when the vessel-based Real-time Kinematic (RTK)-GPS was operating reliably indicated that use o f the VECOS water level data rather than RTK-GPS added only ~ 1 to 3 cm of uncertainty to individual depth observations. Difficulties associated with translating a consistent, RTK-GPS-based vertical datum to our small vessel from one survey to the next led us to utilize a dozen identifiable bathymetric promontories as control points that were assumed not to change in elevation between cruises. Based on the standard deviation o f control point shifts from cruise-to-cruise, the confidence intervals on individual point measurements o f bathymetric change in the main and secondary channel regions were then estimated to be ± 0.46 m and ± 0.24 m, respectively. Averaging across many bathymetric soundings was then used to reduce uncertainties in estimates o f regional values o f mean depth. This approach improved uncertainty estimates for average depths across the main and secondary channel regions for individual cruises to ± 0.22 m and ± 0.09 m. Though a more detailed understanding is needed to fully constrain the dynamic changes occurring in cohesive, estuarine seabeds such as that o f the York River, this study nonetheless demonstrates the types o f spatial and morphologic changes that can be identified using highresolution interferometric bathymetry. Overall, this study helped to provide a high-resolution   Figure 4-3 . A bathymetry plot generated from the intexferometric system covers a 3.75km2 section of the Yazk River Estuary. This example is from the December 2008 cruise. For this study, the survey area was divided into three blocks based on bathymetry and the availability for quality ground control points. The main channel block is delineated by the purple dashed line and the secondary channeL'shoal region is highlighted by the light-blue dashed line. Between the main channel and secondary channel no reliable ground control points could be found, and therefore the region in white is not further analyzed within this study. Table 4-3. Seabed elevation for ground control points, along with calculated bathymetric change between surveys before the control points were used to shift the bathymetry. The December surv ey was used as the baseline bed elevation for this study. The overall average bathymetric change value between cruises was then used as the shift variable to align seabed elevations with the December survey.    Figure 4-6. Comparison analysis to assess the consistency between the VECOS tide gauge data and water height elevation captured in real-time during the surveys with Hypack. The mean absolute difference between the VECOS and despikedlow-passed filtered data for the 5 surveys averaged 2.2 centimeters. Values for each month are found within their respective sub-plots. Note that the analysis for the February comparison was for only the last 1.5 hours of the cruise.  .200 •320 • "}, {"section_title": "A", "text": "Figure 2-5. Sidescan sonar surveys during rotary sonar deployment in order to correlate rotary sonar images to seafloor morphology changes, a) The first survey showed well-developed longitudinal furrows extending up to 150m in length and 0.5 to 1 meter wide, occurring shortly after a large storm event with heavy winds. The left image highlights the location of the rotary tripod and the image on the right shows a furrow with an old piling or similar structure within the bedform. b) The second survey was conducted at the end of the rotary sonar deployments and illustrates a smoother bottom and the same furrow with less definition.  "}, {"section_title": "Sediment Coring", "text": "Seabed coring was conducted from a small vessel (~ 8-m length) once a week for five weeks in the spring o f 2010 (Table 3-1). The sampling occurred at the Clay Bank Secondary Channel study location in water depths averaging ~ 6 m. During each research cruise, the vessel was anchored and allowed to drift slightly around the anchoring site. At a local scale, this allowed random sampling o f the seabed. Sediment samples were collected using an Ocean Instruments Gomex box corer (surface area 625 cm2) (Figure 3-2a), in order to preserve the sediment-water interface. The collections occurred at slack tide to best ensure even and level core penetration, and the box core was generally able to penetrate 15 to 30 cm into the seabed. Intact GOMEX box cores were immediately subsampled for a variety of laboratory analyses. Acrylic subcores were then pushed by hand into the top o f the retrieved box core and removed for further analysis. Unfortunately, on occasion box-cores were discarded because o f \"blow outs\", where large shells or other objects impeded the closure of the box core, thereby allowing sediment and water to escape. The subcores were sampled for grain size, water content, organic content, 7Be activity, presence o f resilient pellets/aggregates, and erodibility, and were also imaged with digital xradiography. Samples for the first three analyses were extruded, sliced, and separated on board at 1-cm intervals down to the bottom o f each subcore. For the Be samples, 2-cm intervals were obtained after the first ten 1 -cm intervals, to reduce costs and data analysis time. Analysis for resilient pellets/aggregates was limited to the top two intervals (i.e., 0-1 cm and 1-2 cm). Sliced samples were immediately put in airtight containers and placed on ice in order to preserve the integrity of the sample and prevent moisture loss. Whole cores were obtained concurrently for Gust microcosm erosion experiments and for x-radiography slabs. Together, these samples were collected in hopes o f gaining a deeper understanding o f how erodibility may be related to the composition and structure o f the upper-most seabed."}, {"section_title": "Water Content, Organics, and Disaggregated Sediment Components", "text": "Water content samples were processed immediately after returning from the field to help ensure accurate sediment moisture measurements. The standard wet weight vs. dry weight method was utilized to determine percent moisture vs. solids of each 1 -cm interval sample. Each wet sediment sub-sample was homogenized, and ~ 200 to 300 mg was placed in a foil dish and weighed to provide the wet sample weight. The dish was then placed in an oven at 103°C until the sample visually appeared completely dry. Each dry sample was then weighed, returned to the oven for an additional hour, and reweighed until consecutive weight differences were less than 0.5 mg. This approach includes salt (typically -1% of the total weight) within the sediment portion o f the measurements. The total solids vs. water volume was calculated using the dry sediment weight and the assumed density o f the sediment grains (2.65 g/cm3) and water (1.0 g/cm). Total organics content was determined for previously dried samples by determining the loss on ignition (LOI) after at least one hour in a muffle oven, set to 550°C. The remaining ash weight was assumed to be sediment particles that were entirely inorganic. Grain size for the mud component was determined by using the wet pipetting method for grains less than 63 pm. The sediment was initially disaggregated using 10 mL o f dispersant, sonicated for an hour, and passed through a 63pm mesh sieve to isolate the mud component. Using standard pipetting practices, each 1-cm sample was analyzed at 1 phi intervals between 4 and 10 phi, based on settling velocities established using Stokes Law. Percent sand was determined by the fraction o f total sediment dry weight caught on the 63 pm mesh sieve.\nA consistent pattern seen in all the cores was a decrease in water content and organics with depth down-core, accompanied by an increase in content o f disaggregated sand-sized particles (Figure 3-4a-c, Table 3-2) (p < 0.01 for all cores except p > 0.1 for % sand on 5 May). Percent water was determined relative to the initial weight of the wet sediment, while percent organics and sand were relative to the sediment's dry weight.  found that for similar York River Estuary cores collected in 2007, sediment samples that were muddier tended to contain more water and organics than samples that were sandier. To further examine patterns in water and organic content while normalizing for the sand content, the water and organic percentages were replotted relative to the mud matrix alone, i.e., by effectively removing the sand-sized (presumably inorganic) particles while leaving the water, mud and organics behind in the calculation (Figure 3-4d-e). Once the sand had been removed from the calculation, the water content and organic content did indeed vary less in the upper part o f the cores. The standard deviation (SD) was used to quantify the degree o f variability within the upper part a given core (depth shallower than 8 cm) for water content and organic content. The standard deviation (SD) for percent water for depths shallower than 8 cm depth dropped from 5.6 to 3.8 percentage points when considering the mud matrix alone, and the SD o f organic content dropped from 1.20 to 0.93 percentage points, changes that were both found to be significant at p < 0.1. Lower in the cores (deeper than 8 cm), normalizing for sand content actually increased the inter-core variability in water and organic content. Sources o f increased heterogeneity below 8 cm may include inherent spatial variability (the week-to-week cores were collected at least 10s o f meters apart -see Table 3-1). The extreme excursion in normalized values at ~10 cm for April 29th may be due to the presence o f relatively large pieces organic detritus -it is important to recognize that organics may occasionally be present as sand-sized component particles (i.e., even after disaggregation). The mass o f the disaggregated silt-size fraction relative to the mud matrix (Figure 3-4f; calculated from data in Table 3-3) was generally similar from core to core. Except for the May 5th case, the silt fraction of mud was about 40% from the surface down to ~11 cm. All five cores then exhibited an increase in silt o f about 1 0 percentage points between 1 1 cm and the bottom of the core. Omitting a few anomalous measurements on May 5th (those below 30%), the silt content o f the mud matrix shallower than 11 cm averaged 39.6%, while the silt content deeper than 12 cm averaged 47.4 %. This increase in silt content deeper than 12 cm on all dates was significant at p < 0 .0 0 0 1 ."}, {"section_title": "Pellets and Other Pellet-Sized Grains", "text": "The presence o f resilient fecal pellets and/or biologically compacted mud aggregates (from now on referred to simply as pellets) were determined for the depth intervals o f 0-1 cm and 1-2 cm using a combination and modification o f the Black et al. (2002) and Rodriguez-Calderon (2010) pellet calculation methods. For each depth interval in each core, two 10.00gram (± 10-mg) wet sediment samples were sieved through four mesh sieves (150 micron, 90 micron, 63 micron, and 45 micron). The first set o f sediment was sieved using traditional sieving methods, where the sediment was initially disaggregated using dispersants and sonification in distilled water. The aim o f disaggregation was to capture the original population (tPdissaggregated) °f relatively large particles (e.g., fine sand and coarse silt, small shell fragments, plant debris) in the absence o f pelletization (Figure 3-2b). The sediment caught on each sieve was dried at 103°C and weighed to determine mass percentages of each size class and then muffled at 550°C to determine the LOI o f the non-pellet sediment sample. Conversely, the second sample set was not disaggregated, and careful attention was paid as to minimize physical disturbance o f the sample. Using the same amount of sediment (10.00 grams ± 1 0 mg), the second sample was gently sieved through the same four sieve sizes, using water with similar salinity to the field site (~ 15 ppt) rather than distilled. Each sample was gently shaken within a porcelain bowl and no direct contact or pressured water spray was placed on the grains. This continued until all the sediment particles were sieved and the water ran clear. Sediment from each sieve was then dried to obtain the weight of the intact pellet-sized sediment in the form it was collected from the box core <pgentie sieve (Figure 3-2b). The intact wet sieved sample was also muffled to determine its LOI. The pellet weight in each size class {(ppeiiet) was then given by VPellet ~ *Pgentle jsieve Vdisaagregated\nOverall, the size distributions for the pellets and the pellet-sized disaggregated particles (i.e., \"disaggregated\" coarse silt and fine sand) were roughly similar ( Figure 3-5a,b; calculated from data in Table 3-4), with the most abundant size by mass always found on either the 63 or the 90-micron sieve. Also, in all cases, the third most mass was caught on the 45-micron sieve, and the least was caught on the 150-micron sieve. Thus the range o f sieves chosen successfully spanned the peak o f the size distribution in every case. The 50th percentile size (dso) for pellet size distributions in Figure 5a averaged 81.0 microns, while the dso for the \"disaggregated\" silt/sand size distributions in Figure 3-5b was virtually identical and statistically indistinguishable (p > 0.7) from the pellet samples with an average value o f 80.3 microns. However, the pellets exhibited more variability in their size distribution between samples, as quantified by the standard deviation o f the pellet size distribution around the mean o f 5.7%. In contrast, the SD for the \"disaggregated\" silt/sand size distribution around the mean was significantly less (p < 0.001) at only 2.4 percentage points. Also, the mean fraction o f pellets larger than 150 microns (8.4 %) was significantly larger (p < 0.001) than the mean fraction o f \"disaggregated\" particles (3.3 %), while the mean fraction o f pellets in the 90 to 150 microns class was significantly less than \"disaggregated\" particle fraction (28.4 % vs. 34.4 %, p < 0.02). Differences in the mean fractions o f pellets versus \"disaggregated\" particles for the other two size classes were insignificant (p > 0 .6 ). The pellets contained significantly more organic matter than the \"disaggregated\" silt and sand grains on average for every size class (p < 0.001) ( Figure 3-5c-d). When summed over all four size classes according to the classes' relative abundance, the average organic content was 9.4 % for the pellets and only 1.5 % for the \"disaggregated\" particles (difference significant at p < 0.0001). For both pellets and \"disaggregated\" material, percent organic matter was significantly higher for the largest size class (p < 0 .0 0 2 ), averaging 15.2 and 6 . 1 percent, respectively. This is likely due to the occasional presence o f larger pieces o f organic detritus in both the pelletized and \"disaggregated\" particle populations. Since the abundance o f the largest size class was small in each case, the occasional pieces of large organic detritus did not strongly affect the organic content averaged across size classes for either the pellets or the coarse silt/fine sand. When weighted for relative abundance o f size classes, pellets made up an average o f 36.2 % o f the mass contained in the total \"gentle sieve\" (i.e., pellet plus \"disaggregated\") particles caught on 45 micron or larger sized sieves (Figure 3-5e). The percentage o f pellets relative to total particle mass was largest for the >150 micron size class, at 59.2 % (p < 0.001). Examining percent water and organics relative to the mud matrix reduced variance in the upper section o f cores (see Section 3.4.1). Thus the percentage mass of pellets relative the total mud matrix was also examined. To estimate the total mud content in the core slices used for pellet analysis, the values for disaggregated sand-sized content caught on sieves > 63 microns during the \"disaggregated\" particle analysis (contained in Table 3-4) were scaled in percentage terms to match the percent sand content for the corresponding dates and depths in Table 3- "}, {"section_title": "Beryllium-7", "text": "Sediment samples for measurement of 7Be activity were sliced onboard the research vessel at 1-cm intervals for the first 10 cm and 2-cm intervals for the rest o f the core. Back in the lab, sediment collected from each depth horizon was individually homogenized, and if excess water was present, the sample was centrifuged, and the extraneous water was decanted. determine the disintegrations per minute (dpm). Each sample was then corrected for decay that occurred due to time elapsed between sediment collection and counting. Activity rates (dpm/g) for each sample were calculated and then normalized based on both sediment weight and grain size, as 7Be intrinsically attaches more easily to mud particles, rather than sand particles. In addition, the 7Be inventories (I) were calculated for the upper 3cm o f each core applying the equation: Where Ai = the specific activity based on the efficiency factors at 477Kev, ps = average particle density o f 2.65 gem'3 and <p = the porosity (Dibb and Rice, 1989;Kniskern and Kuehl, 2003;Rodriquez and Kuehl, 2013).\nAll o f the cores exhibited ?Be activity that was clearly detectable above background and which dropped off at relatively similar rates with depth into the bed. Beryllium-7 activity per gram o f dry sediment as a function o f depth into the bed (corrected for decay time since field collection) is contained in Table 3-5 and plotted in Figure 3-6 for the five sampling cruises. The profiles in Figure 3-6 have additionally been normalized using information from Table 3-2 to \"remove\" the sand so that the 7Be activity is plotted as activity per gram o f mud. This was done because 7Be in the York River Estuary is known to adsorb much more efficiently to the greater surface area per mass o f mud versus sand . All o f the cores exhibited relatively strong activities o f at least 0 . 8 dpm per gram of dry mud at least as deep the 1 -2 cm depth interval. Moving downward from the surface, eight o f the ten cores last exhibited an activity greater than 0.2 dpm/g o f mud within 1 -cm thick horizons centered at 4.5 to 6.5 cm. There was also notable variability from core to core. Activities at the surface ranged from 3.0 to 1.0 dpm/g o f mud, and the SD for activity among the 0-1 and 0-2 cm slices across all ten cores was 0.89 dpm/g. However, when the top two slices for the two cores from each sampling date were grouped, there was found to be no significant difference (p > 0 .1 ) in mean activity between any two dates, likely due in part to the small number o f samples."}, {"section_title": "DigitalX-radiography", "text": "Sediment slabs (12 cm x 2.5 cm x (up to) 30 cm) were collected from the Gomex boxcores each week and imaged back at VIMS using a Varian Paxscan digital x-radiographic panel. \nX-radiography revealed mottled patterns o f light and dark banding within ~ 1 cm of the surface on every coring date (Figure 3-7a-e), characteristic o f moderate bioturbation (e.g., ). There were no obvious sequences o f several cm-thick parallel laminations at the surface o f the cores, such as those  associated with periods o f rapid seasonal deposition at Clay Bank. In every x-radiograph, there was an overall increase in gray scale brightness from the top of the core toward the bottom, consistent with an overall decrease in water content with depth. There was also evidence on every cruise date o f a step-like increase in brightness between about 7 and 10 cm below the sediment-water interface. In an effort to examine this transition in brightness semi-quantitatively, pixel intensity across each x-radiograph in Figure 7a-e was averaged and then plotted as a function o f depth between 1 and 14 cm. The 0-1 cm interval was not included because of ambiguities in brightness associated with averaging across the slightly uneven core surface. The width-averaged pixel intensity was then normalized on a scale o f zero to one such that the lowest width-averaged intensity between 1 and 14 cm for each core was set to zero, and the highest width-averaged intensity was set to one (Figure 3-7f). In every core, this analysis highlighted a zone o f gradually increasing pixel brightness from 1 to ~ 7 cm, a rapidly increasing intensity layer located in the vicinity o f 7 to 10 cm, and a layer of nearly uniform pixel intensity between ~ 10 cm to 14 cm."}, {"section_title": "Erodibility", "text": "On each cruise, two subcores were obtained from separate box-cores and brought back to the lab (< 1 hour by boat) for immediate erodibility analysis using a Gust erosion microcosm (Figure 3-3). Subcores (10-cm inside diameter) were carefully selected, making sure both cores appeared level, uniform, and with an undisturbed sediment-water interface. The erodibility measurements utilized two concurrent microcosm experiments with a rotating disc placed at the top o f each core (Gust and Muller, 1997;. The setup required that the sediment surface was located 10 cm from the revolving disc and that local water filled the upper 10 cm. When the disc rotated, it produced a circulation pattern that applied a uniform shear stress over the sediment-water interface. Over the course of 2.5 hours, seven shear stresses were applied to the seabed within the core (nominally set to 0.01,0.05, 0.1,0.2, 0.3,0.45, and 0.6 Pa). The first setting o f 0.01 Pa was considered to act as a flushing mechanism to remove any \"washload\" initially present in the core tube, and it is operationally defined that zero true bed erosion occurs at this very low stress. After 30 min at 0.01 Pa setting, the Gust microcosm increased rotation to each larger shear stress for 20 min. Actual disc rotation rates, which were recorded by the Gust system during each experiment, were used to after the experiment to more precisely calculate the true shear stresses applied. It was discovered after the final Gust experiment that the nominal 0.6 Pa setting did not function correctly. As the rotating disc began applying stress, a constant stream of water was suctioned from the core and the effluent was passed through a flow-cell o f a Hach 2100-N turbidimeter, which provided NTU readings o f the suspended sediment withdrawn from the core. Concurrently, estuarine water collected at the field site was pumped into the microcosm the same rate. The effluent from each shear stress step was then filtered onto a 0.7pm glass-fiber filter to calibrate the turbidimeter and determine the total mass of sediment eroded from the core. The \nAll ten o f the erodibility experiments associated with the five coring cruises (Table 3-6; Figure 3-8) clearly exhibited Type 1 depth-limited erosion, as was also the case for the York River Estuary cores eroded in Gust chambers by . Each time stress was increased in the Gust microcosm for the experiments displayed Figure 3-8, erosion occurred rapidly at first and then dramatically slowed as the eroded depth in the core approached the depth where the critical erosion stress, xc, equaled the external stress applied by the microcosm. When a seabed in a tidal estuary is characterized by strongly depth-limited erosion, as was the case here, the erodibility o f a given core can be fully characterized by the relationship between eroded mass and t c, as plotted in Figure 3-8. This is because the time-scale over which erosion reaches the depth where xc nearly equals the externally applied bed stress (~ 10 minutes for most York cores) is much shorter than the characteristic time scale over which tidal stress changes (~ 2 hours). As a result, the depth-varying erosion rate \"constant\" (which is poorly constrained in any case), is not important to determining how much sediment is eroded. To compare erodibility between dates, eroded mass values from Figure 3-8 were interpolated to 0.2 Pa, and then paired cores for each date were grouped. A stress o f 0.2 Pa was used because field observations o f bed stress at Clay Bank have indicated 0.2 Pa to be a typical amplitude for bed stress at maximum tidal velocity . In comparing erodibility among dates, mean erodibility was lowest (0.083 kg/m at 0.2 Pa) on 11 May May (p > 0.1). As was the case for Be, the low number o f significant differences may be due in part to the small sample size. Pooling all 10 cores together, the mean eroded mass at 0.2 Pa was 0.147 kg/m2 with a SD o f 0.068 kg/m2."}, {"section_title": "Statistical Tests", "text": "P-values were used to determine statistical significance, with a significance cut-off o f p < 0.1 (i.e., less than a 10% chance that randomly selected observations would not produce a similarly significant result if none in fact existed). A one-way ANOVA was used to distinguish whether population means were different. P-values associated with linear regressions were used to test the one-sided null hypothesis in correlations. The p-values themselves were calculated by routines provided by the software package MATLAB (MathWorks, 2013)."}, {"section_title": "Results", "text": "\n"}, {"section_title": "Correlations Between Core Properties Within the Top Centimeter", "text": "In order to statistically identify likely influences on and signatures o f sediment erodibility and consolidation, correlation analysis was performed on the various sediment properties measured within the uppermost centimeter o f the seabed Stevens et al., 2007;Wiberg et al., 2013). If more than one observation of a given property was obtained from the 0 -1 cm interval on a given cruise date, the multiple values for that date were averaged before the correlations across cruise dates were applied. The application o f correlation analysis was limited to the uppermost centimeter because only a few millimeters or less o f sediment was eroded at 0.2 Pa during each Gust microcosm experiment. In Figure 3-8, 0.2 Pa corresponds to < ~ 0.2 kg/m2, i.e., only ~ 0.02 grams/cm2. Even at 90% porosity, this would have corresponded to just 2 mm o f sediment o f erosion. Table 3-7 contains a listing o f correlation r-values and p-values among parameter values o f interest that were measured within the 0-1 cm interval. Significant correlations based on a one-sided p-value less than 0.1 are highlighted in Table 3-7 by dark shading. Correlations with 0 . 1 < p < 0 . 2 are highlighted with light shading as trends that may be worth noting, although they did not actually satisfy our definition o f significance. Other than sand content and particle grain size, the properties examined were normalized relative to mud content, given that properties of the \"mud matrix\" are thought to be more important to erodibility of muddy beds than are properties involving sand content . In addition to core properties, elapsed time (in days since the first cruise) was also considered. The results in Table 3-7  activity. There also was a tendency for pellet concentration to decrease as water content increased. In addition, 7Be activity per gram of dry mud was negatively correlated with percent sand, tended increase with mud water content, and tended to decrease as pellet size increased."}, {"section_title": "Discussion", "text": "\n"}, {"section_title": "Cruise Timing Relative to Seasonal Turbidity Transition and Spring-Neap Cycle", "text": "The York River Estuary coring cruises described above began a few weeks after the end o f the 2010 winter-to-spring freshet (Figure 3-9a), providing an opportunity to study in detail the evolution o f the seabed following the annual dissipation o f the secondary turbidity maximum. The general hydrodynamic setting before, during and after the coring cruises can be inferred from daily river gauging data provided by the U.S. Geological Survey (USGS, 2013) and from monthly water quality samples collected by the Environmental Protection Agency (EPA, 2013). In 2010, the seasonal pattern o f discharge, salinity and suspended sediment in the York River Estuary (Figure 3-9a-c) followed the typical trend previously observed by others, i.e., a progression from a wetter winter/spring to a drier summer/fall, with the transition in conditions centered around the late spring to early summer . Although the EPA monitoring data in the York are sparse in time and space, the EPA data suggest that the coring cruises in this study were well-timed relative to the annually recurring, seasonal dissipation of the mid-estuary turbidity maximum as outlined by . Together with USGS discharge time-series, EPA data suggest that in spring 2010 a seasonal transition from high to low discharge (Figure 3-9a) led to a temporal shift in the middleestuary from salinity stratification to more vertically mixed conditions (Figure 3-9b). The reduction in salinity stratification presumably eliminated the physical trapping mechanism that favored sediment accumulation in the middle estuary. So suspended sediment concentrations in the middle estuary then declined (Figure 3-9c). The data in Figure 3 "}, {"section_title": "Bed Erodibility and Its Relation to Time and Tidal Disturbance", "text": "In comparison to the erodibility o f cores sampled at the same location in 2007 by  exhibited significantly more eroded mass (p < 0.0001) than those from 2010 ( Figure 3-10a), whereas cores from summer and fall o f 2007 exhibited significantly less eroded mass (p < 0.02) than those from 2010 ( Figure 3-10b). The 2007 cores, which were collected at monthly or longer intervals, were bimodal in character, in that erodibility was consistently high when the secondary turbidity maximum was present and much lower after the turbidity maximum had been dispersed . It is likely that monthly sampling was too coarse in time for  to capture relatively rapid consolidation. In contrast, the more frequently collected data reported here from April through May 2010 allow an examination o f evolving erodibility over time-scales more consistent with the several days to a week or two expected for substantial changes in muddy bed consolidation (e.g., Mehta and McAnally, 2008). An examination of the spring 2010 cores as a time-series revealed a tendency for erodibility to decrease with time along with a superimposed temporal oscillation correlated to low-passed tidal range (Figure 3-11). To evaluate erodibility as a time-series, eroded mass values from Figure 3-8 were interpolated to 0.2 Pa, and the paired cores were then averaged to produce a single value for each date (Figure 3-1 la). By testing a range of low-pass time-scales and lagtimes, it was found that the correlation between eroded mass and low-passed tidal range peaked when tidal range was averaged over the 11 tidal cycles (5.7 days) immediately preceding core collection. Tested on its own, the tendency for erodibility to decrease in time was a trend rather than being statistically significant (see Table 3-7), but the correlation with low-passed tidal range was significant on its own (r = 0.76, p < 0.07; Figure 3-1 lb). Interestingly, a multiple linear regression o f eroded mass versus both time and low-passed tidal range notably improved the overall correlation, increasing the r-value for the combination to r = 0.94 and decreasing the pvalues associated with the proportionality coefficients to more significant values of p < 0.08 and p < 0.05 for time and tidal range, respectively. Together these correlations suggest that consolidation with time reduces erodibility, but disturbance by tidal resuspension tends to increase erodibility. The peak correlation with tidal range averaged over the previous 11 tidal cycles suggests a characteristic bed consolidation time scale o f about 5 to 6 days. Consolidation over several day time-scales, \"reset\" by intermittent resuspension events, is qualitatively consistent with recently developed models for time-dependent cohesive seabed erodibility (Rinehimer et al., 2008;Sanford, 2008)."}, {"section_title": "Observations Suggest Consolidation and Bed Together, Despite Limited Resolution", "text": "Correlations o f seabed properties with time and each other (see Table 3-7) suggest the seabed o f the York River Estuary was simultaneously subject to both consolidation and bed armoring following dispersal o f the turbidity maximum. Overall, the trends observed in this study are consistent with both dewatering and a progressive winnowing o f the most easily suspended material from the sediment surface, including coarse silt, small pellets, and organicrich floes, leaving behind and concentrating sand and larger pellets. As time passed, the sand content, median sand size, percent pellets, and median pellet size where all observed to increase at the surface (Table 3-7), while the percent water, organics, silt, 7Be activity and erodibility decreased. Although some o f these correlations with time were weak, these parameters were often additionally correlated with each other in a sense that supports this overall interpretation. Classically, a decrease in the percent water o f the mud matrix, i.e., dewatering, is synonymous with cohesive consolidation (e.g., , whereas an increase in size and concentration o f sand-sized particles, i.e., coarsening o f the bed, is synonymous with bed armoring (e.g., Wiberg et al., 1994). Consolidation and bed armoring each lead to lower erodibility. Typically, however, consolidation and bed armoring are each associated with cohesive and non-cohesive sediment, respectively and exclusively. The results of this study suggest that cohesive-like consolidation and non-cohesive-like bed armoring may occur simultaneously in mixtures o f pelletized mud and sand, even when the overall concentration of disaggregated clay and silt would classically define the bed to behave more like pure mud (Law et al., 2008). The possible simultaneous occurrence o f consolidation and bed armoring in mixed muddy beds is also consistent with recent advances in cohesive bed modeling (Sanford, 2008). In this study, it is likely that limited eroded mass, associated sampling complexities, a small overall number o f cores, and confounding tidal variability all conspired to make a clearer resolution o f the relationship between core properties and erodibility difficult. As described in Section 3.4.6, only about 2 mm o f sediment was likely to have been eroded in the Gust chamber at 0.2 Pa. Based on experience, the smallest surface core thickness interval that could reliably be sampled in the field while retaining representative water content was about 1 cm. If the top 1 cm did not optimally represent the key properties of the top 2 mm, then a strong correlation of parameters within the top 1 cm to erodibility might be difficult to obtain. Statistically speaking, the overall number o f cores processed was also relatively small; however, collection and processing o f any more cores any more frequently over a five-week period was not logistically possible. Finally, tidal disturbance likely affected erodibility significantly; but tidal range was not found to be notably correlated to any of the parameters in Table 3-6 other than erodibility, even at p < 0.2 (details o f correlations with tidal range not shown). Thus the imprint of tidal disturbance on erodibility in particular may have added additional \"noise\" to erodibility' s potential correlation to other factors."}, {"section_title": "Controlling fo r the Possible Role o f Significant Net Erosion or Deposition", "text": "Evidence layering above -7 cm from x-radiographs was also observed to be mottled on every cruise date, which additionally argued against significant deposition. Clearly properties found any further than -1 cm below the top o f the cores examined here cannot directly control surface erodibility, because mass erosion during a given tidal cycle can penetrate only several millimeters into the bed at most. Nonetheless, the relatively uniform properties found in each core between 1 and 7 cm below the surface is still an important finding in this study, because it simplifies a potentially confounding role for depositional history. At this same site,  found that periodic rapid deposition associated with seasonal formation o f the turbidity maximum was responsible for the dramatic seasonal increases in erodibility that they documented. Thanks to the relative seabed stability documented during the present study, this set o f observations set may provide an especially useful data set for constraining relatively simple but time-dependent models for time-dependent consolidation and/or bed armoring o f mixed grain muddy deposits in the absence of major erosion or deposition. Motivated by previous studies which associated muddy seabed pelletization with decreased erodibility, this study developed a methodology to consistently sample for resilient muddy pellets and described their occurrence and size distribution in detail. The 50th percentile (dso) for pellet size distributions averaged 81.0 microns and significantly increased over the course o f the study. The organic content of the pellets averaged 9.4% compared to only 1.5% for the sand and coarse-silt-sized particles that survived classical laboratory disaggregation. Before disaggregation, mud pellets which survived gentle sieving made up, by dry weight, 36% o f all particles > 45 microns and 59% o f all particles > 150 microns."}, {"section_title": "Summary and Conclusions", "text": "Along with a tendency for erodibility to decrease with time, this study identified a superimposed temporal oscillation in erodibility correlated to low-passed tidal range, presumably because stronger tidal currents disturbed the bed, partly counteracting the temporal effects o f consolidation. It was found that the correlation between eroded mass and low-passed tidal range peaked when tidal range was averaged over the 1 1 tidal cycles immediately preceding core collection, suggesting a characteristic bed consolidation time scale o f about 5 to 6 days. Consolidation over a several day time-scales, \"reset\" by intermittent resuspension events, is also qualitatively consistent with recently developed models for time-dependent cohesive seabed erodibility.        £ -6 Q. -1 0 (e) 27 May 7Be activity of mud (dpm/g) Figure 3-6. Beryllium-7 activity per mass o f dry mud, corrected for time between coring and counting, for weekly sampling at the Clay Bank site between late April and late May, 2010. Darker -> Lighter Figure 3-7. (a)-(e) Exam ple digital x-radiographs from cores collected on the five w eekly sampling cruises, (f) Relative pixel intensity, averaged across the widths o f the images in (a)-(e) width, for depths from 1 to 14 cm. The width-averaged pixel intensity was norm alized on a scale o f 0 to 1 such that the lowest w idth-averaged intensity for each core was set to 0, and the highest w idth-averaged intensity was set to 1.     Correlation r-values and p-values. Correlations with p < 0.1 or 0.1 < p < 0.2 highlighted by dark or light shading,  To make 10% Calgon solution: In a small beaker, weigh out: 51g of Sodium Metaphosphate and 0.3g of Sodium Bicarbonate Place this mixture in a lliter flask and stir vigorously until all of the powder is dissolved (you can use a stir plate/magnets to help this process along)."}, {"section_title": "Prepping Samples:", "text": "1. Stir each sample to homogenize. ***Note. Be gentle with the sediment as to not break up the fecal pellets."}, {"section_title": "2.", "text": "Weigh labeled 150 mL beaker, tare to zero 3. Weigh out 10.0 grams of each sample into beakers. Make sure to record these weights.\nFirst, place the 90 micron sieve in the bottom of the bowl."}, {"section_title": "You want the weight o f the sediment to be the same for the ORIGINAL SEDIMENT sample and the FECAL PELLET sample.", "text": "For the ORIGINAL SEDIMENT samples ONLY 4. Add 10 mL of 10% Calgon solution to the samples."}, {"section_title": "5.", "text": "Add D! water to 60 mL using the Dl squirt bottles (also squirt down any sediment on the sides) 6. Place samples in the sonicator for one hour.\nCover the beakers with parafilm. 6. Let samples sit in the refrigerator overnight. Do not let the samples sit out at room temperature. You do not want any of the organic material to begin breaking down.\nUse Dl water hose from a sink and work all the shells to the bottom of the sieve, then use the Dl water squirt bottle to squirt sample from the sieve into its labeled beaker. ***Note. If sediment was still coming through the sieve after the allotted time, make a note on the spreadsheet and make sure to clean the remaining sediment on the sieve. We want to ensure that the sediment left on the sieve and moved to the beaker is indicative of sediment greater than 150 microns.\nPour the FECAL PELLET sample onto the 90 micron sieve and carefully rinse the beaker with Dl water onto the sieve to make sure all sediment is removed from the container and captured for analysis."}, {"section_title": "For the FE C A L PELLET samples ONLY", "text": ""}, {"section_title": "4.", "text": "Add 60 mL of Dl water to the beakers. Carefully squirt down any sediment on the sides and only add water from the side of the beakers. Do not exude any extra force or pressure onto the FECAL PELLET samples.\nGently stir your FECAL PELLET sample beaker to break up as much of the clumps as possible. ***Note. DO NOT vigorously stir the sample. You want the pellets to remain intact. This process is just to get some of the sediment in suspension and not all in one clump."}, {"section_title": "Sieving:", "text": "For the ORIGINAL SEDIMENT samples ONLY 1. Grab 150 micron, 90 micron, 63 micron, and 45 micron sieves, and 2-3 porcelain bowls 2. Once samples have been sonicated stir up the sample in the beaker with a glass rod. Try to rid the sample of any clumps before commencing the sieve process."}, {"section_title": "3.", "text": "Place 150 micron sieve over bowl and pour sample onto sieve. Rinse beaker with Dl water bottle onto the sieve to make sure all sediment is removed from the container and captured for analysis. 4. Using the Dl squirt bottle (and as little water as possible), squirt all the mud and sand through the sieve into the bowl. Shells and other large particles should be caught on this sieve. ***Note. Sieving the sediment through the 150 micron sieve will be the most tedious of the sieves and will use the most water. Sieve the sample as diligently and use as little water as possible. When the sieved water is clear, you can stop sieving and continue to the next step. If the material is still running through the sieve after 700 mL of water has been used, continuing sieving for another 5 minutes and stop. At times sediment will continue to go through the sieve so in order to conserve water for the rest of the experiment, a cap is needed to continue the experiment.\nFill the porcelain bowl with Dl water, just to the top of the sieve surface."}, {"section_title": "6.", "text": "Place the labeled beaker in the oven (103-105*0) until water has evaporated. 7. Thoroughly rinse out the 150 micron sieve ***Note. To clean the sieve, make sure to turn sieve upside down and rinse from the bottom.\nSlowly move the bowl in circular motions to begin moving the sediment across the sieve surface. 7. Occasionally (once a minute), pick up the sieve to allow sediment to readjust and move the sediment. 8. Continue steps 6 and 7 for 5 minutes. 9. Place porcelain bowl on stir plate and put a medium size stir bar under the sieve. Place stir plate on medium-high stir speed and let sit for 5 minutes. 10. Remove bowl from stir plate along with the stir bar. Rinse stir bar into bottom of bowl so no sediment is lost. 11. Transfer sieved water from one bowl to new one and begin again to track the progress of how much sediment remaining is passing through the sieves. 12. Repeat steps 4-11 until water runs clear."}, {"section_title": "8.", "text": "Next, place the small 90 micron sieve over second porcelain bowl 9. Pour previously sieved sample (left in bowl) over the 90 micron sieve and use Dl squirt bottle to get all of the sediment out of the bowl. Use the Dl squirt bottle and work the sediment from one end of the sieve to the other, using as little water as possible (the ultimate goal is for the water in  the porcelain bowl to be clear without using more than 2000mL). You will need to continue to repeat the sieving of sediment until this goal is met!\nPlace graduated cylinders to the side for pipette analysis and place beakers in the (103-105'C) oven for at least 24 hours then begin weighing procedure. ***Note. Place the cylinders in a region that is not easily disturbed once you start pipetting the area cannot be hit, bumped, etc., as it will disrupt the sediment fall velocity and mess up your results. For the FECAL PELLET samples ONLY 1. Grab 150 micron, 90 micron, 63 micron, and 45 micron sieves, and 2-3 porcelain bowls."}, {"section_title": "***Note. As you do this, empty the porcelain bowl into a neighboring porcelain bowl periodically to see keep track of your progress", "text": ""}, {"section_title": "10.", "text": "Once the water runs clear, use Dl water hose from a sink and work all the sediment to the bottom of the sieve, then use the Dl water squirt bottle to squirt sample from the sieve into its labeled beaker. 11. Place the labeled beaker in the oven (103-105'C ) until water has evaporated."}, {"section_title": "12.", "text": "Thoroughly rinse out the 90 micron sieve 15. Once the water runs clear, use Dl water hose from a sink and work all the sediment to the bottom of the sieve, then use the Dl water squirt bottle to squirt sample from the sieve into its labeled beaker. 16. Place the labeled beaker in the oven (103-105'C) until water has evaporated."}, {"section_title": "17.", "text": "Thoroughly rinse out the 63 micron sieve Once the water runs clear, pour the remaining sieved water into the graduate cylinder and cover it with parafilm to ensure that no dust settles in them before the experiment is performed.\nFollow the same procedure as before (steps 4-12). Once the water runs clear, use Dl water hose from a sink to CAREFULLY work all the sediment to the bottom of the sieve, then use the Dl water squirt bottle to squirt sample from the sieve into its labeled beaker (ex. Sample#_0-lcm_63um_FP)..\nFor 8 phi: DO NOT STIR BEFORE WITHDRAWLH! When it is time for 8phi simply withdrawal 20 mL from the cylinder, but this time at 10 cm instead of 20cm and place in correct aluminum tray."}, {"section_title": "***Note. Try not put water on the sediment directly but rather on the beaker sides and let the water push down the sediment", "text": ""}, {"section_title": "***Note. As you do this, empty the porcelain bowl into a neighboring porcelain bowl periodically to see keep track of your progress (the ultimate goal is for the water in the porcelain bowl to be clear without using more than 2000mL). You will need to continue to repeat the sieving of sediment until this goal is met!", "text": "13. Once the water runs clear, use Dl water hose from a sink to CAREFULLY work all the sediment to the bottom of the sieve, then use the Dl water squirt bottle to squirt sample from the sieve into its labeled beaker (ex. Sample#_0-lcm_90um_FP). 14. Keep this sediment beaker out. You will be sieving this sample again later."}, {"section_title": "15.", "text": "Thoroughly rinse out the 90 micron sieve.\nRinse the stirring rod in the first cylinder and clean again in the second to remove any extra sediment. Next rinse the pipette with the Dl water from the beaker between sediment withdrawing from each sample."}, {"section_title": "16.", "text": "Pour previously sieved sample (left in bowl) over the 63 micron sieve and carefully rinse the beaker with Dl water onto the sieve to make sure all sediment is removed from the container and captured for analysis. ***Note. Try not put water on the sediment directly but rather on the beaker sides and let the water push down the sediment.\nWatch the clock and use time sheet to know when to do each sample. There will be a long break between 4phi and 8phi. During this break recover the cylinders with parafilm and be sure not to bump the graduated cylinders and cover your 4 phi sample trays OR put them in the oven."}, {"section_title": "18.", "text": "Place the labeled beaker in the oven (103-105'C ) until water has evaporated.\nWhen experiment is complete place trays in oven (103-105'C ) for at least 24 hours then begin weighing procedure. Determine organic content 5. To determine organic content place in muffler (550'C) for at least an hour 6. Pull out of muffler and transfer samples to a regular oven tray to cool for 15 minutes so that the samples don't melt the desiccator shelves."}, {"section_title": "19.", "text": "Thoroughly rinse out the 63 micron sieve. 20. Next, pour previously sieved sample (left in bowl) over the 45 micron sieve and carefully rinse the beaker with Dl water onto the sieve to make sure all sediment is removed from the container and captured for analysis."}, {"section_title": "21.", "text": "Follow the same procedure as before (steps 4-12). Once the water runs clear, pour the remaining sieved water into the graduate cylinder and cover it with parafilm to ensure that no dust settles in them before the experiment is performed."}, {"section_title": "22.", "text": "Place graduated cylinders to the side for pipette analysis and place beakers in the (103-105°C) oven for at least 24 hours then begin weighing procedure. *Note . Place the cylinders in a region that is not easily disturbed once you start  pipetting the area cannot be hit, bumped, etc., as it will disrupt the sediment fall velocity and mess up your results."}, {"section_title": "23.", "text": "Thoroughly rinse out the 45 micron sieve."}, {"section_title": "24.", "text": "Grab the 150 micron sieve and place the sieve in a large porcelain bowl."}, {"section_title": "25.", "text": "Fill the porcelain bowl with Dl water, just to the top of the sieve surface."}, {"section_title": "26.", "text": "Next, take the 90 micron sediment sample that was collected at the beginning of the sieving procedure pour the FECAL PELLET sample onto the 150 micron sieve. Carefully rinse the beaker with Dl water onto the sieve to make sure all sediment is removed from the container and captured for analysis."}, {"section_title": "27.", "text": "Slowly move the bowl in circular motions to begin moving the sediment across the sieve surface. 28. Occasionally (once a minute), pick up the sieve to allow sediment to readjust and move the sediment. 29. Continue steps 27 and 28 for 5 minutes."}, {"section_title": "30.", "text": "Place porcelain bowl on stir plate and out a medium size stir bar under the sieve. Place stir plate on medium-high stir speed and let sit for 5 minutes."}, {"section_title": "31.", "text": "Remove bowl from stir plate along with the stir bar. Rinse stir bar into bottom of bowl so no sediment is lost."}, {"section_title": "32.", "text": "Transfer sieved water from one bowl to new one and begin again to track the progress of how much sediment remaining is passing through the sieves."}, {"section_title": "33.", "text": "Repeat steps 27-32 until water runs clear."}, {"section_title": "34.", "text": "Once the water runs clear, use Dl water hose from a sink to CAREFULLY work all the sediment to the bottom of the sieve, then use the Dl water squirt bottle to squirt sample from the sieve into its labeled beaker (ex. Sample#_0-lcm_150um_FP)."}, {"section_title": "35.", "text": "Place the labeled beaker in the oven (103-105'C ) until water has evaporated."}, {"section_title": "36.", "text": "Thoroughly rinse out the 150 micron sieve."}, {"section_title": "37.", "text": "Finally, pour previously sieved sample (left in bowl) over the 90 micron sieve and carefully rinse the beaker with Dl water onto the sieve to make sure all sediment is removed from the container and captured for analysis."}, {"section_title": "38.", "text": "Follow the same procedure as before (steps 27-32). The water that comes through the sieve should be clear and only sediment between 150 and 90 microns should remain."}, {"section_title": "39.", "text": "Once the water runs clear, use Dl water hose from a sink to CAREFULLY work all the sediment to the bottom of the sieve, then use the Dl water squirt bottle to squirt sample from the sieve into its labeled beaker (ex. Sample#_0-lcm_90um_FP)."}, {"section_title": "40.", "text": "Place the labeled beaker in the oven (103-105'C ) until water has evaporated."}, {"section_title": "41.", "text": "Thoroughly rinse out the 90 micron sieve."}, {"section_title": "Pipette Analysis", "text": "Need Specifically: 2L graduated cylinders (2 for each sample) Mixing rod 20 mL pipette with bulb Aluminum trays (4 per each sample) 9. 10. Label and Pre-weigh aluminum dishes. There will be two dishes for each sample (two for ORGINIAL SEDIMENT sample and two for FECAL PELLET sample) a. Label trays, place in oven (103-105°C\\ for at least an hour and weigh twice (weights should be within 0.0005 g's of each other). * Reminder: do not handle aluminum trays with bare hands. Use gloves or tweezers! b. Record weights in excel sheet."}, {"section_title": "11.", "text": "Check the room temperature (right at the location of the graduated cylinders). This temperature determines the length of time between the first withdrawal and 8 phi withdrawal times. For the first withdrawal, we are capturing sediment that is less than 45 microns. 45 microns falls between 4 and 5 phi, which is considered silt."}, {"section_title": "Sediment Withdrawal", "text": "12. Withdrawal for mud is 20 mL (use pipette) at a depth of 20 cm. (mark your pipette with sharpie to make easier)."}, {"section_title": "13.", "text": "Rigorously stir sample for 20 seconds 14. Withdrawal 20 mL from the cylinder at 20 cm and place in correct aluminum tray."}, {"section_title": "Weighing Procedure", "text": "*Note: if you leave the samples out for more than 5 minutes then place them in the 103-105X in order to remove any moisture that may have been absorbed. 7. Place samples in desiccator to cool (~20 minutes) and weigh; recording the weight in spreadsheet. diverse environments in the world. Estuaries are generally defined as semi-enclosed bodies of water, having a free connection with the open sea, where salinity throughout the system is measurably diluted by freshwater from land and riverine drainage (Pritchard, 1967). While estuaries are prominent along most coastlines, they are relatively short-lived geologic features that act as dynamic transitional environments between freshwater and oceanic ecosystems. Moreover, a variety o f factors including local geology, physical dynamics, biological and chemical processes, as well as anthropogenic effects influence these systems (Nichols and Biggs, 1985). Many o f these processes make estuaries effective traps for sediment that can enter from either upstream rivers or the mouth o f the system where oceanic sediment influx can occur (Dalyrmple et al., 1992). Within estuaries, areas o f high sediment resuspension occur in the estuarine turbidity maximum (ETM) zones (Eisma, 1993;Woodruff et al., 2001). Residual water circulation and salinity fronts are thought to be the primary mechanisms for forming ETMs in partially-mixed estuaries, while tidal asymmetry is thought to be increasingly important as tidal energy increases . Classically, the ETM in partially-mixed estuaries is a region o f highsuspended sediment concentrations that results from convergence near the salt limit (Postma, 1967;Burchard et al., 2004). In addition to primary turbidity maxima, some estuaries develop a secondary turbidity maximum (STM). Generally, STMs are ephemeral features whose appearances are largely controlled by the spring-neap tidal cycle and riverine discharge, and the effects o f each on the estuarine salinity field. Both ETMs and STMs contain high amounts of mobile fme sediment that is constantly being deposited, reworked, and resuspended back into the water column. The sediment mass of the turbidity maximums is variable and dependent on hydrodynamic, seabed, and biological factors . In regions o f the ETM and STM, resuspended particulate matter collides, favoring aggregation and flocculation o f the fine-grained cohesive material Winterwerp, 2002). The increased amounts o f aggregation and flocculation enhances the settling rate o f the material and thereby deposition, favoring the formation o f ephemeral deposits that migrate along with the ETMs (Eisma, 1991;Guan et al., 2005). The geologic reconnaissance survey described in this chapter was conducted as part of the NSF Multi-Disciplinary Benthic Exchange Dynamics \"MUDBED\" project with the aim of better understanding the relationship between physical, geologic, and biologic processes with the surficial and subsurface geology. The consideration o f these interdisciplinary processes affords a broad picture o f the ecosystem that allows for a more complete understanding o f the intricacies o f this dynamic environment. This study aims to clarify processes that govern erodibility, and enhance the knowledge o f transport and dynamics of fine-grained sediments using data collected during the MUDBED project. This study incorporated interferometric swath bathymetric surveys to create a time-varying three-dimensional representation o f the Clay Bank region in the York River sub-estuary."}, {"section_title": "General Surveying Approach and Associated Equipment", "text": "All surveys conducted for this study relied on equipment and research vessel availability, as well as suitable weather conditions for surveying. Originally, the study aimed to collect highresolution bathymetry data for the Clay Bank region every month, but sampling during some months was prevented by various limitations. In total, seven months were surveyed between September, 2008 andAugust, 2009 for bathymetric analysis (Table 4- "}, {"section_title": "Correction fo r Water Level Variation", "text": "Two tidal and water level variation sources were utilized for this study. By using Hypack, a hydrographic survey software package, the vertical change in water level due to the tidal variation was calculated in real-time utilizing RTK-GPS, ideally for direct incorporation into the bathymetric processing. A secondary water level source was collected using the VECOS Clay Bank continuous monitoring station (Figure 4-2). As part of VECOS, water depth measurements were collected every fifteen minutes using YSI 6600 data sondes with the Clean Sweep Extended Deployment System and were corrected for barometric pressure in post-processing. Due to Hypack failures associated with two surveys (September and August) along with significant Hypack data gaps during two other surveys (January and February), the VECOS data exclusively were used for water level correction during bathymetric processing. But periods with good Hypack data were still utilized to access potential sources o f error by calculating the absolute differences between the VECOS and vertically shifted Hypack data, which is discussed later in the chapter. where t = T/10, with T = temperature (Celsius), and S = salinity (ppt). The variables for each survey cruise were obtained from the VECOS Clay Bank continuous monitoring station at the study site, and the mean was used as an approximation of the speed o f sound during data processing. Values ranged from 1,438 meters/second (February) to 1,523 meters/second (August) ( Table 4-2). Each o f these variables, i.e., roll, speed o f sound, and tidal variability were applied to the bathymetric soundings during processing to increase the accuracy o f the morphologic data."}, {"section_title": "Speed o f Sound Calculations", "text": ""}, {"section_title": "Post-Processing in GRID and Fledermaus", "text": "With the input o f roll calibration corrections, speed o f sound estimates, and tidal and water level variations, bathymetric soundings were processed at 1 -meter horizontal resolution and were then despiked, filtered, and smoothed in GRID, the Submetrix proprietary processing software. The data from each survey line were individually processed, filtered, and visually inspected within Fledermaus to remove any outliers, water column hits (i.e. boat wakes and fish), and bad data points. A single user conducted this estimation, in order to reduce additional subjective differences in data analysis that could be increased by multiple individuals contributing to the data processing. Although the Swath Interferometric system is capable o f collecting data from a swath o f over 1 0 to 15 times water depth, the total swath width utilized in this survey was limited to no more than 6 times water depth in order to retain cleaner data (Gostnell et al., 2006)."}, {"section_title": "Identification and Application o f Ground Control Points", "text": "To help compensate for possible user inaccuracies and uncertainties associated with the set-up and usage o f the RTK-GPS system, ground control points were identified throughout as much o f the study area as possible. Over a majority o f the study region, the seabed is relatively smooth, with the exception o f a few key locations along the edges of the main and secondary channel (Figure 4-3). For this reason, the optimal control points ended up being concentrated along rough areas within the main channel and the secondary channel regions of the study area, respectively, and not within the smoother region between these two areas. The concentration o f control points in these two separate regions favored the focusing of further analysis on these two regions specifically, with less justification for further analysis o f the section in between, which contained no control points. The main channel block is delineated by the purple dashed line toward the right side of  Figure 4-3) it was not analyzed further for monthly changes in bathymetry. A total o f twelve prominent points located on apparent mounds and/or promontories, which persisted and were assumed to remain relatively stable, were analyzed for depth comparison (Table 4-3). Five control points were located in the deep channel block (Figure 4-4), and seven control points were located in the secondary channel block (Figure 4-5). For this study, the results o f the December survey were selected to be the baseline bathymetry. After correcting for water level using the VECOS tide data, the bathymetric change since December was averaged across the twelve control points for each cruise in turn (Table 4-3). The average change in bathymetry across the control points for each cruise since December was then used to uniformly shift all o f the bathymetry each month so that there was no longer any change in mean control point depth between cruises."}, {"section_title": "Uncertainties in Location and Elevation Associated with Bathymetric Surveys", "text": "In order to calculate reliable estimations of seabed elevation o f a region, quantification o f error and uncertainties is essential for bathymetric surveys. A rigorous understanding is critical to provide the most robust insights possible into the sediment transport pathways within a system, the magnitude o f the transport, and a validation o f any sediment budget calculated in subsequent analyses. Two fundamental measurements are the cornerstone o f any bathymetric survey: the horizontal position (X-Y location) and vertical depth (underwater elevation o f measured object) (Byrnes et al., 2002). Each measurement is associated with a variety o f errors and uncertainties based on the methodology o f the study (Table 4-4) (Umbach, 1976). As mentioned previously, the RTK-GPS System and base station control setup ideally allowed for horizontal control o f ± 5 centimeters . With that level o f accuracy, any horizontal misalignment captured between bathymetric surveys could be identified if a particular feature can be recognized in multiple surveys. However, any shift in the X-Y direction requires careful interpretation, and for this study, any visual shifts in the horizontal position o f prominent features are attributed to observation error and uncertainty, rather than real change. Over steep topography, such as along the flanks o f the deep channel, errors in horizontal control may be especially problematic because a slight horizontal offset from cruise-to-cruise may translate to apparently large but erroneous cruise-to-cruise changes in water depth. Under ideal circumstances, collective uncertainties incorporating average density/spacing o f soundings, vessel movement, GPS positioning, speed o f sound, and acoustic attenuation are expected to lead to a local vertical bathymetric resolution o f approximately ± 15-20 centimeters . In our case, it was determined that human error in cruise-to-cruise control of the RTK-GPS vertical datum favored the use o f control points for establishing the absolute cruise-to-cruise vertical datum instead. In addition, failures in the Hypack recording o f timevarying vessel elevation meant that the local VECOS tide gauge was the best available choice for water level correction. Together, these substitutions suggest that the local uncertainty in bathymetry values for individual points in our case may be significantly more than ±15-20 centimeters. However, averaging o f soundings in space has the potential o f significantly reducing uncertainty in mean elevations for whole regions relative to individual soundings by averaging across local uncertainties that are randomly distributed and/or may tend to cancel each other out. Uncertainties that contribute to local elevation errors but tend to be reduced by spatial averaging include boat rocking and small uncertainties in horizontal position over gentle topography. Spatial averaging may also reduce effects of mean boat tilt if one assumes the resulting biases to each side of the vessel are o f opposite sign. After spatial averaging, for example, , found that ground truth comparisons between interferometric system measurements and more conventional physical soundings off Duck, NC differed by less than 1 cm."}, {"section_title": "Results fo r Uncertainties Based on Tide Gauge and Control Point Data", "text": "The likely magnitude o f two sources o f uncertainty can be estimated directly from data collected during the surveys: (i) the remaining water level uncertainty during a single survey after the VECOS water level correction and (ii) the remaining vertical datum uncertainty between cruises after application o f mean control point shifts. In order to assess the potential source o f error in the difference between VECOS data and actual water height at the boat, as calculated by the RTK-GPS, the VECOS vs. Hypack data consistency were tested for the dates that had partially usable Hypack data (Figure 4-6). The average absolute differences between the VECOS and vertically shifted Hypack data were examined for each available cruise and ranged from 1.2 to 3.2 centimeters. According to the VECOS operators, the absolute uncertainty in VECOS water levels at the site o f the gauge is on the order o f ± 1 cm or less (D. Parrish, pers. comm.). In order to assess the vertical accuracy o f the bathymetric datasets, the standard deviations o f the vertical shift in elevation required at the twelve control points for each month were examined in order to estimate the remaining month-to-month uncertainty in the vertical datum between cruises. The standard deviations for monthly bathymetric changes for all twelve control points (Table 4- However, it is important to note that these statistics suggest that the mean uncertainty in vertical datum for the entire survey area, if considered as a whole, is on the order ± 0 . 1 0 m. When analyzed separately, the standard deviations on the control point shifts were consistently larger in the main channel (averaging 0.23 m) than in the secondary channel (averaging 0.12 m). With a population o f five control points in the main channel subregion and seven control points in the secondary channel subregion, the 95% uncertainty values for vertical control in the main channel and secondary channel subregions become approximately ± 0.22 m and ± 0.09 m, respectively. Although the uncertainty in the mean datum from month to month is relatively low, the uncertainty in the elevation o f individual bathymetric soundings relative to that datum is somewhat higher. Assuming that the elevation o f the control points did not change from cruise to cruise, then the remaining variability observed among the best-fit shifts for these twelve points "}, {"section_title": "Overall Results by Subregion", "text": "Monthly bathymetric maps for the main channel and secondary channel blocks, corrected for estimated datum shifts (a total of fourteen maps), are presented in the appendix to this chapter. Given that the local uncertainties for observed changes between months for individual points were estimated to be relatively large (± 0.46 m in the main channel and ± 0.24 m in the secondary channel), it was helpful to reduce the uncertainties somewhat by averaging bathymetric changes across each o f the two regions. Figure 4-7 presents time-series for mean depth, averaged entirely over each region, including their uncertainty ranges. Overall results from the main channel did not provide a signal for net change that exceeded or surpassed the uncertainty bounds (Figure 4-7a). However, results from the secondary channel do show a significant change (Figure 4-7b Ah = ± 0.07 m. Finally, the net seasonal change in the secondary channel region bed elevation is then estimated to be + 0.19 ± 0.07 m."}, {"section_title": "Small Subsection Results", "text": "Particular regions o f interest within the study area were further investigated with detailed, small sub-section analyses. Two locations were chosen that included ground control points and other features that were present in all surveys. The first sub-section location was selected in the northern portion o f the study site, within the main channel. This area had prominent, stable mound features in each monthly survey. Along-channel and across-channel transects were analyzed to qualitatively assess bathymetric changes within the main channel (Figure 4-8). Based on visual analysis, the along channel transects displayed very little change o f the course o f the study, maintaining similar profiles for all seven months mapped. In contrast, the across-channel transects recorded variations in bed elevation between the mounds and the northeast flank o f the main channel. During the September, December, and January surveys the depth o f the seabed between the mounds was -9 .5 meters. As time progressed, the bathymetric transects show the surface elevation between the mounds shifting to -9.0 meters in May, June, and August. Similarly, a sub-section analysis of the secondary channel was completed. For this inquiry only an across-channel profile was evaluated. The area was chosen once again because o f prominent morphologic features that were easily identifiable in all surveys and were in the vicinity o f ground control points. Over time, the transect analysis showed changes in seabed elevation between the mound features (Figure 4-9). The transects for the surveys between September and February depict a ridge and runnel type feature with a deeper seabed between two ridges. As spring approached, the elevation difference between the ridge and trough dissipated, showing a more flattened topography and shallower seabed elevation in May and June than were previously mapped. Eventually, the August profile showed the seabed returning to a more pronounced ridge and runnel feature, similar to those mapped in the fall and winter cruises."}, {"section_title": "Relationship to Previous Studies o f Sediment Dynamics at Clay Bank", "text": "The Clay Bank region within the York River Estuary provides an excellent natural laboratory for studying a wide range of estuarine processes associated with cohesive sediment dynamics and benthic community structure, and it has been well studied over the last few decades. Wright et al., 1995;Schaffner et al., 2001;Kniskern et al. 2003;Rinehimer, 2008;Gillett and Schaffner, 2009;Cartwright, 2013). Most recently, the MUDBED program has conducted a variety o f experiments which aimed to provide a greater understanding of sediment properties and their relationship with bed erodibility and hydrodynamic variability.  (Figure 4-10). These instantaneous monthly snapshots of data from the Clay Bank region, in the main and secondary channel, provided the input data for a three-dimensional computational model, developed by Rinehimer (2008), to further investigate mechanisms driving seabed evolution. Overall, both studies concluded that deposition in association with the spring freshet resulted in higher erodibility o f the seabed during spring months at the study site, whereas a decrease in erodibility was documented in the late summer and fall following lower discharge conditions (Rinehimer, 2008;.  . With low river discharge, the STM moves further upstream. Conversely, with high discharge from the Mattaponi and Pamunkey rivers, the STM migrates further downstream potentially into the Clay Bank region . In addition to these previous studies, several acoustic sub-bottom surveys were conducted between April 2008and March 2009, three of which were collected simultaneously with the high-resolution bathymetric mapping reported here. Following the same survey lines as those tracked in this study, Rodriguez-Calderon and Kuehl   found that between April 2008 and March 2009, the thickest soft layers occurred during spring and the thinnest occurred during fall, providing more evidence o f the seasonal cycle has that been discussed by others (e.g., Rinehimer, 2008;."}, {"section_title": "River Discharge and Corresponding Regionally-Averaged Patterns o f Deposition", "text": "As the presence o f the STM at Clay Bank is generally associated with an increase in freshwater discharge from the Mattaponi and Pamunkey Rivers, USGS discharge data were examined to characterize river flow during 2008-2009 study period (Figure 4-12). The May and June cruises each occurred a few weeks after the highest pair of discharge events o f the year. Often a lag time o f a few weeks is apparent between discharge and the presence of an STM , and these bathymetric collection surveys fell within the allotted timeframe o f highly suitable conditions for the STM. Therefore, after each of the large discharge events, a new pool o f material may have moved into the region and been deposited. The data also correlate with trends in Rodriguez-Calderon and Kuehl's (2012) analysis o f variations in soft mud layer thickness in the Clay Bank region, where mud layer thickness also increased in association with discharge events. The average depth analysis presented here for the secondary channel revealed a statistically significant increase in bed elevation consistent with deposition in the May to June STM time-frame (see Figure 4-7b). This trend is once again consistent with the conceptual model of the Clay Bank region, where sediment is deposited following the wettest periods of the year versus little to no deposition or erosion during drier conditions. Unfortunately the uncertainty bounds were larger for elevation change in the main channel, and the effect of the STM could not be statistically established for the main channel region as a whole."}, {"section_title": "Distinct Seabed Changes within Sub-environments", "text": "Sediment exchange between sub-environments can affect the seabed height, as movement o f bed material between the shoal and the channels, especially during storm events and increased wave and current conditions can be significant . In the Clay Bank region,   For the main channel sub-environment, the STM has been found to play a strong role in both deposition and reworking o f the sediment in this region o f the study area, with seabed mixing depths ranging from 30-100cm historically  and sometimes up to 150cm . Generally dominated by physical processes and typically After the May and June surveys, the main channel appeared to return to an equilibrium state. These localized bathymetric changes seem to reinforce the pattern documented by previous studies. Another key sub-environment examined during this study was the secondary channel.  found that this region was typically dominated by deep physical mixing, with short-term deposition rates up to 20-50 cm in a given year. During 2008 and 2009, Rodriguez-Calderon and Kuehl (2012) specifically identified the northern portion o f the secondary channel as physically dominated, usually comprised o f thick sedimentary laminations due to the presence and migration o f the STM. However, further south, laminations were only apparent in the late fall and winter. In the bathymetric maps in the Appendix, spatially varying patterns in the secondary channel are likewise seen. For example, in December through January, a gradient of apparent deposition can be seen moving along channel to the secondary channel, where the sediment may have been deposited. The secondary channel was seen to experience changes consistent with deposition and infilling after the spring freshet (see Figure 4-9). By August, the secondary channel appeared to have been scoured once more. It is important to note that this region is quite complex, with the presence o f sedimentary furrow bedforms during neap tide conditions previously documented in the northern portion of the secondary channel, highlighting its spatial heterogeneity . Though not analyzed as part o f this study, it is important to mention the shoal region associated with an inactive oyster reef is situated between the main and secondary channels. Found to be influenced by both physical and biological processes, the seabed in this shoal sub environment follows a typical pattern of laminations in the fall and winter and bioturbation in the spring and summer (Schaffner et al., 2001;and Rodriguez-Calderon and Kuehl, 2013). This particular region o f the seabed was found by others to have sandier sediment than either the main or secondary channel as well as a higher elevation, forming a concave morphology between the two channels."}, {"section_title": "Possible Role o f storms", "text": "The highest average bed elevations recorded in this study for the secondary channel region occurred in June 2009, soon after several large storms moved through the York River estuary. For several days in June, wind gusts blew at or greater than 30 mph (> 13 m s '1) and riverine discharge reached over 2 0 0 mV1, the largest of all discharge events throughout the year long set o f surveys. This stormy period may have contributed to the significant changes in observed seabed elevation, when the secondary channel became relatively filled with sediment, possibly because o f erosion from neighboring shallows and/or transport o f sediment from the upper York. The upper York River Estuary had previously been documented as being susceptible to occasional large seabed mixing events, which can include extreme tides, extratropical storms, nor'easters, as well as flooding events ."}, {"section_title": "Historical Bathymetry", "text": "Though the seven high-resolution bathymetric surveys completed in 2008 and 2009 provided insight to the seasonal variation o f the morphology o f Clay Bank, a deeper historic understanding o f the historic nature of the system would be beneficial. Digitized echosounder data collected by the National Ocean Service in 1947 was located, which surveyed the Clay Bank and Aberdeen Creek Region o f the York River (NOS Survey H07189). The original sounding data were corrected for actual sound velocity. In order to compare modem surveys to the historic digital echosounder data, the 1947 collected bathymetry points were interpolated using a linear kriging method (Figure 4-13). Though the resolution o f the historic bathymetry is considerably coarser than the surveys completed for this study (Figure 4-14), the comparison shows that the slumps found within the main channel and used for the postage stamp analysis have been present for more than 50 years. This provides a greater confidence in our selection of ground control points in the region, providing a historic reference that the features have been persistent for decades. Unfortunately, the spacing o f the 1947 sounding was too great for a more quantitative analysis, especially with regards to the secondary channel."}]