[{"section_title": "Introduction", "text": "Today in the United States, approximately one in five children have at least one foreign born parent (Hernandez, 2004). Much of the theory and research on immigrant outcomes has focused on the economic, education or family formation experiences of adult immigrants and their school age children and adolescents in the second generation (Fuligni, 2001; Kao and Tienda, 1995;Nicholas, Stepick and Stepick, 2008;Pong and Hao, 2007;Portes and Fernández-Kelly, 2008;White and Glick, 2009). Much of the research on very young children of immigrants has been confined to studies of a single national origin group, samples of children from similar economic backgrounds or children in the same geographic location. This limits our ability to understand the role of different familial and extra-familial environments on the development of young children of immigrants (Bradley et al, 2001b;Chase-Lansdale et al., 2007). There are several dimensions of immigration and parental migration status that can lead to a divergence of developmental trajectories among children. For example, studies of immigrant adaptation in the United States often emphasize the importance of the timing of migration, language acquisition and use and other life course events for determining outcomes for immigrants (Cortes, 2006;Feliciano, 2005;Fuligni, 2001;Leventhal, Xue, and Brooks-Gunn, 2006;Myers, Gao, and Emeka, 2009). These factors form the familial migration context in which U.S.-born children in immigrant families are raised. Research on child development and immigrant adaptation also recognizes the importance of the receiving context in shaping outcomes (Georgiades, Boyle, and Duku, 2007). Thus, analyses of the outcomes for young children of immigrants should rest on a conceptual framework that incorporates the familial migration context and the environments in which immigrants' children are raised. It is only recently that national-level data has included sufficient samples of young children of immigrants and researchers are able to turn their attention to this important life stage (Androff et al., 2011;Cabrera et al., 2006;Glick, Bates and Yabiku, 2009;Thomas, 2011). Such longitudinal large scale data makes it possible to elaborate how familial and community environments surrounding these young children influence their cognitive development. This study asks whether contextual features of communities moderate the relationship between familial migration context and subsequent developmental outcomes. In particular, we focus on the cognitive development of very young children of immigrant mothers and their peers with U.S.-born mothers."}, {"section_title": "Background", "text": "There is great diversity among immigrant families in the United States. Immigrants come to the United States from diverse origins. They migrate for different reasons and arrive in the receiving context with different levels of education and other resources (Alba et al., 2002;Feliciano, 2005). Children of immigrants have both advantages and disadvantages stemming from these very different familial environments. For example, the educational trajectories of some immigrants' children are enhanced by their parents' expectations and motivation for academic success (Glick and White, 2004;Kao and Tienda, 1995;Leventhal, Xue, and Brooks-Gunn, 2006). The educational trajectories of others are hampered by parental language barriers, low education, or unauthorized immigration statuses that reduce children's opportunities for success (Bean et al., 2011;Suarez-Orozco and Suarez-Orozco, 1995;Turney and Kao, 2009). To understand the outcomes for immigrants' children it is important to consider these potential protective and risk factors at the family level. Families are not isolated entities. Surrounding communities and neighborhoods contain resources that help set the stage for well-being in even early childhood (Chase-Lansdale et al., 1997). Immigrant parents are often parenting in a context different from that in which they were raised while simultaneously learning to navigate a new social environment (Quintana et al., 2006). Although many scholars and policy makers emphasize the growing population of children with immigrant parents and their contribution to the increasing diversity of the broader society, we have less of an understanding of how the receiving context in the United States influences outcomes among very young children before they encounter formal social institutions like schools. Theories of immigrant adaptation acknowledge the possibility for differential outcomes among immigrants and their descendents will come, at least in part, from the different resources available in the receiving context (Alba and Nee, 2003;Portes and Rumbaut, 2001). Some community characteristics such as high levels of poverty may present a risk factor for all children's health and development. But the same communities may have other protective features such as a high prevalence of co-ethnic residents that may provide support to immigrant families (Frank, Cerdá and Rendón, 2007;Zhou and Kim, 2006). Our analyses consider the potential for divergent outcomes among very young children in immigrant families depending on their familial and extra-familial environments with a particular focus on the linguistic environments of the home and the surrounding community."}, {"section_title": "Family Nativity and Linguistic Isolation", "text": "The language environment in the home is associated with differences in early development (Alba et al., 2002;Cobo-Lewis et al., 2002). Of course, not all immigrant families in the United States are typified by the presence of a non-English language in the home and the impact of the language environment, whether monolingual or bilingual, is likely to vary depending on children's developmental stage. Home language environment is important for early cognitive development (Cobo-Lewis et al., 2002). Children who have limited English proficiency upon the entrance to formal schooling may be slower to acquire academic skills than their peers who speak English well at the beginning of formal schooling (Kieffer, 2008). However, retaining a native language can have positive effects on children's educational attainment later and the presence of both English and non-English languages in the home may be an educational advantage as children move through school (Carlson and Meltzoff, 2008;Lesaux and Siegel, 2003;Mouw and Xie, 1999;Portes and Rumbaut, 2001). So children who come from non-English homes but are proficient in English upon entering school perform as well on reading acquisition over time as their peers from English only backgrounds (Kieffer, 2008). However, there may be significant disadvantages for children who reside in a home in which no adults speak English well. These homes, termed 'linguistically isolated households', are defined in Census data as those in which no one over age 14 in the home speaks English 'well' or 'very well'. Although the majority of homes in which a non-English language is spoken include at least one person who speaks English well (Hernandez, 2004), a substantial minority of immigrant children live in homes in which no one speaks English well. Limited English proficiency may reduce parents' competitiveness in the US labor market and lead to lower family resources and location in poorer communities. Limited English proficiency and limited access to English speakers in the home may serve as a barrier to parental actions that enhance positive cognitive and academic outcomes or accessing health care (Flores, Arbeu & Tomany-Korman, 2005;Leiyu, S., Lebrun, L.A. & Tsai, 2009;Wong and Hughes, 2006). Here we consider the role of home linguistic isolation as an important factor associated with children's cognitive development. Of course, it is important to consider other aspects of the familial environment that are associated with both linguistic isolation and child outcomes. Many immigrant families with children in the United States are typified by lower levels of income and resources (Crosnoe, 2007;Hernandez and Charney, 1998;Mistry et al., 2008;Thomas, 2009). The poverty rate among young children of immigrants (age 0-8) was 22% in 2007-08 compared to 17% among children of U.S.-born parents (Fortuny, Hernandez and Chaudry, 2010). Parental education is also quite variable among the immigrant population. While some groups are typified by lower levels of education other immigrant groups arrive with levels of education higher than the United States' average (Everett et al., 2011;Feliciano, 2005;Wojtkiewicz and Donato, 1995). These associated characteristics are themselves risk factors for poor child health, school readiness and academic achievement (Bradley et al., 2001b;Duncan and Brooks-Gunn, 2000;Glick and Hohmann-Marriott, 2007;Kieffer, 2008). Many immigrant families are also typified by characteristics associated with positive outcomes such as high levels of parental involvement and encouragement for academic goals (Goyette and Xie, 1999;Hao and Bonstead-Burns, 1998;Hirschman et al. 2004). Parenting practices, associated with early cognitive development and language development, may also vary by parental nativity and home language background (Cabrera et al., 2006;Glick, Bates and Yabiku, 2009;Raikes et al., 2007). Stimulating parenting practices in the home (i.e., reading aloud, providing toys, etc.) is positively associated with cognitive gains across socioeconomic and racial/ethnic groups (Kolobe, 2004;Raikes et al., 2006;Raviv et al., 2004;Tomopoulos et al., 2006). These practices are also positively associated with cognitive and linguistic development children from both English and Spanish home environments (Raikes et al., 2007). Positive parenting practices help mediate the relationship between parental migration timing and children's externalizing problems (Georgiades, Boyle and Duku, 2007) and cognitive development. The analyses here will also focus on linguistic isolation in the home net of these familial-level risk and protective factors."}, {"section_title": "Community Linguistic Isolation", "text": "Children's educational development is influenced by the resources and social capital embedded in their communities as well as in their families (Georgiades, Boyle and Duku, 2007;Pong and Hao, 2007;Rosenbaum and Rochford, 2008). Distribution into neighborhoods is not random (see Harding, 2003) but if community contexts are systematically different for some immigrant families via racial/ethnic or linguistic segregation, this could help partially explain differential outcomes among children from immigrant and minority backgrounds when compared to their U.S.-born non-Hispanic white peers (Entwisle and Alexander, 1993;Farkas, 1996;Pong and Hao, 2007). For children in immigrant families, community context may reflect the opportunities and resources available as immigrant parents adapt to life in the United States (Alba and Nee, 2003;Fernandez-Kelly and Schauffler, 1994;Zhou and Xiong, 2005). Children of immigrant families from lower socioeconomic status may face a disadvantage if they become segregated in poorer neighborhoods with fewer resources (Frank et al., 2007;Turney and Kao, 2009). Low income and poor resourced communities may make it difficult for young children in immigrant families to acquire the skills necessary for school readiness and subsequent academic success (Chase-Lansdale, et al., 1997;Consentino de Cohen et al., 2005;Farkas, 1996;Georgiades, Boyle and Duku, 2007;Kao and Rutherford, 2007;Pong and Hao, 2007;Ryabov and Van Hook, 2007;Sastry and Pebley, 2010;Schwartz and Stiefel, 2004;Vaden-Kiernan et al., 2010). Yet research on neighborhood effects and outcomes for immigrants and their children yields mixed results (Jackson and Mare, 2007;Urquia et al., 2009). Living near other immigrants in the same community may be protective despite the apparent disadvantages in these communities such as high levels or poverty (Burr and Mutchler, 2003;Frank, Cerdá and Rendón, M., 2007). For example, immigrant or co-ethnic enclaves may be important sources of social capital that enhance economic mobility among adults (Gronqvist, 2006;Portes, 1996;Zhou, 2004). Other research finds that the physical health of immigrants is better when they reside near other immigrants (Cagney et al., 2007;Finch et al., 2007;Frank et al., 2007;Osypuk et al., 2010;Vega et al., 2011). But other neighborhood characteristics such as racial/ethnic residential segregation and poverty are detrimental to health for residents regardless of nativity (Frank et al., 2007;Jackson and Mare, 2007;Schulz, et al., 2008;Ornelas et al. 2011). The question then is not only which community characteristics result in better or worse outcomes but whether such characteristics may afford some protection for children in immigrant families with less benefits accruing to children in non-immigrant families. For example, Kieffer (2008) examined the learning trajectories of children from non-English backgrounds (those designated as Limited English Proficient and those without this designation) and children from English only homes. Children who were not English proficient at Kindergarten had substantially lower learning trajectories compared to the other two groups compared. But, the results also indicated that the learning gap between children in schools with high concentrations of poverty versus those in schools with lower concentrated poverty was considerably smaller for the children from non-English backgrounds than those from native English speaking backgrounds (Kieffer, 2008). Similarly, Pong and Hao (2007) report differential results by context. School and neighborhood socioeconomic status, presence of adults with limited English proficiency and school social climate are all associated with differential achievement among immigrant and U.S.-born youth (Pong and Hao, 2007). Another study focusing on the association of neighborhood characteristics and depression among Latinos finds cross-level interactions such that community level linguistic isolation is associated with lower reports of depression among some immigrants (Vega et al., 2011). These studies all suggest a need to consider the role of the community context but the mixed results also suggest a need to look for interactions of family characteristics and the community context in which children of immigrants and their peers reside."}, {"section_title": "The Present Study", "text": "The extant research provides mixed support for the importance of community characteristics for immigrant youth and adults' health and economic mobility. And, few studies have hypothesized the role of community context on the second generation from early childhood before children have entered formal schooling and encountered US social institutions outside of their immediate familial context. Although there is evidence that family and community characteristics interact to enhance child well-being, we need to examine how these mechanisms might vary by immigration context. Some mechanisms that are highly effective for predicting positive child outcomes among the native-born population may yield few benefits for immigrants and it seems likely that family characteristics and community context interact to impact child outcomes. Here we consider the importance of the linguistic environment specifically. Very young children, who are more directly influenced by their parents' experiences than their own encounters in the community, could be advantaged by living in immigrant communities or enclaves where their parents' language use and practices are supported. For immigrant parents, language use may facilitate access to these institutional resources and relationship ties outside of the immigrant community (Garcia Coll et al., 2002. Similarly, Turney andKao (2009) suggested that linguistic assimilation may help families to access social support in US communities. Thus, linguistic isolation may be a risk factor for children's outcomes. But, familial linguistic isolation could have fewer detrimental effects if families reside in areas with other immigrants and others using the same non-English language. Any 'protective' effect associated with living near others who speak the same native language is likely to be most readily apparent among those who can benefit the most from this communication and related support-families without English speakers in residence. This paper examines the early cognitive development of young children of immigrants from a birth cohort in the United States. Previous analyses confirm significant variation in cognitive scores at 24 months among children of U.S.-born mothers and children of immigrant mothers (Glick, Bates and Yabiku, 2009). But immigrant mothers also differ in their use and comfort with English. Here we hypothesize that linguistic isolation in the home will also be important for predicting children's early cognitive development. To this end, we analyze children's cognitive development with a measure combining mother's nativity and linguistic isolation of the household: Hypothesis 1: Children of immigrant mothers in homes that are identified as linguistically isolated will have lower levels of cognitive development measured at approximately 24 months of age when compared to children of immigrant mothers in homes that are not linguistically isolated and children of U.S.-born mothers. We then address whether the observed relationships between mother's nativity an d linguistic isolation in the home and children's cognitive scores are mediated by the community context in which these families reside. Community characteristics, such as high poverty rates, are expected to be associated with poorer cognitive development regardless of Soc Sci Res. Author manuscript; available in PMC 2014 January 01. $watermark-text $watermark-text $watermark-text parental nativity but children of immigrants are more likely to be exposed to these riskier environments. Hypothesis 2: Lower cognitive development scores among children of immigrant mothers will be partially explained by their higher exposure to community level poverty and linguistic isolation when compared to children of U.S. born mothers. Finally, the association between family language background and cognitive scores at 24 months may depend, in part, on the level of linguistic isolation in the larger community. Children in linguistically isolated homes may have more positive outcomes when living in areas with more non-English speakers because their families may be less socially isolated than if they lived in other areas. Hypothesis 3: Children of immigrant mothers will evidence higher cognitive scores when living in communities with greater concentration of linguistic isolation. This interaction is expected to be most in evidence among children of immigrant mothers who also live in linguistically isolated households."}, {"section_title": "Method Data", "text": "The Early Childhood Longitudinal Study-Birth Cohort (ECLS-B) is a large, nationally representative sample with approximately 14,000 children born in the United States in calendar year 2001, and makes a special effort to include underrepresented groups (NCES, 2005) 1 . This provides a diverse sample with sufficient numbers of children with at least one foreign born parent. The survey interviews caregivers on a variety of topics including children's development, family environment, health and healthcare, childcare, and early education programs. In addition, ECLS-B includes direct observations of children's physical, cognitive, social, and emotional development (NCES, 2005). Our analyses rely on the first two waves of the data; the first wave is collected when children are approximately 9 months old and the second wave occurs when the children are approximately 24 months of age. The ECLS-B made efforts to oversample for twins. To maintain independence of observations, we randomly drop one twin per twin pair from the analysis. We also eliminated cases that were not followed up into the second wave of the data. Our final analytic sample is approximately 7,900 children. Our primary measures of mother's migration, language use and family resources as well as the outcome measure of cognitive development all come from the ECLS-B. Our measures of the child's neighborhood context come from the 2000 U.S. Census. Studies of community level effects on child outcomes have used a variety of measures to typify the child's 'neighborhood'. Analyses of school age children of immigrants suggest different outcomes depending on the characteristics and composition of the schools they encounter (Cosentino de Cohen et al., 2005;Portes and Hao, 2004). For very young children, school context is irrelevant. Census tracts are most often used to proxy the 'neighborhoods' of young children in the United States (Frank et al., 2007;Leventhal, Xue and Brooks-Gunn, 2006;Pong and Hao, 2007;Vaden-Kiernan et al., 2010). Measuring 'neighborhood' socioeconomic status and concentration of foreign born this way has been associated with the social behaviors and educational outcomes of adolescent youth (Frank et al., 2007;Tong, 2010). But, census tracts may be too small to reflect the actual spatial effects on children's outcomes (Crowder and South, 2011). In this paper, we characterize the contextual environment in which the family is located using zip code level data as measured in the 2000 U.S. Census and linked to data on individual children and families. In some cases, zip 1 Due to requirements for using the restricted ECLS-B data all sample sizes are rounded to the nearest 50 cases. codes will typify well the community in which the family lives, works and plays. In other cases, the zip code will represent an area much larger than what is often conceptualized as a 'neighborhood'. For our analyses, we are limited to identifying the community context based on the zip-code of residence for the children in the ECLS-B cohort at 9 months. These data are used to provide proxy measures of the 'community context' for the families. There are some limitations with this approach. First, zip code boundaries vary in size and population density. While some may well approximate neighborhood contexts, others will represent larger areas that go beyond the child's immediate social and physical environment. To somewhat ameliorate these limitations, we include a variable indicating whether the family is living in an urban, suburban or rural area available in the ECLS-B. Second, zip code boundaries change over time, particularly in areas of rapid population growth. This means that a minority of children in the ECLS-B resided in zip codes that did not exist in the 2000 Census. To address this limitation, we accessed zip code geographic coordinates for 2001 and 2000. When a child in ECLS-B resides in a zip code in 2001 that did not exist in 2000, and therefore was not listed in the Census, we assign the zip code characteristics of the 2000 zip code from which the 2001 zip code was created. In other cases, we were able to see which 2000 zip codes served as the derivative of the 2001zip codes, through the use of spatial zip codes maps. There were also circumstances in which the zip code provided did not point to a valid zip code based on the State code provided in the ECLS-B. In these circumstances we first reviewed the information regarding the State in which the interview occurred. If the zip code did not match the state, we checked to see if the digits in the State code were inverted in the data and then assigned the correct zip code based on the corrected State code (fewer than 50 cases). We then conducted preliminary analyses with and without the 'mismatched' cases. These results reveal no significant differences in our substantive conclusions and we include all of these cases in the analyses presented here. However, there were a handful of remaining cases (fewer than 10) in which we could not correct the zip code and those cases were eliminated."}, {"section_title": "Variables", "text": "The primary dependent variable for the analyses reflects children's cognitive development. We might expect some children to be hampered or slowed in their own English acquisition by living in a linguistically isolated household but this may not hold for other aspects of their development. Therefore, we have chosen a measure that captures overall cognitive development. This was measured with the shortened form of the Bayley Scales of Infant Development, Second Edition (BSID-II). The BSID-II has been used in a wide variety of settings and has been found to be valid across subgroups (Niccols and Latchman, 2002). The shortened form (BSF-R) was developed for use in the ECLS-B and measures children's cognitive development including memory, exploratory competence, object permanence and communication (Andreassen and Fletcher, 2007;Glick, Bates and Yabiku, 2009;NCES, 2005). The items were adjusted according to expected age developmental patterns so that different items were used for infants versus those at older ages. We use the standardized BSF-R score at wave 2, when children are approximately 24 months old, as the dependent variable. We recognize that there may be some differences in the extent to which these scores are predictive of children's long term development across cultural groups (Vierhaus et al., 2011). Our primary predictor variables come from the second wave of the ECLS-B when the mother reports their country of birth and other migration related information. We also have information about the linguistic environment in the home. We are interested in those households in which children are primarily exposed to a non-English language and those in which adults are limited in their comfort communicating in English. Unfortunately, the ECLS-B does not identify the English proficiency of all household members. To approximate the definition of a linguistically isolated household with the ECLS-B, we combine several items. For our purposes, a child will be identified as residing in a linguistically isolated household if all of these conditions are true: the mother reported that she does not speak English well or very-well, the mother reported that the primary language spoken in the home is a non-English language and the mother reported that English is not spoken in the home. All three of these conditions must be present to be identified as living in a linguistically isolated household 2 . Household linguistic isolation and mother's nativity are highly correlated (Stevens, 1999). Almost no U.S.-born mothers resided in homes we identified as 'linguistically isolated. Therefore, we created a variable that combines nativity and linguistic isolation into one. This variable has three categories: Mother is foreign born/ linguistically isolated household, Mother is foreign born/ not linguistically isolated and Mother is U.S.-born 3 . Other variables representing mother and family characteristics are included based on previous research on children's cognitive development and school readiness. These include measures that reflect the socioeconomic status and human capital available in the home as well as parenting measures shown to be associated with young children's development and variable across immigrant groups (Bradley et al., 2001b;Chase-Lansdale, et al., 1997;Duncan and Brooks-Gunn, 2000;Glick & Hohmann-Marriott, 2007). Mother's education is a categorical measure and those who have less than a high school education serve as the reference group. Previous analyses reveal no significant difference in the cognitive scores for children whose mothers have some college, college degrees, or education beyond a bachelor de gree so these groups are combined (Glick, Bates and Yabiku, 2009). We also include a single dummy variable indicating whether the child is living with two parents or in some other family form. Mother's race and ethnic origins are categorized based on the mother's self identification with racial and panethnic categories (i.e. other Hispanic, other Asian and Black) except in those cases in which the data are sufficient to identify specific ethnic groups (Mexican origin and Chinese origin). Non-Hispanic White serves as the reference group for all of these racial, ethnic and panethnic groupings. Mother's age is included as a continuous variable. The parenting practices in the home are measured with several items from the HOME short form. The self-reported items identify the frequency of family involvement with the child in four activities including reading, telling stories, singing songs and going on errands. Other control variables in the models identify child characteristics that may be predisposing to cognitive development. These include the child's gender (male as reference group), age at the wave 2 assessment (continuous measure in months), and birth weight (less than 1,500 grams, 1,500-2,500 grams and the reference for above 2,500 grams). We also include variables that identify the household location in three categories available in the ECLS-B data. These include homes that are located in central city locations in large urban areas, homes located in urban areas that are not considered to be center city and homes located in non-urban or rural settings. These control variables are important because our other measures of context are based on the zip code in which the household is located. Yet households may share zip code but be found in slightly different levels of urbanicity. Our other mmeasures reflecting the community context come from the 2000 US Census data and indicate the socioeconomic and demographic makeup of the zip code in which the children resided at the first wave of the ECLS-B. Continuous measures describing the zip code are mean centered. To estimate the potentially protective effect of living in a community where others are linguistically isolated, the analyses include the proportion of households considered to be 'linguistically isolated'. According to the definition used in the Census, a household is considered to be linguistically isolated if no household member age 14 or older reports speaking English 'very well'. Approximately 4% of US households were considered \"linguistically isolated\" in 2000 (Siegel, Martin and Bruno, 2001). However, this varies considerably by community. In our sample, the percent of households lingu istically isolated in the zip code ranges from 0% up to 65%. We considered several different ways to measure community isolation in addition to retaining the continuous measure (Vega et al., 2011). For example, we compared children living in zip codes in which 10% or more of all households are linguistically isolated to those with fewer isolated households (<10% households linguistically isolated). Our conclusions about the association between community level linguistic isolation and children's cognitive test scores remain the same regardless of which measure is adopted. We also include a continuous measure of the level of poverty in the zip code."}, {"section_title": "Method of analysis", "text": "The analyses rely on data from the child/family level as well as at the zip code level. Some of the children are found within the same zip codes. There are over 3,650 unique zip codes for the approximately 7,900 children in our ECLS-B sample. The dependent variable is a continuous standardized measure (mean = 0; sd = 1) of cognitive development. Given these data features, we conducted multilevel regression models using STATA XTMIXED with maximum likelihood estimators and individual weights. We rely on a two level model with level-one predictors at the child/family level and level-two predictors measured at the zip code level. We also use a cross-level interaction to estimate differential associations of the level of linguistic isolation in the zip code and children's cognitive scores according to the nativity/linguistic isolation of their households 4 . The national level data from the ECLS-B also includes a stratified sampling structure and analyses with the data are best conducted with adjustments for the stratified and complex sample design (Andreassen and Fletcher, 2007). We ran similar analyses with the adjustments for the initial sampling structure (SVY REGRESS in STATA) but without adjusting for the multilevel structure of the data. The substantive conclusions remain the same regardless of which approach we adopt (see Kieffer, 2008 for a similar strategy with the ECLS-K dataset). We present the results of the multilevel analyses here."}, {"section_title": "Results", "text": ""}, {"section_title": "Descriptive Results", "text": "There is indeed considerable variation in the standardized cognitive (BSF-R) scores by mother's nativity and household linguistic isolation. Figure 1 illustrates that the lowest scores are observed among children whose mothers are foreign born and who live in households we identify as linguistically isolated. The scores are somewhat higher among children of foreign born mothers in non-linguistically isolated households with highest scores observed for children of U.S.-born mothers. There is also considerable variation in scores by the linguistic isolation of the community. A simple model with zip code linguistic isolation as the only predictor of cognitive scores confirms the negative association (coefficient = -1.6; p<.001). The divergence of scores is also apparent when we consider those who live in the zip codes with more than 10% of households in linguistic isolation. For these children, the mean cognitive score is -.172. The average score for those living in zip codes with fewer than 10% of households linguistically isolated is .217. Table 1 describes the characteristics (weighted) of the ECLS-B sample for the rest of the variables in the multivariate analyses. These are presented for the entire sample and then separately by the three nativity groups: Children of U.S.-born mothers, children of foreign born mothers in non-linguistically isolated households and children of foreign born mothers in linguistically isolated households. The majority of the children have a mother born in the United States but there are sufficient numbers of cases to disaggregate the foreign born by the linguistic isolation of the household (based on our own proxy). There is also considerable racial and ethnic variation in the sample. U.S.-born mothers are mostly non-Hispanic White with a smaller proportion who are Black or of Mexican origin. Foreign born mothers, on the other hand are mostly non-White. Of the foreign born mothers in non-linguistically isolated households, 36.4% are Mexican origin with another 20% of other Hispanic origins and mothers of Asian origin representing another 17% when all groups are combined. By contrast, a large majority of foreign born mothers in linguistically isolated households are of Mexican origin with fewer of other Hispanic origins or from Asian origins. There is also considerable variation in the educational backgrounds of the mothers in the sample. The majority of mothers have graduated from high school but fewer have completed college. Foreign born mothers in linguistically isolated households have by far the lowest levels of education with over half who have not completed high school. These mothers are also slightly younger on average than the U.S.-born mothers or the foreign born mothers in non-linguistically isolated households. The majority of children live with two parents although there is some variation here such that children of U.S.-born mothers are less likely to live with two parents than their counterparts with foreign born mothers. There is also small variation in the type of community in which these families are located so that children of U.S.-born mothers are more likely to live in urban centers or rural areas than are the children of foreign born mothers. Although there is some modest variation in mother and family characteristics, children's own characteristics also do not vary considerably by their mother's nativity or the linguistic isolation of the household. Children of immigrants encounter different contexts in the United States than their counterparts whose mothers are U.S.-born. Table 2 compares the community characteristics according to mother's nativity and household linguistic isolation. Children of U.S.-born mothers live in communities with lower levels of poverty and fewer non-White neighbors. Children of foreign born mothers in non-linguistically isolated households fall in the middle as children of foreign born mothers in linguistically isolated households are far more likely to live in zip codes with higher proportion of minority neighbors, households in poverty and other linguistically isolated households. We also note that children living in linguistically isolated households are particularly disadvantaged in terms of their neighborhood context; they live with the largest percentage of households living below the poverty line (17%). Separately, we compared the neighborhood characteristics by ethnicity. Children of immigrants are more likely to live in areas with more immigrants and more linguistically isolated households than those with U.S.-born mothers but this varies by ethnicity. Children with mothers of Mexican or Hispanic origin are the most likely to live in neighborhoods with more linguistically isolated neighbors, followed by mothers of Chinese or Other Asian backgrounds. We also note that children of Asian and Latino mothers are more likely to live in communities where more than 10% of all households are linguistically isolated. This comparison by ethnic group within mother's nativity can be found in Appendix Table A. Although the likelihood of living around other linguistically isolated neighbors (i.e. where at least 10% of households in the zip code are linguistically isolated) is lower among the U.S.born among all racial/ethnic groups, children of Mexican origin mothers are particularly likely to live in these types of zip codes regardless of their mother's nativity. Over 40% of children with U.S.-born Mexican origin mothers live in zip codes where 10% or more of their neighbors are identified as linguistically isolated. We employ multilevel multivariate models to predict children's cognitive development scores at wave 2 based on mother's nativity/linguistic isolation, community characteristics and family and child control variables. Table 3 displays the multivariate models in stepwise fashion. Model 1 confirms that children with non-U.S.-born mothers have lower scores than their peers with U.S.-born mothers. The results also show that the lowest scores occur among children whose mothers are foreign born and living in a linguistically isolated household. The difference between these two groups of children of foreign born mothers is statistically significant (p<.01). Model 2 adds mothers' race/ethnicity. Children with Black, Mexican and other Hispanic mothers have lower cognitive scores than non-Hispanic whites while children of Chinese origin mothers tend to outscore their peers. These results are consistent with previous research and suggest persistent racial and ethnic disparities that extend beyond maternal nativity (Glick, Bates & Yabiku, 2009). However, even adjusting for mother's racial and ethnic origins, children of foreign born mothers have scores that are lower than their peers with U.S. born mothers. And, as with model 1, there is a statistically significant difference between children with foreign born mothers in linguistically isolated households and children with foreign born mothers in non-linguistically isolated households. Model 3 includes the remaining child and family variables. There are several things to note in this model. First, the socioeconomic status of the family is an important predictor of children's cognitive scores. Children in families living near or below poverty have lower scores than those in homes with more economic resources. Mothers with lower education have children with lower scores than those with higher education. But beyond resources, mother's parenting is also associated with children's cognitive scores. More responsive parenting is associated with higher scores. Child characteristics are also associated with scores. As demonstrated in previous research, low birth weight is associated with lower cognitive scores at approximately age 24 months. Girls also evidence higher scores than boys. Even net of these family and child characteristics, the results for mother's nativity and household linguistic isolation are persistent in model 2such that children of foreign born mothers have lower scores than children of U.S. born mothers providing partial support for our first hypothesis. However, the difference between children with foreign born mothers in linguistically isolated households and children with foreign born mothers in nonlinguistically isolated households is no longer statistically significant. In separate models not presented here, we identify family poverty as the key measure that helps explain much of the gap between these two groups. Children in the linguistically isolated households are more likely to be living in households near or below poverty. This helps account for the lower scores among these children relative to children in non-linguistically isolated households. Including poverty in the model also reduces, but does not eliminate, racial and ethnic variation in children's scores. Models 4 and 5 are designed to test our second hypothesis that exposure to community level poverty and linguistic isolation will partially mediate differences in the cognitive scores among children of U.S born mothers and children of immigrant mothers. Model 4 includes the proportion of linguistically isolated households in the zip code. Living in a zip code with a higher proportion of linguistically isolated households is modestly associated (p<.10) with lower cognitive scores. In model 5 we include the measure for poverty at the zip code level. With community level poverty in the model (p<.10), there is no longer a main effect associated with linguistic isolation in the zip code. However, we should also note that community level linguistic isolation and community level poverty are also somewhat correlated (r = .38 for the entire sample) making it less likely that each will be independently predictive of cognitive scores. Thus, we find only modest evidence of community level effects on cognitive scores and no evidence of a significant mediating effect for children's mother's nativity and household linguistic isolation as suggested by the second hypothesis. The results to this point suggest some disadvantage in terms of observed cognitive scores among children living in linguistically isolated households even with controls for family level characteristics and community context. But our third hypothesis, based on the potential protective effect of immigrant communities, anticipates interactions between nativity/ linguistic isolation at the household level and linguistic isolation in the community. Therefore, we add interactions for this household level measure of nativity and linguistic isolation with the linguistic isolation of the zip code in Model 6. The interactions for maternal nativity/household linguistic isolation and linguistic isolation in the community are consistent with the protective effect hypothesized above. In other words, children of immigrant mothers living in households that are linguistically isolated are less disadvantaged in linguistically isolated communities than their peers with U.S.-born mothers. We also examined the possibility that a similar interaction would be observed between mother's nativity/household linguistic isolation and the proportion of households in the zip code living below poverty. These interactions operate in a very similar manner as those observed for community level linguistic isolation but do not reach the same level of significance. Overall, the interactions lend some support for our third hypothesis although we continue to find greater variation associated with mother's nativity than household linguistic isolation. To ease the interpretation of the full model with the interaction terms, Figure 2 presents predicted cognitive scores for the three nativity groups living in zip codes with varying levels of linguistic isolation calculated from Model 6 in Table 3. In general, the predicted scores for children with U.S.-born mothers are higher than those for children of foreign born mothers. However, scores tend to decline as the percent of linguistically isolated households in the zip code increases for children of U.S. born mothers. This is not the case among children of foreign born mothers for whom scores vary little as the percent of linguistically isolated households in the zip code increases. In other words the nativity differential in scores is greatly reduced in communities with higher levels of linguistic isolation overall but this is largely due to the deficit experienced among children of U.S. born mothers rather than a significant difference in scores for children of foreign born mothers."}, {"section_title": "Discussion", "text": "Children of immigrants come from very diverse backgrounds. While many live in monolingual and bilingual English dominant homes, others live in households where there are no adults who are fluent in English. Previous research suggests advantages for children raised in rich linguistic environments. But for very young children, living in a household with lower facility with English may also limit access to resources and social support for parents. In this case, we expected children's cognitive development might lag behind those of their peers in non-linguistically isolated environments. The results presented here indicate that children of foreign-born mothers who lived in linguistically isolated households have the lowest cognitive scores than any other group supporting the first hypothesis. The multivariate models suggest some of the variation in scores among children of foreign born mothers is accounted for by household level poverty. Once we adjust for poverty, there is no longer a significant difference between children with foreign born mothers who live in linguistically isolated households and those who do not. The difference in scores between children with foreign born mothers and children with U.S. born mothers persists, however, even in multivariate models adjusting for family and child characteristics. Just as immigrant parents arrive at different points in their own life course with different linguistic backgrounds and educations, children of immigrants are raised in very diverse households and diverse community contexts in the United States. In other words, children of immigrants are not randomly distributed throughout the United States. Children living in linguistically isolated homes are particularly at risk of living in communities with a greater concentration of poverty and other linguistically isolated households. Therefore, we tested the hypothesis that that not all community contexts would be equally disadvantageous across all groups. The results suggested that the negative association of household linguistic isolation is somewhat ameliorated for children of immigrants living in communities with considerable linguistic isolation. The interaction terms reflect the smaller 'risk' associated with neighborhood linguistic isolation among all children of immigrants when compared to their peers with U.S.-born mothers in the same neighborhoods. This finding is consistent with the hypothesis that some community characteristics offer protection or at least partially ameliorate the effects of other negative community characteristics for some children of immigrants although we did not find much difference associated with household linguistic isolation per se. The results of the analyses also point to the persistent and large differences in early cognitive development in children across racial/ethnic groups. These differences cannot be 'explained away' by mother's nativity, education or poverty. Children of mothers from historically disadvantaged groups in the United States evidence lower cognitive scores than their peers with non-Hispanic white parents. Children of Black, Mexican and other Hispanic mothers have lower cognitive scores than children of non-Hispanic white mothers in a pattern that is consistent with research on school age children as well. The exception to the disadvantage relative to non-Hispanic whites occurs among children of Chinese origin mothers. These children's cognitive scores tend to be higher than those among non-Hispanic whites even when we control for family and child characteristics. However, we find that conclusions about children of the Chinese origin immigrant mothers in the ECLS-B should be made carefully. This group may not be as representative of Chinese origin immigrants in the United States overall. This is a tentative conclusion drawn from our observation that these families in the ECLS-B tend to be overrepresented in more affluent areas. Nearly sixty-six percent of the zip codes in the ECLS-B that contain Chinese mothers have median household incomes that are above the overall median household income for Chinese origin households. For example, according to the 2000 U.S. Census data, the median household income for all Chinese-origin households in the U.S. in 1999 was $51,444 (U.S. Census Bureau 2000). However, in the ECLS-B data, the median household income for all of the zip codes in which Chinese mothers reside is approximately $60,257, nearly $10,000 higher than the national median for Chinese households. Thus, some caution may be warranted when interpreting ethnic group-level differences. In related limitation, there are relatively few immigrants in the ECLS-B data representing some individual national origins. This means we cannot separately analyze groups from individual countries of origin except for those from China and Mexico. A second limitation stems from relying solely on zip-code characteristics to represent children's community context. These are highly variable and may accurately reflect the local resources or constraints for some but likely not all families. We are also restricted to identifying children's community context at one point in time when they were approximately 9 months of age. Previous research suggests there is a fair amount of temporal consistency in neighborhood characteristics for many youth which would justify single point measures (see Crowder and South, 2011 for example). But it seems likely that foreign born families may be more mobile than their native-born counterparts particularly among some minority groups. In this case, we will miss upward mobility on the part of some families and downward economic mobility of others. Segregation of immigrant groups may reinforce the maintenance of native languages and create more linguistic isolation (Stevens 1992). Immigrants who are more upwardly mobile may also be more likely to acquire English and move out of linguistically isolated communities. Our analyses contribute to the research on the contextual effects on children's well-being. The results suggest that exposure to concentrated poverty, for example, is negatively associated with early development. The impact of living in a linguistically isolated zip-code is reduced when models adjust for the concentration of poverty in the same zip-code suggesting that poverty is an important risk factor for child development overall. This finding, combined with previous research, suggests that children living in areas of concentrated poverty may face a cumulative disadvantage as they grow, enter school and become adolescents (Timberlake, 2007;Crowder and South, 2011;Jackson and Mare, 2007). Thus, poverty is one community and individual level risk factor that is shared by many children regardless of parental nativity. Our results also indicate that not all children face the same risks in the same communities. Although the measures used here can only proxy the potential for greater access to social support and community resources that have been hypothesized to provide protective environments for immigrants and linguistically isolated households in general, our results suggest that children of immigrants in more linguistically isolated homes appear to be less disadvantaged by living in a community with many linguistically isolated households than their peers with U.S. born mothers in these same neighborhoods. It may be that these children's families are better able to access resources and support in their own language in communities where services are provided to serve the same linguistic groups (Vega et al. 2011;Zhou and Kim, 2006). In addition, children of U.S. born mothers may be better able to take advantage of resources available in affluent but monolingual communities than their peers with foreign born mothers. Additional research with data sufficiently diverse for three-way interactions between poverty and linguistic environments could help elucidate this further as an explanation for the greater divergence among children of U.S. born mothers across communities than among children of foreign born mothers.      Multivariate models predicting cognitive sores (BSF-R), ECLS-B and 2000 Census  "}, {"section_title": "Percent of Households in a Linguistically Isolated Neighborhood (>10%) by Nativity and Ethnicity", "text": ""}]