[{"section_title": "", "text": ", this question still has no definitive answer. Most economic analyses take an \"educational production function\" approach. These studies use econometric techniques to relate educational outcomes (e.g., students' academic achievement) to school inputs while controlling for other contributions such as those of the students themselves, their families, peers, and communities. Within this broad framework, educational production function studies exhibit a wide range of empirical approaches.' They vary in their choice and measurement of educational outcomes, explanatory variables of interest, and control variables. They also differ in their geographical scope and their unit of analysis. The findings from these studies are as mixed as their empirical approaches are varied. Some find large, positive effects of school inputs on student outcomes; others find little or no effect; still others conclude that additional school resources are inversely related to student outcomes. The most well-known result of this vast literature is Hanushek's (1986Hanushek's ( , 1989 conclusion of \"no strong or systematic relationship between school expenditures and student 1. The many approaches of educational production function studies are reviewed by Hanushek (1979Hanushek ( , 1986, Cohne and Geske (1990), and Monk (1990). performance.\" Hanushek's finding is based on his syntheses of more than thirty separate educational production function studies.' A more recent synthesis by Hedges, Laine, and Greenwald (1994) challenges the validity of the analytical method of \"vote counting,\" employed by Hanushek. Using the same primary studies as Hanushek's 1989 analysis, but a more sophisticated synthesis methodology known as \"meta-analysis, \" Hedges, Laine, and Greenwald reach the opposite conclusion.' They find a statistically significant and economically substantial, positive relationship between school inputs and student outcomes. The relevance of the findings from these syntheses depends not only on the quality of their methodological approaches but, more importantly, on the quality of the primary research studies. In reviewing the primary studies considered in these syntheses, I find that none of the primary studies adequately accounts for across-district variations in the resource costs of educational services (notably teacher compensation) and the proportion of students with special needs, who require additional, more costly services. \"Hanushek's famous 1986 analysis in the Journal of Economic Literature includes 147 regressions from 33 separate education production function studies. His updated 1989 study in Educational Researcher includes 187 regressions from 38 primary studies. He reports the exact same conclusion in the two synthesis studies. 'Hanushek's analytical method of \"vote counting\" examines only the sign and level of statistical significance of the estimated effects of the seven different school inputs on student performance. He gives one \"vote\" to each estimated effect with a positive sign. Whether he considers only those effects that are statistically significant or he ignores statistical significance, Hanushek concludes that the proportion of positive effects is too small to indicate a strong relationship between school inputs and student performance. Hedges, Laine, and Greenwald's \"meta-analysis\" considers not only the signs but also the magnitudes of the estimated effects of school inputs on student outcomes. Additionally, their more sophisticated methodology accounts for dependence among regressions estimated within the same study using slightly different empirical specifications and among regressions in different studies that used the same data sources. -2-These variations in resource costs and student needs are significant. The power of school districts to purchase a standard market basket of educational resources varies by twenty to forty percent within states and as much as forty percent across states (Chambers, 1981;McMahon, 1995). Student needs vary widely across districts as well, with the proportion of special needs students approaching fifty percent in some large urban school districts (Odden & Picus, 1992). I expect that a stronger relationship between student achievement and school expenditures will emerge after accounting for these resource-cost and student-need differentials. To test this hypothesis, I use a unique data set merged from three high quality, national data sources: the National Education Longitudinal Study of 1988, the Common Core of Data, and a district-level teacher cost index.' I specify and estimate a value-added student achievement model for which my explanatory variable of interest is per pupil expenditures. I find that the estimated effects of per pupil expenditures on high school students' academic achievement are consistently positive and statistically significant. However, my preliminary results show that these effects do not increase appreciably when the measure of expenditures is corrected to account for resource-cost differentials or when differences in the proportions of special-needs students are taken into account. The remainder of this paper is organized as follows: Section II presents my conceptual model. Section III describes the data sources, sample, and variables used in my empirical analysis. Section IV explains how I conduct my estimations. Section V presents and discusses the results. Section VI summarizes my findings and presents suggestions for future research. 'The teacher cost index was developed by Jay Chambers of the American Institutes for Research, and like the other data sources, was released by the U.S. Department of Education's National Center for Education Statistics. -3-"}, {"section_title": "II. Conceptual Framework Educational Production Function Studies", "text": "My conceptual model is the basic value-added, reduced-form specification of the educational production function presented in Hanushek's (1979Hanushek's ( , 1986 reviews. The educational outcome of interest is academic achievement. An individual student's achievement at time t (At), is modeled as a function of the student's prior achievement (At.), other student characteristics and effort (I), and the influences of the student's family (F), peers (P), school (S), and community (C) during the period between t* and t. That is, The effects of the school inputs on achievement are of primary interest in educational production function analyses. The types of school inputs considered in these analyses depend on the policy questions being addressed. Studies that focus on how schools allocate their funds typically consider specific-purchased inputs such as teacher/pupil ratios, and teachers' education levels and years of experience as the school inputs. My policy interests involve the equity of school finance formulas; hence, I consider schools' fiscal resources as the school input of interest. The efforts of states to provide more equitable educational opportunities and student outcomes by reducing across-district disparities in schools' fiscal resources inspired my two primary research questions: 1) Is there a positive, systematic relationship between student performance and schools' fiscal resources? and 2) How does the strength of that relationship depend on the precise measure of fiscal resources. Specifically, is the relationship between student achievement and per pupil expenditures (PPE) stronger when the PPE measure reflects the costs of educational services and the population of special needs students? If this is the case, then states would be more likely to achieve their student equity objectives by attempting to equalize cost-and student need-adjusted, rather than nominal, per pupil expenditures."}, {"section_title": "Variations in Costs", "text": "One problem in educational production function studies that relate schools' fiscal resources to student outcomes is that the costs of equivalent educational services vary widely across districts. Researchers estimate that these costs vary by twenty to forty percent within states and up to forty percent across states (Chambers, 1981;McMahon, 1995). In studies that ignore such differential resource costs, disparate outcomes for districts with identical expenditure levels seemingly lend support to the notion that money does not matter. In fact, higher student achievement should be expected in low cost districts which, for the same nominal expenditure level, can purchase more or higher quality real resources than high cost districts can afford, all else being equal. One recent production function study does attempt to account for variations in education costs by location. William Sander (1993) adjusts his expenditure and income variables by a cost-of-living index developed by Walter McMahon (1988), and finds that teacher related spending is positively related to ACT scores in Illinois. Although Sander's study represents an improvement over the prior literature, cost-of-living adjustments do not adequately account for educational price differentials. -5-The cost of living is but one factor affecting the attractiveness of a school district as a place to live and work. Other characteristics --including the size of the school district, the types of students served, the crime rate, the level of pollution, the climate, access to medical facilities, availability of recreational opportunities, and consumption opportunities --also affect the attractiveness of districts, and ultimately affect the salaries that are required to attract and retain individuals with specific professional characteristics (Chambers, 1981). A cost-of-living adjustment fails to adequately account for variations in salaries of school personnel due to differences in job and regional characteristics. Since personnel costs comprise at least 80 percent of school expenditures and since variations in personnel costs dominate the pattern of cost differences across districts it is important to account for these cost differences (Chambers and Fowler, 1995).5 While a number of approaches have been taken in efforts to develop an index for personnel costs (see Chambers, 1981, pp. 45-52), Chambers argues that the most appealing approach is based on the hedonic wage model. The theoretical framework, established by Lucas (1972), maintains that through a simultaneous process of matching the attributes of individual employees and the working conditions offered by employers, differential wages are determined. In its application to the market for school personnel, hedonic wage theory recognizes that differences in the characteristics of school districts require different salary levels to attract the types of personnel needed to provide a given level and quality of educational services across districts. 'Transportation and energy costs vary widely across districts as well, but account for a much smaller portion of schools' expenditures."}, {"section_title": "-6-", "text": "The hedonic wage model that forms the basis for a personnel cost index calculates how much more or less it would cost to employ similar kinds of personnel in similar working conditions under different district and regional characteristics that are beyond the control of local school decision-makers (Chambers, 1981, p. 63).6 The types of district and regional factors considered reflect the overall quality of the environment within which the individual works and lives as well as the condition of the labor market in which prevailing wages and employment levels are determined. Thus, a personnel cost index accounts for variations in district and regional characteristics, controlling for personal and job assignment characteristics. Adjusting expenditures by a personnel cost index allows for more meaningful comparisons of per pupil expenditure levels across districts that face different resource costs. We would expect that cost-adjusted expenditures are better at capturing the quantity and quality of the educational services purchased, and that such \"real\" measures should be more closely related to student performance than the typically considered \"nominal\" measures."}, {"section_title": "Variations in Student Needs", "text": "In educational production function analyses for which the observations are individual students, the ideal measure of a school's fiscal inputs would be the dollars (adjusted to reflect resource costs) spent on each individual student. However, school expenditures are most 6 It is essential that adjustments for differential costs of education be based only on factors which are beyond the control of district decision-makers, so that inefficient spending practices are not encouraged. -7-accurately measured (and often only available) at the district level and are difficult to accurately allocate to schools, classrooms, or individual students. Hence, whether the unit of analysis is individual students, schools, or districts, most analyses that focus on fiscal resources simply use district-level per pupil expenditures (PPEs) total district expenditures divided by the total number of students in the district --as the measure for school inputs. Just as nominal expenditure levels make for poor comparisons across districts with different resource costs, simple PPEs make for poor comparisons across districts with different proportions of special-needs students who require additional, more costly services. The distribution of special-needs students including special education, compensatory education, and limited English proficiency (LEP) students is not uniform across school districts. The incidence of students with physical and mental handicaps varies widely across states and districts. Large, urban districts and small, rural districts tend to have higher proportions of students for whom English is not the primary language. Urban and rural areas also tend to serve a higher proportion of students living in poverty (Odden and Picus, 1992). The costs of providing services to these special-needs students vary depending on such factors as the number and types of students with special needs, the size of the school, and the kinds of services provided. In general, though, studies estimate that special education programs are about 2.3 times as costly as regular programs (Kakalik et al., 1981;Moore, Strang, Schwartz, and Braddock, 1988;Chaikind, Danielson, and Brauen, 1993), and compensatory and LEP programs are at least 20 percent more costly (Odden and Picus, 1992;Parrish, Matsumoto, and Fowler, 1995). A variety of federal and state aid programs are designed to help districts offset the -8-additional costs of providing extra services for special-needs students. Under Chapter 1 of the Elementary and Secondary Education Act (ESEA), the federal government and the states provide extra funds to districts for compensatory education. Title VII of the ESEA makes available funds for bilingual education programs. The federal Education for All Handicapped Children Act mandates and helps fund special education programs. Analyses of expenditures that include these additional funds should also reflect the size of the special needs population for whom these funds are provided. Because the distribution of special-needs students varies widely among school districts, simple comparisons of PPEs across districts fail to reflect differences in school resources available for the average student. Districts with smaller proportions of the more costly special-needs students, in effect, have more money to spend on the average student than do schools with higher proportions of these special-needs students, ceteris paribus. Hence, in educational production function studies relating school expenditures to student achievement, control variables for the proportion of special needs students in each district need to be included in the regressions."}, {"section_title": "Hypothesis", "text": "Figures 1 3, show how I expect these variations in resource costs and students needs to affect the relationship between student achievement and school expenditures.  students. Under these conditions, the adjusted measure of per pupil expenditures would be lower than the nominal measure. (The arrows represent the change in PPE measure from nominal to adjusted.) Similarly, I expect that districts with lower levels of student achievement and higher nominal expenditures (lower right portion of graph) face higher costs of education and serve a higher proportion of special needs students. For these districts, the adjusted measure of per pupil expenditures would be lower than the nominal measure. If my expectations are correct, then a positive relationship between student achievement and school expenditures should emerge as the measure of expenditures is adjusted to account for these differences in resource costs and student needs (see Figure 3)."}, {"section_title": "III. Empirical Model Data Sources", "text": "This study uses data merged from two large data sets and a smaller data file, each released by the National Center for Education Statistics. The first source is the restricted-use version of the National Education Longitudinal Study of 1988 (NELS), a general-purpose panel study that surveyed and tested eighth graders from about 1,000 public and private middle schools in the spring of 1988 and followed these students through high school. The first three waves of NELS include scores on cognitive tests administered to students in 1988, 1990, and 1992 as well as information from questionnaires administered to students, their parents, teachers and school administrators over the same time period (Inge ls et al., 1994). -10-The second source is the Common Core of Data (CCD), an annual, comprehensive database containing descriptive data on all public elementary and secondary schools and school districts in the United States. The CCD also contains enhanced financial data at the district level for fiscal years 1990, 1991, and 1992. Additionally, the CCD contains demographic indicators derived from special tabulations for school districts from the 1990 Census (National Center for Education Statistics, 1995). The third, smaller data source is a national, district-level teacher cost index (TCI) developed by Jay Chambers of the American Institutes for Research. Chambers' TCI reflects across-district variations in non-discretionary resource costs of teacher services. Based on a hedonic wage model, the TCI was created using survey data from over 40,000 public school teachers who participated in the NCES's Schools and Staffing Survey for school year 1990-1991. Chambers' TCI is the only nationwide, district-level index available that accounts for both the factors that underlie differences in the cost of living and variations in other teacher and school attributes that are within local control (Chambers and Fowler, 1995)."}, {"section_title": "Sample", "text": "My sample is drawn from those students who participated in all the first three waves of the NELS panel study (16,489 students). I consider only students attending public schools (11,598) because they are the only ones to whom I can assign reliable, comparable expenditure data from the CCD.' I further refine my sample to include only students who never dropped 7NELS oversampled students in private schools; hence the large proportion of students who are eliminated once I consider only students who attend public schools. out of school (11,503) and who attended the same high school in both 1990 and 1992 (11,167). These restrictions are imposed because I want to consider only those students who are consistently associated with school resources at particular schools. The disadvantage is that these students constitute a more stable student body than is reflected in the total student population. To the extent that dropout rates, transfer rates, or participation in all three waves of the NELS survey are systematically related to per pupil expenditure levels, my findings are not generalizable to the entire student population; rather, they must be qualified to apply to this more stable group of students. I further eliminate observations with missing data in three critical areas: test scores, special needs-students, and TCI values. I lose a substantial number of observations by considering only students with complete test score data in both 1988 and 1992; this restriction leaves 7,854 students.' Eliminating observations lacking CCD data on the number of specialneeds students and observations with missing TCI values leaves a sample size of 6,990. Missing values for some control variables reduce the number of observations used in the regression computations to 5,955.9 'In this paper I do not tackle the potential \"pretest to posttest selection problem\" discussed by Becker and Walstad, 1990. 9Other fields with missing data include: the percent of students in the district living in single-parent homes; the percent of students in the district in minority families; historical dropout rates in the high school; and enrollment in the twelfth grade. In future studies, I intend to impute values for missing data in these fields. -12-"}, {"section_title": "Variab es", "text": "The dependent variable in my regression equations is the student's 1992 (senior year for most of the students) score on the NELS mathematics test. The specific measure I use for mathematics achievement is the item response theory (IRT) theta score, which is standardized to a mean of 50 and a standard deviation of 10. To eliminate floor and ceiling effects, three forms of the mathematics tests were administered to the students in 1992, depending on their prior achievement. Students who performed in the highest quartile on the 1990 test were given the most difficult version of the 1992 exam; those in the lowest quartile in 1990 received the easiest version of the 1992 exam; and the rest of the students received the test of medium difficulty in 1992. Item response theory was used to calculate scores that could be compared across test forms that differed across the years and across the students in a given year. The theta score, which is standardized across the three waves of testing is the best score to use when assessing gains in cognitive skills. (See Ingels et al., 1994 for more information about NELS testing and IRT scoring.) The independent variables include controls for achievement in eighth grade, in order to analyze the gain in cognitive outcomes during the high school years. I include both the 1988 mathematics IRT theta score and the average 1988 IRT theta score on the other three NELS tests in science, reading, and social studies --as control variables.10 I use the average of the loI use the 1992 math score as the dependent variable and include the 1988 math score as a control variable, rather than using the gain in score as the dependent variable, because the former specification is less restrictive. In particular, the gain score specification implicitly assumes that the coefficient on 1988 math score should be one. Typically, the coefficient estimate on prior achievement in the same subject is in the range of .70 to .80. -13-other test scores as an additional control to reduce bias from unmeasured pre-existing differences among students (see Gamoran, 1996;Gamoran and Mare, 1989;and Jencks, 1985). I expect to find strong, positive relationships between these measures of prior achievement and the measure of achievement on the mathematics test in 1992. Other control variables included in my empirical analysis capture student and family characteristics, the student's interest and effort in mathematics and in school, and characteristics of the student's peers, school, and community. Descriptive statistics for these control variables are reported in Table 1. Definitions and sources for all the variables are provided in the appendix."}, {"section_title": "IV. Methodological Approach", "text": "Recall that two primary questions are addressed in this study. First, do these high quality, nationwide data reveal a positive relationship between student achievement and per pupil expenditures? Second, is the estimated effect of per pupil expenditures on student achievement strengthened by accounting for across-district variations in resource costs and student needs? Addressing the first question is a straightforward matter of examining the statistical significance and substantive magnitude of the coefficient estimates on the PPE variables. Addressing the second question is more involved."}, {"section_title": "Coefficient Comparisons Across Regressions", "text": "To address the second question I run four main regressions then compare the -14-coefficient estimates on the PPE variables across these regressions. The four regressions differ only in their measure of PPE and in their controls for special-needs students. I consider two measures of PPE: nominal and cost-adjusted. \"Nominal PPE\" is calculated by simply dividing the district's expenditures by the number of pupils in the district. \"Cost-adjusted PPE\" divides the nominal PPE value by the teacher cost index (TCI) times 100. (The TCI is centered at 100 in the population rather than at one; hence the need to multiply by 100.) Additionally, I consider two alternative specifications of the model: in the first specification I do not control for the proportion of special-needs students; in the second specification, I do. In the second specification I include separate control variables indicating the proportion of students in each of the following special needs categories: special education, limited English proficiency, and compensatory education. The combination of the two alternative PPE measures and the two alternative specifications produce the four distinct regressions. To examine the robustness of the results, I consider three alternative categories of expenditures. The three expenditure categories are: 1) total district expenditures; 2) core current expenditures; and 3) expenditures on instructional salaries. The first category encompasses all current operation and capital outlay expenditures. The second includes just three key types of current operation expenditures: instructional expenditures (salaries and benefits for teachers and aides, contracted services, and supplies), pupil support services, and instructional staff support. The third category is the narrowest of all: only instruction-related salaries for teachers and aides are considered. Table 2 reports descriptive statistics for the nominal and the cost-adjusted PPE measures in each of these three expenditure categories. -15-To meaningfully compare the coefficient estimates across regressions, the nominal and cost-adjusted PPE measures used in the regressions need to be on a common scale. Therefore, I create a new variable, called \"comparable cost-adjusted PPE,\" by multiplying each observation of the \"cost-adjusted PPE\" by a constant factor. The factor equals the ratio of the mean nominal PPE to the mean cost-adjusted PPE. The factor differs slightly across the three expenditure categories, but in all cases is approximately 0.98. (Descriptive statistics for the \"comparable cost-adjusted PPE\" measure are also presented in Table 2. Note that the means for the nominal and comparable cost-adjusted PPE variables are identical by design.) It is the \"nominal PPE\" and the \"comparable cost-adjusted PPE\" variables that are included in the regressions, thus allowing for meaningful across-regression comparisons of the coefficient estimates on the PPE variables within each expenditure category. Within each expenditure category, I expect to find that the magnitude of the coefficient on the PPE measures increases: 1) as the measure changes from \"nominal PPE\" to \"comparable cost-adjusted PPE\"; 2) when the regressions control for special-needs students; and 3) as both cost and student needs are taken into account (i.e., we move from nominal PPE and no controls to cost-adjusted PPE and special-needs controls)."}, {"section_title": "V. Estimation Results", "text": "The results confirm that student achievement on the 1992 NELS mathematics test is positively related to per pupil expenditures. This result holds for all three expenditure categories, whether the PPE measure is nominal or cost-adjusted, and whether or not control variables for special needs students are included in the regression. Table 3 summarizes the estimated effects of the various expenditure measures on achievement for both model specifications. The coefficient estimate is consistently positive and statistically different from zero, though it is substantively small.\" For example, the coefficient on nominal core PPE in the regression that controls for special needs students is 0.335. This coefficient means that for an additional $1,000 in per pupil expenditures, the math score is expected to increase by 0.335 points over the high school years. Given that typical gain in math score is about 8.5 points, the extra $1,000 per pupil raises test scores by only 4 percent of what is already Although not of primary interest in this study, it is interesting to examine the effects of the other explanatory variables included in the model. These other effects may shed light on the weak effects of the fiscal resources. Table 4 presents all the estimated effects from the \"Because the observations are not truly independent, since students are clustered within schools, the reported OLS estimates of the standard errors may be understated. One way to handle this potential problem is to impose higher standards in judging statistical significance. (See Goldberger and Cain, 1982, p 107.) All the estimated coefficients on the PPE variables have t-statistics greater than 3. Additionally, I used a hierarchical linear modeling technique to calculate unbiased standard errors and found that these standard errors were virtually identical to the OLS standard errors. This result is not surprising, since there are only ten students, on average, in each school, and the magnitude of the bias for the standard errors increases with the average group size. (See Moulton, 1990, p. 335.) -17-regressions that use (comparable) cost-adjusted core expenditures per pupil as the explanatory variable of interest. Performance on the 1992 mathematics test is positively and statistically significantly related to prior achievement in both math and other subjects. Higher math achievement is also positively and significantly related to higher socioeconomic status. Females' performance on the math tests is worse than males', and minorities' performance is worse than non-minorities'. Students from single-parent homes perform worse than those from two-parent households, but not significantly so. All three separate measures of student effort are positive and statistically significant. Students who experience multiple disruptions at school perform worse than those in less disruptive learning environments. The signs on most of the other non-expenditure-related explanatory variables are generally as expected. The most notable unexpected result is the negative coefficient on the median income for households with children. The effects of the per pupil expenditure variable were highly sensitive to the inclusion or exclusion of this income variable, even though the correlation coefficient is only about 0.5. The positive coefficient on the percent of LEP students in the regressions which used control variables indicates that limited English proficiency is not a substantial handicap on math tests. Indeed, international studies consistently rank US school children among the lowest in math performance. Perhaps in schools with higher proportions of LEP students, the students are able to draw more from their prior mathematics knowledge. In future analyses, I will consider performance in the other NELS subjects as well. I expect, for example, that the coefficient on LEP students will be negative on the reading test. -18-"}, {"section_title": "VI. Conclusions and Directions for Future Research", "text": "This paper contributes to the understanding of the effects of school expenditures on student achievement by drawing on three nationwide data sets which are merged to create a rich sample for the empirical analysis. I expected to find a weak relationship between student achievement and nominal expenditures, but a positive relationship between achievement and my cost-adjusted expenditure measures when controlling for the special-needs student population. Instead, I consistently found a small positive relationship that was relatively insensitive to the cost-adjustments and special-needs controls. These results provide evidence that the lack of a strong relationship between student achievement and school expenditures cannot simply be attributed to mismeasurement of the schools' fiscal resources. In future research I intend to test the robustness of these results. I will consider alternative model specifications and methods of accounting for differential resource costs and student needs. It may be that I find no support for my hypothesis no matter what model or adjustment factors are used, but given the dearth of work in this area, further exploration is warranted. Specifically, I will examine the degree to which my results are due to my linearity assumptions. Perhaps the change in PPE measure from nominal to cost-adjusted does matter for some subpopulations, e.g., students in the poorest schools. Additionally, I will examine the extent to which these results are dependent on my choice of cost-adjustment: Chambers' teacher cost index. These and other avenues of exploration should shed further light on the potential effectiveness of school finance reform in affecting student equity.  Adjusting expenditures to account for the cost of education and special needs students may bring a new picture into focus."}, {"section_title": "Student Achievement higher medium lower", "text": "Lower cost of education and fewer special needs students means that adjusted PPE is higher than nominal PPE. ."}, {"section_title": "401111------", "text": "Higher cost of education and more special needs students means that adjusted PPE is lower than nominal PPE.       "}, {"section_title": "APPENDIX DEFINITIONS AND SOURCES OF THE VARIABLES", "text": "Unless otherwise noted, the variables described below are based on variables from the NELS Student Component Data Files. Other sources of data include the NELS School Component Data Files (NELS School), the Common Core of Data (CCD), and the Teacher Cost Index (TCI)."}, {"section_title": "Dependent Variable", "text": "Math score, 1992: Score on the mathematics achievement test in the spring of 1992, when most of the students were in twelfth grade. Uses NELS variable F22XMTH, the IRT Theta tscore. (See Ingles et al., 1994, p. H-33 for a description of the benefits of using this metric.)"}, {"section_title": "Explanatory Variables of Interest", "text": "Six variables measuring per pupil expenditures are used in these analyses. These are based on three categories of expenditures (total, core current, and instructional salaries) and two alternative calculations of per pupil expenditures (nominal and cost-adjusted). The three categories of expenditures are from the CCD for Fiscal Year 1992 (School Year 1991-92). Expenditures are measured for the entire school district. Measure 1 is total district expenditures, field C_TOTEXP. Measure 2 is core current expenditures, defined as instructional expenditures, pupil support services, and instructional staff support: C_E13 + C_E17 + C_E07. Measure 3 is instructional salaries only, C_Z33. The two methods of calculating per pupil expenditures are described below: Nominal per pupil expenditures are calculated by simply dividing each of the expenditure measures described above by the total number of students in the school district in School Year 1991-92 (AG_PK12). For example, the formula for per pupil total expenditures is C_TOTEXP/AG_PK12. Cost-adjusted per pupil expenditures are calculated by dividing expenditures by Chambers' teacher cost index (TCI) multiplying by 100, then dividing by the number of students in the district, e.g. (C_TOTEXP/TCI*100)/AG_PK12. Note that the cost-adjusted measure that is used in the regressions is rescaled to be comparable to the nominal measure within each category. See Section IV, \"Coefficient Comparisons Across Regressions.\" Prior Achievement"}, {"section_title": "Control Variables", "text": "Math score, 1988: BY2XMTH, eighth grade IRT Theta t-score. Average of other scores, 1988: Average of 1988 IRT Theta t-scores in reading, science, and social studies. (BY2XHTH + BY2XSTH + BY2XRTH) / 3. All these test scores are on the same metric; hence the simple average score is appropriate."}, {"section_title": "Student and Family Characteristics", "text": "Minority: Student's race based on F2RACE1, recoded to 1=Black, Hispanic, or Native American; 0=White or Asian. Female: Student's sex based on F2SEX, recoded to 1=female; 0=male. Single-parent family: Adult composition of the student's household based on FAMCOMP, recoded to 1= adult female only or adult male only; 0=two parents or guardians. Socioeconomic status: F2SES1, SES measure based on father's education level, mother's education level, father's occupation, mother's occupation, and family income, and using Duncan's Socioeconomic Index (1961)."}, {"section_title": "Student Interest and Effort", "text": "Interest and effort in math: Composite variable based on the student's responses to questions F2S21A-D: In your current or most recent math class, how often do you: Pay attention in class? Complete your work on time? Do more work than was required of you? Participate actively in class? Composite ranges from 0 (little effort) to 4 (strong effort). Time spent on homework: Sum of categorical data on hours spent on homework in school (F2S25F1) and out of school (F2S25F2). Sum ranges from 0 indicating no time to 16 indicating over 40 hours per week. Class attendance: Composite variable (uses F2S9A-F) measuring the student's attendance in classes, based on how often the student reports he or she: Was late for school. Cut or skipped class. Missed a day of classes. Was put on in school suspension. Was suspended or put on probation from school. Composite ranges from 0 to 5, where 5 indicates the student says he or she \"never\" did any of the above."}, {"section_title": "Student's View of the School Environment", "text": "Perceives disruptive environment: Composite of the student's perception of the school's learning environment, based on how strongly the student agrees with statements F2S7E-H: I don't feel safe at this school. Disruptions by other students get in the way of my learning. Fights often occur between different racial or ethnic groups. There are many gangs in school. Composite ranges from 0 to 4, where 4 means the student agreed or strongly agreed with all four statements. Experiences disruptive environment: Composite measuring the student's personal experiences that indicate a disruptive learning environment. The composite ranges from 0 to 7 and indicates the number of affirmative responses to statements F2S8A-G: I had something stolen from me at school. Someone offered to sell me drugs at school. Someone offered to sell me drugs on the way to or from school. Someone threatened to hurt me at school. Someone threatened to hurt me on the way to or from school. I got into a physical fight at school. I got into a physical fight on the way to or from school. Peers' Characteristics (All these variables are based on data from the NELS School File) Peers from single-parent homes: F2C23, estimate by school administrator of the percent of twelfth graders (in 1992) from single-parent homes. Coding: 1 indicates less than 10 percent from single-parent homes; 5 indicates more than 75 percent. Percent minority peers: Percentage of twelfth graders who are Black, Hispanic, or Native American. F2C22B + F2C22C + F2C22E. Peers' absenteeism: Based on F2C21, average daily attendence (ADA) rate for twelfth graders, recoded such that 0 indicates 95 % s ADA; 1 indicates 90%s ADA < 95 %; 2 indicates 85%s ADA <90%; 3 indicates ADA <85%. Peers' dropout rate: Based on F2C26, estimate of the percent of students who enter the twelfth grade who drop out before graduation. Coded such that 0 means none drop out; 1 means 0%s dropout rate (DR) < 3%; 2 means 3% s DR<5%; 3 means 5% s DR < 7%; 4 means 7% s DR<10%; 5 means 10% s DR<20%; and 6 means 20% s DR. Special Needs Students (From the CCD Agency Database for School Year 1991-92) Percent special education: AG_SPED/AG_PK12*100, number of special education students in the district divided by the total number of students in the district, times 100. Percent with limited English proficiency: P7028TP, percentage of children in the district who speak English \"not well.\" Percent below poverty level: P7118TP, percentage of children in the district living below the poverty level. Community Characteristics (From the CCD Agency Database for School Year 1991-92) Percent adults with at least some college: P120403P + P120404P, percentage of adults in the district with some college, or a bachelor's degree or higher degree. Median income for household with kids: P3080A01. ),Le 07C -24 ao/ -6( ) (\"0.4 .12,e,eo ,464,e4 :r-,,,e., 74-1-75:91 5, ©o its : evicien Ce ?co\" IAJEL S-°Inc/ \"1\"42-CC) Author(s):coc_r_i Corporate Source: an! //lai4:Te57-z- In order to disseminate as widely as possible timely and significant materials of interest to the educational community, documents announced in the monthly abstract journal of the ERIC system, Resources in Education (RIE), are usually made available to users in microfiche, reproduced paper copy, and electronic/optical media, and sold through the ERIC Document Reproduction Service IEDRS) or other ERIC vendors. Credit is given to the source of each document, and, if reproduction release is granted, one of the following notices is affixed to the document. If permission is granted to reproduce.the identified document, please CHECK ONE of the following options and sign the release below. Z. Sample sticker to be affixed to document Sample sticker to be affixed to document 110 Sign Here, Please Documents will be processed as indicated provided reproduction quality permits. If permission to reproduce is granted, but neither box is checked, documents will be processed at Level 1. \"I hereby grant to the Educational Resources Information Center (ERIC) nonexclusive permission to reproduce this document as indicated above. Reproduction from the ERIC microfiche or electronic/optical media by persons other than ERIC employees and its system contractors requires permission from the copyright holder. Exception is made for nonprofit reproduction by libraries and other service agencies to satisfy information needs of educators in response to discrete inquiries.\" "}]