[{"section_title": "www.ers.usda.gov", "text": ""}, {"section_title": "What Is the Issue?", "text": "Over the last 20 years, the Federal crop insurance program has grown to be a major source of Government support for U.S. crop farmers. A key factor in the rise of the program has been the introduction and subsequent growth of premium subsidies that provide producers with financial incentives to participate. With the growth of the crop insurance program, information on determinants of enrollment can help policymakers, Government officials, and other stakeholders better understand the implications for risk management and program implementation."}, {"section_title": "What Did the Study Find?", "text": "Between 1997 and 2002-an interval spanning a major legislative change to crop insurance-increases in premium subsidies generally appeared to induce farmers to enroll more land. However, the effects varied by region and crop and were relatively small (although results remained quite similar to the findings of previous studies). Subsidies appeared to have a larger effect on the intensity of crop insurance use, namely, total premiums and premiums per acre, suggesting the subsidies' largest effects were to induce those already enrolled in crop insurance to enroll in higher levels of coverage. Key findings follow: • Based on total premiums (the sum of the premium the producer pays for a policy plus associated premium subsidies), the average response for corn producers in the Midwest (IL, IN, IA, and OH) was to increase the demand for crop insurance when the price of crop insurance fell. That is, a 1-percent increase in subsidies per acre appeared to generate an increase of roughly 0.96 percent in total premium purchases. The average response of corn producers in the Lake States (MI, MN, and WI) and the Northern Plains (KS, NE, and SD) exhibited smaller changes, with total premium purchases increasing by 0.83 percent and 0.80 percent, respectively, following a 1-percent increase in subsidies. • The average responses of soybean producers were similar but smaller than those of corn producers (not surprising, as corn producers often grow soybeans as well). For a 1-percent increase in subsidies, the average response of soybean producers was to increase total premium purchases by 0.84 percent in the Midwest, 0.59 percent in the Lake States, and 0.47 percent in the Northern Plains."}, {"section_title": "United States Department of Agriculture", "text": ""}, {"section_title": "A report summary from the Economic Research Service", "text": "July 2014 The Effects of Premium Subsidies on Demand for Crop Insurance Find the full report at www.ers.usda. gov/publications/erreconomic-researchreport/err169.aspx • Despite a decrease of roughly 6 million acres in wheat plantings in the Northern Plains (KS, NE, ND, and SD) and Southern Plains (OK and TX) between 1997 and 2002, the average response of wheat producers in both regions showed relatively strong increases in demand for crop insurance. For each 1-percent increase in subsidies, demand rose by 0.74 percent and 0.91 percent in terms of total premiums purchased, respectively. • The effects of subsidy increases are also revealed in other measures of demand for crop insurance during the period. Premiums per acre (total premiums divided by acres insured) and liabilities per acre (total liability divided by acres insured) also tended to rise, with premiums increasing the most. The change in demand measured as acres enrolled (both total and buy-up policies-those policies above the minimal, fully subsidized catastrophic coverage available to growers) typically showed very small, and statistically insignificant, movements in response to subsidy changes. Further, these results were often negative, suggesting the potential for cross-product substitution effects. Together, these findings suggest that subsidies may not (during this timeframe) have drawn many new acres into crop insurance, but they appear to have induced higher levels of coverage on enrolled acres. • Across all regions, for a 1-percent increase in subsidies, demand for crop insurance rose about 0.86 percent for corn, 0.74 percent for soybeans, and 0.64 percent for wheat in terms of total premiums. For liabilities, increases in demand ranged from roughly 0.2 percent for soybeans and wheat to 0.3 percent for corn. For acres enrolled, the rise in subsidies typically resulted in statistically insignificant changes in demand with magnitudes below 0.2 percent."}, {"section_title": "Introduction", "text": "Over the last 20 years, the Federal crop insurance program has grown significantly. In 1992, producers enrolled about 82 million acres and total premiums (including subsidies) exceeded $1.2 billion (in 2012 dollars to account for inflation). By 2012, crop insurance policies covered more than 282 million acres and premiums exceeded $11 billion. If actuarially fair, subsidy levels provide an estimate of expected Government outlays for the program (not including expenses like administrative costs, operating costs, or underwriting gains), and these premium subsidies grew from $322 million in 1992 to nearly $7 billion in 2012 (again, accounting for inflation). 1 Many researchers attribute the growth in the program to these premium subsidies. How important are subsidies to farmer enrollment in the Federal crop insurance program? This study analyzes the effects of changes in subsidies on producers' decisions to participate in crop insurance following the enactment of the Agricultural Risk Protection Act (ARPA) in 2000, when new premium subsidies were implemented. 2 Several measures of program participation are examined, including the number of acres enrolled, the value of crops enrolled, and the value of crop insurance policies purchased. A regression analysis includes these measures as it explores changes in program participation before and after Congress passed ARPA. Results will help researchers estimate the effects on program participation of future changes to premium subsidies."}, {"section_title": "Previous Work", "text": "Previous studies examined how changes in the price of premiums affect demand for crop insurance. The bulk of this work, however, focused on years prior to 1995 (i.e., before the implementation of the Federal Crop Insurance Reform Act of 1994 (FCIRA)) to better understand the low participation in the crop insurance program. Many of these studies found that demand for crop insurance was not affected much by the level of crop insurance premiums or premium rates (Shaik et al., 2008;Goodwin et al., 2004;Serra et al., 2003;Coble et al., 1996;Goodwin, 1993;Gardner and Kramer, 1986). Some of these studies attributed this finding to adverse selection-where only those producers who believe they will receive indemnities enroll (e.g., perhaps they produce in areas prone to disasters) (Glauber, 2004;Goodwin, 1993). Researchers posited that adverse selection in the Federal crop insurance program prior to 1995 created a pool of insured individuals that then caused premium rates to increase (particularly if actuarially fair, since indemnities continued to be paid out). Higher"}, {"section_title": "2", "text": "The Effects of Premium Subsidies on Demand for Crop Insurance, ERR-169 Economic Research Service/USDA premium rates would then make it more expensive for other producers to participate and would effectively price them out of the program. That effect could create a downward spiral if premium prices continued to escalate and producers continued to leave the program. Eventually, the program would cease to exist without some outside (in this case, Federal) support. With adverse selection, even if producers receive subsidies, they are interested in enrolling only if the subsidy is high enough. Researchers concluded that perhaps the subsidies were not high enough to overcome adverse selection and induce producers to enroll in the program. Smith and Baquet (1996) also examined the influence of premium rates on participation and noted that while the rates did not appear to affect enrollment in the crop insurance program, they did appear to have an effect on the level of coverage (a measure of intensity of use) chosen. In other words, premium rates appeared to influence the overall decision of how to use the crop insurance program once enrolled. In an unpublished paper, Babcock and Hart (2005) examined the effects of post-ARPA subsidy rates (as opposed to either premium levels or premium rates) on the level of enrollment for revenue and yield policies. Babcock and Hart concluded that subsidies were influential in changing the decisions of producers-particularly with respect to adopting higher levels of coverage after the passage of ARPA. This ERS study contributes to a better understanding of the effects of subsidies on demand for crop insurance by following Babcock and Hart's lead to examine the subsidies directly while using various measures of demand in the vein of Goodwin (1993). While these two previous studies as well as others provided significant insights on the impacts of premium subsidies, producers in the late 1990s and early 2000s operated in a much different environment than those who operated in earlier years. Policy changes abounded in that era, and the crop insurance program underwent multiple significant changes (see box \"History of the Crop Insurance Program\"). This current study aims to expand on previous studies by exploring how premium subsidies affect crop insurance demand across both a larger set of crops and a wider set of regions. Additionally, it examines causal relationships and casts findings in light of todays' policy environment, in which risk management tools available to producers have evolved."}, {"section_title": "Tools To Manage Risk", "text": "Farmers have a wide variety of tools with which to manage risk. While they can use private risk management tools, including diversification, consolidation, production and marketing contracts, savings, and futures contracts, they also often rely on publicly run programs such as the Federal crop insurance program and other farm bill programs. The Agricultural Act of 2014 (2014 Farm Act) eliminated programs that provided support based on historical production and replaced them with shallow loss programs-programs designed to help producers cover some of their crop insurance deductibles (i.e., losses that are smaller than those covered by most crop insurance policies). Programs that integrate with crop insurance (like the shallow loss programs) further highlight the growing importance of crop insurance as the primary risk management tool offered to producers by the Federal Government."}, {"section_title": "4", "text": "The Effects of Premium Subsidies on Demand for Crop Insurance, ERR-169"}, {"section_title": "Who Uses Crop Insurance?", "text": "When the Federal crop insurance program was started in the late 1930s, policymakers aimed the program at producers of wheat, the largest crop in terms of acreage being grown at that time. Today, producers of corn, soybeans, and wheat-the three largest crops produced in the United States-are the largest consumers of crop insurance. In 1997, these three crops accounted for 80 percent of all acres enrolled in the program. Including cotton and sorghum raised the share to nearly 90 percent of all acres enrolled. Over the last 15 years, with new types of policies being offered and more crops added to the program, the share of enrolled acres attributed to these major crops fell as participation in the Federal crop insurance program continued to increase. By 2012, corn, soybeans, and wheat made up roughly 68 percent of all acres enrolled, with cotton and sorghum accounting for an additional 7 percent (table 1). Across States, the share of acres enrolled in the crop insurance program varies widely by crop and over time (fig. 1). For example, in 1990, more than 60 percent of Iowa's corn acres were enrolled in the program. By 2012, that share had jumped to 91 percent. In contrast, only 20 percent of Indiana's corn acres were enrolled in 1990, but by 2012, the share had risen to about 74 percent. Despite the large variation among States, it is clear that the gaps shrank significantly between 1990 and 2012 as coverage rates increased. With the exception of North Dakota's historically high levels of coverage for wheat, the lowest share of enrolled acres in 2012 for any State examined in this report (the level of which is marked by the dotted line in the figure) exceeded the highest share of acres enrolled in 1992. For corn, the lowest share of acres insured within a State rose from about 12 percent in 1992 to 70 percent in 2012. For the other major crops, the lowest shares rose from approximately 15 percent to 75 percent (soybeans) and from nearly 30 percent to 75 percent (wheat). Other measures can also be used to estimate participation in the crop insurance program. These include (but are not necessarily limited to) the share of total crop value under a policy (the liability) and the level of total premiums demanded (fig. 2). Regardless of the measure used, from 1990 to 2012, participation in the Federal crop insurance program grew significantly. How important were the subsidies to the growth of the crop insurance program?  Note: This figure depicts the change in the share of acres insured from 1990 to 2012 for select States. Not all the labels are on the axes where their true values lie-several have been \"jittered\" (moving the labels either directly to the left or the right to reduce clutter) for readability. Note the wide range of insurance adoption across States in 1990. By 2012, the range is substantially narrowed. The dotted line depicts the share of acres insured of the State with the lowest share in 2012 to enable comparisons to the shares adopted in 1990. In 1990, almost all the States examined had at least 40 percent of their wheat acres insured while more than half of the States had less than 40 percent of their corn and soybean acres insured. By 2012, all States had at least 70 percent of their respective crops insured. Source: USDA, Economic Research Service using data from USDA, Risk Management Agency, Summary of Business files, 1990 and 2012."}, {"section_title": "Corn Soybeans Wheat", "text": "Figure 2 Growth in participation in crop insurance: alternate measures, normalized to 2012 dollars Note the scale of the y-axes-a factor of 10 difference between liabilities and premiums. C = corn; S = soybeans; W = wheat. Premiums and liabilities were normalized for these charts using the Consumer Price Index. Source: USDA, Economic Research Service using data from USDA, Risk Management Agency, Summary of Business files, 1990-2012. The Effects of Premium Subsidies on Demand for Crop Insurance, ERR-169 The Importance of Subsidies (How Price Affects the Quantity Demanded) As mentioned previously, there are many different ways to measure participation in the crop insurance program. This study uses five different measures (each measured as a change over time): total acres enrolled, number of acres enrolled in buy-up coverage (those policies above the minimal, fully subsidized catastrophic coverage available to growers), level of total premiums, level of total premiums per acre, and level of total liability per acre. The most commonly used variable in previous studies, a measure of acres enrolled, captures the amount of land covered under the crop insurance program. While a valid measure, total acres enrolled does not account for land quality. An acre of marginally productive land would be counted equally to an acre of highly productive cropland. Furthermore, land that is more likely to have crop failure is more likely to be enrolled in crop insurance. For example, a corn acre in South Dakota is more likely to be covered than a corn acre in Illinois, where the growing season is much more consistent over time (and this appears to be supported by the data). Also, total acres enrolled do not enable one to measure intensity of use of the crop insurance program. An acre enrolled in CAT would be counted the same as an acre enrolled in 65-or even 85-percent coverage. And, an acre enrolled in 65-percent coverage under a yield policy (a policy based on the actual yields observed in past years) would be treated the same as an acre enrolled in 65-percent revenue coverage despite the fundamental differences between the two insurance products (see box \"What Does X% Coverage Mean?\"). Clearly, the program is being used differently in these four scenarios, but the acre measure does not enable one to discern between the various uses. Therefore, while total acres enrolled can be an effective measure, it is important to note its shortcomings and consider other measures as well. A related measure is number of acres insured with buy-up coverage. This also suffers from not accounting for land quality but begins to parse out the intensity of use by focusing on those farmers who use the crop insurance program more rigorously as part of their risk management strategy (as opposed to simply opting for CAT coverage to, say, allow them to be eligible for disaster support). This measure still cannot gauge the intensity of use within the buy-up category but does separate out those participants using only CAT. In the analysis, we would expect to see positive coefficients for the acreage measures, suggesting that as the crop insurance becomes cheaper, more acres get enrolled. However, we cannot, a priori, rule out negative coefficients since the analysis explores one crop at a time. If the change in crop insurance premium subsidies induced changes in crop mix (not explored in this study) or is combined with budget constraints such that increasing insurance for one crop may lead to decreasing coverage on another (a cross-product substitution effect), then these are ways we might see increases in subsidies causing a drop in the number of acres enrolled for a particular crop. A third measure is total premiums. Assuming that the total premium is actuarially fair, the price of a policy should reflect the level of risk being covered. With this measure, one can capture intensity of use since a 65-percent yield policy will cost less than a 65-percent revenue policy, and policies for marginal land will command higher prices than those for highly productive land. This measure will also capture changes in enrollment (since more land enrolled means more policies being purchased) and changes in intensity of use (since opting for a higher coverage will cause the total premiums to increase). Similar to the acreage measures, while we would expect the coefficient to be positive, we cannot rule out the potential for negative results. A fourth measure is total premiums per acre. This measure adjusts the total premiums by the acreage being enrolled, providing an average intensity of use per acre. This helps to control for the size of the county since simply enrolling more acres will not necessarily increase the premium per acre measure. Note that if more acres are enrolled at the average level of coverage, the change in the premium per acre will remain the same, and if acres are enrolled at lower than average levels of coverage, this measure could be negative, despite increased enrollment in the program."}, {"section_title": "What Does X% Coverage Mean?", "text": "A crop insurance policy essentially guarantees a certain percentage of the expected outcome, whether that outcome is the yield or the revenue. Policies have a variety of farmer-selectable characteristics-including the share of the expected outcome guaranteed. For example, if a producer had an expected yield of 100 bushels per acre and wanted to guarantee 75 bushels per acre, the producer could obtain a 75-percent yield policy that would ensure that, at the end of the crop year, no matter what happened in terms of actual yields (whether yields were good or if bad weather or pests, etc., caused yields to be low), the producer would receive compensation for at least 75 bushels per acre. If a producer preferred to insure against revenue loss, he or she could take out an appropriate revenue policy. Note that yield and revenue policies do not cover the same thing and, for a given coverage level, do not provide the policyholder the same amount of insurance (and hence, would not cost the same amount in terms of the premium paid for the policy). For example, suppose we have identical producers A and B, each with 100 acres of corn, each facing an expected future price of $6/bushel-and $6/bushel was also the average price received over the past several years-and both A and B each have an expected yield of 100 bushels per acre. This means that the expected revenue for A and B comes to 100 acres*100 bushels per acre*$6 per bushel = $60,000. Let A obtain a yield policy at a coverage level of 65 percent (priced at 100 percent of the futures price which, in this case, is $6 per bushel) while B obtains a revenue policy at a coverage level of 65 percent. Finally, suppose that while nationally, yields turn out to be very high and cause actual prices to drop to $5 per bushel at harvest time, A and B each suffer crop losses amounting to 50 bushels per acre (i.e., each lose half the expected crop). Before insurance, A and B each generate revenue equaling: 100 acres*50 bushels per acre*$5 per bushel = $25,000. Because A took out a yield policy, A is guaranteed to receive compensation on 65 percent of the total expected yield (100 bushels per acre), so A is guaranteed payment on 65 bushels per acre. Because A only generated 50 bushels per acre, A receives indemnities for the remaining 15 bushels per acre (the shortfall) at 100 percent of the expected price. With 100 acres, this amounts to an indemnity payment of 100 acres*15 bushels per acre*$6 per bushel = $9,000. Total revenues for A then equal $34,000. With a revenue policy, B is guaranteed to receive 65 percent of the expected revenue of $60,000, or $39,000. Therefore, the indemnity payment B receives equals $39,000 -$25,000 = $14,000. While A and B each took out 65-percent coverage policies, these policies work differently and, as a result, would be priced differently. The last measure, total liability per acre, provides an estimate of the value of the crops covered by the crop insurance policies. This provides an alternative measure of the quantity of insurance demanded by producers. It differs from total premiums because total premiums take into account the probability of an adverse event that lowers output and/or prices; hence, total premiums are a fraction of total liabilities and, for a given increase in coverage, total premiums rise at different rates than liabilities. As with total premiums per acre, the total liability per acre measure can be negative, despite increased enrollment. Note that these last three measures are intended to capture the intensity of use of crop insurance. Large movements in crop prices can cause these variables to change from year to year while yields tend to trend upwards over time, making it difficult to compare a policy purchased in one year with a policy purchased in a subsequent year. For this reason, these measures, throughout the report and the analysis, are normalized to 2002 prices and yields for the analysis so that if the value of total premiums or liabilities changed over time, it would be due to the underlying changes in the quantity of crop insurance demanded and would not be attributed to price or yield changes. The premiums, premiums per acre, and liabilities per acre were all multiplied by the ratio of 2002 expected revenues to 1997 expected revenues (expected yields are derived from a linear regression of normalized yields from 1966 through 2001 on a time dummy for 2002 and expected prices come from Chicago Board of Trade futures prices for the relevant crop's harvest price at the time of planting for the 2002 crop; similar calculations were used for the 1997 prices and yields). Moreover, once the price and yield movements are taken into account, these last three variables also enable one to compare different insurance policies at different points in time on the same scale-the dollar. While different types of policies certainly have different characteristics (e.g., yield-based policies versus revenue-based policies), actuarially fair pricing allows for direct comparisons among different policy types. Essentially, the different policies are normalized so they can be compared on the same scale (in this case, the dollar or the dollar per acre). This means that, despite the dramatic shift from yield-based policies to revenue-based policies over the timeframe studied, since all policies are priced actuarially fairly, one can use the value of the policies (priced in 2002 dollars) as an accurate measure of the quantity demanded of crop insurance."}, {"section_title": "The Importance of ARPA", "text": "To understand how prices affect the quantity demanded of crop insurance, it is necessary to generate a causal link between prices and demand. First, this necessitates finding variation in prices. With respect to the Federal crop insurance program, by law, the prices are set to maintain actuarial fairness and, as a result, the underlying pricing mechanisms do not change much over time. Correlational studies, such as those that use cross-sections (e.g., examining producers in different States in a single year), have difficulty making this link because all producers face the same underlying prices (adjusted for risk), so the connection between prices and quantity demanded cannot be examined. Therefore, this study exploits the variation in prices due to a change in policy that introduced a price change through subsidization of the total premiums. Second, because this study uses the introduction of the premium subsidies as the source of price variation, it becomes necessary to carefully examine the relationship between the demand for crop insurance and the level of subsidies to determine appropriate causality. For example, if one sees a change in subsidy levels, is this due to the policy change or is it possibly due to a change in demand (since subsidy levels are a function of the level of coverage demanded by the producer) unrelated to the new policy? The change in policy explored for this study stems from the enactment of ARPA, which increased the subsidy rates of crop insurance policies (table 2). As subsidy rates rose, crop insurance became cheaper for producers, with the largest jumps coming at higher levels of coverage. For example, while subsidies increased by 12 percentage points for coverage at 50 percent of yields and 100 percent of prices, it increased by 31 percentage points for coverage at 75 and 80 percent of yields and 100 percent of prices. Although this change took place in 2000, over 10 years ago, it remains the most recent direct, across-the-board change to premium pricing for which data are available. 3 Furthermore, only one other known study (Babcock and Hart, 2005) explores the effects of ARPA subsidy changes on demand for crop insurance, although they do not construct demand elasticities to compare with other studies. Overall, the literature is rather dated, however, and having these elasticities of demand helps are understand the implications of how participation in the Federal crop insurance program changes with changes in the price of enrollment. ARPA represented a policy change that had the potential to affect all producers. Implementation of ARPA enables researchers to examine how crop insurance demand actually changed by measuring the change in quantity demanded in relation to the change in subsidies across the United States. Not surprisingly, the change in quantity demanded varied for different crops and across regions. "}, {"section_title": "Data", "text": "This study uses individual-, county-, and national-level data from various sources: • County-level data on participation in the Federal crop insurance program are used to estimate responses to changes in the price of crop insurance across select States. Participation data come from USDA, Risk Management Agency (RMA) administrative data that cover all individual Federal crop insurance policies taken out by producers. These data provide individual policy-, county-, and national-level information by crop from 1989 through 2012 for variables such as the number of acres insured; the acres of buy-up; the level of total liability insured; the levels of total premiums, Government subsidies, and indemnities paid out; and the types of practices used to grow the insured crops (irrigated or nonirrigated). The individual policy-level data were aggregated to the county level by crop type. All of the regression analyses were based on the countylevel data, while the national-level data were used for descriptive purposes. • USDA, National Agricultural Statistics Service (NASS) surveys (available through NASS's Web-tool \"QuickStats\") provide county-level data on total acres planted from 1989 through 2012 and on crop yields from 1966 through 2002. • NASS's Census of Agriculture, which aims to cover all farms in the United States, provides data used to calculate the acres operated by females within a county, since it has been shown that the gender of the individual matters when it comes to dealing with risk (Halek and Eisenhauer, 2001;Pawlowski et al., 2008;Byrnes et al., 1999). The study focuses on three major crops-corn, soybeans, and wheat-and collects data from a wide array of States in an attempt to both cover the bulk of crop production and explore how the relationship between the quantity demanded of crop insurance and its price differed based on location. For corn, the States covered included several in the Midwest (Illinois, Indiana, Iowa, and Ohio), the Northern Plains (Kansas, Nebraska, and South Dakota), and the Lake States (Michigan, Minnesota, and Wisconsin). In 2002, these were the top 9 corn-producing States and 10 of the top 11, accounting for roughly 78 percent of all U.S. acres planted to corn and approximately 80 percent of all U.S. corn production. For soybeans, the same States were used. These 10 States accounted for more than 70 percent of U.S. acres planted to soybeans and approximately 75 percent of all U.S. soybean production. For wheat, States included several in the Northern Plains (Kansas, Nebraska, North Dakota, and South Dakota) and the Southern Plains (Oklahoma and Texas). Altogether, these represent the top 4 and 6 of the top 10 wheat-producing States in 2002, accounting for roughly 60 percent of all U.S. acres planted to wheat and more than half of total U.S. wheat production."}, {"section_title": "11", "text": "The Changes in subsidies enacted through ARPA appear to have changed the quantity demanded of crop insurance, particularly toward higher levels of coverage (tables 3 and 5). Total premiums and premiums per acre appear to have changed the most when subsidies changed, followed by total liabilities per acre and acres enrolled in buy-up policies. Total acres enrolled tended to remain relatively constant, with some exceptions. This suggests that the subsidies did encourage some increased enrollment, but that larger effects were seen with the intensity-of-use measure of total premiums and total premiums per acre. In other words, the effect seems strongest for those who already were enrolled in crop insurance, as many chose to purchase higher levels of coverage for previously enrolled acres. Although producers on average tended to participate to a greater extent in the crop insurance program following the enactment of ARPA, the degree to which they altered their participation differed across crop types and locations. While some results for the acres enrolled reveal decreases, suggesting that the increased subsidies may have caused growers to participate less in the crop insurance program, the coefficients that were negative were all small (the largest being for the Lake States at -0.40) and not statistically different from zero, suggesting that the increased subsidies did not cause any meaningful decreases in participation."}, {"section_title": "Regional Differences (by Crop and Region)", "text": "Among corn producers, those in the Midwest responded most heavily to the increased subsidies on three of the five measures of crop insurance demand. For these producers, changes in demand for crop insurance caused their total premiums and premiums per acre to increase by almost 1 percent for each 1-percent increase in the subsidy rate (measured as the subsidy per acre enrolled-see appendix A for more details), suggesting that the price of crop insurance mattered to corn producers in the Midwest. If a 1-percent change in prices causes a 1-percent change in demand, the demand is considered \"unit-elastic,\" or relatively responsive to price. If the change in demand is less than 1 percent, the demand is considered \"inelastic,\" or relatively unresponsive to price changes. If the change is more than one, the demand is considered elastic (see box \"Elasticity: A Measure of Responsiveness to Price Changes\"). Given that premiums are set to be actuarially fair, this finding suggests that corn growers in the Midwest increased the quantity demanded for higher levels of coverage when subsidies increased. For these producers, both acre measures also increased the most among the regions examined. Corn producers in the Lake States had a similar premium response to the changes in subsidies, with total premiums increasing by 0.83 percent for a 1-percent change in subsidies per acre and by 0.92 percent for total premiums per acre. While the estimates for the acreage enrollment show a negative sign for total acres and a positive sign for buy-up acres, the coefficients are small-close to zero-and not statistically significantly different from zero, suggesting that the subsidy increase did not encourage growers to enroll previously unenrolled land in the crop insurance program. Northern Plains corn growers exhibited the smallest premium response, although they also had the largest liability-peracre response among the three regions explored. For a 1-percent increase in subsidies per acre, estimated changes in premiums demanded ranged from 0.80 percent in total premiums to 0.75 percent in premiums per acre. Liabilities per acre were statistically significant at 0.25 percent, suggesting small changes in liabilities for a change in subsidies. Changes in acre enrollment remained both close to zero and statistically insignificant, suggesting again that the subsidies did not appear to affect producers' decisions to enroll land in the crop insurance program. The estimated responses of soybean growers generally mirrored those of corn growers but were not as large. As these individuals are typically the same people (corn and soybeans are a common crop rotation), the general consistency of results lends credence to the model. Results suggest larger differences for the Northern Plains region, which showed estimated changes in demand close to 0.5 percent in the two measures of premiums for a 1-percent increase in subsidies. Again, however, the estimates for acres enrolled in the Northern Plains remained relatively small and were not statistically different from zero. Finally, for wheat producers in the Northern and Southern Plains States, total premiums rose by 0.74 and 0.91 percent for a 1-percent increase in subsidies per acre, respectively. Total premiums per acre also increased by 0.79 percent (Northern Plains) and 0.97 percent (Southern Plains), while liabilities per acre differed between the two regions, increasing by roughly 0.27 percent for a 1-percent increase in subsidies per acre for the Northern Plains and showing positive, but small and statistically insignificant coefficients for the Southern Plains. Once again, none of the coefficients for acres enrolled (for both total acres and buy-up acres) were statistically different from zero, suggesting their ranges varied rather widely, with three of the four showing positive but small coefficients. Overall, the elasticities were lowest for wheat producers and also for those States in the Northern Plains. These States traditionally had the highest share of acres enrolled (the number of acres enrolled divided by the number of acres planted to the three crops) to begin with, so producers in these States may have already been hitting the upper bound of acreage (and crop insurance in general) enrollment. Interestingly, not only did these States (primarily Kansas, Nebraska, and the Dakotas) traditionally have among the highest share of acres enrolled, they maintained their standing as leaders in enrollment (fig. 1 and table 1). At the regional level, the estimates appear to track more or less with previous studies (see table 4 for comparison of results), although this study contains a wider range of dependent variables to obtain a more precise understanding of how the demand for crop insurance changes when the price of crop insurance changes (in particular, introducing the premiums and premiums-per-acre measures of intensity of use not used in prior studies). In other words, the acreage-enrolled measures generated in this study produced very similar results to those of previous studies, suggesting that the crop insurance premiums do not have a large effect on acreage enrollment. However, given that the subsidy changes through ARPA were largest for the higher levels of crop insurance coverage, it is not surprising that the effects were greater for the measures aimed at capturing the intensity of use of crop insurance-primarily the premium measures."}, {"section_title": "Overall Responsiveness", "text": "Producers in different locations growing different crops vary in their response to the post-ARPA change in subsidies. Even when looking at results for a particular crop, location appears to account for differences in the quantity of crop insurance demanded across regions. However, despite this variation in responses across regions, an overall assessment of the Federal crop insurance program would explore the responsiveness to subsidy changes for each crop for the United States as a whole. While this analysis can only extrapolate to the entire United States because it does not include data on all States with production of the relevant crops, it does include data on most of the major corn-,"}, {"section_title": "Elasticity: A Measure of Responsiveness", "text": "Economists use the term \"elasticity\" to describe the responsiveness of one variable to a change in another. In this study, elasticity measures the percent change in the demand for crop insurance that would be induced by a 1-percent change in the premium subsidy. While elasticity can take any value, positive or negative, the values 1 and (-1) are of particular importance as benchmarks. If an elasticity lies above 1 (below (-1)), a 1-percent increase in the independent variable (here, subsidy) will cause a greater-than-1-percent rise (decrease) in the outcome variable (demand for crop insurance). In these cases, the demand would be characterized as \"elastic,\" or responsive to prices. If the elasticity lies between (-1) and 1, demand is said to be \"inelastic,\" or relatively unresponsive to price changes-a 1-percent change in the subsidies would induce a smaller-than-1-percent change in demand. An elasticity of 0 would imply that subsidies have no effect on the demand for crop insurance. At the values (-1) and 1, demand is said to be \"unit elastic\"where a 1-percent change in the premium subsidy would induce a 1-percent change in demand for crop insurance. soybean-, and wheat-producing States. This allows for an examination of the level of responsiveness to price changes in these major States (table 5)-while the unit of analysis remains the same as before-at the county level. Studies are grouped by crop. Different studies used different measures of crop insurance demand as dependent variables-which can greatly alter the results. The type of dependent variable is in parentheses. For example, an estimated price elasticity of demand of -0.32 (acreage) means that for a 1-percent increase in the price of crop insurance, the number of acres insured drops by -0.32 percent. The current study results are in italics for ease of comparison. Note that in the report, the results are positive elasticities-reflecting that they are based on the change in subsidies (so as subsidies increase, the price falls, and demand increases). These are changed to negative elasticities, assuming that an elasticity of X based on an increase in subsidy would be identical to an elasticity of (-X) based on an increase in the price-exclusively for comparison purposes to the results found in the literature. Source: USDA, Economic Research Service. Examining all the States included in the study together (as opposed to separately by region), total premiums and premiums per acre for corn and soybeans increased 0.86 percent and 0.75 percent, respectively, for a 1-percent change in subsidies per acre. For wheat, total premiums increased by 0.64 percent and total premiums per acre increased by 0.81 percent for a 1-percent change. While not considered very responsive (elastic), changes in the subsidies clearly affected demand for crop insurance as measured by the premium variables. Overall, it appears that changes in total liabilities per acre for all crops were modest in response to subsidy increases, ranging from 0.19 to 0.32 percent. For enrolled acres (total and buy-up only), all six measures for the three crops were below 0.20 percent in absolute value, while none of the six were considered statistically different from zero. This finding suggests that, by and large, the changes in subsidies did not cause farmers to change the amount of land enrolled in the crop insurance program at the national level. Together, the results suggest that the increase in subsidies appeared to cause an increase in the level of participation in crop insurance, most notably by causing an increase in total premiums and premiums per acre. Total liabilities appeared to increase slightly, while acres enrolled (both total and buy-up) were effectively nonresponsive to changes in subsidies. Producers appeared to react to the subsidies primarily by purchasing higher levels of coverage. 4"}, {"section_title": "Implications", "text": "The Federal crop insurance program has grown considerably over the last 20 years, pushing the program into the spotlight as one of the main tools available to farmers for managing risk. As crop insurance grows, so do the costs, with premium subsidies being one of the major components required to fund the program. While Congress did not choose to make any cuts to the program in the 2014 Farm Act, several cuts were proposed, and information on how such cuts could affect program participation and the future of the program itself may help inform future budgetary discussions. Responses to post-ARPA subsidy changes can be used to show how levels of total premiums, premiums and liabilities per acre, and acres enrolled in 2012 might change if subsidy rates changed by 1 percent and 5 percent (table 6). For example, if a 1-percent cut in subsidies was instituted, corn producers in the major cornproducing States would demand $37 million less in total premiums in 2012, or a drop of about $0.50 per acre in premiums and $1.50 per acre in liabilities. Results suggest that corn producers would also drop coverage for 81,000 acres in total, while demand for buy-up policies would decrease by 140,000 acres (some of these acres would appear to be shifted from buy-up coverage to CAT policies). In other words, if crop insurance prices were to increase, producers would demand fewer policies at the higher levels of coverage. However, to put this in perspective, these seemingly large changes would be relatively small compared with total demand. For example, total premiums for corn producers totaled over $4 billion in 2012, while total liabilities exceeded $53 billion. 4 While this study does not find large impacts on the total acreage enrolled due to changes in the premium subsidies, these subsidies have the potential to cause land-use changes that may have environmental consequences. Lubowski et al. (2006) explored the 1994 increase in subsidies through the enactment of the Federal Crop Insurance Reform Act and found that a change in crop insurance returns was positively related to the likelihood that land transitioned to cultivated cropland from another use-and that the land going into cultivation is disproportionately from low-productivity and environmentally sensitive land. Claassen et al. (2011) explored the years 1998-2007 and found that crop insurance induced an increase in cropland acreage of roughly 1 percent, which would otherwise have been used as grassland (hay, pasture, and range)."}, {"section_title": "16", "text": "The Effects of Premium Subsidies on Demand for Crop Insurance, ERR-169 Predicted changes to total crop insurance demand due to hypothetical changes to total premium subsidies, evaluated at 2012 levels Note that these estimates are roughly linear in nature in a neighborhood around the measures of participation, so a 5-percent change in subsidies would have roughly five times the change in crop insurance participation as would a 1-percent change in subsidies. However, due to the nonlinearities in the log-log specification, these estimates only hold for relatively small neighborhoods around the values being examined. For example, while we would be relatively confident in our estimate of a 1-or 5-percent cut, or even a 10-percent cut, as the size of the cut continues to grow, we would have less confidence in our estimates. *** = Estimates are based on regression results that showed 99 percent significance / p-value of 0.01. Source: USDA, Economic Research Service using data from USDA, Risk Management Agency, Summary of Business. These values can change over time as they are continually updated. Numbers are current as of November 25, 2013. Soybean producers would exhibit a slightly smaller response to a 1-percent cut in subsidies in 2012 than corn producers, demanding $17 million less in total premiums, or a drop of $0.28 per acre in premiums. In the same scenario, total liabilities per acre would decrease by $0.75 per acre. Soybean farmers would appear to increase total acres enrolled by 13,000 while buy-up levels would increase by 117,000-both relatively small (and statistically insignificant) amounts given the magnitude of the program. The responses of wheat producers tended to be the lowest. If subsidies were cut by 1 percent, wheat growers would demand $11 million less in total premiums in 2012, or a drop of $0.31 per acre, while total liabilities would decrease by $0.73 per acre. Wheat growers would also increase the number of acres enrolled by 69,000 while decreasing the number of buy-up by 44,000, suggesting a modest shift in wheat acre enrollment from buy-up to CAT with increased subsidies. Across the Nation, the overall demand for crop insurance measured by total premiums or premiums per acre appear to remain close to or below a 1-percent change in the quantity demanded for a 1-percent decrease in the subsidy structure. The two premium measures show the greatest response to changes in subsidies, followed by liabilities per acre and acres enrolled. Estimated responses suggest that, both crop and region appear to affect the level of change in demand. While the responses of corn and soybean growers would tend to be similar within a region, they may vary significantly across regions. Producers in the Northern Plains appear to show a smaller response to changes in subsidies for corn and soybeans than producers in the Midwest. Northern Plains This is not an easy question to answer. There have not been large changes to the subsidy structure in recent years that allow one to examine this phenomenon carefully with more recent data. And, farmers face a different policy and market environment today than they did in 2000. In 2000, producers operated under the 1996 Farm Act, which contained a large number of programs to support crop producers; crop insurance, while a growing program, still played only a minor role in the set of risk management tools available to producers. Today, many of the support programs have been reduced or eliminated, and much of the focus is being placed directly on the crop insurance program. For example, in 2012, when 84 percent of U.S. cropland was covered by crop insurance policies, Congress did not deliver any ad hoc disaster assistance legislation to support farmers despite the major drought. In contrast, in 2000, roughly 60 percent of all acres planted were covered with crop insurance, and producers covered less than half of all acres planted with buy-up coverage. Producers today rely more heavily on the crop insurance program than they have at any time in the past. If other substitutes for crop insurance (such as ad hoc legislation) were to disappear, farmers may have to rely even more heavily on crop insurance as other options would be unavailable. In this scenario, price changes would be less likely to affect the behavior of growers and it could be that these results represent an upper bound of the responsiveness of producers to changes in crop insurance prices. If so, then small changes in premium subsidies likely will not have major impacts on producer demand for crop insurance coverage, and it could take relatively large changes in premium subsidies to affect growers' behavior significantly. The model used in this study aims to explore the relationship between crop insurance demand and the price of crop insurance. Since the price of crop insurance is reduced by the amount of the subsidy, as the subsidy increases, the price of crop insurance that the farmer pays decreases. This model therefore focuses on how changes in the level of the subsidy affect the demand for crop insurance."}, {"section_title": "The Regression Model", "text": "A separate regression is estimated for each crop and region that examines changes over time using two periods, one before the 2000 introduction of ARPA using 1997 data and one after ARPA, using 2002 data. For each crop-State combination, the model relates the change in a measure of crop insurance demand, ΔY c , for county c to a set of variables including ΔS c that measures the change in subsidy, a set of county-specific time-varying controls, and a set of regional-fixed effect controls described below. (1) ΔY c represents the change in crop insurance demand from 1997 to 2002, measured one of five ways: total premiums, total premiums per acre, total liabilities per acre, total acres enrolled in crop insurance, and total acres enrolled in buy-up crop insurance policies (i.e., any policy that is not catastrophic coverage). ΔS c denotes the change in subsidies brought about by ARPA. This is measured as total subsidies divided by total enrolled acres to get a county average per-acre subsidy rate for both 1997 and 2002, which is then differenced. Both of these sets of variables are first logged and then differenced, meaning that the coefficient on ΔS c can be interpreted as an elasticity. ΔX c contains controls that vary over time, including the lagged change in the number of acres of a particular crop in the county and the number of acres run by female operators, the 1-year lagged change in the ratio of yield policies to revenue policies, the change in a 3-year measure of lagged returns to crop insurance measured as total indemnities divided by total premiums paid by the farmer, all in 2002 dollars, and the difference in a 1-year lagged, actual-versus-expected revenue, differenced over time. These last two sets of variables are designed to capture the general state of affairs in the years (or year) leading up to the period examined. For example, if the returns to crop insurance increased in the years leading up to 2002 (relative to how the returns moved in the years leading up to 1997), producers may view crop insurance more favorably in 2002 and may be more likely to enroll in crop insurance in 2002 versus in 1997 (and vice versa). Similarly, how producers fared in 2001 versus 1997 may affect crop insurance enrollment in 2002 versus 1997. For example, suppose producers experienced losses in both 1996 and 2001. This suggests that the actual revenues in both years lay below the expected revenues. If the difference between actual and expected revenues was greater in 2001 than in 1996, one might expect more producers to enroll in crop insurance in 2002 than in 1997 simply because they experienced higher losses in 2001 than in 1997. Finally, to explore any changes to the yield distribution, the study uses county-level yield data and detrends it and normalizes it to a base year 's yield (in this case, 2002) for each of the relevant crops. This allows the yields to be compared over time and viewed as a distribution of yields for each year examined (in this case, the lagged years of 1996 and 2001). The mean and variance of these yield As mentioned earlier in the report, producers have traditionally had a large number of alternative methods to deal with risk, including various congressionally legislated programs, which might affect producers' willingness to consume crop insurance. However, this study explores a timeframe that falls within the framework of a single farm bill, meaning these programs do not change over the span of the study and therefore do not need to be included in the analysis. This reasoning also holds for the ad hoc disaster assistance that was typically provided by Congress to producers when largescale crop losses occurred. The probability of receiving ad hoc disaster assistance did not change over this timeframe, so it, too, would drop out of the analysis and therefore was not included."}, {"section_title": "Endogeneity Concerns", "text": "Using the change in average subsidies per acre at the county level from 1996 to 2002 poses a problem because this subsidy rate is defined in part by the policy the producer chooses to select. In other words, it is endogenous and this variable likely will be correlated with the error term, resulting in biased coefficient estimates. Furthermore, it is not clear from this specification how causation runs. It could be the case that the producer chooses a particular quantity of insurance to consume, which drives the level of subsidy the producer receives, or it could be that the change in subsidy rates causes the producer to consume a different level of insurance. To ameliorate this concern, the study adopts an instrumental variables (IV) approach. Instrumenting the change in subsidies from 1997 to 2002 with the change in subsidies from 1996 to 2001 allows one to both deal with the endogeneity problem as well as provide a clear path of causation. By the time the decision needs to be made to purchase crops for crop year 2002, the decision has obviously already been made for the past (2001) crop year. Therefore, the decision for the 2001 crop year, and its change from 5 years previous (1996), can be considered exogenous to the decision about the quantity demanded of crop insurance in 2002. Furthermore, it is not likely that producers make the quantity of crop insurance enrollment based on their previous years' enrollment. While past decisions may influence current decisions to some extent, it seems much more likely that current planting decisions play a much greater role than past planting decisions. The crop type and number of acres planted, as well as expectations of the market and the climate, and the grower's current financial status will likely play a much larger role in determining the participation level in the crop insurance program than past levels of involvement. Hence, this procedure allows one to address both the endogeneity and the causation concerns simultaneously."}, {"section_title": "21", "text": "The generates normalized yield observations for each county, allowing one to calculate a separate mean and variance for crop yields for each county. Distributions are constructed for both 1996 and 2001, and means and variances are constructed for each of these lagged years. They are then differenced to provide a change in the mean and variance of the detrended, normalized county-level yields. The 3-year returns to crop insurance variable was constructed by dividing the indemnities by the premium paid by the producer for each insurance plan for the relevant crop and summing them together, weighted by their share of total acres enrolled in each plan. This is done for each of the 3 years preceding 1997 and 2002 (e.g., for 1997, the years 1996, 1995, and 1994 were used). The returns for the 3 years were then averaged to obtain two, 3-year average returns to crop insurance for each crop in each State (one for the years leading up to 1997; a second for the years leading up to 2002). These were then differenced and used in the regression. If a producer experienced a loss in the year prior to that examined, he or she may be more inclined to enroll in crop insurance in the following year. To observe this over time, if a farmer fared worse in 2001 relative to 1996, he or she might find crop insurance more attractive in 2001 than in 1997. Therefore, to construct such a variable, the actual and expected revenues were calculated for 1996 and 2001. Actual revenues were generated using NASS price and yield data. Expected revenues were generated using the predicted yields from the detrending linear regression process discussed earlier and national level futures commodity prices (assuming away basis differences between counties). After the actual and expected revenues for 1996 and 2001 were constructed, they were differenced. The difference is the gain/loss for the year. The resulting gain/loss for 1996 was then subtracted from that of 2001 to obtain a measure of relative gain/loss over time. The crop insurance ratio used in the analysis was constructed using RMA data from the Summary of Business. The total premiums of all yield policies were summed up and divided by the total level of the sum of all yield policy and revenue policy premiums. Finally, when running the regressions, if a county had a change in total premiums per acre, change in total liabilities per acre, or a change in total insured acres that fell outside of four standard deviations from the mean of those variables, the observation (county) was omitted from the analysis. Results were also run (but not reportedavailable upon request) without omitting any variables, and results remained very similar. The 2SLS (Two-Stage Least Squares) results were derived using SAS's \"proc syslin.\" The main results of the report are shown in tables 3-5, while more detailed results for Midwest corn are shown in appendix B. Note that an argument can be made to use 3SLS, a procedure that takes into account the correlation structure among the errors of the equations to improve estimator efficiency. However, in this case, because the set of equations is just identified (i.e., the number of instruments equals the number of excluded variables), 2SLS and 3SLS return identical results. Table B3 provides the results for OLS (Ordinary Least Squares) and 2SLS, both with and without crop reporting district (CRD) fixed effects. These specifications use the dependent variable \"change in the log of premiums.\" Table B3 takes the final 2SLS specification (with fixed effects) and shows the results for all five measures of crop insurance demand used in the study. Results in tables B2 and B3 were generated using SAS's procedures \"reg\" (for the OLS runs) and \"syslin\" (for the 2SLS runs). These results should show how the regression was run and what the results look like. Results for any particular crop-region combination (or for all of them if desired) are available upon request. OLS does not control for the endogeneity of the subsidy-per-acre variable being used (recall that the level of coverage selected will determine the level of subsidy). The 2SLS approach should ameliorate this issue. Recall that the county-level differenced equation causes counties to be compared with themselves over time. The CRD fixed effects force comparisons of these county differences to be restricted among counties within the CRD to make comparisons among counties more similar to each other rather than simply averaging the effect across all counties regardless of location."}, {"section_title": "24", "text": "The   , 1997, 2001, and 2002USDA, National Agricultural Statistics Service, QuickStats, 1996 and2001;andUSDA, National Agricultural Statistics Service, Census of Agriculture, 1997 and2002. Note that controlling for the yield variance was important. Also, the signs on many of the variables are as expected-positive for the number of acres planted (more acres planted means more potential acres to insure), positive for the 3-year return on insurance (if returns are higher, more growers participate), positive for female-operated acres (females tend to be more risk averse than males, suggesting they would be more likely to participate in the crop insurance program), negative for change in mean yields (if yields increase, farmers rely less heavily on crop insurance), and positive for change in yield variance (if yields become more variable, suggesting more risky, growers require more crop insurance). The difference in actual versus expected revenue was consistently negative (if expected was higher than actual, more producers might feel the need to insure for the next period)."}, {"section_title": "25", "text": "The   Source: USDA, Economic Research Service using data from USDA, Risk Management Agency, Summary of Business, 1996Business, , 1997Business, , 2001Business, , and 2002USDA, National Agricultural Statistics Service, QuickStats, 1996 and2001;USDA, National Agricultural Statistics Service, Census of Agriculture, 1997 and2002. "}]