[{"section_title": "Abstract", "text": "Better ways to manage preoperative, intraoperative and postoperative care of surgical patients is the bailiwick of anesthesiologists. Although we care for patients of all ages, protecting the cognitive capacity of elderly patients more frequently requires procedures and practices that go beyond routine care for nonelderly adults. This narrative review will consider current understanding of the reasons that elderly patients need enhanced care, and recommendations for that care based on established and recent empirical research. In that latter regard, unless and until we are able to classify anesthetic neurotoxicity as a rare complication, the first-do-no-harm approach should: (1) add anesthesia to surgical intervention on the physiological cost side of the cost/benefit ratio when making decisions about whether and when to proceed with surgery; (2) minimize anesthetic depth and periods of electroencephalographic suppression;\n(3) limit the duration of continuous anesthesia whenever possible; (4) consider the possibility that regional anesthesia with deep sedation may be as neurotoxic as general anesthesia; and (5) when feasible, use regional anesthesia with light or no sedation."}, {"section_title": "", "text": "T he assumption that anesthetics and sedatives are entirely reversible neurotoxins is probably true for most patients between 3 and 60 years old. However, seniors are at greater risk because systems that once enabled full recovery have diminishing capacity. The older brain has less cognitive reserve-less resilience to neurological challenges. Oxidative phosphorylation does not work as well. We acquire mutations that can alter outcomes. We accumulate proteins with prion-like domains. 1 Genetic alleles that were silent when we were young manifest themselves as we age, and we face free radical buildup with reduced levels of scavengers. All these dreary realities probably contribute to Kline et al's 2 finding that \"Elderly subjects after surgery experienced an increased rate of brain atrophy\" and, as found by Silbert et al, 3 subjects with mild cognitive impairment suffered greater deleterious cognitive effects after surgery and anesthesia."}, {"section_title": "POSTOPERATIVE COGNITIVE DYSFUNCTION AFTER NONCARDIAC SURGERY", "text": "In 1955, Bedford 4 published \"Adverse cerebral effects of anaesthesia on old people.\" He reviewed 1193 patients over 50 years of age who had received general anesthesia. Mental deterioration in 10% of patients appeared to be long-term or permanent-a figure that concurs with subsequent findings. Bedford concluded that cognitive decline is related to anesthetic agents and hypotension. He recommended that \"Operations on elderly people should be confined to unequivocally necessary cases\" and that \"postoperative medication should not be a routine matter.\" The next major study to report postoperative cognitive dysfunction (POCD) skips ahead 43 years to 1998-the first International Study of Postoperative Cognitive Dysfunction (ISPOCD). 5 In noncardiac patients more than 59 years old, the incidence of cognitive dysfunction 1 week after surgery was 22% higher than in agematched controls and 7% higher 3 months after surgery (P < 0.004 for both) with 10% of patients evidencing POCD. So the ISPOCD results echoed Bedford's finding at a longer postoperative interval. Increasing age, duration of anesthesia, lesser education, a second operation, postoperative infection, and respiratory complications were risk factors for early POCD. However, under a circumstance of significantly reduced statistical power owing to a 22% loss of follow-up at 3 months, among the risk factors that were significant in the early postoperative period, only age remained statistically significant.\nMonk et al 6 found that 12.7% of elderly (older than 59 y old) noncardiac patients had POCD 3 months after surgery-again within a narrow confidence interval around Bedford's 1955 report. Corroborating earlier work, 7 Monk's study also found a substantial relationship between POCD and death within 1 year of surgery. Independent risk factors for sustained POCD included greater age, less education, POCD at hospital discharge, and a history of stroke without apparent residual damage. Notably, Monk and colleagues' 2008 study did not find duration of anesthesia to be a risk factor. However, the risk of a false-negative conclusion is high in that regard, because the sample size of elderly patients at the 3-month measurement was even smaller (308 with 39 POCD patients 6 ) than in the ISPOCD study (901 with 91 POCD patients 5 ). The longest follow-up study of POCD patients (median = 8.5 y) was published by the ISPOCD group in 2009: \"Cognitive dysfunction after noncardiac surgery was associated with increased mortality, risk of leaving the labor market prematurely, and dependency on social transfer payments.\" 8"}, {"section_title": "POSTOPERATIVE COGNITIVE DYSFUNCTION AFTER CARDIAC SURGERY", "text": "Newman and colleagues found POCD in 53% of coronary artery bypass graft (CABG) patients at discharge and in 36% of patients 6 weeks later. That proportion went down to 24% six months after surgery, but came back up to 42% five years after surgery-a pattern of early improvement followed by subsequent decline that was predicted by POCD at discharge. 9 Evered et al 10 subsequently found strong associations between POCD at 12 months after CABG surgery and death within 10 years, and a dramatically increased incidence of dementia 7.5 years after CABG surgery.\nThe factors that cause decline in cognitive capacity among non-CABG patients also affect CABG patients. However, some of those potential risk factors, like duration of exposure to anesthetics, can be masked by damage done to CABG patients from increased liability to cerebral emboli, cerebral ischemia during reperfusion, and overwarming after bypass. 11 In this regard, Hofland et al's 12 finding that xenon anesthesia reduces cardiac troponin release after CABG surgery adds incentive to further explore xenon's protective attributes. 13 "}, {"section_title": "AGGRAVATING FACTORS", "text": ""}, {"section_title": "On-pump Versus Off-pump", "text": "Does on-pump versus off-pump bypass make a neurocognitive difference? Several trials failed to detect a neurocognitive advantage for off-pump patients. [14] [15] [16] Although Shroyer et al 14 did not find a statistically significant difference across their composite test battery, they did find a significant difference on one important test in favor of off-pump bypass, suggesting the possibility of a false-negative conclusion. The 1-year follow-up from both the CABG Off or On Pump Revascularization Study (CORONARY) 15 and the German Off-Pump Coronary Artery Bypass Grafting in Elderly Patients study 16 failed to find a statistically significant advantage of off-pump bypass. Statistical significance aside, both investigations found a lower incidence of stroke in off-pump patients, and a meta-analysis of 100 investigations covering 19,192 patients by Kowalewski et al 17 found a 28% reduction in stroke for off-pump bypass (P < 0.009). So we are left wondering how patients who experience more strokes (on-pump patients) did not evidence statistically significantly worse neurocognitive outcome. One reason is that in the CORONARY study, some surgeons took the liberty of performing off-pump surgery on 102 patients who had been randomly assigned to on-pump surgery because those patients had calcification of the aorta. In the intention-to-treat analysis, those patients' results were analyzed as if they had on-pump surgery. 18 These profound protocol violations were accompanied by patient-selected, as distinct from randomly selected, inclusion in neurocognitive testing. 15 We have argued that intention-to-treat analysis should always be accompanied by per-protocol analysis, 19 and calculating a \"P\"-value for nonrandom samples makes no sense. 20 In this case, \"absence of evidence is not evidence of absence,\" 21 and unless strokes do not have neurocognitive consequences (as distinct from detected neurocognitive consequences), our appraisal is that the CORONARY study should be disregarded.\nPuskas and colleagues found that \"After a mean of 7.5 years of follow-up, patients under-going off-pump coronary artery bypass performed better than those undergoing (on-pump) cardiopulmonary bypass in several neuropsychological domains.\" 22 In what amounts to a serendipitous positive-control study, Li and colleagues found that preconditioning with hyperbaric oxygen (HBO) reduced markers of cerebral injury in patients undergoing on-pump bypass but not in patients having off-pump bypass, reasoning that \"the protective effects of HBO preconditioning may only manifest when there is a relatively severe injury, such as an on-pump procedure and not in off-pump CABG surgery patients.\" 23 Subsequently, Brewer and coauthors found more postoperative complications, including permanent strokes, in 3898 on-pump patients who were baseline-matched to 3898 off-pump patients. 24 More recently, Kok et al's 25 prospective study found substantially less POCD 3 months after CABG surgery in patients randomized to off-pump bypass. The primary mechanism for these differences is almost certainly the several-fold increase in cerebral microemboli found in on-pump patients, which correlates with \"a significant relative reduction in prefrontal activation.\" 26 Less direct evidence came from a study of > 16,000 patients in whom a greater incidence of delirium occurred after on-pump cardiopulmonary bypass, with duration of surgery (and so anesthesia) as a significant risk factor. 27 Although those patients were not followed up for POCD, Girard et al 28 found that in \"mechanically ventilated medical intensive care unit patients, duration of delirium (which is potentially modifiable) was independently associated with long-term [12 mo] cognitive impairment\" and Morandi et al 29 found that \"delirium duration in the intensive care unit was associated with white matter disruption at both discharge and 3 months later, with worse cognitive scores up to 12 months after discharge.\" In a prospective study of 225 CABG patients, Saczynski et al 30 found that \"Delirium is associated with a significant decline in cognitive ability during the first year after cardiac surgery,\" and in 263 Alzheimer disease (AD) patients, Gross et al 31 concluded that \"Delirium is highly prevalent among persons with AD who are hospitalized and is associated with an increased rate of cognitive deterioration that is maintained for up to 5 years.\" Neufeld et al 32 found that postoperative delirium in the postanesthesia care unit \"is associated with subsequent delirium on the ward … with a decline in cognitive function and increased institutionalization at hospital discharge.\" Mangusan et al 33 also found that \"Patients with postoperative delirium had significantly longer stays … and greater prevalence of falls … than did patients without delirium. Patients with delirium also had a significantly greater likelihood for discharge to a nursing facility … and need for home health services if discharged to home and a significantly higher need for inpatient physical therapy [all P < 0.001].\"\nIn 560 patients age 70 or more without dementia who underwent major surgery, Inouye et al 34 found that cognitive decline was accelerated among patients who suffered postoperative delirium versus those without delirium. Although Daiello et al 35 recently concluded that \"Postoperative delirium and postoperative cognitive dysfunction may be distinct manifestations of perioperative neurocognitive deficits,\" as described in the limitations paragraph of their publication, \"our negative findings were attributable in part to insufficient sample sizes.\" Between that statistical power concern, 21 inserting of much \"imputed data,\" a brief follow-up period, and admission that their retrospective study \"was not designed to investigate associations between postoperative delirium, our construct of postoperative cognitive dysfunction, and long-term cognitive recovery,\" Daiello and colleagues conclusion remains trumped by Inouye et al's 34 finding from the same database, that \"… described the long-term consequences of postoperative delirium in the Successful Aging after Elective Surgery cohort and found that delirium was associated with a 2.8-fold increase in the rate of cognitive decline over three years.\" 35 That finding was recently supported by Sprung et al's 36 finding that \"Elderly patients who have not been diagnosed with MCI [mild cognitive impairment] or dementia [N = 1667] but experience POD [postoperative delirium] are more likely to be diagnosed subsequently with MCI or dementia.\" Royse et al 37 found that patients who experienced delirium after cardiac surgery were less likely to recover cognitive capacity 6 months postoperatively with that finding recently extended by Brown et al 38 in reference to processing speed (an important basic resource of intelligence 39 ) 1 year postoperatively.\nPerhaps most telling, Vasunilashorn et al 40 recently found a dose-response curve between delirium severity and rate of cognitive decline on serial neuropsychological testing administered over three years. Clearly, a relationship between depression, sedation, delirium, poor neurological outcome, and POCD should not be discounted, [27] [28] [29] [30] [31] [32] [33] [34] [36] [37] [38] [39] [40] [41] such that off-pump patients may be at lesser risk for POCD."}, {"section_title": "Inflammation", "text": "Inflammation caused by surgical trauma may also aggravate POCD. 42, 43 Evidence that the association is causal comes from Vom Berg et al's 44 finding that intracerebroventricular delivery of anti-p40, an inhibitor of inflammatory signaling, significantly reduces the concentration of amyloid β (Aβ) and reverses cognitive deficits in aged Alzheimer mice. We know about the upregulation of IL-1, and this in turn can affect anesthetic receptors. The ensuing cascade of events ultimately affects the anesthetic GABA and NMDA receptors and increases production of Aβ … and we know that soluble oligomers of Aβ, even in nondemented patients, associate with cognitive problems. Genetic predispositions are another aggravating factor. Mathew and coauthors have shown the contribution of P-selectin and C-reactive protein alleles to cognitive decline caused by inflammation after cardiac surgery, 45 and a link between the PlA2 allele of platelet GPIIIa with more severe neurocognitive decline after cardiopulmonary bypass. 46 "}, {"section_title": "General Anesthetics", "text": "Are anesthetics aggravating factors? If so, are some more toxic than others? Xie's group found greater cognitive decline 1 week after surgery in patients who received spinal anesthesia with desflurane versus spinal anesthesia with isoflurane or spinal anesthesia alone. 47 Ishii et al 48 found that propofol is associated with less postoperative delirium compared with sevoflurane in elderly patients, and Geng et al 49 found that propofol is associated with less short-term POCD than sevoflurane and isoflurane following laparoscopic cholecystectomy in elderly patients. Examining autopsy brain tissue, Crary and coauthors found that PKMzeta, an atypical protein kinase C isoform, accumulates in the neurofibrillary tangles of Alzheimer patients, but not in control patients. 50 Given the findings of Eckenhoff's group and others, 51-59 one wonders whether anesthetics might increase this tangling in both AD and non-AD patients. Our laboratory is continuing its investigation of the effect of anesthetics on PKMzeta in the adult mouse hippocampus. 60 "}, {"section_title": "Anesthesia and Neurodegenerative Diseases", "text": "Do anesthetics aggravate neurodegenerative diseases? Hydrophobic cavities keep sticky proteins from becoming irreversibly glued together. Unfortunately, molecules of inhalational anesthetics can fill those cavities and reduce the amount of energy required to maintain protein assembly. 51 This anesthesia-facilitated disinhibition of protein binding helps monomers aggregate into oligomers, and if those monomers are Aβ, the resulting oligomerization can lead to protofibrils that are small enough to diffuse into neurons and large enough to be neurotoxic. Soluble Aβ oligomers 52 and alphasynuclein 53 appear to contribute to the neurodegeneration characterized by Alzheimer in the early 20th century. About 14 million Americans are projected to have AD by the middle of the 21st century. Many of them will need to be anesthetized, and many of those will have been anesthetized before they became demented.\nThe role of inhalational anesthetics in the above scenario has been verified in vitro by a decade of work from Eckenhoff and coauthors, 54 and is supported in vivo by mouse models. 55 In addition to the Aβ-anesthesia connection, Xie's group has utilized human neuroglioma cell cultures to add anesthesia-induced apoptosis as a factor contributing to AD, 56, 57 and they have found that isoflurane, but not desflurane, degrades mitochondrial function and impairs learning and memory in mice. 58 Do the rodent and cell culture findings apply to humans? Eckenhoff's group reported that the total-tau/ Aβ (1-42) ratio in cerebrospinal fluid-the only biomarker validated for use in the diagnosis of AD by the Alzheimer Disease Neuroimaging Initiative (ADNI)-elevates during surgery and anesthesia in healthy patients and rises above ADNI's threshold for mild cognitive impairment within 48 hours. 59 In an article entitled \"Coronary artery bypass surgery provokes Alzheimer's disease-like changes in the cerebrospinal fluid,\" Palotás and colleagues found an increased tau/Aβ ratio in patients 6 months after surgery. 61 Early results from retrospective studies on a possible association between anesthetic exposure and AD were unsettling but inconclusive. 62 Now 2 large studies have found substantial evidence. Matching for age and sex, Pin-Liang Chen and coauthors compared 1539 patients who had never been anesthetized to 661 patients who had been anesthetized after age 50. After adjustment for comorbidities, the patients exposed to anesthesia had a nearly 2-fold greater incidence of dementia (P < 0.001). 63 Comparing 5345 patients recently diagnosed with dementia to 21,380 age and sex-matched individuals without dementia, Chia-Wen Chen and colleagues found a substantially higher incidence of anesthesia exposure, in a dose-response relationship, among the demented patients (P < 0.0001). 64 Benzodiazepine use may also be a substantive risk factor with a \"stronger association observed for long-term exposures.\" 65 Of course, surgery involves much more than administration of anesthetics and sedatives, and it is becoming increasingly difficult to rule out iatrogenic transmission of AD, 66 especially during neurosurgery. 67 "}, {"section_title": "POTENTIAL ALLEVIATING FACTORS", "text": ""}, {"section_title": "Deeper Versus Lighter Anesthesia", "text": "Brown et al 68 found that elderly patients with serious comorbidities receiving light sedation (bispectral index [BIS] > 80) during spinal anesthesia for hip surgery had reduced 1-year mortality compared with patients who received deep sedation (BIS≈50). Ancelin et al 69 found that \"Adding sedation to peridural anesthesia led to a decline in verbal secondary memory\" and Sieber et al 70 found that lighter sedation during spine surgery led to less delirium, with the Sieber group's more recent study finding that \"heavier versus lighter sedation levels doubled the risk of delirium\" in patients without comorbidities. 71 Again, there are empirical and neuropathologic reasons to suspect a link between delirium, deep sedation, poor neurological outcome, and POCD. [27] [28] [29] [30] [31] [32] [33] [34] [36] [37] [38] [39] [40] [41] Indeed, presaged by results from a pilot study by Ballard et al, 72 an investigation by the Cognitive Dysfunction after Anesthesia (CODA) Trial of 921 elderly patients undergoing major noncardiac surgery found that patients with a median BIS of 53 experienced less delirium and had less POCD 3 months after surgery than a control group maintained at a median BIS of 36 73 (Table 1 )-a result that accords well with Fritz and coauthors' findings, 74, 75 and meta-analyses by Punjasawadwong et al 76 and MacKenzie et al 77 which support the hypothesis that intraoperative electroencephalogram (EEG) suppression predicts postoperative delirium. As put by Green and colleagues, \"The important point about this trial [the CODA trial] is that the investigators were able to maintain an average BIS of 53 in the intervention group versus 36 in the control group. This not only resulted in a significant decrease in POCD, but also in postoperative delirium, which we acknowledge is a cause of significant postoperative morbidity … As our population ages, we can no longer be complacent about how our intraoperative management may affect postoperative outcome.\" 78 \"BIS-guided anesthesia reduced anesthetic exposure and decreased the risk of POCD at 3 months after surgery. For every 1000 elderly patients undergoing major surgery, anesthetic delivery titrated to a range of BIS between 40 and 60 would prevent 23 patients from POCD and 83 patients from delirium.\" 73 Adaptations are themselves works protected by copyright. So in order to publish this adaptation, authorization must be obtained both from the owner of the copyright in the original work and from the owner of copyright in the translation or adaptation.\nIn sharp contrast to preceding meta-analyses, 76, 77 the Electroencephalography Guidance of Anesthesia to Alleviate Geriatric Syndromes (ENGAGES) Trial concluded that \"electroencephalography-guided anesthetic administration\" does \"not decrease the incidence of postoperative delirium\" 79 -despite presenting data that confound that conclusion. 80 Close examination of the ENGAGES Trial's figure 2 79 reveals that within its usual care group, time spent in EEG suppression was 5-fold greater in patients who experienced delirium (∼48 vs. ∼10 min, n = 594, Fig. 1) , and time spent with BIS < 40 was 2-fold greater in the delirium group (∼100 vs. ∼49 min, n = 575, Fig. 1 ). Given the sample sizes involved, it would be surprising if those median differences are not statistically significant, but calculation would require raw data with statistical significance best assessed by a bootstrapping method, 81 as distinct from Mann-Whitney U tests. 82 Statistical significance aside, absolute differences of that magnitude in the direction of a relationship between EEG suppression and BIS < 40 with delirium, are an objectionable basis for concluding the absence of a relationship. 21 At face value, the EEG data in the ENGAGES's trial's usual care group support, rather than contradict, the Avidan group's earlier finding that \"Intraoperative Electroencephalogram suppression Predicts Postoperative Delirium.\" 72, 73 Maintaining that conclusion while also concluding that \"electroencephalography-guided anesthetic administration\" does \"not decrease the incidence of postoperative delirium\" 77 requires accepting the hypothesis that EEG suppression correlates with delirium while simultaneously accepting the bemusing null hypothesis that low BIS does not correlate with EEG suppression … despite substantial evidence to the contrary 74, 75 and the fact that BIS is derived from EEG.\nIf EEG suppression and BIS < 40 predict delirium, why did the ENGAGES Trial 79 not find a difference in the incidence of delirium between its usual care group and its BIS-guided group? Two factors may have had played a role, the first made evident by data, with the second based on speculation. The data-based factor is that the trial compared groups that received deep versus deeper anesthesia. That is, half of the patients in The ENGAGES Trial's BIS-guided group experienced BIS < 40 for more than half an hour, contrary to the expectation that BIS guidance should reduce the frequency and duration of BIS < 40 to incidental amounts. Severe adverse effects of BIS < 40 have been reported at a threshold of BIS < 40 for as brief as 5 minutes. 81 If there is a threshold effect for an association between low BIS and delirium in patients that \"appear to exhibit a phenotype of anaesthetic sensitivity, which might predispose them to adverse cognitive outcomes,\" 73 with age and comorbidity (both high in the ENGAGES Trial) reducing that threshold to any amount less than half an hour, there would be no difference in the incidence of delirium between a group with median BIS < 40 for 32 minutes and a group with BIS < 40 for 60 minutes (ie, between the ENGAGES Trial's BIS-guided group and its usual care group).\nIn reference to time spent in EEG suppression by patients in The ENGAGES Trial, Ackland and Pryor wrote, \"Previous observational data from the same investigators reported that the duration of electroencephalogram suppression > 4.5 minutes was associated with markedly higher incidence of delirium (∼45% vs. 25% incidence of delirium in individuals with <4.4 min of burst suppression). Moreover, no further increase in incidence of delirium was evident with more than three-fold longer episodes. The ENGAGES 79 intervention reduced the median cumulative time spent with electroencephalogram suppression (7 min in EEG guided vs. 13 min in control group; difference: −6.0; 95% CI: −9.9 to −2.1). However, the duration for both groups in ENGAGES breached the threshold values found previously to be associated with a marked increased risk of delirium. These data suggest that, unless pilot data using the intervention limited burst suppression to <4 minutes, the likelihood of ENGAGES showing a reduction in delirium was quite small.\" 84 Our speculative conjecture is that there is a difference between a bonafide usual care group (a group that is not connected to a BIS monitor) and a group of patients who are connected to a BIS monitor by an anesthesia team that makes sure the monitor is properly calibrated, but then masks the BIS readout so it cannot be seen. That arrangement generates competition between clinical judgment aided by a machine and clinical judgment not aided by a machine. 85 If BIS-blinded clinicians had more than a decade of practice competing against BIS-guided clinicians, [86] [87] [88] [89] [90] [91] [92] it is less surprising to find that the EN-GAGES Trial's BIS-blinded teams achieved almost exactly the same duration of anesthesia (264 vs. 264.5 min), almost exactly the same MAP (79.6 vs. 81.2 mm Hg), and the same number of patients with median cumulative time at MAP < 60 mm Hg (7/618 vs. 7/614) as the trial's BISguided teams. 79 Put differently in an editorial entitled \"Power of Negative Thinking,\" citing Karl Popper, Avidan and Wildes wrote \"As stated by Popper, 'For if we are uncritical we shall always find what we want: we shall look for, and find, confirmations, and we shall look away from, and not see, whatever might be dangerous to our pet theories.'\" 93 Although pet theories are more often satisfied by positive outcomes, when they are satisfied by negative outcomes (outcomes of no difference), Popper's admonition still applies. It is worth noting that in 10 of the ENGAGES Trial's usual care group cases, the anesthesiologists violated protocol by pulling the mask off the BIS monitor so that they, and their patients, could have the benefit of the BIS readout. 79 The ENGAGES CANADA 94 results may provide further insight into these issues.\nThe ENGAGES Trial found that 4 patients in its BIS-guided group died within 30 days of surgery compared with 19 patient deaths in the usual care group 79 (P < 0.0024, 2-way Fisher Exact Test). As noted by Abbott and Pearse, 95 that \"lower 30-day mortality rate observed among the EEG-guided group is intriguing and appears consistent with the findings of the secondary analysis of a 2010 randomized trial 83 … the difference in mortality may plausibly be related to an increased incidence of cardiovascular instability in the usual care group as a result of higher anesthetic doses. Although the reported incidence of intraoperative hypotension duration was similar in each group, patients in the usual care group received significantly higher doses of phenylephrine, indicating a more frequent need to manage episodes of arterial hypotension during the surgical procedure. 79 There is robust evidence to suggest that more episodes of hypotension would lead to an increased incidence of perioperative myocardial injury that might explain the higher mortality rate.\" [96] [97] [98] [99] Indeed, and if clinicians appreciate BIS monitoring as a tool that enhances their clinical judgment, as distinct from worrying that BIS \"may distract from other priorities,\" 79 it would not be surprising to find that their first response to hypotension when not using BIS is to reduce anesthetic dose, instead of iniating vasopressor polypharmacy. As such, even if the only benefit of using processed EEG measurement of anesthetic depth was to train anesthesiologists to avoid hypotension by keeping anesthetic depth on the light side, that would be sufficient justification to encourage its use. The Balanced Anesthesia Study may provide further insight into this issue. 100 Be that as it may, whether the effect of lighter anesthesia is on mortality, morbidity, POCD, and/or delirium, a substantial and growing body of evidence indicates that, ceteris paribus, lighter is better than deeper."}, {"section_title": "Adjuvants, Diet, and Exercise", "text": "What about dexmedetomidine, statins and exercise? Dexmedetomidine has been reported to reduce delirium compared with placebo, midazolam, or propofol sedation; 101 increase survival rate in patients undergoing cardiac surgery; 102 reduce delirium, ventilator time, tachycardia, and hypertension compared to midazolam in critically ill ICU patients; reduce focal neurological dysfunction during mild sedation in patients with supratentorial masses compared with midazolam and propofol; reduce early POCD and serum levels of Aβ and tau protein in orthotopic liver transplant patients; reduce ischemic brain injury, 103 and improve cognitive function and quality of life in elderly noncardiac surgery patients. 104 In contrast to those findings, Shehabi and colleagues did not find reduced mortality in a large sample of critically ill ICU patients sedated primarily with dexmedetomidine. Paradoxically, that study also found higher mortality in patients younger than the median age of the entire sample with lower mortality in patients older than the median age. 105 A current review of dexmedetomidine's benefits and drawbacks for neurosurgical patients is available from Lin et al. 106 Blanco et al 107 found that statin withdrawal increased the incidence of poor outcomes in ischemic stroke patients and retrospective reviews by Flint and colleagues found that statin use during hospitalization for ischemic stroke 108 and after intracerebral hemorrhage 109 is strongly associated with improved survival and discharge disposition, even for patients without prior statin use. Tsivgoulis et al 110 found that statin pre-treatment in patients diagnosed with acute large artery atherosclerosis associates with neurological improvement and reduced stroke recurrence. Using a prospective design, Al-Khaled et al 111 found that statin treatment reduced mortality 3 months after acute ischemic stroke, Zhang et al 112 found enhanced recovery with increased brain-derived neurotrophic factor 2 months after ischemic stroke in patients who received atorvastatin, and Zheng and Chen 113 found that adding the free radical scavenger edaravone to atorvastatin increased recovery 2 weeks poststroke. Lee and Xiang 114 also found promising results for edaravone in cerebral infarction patients treated with ultra-early thrombolysis. Most recently, Mrkobrada et al 115 found that covert stroke after noncardiac surgery is associated with both POD and POCD 1 year after surgery. It follows that if statins reduce the risk of stroke, they reduce the risk of POCD.\nPharmacological and mechanical approaches notwithstanding, perhaps early postoperative mobilization 116 and age-appropriate exercise remains the best all-round regimen for both prevention and treatment of POCD. 117, 118 CONCLUSIONS Reports of adverse effects of anesthetics on elderly patients appeared in 1955, 4 so this problem and some of its potential solutions are not new, but our awareness of them has experienced a renaissance. That awareness has raised a new level of concern for patients over 60 exposed to general anesthesia for more than a brief period of time. Unless and until we are able to classify anesthetic neurotoxicity as a rare complication, the first-do-no-harm approach should: (1) add anesthesia to surgical intervention on the physiological cost side of the cost/benefit ratio when making decisions about whether and when to proceed with surgery; (2) minimize anesthetic depth and periods of EEG suppression; (3) limit the duration of continuous anesthesia whenever possible; (4) consider the possibility that regional anesthesia with deep sedation may be as neurotoxic as general anesthesia; and (5) when feasible, use regional anesthesia with light or no sedation.\nAt the very least, newfound concerns generated by available data should inspire a great deal of translational research. If that research is funded, our guess is that anesthetic, sedative, and adjuvant drugs will soon be ranked according to their safety profile, and augmentation of endogenous processes of repair and regeneration will deliver brain protection and recovery to the young as well as the old. 119 "}]