[{"section_title": "Abstract", "text": "In the present NONA immune longitudinal study, we investigate the previously identified Immune Risk Profile (IRP), defined by an inverted CD4/CD8 ratio and associated with persistent cytomegalovirus infection and increased numbers of CD8+CD28-cells, relative 6-year survival and age in NONA individuals. These subjects have now reached age 92, 96, and for the first time in this study, 100 years at follow-up. A 55 year old middle-aged group was used for comparison.\nImmunological monitoring included the analysis of numbers of lymphocytes and neutrophils, the Tcell subsets CD3+CD4+, CD3+CD8+, CD8+CD28+, CD8+CD28-, and the CD4/CD8 ratio.\nLongitudinal data were analysed by multivariate analyses of variance (MANOVA) from four measurement occasions at 2-year inter-intervals. Oneway ANOVA was used for cross-sectional comparisons at baseline and the 6-year follow-up. The results confirmed the importance of the IRP as a major predictor of mortality in this population of very old. Moreover, the results suggested that survival to the age of 100 years is associated with selection of individuals with an \"inverted\" IRP that was stable across time, i.e. maintenance of a high CD4/CD8 ratio and low numbers of CD8+CD28-cells. The results underlines the importance of a longitudinal study design in dissecting immune parameters predictive of survival and show for the first time that centenarian status is associated with avoidance of the IRP over at least the previous 6 years and probably throughout life."}, {"section_title": "Introduction", "text": "Throughout the 20 th century, a remarkable increase in mean lifespan and possibly also maximum longevity has taken place in humans. A substantial number of centenarians reached the age of 110 already in the 1960s in larger European countries (Jeune, 2002) . Centenarians today have experienced major improvements in their overall health and living conditions, for example a decline in mortality due to cardiovascular diseases at younger ages. The increased numbers of centenarians in recent decades is mainly due to a dramatic decline in the mortality rate among those above 80-years of age (Jeune, 2002) . The rate of mortality due to cardiovascular disease or cancer increases with age from middle age up to about 80 year old and levels off thereafter, whereas the mortality due to infectious disease continue to accelerate also in very late life (reviewed in Pawelec et al., 2006) . The ageing human body is less able to cope with infectious disease probably due to changes in innate and especially adaptive immunity (Delarosa et al., 2006; Solana et al. 2006 ). The immune system may thus be considered decisive for successful ageing and longevity in humans. The present NONA immune longitudinal study examines age-related changes relative to survival across a 6-year follow-up period among very old individuals.\nThere is considerable evidence of age-associated changes in immune capabilities resulting in increased morbidity and mortality due to altered function of the adaptive immune system (Wayne et al., 1990 ).\nAn Immune Risk Profile (IRP), consisting of high CD8, low CD4 numbers, and poor proliferative response to Con A, was initially identified in the Swedish OCTO Immune Longitudinal Study using a cluster analysis approach (Ferguson et al., 1995) . Subsequent work indicated that the IRP could be defined using only the inverted CD4/CD8 ratio, since this sole marker is significantly associated with the IRP (Wikby et al., 1998) . More recent investigations have extended these results to show that cytomegalovirus (CMV) infection has a major impact on the IRP and may in fact be the major driving force behind the accumulation of many of the CD8+CD28-effector cell expansions observed (Olsson et al., 2000; Reker Hadrup et al. 2006) . (Wikby et al, 2002) . Importantly, it was found that the IRP was largely independent of disease status in this sample in which three quarters of the individuals met criteria for compromised health and only 9% conformed to the SENIEUR inclusion criteria for excellent health at baseline (Nilsson et al., 2002) .\nThe aim of the present data analysis at the 6-year follow-up of the NONA immune longitudinal follow-up was to examine the relative importance of the IRP relative to mortality and age. Considering that the oldest cohort had now become centenarians, commonly taken as a paradigm for \"successfully ageing\", we addressed the question of weather the \"successfully aged\" are exceptional in their avoidance of the IRP and show here that the centenarians never entered this at-risk category."}, {"section_title": "Materials and Methods", "text": ""}, {"section_title": "Subjects", "text": "The NONA immune sample was recruited from participants in the NONA Longitudinal Study, in which a population-based sample of oldest-old individuals are investigated with a broad-based battery of tests for health and biobehavioral functioning. The NONA sample was drawn in the municipality of Jönköping, located in South-Central Sweden.\nThe sampling frame of the NONA study was based on available census information in September Subjects were examined in their place of residence by trained Registered Nurses (RNs) having extensive work experience with the elderly. The blood samples were drawn in the morning between 09.00 and 10.00. The health and biobehavioral functioning battery took about 3 hours to administer, including breaks, for individuals who were able to participate in all parts. The battery encompassed an interview, biomedical and behavioural assessments and ratings. The health interview focused on diagnosed illnesses, current symptoms and medications, using a combination of self-reports and medical records. An informant interview was performed in all cases where the individual was unable to participate in full due to compromised health and cognitive ability. The study was approved by the local ethics committee."}, {"section_title": "Preparation of plasma and peripheral blood mononuclear cells", "text": "Plasma was prepared from 40 ml fresh EDTA blood by centrifugation at 2500 rpm for 10 minutes and was removed and stored at -80 °C. Peripheral blood mononuclear cells ( U/ml penicillin and 50 µg/ml streptomycin (Gibco, Stockholm, Sweden). Isolated PBMC counts, differential counts, white blood cell counts, complete blood cell counts and examination of the whole blood were performed as previously described (Wikby et al., 1994) ."}, {"section_title": "Flow cytometric analysis", "text": "Monoclonal antibodies (Mabs), including appropriate isotype controls, were purchased from BD Biosciences (Stockholm, Sweden). The data were acquired using a FACScan (BD Biosciences) and analysed using CELLQuest software (BD Biosciences). The staining protocol for three-colour staining included the CD3Per-CP/CD4FITC/CD8PE and CD3Per-CP/CD8FITC/CD28PE combinations in tubes 4 and 5, respectively. In tube 1 Control IgG1FITC/IgG1PE/IgG1Per-CP was used to create an analysis gate to include lymphocytes in FSC vs SSC and to set the fluorescence quadrant markers on the FL1 versus FL2 to detect the presence of any nonantigen-specific antibody binding (nonspecific staining). In tube 2 CD3 FITC/CD4PE/CD8Per-CP was used to create a gate set on the CD3 positive lymphocyte fraction and to adjust compensation on FL1 versus FL2. Quality control was performed using daily CaliBRITE beads and FACSComp software (BD Biosciences) for setting the photomultiplier tube (PMT) voltages, the fluorescence compensation and checking instrument sensitivity prior to use. Internal quality control was performed to check consistency for CD markers included in more than one tube and resulted in a coefficient of variation of 5-7%."}, {"section_title": "The CD4/CD8 ratio", "text": "CD4/CD8 ratio (numbers of CD4 and CD8 cells) less than 1.00 was used to identify IRP individuals.\nUsing CD4 and CD8 percentages resulted in an identical CD4/CD8 ratio categorisation."}, {"section_title": "Health parameters", "text": "The overall health status of the NONA immune subjects (n=138) indicated that only 13 individuals (9.4%) were rated as \"healthy\" at baseline, according to the European SENIEUR protocol criteria often used in studies of aging and immunology (Nilsson et al., 2003) . Thirty-eight (27.5%) met the criteria for not residing in an institution, not being demented or using medication known to effect the immune system employed in the OCTO Immune Study (Wikby et al., 1994) and here termed \"moderately healthy\". The remaining sample (63.0%) comprised \"frail\" individuals, not meeting the above health criteria (Nilsson et al., 2003) ."}, {"section_title": "Cytomegalovirus (CMV) serology", "text": "Immunoassay (MEIA, ABBOT Scandinavia AB, Sweden) was used to detect anti-CMV immunoglobulin G antibodies. The procedure followed the manufacturer's instruction. Antibody titers of >40 were considered to be positive."}, {"section_title": "Data analysis", "text": "Statistical analyses were conducted using SPSS11. Analysis of variance (ANOVAs) with Tukey's post-hoc tests and Student t-tests were employed for comparisons of independent groups. Correlation analysis was performed using the Pearson correlation coefficient. Longitudinal analysis of numbers of neutrophils, lymphocytes, and subsets of T-cells was done by means of multivariate analyses of variance (MANOVA), repeated measures design."}, {"section_title": "Results", "text": "Cross-sectional data at baseline and 6-year follow-up."}, {"section_title": "Neutrophils, lymphocytes and T-cell subsets by age groups", "text": "The numbers of neutrophils, lymphocytes, T-cells and subsets and the CD4/CD8 ratio were compared between the age groups 55, 92, 96, and 100 years old by one-way ANOVA. At baseline there were significant overall between group differences for the numbers of CD8+CD28-(p<0.01) and CD8+CD28+ (p<0.05) with higher numbers of CD8+CD28-and lower numbers of CD8+CD28+ Tcells in the very old compared with the middle-aged. There were no significant differences between the age groups in very old individuals. Neither were significant differences between the various age groups found for the numbers of neutrophils, lymphocytes, CD3+, CD3+CD4+, CD3+CD8+ cells or the CD4/CD8 ratio (data not shown).\nThe numbers of neutrophils, lymphocytes, T-cells and subsets and the CD4/CD8 ratio were also compared across age groups at the 6-year follow-up (figures 1 and 2). One-way ANOVA showed significant overall between group differences for the numbers of neutrophils (p<0.05), CD3+ (p<0.01), CD3+CD4+ (p<0.01), CD3+CD8+ (p<0.05), CD8+CD28+ (p<0.001), CD8+CD28-(p<0.05) and for the CD4/CD8 ratio (p<0.01). Tukey post-hoc tests showed significantly (p<0.05) higher numbers of neutrophils in the group of 100 years, as compared with the 55 year old group (figure 1a).\nSignificantly lower numbers of CD3+ and CD3+CD4+ T-cells was found for the 96 year old group, compared with the group of middle-aged (figure 1b). The post-hoc test also showed significant differences among all elderly groups and the 55 year old group for CD8+CD28+ with lower numbers of cells among the very old, as compared with the middle-aged (figure 2a). Greater numbers of CD8+CD28-cells were found for the 92 year group as compared with the 55, 96, and 100 year age groups (figure 2a), and the post-hoc test indicated that the mean differences between the 92 and the 100 year old groups approached significance (p=0.07). Higher CD4/CD8 ratio were found for the 96 and 100 year old groups, as compared with the 92 and 55 groups. Post-hoc significances (p<0.05) for the mean differences was obtained comparing the 100 year old group with the 92 year olds and the middle-aged.\nA plot of the number of CD8+CD28-T-cells versus the natural logarithm of the CD4/CD8 ratio at 6-year follow-up is shown in Figure 3 . The figure demonstrates a close negative association between the parameters. It is also seen that a majority of individuals in the youngest 92 year old group indicated lower CD4/CD8 ratios associated with elevated numbers of CD3+CD8+CD28-cells while the majority of individuals in the 96 and 100 year old groups showed higher ratios and lower numbers of CD3+CD8+CD28-cells."}, {"section_title": "Prevalence of CMV carrier status and relationship with T-cell subsets and CD4/CD8 ratio in the old", "text": "One hundred and twenty individuals out of 138 were CMV-IgG positive at baseline. This corresponds to an overall CMV prevalence of 87%, which is significantly higher compared with the prevalence rate of 55% (10 out of 18) found in the middle-aged. At 6-year follow-up the CMV-IgG prevalence was 80.6% (25 out of 31) in the very old compared to a prevalence of 61.1 (11 out of 18) among middleaged (p=0.12). There were no significant differences in the CMV-IgG prevalence among the older age groups, although the centenarian group indicated a lower prevalence of 71.4% (5 out of 7) as compared to the prevalence of 83.3% (20 out of 24) among the 92-96 years olds. There was also a relationship between the prevalence of the CMV carrier and the number of CD8+CD28-cells (59 and 225 cells/µl in CMV-(n=6) and CMV+ individuals (n=25) respectively, p<0.05) and the CD4/CD8 ratio (2.6 and 4.3 in CMV-(n=6) and CMV+ individuals (n=25) respectively, p<0.05) at 6-year follow-up, which was similar to the results found at baseline (no data shown)."}, {"section_title": "Longitudinal data", "text": ""}, {"section_title": "Neutrophils and lymphocytes", "text": "A MANOVA indicated that the numbers of neutrophils were significantly higher (p<0.05) in the groups of very old as compared with the 55 year middle-aged group. The MANOVA also indicated a significant interaction effect between age groups and time, demonstrating a more rapid increase in the levels of neutrophils across time in the very old as compared to the 55 year old middle-aged group (p<0.05) ( Table 2 ). The MANOVA showed no significant effects of group, time or group by time for the number of lymphocytes (Table 2) but there was a tendency for the number of lymphocytes to decrease with time in the 96 and 100 year old groups."}, {"section_title": "CD3+CD4+, CD3+CD8+ and CD4/CD8 ratio", "text": "As shown in table 3 the MANOVA showed no significant effects of group, time or group by time for the number of CD3+CD4+ and CD3+CD8+ T-cells comparing the 55, 92, 96 and 100 year old age groups, although a tendency for the number of CD3+CD4+ cells to decrease with time in the 96 and 100 year old groups was noticed. For the CD4/CD8 ratio there was a significant (p<0.05) effect of age group with the 96 and 100 year groups indicating higher ratio as compared with the 55 and 92 year old groups (Table 3) ."}, {"section_title": "CD8+CD28+ and CD8+CD28-", "text": "The MANOVA indicated significant differences between age groups for CD8+CD28+ (p<0.001) and CD8+CD28-(p<0.05) numbers, with a lower number of CD8+CD28+ cells in the very old age groups as compared with 55 year old middle-aged and a greater number of CD8+CD28-cells for the 92 year old group as compared with the other age groups (Table 4) . Noteworthy, there was a tendency for the number of CD8+CD28-cells to increase over time in the 55 and 92 year old groups and for the number of CD8+CD28+ cells to decrease with time in the 96 and 100 year old groups."}, {"section_title": "Mortality data", "text": "A comparison of the number of neutrophils, lymphocytes, T-cell subsets, CD4/CD8 ratio and relative numbers of very old individuals with a CD4/CD8 ratio less than one using immune data at baseline was made between those who had survived and not survived at 6-year follow-up, see Table 5 . A"}, {"section_title": "Student's t-test indicated significantly greater numbers of neurophils and CD8+CD28-cells in non-", "text": "survivors as compared with survivors. Moreover, the data showed that none of the 22 very old individuals with an inverted CD4/CD8 ratio at baseline had survived at 6-year follow-up (p<0.001).\nDuring the six year longitudinal study, 5 very old individuals developed a CD4/CD8 ratio less than one by increases in the number of CD8+ cells and decreases in the number of CD4+ cells. Of these 4\nwere diseased at 6-year follow-up, leaving only one individual with a CD4/CD8 ratio less than one at 6-year follow-up (data not shown)."}, {"section_title": "Discussion", "text": "This study used a longitudinal design that permitted an examination of age-related changes in a population based sample of very old Swedish people.\nThe initial cross-sectional analysis of data at baseline and the 6-year follow-up demonstrated differences between the very old and middle-aged for the CD8+CD28+ and CD8+CD28-T-cell subsets on both occasions, confirming a loss of CD28 expression with increased age and seen previously in our own and other studies (reviewed in Effros et al, 2004) . At 6-year follow-up, however, significant differences between age groups not seen at baseline appeared in the CD3+, CD3+CD4+, CD3+CD8+ subsets as well as in the CD4/CD8 ratio, results that can be interpreted as real age-related changes in the very old between baseline and 6-year follow-up. However, longitudinal data revealed no significant changes across the six year period in any of the T-cell subsets. These findings support the interpretation that the observed differences in the 6-year cross-sectional mean values result from selective mortality such that subjects alive at follow-up display an immune profile associated with survival. Consequently, individuals surviving until the age of 100 years do not display any T-cell changes associated with the Immune Risk Profile, i.e. they retain low numbers of CD8+CD28-, CD3+CD8+ and CD3+ cells and high CD4/CD8 ratio (Ferguson et al., 1995) , also predominant when these \"successfully aged\" people were younger (Tables 2 and 3 ). The interpretation is further supported by the finding that all individuals in the centenarian group showed CD4/CD8 ratios (range 1.8-6.5, Ln (CD4/CD8) range 0.6-1.9) well separated from the IRP cut-off 1.00, while among ten cases closer to that border (range 0.8-1.6, Ln (CD4/CD8) range -0,2-0.5), nine (including the one single IRP individual) belonged to the youngest age group (92 years old), and one to the 96 year old group (Figure 1) . Finally, the conclusion is supported by the fact that the prevalence of IRP decline from 16% at baseline to 3 % at 6-year follow-up, when individuals in the NONA sample had become 95 years old on average.\nAlthough the longitudinal data did indicate no significant changes over time for lymphocytes, T-cells or T-cell subsets some minor time changes should be mentioned. The data suggest a tendency of a decline in the oldest NONA individuals, 96 and 100 year old at 6-year follow-up, for the number of lymphocytes in the CD3+, CD3+CD4+ and CD8+CD28+ subsets. This result may reflect that the very old sample includes subjects who experience changes at the end of their life span, similarly to results found in the Baltimore Longitudinal Study of Aging. The study demonstrated that the lymphocyte counts began to decrease 3 years prior to death in a majority of the very old individuals examined (Bender et al., 1986) . Avoidance of an IRP in the centenarian and 96 year old groups was associated with a major loss of CD8+ T-cells (figure 1b), which to some extent might be associated with the decline in the CD8+CD28+ subset across time as described above. A more important reason for the low CD8+ numbers in individuals reaching 100 years of age, however, seem to be the selective survival of individuals having the ability to control CMV and avoiding the accumulation of apoptosis resistant CD8+CD28-T-cells. We also found a tendency for the number of CD8+CD28-cells to increase with time in the \"younger\" 55 and 92 year old groups, which might reflect early change towards the development of an IRP. The association between the number of CD8+CD28-cells and CD4/CD8 ratio, as presented for the very old individuals in figure 1, conform with previous findings (Effros et al., 1994 ).\nWe investigated 6-year mortality in very old individuals categorized by having or not having an IRP defined as a CD4/CD8 ratio of less than one. The results showed that all of the 22 individuals that resided in the IRP category at baseline in fact were deceased at the 6-year follow-up. This confirms previous findings from the OCTO Immune Longitudinal Study that the IRP constitute a major predictor of survival ). The conclusion is further supported by the fact that among 5 individuals that developed the IRP phenotype during this 6-year longitudinal study, 4 were deceased at the 6-year follow-up.\nResults from baseline and the 6-year follow-up also confirmed the findings from the previous OCTO Immune Study of an association between IRP and the prevalence of persistent CMV infection and demonstrated the CD8+CD28-phenotype as markedly expanded for IRP and CMV-positive individuals (Wikby et al., 2002) , suggesting CMV as a contributor responsible, at least in part, for the changes producing an IRP. In line with this we found that the decline in the prevalence of IRP (from 16 to 3%) was parallel to the decline in the CMV prevalence (from 87 to 80%) between baseline and 6-year follow-up, although there were still only a small fraction of the CMV sero-positive individuals who resides in the IRP cathegory. This aspect is also evident in the centenarians, who in spite of being CMV sero-positive did not display any T-cell changes that included increases in the number of CD8+CD28-cells associated with an IRP. These findings support the hypothesis that the manner in which CMV and the host immune system interact is critical in the development of an IRP. The expansion of apoptosis resistant virus-specific CD8+CD28-T cells related to these changes might be associated with the duration of the infection, genetic factors and/or with the frequency of virus reactivations that might be a result of various kinds of stress (Stowe et al., 2007 ).\nEvidence for a major impact of CMV in generating CD8+CD28-cell expansions, and in the development of an IRP, was also demonstrated in the OCTO subjects by tetramer technology, showing significant increases in the frequency of CD8+ T-cells specific for a pp65 CMV peptide in IRP individuals (Ouyang et al., 2003) . Recent work has also shown that the majority of T cell clonal expansions in the very old are specific for CMV, and that the attrition of this clonally expanded repertoire in IRP individuals is closely associated with survival (Reker-Hadrup et al. 2006 ). This suggests homeostatic T-cell changes by generation of effector CD8+ cells against CMV, with parallel decrease in the number of CD3+CD4+ cells in order to keep the total number of CD3+ cells at a fairly constant level (Wikby et al., 2002) .\nIncreases in the frequency of CMV-specific CD8+ cells have previously been investigated by the use of CMV peptides, representing the viral epitope from the pp65 protein (NLVPMVATV, binding HLA-A2). A frequency of 10% for this peptide in the total CD8+ repertoire in elderly people is not uncommon. It has been shown that these cells increase markedly with age and significantly in IRP individuals (Ouyang et al., 2003) . Centenarians, however, seem to represent a highly selected population more \"similar\" to the young regarding their T-cell repertoire . A mean frequency of 1.5% of CD8+ cells specific for the NLVPMVATV epitope were reported in centenarians, which is similar to that in the young but significantly lower than that of the old at ages of 80 to 95 years . These results are in line with results from the present study, supporting the view that centenarians represent a selected elite with an absence of IRP. The results also support the view that centenarians, although \"successfully aged\", are not healthy (Jeune, 2002) . In the NONA Immune sample three quarters of the individuals were in fact classified as frail and at most 5% conformed to the SENIEUR criteria for being quite healthy . The IRP, however, was shown to be predictive of mortality independently of the health status of the very old (Nilsson et al., 2003) and the absence of an IRP in centenarians therefore indicate a well preserved adaptive immune system, that helps to account for their survival in spite of substantial morbidity and co-morbidity.\nContrary to the finding of an absence of deleterious changes in the adaptive immune system associated with an IRP, our study demonstrate significant changes in the innate immune system as reflected in longitudinal increase in the number neutrophils, particularly in the oldest cohorts, suggesting a progression of inflammatory processes also continuing when nonagenarians become centenarians. This finding is consistent with the fact that increases in the pro-inflammatory cytokine interleukin 6, another major predictor of mortality in the very old , is commonly nonetheless seen in centenarians .\nThe present study demonstrated that the IRP is a major predictor of mortality in octo-and nonagenarians, while the survival of centenarians is affected by a selection of nonagenarians with an immune system exhibiting no signs of a T cell Immune Risk Profile. It has also shown that the longitudinal design represents a crucial approach for allowing the detection of intra-individual change which are minimising many of the confounding artefacts likely to emerge from a cross-sectional studies in examination of relationships of age effects in a complex physiologic system like the immune system . "}]