[{"section_title": "Abstract", "text": "Primary brain tumors including gliomas continue to pose significant management challenges to clinicians. While the presentation, the pathology, and the clinical course of these lesions is variable, the initial investigations are usually similar. Patients who are suspected to have a brain tumor will be assessed with computed tomography (CT) and magnetic resonance imaging (MRI). The imaging findings are used by neurosurgeons to determine the feasibility of surgical resection and plan such an undertaking. Imaging studies are also an indispensable tool in tracking tumor progression or its response to treatment. As these imaging studies are non-invasive, relatively cheap and accessible to patients, there have been many efforts over the past two decades to increase the amount of clinically-relevant information that can be extracted from brain imaging. Most recently, artificial intelligence (AI) techniques have been employed to segment and characterize brain tumors, as well as to detect progression or treatment-response. However, the clinical utility of such endeavours remains limited due to challenges in data collection and annotation, model training, and in the reliability of AI-generated information.\nWe provide a review of recent advances in addressing the above challenges. First, to overcome the challenge of data paucity, different image imputation and synthesis techniques along with annotation collection efforts are summarized. Next, various training strategies are presented to meet multiple desiderata, such as model performance, generalization ability, data privacy protection, and learning with sparse annotations. Finally, standardized performance evaluation and model interpretability methods have been reviewed. We believe that these technical approaches will facilitate the development of a fully-functional AI tool in the clinical care of patients with gliomas."}, {"section_title": "Introduction", "text": "Gliomas are the most common primary tumor of the brain and spine, representing 80% of malignant brain tumors. These lesions arise from astrocytes, oligodendrocytes or ependymal cells and cause significant morbidity and mortality. The most aggressive subtype, glioblastoma accounts for ∼45% of all gliomas and affected patients have a 5-year overall survival of ∼5% [1] . These tumors exhibit an incredible degree of inter and intra-tumoral heterogeneity which leads to variable disease presentation and prognosis (see Figure 1 as an example). This variability was considered by Bailey and Cushing when they initially described these lesions ninety years ago [2] . The advent of molecular genetics and improvements in techniques like immunohistochemistry and DNA sequencing have led to novel diagnosis classification systems that more accurately predict disease progression and overall survival. However, the personalization of treatment with targeted therapies remains an ongoing challenge for most gliomas.\nAstrocytomas and oligodendrogliomas constitute the great majority of brain gliomas in adults [3, 4] . These tumors were classically described and graded based upon histopathological features. However, these diagnostic criteria led to significant interobserver differences and did not correspond to prognosis very well [5] . Seminal studies by Cairncross et al. highlighted the importance of chromosome 1p/19q co-deletion for diagnosing oligodendrogliomas [6] . Later studies found that diffuse gliomas with a mutation in the isocitrate dehydrogenase (IDH mutated) gene had a much better overall survival than unmutated cases (IDH wild-type) [7, 8] . These findings led scientists to incorporate genetic characteristics in the new classification of gliomas in 2016 [3, 4] .\nThe recent primacy of molecular genetics in diagnosing gliomas has coincided with improving knowledge of the aberrant pathways involved in disease progression and susceptibility to chemotherapy and radiation therapy. Consequently, clinicians have attempted to protocolize the treatment of low-and high-grade gliomas. Stupp et al. found that concurrent radiation and temozolamide (TMZ) improved overall survival in patients with glioblastomas [9] . Moreover, the greatest benefits from TMZ are seen in patients with methylguanine methyl transferase (MGMT) promoter methylation [10, 11] . Adjuvant chemotherapy and radiation are also beneficial for some patients with low grade gliomas. The European RTOG-9802 trial showed that chemotherapy (procarbazine, lomustine and vincristine) after radiation increased progression free survival (PFS) and survival [12] .\nIn addition to studying glioma genetics which focuses on specific gene mutations, there is growing interest in understanding these lesions at higher levels. Specifically, genomic studies aim to understand the role of the whole genome on developing gliomas while proteomic studies have investigated the complex interaction of various proteins (normal and aberrant) in affected cells [13] . These fields produce large quantities of data, and hence, rely upon novel computational methods to analyze and confirm findings. As mentioned, brain tumor imaging techniques are non-invasive and relatively cheap. Thus, they are integral in diagnosis, surgical planning and prognostication. The prospect of Figure 1 . There is considerable variability in MR images obtained from patients with gliomas. Panels A and B were obtained from patients with glioblastoma (grade IV astrocytoma). Panels C and D from patients with a low grade astrocytoma (IDH mutated). Panels E and F from patients with oligodendroglioma (IDH mutated and 1p/19q codeleted). All images are axial T1-weighted with gadolinium. obtaining genomic information from brain imaging led to the establishment of a new field: radiomics [14, 15, 16] .\nGlioma radiomics aim at extracting clinically relevant features from glioma imaging as a non-invasive image biomarker, to provide information for glioma diagnosis, treatment, or prognosis. The earlier studies used statistical methods to identify the significant radiographic features associated with the clinical outcome. In recent years, artificial intelligence (AI), represented by machine learning (ML) and deep learning (DL), has enhanced glioma radiomics research. This is largely because of the increasing volume of brain imaging data, growing computational power, and advances in AI algorithms. Compared to traditional statistical analysis methods, machine and deep learning are able to leverage larger amounts of clinical data with high dimensionality. Because of this, ML and DL have been widely applied to a variety of glioma imaging-related tasks including: (1) brain tumor segmentation: quantifying tumor volume or segmenting the tumor region for downstream analysis tasks, and (2) predictive tasks (classification or regression): identifying the tumor type (e.g., distinguishing oligodendrogliomas from astrocytomas), grade, molecular subtypes, or genetic mutation [16, 17] , and predicting patients' treatment response, length of survival, prognosis, or recurrence (e.g., differentiating glioma recurrence from radiation necrosis and pseudo-progression [17] ). These advances have been summarized in previous surveys on DL in glioma imaging [18, 19, 20] , ML in glioma imaging applications [21, 22] , brain tumor radiomics [23, 24] and neuroimaging biomarkers [25] .\nThe introduction of AI to neuro-oncology imaging has been met with great enthusiasm from clinicians. This is partially evidenced by the exponential growth in the number of articles reporting findings. Figure 2 shows the increasing number of publications involving ML/DL on glioma imaging in the past two decades. Despite significant breakthroughs in this field, AI has not yet been applied to the clinical care of patients with gliomas, due to practical challenges in data collection, model training, and the lack of trust in performance and generalizability. To bridge the clinical utility gap in applying AI to neuro-oncology, our review focuses on recent technical advances addressing various challenges."}, {"section_title": "Challenges and technical approaches of applying AI in glioma imaging", "text": "Although machine and deep learning techniques have exhibited great potential in analyzing glioma images, their implementation in clinical care remains an elusive goal. Several recent reviews have broadly summarized the challenges in applying AI to clinical medicine (some of which also apply to neuro-oncology) [26, 27, 28] . These challenges involve the full life-cycle of developing an AI model, from 1) obtaining the training data, to 2) training the AI models, to 3) evaluating and deploying the AI model to clinical settings. Non-technical challenges also pose practical constrains in developing AI techniques, including: patient data safety and privacy issue; ethical, legal and financial barriers to developing and distributing tools that may impact a patient's treatment course; medical authority regulation, usability evaluation, clinical acceptance, and medical education around the implementation of the AI-assistive tools. Next, we review the recent advances in glioma imaging research addressing the three main challenges. Figure 3 illustrates the relationship of the challenges and their corresponding approaches."}, {"section_title": "Obtaining data and annotations", "text": "Machine and deep learning models require large amounts of training data to learn from, so that their performances can be generalizable in real-world applications. One prominent example is the ImageNet dataset (containing over 14 million images of natural scenes) [29] that has greatly advanced AI analysis of images. However, the field of glioma imaging is lacking such comparable large-scale, consolidated public datasets. The prevalence of gliomas is relatively low; which, combined with the acquisition cost and time, hinders to the collection of large datasets. Additionally, medical data is protected by patient privacy and safety laws, making it difficult to share these images. Furthermore, the cost of data labelling can be quite high since it requires annotation by medical experts [25] . Figure 4 shows a comparison of several popular natural, medical and brain imaging datasets with respect to these image acquisition factors. As shown in the figure, natural images (ImageNet) and certain medical imaging modalities, such as dermoscopic images (ISIC) are quick to acquire and generate small file sizes, whereas brain imaging datasets take longer to acquire and are large in size. Several strategies have been employed to meet the challenge of limited data and annotations: (i) data sharing platforms and initiatives to build a collective glioma imaging database; (ii) data imputation and synthesis techniques to address issues of Figure 4 . The comparison of natural, medical and brain image datasets with respect to their dataset size (y-axis), the image acquisition time (x-axis), and the size per image (shown by the dot size). Brain imaging datasets (blue dots in the figure) : ADNI (Alzheimer's Disease Neuroimaging Initiative) [30] , ABIDE (Autism Brain Imaging Data Exchange) [31, 32] , BraTS (Brain Tumor Segmentation) [33] , and ISLES (Ischemic Stroke Lesion Segmentation) [34] . Other medical imaging datasets (red dots): OCT (retinal optical coherence tomography images) [35] , CheXpert (chest radiographs) [36] , ISIC (International Skin Image Collaboration Melanoma Project) [37] , and fastMRI (knee MRI) [38] . Natural image dataset (green dot): ImageNet [29] .\nmissing data and lack of sufficient data, and (iii) active learning and crowd-sourcing to facilitate data annotation. Next, we discuss recent advances in these approaches."}, {"section_title": "Clinical data collection efforts", "text": "International and multi-institutional efforts have been made in the past decades towards collecting and sharing glioma imaging data. The TCIA/TCGA (The Cancer Imaging Archive/The Cancer Genome Atlas) service provides large publicly-available datasets, and is a part of a collective effort by the National Institutes of Health (NIH), the National Human Genome Research Institute (NHGRI), and multiple hospitals to encourage the sharing of clinical, imaging (including radiographic and pathological images) and genomic datasets for cancer research [39] . There are about 1,200 raw brain images related to glioma in the TCIA dataset. The Brain Tumor Segmentation (BraTS) challenge dataset [33] derived from TCIA contains 461 expert-assessed scans (including low-and high-grade gliomas) from 19 institutions. As the largest publiclyavailable glioma imaging dataset, BraTS is critical for benchmarking and has helped advance AI applications in glioma image analysis."}, {"section_title": "Data Imputation and Synthesis Methods", "text": "As mentioned, data heterogeneity and data paucity are two prominent issues in the clinical adoption of AI in glioma imaging. As such, data imputation approaches have been proposed to handle scenarios such as missing MRI sequences, missing voxel intensities, low-resolution or artifact-degraded scans. Similarly, data synthesis and augmentation techniques have been proposed to expand the available imaging data.\n• Data imputation methods to deal with missing data Several conventional machine learning methods have been proposed for MR image imputation. Cruz et al. [40] simulated two types of missing morphological measures in T 1 -weighted brain MRI scans: missing completely at random (MCAR) and missing not at random (MNAR). They also evaluated four data imputation techniques representative of distinct statistical approaches: substituting the missing value with the mean of all subjects (univariate approach), k-nearest neighbors (inferential approach), low-rank matrix approximation (analytical approach), and random forest (statistical learning approach). The random forest-based approach was shown to be the most accurate in recovering the gold standard results. Jog et al. [41] proposed a random forest-based supervised image imputation approach, which performs a non-linear regression in the feature space to predict the intensities in various contrast-enhanced MR sequences. They evaluated their proposed approach by synthesizing 1) T 2 -weighted images from skull-stripped T 1weighted images 2) FLuid Attenuated Inversion Recovery (FLAIR) images from T 1 -weighted, T 2 -weighted, and P D -weighted images and 3) whole head T 2 -weighted images (non-skull-stripped) from T 1 -weighted images. Their method demonstrated an improvement in the synthetic image quality over state-of-the-art image synthesis algorithms, and the downstream segmentation task performed similarly for real and imputed images. Dalca et al. [42] leveraged the shared intrinsic local fine scale structural similarity in a collection of medical images. They used a generative model, Gaussian mixture model (GMM), to perform brain MRI restoration in a sparsely sampled scan, and demonstrated superior performance as compared to state-of-the-art up-sampling super-resolution methods. They cautioned, however, that imputed data should not be used in clinical evaluation; instead the brain mask obtained from the restored scans can be applied to the original scans and improve subsequent analyses.\nRecently, deep learning-based approaches have been proposed for data imputation. Chartsias et al. [43] proposed a multi-input multi-output deep model trained end-toend, with encoders and decoders for each MRI sequence. The latent representations from multiple encoders were fused, and a combination of loss functions were used to ensure that the multiple latent representations from multiple modalities are similar. Another strategy for MRI imputation relies upon generative adversarial networks (GANs) [44] . Welander et al. [45] compared the performances of two image-toimage translation methods: CycleGAN [46] and UNIT [47] for the generation of T 1 and T 2 MRI sequences; the generated T 2 sequences had higher mean absolute error (MAE) and lower peak signal-to-noise ratio (PSNR) than the generated T 1 sequences. Several other GAN-based methods for imputing missing MRI sequences have been proposed [48, 49, 50, 51, 52] , including CollaGAN [53] which investigated the reconstruction of various sequences. They concluded that while T 1 , T 2 , and T 2 -FLAIR can be imputed from other sequences, contrast-enhanced T 1 -weighted sequences cannot be efficiently imputed.\n• Data synthesis methods for data augmentation To synthesize new images, Han et al. [54] trained two generative models, a deep convolutional GAN (DCGAN) [55] and a Wasserstein GAN (WGAN) [56] , on the BraTS dataset to synthesize new brain MR images. To evaluate their performance, the authors conducted a 'visual Turing test': doctors were asked to differentiate real MRI from the generated images. Images generated by WGAN (classification accuracy ranged from 53% to 64%) were mis-classified by doctors more frequently than those generated by DCGAN (classification accuracy ranged from 54% to 70%); thus inferring that WGAN produced more visually realistic images. A similar visual assessment was also conducted by Kazuhiro et al. [57] where five radiologists (including two experienced neuroradiologists) attempted to classify a random selection of 50 real and synthesized images. The classification accuracy for the neuroradiologists were 55% and 30%; indicating that many synthesized images were practically indistinguishable from real MRIs. Shin et al. [58] used an image-toimage translation framework [59] to predict tumor segmentation masks from brain MR scans and to generate brain MR scans given tumor masks. The latter was then used to augment the segmentation training dataset. Using only the synthetic MR images to train the model followed by fine-tuning on 10% of the real images, the segmentation performance was superior to using only the real images. Jin et al. [60] proposed an image-to-image translation framework for synthesizing brain MR images from brain CT images. They leveraged a combination of adversarial loss, dual cycle-consistent loss, and voxel-wise loss strategies to train. Models trained using the paired data (i.e., CT and corresponding MRI scans from the same patient) and the unpaired data (two independent collections of CT and MRI images) together achieved higher PSNR and lower MAE compared to models trained using only either paired or unpaired data."}, {"section_title": "Obtaining data annotations", "text": "Classically, MRI annotation has required the time and expertise of medical experts, which imposes higher costs than for natural images. As such, there has been interest in 1) making the best use of expert input by annotating in an active learning setting, or 2) bypassing physician expertise and asking non-experts to annotate. We will expound upon each of these strategies below.\nActive learning (AL) is a possible workaround to training models with limited annotated data. AL is an ML technique that reduces the annotation workload by automatically deciding which representative samples should be annotated in order to train a model as quickly and efficiently as possible. Damangir et al. [61] proposed using a cascade of support vector machines (SVMs) with an AL scheme to segment white matter lesions from brain MR scans (a problem compounded by the dataset being biased towards normal tissue). They observed that the proposed method yielded accurate results while also achieving the highest sensitivity and specificity scores amongst all methods compared. Konyushkova et al. [62] proposed leveraging the feature and geometric uncertainties from images to increase the efficiency of AL for tumor segmentation from brain MR images. In a later study, they modeled AL as a regression task [63] , essentially predicting the expected generalizability of a trained classifier when annotating a specific data point. They used features extracted from a random forest regressor trained on synthetic 2D data to perform tumor segmentation from brain MR scans, and obtained superior results as compared to other active learning methods (such as uncertainty sampling and active learning by learning) with considerably fewer annotated samples.\nAnother popular approach of obtaining a large number of annotations quickly is to crowd-source the annotation process; a strategy which has led to rapid advances in computer vision [64] . The aforementioned ImageNet dataset [29] has been annotated using a crowd-sourcing platform (Amazon Mechanical Turks). Although there may be few medical experts within the labelling group, crowd-sourcing has been shown to be effective in creating large quantities of annotated data; and, it is faster and cheaper than annotation by medical experts [65] . In neuroscience research, crowdsourcing and gamification have helped neuroscientists to explore brain networks by identifying neurons and their synaptic connections [66, 67] . Prior to annotating, the crowd will be trained by learning from a few examples labelled by medical experts. The labelling results will need to be aggregated from multiple workers to ensure the labelling quality. To date, crowd-sourcing tasks in medical imaging have included classification, localization and segmentation of organs or lesions [65] . Due to the image variability and the requirement of domain knowledge, crowd-sourcing in neuroimaging, especially in glioma research, is still in its infancy, with only a few studies in this area. For example, to analyze diffuse intrinsic pontine glioma, 823 non-expert participants annotated 5,152 brain MR images to segment brain stem or tumor [68] . Rajchl et al. recruited 12 nonexpert to annotate super-pixels for fetal brain segmentation. The fully convolutional network trained on crowd-sourcing annotations reached similar performance as the one annotated by experts [69] . Keshavan et al. used crowd-sourcing to amplify expertlabelled data for quality control of brain MRI images, and a deep learning model trained on the amplified data reached AUC of 0.99 [70] ."}, {"section_title": "Training the model", "text": "Successful training requires the model to meet multiple desiderata such as satisfactory performance, generalizability, data privacy protection, and training with sparsely annotated data."}, {"section_title": "Choosing and training models", "text": "Some practical challenges are related to model training, and we list the three most important ones: choosing the optimal model, model generalization, and learning under data privacy constraint.\n• Choosing the optimal model\nThe proliferation of deep learning models has led to a considerable number of layer designs and model architectures, loss functions, and optimizers to choose from when designing a network. With an infinite space of possible computation graphs, a plethora of architectures were proposed (some of the popular model architectures include AlexNet [71] , VGG16 and VGG19 [72] , GoogLeNet [73] , ResNet [74] , DenseNet [75] , inception architectures [76, 77] , U-Net [78] , etc.). Moreover, even randomly connected graphs [79] , as well as strategies to perform neural architecture search (NAS) [80, 81] have been developed in order to find the optimal model architecture. We list the model architectures used by various works in glioma imaging in Table 1 .\n• Model generalization Models trained on images from one hospital may not be generalizable or perform equally well on new data from another hospital or image scanner, due to domain distribution shift and the confounding information models exploited [82] . Regularization strategies are utilized to improve model generalization and prevent over-fitting the training dataset. These include dropout [83] , early stopping [84] , data augmentation [85] , or gather sufficient data from different scanners and/or hospitals [86] . To encourage model generalization among multiple scanners, Aslani et al. proposed to use an auxiliary network and corresponding regularization loss term to learn the domain-specific knowledge [86] . This auxiliary network learned to predict the category of the input scanner's domain, thus encouraging the backbone segmentation network to ignore domain-specific information. The experiments on brain lesion segmentation from 56 different scanning sites showed the proposed method had better generalization performance to data from new sites than other baseline networks. [88] . The authors also observed as the new training data becomes available, fine-tuning can be done from the last full-connected layer to the last few convolutional layers.\nTransfer learning, however, can suffer from catastrophic forgetting issues, where the knowledge about the old task may not be maintained when adapting parameters to a new dataset or task. To avoid this pitfall and enable continual learning [89] , several approaches were proposed in the realm of brain segmentation. Garderen et al. applied a regularization called elastic weight consolidation (EWC) during transfer learning [90] . It penalizes large changes in model parameters weighted based on their importance to the old dataset. Research on segmenting low-and high-grade gliomas showed that EWC improved performance on the old domain after transfer learning on the new domain. Conversely, it also restricted the adaptation capacity to the new domain. Karani et al. suggested that learning batch normalization parameters for each scanner and sharing the convolutional filters between all scanners addressed the distribution shift among scanners [91] . The experiment showed this strategy can be adapted to new scanners or protocols with only a few (≈ 4) labelled images and without degrading performance on the previous scanners.\n• Learning under data privacy constraint Training models on data from multiple sites can improve model generalization.\nHowever, due to data privacy and regulation issues, data is usually retained within host hospital servers, and is not easily shared. Data privacy protection methods can range from data anonymization, obfuscation (modifying data with noise to provide protection, e.g.: differential privacy) [92] , to federated learning (sharing model parameters rather than raw data) and learning over encrypted data [93] . Federated learning is a private distributed and decentralized machine learning method that trains the shared model locally with private data without exchanging the raw patient data [94, 95] . Sheller et al. demonstrated federated learning on the clinically-acquired BraTS data for institution-level segmentation tasks [96] . Their study showed that the performance of federated semantic segmentation models (Dice=0.852) was similar to that of models trained by sharing data (Dice=0.862), and outperformed two alternative collaborative learning methods."}, {"section_title": "Handling different levels of annotation quality", "text": "Machine and deep learning models can be trained with varying levels of supervision. Fully annotated ground truth labels for medical imaging data are expensive and relatively scarce; however, images with weaker levels of annotation such as bounding box annotations or image level annotations are relatively easier to acquire. Figure 5 shows the different levels of supervision for training a tumor segmentation model. A fully supervised system would require manually annotated tumor segmentation regions (pixelwise labeling). Weaker levels of annotation can vary from bounding box annotations of tumor region or image-level labels indicating whether a tumor is present (semisupervised learning), or no labels at all (unsupervised learning). For detailed description of semi-supervised medical image analysis techniques, we refer the interested readers to Cheplygina et al. [97] . Conventional machine learning methods have been deployed to learn from sparsely annotated data. Azmi et al. [98] used stationary wavelet transform, edge features, and fractal features in a semi-supervised framework with an ensemble of three algorithms for segmenting brain tissues. Their approach achieved a higher accuracy and precision than fully-supervised approaches, and they noted that supervised methods such as k-nearest neighbor (KNN), SVM, and Bayesian classifiers were not able to perform well with limited data. Blessy et al. [99] proposed an unsupervised approach for MRI brain tumor segmentation based on optimal fuzzy clustering. They evaluated their approach on MRI scans of 150 patients with low grade gliomas from the BraTS dataset and outperformed four other clustering-based methods. Grande-Barreto et al. [100] used priors about the brain structure and features extracted from the 3D gray level co-occurence matrix (GLCM) for segmenting brain tissue, and observed superior performance when evaluated on synthetic brain MR scans as compared to other stateof-the-art unsupervised approaches.\nMore recently, there have been several deep learning-based semi-supervised and unsupervised approaches applied to brain MR images. Chen et al. [101] trained variational autoencoder [102] and adversarial autoencoder [103] models to learn the latent space representation of healthy brains and introduced a representation consistency constraint in the latent space, leading to a better lesion detection accuracy. Alex et al. [104] proposed using stacked denoising autoencoders (DAE) [105] for segmenting high grade gliomas, transfer learning for segmenting low grade gliomas, and a single layer DAE for constructing error maps to improve lesion detection performance. Similarly, Enguehard et al. [106] proposed a semi-supervised algorithm for infant brain MRI tissue segmentation based on deep embedded clustering, and demonstrated the robustness of their proposed approach by using the same network, optimizer, and learning rate for two additional natural image classification tasks and achieving superior performance to state-of-the-art semi-supervised methods. Dalca et al. [107] proposed a probabilistic model and a novel loss function for unsupervised segmentation of brain MRI, and built upon the recent advances in deep learning-based registration methods to jointly estimate the atlas deformation and the image intensity statistics, allowing them to train a deep model on a new dataset without any manually annotated images.\nIn scenarios with multiple granularities of annotated ground truth, a mixed supervision training approach can be adopted in order to utilize all the available annotations. Zheng et al. [108] proposed a multi-atlas label fusion based method to segment the hippocampus in brain MR images by integrating random forest classification models with semi-supervised label propagation. Baur et al. [109] trained an autoencoder to learn the representation of healthy brain scans, and then used it to detect and segment anomalies in unlabeled scans. A U-Net [78] was then trained for supervised segmentation with images paired with their labeled ground-truth data and unseen images paired with the autoencoder output, thereby combining unsupervised and supervised techniques. Mlynarski et al. [110] extended this architecture [78] by jointly performing classification and segmentation, and utilized weakly annotated and fully annotated data to train a deep model for tumor segmentation from brain MRI scans."}, {"section_title": "Clinical deployment", "text": "In this section, we describe approaches which address the main challenges to translating the advances in machine and deep learning into clinical deployment: namely, standardized evaluation metrics and model interpretability."}, {"section_title": "Standardized model evaluation", "text": "The existing literature reports the performances of AI models using a wide range of evaluating metrics, e.g., accuracy, sensitivity, specificity, area under the curve (AUC), and F 1 scores for classification tasks, overlap-based measures such as the Dice score coefficient and the intersection over union measure (also known as the Jaccard index) for segmentation tasks. Table 1 summarizes the evaluation metrics used in the literature. The metrics variability can lead to models being evaluated based on the reported best metric, making horizontal comparisons among the models a difficult task. It is therefore necessary to have a standardized set of evaluation metrics to provide a uniform platform for comparison of different machine and deep learning models. One possible approach to deal with this would be to report the model performance using all the conventional evaluation metrics, thereby allowing for assessing the performance of newer models with respect to the established benchmarks [119] .\nMoreover, high values for a reported metric of a model do not necessarily translate into superior clinical performance, mainly due to the fact that individual metrics don't capture all the desirable properties for a model [120] . For example, a viable model needs to be accurate, fast, and relatively small; invariably, there are trade-offs between model performance, generalizability, and interpretability. "}, {"section_title": "Task", "text": "Model architecture Evaluation metrics\nClassification VGG16 [111] Accuracy [111, 112, 113, 114] 2D [112, 111] and 3D ResNet [113] Sensitivity or recall [111, 113, 114 ] CNN+LSTM a [115] Specificity [114] 3D CNN with gated multimodal unit [114] Precision or PPV b [111, 113, 114, 115] F1 score [111, 113, 115] AUC c [113, 115] Segmentation 2D [48, 91, 96, 110] and 3D U-Net [86, 90] Dice score [48, 86, 88, 90, 91, 96, 110, 116, 117] Fully convolutional network [88] Specificity [117] Densely connected CNN [116] Sensitivity [86, 117] TwoPathCNN [117] Precision [86] False positive rate [48, 86] False negative rate [48] Synthesis GAN [45, 48, 49, 50, 51, 52, 53, 118] MSE d [50, 118] MAE e [45, 48] PSNR f [45, 48, 49, 50, 51, 118] SSIM g [49, 50, 51, 52, 53, 118] a LSTM: long short-term memory; b PPV: positive predictive value; c AUC: Area under the receiver operating characteristics; d MSE: mean squared error; e MAE: mean absolute error; f PSNR: peak signal-to-noise ratio; g SSIM: structural similarity index"}, {"section_title": "Model Interpretability", "text": "Compared to simple statistical models such as linear models, most machine and deep learning approaches suffer from the notorious problem of using opaque models (black-box models) rather than transparent ones (white-box models). Even though the model parameters and architecture are known, tracing the relationship between inputoutput pairs is a difficult challenge. This is partially due to the large number of model parameters; deep neural networks usually have millions of parameters (for example, the popular VGG16 architecture has over 138 million parameters). Furthermore, there are complex representations in high-dimensional space, and multi-layered non-linear mappings from input space to output predictions. In machine and deep learning literature, this challenge is referred to as the model interpretability or explainable AI (XAI) problem, i.e., to open the black box models and reveal how the model makes the predictions in terms that human users can understand [121] .\nModel interpretability is especially important in deploying AI techniques in clinical settings. With a black-box model, the clinical users will only receive a prediction without an explanation or justification. Thus, it is difficult for clinical users to trust such models, adopt the model results as part of the formal and legal medical report, and learn from models to improve their expertise. XAI is therefore regarded as one of the \"missing pieces\" of AI in medicine [27, 122] . Although XAI is still an emerging field, there have been some recent attempts to explain AI models on glioma imaging predictive tasks. In the subsequent sections, we introduce different approaches to explaining AI decisions to clinical users, and summarize progress in applying XAI to glioma imaging tasks.\nExplanations of the model's prediction can be produced at different levels and using different approaches. Local and global explanations are explanations at different levels of granularity [123] . Local explanations explain how the model makes the decision for one data point, usually when doctors are seeking explanations for a particular clinical case, and global explanations explain how the model makes decisions in general. Similarly, post-hoc and intrinsic (ante-hoc) explanations are two distinct approaches to generate explanations [124] . Post-hoc explanation builds a proxy explanatory model to explain the original black-box model. It is especially suitable in explaining black-box models that are already put in use or those that use a specific architecture. In contrast, for models that have not been put into practice or do not have their architecture specified, we can build intrinsic (ante-hoc) explainable models that both perform predictive tasks and explain the predictions.\nA prerequisite of useful XAI is that the generated explanations need to be easily understandable by clinical users. Creating explanations for clinical end-users is more challenging since they usually do not have prior knowledge in ML or AI models. Jin et al. surveyed the existing XAI literature and identified three explanatory forms that are accessible to non-technical users [125] :\n• Explaining using feature attributes to identify the most important features that have the highest influence on the predicted outcome.\n• Explaining using examples to show users instances that the model regards to be similar to the query image, or are typical to the prediction.\n• Explaining using decision rules to show users the decision flows that the model follows.\nAll the features, examples and rules should be presented in user-understandable forms. As such, we organize the following summary of XAI advances on glioma imaging according to the aforementioned clinical-user-friendly explanatory forms. Applying XAI methods to glioma imaging tasks is still at a nascent stage. The purposes of applying XAI in glioma imaging include model quality assessment, resolving users' perceived anomalies, gaining users' trust, improving physician expertise and assisting in scientific discovery (such as identifying imaging biomarkers)."}, {"section_title": "(i) Explaining using feature attributes", "text": "Feature attribution is the most common form of explanation in the XAI literature.\nIn an interview with clinicians about their requirements for XAI, doctors expressed the need to understand the important features that align with accepted medical paradigms [126] . Features are shown with their types of pathological changes, their importance scores, and their locations on the image. Such information can be presented in forms of text descriptions, color maps (or saliency maps) or segmentation maps overlaid unto input images. Next, we introduce three approaches to generate post-hoc explanations based on \"activation\", \"gradient\", and \"input perturbation\".\n(a) Activation-based methods For deep learning-based image tasks using convolutional neural networks (CNNs), a usual approach to reveal what the network has learned is to utilize the information from the internal activation maps. For example, Ahmad et al. applied a class activation map (CAM) method on 2D ResNet CNN to predict IDH mutation status in high-grade gliomas [111] . They demonstrated that the generated saliency maps correspond to the tumor area in most IDH1 mutant cases, while in most IDH1 wild-type cases, the peri-tumoral edema is also involved. The CAM method reveals where the intermediate CNN layer is \"looking at\" to make the prediction. It has become popular in the computer vision literature since 2015 [127] . Given an input image, it acquires the internal activation maps in a particular layer, and aggregates them using their respective weights from the global average pooling layer to generate a color map with the same size as the input image. Since the CAM method gives explanations on a single image, it is a local explanation method. \"Attention mechanism\" is another approach to reveal the significant features in input data. It learns to assign \"importance weights\" to activation maps (in the case of CNN) or hidden states (in the case of recurrent neural network). The [113] . By visually inspecting some of the saliency maps that do not contain the tumor regions, users may conclude that the prediction may not be reliable. Similarly, Huang et al. also applied 3D-based Grad-CAM on classifying high-vs. lowgrade glioma to compare model performances on synthesized MR modalities with ground-truth complete modalities [118] . The resultant saliency map highlighted the tumor regions as the important image features that contribute to the tumor grading. Both grad-CAM and guided-backpropagation methods depend on the gradient of the output with respect to the input to compute how the change of input will influence the change of output. Specifically, Grad-CAM, or gradient-weighted class activation map, can be regarded as a modification of the earlier CAM methods. Both utilize the weighted combination of activation maps to produce the saliency map; and the difference is in how they apply weighting to the activation maps. Unlike CAM that uses weights from global average pooling layer, grad-CAM takes weights from the gradients of the target class output with respect to the activation maps. Thus, it aggregates information both from activation maps and gradients, and can create a more localized saliency map than CAM [129] . Guided-backpropagation adds an additional guidance signal (gradient from top layer) to usual backpropagation which computes gradients from the bottom layer. This can create clearer and less noisy saliency maps [130] . (c) Perturbation-based methods\nThe above-mentioned methods apply to cases where we have access to model parameters, activations, and architecture information. Sometimes such knowledge is unknown to its model users, due to safety, privacy, or intellectual property issues. Perturbation-based method is used to reveal how the model makes predictions by probing the model with different inputs and analyzing the input-output pairs. It constitutes a post-hoc method and is model-agnostic (i.e., can be applied to any black-box models). In a work to segment gliomas from MRI, Pereira et al. applied the local interpretable model-agnostic explanations (LIME) [131] to the ML model for local interpretability [132] . Their ML model is a restricted Boltzmann machine for unsupervised representation learning, and a random forest classifier for voxel-level segmentation. They perturbed the features to generate synthetic neighbours that are close to the original data in the feature representation space, and also acquired the predicted output of these neighbours. With the input-output pairs, they trained a ridge regressor and used its weights as the importance-measure of each feature, shown as saliency maps on the MRI images. The saliency maps showed that FLAIR sequences were the most important for segmenting the complete tumor while segmentation of edema was mainly based on FLAIR and T1c sequence. They also showed that the T2 and T1c sequences were important for segmenting necrosis, and T1c was important in segmenting the enhancing rim region. These findings correspond well with accepted radiologic principles; thus, confirming that the model learned the correct relations in the data.\n(ii) Explaining using examples Compared to feature attribution, explaining using examples can provide more contextual information about how the model learned, and is more intuitive as clinicians are used to learning from examples. In a user study with ICU clinicians, the researchers observed the example-based explanations facilitated clinicians' analogical reasoning [133] . Another study involving pathologists showed that examples with similar visual appearance and different diagnoses can help physicians broaden their differential diagnosis [134] . For example-based explanations applied to glioma imaging tasks, Chang et al. identified the prototypical images to predict IDH mutation, 1p/19q codeletion and MGMT methylation status [112] . They built CNN models on 2D MRI slices from the TCIA dataset and identified the prototypical images that caused the most activation of the units in the final fully-connected decision layer. The typical images for IDH mutation demonstrated absent or minimal enhancement with welldefined tumor margins in T1c, or central areas of cysts with FLAIR suppression. Conversely, IDH wild-type tumors exhibit thick and irregular enhancement or thin, irregular peripheral enhancement in T1c, and infiltrative patterns of edema on FLAIR. Such prototypical images serve as global explanations of the model's overall prediction.\nXAI evaluating metrics To evaluate interpretability methods, Doshi-Velez and Kim proposed an evaluation framework at three levels: functionally-grounded evaluation (using function as a proxy to measure interpretability), human-grounded evaluation (evaluating with lay-person's cognition and understanding), and domain expertgrounded evaluation (evaluating the interpretability on domain-specific tasks) [121] . Current XAI techniques on glioma imaging have little to no evaluation. This is probably due to the fact that the current XAI explorations are more focused on revealing the model's predictions and checking how well the learned model aligns with doctors prior knowledge, rather than considering the practical challenges associated with the clinical implementation of XAI. The research of clinical utility of XAI on glioma imaging is at its inception and has many unsolved questions waiting to be explored."}, {"section_title": "Discussion", "text": "In this manuscript, we have summarized recent efforts toward increasing the clinical utility of AI in neuro-oncology by addressing the current challenges in data collection, model training and clinical deployment. The current research, however, focuses more on novel algorithm design, rather than actually applying them in real-world patientcare settings. As the performance of machine and deep learning models improves and the challenges enumerated are addressed, we foresee greater interest in translational research that aims to apply novel technologies to the bedside. To this end, we next highlight further advances which are necessary for the full implementation of AI in glioma imaging; to develop clinical decision support systems (CDSS) and facilitate the personalization of care.\nClinical workflow integration Implementing AI in patient-care settings requires the AI technologies to be integrated into the existing clinical workflow. Several steps are needed to achieve clinical workflow integration: First, before the design of an AI system, clinical requirements should be ascertained and a \"needs assessment\" should be performed. Furthermore, a user-centric design approach should be applied during the AI system design and iteration. This step solicits clinician feedback in the design of user-friendly interfaces and reduces the cognitive-load for physicians while supporting their clinical tasks. Moreover, the implemented system needs to take advantage of newly acquired patient data using online machine learning, to continually improve the performance of the predictive models. The systems can also use \"adaptive learning\" to adapt to user's behaviours and preferences, i.e. \"hybrid learning\" or \"human-in-theloop\" machine learning [135] .\nAchieving the above steps will need close collaboration between physicians, AI experts and human-computer interaction developers.\nClinical evaluation Appropriately evaluating the functionality of AI systems is necessary prior to its clinical implementation. We can make an analogy of evaluating the clinical utility of AI to the conventional four-phase clinical trials for medications or medical devices: Figure 6 . The four phases of evaluating the clinical utility of AI in glioma imaging."}, {"section_title": "Level of evidence & cost", "text": "• Phase I is to primarily test the performance of the AI model. This phase only involves the AI model and test data, and does not involve human users. Most current AI system-evaluation is at this stage and tests AI performance on unseen data with model-based evaluation metrics, such as classification accuracy, sensitivity, specificity, AUC (area under the receiver operating characteristics), or mean squared error, as listed in Table 1 . For example, Li et al. created a clinical application called GliomaPredict that used an unsupervised ML principle component analysis (PCA) to classify patients with gliomas into 6 subtypes according to their glioma transcriptomic profiles [136] . It generated a visual representation of the analyses, quantified the confidence of the underlying subtype assessment, and presented results as a printable PDF file. The application was evaluated based on the model performance on new patient data and yielded 75-96% of prediction accuracy.\n• Phase II involves clinical users in experimental settings using simulated tasks (usually on held-out test data) rather than in real clinical settings. The evaluation metrics are usually model-based metrics. Earlier works focused on the head-to-head comparison of doctors' performance with AI models, mainly to indicate that AI matches doctor-level performance [137, 138] . More recently, studies have involved doctor+AI as a third arm in the AI vs. doctor comparisons. For example, Bien et al. found that physicians who used AI predictions had significantly improved specificity in identifying anterior cruciate ligament tears from knee MRI compared to doctors who didn't have these predictions [139] . This evaluation trend reflects a paradigm shift from AI replacing doctors, to AI augmenting doctors.\n• Phase III involves clinical users in real-world settings using randomized controlled trials. In addition to using model-based evaluation metrics, other clinical outcome metrics can be evaluated, such as patients' outcome, physicians' performance or efficiency, clinical usability and health economics. So far, very few studies have entered this phase. In a randomised controlled trial, Wang et al. enrolled a total of 1,058 patient to evaluate an AI-assisted polyp detection system during colonoscopy [28] . Compared with standard colonoscopy, the AI-assisted colonoscopy increased the adenoma detection rates by 50%, from 20% to 30%.\n• Phase IV is for post-marketing software support and surveillance. This phase will follow the launch and clinical implementation of AI systems."}, {"section_title": "Conclusions", "text": "Because of their significant clinical burden, gliomas are one of the most highly studied cancers. Machine and deep learning techniques have the potential to increase the clinical yield of non-invasive imaging studies, from segmenting tumors for quantitative measures, to identifying molecular subtypes and grades; from evaluating treatment response to predicting patient prognosis. Despite recent advances, AI technologies have not yet become fully functional in the management of patients with gliomas. In our review, we have summarized recent efforts to address practical challenges in applying AI to clinical settings. Multiple data and annotation collection efforts, together with data imputation and synthesize methods, were presented. We also discussed different model training strategies, and methods of learning under limited supervision. Furthermore, we have presented various standardized model evaluation metrics and model interpretability methods. Finally, we have proposed necessary future steps towards workflow integration and provided a framework for evaluating the clinical utility of AI-assisted systems. Due to the scope of the paper, we have focused on the technical barriers to implementation; and, approaches to overcome these challenges. Specifically, we have not discussed nontechnical, financial and legal issues which will, no doubt, need to be considered in the future. Ultimately, the full implementation of AI-based tools in neuro-oncology will significantly improve the care of patients with gliomas."}]