[{"section_title": "Abstract", "text": "Objectives: Given public health's emphasis on health disparities in underrepresented racial/ethnic minority communities, having a racially and ethnically diverse faculty is important to ensure adequate public health training. We examined trends in the number of underrepresented racial/ethnic minority (ie, non-Hispanic black, Hispanic, American Indian/Alaska Native, Native Hawaiian, and Pacific Islander) doctoral graduates from public health fields and determined the proportion of persons from underrepresented racial/ethnic minority groups who entered academia. Methods: We analyzed repeated cross-sectional data from restricted files collected by the National Science Foundation on doctoral graduates from US institutions during 2003-2015. Our dependent variables were the number of all underrepresented racial/ethnic minority public health doctoral recipients and underrepresented racial/ethnic minority graduates who had accepted academic positions. Using logistic regression models and adjusted odds ratios (aORs), we examined correlates of these variables over time, controlling for all independent variables (eg, gender, age, relationship status, number of dependents).\nResults: The percentage of underrepresented racial/ethnic minority doctoral graduates increased from 15.4% (91 of 592) in 2003 to 23.4% (296 of 1264) in 2015, with the largest increase occurring among black graduates (from 6.6% in 2003 to 14.1% in 2015). Black graduates (310 of 1241, 25.0%) were significantly less likely than white graduates (2258 of 5913, 38.2%) and, frequently, less likely than graduates from other underrepresented racial/ethnic minority groups to indicate having accepted an academic position (all P < .001).\nConclusions: Stakeholders should consider targeted programs to increase the number of racial/ethnic minority faculty members in academic public health fields."}, {"section_title": "", "text": "Public health is a multidisciplinary field concerned with promoting and protecting the health of populations and communities, especially racial/ethnic minority populations who are at an increased risk for many illnesses and injuries.\n1-3 Underrepresented racial/ethnic minority groups include black, Hispanic, American Indian/Alaska Native, Native Hawaiian, and Pacific Islander persons. Given public health's emphasis on health disparities in underrepresented racial/ethnic minority communities, the recruitment and retention of racially and ethnically diverse faculty members in schools and programs of public health is a fundamental component to ensure adequate public health training at all levels.\nResearch conducted in education and other health professions found that underrepresented racial/ethnic minority faculty are more likely than their white counterparts to conduct research on health disparities 4 ; promote and advocate for an understanding of cultural issues, sensitivities, and practices 5 ; and provide mentoring for other racial/ethnic minority students, who are vital future contributors to the public health workforce. 6 As the public health workforce ages and retires, leading to an anticipated shortage of 250 000 workers by 2020, 7 schools and programs of public health are increasing the number of trainees at the undergraduate, masters, and doctoral levels. 8, 9 An increase in the number of doctoral trainees may help with the recruitment of new faculty members as schools and programs of public health keep up with increasing demand.\nAlthough underrepresented racial/ethnic minority groups comprised more than 30% of the US population in 2015, 10 they constituted a disproportionately smaller proportion of doctoral graduates (18.5%) 11 and academic faculty in public health disciplines (7.6%) in 2013, 12 resulting in a shortage of underrepresented faculty members in schools and programs of public health. 13 Researchers have commented that current university settings are not optimal for the recruitment or retention of underrepresented minority doctoral graduates, in part because minority faculty members have higher mentoring and service responsibilities than their white counterparts. 13, 14 Although commentaries and studies help to characterize the problems, they fail to provide empirical evidence for solutions to address the lack of underrepresented minority professionals on the faculties of schools and programs of public health. For example, it is unclear whether the number of underrepresented minority graduates from public health doctoral programs is insufficient to fill faculty positions or whether these graduates are not choosing to work in academic settings. A better understanding of the trends among underrepresented minority graduates receiving public health doctoral degrees is an important first step in addressing this issue.\nThe primary objective of this study was to examine trends over time in the number of underrepresented racial/ethnic minority doctoral graduates from the core knowledge areas of public health: biostatistics, environmental health sciences, epidemiology, health services administration, and social and behavioral sciences. A secondary objective was to quantify the proportion of underrepresented minority doctoral graduates in academia and determine whether these rates have changed over time. We examined demographic and university characteristics as well as the public health knowledge areas that are associated with underrepresented racial/ethnic minority graduates who had accepted academic positions and those who had not."}, {"section_title": "Methods", "text": "We analyzed restricted data from the National Science Foundation (NSF) Survey of Earned Doctorates (SED). We analyzed pooled cross-sectional data from respondents who earned research doctoral degrees from US institutions from 2003 through 2015. The NSF collects data annually on more than 50 000 research doctoral graduates in all fields of study at or around the time of graduation. 15 The inclusion criterion for research doctorates as defined by the NSF was completion of an original intellectual contribution, traditionally in the form of a dissertation. Our data include graduates with doctor of philosophy (PhD) degrees, doctor of science (ScD) degrees, and doctor of public health (DrPH) degrees (ie, DrPH graduates who complete a dissertation). Each university decides which terminal degree is classified as a research doctorate; however, professional degrees, such as doctor of medicine, juris doctor, and some DrPH degrees, are not included in the data. In addition to basic demographic information, the survey collects data on graduates' demographic characteristics and degree field, characteristics of the degreegranting institutions, and graduates' postgraduation plans. 15 The Indiana University Institutional Review Board determined this study to be exempt.\nFor our main variable of interest, we used the NSF's definition of racial/ethnic underrepresented minority in US health sciences, which includes black, Hispanic, and indigenous American persons. In our analysis, we used \"black\" to describe all persons who self-selected black or African American race, and we used \"Hispanic\" to describe all persons who selected Mexican or Chicano, Puerto Rican, Cuban, and other Hispanic or Latina/o categories regardless of their racial designation. Because of small sample sizes, the race category \"other underrepresented minority\" included persons who self-selected American Indian/Alaska Native, Native Hawaiian, other Pacific Islander, or 2 races, one of which was an aforementioned underrepresented minority.\nA secondary variable of interest was the number of underrepresented minority doctoral graduates who, at the time of the survey (ie, approximately the time of graduation), had accepted an academic position. We derived this variable from the SED, and it included any position, including postdoctoral fellowships, that was in an institution of higher education.\nOur independent variables were various individual and institutional characteristics. Individual characteristics were race, sex, age, marriage or marriage-like relationship, number of dependents aged <18, whether a US citizen, whether a graduate of a historically black college or university, type of institution attended (public or private), receipt of full tuition remission, knowledge area, and year of graduation. Institutional characteristics were university type (public, private nonprofit, or private for profit) and the Carnegie Classification of Institutions of Higher Education. This classification system is a framework that assigns institutions that confer doctoral degrees into the following categories based on measures of research activity: highest research activity (R1), higher research activity (R2), moderate research activity (R3), and other special focus and tribal colleges. 16 On the SED, respondents identify their field of study from a list of 331 academic codes. 15 We included graduates who selected a discrete code for biostatistics, environmental health sciences, or epidemiology. Because the SED did not include discrete codes for health services administration, we conflated graduates who selected either \"health policy analysis\" or \"health systems/service administration\" into a \"health services administration\" category. In addition, social behavioral sciences did not receive a discrete code until 2015. We assumed that participants who received doctoral degrees in social behavioral sciences before 2015 selected \"public health general\" as their field of study. As a result, we conflated respondents in 2015 who selected social behavioral sciences with all years of \"public health general,\" which we referred to as \"general public health.\"\nWe calculated descriptive statistics to examine trends in the number of underrepresented minority doctoral graduates in each knowledge area. We used the Pearson w 2 and Fisher exact tests to examine differences in the number of underrepresented minority doctoral graduates by race among the independent variables. We also used 2 logistic regression models to examine the associations between independent variables and 2 dependent variables. The dependent variables in our models included the rate of underrepresented minority graduates (model 1) and the rate of underrepresented minority graduates who accepted employment in academia (model 2). In both models, we determined the adjusted odds of being in each of our dependent variables, controlling for gender, age, married or in a marriage-like relationship, number of dependent offspring, US citizenship status, public health knowledge areas, Carnegie classification of the degreegranting institution, whether tuition remission was provided during doctoral studies, type of university from which the degree was granted, and the year of graduation. We conducted all analyses using SPSS version 24.0. 17 We considered P < .05 to be significant."}, {"section_title": "Results", "text": "Overall, 11 771 persons received a doctoral degree in 1 of the public health knowledge areas from 2003 through 2015 (Table 1) . Most of the 11 771 doctoral degree recipients were female (n ¼ 7879, 66.9%), were US citizens (n ¼ 8028, 68.2%), were white (n ¼ 5913, 50.2%), were married or in a marriage-like relationship (n ¼ 7089, 60.2%), and had received their degree from an R1 university (n ¼ 9478, 81.3%). The most common public health knowledge areas were general public health (n ¼ 4248, 36.1%), epidemiology (n ¼ 3806, 32.3%), and biostatistics (n ¼ 1696, 14.4%), and the least common knowledge areas were health services administration (n ¼ 1209, 10.3%) and environmental health (n ¼ 812, 6.9%). Eighty-three (0.7%) graduates received a doctoral degree from a historically black college or university. The total number of public health doctoral recipients increased during the study period, from 631 in 2003 to 1348 in 2015.\nDoctoral degree recipients from underrepresented minority groups included 1241 (11.3%) black persons, 576 (5.3%) Hispanic persons, and 353 (3.2%) persons from other underrepresented minority groups (Table 2) . Asian persons constituted 2887 (26.3%) doctoral degree graduates during the study period. Graduates from underrepresented minority groups constituted a larger proportion of doctoral degree recipients over time, from 91 of 592 (15. During the study period, 118 of 1608 (7.0%) graduates in biostatistics (P < .001), 108 of 705 (15.3%) graduates in environmental health (P < .001), 597 of 3562 (16.8%) graduates in epidemiology (P < .001), and 188 of 1097 (17.1%) graduates in health services administration (P ¼ .006) were significantly less likely than all other doctoral graduates (2170 of 10 970; 19.8%) to be from underrepresented minority groups. Compared with all other doctoral graduates, doctoral graduates in general public health (1159 of 3998, 29.0%) were significantly more likely to be from an underrepresented minority group (P < .001; Table 3 ).\nOverall, 3737 of 11 771 (31.7%) survey respondents had accepted an academic position at the time of the survey. Within knowledge areas, rates of academic employment among graduates ranged from 26.7% in health services administration (323 of 1209 health services administration graduates) to 35.5% in biostatistics (602 of 1696 biostatistics graduates). Black doctoral graduates were significantly less likely than white doctoral graduates to indicate having accepted an academic position during each survey period (ie, 2003-2007, 2008-2011, and 2012-2015) among biostatistics, epidemiology, and general public health doctoral graduates (all P < .001). When compared with white doctoral graduates, Hispanic doctoral graduates did not generally differ with respect to having accepted an academic position, with the exception that fewer Hispanic doctoral graduates were in health services administration and general public health during some years. The sample of Hispanic doctoral graduates was small during several years and in several knowledge areas (Table 2) .\nIn regression analyses, being married or in a marriage-like relationship was significantly negatively associated with being in an underrepresented minority group (adjusted odds ratio [aOR] ¼ 0.50, P < .001) and being an underrepresented minority who had accepted an academic position (aOR ¼ 0.68, P < .001; Table 4 ). Overall, underrepresented minority doctoral graduates were more likely than graduates from non-underrepresented minority groups to have 1, 2, or 3 children. Compared with doctoral graduates from the general public health knowledge area, graduates from all other public health knowledge areas were less likely to be either an underrepresented minority or an underrepresented minority who had accepted an academic position. Whereas doctoral graduates in underrepresented minority groups were significantly more likely to be graduates of an R3 institution than an R1 institution (aOR ¼ 5.81, P < .001), they were less likely to graduate from a private for-profit university than from a public institution (aOR ¼ 0.66, P ¼ .05). Graduates who reported that they were Hispanic were assigned to the appropriate Hispanic category, regardless of racial designation. Hispanic/Latino includes all persons who selected Mexican or Chicano, Puerto Rican, Cuban, and other Hispanic or Latino/a. Other includes American Indian/Alaska Native, Native Hawaiian or other Indigenous groups, and 2 racial backgrounds. Underrepresented minority includes black, Hispanic, American Indian/Alaska Native, Native Hawaiian, Pacific Islander, and 2 races. The Carnegie Classification of Institutions of Higher Education assigns institutions that confer doctoral degrees into 3 categories based on measures of research activity. Other refers to schools that did not receive 1 of these 3 designations because they had been identified as a tribal college or special focus institution. The core knowledge areas of public health are biostatistics, environmental health sciences, epidemiology, health services administration, and social and behavioral sciences. Social and behavioral sciences is included in general public health.\nIn addition, doctoral graduates in underrepresented minority groups who had accepted an academic position were significantly more likely than doctoral graduates from non-underrepresented minority groups to have received full tuition remission while doctoral students (aOR ¼ 1.23, P ¼ .03). Beginning in 2010 (aOR ¼ 1.48, P ¼ .01) and through 2015 (aOR ¼ 1.42, P ¼ .04), the number of doctoral graduates in underrepresented minority groups who received doctoral degrees increased significantly from the baseline year of 2003. However, the number of doctoral graduates in underrepresented minority groups who had accepted an academic position did not differ significantly during the study period. Interactions between each knowledge area and year were not significant in either model."}, {"section_title": "Discussion", "text": "One of the main findings in our analyses was that the number of underrepresented minority doctoral graduates in public health increased from 2003 to 2015. In 2015, for the first time, the proportion of all doctoral graduates who were from an underrepresented minority group approached the proportion of the US population who were from underrepresented minority groups. 10 However, because it occurred only in 2015, additional effort will be required to get to the point where the total number of doctoral graduates in underrepresented minority groups reflects US population proportions. We also found significant differences in underrepresented minority doctoral graduates by public health knowledge area. Compared with other knowledge areas, graduates trained in general public health, which includes social and behavioral sciences, were most likely to be from an underrepresented minority group, whereas graduates trained in biostatistics and epidemiology were least likely to be from an underrepresented minority group. This finding may be because underrepresented minority doctoral graduates are more likely to focus on health disparities and other issues that affect vulnerable populations 7 ; these topics may be more commonly aligned with general public health and/or social and behavioral sciences. Our findings pertaining to biostatistics and epidemiology echo previous research that found persons from underrepresented minority groups are less likely than persons from non-underrepresented minority groups to pursue careers in science, technology, engineering, and mathematics. 18, 19 Although the overall number and proportion of doctoral graduates from underrepresented minority groups increased during the study period, this increase was mostly driven by increases in the number of black doctoral graduates. The percentage of Hispanic doctoral graduates was low, ranging from 4% to 7% during the study period. Doctoral graduates in public health from \"other\" underrepresented minority groups were also rare. Notably, in our study, Hispanic students were underrepresented among doctoral graduates in biostatistics and health services administration. Our data showed that whereas few Hispanic persons obtained doctoral degrees in public health, overall, 32% of Hispanic doctoral graduates had an academic job at or around the time of graduation, a rate that was similar to the rates among persons from non-underrepresented minority groups (white and Asian). Thus, the experiences of Hispanic doctoral graduates may not be the same as the experiences of doctoral graduates in other underrepresented minority groups, particularly black graduates. Methods to attract more Hispanic and black persons into academia may require separate studies to understand how program application, acceptance, matriculation, and graduation rates vary for each underrepresented minority group. Moreover, the Hispanic category includes persons from various cultures, which may mask important differences among graduates with differing Hispanic heritages. Given that the number of Hispanic and other underrepresented minority graduates in health sciences disciplines is growing, 20 more research is needed to understand the relative lack of similar growth in the proportion of this minority group obtaining doctoral degrees in public health.\nWe also found that despite increases in the number of black doctoral graduates over time, we did not observe commensurate increases in the proportion of black graduates who had accepted an academic position at the time of graduation. This pipeline has long been analogized as one in which students flow through graduation and into academic positions. 21 Our findings suggest a \"leaky pipeline,\" similar to other disciplines, 22, 23 whereby gains in graduation rates among black persons do not translate into similar flows into academic positions. In other words, the pipeline for underrepresented minority doctoral graduates to faculty members is leaking. As such, improvements in the pipeline of persons from underrepresented minority groups to academic positions is a challenge in public health. The lack of a racially and ethnically diverse faculty could potentially exacerbate the leaky pipeline, because faculty members from racial/ethnic minority groups are known to mentor students from Graduates who reported that they were Hispanic were assigned to the appropriate Hispanic category, regardless of racial designation. Hispanic/Latino includes all persons who selected Mexican or Chicano, Puerto Rican, Cuban, and other Hispanic or Latino/a. Other includes American Indian/Alaska Native, Native Hawaiian or other Indigenous groups, and 2 racial backgrounds. Underrepresented minority includes black, Hispanic, American Indian/Alaska Native, Native Hawaiian, Pacific Islander, and 2 races. Of 11 171 graduates, 10 970 selected a race or ethnicity category. Graduates who reported that they were Hispanic were assigned to the appropriate Hispanic category, regardless of racial designation. Hispanic/Latino includes all persons who selected Mexican or Chicano, Puerto Rican, Cuban, and other Hispanic or Latino/a. Other includes American Indian/Alaska Native, Native Hawaiian or other Indigenous groups, and 2 racial backgrounds. Underrepresented minority includes black, Hispanic, American Indian/Alaska Native, Native Hawaiian, Pacific Islander, and 2 races. d P < .05 was considered significant. e Some participants did not provide this information. Percentages were calculated based on graduates who provided this information at the time of survey completion.\nf The Carnegie Classification of Institutions of Higher Education assigns institutions that confer doctoral degrees into 3 categories based on measures of research activity. Other refers to schools that did not receive 1 of these 3 designations because they had been identified as a tribal college or special focus institution.\nracial/ethnic minority groups, and this mentoring can influence students' selection of academic careers. 9 Our study found a positive association between doctoral graduates from underrepresented minority groups who received full tuition remission as doctoral students and accepted an academic position. This finding may be a function of several factors, including that doctoral students who receive tuition remission may be mentored as part of their assigned research or teaching assistantship. We recognize that receiving full tuition support may also select for certain traits and/or interests that may increase one's proclivity to pursue-or be recruited to-an academic position. Anecdotally, we believe that the mentorship received by doctoral students with research or teaching assistantships helps to prepare them for success on the academic job market regardless of race. Others research has noted that good mentorship allows doctoral students to better express their true self, including their racial identity. 24 This information may be an important area for future research, with an emphasis on whether mentorship plays a role in the leaky pipeline phenomenon."}, {"section_title": "Limitations", "text": "Our study had several limitations. First, the SED is administered at or around the time of graduation, when not all doctoral recipients may have found employment. Nevertheless, our data provide a glimpse into the differences in job placements at this period in a doctoral student's career, which may predict continued success in academia. Moreover, we recognize that the survey forces respondents to select categories that may not accurately describe their true racial/ethnic identity. Although the questionnaire has racial/ethnic categories that would have allowed for a more in-depth analysis of racial differences (eg, American Indian/Alaska Native, Cuban, Mexican or Chicano, or Puerto Rican), small sample sizes prevented us from testing for such differences. We acknowledge the important differences in these smaller groups and call for additional qualitative research to explore how these differences may contribute to experiences in doctoral education that may lead to academic positions. Lastly, although our data represented a near census of all public health doctoral recipients during the study period, our data did not include persons who applied to doctoral programs, matriculated, but then failed to graduate from the programs. Analyzing data on these persons could shed light on many of the trends we identified in our study."}, {"section_title": "Conclusions", "text": "Given the importance of a diverse public health faculty workforce, our research can help schools and programs of public health and other stakeholders to increase the number of persons from underrepresented minority groups in the public health field. Schools and programs of public health may consider programs aimed at increasing the number of underrepresented minority doctoral graduates, especially graduates who choose an academic career. In the management discipline, The PhD Project, founded in 1994, has successfully helped educate minority doctoral students about business doctoral degrees and supported their entry into academic careers. The PhD Project has been credited with an annual rise in the number of earned PhD degrees by minority students from 294 in 1994 to more than 1300 in 2018. 25 The public health field could consider a similar program to increase the number of underrepresented minority faculty members in academic public health fields."}, {"section_title": "Declaration of Conflicting Interests", "text": ""}]