[{"section_title": "Abstract", "text": "Educators have growing concerns about students who learn to read proficiently by third grade but fall behind in later grades. This study investigates the prevalence of \"late-emerging\" reading difficulties among English language learners (ELLs) and native English speakers from diverse socioeconomic backgrounds, using longitudinal data on a nationally representative sample of U.S. students. Results indicate that substantial proportions of both groups develop difficulties during the upper elementary and middle school grades. ELLs and students from low socioeconomic backgrounds are at significantly elevated risk for late-emerging difficulties; ELLs and non-ELLs from similar socioeconomic backgrounds are at similar risk."}, {"section_title": "R", "text": "esearchers and policy makers have often focused on preventing reading difficulties in early childhood, through studies that identify predictors of early reading problems (Snow, Burns, & Griffin, 1998) and policies intended to increase the number of students who read proficiently by third grade (e.g., Reading First). Recently, there have been growing concerns about students who succeed in learning to read in the primary grades, but then fall behind in the upper elementary or middle school grades (e.g., Carnegie Council on Adolescent Literacy, 2010; Catts, Hogan, & Adlof, 2005; Leach, Scarborough, & Rescorla, 2003; Lipka, Lesaux, & Siegel, 2006) . This phenomenon of \"late-emerging\" reading difficulties may be particularly common among underserved populations, including students who are English language learners (ELLs) and/or from low socioeconomic backgrounds.\nCross-sectional studies have shown that ELLs disproportionately demonstrate reading difficulties at various grade levels (e.g., National Center for Education Statistics, 2009). However, without large-scale longitudinal data on this population, it is unknown what proportions of these difficulties emerge in the primary, upper elementary, and middle school grades. ELLs who enter U.S. schools in kindergarten face the challenge of learning to read in a language in which they are not yet proficient, so elevated risk for early reading difficulties is expected (Snow et al., 1998) . It is less clear whether ELLs who learn to read proficiently by third grade remain at higher risk for developing later reading difficulties. Many educators expect that by the upper elementary grades, most U.S.-educated ELLs have acquired at least basic oral English and thus can achieve age-appropriate English reading levels. Yet several studies suggest that ELLs generally have less difficulty in developing the word-reading skills that constrain reading in the primary grades than they do with learning the vocabulary and higher-order skills that increasingly influence reading comprehension after third grade (for a review, see Lesaux, Koda, Siegel, & Shanahan, 2006) .\nIn addition, low socioeconomic status (SES) is known to put students at elevated risk for early difficulties (Snow et al., 1998) , but it is less clear how SES relates to risk of late-emerging difficulties. Differences in SES are associated with differences in access to a variety of resources that support reading development and academic achievement, and robust relationships exist between SES and reading achievement at the individual and school levels (e.g., White, 1982; Sirin, 2005) . However, it is likely that the influences of SES on students' reading development change over time, raising questions about the role of SES in late-emerging difficulties. Given that ELLs disproportionately come from low-SES backgrounds, there is a need to investigate the extent to which SES explains ELLs' elevated risk for reading difficulties during various developmental periods."}, {"section_title": "The Current Study", "text": "Using longitudinal data on a nationally representative sample from the Early Childhood Longitudinal Study-Kindergarten (ECLS-K) Cohort, this study investigates the prevalence of earlyand late-emerging reading difficulties among U.S.-educated ELLs and native English speakers. Discrete-time survival analysis was used to compare the probabilities within the two populations for the emergence of reading difficulties during three periods: before spring of third grade, between spring of third and spring of fifth grade, and between spring of fifth grade and spring of eighth grade. The population of ELLs was defined as students who came from homes with a primary language other than English and performed below a publisher-created cut-score on a screening assessment of oral English in the fall of kindergarten. Thus this population includes students who were initially designated by their schools as \"limited English proficient\" but later gained oral English proficiency and lost that designation; this time-invariant definition of the population based on initial proficiency is an improvement over cross-sectional analyses that are limited to ELLs with \"limited English proficient\" designations at a later time. Reading difficulty was defined as scores below the 25th percentile on ECLS-K's reading test, an assessment of students' overall English reading proficiency that drew on the National Assessment of Educational Progress framework. SES was measured using a latent, time-invariant composite, based on five waves of survey data on parents' education, occupation, and income, and standardized such that zero represented the national average SES level and 1 unit difference represented a standard deviation difference in the national distribution of SES. Appropriate sampling weights were used to support generalizations to the population of U.S. students. (For further details, see supplemental document available on the journal website)."}, {"section_title": "Results", "text": "Substantial proportions of both ELLs and native English speakers demonstrated reading difficulties that emerged in the upper elementary (9% and 4%, respectively) and middle school grades (9% and 7%, respectively). As shown in Figure 1 , ELLs were at substantially greater risk than native English speakers for newly emerging difficulties at each developmental period; at each of Grades 3, 5, and 8, the hazard probability of reading difficulties (i.e., the probability of scoring below the 25th percentile, conditional on not previously having done so) was significantly greater for ELLs than for native English speakers (all ps < .05).\nIn addition, students with lower SES were at substantially higher risk for developing reading difficulties during each developmental period, compared with students with higher SES, as shown in the left panel of Figure 2 . This positive effect of SES was significant for all three periods, but stronger for earlyemerging difficulties than for late-emerging difficulties, as shown by the relatively steeper decline of the solid black line. As a result, the developmental period with the highest risk differs by SES. Although students with below-average SES are at elevated risk during all periods, they are at substantially greater risk for difficulties that emerge before Grade 3 than they are for difficulties that emerge later. In contrast, while students with above-average SES are at relatively low risk during all periods, they are at slightly higher risk for difficulties that emerge between Grades 6 and 8 than they are for difficulties that emerge before Grade 3. When SES is taken into account, the differences in risk between ELLs and native English speakers are substantially reduced, such that only the difference in risk of early-emerging difficulties remains statistically significant (p = .0242). As shown in the right panel of Figure 2 , ELLs are more likely than native English speakers of the same SES to demonstrate reading difficulties by Grade 3. In contrast, ELLs and native English speakers with the same SES are not significantly different in their risk for difficulties that emerge in the upper elementary grades (p = .4737) or middle school (p = .9974). (See supplemental document for additional results.) Given that most ELLs in the sample also had low-SES status (see supplemental document), this suggests that SES, rather than ELL status, is the most predictive of these two confounded risk factors for late-emerging difficulties."}, {"section_title": "Discussion", "text": "These findings indicate that a substantial proportion of students who succeed in learning to read in the primary grades go on to encounter difficulties after third grade, confirming findings from prior research conducted with smaller samples (e.g., Catts et al., 2005; Leach et al., 2003; Lipka et al., 2006) . Moreover, students who are ELLs and those from low-SES backgrounds disproportionately demonstrate such difficulties, although SES may explain ELLs' elevated risk of late-emerging difficulties. In addition, among students from high-SES backgrounds, the risk for difficulties emerging in middle school was slightly higher than the risk for early-emerging difficulties, suggesting that the particular challenges of adolescent literacy are not limited to students from low-SES backgrounds (Carnegie Council on Adolescent Literacy, 2010). To address this study's limitations, further research is needed using multiple reading measures, including measures of ELLs' proficiency in their native languages. Future studies should also investigate the extent to which instructional and structural constraints on opportunities to learn explain the elevated risk of students who are ELLs and those from low-SES backgrounds. Nonetheless, these findings highlight the importance of understanding and addressing reading difficulties that emerge after third grade."}, {"section_title": "NoTE", "text": ""}]