[{"section_title": "Abstract", "text": "Die Dokumente auf EconStor dürfen zu eigenen wissenschaftlichen Zwecken und zum Privatgebrauch gespeichert und kopiert werden.\nSie dürfen die Dokumente nicht für öffentliche oder kommerzielle Zwecke vervielfältigen, öffentlich ausstellen, öffentlich zugänglich machen, vertreiben oder anderweitig nutzen.\nSofern die Verfasser die Dokumente unter Open-Content-Lizenzen (insbesondere CC-Lizenzen) zur Verfügung gestellt haben sollten, gelten abweichend von diesen Nutzungsbedingungen die in der dort genannten Lizenz gewährten Nutzungsrechte."}, {"section_title": "O R I G I N A L A R T I C L E Open Access", "text": "Once an entrepreneur, always an entrepreneur? The impacts of skills developed before, during and after college on firm start-ups whether parents owned a business (Dunn and Holtz-Eakin, 2000; Fairlie and Robb, 2007; Jia and Lan, 2013; Lechmann and Schnabel 2014) ; ethnicity (Borjas and Bronars, 1989; Fairlie and Meyer, 2000; Fairlie, 1999) ; access to finance (Holtz_Eakin et al., Holtz-Eakin et al. 1994; Dunn and Holtz-Eakin, 2000) ; managerial attributes (Fairlie, 2002) ; government tax and transfer policies (Blau 1987) ; technical change lowering minimum efficient scale (Blau 1987) ; and business cycle conditions (Evans and Leighton, 1989 ). However, not until Lazear's (2004 Lazear's ( , 2005 work did empirical tests directly confront the unobserved entrepreneurial ability that drives the models of Rosen, Schultz, Murphy et al., Romer and Lucas. Lazear (2004, 2005) hypothesized that entrepreneurs have an innate managerial skill that drives their interest to enter entrepreneurship. However, to be successful, entrepreneurs need to be able to understand and direct many aspects of their operations. That requires a diversity of skills that can complement the more specialized skills of their employees. Entrepreneurs will invest in a broad range of skills that insure at least a minimum competency in all the areas that are critical to the functioning of their business. Consequently, entrepreneurs become \"Jacks-of-All-Trades\" (JAT). In contrast, their employees are rewarded for their maximum production capacities. That means laborers have an incentive to specialize their human capital investments in a single area so as to hone a single skill to its maximum potential. Lazear used data on the educational and occupational choices made by a sample of Stanford MBA graduates to test the model's predictions. He measured the breadth of skills alternatively by the number of professional positions held or by the breadth of the academic program in business school. More specialized students chose to work for others, while more generally trained students were more likely to start a business after graduation.\nSeveral studies have tested the predictions of the JAT theory. Wagner (2006) and Lechmann and Schnabel (2014) found more general skills led to a higher probability of entrepreneurship. However, alternative interpretations of the link between general human capital investments and entrepreneurship have been advanced. Åstebro and Thompson (2011) and Oberschachtsiek (2009) examined whether the correlation between breadth of human capital investments and entrepreneurship was due instead to a taste for variety. They hypothesized that individuals with greater tastes for variety may seek out more varied careers including entrepreneurial ventures, finding mixed evidence on whether the taste for variety or JAT was more consistent with the data. In a similar vein, Silva (2007) argues that unobservable taste or productive factors lead to both greater breadth of human capital investments and entrepreneurship in Italy. He finds that after controlling for individual fixed effects, the significant positive correlation between past number of jobs and probability of entering entrepreneurship disappears. However, his methodology does not rule out that both entrepreneurial entry and occupational choices are due to an innate unobserved ability, the ultimate driver in the Lazear model. A recent study by Hsieh, Parker and Praag (2011) further finds that more risk averse individuals are more likely to invest in balanced skill profiles and therefore are likely to become entrepreneurs, using the Dutch university graduates dataset. Even within workplaces, workforce educational diversity within a firm in Denmark is found to promote entrepreneurial behavior of employees as well as the formation of new firms (Marino et al. 2012 ). This study's contribution to the empirical and theoretical work on the \"Jack-of-allTrades\" model is to build in the timing of the human capital and occupational choices more explicitly. In doing so, we can examine the variety of educational experiences, variety of working experiences, and entrepreneurial entry as joint decisions. We evaluate those decisions at different times in the life cycle: after leaving high school; after leaving college; and after a period of time in the labor force. In doing so, we can examine the theoretical and empirical implications of allowing individuals to enter or leave entrepreneurship as they learn about their entrepreneurial abilities over time. Our analysis uses a unique data set of more than 5,000 survey responses from Iowa State University (ISU) alumni graduating with a Bachelor's degree between 1982 and 2006. The survey, conducted by the end of 2007, includes questions about business start-ups, work histories of alumni after graduation, and family background, socioeconomic characteristics and extracurricular activities before college. Information on academic diversity and success was merged in using data from each student's academic record in the University.\nConsistent with our logical extensions of the JAT, we find that unobservable productivities for entrepreneurship have common positive effects on breadth of college curriculum, diversity of occupational experiences, and probability of starting a business. Students with more diverse academic programs are more likely to enter entrepreneurship. As time since graduation increases, the importance of academic diversity declines, while the diversity of work experiences since college becomes more important. In particular, we find that individuals whose academic programs are more specialized may ultimately enter entrepreneurship, but are more likely to do so by picking more diverse occupational experiences to broaden their human capital portfolios before starting a business.\nThe next section extends Lazear's \"Jack-of-all-Trades\" model of entrepreneurship to two periods to show how and why occupational decisions can change over the life cycle, driven by both the mechanism of JAT theory and the unobserved entrepreneurial abilities. The theory leads to an empirical strategy which we outline next. Then, we present a summary of the data used to evaluate academic, occupational and entrepreneurial decisions. Section 4 proposes an empirical strategy and test hypotheses and reviews the empirical results. The last section concludes the paper."}, {"section_title": "A model of occupational, educational, and entrepreneurial choices", "text": "We illustrate the key elements of the entrepreneurial entry decision using a twoperiod model of human capital choices and occupational choices 1 . At the start of the first period, individuals encounter an entrepreneurial shock and simultaneously choose whether to be an entrepreneur or a laborer based on their expected entrepreneurial abilities. The choice of occupation is made simultaneously with human capital investments so as to maximize expected lifetime earnings. Then at the beginning of the second period, individuals may adjust their career and human capital choices upon receiving updated information on their true entrepreneurial abilities. Individuals who switch occupations will have to modify their human capital investments and may end up with some skills that are no longer used in period 2.\nFollowing Lazear (2005) , we assume that a laborer's income is related to specialized skills. Thus, if human capital is measured along two dimensions, x"}, {"section_title": "È ð2Þ", "text": "This leads to four possible cases: Case 1 An individual is an entrepreneur in both periods 1 and 2. Case 2 An individual is an entrepreneur in period 1 but becomes a laborer in period 2.\nCase 3 An individual is a laborer in period 1 but switches to become an entrepreneur in period 2.\nCase 4 An individual is a laborer in both periods 1 and 2. We will discuss each of these cases in turn, using Figure 1 to illustrate the conditions that would cause someone to switch occupations. It should be apparent that if entrepreneurial abilities were known with certainty so that ε 2 = 0, individuals would never switch. Therefore, learning one's potential for opening or managing a business occurs gradually over time. Figure 1 illustrates the conditions for entrepreneurial entry and persistence as a function of initial information on entrepreneurial ability (λ 1 ) and acquired information (λ 2 )."}, {"section_title": "Case 1: Persisting entrepreneurs", "text": "For an individual to be an entrepreneur in period 1, λ 1 ≥ 2 andx Figure 1 Illustration of optimal occupation choices and returns in the first period (upper right corner) and in the second period (upper left corner). Note: In the upper left coordinate, the black solid line represents the second period return, conditional on being an entrepreneur in the first period. The gray solid line presents the second period return, conditional on being a laborer in the first period and H 2 ≥ H 1 . The dashed gray line represents the second period return, conditional on being a laborer in the first period and\nas an entrepreneur in period 2, even with a negative draw on ε 2 . The individuals for whom 1 þ H 2 H 1 þH 2 < λ 2 < 2 would have chosen to be laborers in period 1 if they had perfect knowledge of their entrepreneurial abilities in period 1 (i.e., if they knew ε 2 ). They remain entrepreneurs because their human capital investments in period 1 are irreversible and they cannot acquire enough specialized human capital in period 2 to make a transfer to laborer financially attractive.\n5 Individuals are more likely to persist as entrepreneurs when avenues for additional human capital accumulations in period 2 are limited relative to period 1 (H 2 ≪ H 1 ) as well as when they experience positive realizations on ε 2 . Earnings for persisting entrepreneurs will be Y 2 ¼ λ 2\nand so the range of earnings for persisting entrepreneurs is indicated by the upward sloping line Y 2 that begins at point A in quadrant II."}, {"section_title": "Case 2: exiting entrepreneurs", "text": "An individual who initially enters entrepreneurship and then switches to laborer status will devote skill investment in period 2 into only one of the two options, x 2 1 or x 2 2 . Abandoning entrepreneurship will be optimal if λ 2 < 1 þ\n, and so these individuals locate to the right of\nin quadrant II. In switching to laborer status, former entrepreneurs will get no reward from half their period 1 human capital investment, and so their period 2 earnings will be\nExiting entrepreneurs are the ones who experience large negative realizations of ε 2 , meaning that they made a big mistake in assessing their entrepreneurial skill in period 1. There will be more entrepreneurs exiting to laborer status if there are substantial opportunities to acquire specialized skills in period 2 relative to period 1 so that H 2 ≫ H 1 ."}, {"section_title": "Case 3: exiting laborers", "text": "An individual who is a laborer in period 1 devotes H 1 entirely to one skill, either x . That switch from laborer to entrepreneur would only make sense if\nThis condition does not depend on human capital accumulations, and so switching into entrepreneurship in Case (3.A) will depend only on the size of ε 2 . Because of the higher ability to invest in human capital in period 2, these entrepreneurs will have the same human capital as if they had devoted period 1 to entrepreneurship as well. The range of earnings for persisting entrepreneurs is indicated by the upward sloping line Y 2 that begins at point B in quadrant II. Consequently, the range of earnings for those who switch into entrepreneurship in period 2 excludes the lower tail of earnings for persisting entrepreneurs. \n> 2 . Therefore, the condition for switching from laborer to entrepreneur requires an even larger positive shock ε 2 > H 1 H 2 −1 than was required in Case (3.A). Note that if human capital investments are subject to diminishing marginal products, Case (3.B) is more plausible than is Case (3.A).\nThe range of earnings for exiting laborers governed by Case (3.B) is given by the upward sloping line Y 0 2 that begins at point C in quadrant II. These entrepreneurs will earn less than persisting entrepreneurs with identical entrepreneurial skills λ 2 because of the wasted human capital from period 1."}, {"section_title": "Case 4: persisting laborers", "text": "An individual who becomes a laborer in period 1 will remain a laborer in period 2 if λ 2 < 2. It is optimal to continue specializing in the same skill selected in period 1, and so "}, {"section_title": "Probability of becoming an entrepreneur", "text": "Let q be the probability of becoming an entrepreneur at any point in life. Based on our formulations in Cases 1 and 3,\nIt can be shown that\n. A marginal increase in the relative importance of H 1 over H 2 will lead to a higher tendency to start a business. We therefore expect that skill diversity in the first period will affect entrepreneurship to a larger degree as\nincreases. In our empirical work, we will presume that H 2 rises relative to H 1 as the length of period 2 increases."}, {"section_title": "Empirical strategy", "text": "Cases 1 and 4 are the ones that were derived in Lazear (2005) . Our extension to a second period leads to Cases 2 and 3A-B in which individuals can change their entrepreneurial choices over the life cycle. These four cases allow us to derive several predictions that we can take to the data. For our purposes, it is useful to frame these predictions in the context of when we observe individual behavior, at the start of period 1 or at the start of period 2."}, {"section_title": "Period 1", "text": "During period 1, individuals will be planning their human capital investments, given their expected entrepreneurial skill λ 1 . Because λ 1 is unobservable to the econometrician, it will be a source of error in equations explaining the endogenous choices of human capital and occupation. "}, {"section_title": "À Á and", "text": "If Z i is a vector of individual attributes known at the start of period 1 that affects relative earnings in entrepreneurial versus laborer occupations, we can characterize the choices available to individual i at the start of period 1 as\nwhere the right-hand-side of the last equation is the reduced form representation of the structured relationship between E i and V ar H\nÀ Á and Z i . We assume that the error terms ξ E 1i ; k = S, O, E 1 are identically and independently distributed such that Cov ξ\n, E 1 will be correlated because of the common unobserved entrepreneurial skill."}, {"section_title": "Proposition", "text": "Because high values of λ 1 lead to broader human capital investments, we would expect\nThe maintained hypothesis underlying the theory is that human capital investment and entrepreneurial choices are being made simultaneously so as to increase expected lifetime earnings. Consequently, if Z i raises expected entrepreneurial income and increases the probability that E 1i = 1, then it will also increase V ar H S 1i"}, {"section_title": "Start of Period 2", "text": "At the start of period 2, the individual receives the draw on λ 2 . Because the innovation ε 2 is white noise and Cov(λ 1 , λ 2 ) > 0, there will be persistence in the entrepreneurial and human capital choices undertaken in period 1. However some individuals will receive sufficiently large positive or negative draws on ε 2 , which induces a change into or out of entrepreneurship. As a result, there will be several other predictions that can be derived from the theory. We define period 2 empirically as the period following completion of formal school-"}, {"section_title": "ing. By that time, individuals have committed to V ar H S 1i", "text": "À Á prior to the realization of ε 2 .\nHowever, individual i can still alter the mix of occupational or industrial human capital in conjunction with decisions of whether to be an entrepreneur during period 2. We can characterize those choices as\nHigh values of λ 2 will lead to broader human capital investments in period 2 as well as a higher likelihood of entrepreneurial status in period 2. Therefore, the theory requires"}, {"section_title": "Proposition 2.2", "text": "As the time gap between period 2 and 1 increases, θ E S →0. This prediction does not follow directly from our theory as it represents only two periods and there is no time gap between the two. However, in period 2 we have individuals changing their occupations. Case 1 and Case 4 individuals experience no loss of their period 1 human capital. However, Case 2 individuals moving from E 1 to L 2 will find that half of the human capital they generated in period 1 will be wasted. Case 3.B individuals moving from L 1 to E 2 will waste part of their period 1 investment in specialized human capital. Case 3.A individuals moving from L 1 to E 2 base their decision without regard to period 1 human capital investments. For these three cases, period 1 human capital investments become less tied to entrepreneurial status in period 2. This lost correlation will become even more evident as Period 2 lengthens and H 2 increases relative to H 1 . Note that occupational or sectoral work decisions will continue to be adjusted with the entrepreneurial decision in period 2, and so the correlation between E 2i and V ar H O 2i À Á will not diminish over time."}, {"section_title": "End of period 2", "text": "It is easier to examine evidence for Proposition 2.2 if we consider examining data at the end of period 2 after occupational or sectoral employment decisions have been made. We can then modify (3.1) as\nwhere we are defining period 2 as composed of T i subperiods from the timing of school leaving until the time we observe occupational status. If period 1 human capital investments decay in value over time, whether because new information on entrepreneurial skills alters entrepreneurial trajectory or because human capital is subject to depreciation over time,\n> 0Þ, ω S1 >0 and ω S2 < 0. On the other hand, the diversity of occupational experiences should increase the probability of entering entrepreneurship so that ω O > 0. Note that individuals who enter entrepreneurship early in their careers will have a relatively narrow mix of work experiences, and so one would expect the impact of occupational or sectoral job diversity to be biased downward. As we will see, that concern does not seem to alter our conclusions from empirical tests of the theory, perhaps because even those who plan to enter entrepreneurship at an early age will try to establish a mix of occupational experiences soon after leaving school."}, {"section_title": "Data", "text": "The sample of alumni analyzed throughout this study is drawn from Iowa State University bachelor's degree recipients between 1982 and 2006. By the end of 2007 when the survey was conducted, the sampling population consisted of 84,917 alumni. The sampling rate was approximately 24 percent. The total sample drawn was 25,025. We received 5,416 usable surveys for a response rate of 21.6 percent 7 . The survey elicits information on all jobs held since graduating from ISU including whether the individual ever started a business. That survey information serves as the basis for our study of entrepreneurial entry. The ISU survey includes BA recipients from a land-grant institution that is obligated to accept applications from any resident that finished in the top half of his or her high school class. After excluding those who are still students or retired by the end of 2007, we find that 91% of alumni have consistent employment history after graduation. Among them, 88% have been laborers and 3% of students started a business in five years after graduation and have continued to be entrepreneurs until when surveyed. The remaining 9% of students switch between self-employment and employment. In particular, 7% of them worked as laborers right after graduation and then started a business five years later. Two percent of them were self-employed within five years after graduation but switched to employment later. Compared to Stanford MBAs, our sample will reflect a much broader range of abilities, family incomes, and interests in business. In contrast, Stanford MBAs will be drawn atypically from the upper tail of distributions of socioeconomic status, cognitive ability, and business interests. At minimum, it is useful to examine the extent to which the JAT theory predictions extend to a less selective population that is also less naturally oriented toward entrepreneurship. For each alumni respondent to the ISU survey, we were allowed to merge in information from their academic record. The match worked very well, with only 3 out of 5,416 observations missing. The student's transcript provides complete information on college major(s), coursework inside and outside the major, coursework in mathematics, science and business, and academic performance. The student record also adds information on gender, high school rank, and high school coursework.\nThe JAT theory predicts that those interested in entrepreneurship will select a more diverse academic program. Following Lazear, we define a variable AC_SPEC i to measure the degree of specialization in individual i's academic program. The value is the number of courses in the major minus the average number of courses taken in other departments. This is an inverse measure of the variance in academic human capital invest- generate systematic differences in course diversity, in the following regressions, we control the fixed effect of students' colleges. This makes students' academic diversity comparable when holding course portfolio of college programs constant. Table 1 shows the average levels of academic diversity for entrepreneurs and laborers by cohort. There are significant differences in academic diversity only for the most recent cohort which was surveyed within five years of graduation. For that group, nonentrepreneurs have two more courses inside their major than entrepreneurs. The differences diminish in magnitude and significance as time since graduation increases, consistent with one prediction from the theory that diversity in academic skills will be more relevant to entrepreneurial entry when not much time has elapsed since graduation.\nWe use two measures of the diversity of work experiences as our proxies for V ar . Table 2 reports the average values of OCCUPATIONS i and INDUSTRIES i for entrepreneurs and wage workers. Entrepreneurs consistently have held more occupations and worked in more industries since graduation than non-entrepreneurs, although the difference is not always Note: Number in the bracket is standard error of mean estimates. Variable AC_SPEC is defined as number of courses in the major minus the average number of courses taken in other departments. *, ** and ***represent statistic significance at 10%, 5% and 1%, respectively. statistically significant. Note that individuals with successful entrepreneurial ventures will stop seeking other work, and so the bias in number of occupations would be against the JAT prediction that entrepreneurs would have more diverse work experiences 10 . Proposition 1.1 suggests that individuals with strong draws on entrepreneurial skill will have consistently broad academic and occupational experiences. As a result, we should see that those who select more varied academic programs will also have more varied work histories. The first-pass look at the data appears to be consistent with that expectation. In Table 3 , we examine the occupational choices of alumni with the 25% most and 25% least diverse programs of study. Graduates from more narrowly focused majors also tend to have more specialized work careers. Graduates who had broader academic training have a slightly greater tendency toward more diverse work careers.\nWhile the broad tendencies in the data appear to be consistent with the JAT theory, we need to examine whether the first-pass evaluations hold up to controls for other covariates that could affect decisions on academic and occupational choices. Summary statistics on those covariates are shown in Table 4 . The sample statistics are reported by early entrepreneurs (those who opened a business within five years of graduation), later entrepreneurs, and non-entrepreneurs. Consistent with national data on the incidence of self-employment, 15.8% of the ISU alumni have started a business. Entrepreneurs were atypically male, from larger families, and from families that owned a business. Non-entrepreneurs were better students in high school but the two groups performed equally well in college. Entrepreneurs atypically studied agriculture or business, but significant fractions from each college became entrepreneurs. By the time of graduation, entrepreneurs are more likely to be married. Consistent with Tables 1 and Note: a In order to alleviate problems of underestimating occupational experience for entrepreneurs, we constrain the entrepreneur's sample to include the ones who started businesses between 2002 and 2007 and survived till the end of 2007, when the survey was conducted. In fact, even using the most conservative measure of occupation diversity without adjusting timing, we find individuals significantly hold 0.7 more occupations than those who never start a business. Number in the bracket is standard error of mean estimates. *, ** and ***represent statistic significance of differences in work experience diversity between current entrepreneurs and other individuals at 10%, 5% and 1%, respectively. 2, entrepreneurs worked in more occupations and industries and had broader academic programs."}, {"section_title": "Empirical findings", "text": ""}, {"section_title": "Period 1: entering college", "text": "The model predicts that individuals will be planning their academic and occupational trajectories before they begin college, given knowledge of their potential entrepreneurial Note: number in the square bracket is standard deviation. Individuals responded to the survey question about the most successful businesses if any. About three quarters of entrepreneurs have only one businesses started. According to the year when their most successful business was started, early entrepreneurs are those who have ever started a business within five years after graduation from ISU. Late entrepreneurs started businesses more than five years after graduation. Without pointing out specifically, probability weight is incorporated in all regressions in the paper to correct potential estimation bias.\nabilities. We test that proposition using equations 3(A-C). \nwhich is the 75th percentile number of occupations. The variable E 1i is alternatively defined as indicating whether individual i has ever started a business or whether individual i has ever started a business that was ultimately successful. We posit that the error terms\nThen the system 3(A-C) can be estimated using a trivariate probit specification 11 . The correlation coefficient between any two random errors out of the three equations is\nA finding of ρ SO > 0, ρ SE > 0 and ρ OE > 0 is consistent with Proposition 1.1 that there is a common unobserved factor λ 1i that generates a positive correlation among the errors in the three decisions. That unobservable factor is consistent with an unobserved entrepreneurial skill. The signs and magnitudes of the parameter β \nThe model presumes that the three choices are subject to a common set of factors Z i that affects returns to all three choices similarly. The results are shown in Table 5 . First, it is apparent that the error term parameters β O λ and β E λ are significantly positive, implying positive correlation coefficients ρ OE , ρ SO and ρ SE . As the effect of λ S is normalized at 1 for schooling diversity, the impacts of diverse occupational and industrial job experiences on entrepreneurial entry are even larger. There is a common unobservable attribute that drives academic, occupational and entrepreneurial choices, consistent with the model predictions of the effect of unobserved entrepreneurial skill.\nThere is also support for the proposition that there are common effects of individual attributes on the three choices. Males, those from larger families with more educated fathers and at least one parent who had started a business were more likely to become entrepreneurs, have a varied work history, and select a more diverse college curriculum. Higher high school class rank lowered the likelihood of all three decisions. Mother's education had a negative effect in the two cases where the coefficients were significant. The only conflicting finding was for ethnic minority status, which raised the probability of entrepreneurship despite increasing both academic and occupational specialization. The overall evidence is that a factor that raises returns to entrepreneurship increases incentives to have diverse occupational and academic experiences as well, consistent with Proposition 1.2. Note: Dependent variables are binary choices. S is equal to one for lower 25th percentile of AC_SPEC at ISU, and zero for the remaining 75% unspecialized alumni. O is equal to one if the number of occupations held by the end of year 2007 is equal or greater than two, which is the 75th percentile of OCCUPATIONS; E is equal to one if individual has ever started a business and remain as an entrepreneur till the end of year 2007. Probability weights are considered in the model and the standard errors are therefore robust. The number in the bracket is the standard error of the corresponding estimate. *, ** and ***represent statistical significance at 10%, 5% and 1%, respectively. Absolute value of z statistics are in parentheses and standard error in square bracket. β S λ is normalized to be one to identify the model."}, {"section_title": "Period 2: leaving college", "text": "Upon leaving college, individuals decide whether to start a business immediately or later or accept employment from someone else. Receiving a high value of λ 2 will motivate individuals to make broader human capital investments in work experience. In the end, this leads to a higher likelihood of entrepreneurial status, consistent with Proposition 2.1 12 . At the same time, the decision will be influenced by the diversity of the academic program, with the prediction from equation (3) and (4) that θ E S > 0 and θ o S > 0. As time goes by and individuals learn more about their entrepreneurial skill, we would expect the importance of the academic program to fall as additional occupational or industrial experiences gain in importance, consistent with Proposition 2.2.\nWe time the analysis in two ways, whether the individual starts a business within five years of graduating, which we refer to as early entrepreneurial entry. We then redo the analysis defining as lifetime entrepreneurs those who ever started a business after graduating. Academic diversity should be more important for early entry, and occupational or industrial diversity should matter more for lifetime entry.\nUsing the specification defined by equation (5) where sectoral employment decisions have been made after graduation, we estimate a logit model of entrepreneurship, including covariates during college and after college. Because older and younger alumni will have different opportunities to acquire occupations, we create a measure AVGOC-CUP, which is OCCUPATIONS divided by years of work experience. The results are shown in Table 6 . The first two columns examine early entrepreneurial entry, and the last two columns examine lifetime entry. More specialized academic programs (high values of AC_SPEC i ) reduce the probability of starting a business within five years of graduation, consistent with Proposition 2.1 13 . Evaluated at the sample mean of AC_SPEC, the marginal effect implies that having an additional course in the student's major will reduce probability of starting a business by 0.11%. In terms of work experience, having an additional one more occupation per year will increase the probability of entrepreneurial entry within 5 years after graduation by 1.7%, again evaluated at the mean of AVGOCCUP. Industry diversity is not significant for early entrepreneurship. Note that even in the short period following graduation, entrepreneurs tend to also have more varied occupational and industrial job experiences than their classmates who engage in wage work. Expanding the time frame to as many as 25 years after graduation depending on graduation date, the importance of academic diversity diminishes in magnitude and significance as suggested by Proposition 2.2. On the other hand, occupational and industrial diversity retains both magnitude and significance of their effects 14 . The marginal effect of occupational diversity is 0.28, which implies a 5.6% increase in entrepreneurial entry from an additional occupation over the five years. Working in one more industry over the five years increased the probability of starting a business by 4.9%. There are some interesting findings from regression results in Table 6 that are worth exploring. Men are significantly more likely to start a for-profit business than women. Marriage and ethnicity also increases likelihood of entrepreneurship. College GPA is only positively correlated with early entrepreneurship but not relevant in lifetime entrepreneurship. Students majoring agricultural and life science, design and human sciences are more likely to be entrepreneurs than those majoring in liberal arts. Higher high school rank lowers the probability of starting a business. High school rank is an observable signal of productivity for employers. Just as high school class rank raises the probability of college admission and merit scholarship (Cohn et al., 2004) , we would expect that it will also increase the wage that employers would offer. That raises the opportunity cost of becoming an entrepreneur. In addition, family background is shown to be relevant to offspring's entrepreneurship. If one of the parents owns a business, individual's entrepreneur-propensity rises substantially. The mother's and father's education affects their children's entrepreneurship in different directions. Father's education significantly boosts individual entrepreneurial entry, but mother's education does not. Our finding is consistent with Fairlie (1999) , who uses father's education as a proxy for wealth in the absence of a measure of parental wealth and finds that father's education is positively related with children's entry into self-employment. Mother's education and growing up with both parents are both correlated with the intergenerational transmission of human capital (Currie and Moretti, 2003) , and so their children may seek more specialization through professional or graduate education instead of entrepreneurship.\nHaving a close friend who starts a business reduces the entrepreneurial probability. This may seem counterintuitive, at first blush, but a similar result was reported by Lerner and Malmendier (2013) . Their field experiment using MBA students found that having a high share of entrepreneurial peers decreases entrepreneurship. Perhaps observing the challenges of entrepreneurship faced by friends discourages entrepreneurial entry."}, {"section_title": "Is this positive correlation in human capital and occupation choices due to taste for variety?", "text": "We have interpreted the positive correlation in the errors of our entrepreneurship, academic diversity and job experience diversity equations as consistent with the existence of an unobservable managerial ability λ that would increase the probability of all these choices. Åstebro and Thompson (2011) and Oberschachtsiek (2009) argued that the positive correlation was not skill but due instead to a preference for variety which led to diverse academic and occupational choices.\nWe can examine this alternative explanation using questions included in the survey that elicit individual taste for variety. The first measure is the number of extra- Note: Numbers in the parenthesis are z-statistics. Coefficients have been converted into marginal effects. *, ** and ***represent statistical significance at the 10%, 5% and 1% levels, respectively. We obtain similar results using a probit specification. The logit model is selected because its thicker tails better accommodate relatively rare events such as being an entrepreneur over a five year period.\ncurricular activities including sports, music, drama, academic clubs, 4-H/ FFA, or scouting in which the respondent participated in high school. The second measure is a binary variable that indicates a preference for nonconforming or unstructured activities or for doing things differently. As can be seen from the logit regression results in Table 7 , these taste indicators do have some ability to explain entrepreneurship. 15 In particular, individuals preferring to do things differently than to do things better are more likely to start a business. We replicated the tests using the number of all business started over the lifetime. As shown in the negative binomial regressions in the last three columns of Table 7 , none of the implications change when we distinguish serial entrepreneurship from one-time entrepreneurs. Even after we control for measures of taste for variety, the measures of occupational variety and academic diversity retain the same effects that they had before. Our findings supporting the role of diverse skills in entrepreneurial choice are not driven by an underlying preference for variety."}, {"section_title": "Is this positive correlation in human capital and occupation choices due to risk aversion?", "text": "Entrepreneurs are believed to be willing to take risk. If risk aversion is correlated with diverse human capital investments strategies, our tests of the JAT mechanism will be subject to a spurious correlation due to omitted variable bias. In fact, Hsieh, Parker and Praag (2011) find that more risk averse individuals are more likely to invest in diverse skills and also to become entrepreneurs. It is clearly shown in Figure 1 that if λ 1 is just a little higher than the entrepreneurship threshold 2, λ 1 = 2 + ϵ where ϵ is positively close to zero, more risk averse individuals may want to equalize human capital investment in H 1 , as long as the risk premium paid is smaller than\n2 : There is no direct measure of risk aversion or risk preference in the survey data. Following Lazear (2005) , we include industry fixed effects to control for different standard Numbers in the bracket are standard errors. *, ** and ***represent statistical significance at 10%, 5% and 1%, respectively. We also include other variables as shown in Table 3 . α is negative binomial distribution parameter.\ndeviations of income by industry or occupation. For each individual, we include dummy variables indicating the various industries and occupations the individual has worked. It is important to note that this method is likely to overcorrect for the role of missing tastes for risk in that the least risk averse may well invest in more diverse academic and occupational skills precisely because they do want to become entrepreneurs, consistent with the theory. The survey elicited information on all past industries and occupations but did not specify the timing of those jobs. Consequently, we are not able to identify which industry and occupation experiences preceded entrepreneurship. For that reason, these regressions drop individuals who entered and left entrepreneurship, and only considers those who either are successful entrepreneurs or who never became entrepreneurs. In the young sample, this adjusted entrepreneurship measure includes entrepreneurs who are still operating the businesses five years after graduation. The lifetime adjusted entrepreneurship measure includes those still operating the business twenty-five years after graduation. Based on logit regressions from Table 6, Table 8 reports the augmented regression results, adding these risk preference factors. Dummy variables of industry fixed effect are jointly significant, indicating that individual-specific industry experiences matter for entrepreneurship. However, adding these controls for industry and occupation fixed effects do not affect the sign, magnitude or significance of any of our measures of academic or job diversity. Our previous conclusion that diverse skills lead to entrepreneurship as predicted by the JAT theory remains robust to these specification changes 16 .\n2.3.5 Do entrepreneurs earn more from skill diversity?\nWe interpret λ as an unobserved entrepreneurial ability that induces individuals to invest in a diversified skill set in anticipation of becoming an entrepreneur. The theory relies on two critical assumptions that are testable: switching from entrepreneurship to Note: Coefficients have been converted into marginal effects. Numbers in the parenthesis are absolute value of t-statistics. *, ** and ***represent statistical significance at 10%, 5% and 1% respectively. We also include number of extra-curricular activities and other variables as shown in Table 3 . Binary industry variables and occupations are shown in the Additional file 1: Table S1 . a\nThe dependent variables are adjusted entrepreneurship, defined as a binary variable, equal to one if an entrepreneur is still working in the businesses he started and equal to zero if an entrepreneur has never started a business within five or twenty-five years after graduating from ISU. wage work will bring an income reduction due to wasted human capital investments; and entrepreneurs get an income premium from diverse skill sets that are not valuable to specialized workers. In this section, we test these hypotheses by analyzing Mincerian income equations. We report the regression results in Table 9 .\nWe should emphasize that these tests are predicated on the observed decisions to switch occupations or to stay in the initial occupation. It is the act of switching occupations that leads to lost human capital investments, and so our estimate of the return to switching is conditional on that decision. The decision itself is based on unobservable negative shocks to the unobserved λ. Similarly, the decision to remain an entrepreneur is predicated on more favorable updated information on the magnitude of λ. Our estimates of these returns must use the observed decisions to move or stay in order for use to estimate the returns conditional on those choices.\nThe first column in Table 9 reports results without any covariate controls. We find a significant income reduction for those who switch from entrepreneurship to specialist status, while there is no significant earnings difference between persistent entrepreneurs and persistent laborers. After controlling for individual characteristics and state fixed effects in the second and third regressions, we find even greater evidence of earnings losses associated with switching out of entrepreneurship and large negative earnings losses from switching into entrepreneurship from wage labor. The latter finding is consistent with Case 3B in which those switching into entrepreneurship are unable to fully balance their skills and waste some of their specialized human capital investments from the first period. Persistent entrepreneurs and persistent laborers who fully utilize their skills, in theory, continue to earn comparable incomes when the controls are added.\nIn the last two columns, we examine the relationship between specialized and general skills and earnings by occupation. Column (4) focuses on the earnings of persistent laborers and column (5) examines the earnings of persistent entrepreneurs, respectively, and test whether entrepreneurs benefit from skill diversity more than specialists. As shown in the last two columns, individual entrepreneurs obtain a significant positive return to academic skill diversity (AC_SPEC), while persistent laborers do not. This confirms that individuals become entrepreneurs because their skill diversity generates higher entrepreneurial productivity, not because individuals have taste in variety, in which case we expect a negative return on skill diversity. Furthermore, experience in more industries is negatively related to laborer's income but positively related to entrepreneur's income. It confirms that entrepreneurs earn more from having more diverse work experience, but laborers maximize income from specialization. Therefore, we complete the test of hypotheses from the dynamic occupation choices model. And we confirm that higher level of unobserved entrepreneurial abilities induces individuals to consistently invest in human capital diversely and benefit from this diversity. Switching occupations due to exogenous shock will lower income because of sunk human capital that is not reversible."}, {"section_title": "Conclusion", "text": "This paper examines the theoretical predictions of the Lazear \"Jack-of-all-Trades\" model of entrepreneurship when multiple periods are allowed and then tests those predictions using data collected from a sample of Iowa State University bachelor's degree Lazear's (2005) paper using a sample of Stanford MBAs are confirmed using this broader sample of college graduates. Individuals selecting broader academic programs and that have more varied occupational and industrial work experiences are more likely to become entrepreneurs. In the Lazear framework, the mechanism driving the positive correlation between academic and occupational choices and entrepreneurial entry is an unobservable entrepreneurial skill. Hence, the positive correlation between academic or occupational diversity and entrepreneurship is not causal but a reflection of a common missing variable that affects all choices in the same direction. This paper explores that Note: Dependent variable is annual income, which is categorical with one indicating less than $25,000 and eight indicating more than $500,000. To save space, the estimated cutoff points are not reported. The cutoff points are jointly significant at 1% level. Models (2) -(5) also control for the individual's current occupation and industry. We also use the USDA Rural-urban Continuum Codes (RUCC, http://www.ers.usda.gov/data-products/rural-urban-commuting-area-codes.aspx) at the county level to control for the degree of urbanization and adjacency to a metro area. Binary industry variables and occupations are shown in Additional file 1: Table S1 .\npossibility by treating choice of academic program, occupational path and entrepreneurship as joint decisions planned at the time of college entry. The results are broadly consistent with the theory. Error terms in the three equations are positively correlated, consistent with the existence of a common unobservable factor that increases the likelihood of all three decisions. Furthermore, observable factors that raise the probability of one decision raise the probability of the other two as well in 12 of 15 instances. We view these results as strong confirmation of Lazear's JAT theory.\nWe are also able to examine evidence of predictions from our extension of the Lazear theory to multiple periods. Most importantly, we find that broader academic programs raise the probability of entrepreneurial entry early in the career, but the effect dissipates over time as individuals gain additional information on their entrepreneurial skills. This finding is consistent with our simple extension of the Lazear JAT theory, further supporting the strength of the insight that entrepreneurs require broad training and workers require specialized training to be successful in their chosen occupational paths. Our study also echoes the finding of the seminal paper on entrepreneurial learning by Jovanovic (1982) that firms learn about their efficiency as they operate in the industry. In our study, though we use proxy measures of preference which may introduce additional noise, we still find evidence of an unobserved entrepreneurial ability affecting occupational choice, and the evidence persists even after controlling for taste for variety and risk aversion.\nWe see two possible interpretations of our findings. One is that individuals intentionally make investment in human capital, including both skills acquired in school and in the workplace, conditional on their knowledge of their own entrepreneurial skill, which is not observed by others. The other is that there might be some unobserved alternative factor that induces individuals to make more diverse human capital investments. Academic diversity then becomes an endowment that raises the probability of starting a business. Though investment in diversity of human capital is not initially triggered by entrepreneurial aspirations, the accumulated diverse skills equip these individuals to enter entrepreneurship."}, {"section_title": "Endnotes", "text": "1 If instead the first period skills are exogenously determined and only the second period occupation decision is modeled, we will still reach similar conclusions.\n2 In Lazear (2005) , λ is interpreted as entrepreneurial premium, representing various possible unobservables such as entrepreneurial abilities, or even envisioning of entrepreneurial abilities. 3 We assume that the cost of investing in two skills is not differentiated, which leaves individuals with choices in skills driven by return to occupation types. 4 Details of solving equation (1) could be available upon requesting authors. 5 This is an alternative rationale for why entrepreneurs earn less than equally skilled non-entrepreneurs, as found by Hamilton (2000) . Hamilton argued that entrepreneurs accept lower income because they get utility from the freedom of running their own businesses. This argument suggests entrepreneurs may also earn less on average if their human capital investments anticipating success as entrepreneurs are subject to depreciation if they switch to wage work."}]