[{"section_title": "Abstract", "text": "[1] A conventional atmosphere-ocean coupled system initialized with NCEP FNL analysis has successfully predicted a tropical cyclogenesis event in the northern Indian Ocean with a lead time of two weeks. The coupled forecasting system reproduces the westerly wind bursts in the equatorial Indian Ocean associated with an eastward-propagating Madden-Julian Oscillation (MJO) event as well as the accompanying northward-propagating westerly and convective disturbances. After reaching the Bay of Bengal, this northward-propagating Intra-Seasonal Variability (ISV) fosters the tropical cyclogenesis. The present finding demonstrates that a realistic MJO/ISV prediction will make the extendedrange forecasting of tropical cyclogenesis possible and also calls for improved representation of the MJO/ISV in contemporary weather and climate forecast models. Citation: Fu, X., and P. Hsu (2011), Extended-range ensemble forecasting of tropical cyclogenesis in the northern Indian Ocean: Modulation of MaddenJulian Oscillation, Geophys. Res. Lett., 38, L15803,"}, {"section_title": "Introduction", "text": "[2] Tropical cyclones pose one of the most dangerous threats to marine activities in several tropical basins [Gray, 1985] and also cause severe damages after making landfall [Webster, 2008; Shen et al., 2010] . Skillful extended-range forecasting of tropical cyclone activities will offer extra time for planning and preparations, which will be a great benefit for the affected communities [e.g., Brunet et al., 2010] . In late April 2008, tropical Cyclone Nargis formed in the Bay of Bengal and landed over southern Myanmar in early May. As a result of the passage of Nargis, over 130,000 lives were lost and countless buildings and infrastructure were destroyed. Due to the dense population and poor infrastructure in South and Southeast Asia, this area is particularly vulnerable to such natural disasters [Webster, 2008] .\n[3] After this devastating event, many diagnostic and modeling studies were conducted to understand, simulate, and reforecast the genesis and evolution of Nargis [e.g., Kikuchi et al., 2009; Yanase et al., 2010; Taniguchi et al., 2010; Shen et al., 2010] . Kikuchi et al. [2009] suggest that the formation of Nargis is probably a result of a MaddenJulian Oscillation (MJO) [Madden and Julian, 1972] event, which developed over the equatorial Indian Ocean in middle April. The MJO and associated westerly winds propagated eastward and, after reaching the Maritime Continent, a Rossby wave vortex was generated and gradually moved back to the northern Indian Ocean. At the same time, the northward-propagating component of the MJO provided a favorable condition for the enhancement of the Rossby wave vortex, which eventually developed into a tropical cyclone in the Bay of Bengal on April 25, 2008 (as recorded in the IBTrACS dataset, which is available at http://www.ncdc. noaa.gov/oa/ibtracs).\n[4] In literature, the modulation of the MJO (or ISV, IntraSeasonal Variability) on tropical cyclone activities has been well documented [e.g., Nakazawa, 1986; Maloney and Hartmann, 2000; Wang and Zhou, 2008] . However, research on the impact of the MJO on extended-range forecasting of tropical cyclone activities is still in its infant stage. Some recent attempts have been made to carry out intraseasonal forecasting of tropical cyclone activities with a statistical model [e.g., Leroy and Wheeler, 2008] and ECMWF dynamical forecasting system [e.g., Vitart et al., 2010; Elsberry et al., 2010; Belanger et al., 2010] . In the case of tropical Cyclone Nargis, one-week simulations have been successfully carried out with the 12-km mesh NICAM Taniguchi et al., 2010] and 25-km mesh NASA global model [Shen et al., 2010] . In both cases, observed sea surface temperature was used as a lower boundary condition during the simulations.\n[5] The difficulties in the extended-range forecasting of tropical cyclone activities with contemporary weather and climate models largely originate from their problems with the representation of the MJO [Lin et al., 2006] . In this short article, we will demonstrate that an atmosphere-ocean coupled model with a reasonable representation of the MJO/ ISV is able to predict the genesis of Nargis with a lead time of two weeks. The model and method used to track tropical cyclones are given in section 2. The ensemble forecasting of Nargis' genesis is described in section 3. We conclude the present study and discuss our future research plans in section 4."}, {"section_title": "Model Description and Tropical Cyclone Tracking Method", "text": "[6] The model used to carry out the forecast experiments is a hybrid atmosphere-ocean coupled model developed at International Pacific Research Center, University of Hawaii (so-called UH_HCM model). The atmospheric component is a general circulation model (ECHAM-4) with T106 resolution that was developed at the Max Planck Institute for Meteorology, Germany [Roeckner et al., 1996] . The mass flux scheme of Tiedtke [1989] is used to represent the deep, shallow, and midlevel convections. The ocean component with a resolution of 0.5 × 0.5-degree, which is comprised of a mixed-layer and a thermocline layer, is an intermediate upper-ocean model developed at University of Hawaii. The atmospheric model was coupled to the ocean model once per day. The UH_HCM model shows reasonable skill in the simulation and forecasting of the MJO/ISV [Fu et al., 2009 [Fu et al., , 2011 . In this study, the initial conditions of all forecasts were produced by nudging six-hourly NCEP final operational global analysis (so-called FNL) (data are available at http://dss.ucar.edu/datasets/ds083.2/) with 1.0 × 1.0-degree resolution onto the UH_HCM model. We initialized the model on April 10, 2008 and carried out ten 45-day ensemble forecasts.\n[7] In order to obtain the tropical cyclone tracks forecasted by the model, two essential criteria based on previous studies [e.g., Bengtsson et al., 2007] are adopted: 1) a welldeveloped vortex with maximum relative vorticity at 850-hPa that is larger than 12 × 10 −5 s −1 , which is equivalent to the criteria for observed typhoons and hurricanes (refer to Table 1 of Bengtsson et al. [2007] ); 2) a warm core with a temperature of (700-hPa + 500-hPa + 300-hPa) averaged over inner 3 × 3 grids being 1°C higher than that averaged over 7 × 7 outer grids. Once a model tropical cyclone is located, the genesis date and location are traced back towards the earliest time when the vorticity of that vortex reaches 10 × 10 −5 s −1 (equivalent to the strength of the observed tropical storm [Bengtsson et al., 2007] ). Finally, the tropical cyclone tracks are extended forward to a point where the vorticity of the vortex drops below 8 × 10 −5 s −1 (usually over land in this study)."}, {"section_title": "Ensemble Forecasting of the Genesis of Nargis", "text": "[8] Over the northern Indian Ocean, the most favorable months for tropical cyclone genesis are May-June and October-November-December [Kikuchi et al., 2009] . The large vertical wind shear between the low-level monsoon westerly and upper-level easterly jet during the peak of the Asian summer monsoon season (July-August-September) is not a conducive environment for tropical cyclone development. In April, the part of the Earth receiving the maximum incoming solar radiation moves to the Northern Hemisphere, which rapidly warms up the northern Indian Ocean. At the same time, major convective activities are still lingering around the equator. Subsidence and a dry atmospheric troposphere prevail over the northern Indian Ocean, which are not favorable for the development of tropical cyclones [Gray, 1998 ]. However, the MJO and associated northwardpropagating ISV bring low-level convergence, westerly wind bursts, and mid-tropospheric moistening into the northern Indian Ocean, creating a period of favorable conditions for tropical cyclone development [Yokoi and Takayabu, 2010] . The above scenario highlights the essential role of the MJO on the extended-range forecasting of tropical cyclone genesis in April over the northern Indian Ocean.\n[9] To test this hypothesis, ten ensemble forecasts have been carried out beginning April 10, 2008, about two weeks before the observed genesis date (on April 25) of Nargis. In our experiments, all ten ensembles predict tropical cyclones in the northern Indian Ocean sector in late April when the tracking criteria given in section 2 are used. Figure 1 shows the observed Nargis' track along with those from all ensemble forecasts. The details on the genesis dates and locations are listed in Table S1 in the auxiliary material.\n1 Of the ten ensembles, six of them generate one tropical cyclone and four of them generate two cyclones. In total, fourteen tropical cyclones are generated in the northern Indian Ocean sector from ten ensemble members. About 80% of the forecasted tropical cyclones have major impacts in the Bay of Bengal and surrounding continent. Only three of them never reach the Bay of Bengal: two form in the eastern Arabian Sea and one forms near the southern tip of Vietnam.\n[10] The above result demonstrates that the genesis of tropical Cyclone Nargis can be predicted two weeks before the actual event with significant confidence. The successful extended-range forecasting of Nargis' genesis is attributed to model's capability in reproducing the major features of the MJO along the equator and associated northwardpropagating ISV. Figure 2 shows the averaged 850-hPa zonal winds over the equatorial Indian Ocean from the FNL analysis (as a surrogate of the observations) and ten ensemble forecasts. All ensemble members capture the equatorial westerly wind bursts associated with the MJO event [Kikuchi et al., 2009; Taniguchi et al., 2010] from April 10 to 20. After this period, individual ensemble members start to diverge from each other with three of them showing a rapid decrease in wind speed, while the resultant ensemble-mean generally follows the evolution of the observations with slightly weaker amplitude.\n[11] Along with the eastward-propagating MJO near the equator, the observed westerly winds associated with the MJO also propagate northward (Figure 3) . Note that all ten ensemble members consistently capture the observed northward-propagating component of the MJO (Figure 3 ). This northward-propagating component is also known as the monsoon intraseasonal variability, which brings intraseasonal wet and dry spells into the South and East Asian summer monsoon region [Chang et al., 2011] . This ISV event is Table S1 in the auxiliary material. Shading indicates rain rate averaged between April 10 and May 10, 2008.\naccompanied by westerly wind bursts, surface convergence, strong cyclonic vorticity and mid-tropospheric moistening. All these environmental variables associated with the ISV along with high sea surface temperature and weak vertical wind shear create the perfect conditions for the genesis of tropical Cyclone Nargis. The fact that all ensemble members capture the genesis of this tropical cyclone suggests that Nargis was conceived in the MJO initiated in the western equatorial Indian Ocean at least two weeks ago.\n[12] For illustration purpose, the forecasted genesis process of tropical Cyclone Nargis in one of the ten ensemble members is given in Figure S1 in the auxiliary material. When the MJO-related convection reaches Sumatra, a Rossby wave vortex emanates into the northern Indian Ocean ( Figure S1a) on April 20. This vortex gradually moves northwestward and leaves a dry zone in the east end of the equatorial Indian Ocean (Figures S1b and S1c) . When the vortex arrives at the western Bay of Bengal on April 24, its intensity reaches the criteria for model tropical storm as defined in section 2 ( Figure S1d ). This forecasted genesis process mimics the one occurred in the observations [Kikuchi et al., 2009] . At the same time, we should note that the exact location and timing of the genesis and the follow-up evolution of Nargis are determined by the synoptic setting and mesoscale structure of Nargis in late April/early May, which is beyond the extended-range probabilistic forecasting and belongs to the scope of deterministic weather prediction."}, {"section_title": "Summary and Discussion", "text": "[13] Taking advantage of a conventional atmosphere-ocean coupled model (UH_HCM) with a reasonable simulation and prediction of the MJO/ISV [Fu et al., 2009 [Fu et al., , 2011 and initialized with the NCEP FNL analysis, we can largely reproduce the initiation of an observed MJO event in midApril 2008 over the equatorial Indian Ocean (Figure 2 ) and the follow-up northward-propagating ISV (Figure 3 ) although some discrepancies do still exist between the observations and forecasts. It is this ISV that fosters the growth of a Rossby wave vortex emanating from the MJO when it reaches the Sumatra Island. This vortex eventually develops into tropical Cyclone Nargis in the Bay of Bengal ( Figure S1 ). On the other hand, if the forecasted MJO/ISV is too weak, there will be no tropical cyclogenesis in the Bay of Bengal ( Figure S2 ). The present finding demonstrates that the ability to reproduce the evolution of the MJO/ISV extends the predictability of the Nargis' genesis beyond two weeks.\n[14] Our results highlight the essential need to improve the representation of the MJO/ISV in contemporary weather and climate models in order to ensure broad advancement of extended-range forecasting of extreme weather events (e.g., tropical cyclones). The recently launched Year of Tropical Convection (YOTC) [Waliser et al., 2009] and MJO task force (more details about MJO task force activity are available at http://www.ucar.edu/yotc/mjo.html) are spearheading efforts to address this overarching issue [Waliser et al., 2006; Vitart et al., 2008; Lin et al., 2008; Gottschalck et al., 2010] . In order to ensure steady progress in the understanding, modeling and prediction of the MJO/ISV, synergetic efforts between weather and climate communities are needed on at least three fronts: (i) to obtain more accurate observations (e.g., DYNAMO [Zhang et al., 2010] ) and develop new data assimilation techniques; (ii) to improve the representations of multi-scale convective systems and their interactions with large-scale circulations in atmospheric models, which are key processes of the observed MJO; (iii) to advance the coupling processes among atmosphere, ocean, and land that are crucial to the realistic simulation and prediction of the MJO."}]