[{"section_title": "Introduction", "text": "Human beings are the best creature of the nature and consuming different type of food materials for their survival. Hence, genesis of the very tiny pathogenic organism, virus (SARS-CoV-2) came to the limelight and it has enormous potential to cause disease that ultimately led to devastation. As per WHO, Corona Virus Disease-19 is the 5th pandemic in last ten decades. The virus, SARS-CoV-2 has been spread to 213 countries and 2 international conveyances around the globe. Near about 47, 50, 124 people are infected and 3, 13, 797 died as depicted from the rolling data. As per the preceding report available in the public domain regarding genesis depicted that, in December 2019, an unknown pneumonia like disease was reported in Wuhan, China. Later, the throat swab of an infected person was diagnosed by Centres for Disease Control and Prevention (CDC) and the causative agent was termed as 2019-nCoV (Corona Virus) by World Health Organization (WHO) on January, 2020. The disease caused by the agent was termed as (COVID-19) on February, 2020. A 57year-old female shrimp seller named Wei Guixian of Wuhan seafood market has been identified as first COVID-19 patient by virtue of common cold symptoms on December, 2020. Then, her primary treatment was carried out considering an ordinary flu in the nearby hospital, however she did not recovered from the infection (mirror UK reported) and shifted to another hospital of Wuhan for secondary treatment. Likewise, many patients with similar symptoms were identified from Wuhan seafood market that conceived a local outbreak in China. Afterword's the new COVID 19 disease causing virus SARS-CoV-2 has been spread to every nook and corner of the world and became pandemic. As a matter of fact, several strategies followed by phylogenetic evolutionary analysis have been conducted for identification of the virus. Results suggested that, 15 different genes of SARS-CoV-2 is similar with the genes of Middle East Respiratory Syndrome (MERS), Sever Acute Respiratory Syndrome (SARS) and bat SARS-like Coronavirus available in gene bank. Among the 15 different genes, 12 (5+2+5) are more closely related to MERS, SARS and bat SARS-like Coronavirus respectively 1 . The Coronavirus belongs to the family of viruses that are very common in mammals. In toto, 07 different Corona viruses such as α-Coronavirus (229E & NL63), β-Coronavirus (OC43, HKU1, MERS-CoV & SARS-CoV) including the novel SARS CoV-2 has been reported so far 2 . Some sites of the spike glycoprotein have been found under positive pressure by the Fast Unconstrained Baesian Approximation (FUBAR) analysis. Moreover, the molecular and structural differences among these viruses were also observed by homology modelling 1 (Benvenuto et al., 2020) . As of 10 th January 2020, >90% cases are reported with fever & malaise, 80% with had dry cough, 20% with shortness of breath and 15% with respiratory distress 3 . As per research model data available in the public domain depicted to slow down the process of transmission its need of the hour to maintain the social distancing, hygienic and public awareness to stop the this outbreak 4 5 6 . However lots of employee who serve in hospitals, teenager, and socially active person is also going through miserable situations hence it's essential to spent time in physical workout in home, yoga and family to avoid the stress 7 8 9 10 11 ."}, {"section_title": "History and classification", "text": "The term \"Coronavirus\" was coined in 1968, due to presence of crown-like morphology based electron microscopic studies. Then, it was characterised by international committee on the taxonomy of virus and it belongs to the family \"Coronaviridiae\" under the order \"Nidovirales\" in 1975. It has three different genera such as group I, II and III based on serological cross-reactivity (Fig. 1 "}, {"section_title": "Classification", "text": "To overcome the earlier doubt or debate regarding proper classification, Coronaviruses (CoV) are categorised into four genera, including α−/ β−/γ−/δ-CoV. αand β-CoV are considered to an infectious agent for mammals, however ornithologist believed γand δ-CoV are pathogenic for birds (Fig. 2) . From earlier investigation among the seven CoVs, human is susceptible towards α-CoVs (HCoV-229E & HCoV-NL63), β-CoVs (HCoV-HKU1 & HCoV-OC43) and SARS CoV-2 with mild pathogenicity and indicated symptoms such as cough and cold. However, β-CoVs such as SARS-CoV and MERS-CoV led to severe fatal respiratory tract infections 1415 . Experimentation results revealed that, SARS-CoV and SARS-CoV-2 could use Angiotensin-Converting Enzyme 2 (ACE2) receptor to infect humans 16 . As the genome sequence of COVID-19 disease causing agent and the virus present in the host bat RaTG13 are similar, thus it's thought to be the origin of infection. Nevertheless, bats were not sale in the market sated earlier thus the infection may be originated from similar kind of animals."}, {"section_title": "Background of Corona outbreak", "text": "The first clusters of Corona cases were reported from the seafood market of Wuhan, China. The female shrimp seller named Wei Guixian has been identified as first COVID-19 patient on 10 th December, 2019 (reported by Wall Street Journal). On 31 st December, 2019 WHO notified that, the Chinese health authorities has considered outbreak of the COVID-19 disease to be a serious threat to the public health. Meanwhile, WHO has again notified and advised to the health authorities of Hong Kong, Macau and Taiwan for a rapid setup of border surveillance regarding this issue 3 . In consequence, three levels such as WHO China country office, Regional Office for the Western Pacific and headquarters has been working together for a quick retort to the outbreak of COVID-19 since 2 nd January 2020. Then, on January, 2020 WHO had declared the COVID-19 outbreak as a Public Health Emergency of International Concern (PHEIC). As a result, the COVID-19 has been characterized as a pandemic by the director general of WHO on 11 th march, 2020 and further led to global pandemic by March, 2020."}, {"section_title": "Morphology of Coronavirus", "text": "Novel Coronavirus having different protein structure than others. It comprises nonsegmented enveloped and positive sense single stranded RNA with no DNA stage. Linear and helical capsids are present on the surface of Coronavirus, however the nucleocapsid is present within the envelope of the virion 17 . This virus harbours pleomorphic RNA or spike proteins (S-proteins) peplomers of 80-160 nM in size with 27-32 kb positive polarity 18 . The most prominent feature of Coronaviruses is the club-shaped spike projections emanating from the surface of the virion. These spikes are defining features of the virion and appear as a solar corona, prompting the name, Coronavirus. The major structural components of these viruses are Spike protein (S), Membrane protein (M) 16s Nucleo-capsid protein (N) and Envelope protein (E) are encoded from 3′ end of viral genome (Fig. 3) 19 . The N-linked glycocylated trimeric spike protein (S) of ~150 kDa present on the surface of virus used N-terminal signals to gateway towards the host endoplasmic reticulum. The S protein has two subunits S1 acts as receptor binding domain and S2 forms the stalk that provides spike structure. The M protein near about 25-30 kDa with lesser N-terminal glycosylated ectodomain & greater C-terminal endodomain, which is responsible for shape of the virion 20 . Report suggested that, the signal sequence is absent in M protein though it co-transnationally inserted to ER. It may remain in two conformations that help to triggers the curvature of the membrane and binding affinity towards the nucleocapsid. Moreover, the less available E-protein of ~8-12 kDa has a very significant role in pathogenesis and maintaining the ion channel activity, but not intricate in the viral replication process. However, it shows a wide diversity in Coronavirus and helps in assembly & release of viruses 21 . Further, the N protein is associated with nucleocapsid and has two domains CTD & NTD (C, N terminal domain) with different binding pattern.\nDue to high phosphorylation the structural modification triggers, that ultimately uplift affinity towards the viral RNA compare to non-viral RNA. Moreover Beads-on-a-string pattern has been distinguished while N terminal protein binds to the viral genome. At this point, CTD possess genomic packaging signals whereas NTD has high binding affinity towards nsp3, the building blocks of replicase complex and M protein 21 . In β-Coronaviruses, Hemagglutinin-Esterase (HE) binds to sialic acids present on the surface of glycoprotein with acetyl esterase activity, which intensify spike protein mediated entry of the virus to mucosal tissue. Recently, the South Korean study suggested, size of the virus particle has been ranged from 70-90 nm with a wide range of intracellular organelles, especially in vesicles 22 . The occurrence of continuous mutation in their transcription is very high near about millions time greater than the host. Such sudden changes, in the nucleic acids leads to release of high virulence factors, difficulties in detection processes and boost evolvability.\nKristian et al. 2020 also reported that, frequent changes in the nucleic acid of COVID-19 virus are due to natural mutation 22 . The polybasic cleavage site & three adjacent predicted Olinked glycans are unique to SARS-CoV-2 and this has not been observed earlier in case of lineage B β-Coronaviruses 23 . Previously, it has been reported that Coronaviruses are zoonotic pathogens causing disease in humans and various animals with a broad range of clinical features ranged from symptomatic to asymptomatic. The SARS-CoV-2 infects respiratory system, gastrointestinal, hepatic and neurologic systems and makes them non-functional."}, {"section_title": "Epidemiology of COVID-19", "text": "In past two decades the crossover of the animal β-Coronaviruses has caused severe diseases in human. The first instance of Coronavirus was recorded in 2002-2003 and the second one (CIVID-19) is the greatest outbreak of the world till date. In December 2019, maximum numbers of pneumonia patient were reported in the sea food market of Wuhan, China. Afterward, the throat swab of an infected person was investigated by CDC, subsequently it was identified as novel Coronavirus by WHO on 2020 and the disease was named as COVID-19 on 11th February. WHO also declared this outbreak as 5 th pandemic in last 10 decades. In this disease along with pneumonia, severe acute respiratory syndrome and various other serious complications has been observed in infected persons.\nThe Coronavirus being immersed from the most populated country China reported 82,827 confirmed cases and 4,632 deaths till date. Comparatively with SARS and MERS, Coronavirus is highly pathogenic with high virulence to human since last two decades. This pandemic has made the infected person experiencing moderate respiratory illness leading to special treatments and has been targeting mostly older or people with medical emergencies like diabetes, cancer, chronic respiratory diseases and cardiovascular disease."}, {"section_title": "Processes of replication", "text": "Coronavirus has an unusual two step replication mechanism. Usually RNA viruses contain only one open reading frame (ORF) which will encode for single polyprotein. Then, the polyprotein is catalytically cleaved into various small functional viral proteins, although the virus can accommodate up to ten distinct ORFs. Replicase are the biggest ORFs of Corona virus translated by most of the ribosome, it could be twice in the size compared to the other RNA viral genome. A series of enzymes encoded by replicase gene that uses the leftover genome as template and then transcribe to a group of smaller, overlapping mRNA molecules, which further translated for structural protein. Then the viral proteins and +ve ssRNA assembled to construct new viral particles 24 (Fig.4) ."}, {"section_title": "Immune response and pathogenesis", "text": "Host immune system and its response towards the disease plays vital role to curb and resolute the Corona infections, however many environmental, biological factors can also lead to immune-pathogenesis. Occurrence of the disease is very oppressive and usually it transmits from human to human through aerosol. When host comes in contact with SARS-CoV-2 the spike protein binds to the host cell by ACE2 and fused to the host membrane to release the viral RNA 25 26 14 . Sometimes the antigen represent down regulated after MERS-CoV infection. Thus, innate immunity can precisely eliminate the virus to avoid immunopathology 28 . Recent report suggested that, COVID-19 infection was reduced by plasma cytokines and chemokine including IL-1, 2, 4, 7, 10, 12, 13, 17, GCSF, Macrophage Colony-Stimulating Factor (MCSF), IP-10, MCP-1, MIP-1α, Hepatocyte Growth Factor (HGF), IFN-γ and TNF-α. The anatomy record of COVID-19 specified an inflammatory response in the lower airway and led to lung injury 29 (Fig.4) . Collectively, the virus particles invade the respiratory mucosa and infect other cells, triggering a series of immune responses to produce cytokine storm in the body that may be associated with the critical condition of COVID-19 patients."}, {"section_title": "Transmission 6.1 Sources and mode of transmission", "text": "Any unfamiliar pathogen can cause disease, COVID-19 is a new strain of virus and no vaccine is available for it so far. Being similar to SARS virus, COVID 19 develops flu like and transmits through respiratory droplets 30 . Majority of animal pathogenic viruses found in bats, cats, cattle, etc. belongs to family Coronavirus. Till date, three pandemic SARS, MERS and COVID-19 were reported to be caused by animal Coronavirus that seldom infects human."}, {"section_title": "J o u r n a l P r e -p r o o f", "text": "Virological and genetic studies concluded that the bats are reservoir of Coronaviruses such as SARS and MERS, before infecting human it uses an intermediate animal host. Studies showed that the Coronavirus found in bats mostly has α-CoV and β-CoV genes. In December 2019, many patients with unknown pneumonia have been reported; they all had background with the Wuhan wet market. In this market both dead and live animals are being sold, it is possible that the COVID 19 virus could have been rooted from animals to human and caused this disease. Due to keeping alive and slaughtering of animal, bird, fish on site these wet market failed significantly to meet the hygiene standards. Bats are considered as the reservoir of the latest outbreak of Coronavirus, any animal host is not yet proven as a reservoir comparatively. To relate the statement most of studies were identified bats are the reservoir of many zoonotic viruses such as Ebola, Human Immunodeficiency Virus (HIV) and rabies. Moreover, on 22 nd January 2020, WHO has declared that the COVID-19 is originated from wild bats. The COVID-19 is classified in the group 2 of β-Coronavirus, in the same subgroup in which SARS CoV has been placed 31 . Though the transmission rate is very higher, however the fatality rate is relatively lower. In general, the COVID-19 has an incubation period of 14 days during which the patient develops fever and lower tract symptoms. Approximately after 10 days of the first outbreak secondary cases began.\nThe patient who didn't had any contact with the particular wet market but they had a history of contact with the people being over there, which suggest that human to human contact can transmit the COVID 19. In conjunction, when healthcare workers were reported with the same disease, subsequently it is confirmed that human can also be a preferable carrier of COVID-19 leading to the transmission of infection by close contact. The transmission of the virus occurs from the respiratory droplets (mouth, nasal mucosa, coughing and sneezing) of the infected person. There by infecting others through the released fomites. People with symptoms are considered as more contagious than asymptomatic, which can also spread the disease. COVID-19 infected people usually develop symptoms after 5 days of exposure, but may range from two to fourteen days. Commonly the symptoms include fever, cough and shortness of breath. The virus was found viable for infection up to 72 hours on stainless steel & plastic, 4 hours on copper and 24 hours on cardboard 32 . United States National Institute of Health had Conducted (NIAID) a study and concluded that the COVID-19 can spread by both aerosols and fomites. The SARS-CoV-2 has spread in hospitals by super spreading like SARS-CoV-1 as noted before."}, {"section_title": "Symptoms and prevention:", "text": "COVID-19 is the global concern as it causes the largest outbreak till date that teaches us the virulence of SARS-CoV-2. Most of the infected population show the symptoms of highly increased rate of fever, dry cough then bilateral pneumonia (83%, 82%, and 75% among 99 patients in Wuhan). Some infected person also struggles for respiration and dumpiness (around 14 and 31 %). Along with the above symptoms few patients from Wuhan also felt muscle ache, confusion, headache, sore throat, rhinorrhoea, chest pain, diarrhoea, nausea and vomiting. It has been also observed that low immunity and continuous exposer towards that virus can lead to infection of COVID-19. Further it drives to serious disease, organ failure and then death. Thus, if such symptoms are present, urgent medical attention is recommended. However, in some cases asymptomatic carriers are being reported thus it's an alarm for the world to maintain the most hygienic processes as shown in fig 5. Mostly people with medical history and old age person are more prone towards the infection as their immune system is too weak to fight. Most of the time persons having preceding medical records with perpetual medication cannot be recommend for different types of drugs simultaneously for different therapy. Hence it's always recommend by various health agency to prevent the disease as much as possible by maintaining the hygienic condition 333425 . In accordance to the WHO and constant observation of doctors & scientist, the virus penetration to the host body via different route such as direct contact with the infected person, sharing same indoor environment, sharing the clothes, accessorises, equipment and articles with the infected person, mass gathering, travelling should be avoided where there is a chance of releasing droplets that could transmit easily. This is an aerosol contaminated disease so the transmission rate is very high where it can transmitted from person to person both in hospital, families and the area where people gathered at most of the time. Hence, the prevention of this disease is in high demand. Transmission of coronavirus can contaminate not only through aerosol but also it can remain stable in dry surface. Once a person will come in contact with the dry surface, it can be penetrate easily through our nose eyes mouth etc. According to the report, the hygienic condition can avoid the transmission of coronavirus by using different type of matricidal agent such as 70% ethanol, sodium hypochlorite, hydrogen peroxide and benzalkonium chloride for disinfection 35 .\nTo avoid the transmission, with the advisory of health care person and various administrative departments, gathering and physical communication were prohibited as a result of which unprecedented lock down has been imposed in cities of various countries. However due to this lockdown worldwide markets are tumbling down hence its affecting our economy too. CDC stated significant transmission can be pulled back by covering the face with own cloths such as in the grocery store, where it's difficult to avoid close contact with others. Surgical masks or N-95 mask are essential during the movement at public place. Incase any person feel sick or ill, consulting doctor and treatment within quarantine are indispensible. Consequently according to the respond medication can be prescribed."}, {"section_title": "Treatment", "text": "Nevertheless, prevention is better than cure, hence the transmission of this disease can be stopped by keeping consistent attention towards our regular activities as instance hand wash, prevent touching face with unwashed hands. During coughing or sneezing covering face with tissue and throwing it directly into the waste along with an overall clean hygiene is extremely helpful. Infected people are recommended to wear a surgical mask while stepping down from quarantine. Social distancing measures are recommended to prevent the transmission of this disease. Our hands contain innumerable numbers of viruses and bacteria and use of soaps can helps to cleanse our hands thereby reducing the amount of microbes which isn't possible with products such as sanitizers as they do not have the capability to kill a large group of viruses and bacteria. Hence soap is recommended for an effective removal of microbes. 3637 a. Chloroquine and Hydroxy chloroquine In accordance to the current scenario of the patient, chloroquine was tested for treatment of coronavirus in the US. On 19 March the US Food and Drug Administration (FDA) has approved chloroquine (hydroxy chloroquine / Plaquenil), is a pre-existing drug for malaria and arthritis, for COVID-19 treatment 3839 . The chloroquine is being studied by government agencies and research institutions in various clinical trials.\nb. Favilavir Many other antiviral drugs are expected to be rapidly monitored for coronavirus testing. As an instance Favilavir, China's first drug approved for partial treatment of coronavirus 40 as these are RNA polymerase 41 e. Japan flu drug The antiviral medicate, called favipiravir or Avigan, has been utilized in Japan to treat flu, and with proper monitoring, the medicine was endorsed as an exploratory treatment for COVID-19 diseases. So far, Pharmaceutical Technology reported that the medication has been tried in 340 people in Wuhan and Shenzhen. \"It encompasses a high degree of security and is clearly viable in treatment,\" Zhang Xinmin, of China's science and innovation service 45 . The drug, which works by preventing the replication of certain viruses, appeared to shorten the length of the virus as well as boost the lung recovery conditions (as seen in Xrays) in some patients. A separate report, released on April 8 for peer-reviewed preprint database medrXiv, compared with favipiravir to another flu drug, umifenovir (Arbidol). In 240 people's randomised, controlled trial, favipiravir did not help people recover faster than umifenovir. However, the study found that favipiravir greatly reduce fevers and coughs for shorter duration 46 .\nThe world is looking for chloroquine and hydroxy-chloroquine for treatment of COVID-19 as in the current situation the world wide case reported around 2982588 out of which fatal rate is 206325.Currently India is the leading manufacturer of hydroxy chloroquine. In addition to chloroquine and hydroxy-chloroquine, 4-aminoquinolines have been also recommended as potential medicines for COVID-19. Right now, at slightest 80 trials of chloroquine, hydroxy-chloroquine and in some cases combination with other drugs, are enrolled around the world 17 as per the patients response. Current situation also demanding development of biosensor for the betterment of mankind also with biodegradable (polyhydroxyalkanoates) 47484950 device which should be degraded with the biological contaminates."}, {"section_title": "Impact on global economy", "text": "Coronavirus which is officially called COVID-19 was sourced from the country China and had diffused in all the countries over the world among which the highest affected country notified has been the US followed by Italy, China, and Spain. In developing countries like India, its counterpane has also started increasing day by day with the highest recorded cases in the state like Maharashtra followed by Delhi and Tamilnadu. It has posed a much adverse effect on the various sector of the global economy. Considering the energy sector a decreasing trend has been seen in crude oil price as well as the billions of stock prices causing a huge loss to the major contribution towards oil and gas companies. As a result of which war has already started for declining both supply and demand of products in nations. Regarding financial sectors, UNDP has estimated around USD 220 billion reductions in revenue generation of developing countries whose effect could last for years. Disrupted logistics and numerous efforts to slow down the outbreak of coronavirus impacted a lot to the multiple connected industries. The current market ambient has shown that there has been a 15 to 20% increase in the price of agricultural commodities like vegetables, grapes, and sugar because of the huge demand of consumers 51 . The uncertainty in export and import of food items along with a reduction in domestic sales and closure of retail showrooms and malls has made unprecedented and severe losses in industries (The Economic Times 2020). Bloomberg economists have analysed modelling that the global GDP is likely to decline by approximately 0.42% in the first quarter due to this outbreak 52 . The growth in the economy is seen stagnating in further periods. Responding to this, the central bank has decided to slash their rate of interest making the borrowing cheaper as well as to encourage the spending to boost the economy. An estimation done by capital economists has shown that negligence in urgent global actions may raise the loss to $280 billion in the global sector in the first quarter of the year which may proceed year by year 53 . The economic declination due to this pandemic shock is continuing and it is very difficult to predict the next scene but there have been clear indications that the developing countries will get their economy to worsen before they could be better. Therefore much attention should be given by the government and advanced research labs for the betterment of this situation so that the targeted economic growth could reach a little far towards the destination 53 54 ."}, {"section_title": "Conclusion:", "text": "This pandemic situation drastically reduced the global health as well as economy. However, significant reduction in air, water & soil pollution level, migration of animals & birds from one place to another indicating \"whether COVID-19 is boon or bane for the society\". In spite of rapid development in science and technology, till date no explicit drugs are available for the disease management. To overcome from these situations lots of technology have discovered biosensors that associated with appliance which gives signals if any biochemical alteration occurs in human body. Hence these technologies are appreciable and needs to be exploring more for the betterment of mankind. As a matter of fact, preventive measures such as neat & clean maintenance and social distancing in form of lockdown or shutdown have been widely adopted to control the disease till development of vaccine. On the other hand, by this way we can also take care of nature. If not, nature has its own phenomenon to take care."}, {"section_title": "Conflict of interest:", "text": "Any authors have not conflict of interest "}]