[{"section_title": "", "text": "Regression estimates of the association between home food healthiness, eating out, and child dietary behaviors and BMI ........................................................................................... 33 Methods .................................................................................................................................................. Analyses .................................................................................................................................................. Results ..................................................................................................................................................... Conclusions ............................................................................................................................................. Tables and Figures................................................................................................................................... Figure 1: Conceptual Framework ........................................................................................................ Table 2: Measures of ozone, PM 10, and PM 2.5 using kriging interpolated ambient air pollution concentrations in 5 th grade (2003-2004) ............................................................................................    Appendix 1: Measures of PM 10 using kriging interpolated ambient air pollution concentrations in 5 th grade (2003)(2004) Table 3: Heterogeneous effects of ozone on math and reading test scores in 3 rd and 5 th grades by child characteristics: Cumulative ozone exposure .. ............................................................................ grateful for their motivation and mentorship. I am also thankful to Brian Finch for acting as an outside reader. He provided many thoughtful and helpful comments. I am also thankful to grants R01HD067536 and R03ES021569 from the NIH which provided support for work that contributed to this dissertation. In addition I'm thankful to Elizabeth Wong and the Military Teenagers' Environments, Exercise and Nutrition Study. My friends and family also provided tremendous support throughout the process. I'm especially thankful to Nicole and my family Andrei, Max, and Addie for getting me through the end. vi"}, {"section_title": "Abstract", "text": "There is a growing consensus that child health and cognitive development are influenced by the social, economic, built, and policy environmental contexts in which children live. However, the majority of research examining these relationships has relied on cross-sectional data and potential mechanisms for relationships are not well explored. This dissertation examined how the local environment contexts contribute to children's health and cognition in three essays. First, using data on children in military families, I leveraged the unique variation in neighborhood environment due to frequent relocation of military personnel to explore how the neighborhood food environment (NFE) influences children's dietary behaviors. The availability of food outlets was not associated with children's outcomes. In exploring the potential mechanisms, I found the availability of particular stores was not associated with where families shop for food and the type of store that families shop at was not associated with the healthiness of food at home. However, healthiness of food at home and parental supervision were associated with dietary behaviors, suggesting that focusing only on the NFE may ignore important factors for children's outcomes. Future research should consider how families make decisions about what foods to purchase, where to shop for foods and eating out, how closely to monitor their children's food intake, and how these decisions collectively impact children's outcomes. In the second and third essays, I examined the relationship between air pollution and children's cognitive outcomes using rich national data of children in the U.S. Ozone and PM2.5 were consistently associated with lower math test scores in third grade using annual and cumulative vii measures of exposure. In exploring the mechanisms, I found that ozone on the day of testing was not associated with test scores, suggesting the association is not due to short-term effects. However, the relationship between ozone and test scores may be partially explained by increased school absences. Examining how the effects of ozone exposure may differ across children based on their vulnerability, I found a significant association among children without asthma indicating that it is not only children with asthma who may react adversely to exposure. A significant association among children who get exercise through a park was also found. These results help us understand the roles of greater exposure and susceptibility underlying the relationship between ozone and cognitive outcomes."}, {"section_title": "Chapter 1: Introduction", "text": "There has been major progress in improvements of health in the last half century, but the patterns of child illness and morbidity have also changed substantially in the United States. The new pediatric morbidity, chronic conditions and developmental issues, are major morbidities now facing children. These include asthma, childhood cancers, neurodevelopment disorders (e.g., attention-deficit/hyperactivity disorder, learning disabilities, autism), obesity, and type 2 diabetes. There is growing consensus that many of these issues, and child health and development in general, may be influenced by individual factors but also by interactions with the larger social, economic, cultural, and built and policy environmental contexts in which they live. Recently, the study of contextual effects on children's health and cognition has grown tremendously and included many research disciplines, in part due to the complexity of the relationship between the environments and outcomes. The environments in which children live have also changed substantially. For example, changes in the food environment have included increased accessibility of foods, decline in relative prices of foods, increase in portion sizes, and increase in the variety of foods available. 2 80,000 new synthetic chemicals, including plastics, pesticides, building materials, flame retardants, and synthetic hormones, have been added in the last 60 years. 3 Housing development has grown faster than population growth and has been widespread, impacting the natural systems, vegetation, commercial development, and transportation infrastructure. 4 The motivations for exploring and understanding these contextual effects of child health and cognition are compelling. First, neighborhood characteristics that may be associated with child health and cognition can vary extensively across neighborhoods including socioeconomic status (housing, poverty levels, educations levels,), availability of healthy foods and parks, walkability, safety, access to medical facilities, quality of schools, ambient air pollution, and availability of transportation. Second, policy programs and financing may be able to more easily target neighborhood environments rather than individual behaviors. Third, children's health and cognitive development are particularly important to address because impacts may persevere into adolescence and adulthood. And in many cases, children do not have the same susceptibilities and vulnerabilities to impact of the neighborhood environment that adults do."}, {"section_title": "This dissertation examines how the local environment contributes to children's health", "text": "and cognition and explores the mechanisms or pathways that may help explain relationships between the local environment and health/cognition. The dissertation examines two cases of the impact of the local environment context: (1) the food environment and children's diet and BMI and (2) ambient air pollution and children's cognition. Chapters 2 through 4 present the three papers of this dissertation. In the first paper, I explore how the neighborhood food environment influences children's dietary behaviors and BMI using data of children in military families, who have unique variation in neighborhood environments due to frequent relocation of military personnel. I also examine the potential mechanisms through which the neighborhood food environment might influence children's diet and BMI and the role of the home food environment and parental supervision. In the second paper, I explore the relationship between ambient air pollution and children's cognitive outcomes in elementary school years using several models including annual and cumulative measures of air pollution and child fixed effects. I also explore potential mechanisms by examining the role of short-term exposure and school absences. In the third paper, I examine the heterogeneous effects of ozone exposure by child characteristics including socioeconomic status, gender, asthma status, and regular outdoor exercise. These analyses further explore the mechanisms of the effects of ozone exposure by examining how effects differ across children based on their vulnerability to health or cognitive effects and their opportunities for exposure. Chapter 5 presents the conclusions and key findings from the dissertation and discusses policy and research implications."}, {"section_title": "Introduction", "text": "Childhood obesity remains a leading health concern with 34.5% of children aged 12-19 years overweight or obese and 20.5% obese in the U.S. in 2012 (Ogden et al. 2014). Obesity results when energy consumption exceeds energy expenditure, but the factors that influence this energy imbalance are complex and still not well understood. Given the high and increasing rates of child obesity over the past three decades (Fryar et al., 2012), there is growing interest in population-level prevention and the role of social and environmental contexts Carroll-Scott et al., 2013;Ding et al., 2011). One potential contextual driver that has received substantial attention recently is the role of neighborhood food environments. Several federal and local policy initiatives are attempting to address the role of neighborhood food environment by improving access to healthy foods and restricting access to unhealthy foods. For example, the $400 million Healthy Food Financing Initiative, the Pennsylvania Fresh Food Financing Initiative, and New York City's Food Retail Expansion to Support Health include funding to encourage the introduction of supermarkets in underserved areas. Another approach focuses on regulating the opening of new fast food outlets through zoning laws (Wu and Sturm, 2013). The premise behind these initiatives is that greater access to supermarkets and less access to fast food outlets will translate into improvements in diets and health. Despite the growing attention focused on the role of the neighborhood food environment, our understanding of the empirical relationship between the neighborhood food environment and children's diet and obesity is limited and primarily based on cross-sectional studies . The limitations of the existing research include a focus on a single food industry (e.g., fast food or supermarkets) (Lee, 2012), use of only objective or perceived measures of the environment (Caspi et al., 2012), and lack of insight into the mechanisms underlying findings (Casagrande et al., 2009;Odoms-Young et al., 2009). Moreover, cross-sectional studies may produce biased estimates if families selfselect into neighborhoods based on their preferences for certain types of foods and other health-related behaviors that influence the risk of obesity. Therefore, one cannot assume that neighborhoods are randomly or exogenously assigned and residential selection may confound estimates of how those neighborhood characteristics affect behaviors and health. Results from a limited number of longitudinal studies provide little evidence of a significant relationship between the neighborhood food environment and children's BMI and obesity. One longitudinal study that assessed outlet availability with two different measures at the county-level found a significant association between increased supermarket outlets per 10 square miles and lower childhood BMI but did not find any significant associations for supermarket outlets per 10,000 capita or for availability of other food outlets (Powell and Bao, 2009). Another longitudinal study concludes that differential exposure to food outlets (measured as density in their home census tract) does not explain weight gain in children followed from kindergarten through 5 th grade (Lee, 2012). This study uses data from the Military Teenagers Environments, Exercise, and Nutrition Study (M-TEENS) to first examine the association of the neighborhood food environment (both objective and perceived) with children's dietary behaviors and BMI. An important advantage of studying children in military families is that the relocation of military personnel provides unique variation in their families' neighborhood environments. These relocations assign military personnel to new installations based on military's needs and are typically not influenced by family preferences (Lleras-Muney, 2010). Therefore, even cross-sectional data are valuable because the neighborhood food environment among these Army families is not subject to the same level of residential selection that undermines typical observational studies. Moreover, these environments on and around military installations are likely to vary considerably, in large part because of the significant variation in geographic location and size of the installations. Other contributions include examining the potential mechanisms through which neighborhood food environment might influence children's diet/BMI to gain insight into the relationships between the neighborhood food environment, where families shop for food, the home food environment, how often families eat out, and children's diet/BMI. Rather than focusing on just one aspect of the food environment like most previous papers, this study provides a more complete understanding of the neighborhood food environment using this rich set of data on where families purchase food, the home food environment, children's consumption, and children's and families' covariates. In summary, periodic military relocations of these families combined with our rich set of data provide a unique and innovative opportunity to examine the associations and mechanisms between neighborhood food environments and children's dietary behaviors and BMI."}, {"section_title": "Conceptual framework", "text": "Figure 1 depicts our conceptual framework for understanding how neighborhood food environment can influence children's diet and BMI (relationship 1). The availability of food outlets in the neighborhood is likely to influence children's diet and consequently BMI through its influences on where the family purchases food for the home and how often the family eats away from home (relationship 2). Greater availability of supermarkets or convenience stores close to a family's home might increase the likelihood that the family shops for food at those outlets. Similarly, greater availability of fast food outlets or restaurants might increase the frequency that the family eats outside the home. However, these mechanisms may be weaker among children because children have limited autonomy to purchase food and go out for food. Instead of shopping close to home, parents may shop at food outlets that are close to or en route to their work, children's school or other routine activities. Furthermore, parents may influence the relationships between neighborhoods and children's diet by making choices about what to purchase for the home, setting limits on what the child is allowed to eat and influencing what the child orders when eating out. With respect to foods eaten at home, it is hypothesized that greater access to supermarkets may support healthy home food environments (relationship 3) and consequently more healthful diets because they typically stock a wide range of healthy foods and make these items available at lower prices . However, supermarkets may also stock a wider variety of junk foods than may be available in smaller stores because more total shelf space is devoted to junk foods (Farley et al., 2009). Greater access to convenience stores and fast food outlets may support unhealthy eating behaviors because they typically sell inexpensive energy-dense foods and soda . However, the emerging empirical research from recent large and longitudinal studies suggests that the food outlets available in a family's neighborhood are not associated with children's diet, BMI and obesity (An and Sturm, 2012;Lee, 2012;Powell and Bao, 2009;Shier, et al., 2012;Sturm and Datar, 2005). In contrast to the research on the neighborhood food environment, there is mounting evidence that the home food environment -defined as the healthiness of foods available in the home-influences children's diet and BMI (relationship 4) (Cullen et al., 2003;Ding et al., 2012;Ebbeling et al., 2006;Grimm, et al., 2004;van Ansem et al., 2013). Access to fruits and vegetables (Cullen, et al., 2003;Ding, et al., 2012;van Ansem, et al., 2013), soft drinks (Ebbeling, et al., 2006;Grimm, et al., 2004), and snack foods at home have been associated with increased consumption among children. This suggests that readily available healthful foods are likely to enhance healthful dietary behaviors among families. The empirical evidence is more consistent for away-from-home foods eaten at fast food outlets and full-service restaurants. Fast food consumption has been associated with more fat, sodium, sugars, and soda and less fruits, vegetables, fiber, and milk in child diets (relationship 5) (Bauer et al., 2009;Bowman et al., 2004;Powell and Nguyen, 2013). Further, a study of children and adolescents finds that similar to fast food, full-service restaurant consumption is associated with increased daily total energy intake, sugar, fat, and soda (Powell and Nguyen, 2013). Thus, away-from-home food consumption is associated with greater total calorie intake, which is particularly important because children are increasingly eating away-from-home foods (Poti and Popkin, 2011). Finally, there may be certain types of parents with preferences for healthy family diets. A potential proxy for parental preferences for healthy diets is parental supervision of the children's diets. Therefore, an important aspect of the framework is the role of parental supervision as a confounder to the influences of the home food environment and away-from-home food consumption (relationships 6 and 7). Parents with preferences for healthy diets (and parental supervision of diets) may have healthier home food environments, eat fewer meals out of the home, and have healthier child diet behaviors. Two measures of parent supervision are family meals and limits on child intake of junk foods. Parents who participate in family meals or set limits on children's intake of junk foods may have healthier foods in the home or limit fast food intake and influence their children's dietary choices overall. Frequency of family meals together has been positively associated with child consumption of fruits, vegetables, and grains, and less fried foods, soda, and fat (French et al., 2003;."}, {"section_title": "Empirical approach", "text": "The main objective of our study is to determine the association between the neighborhood food environment and children's dietary behaviors, BMI, and overweight/obesity (relationship 1). We estimate this relationship using the multiple linear regression model in the equation below. The primary explanatory variable of interest is the neighborhood food environment (NFE). The main coefficient of interest is   , which captures the relationship between the neighborhood food environment and the child's dietary behaviors, BMI and obesity (Y). The vector (X) includes contemporaneous child, family and contextual covariates that may influence diet and BMI. Standard errors are adjusted for clustering within installations. We examine this relationship using both objective and perceived measures of the neighborhood food environment separately. An additional objective of the study is to unpack the potential mechanisms through which the neighborhood food environment might influence children's diet/BMI as presented in the conceptual framework. We first examine how the neighborhood food environment is associated with where the family shops for or accesses food. For example, greater availability of certain types of food outlets in one's neighborhood might increase the likelihood that the family shops or eats at those outlets. We test this hypothesis by estimating relationship (2) separately for food-at-home and away-from-home foods. For food-at-home, the dependent variable measures where the family primarily shops for grocery items. For away-from-home foods, the dependent variable measures the number of meals or snacks from fast food outlets and number of evenings the family eats at a restaurant or gets take out dinner per week. For food-at-home, we then examine whether the family's primary grocery food shopping source is associated with the family's home food environment (relationship (3)). The home food environment measures the healthiness of food available in the home. We then examine how the home food environment is associated with children's outcomes (relationship 4). Similarly, for away-from-home foods, we examine how the number of meals eaten at fast food outlets or restaurants influenced children's outcomes (relationship (5)). Finally, we examine how parental supervision influenced the relationship between the home food environment (relationship 6) and fast food/restaurant meals (relationship 7) on children's outcomes.  Tanielian et al. 2014), 8545 families were initially contacted, of which 2106 completed the eligibility screener. Families were eligible to participate if: 1) the Army-enlisted parent intended to stay in the Army for the coming year; 2) the 12-or 13-year old child resided with the enlisted parent at least half-time; and 3) the child was enrolled in public or Department of Defense Education Activity school."}, {"section_title": "Data", "text": "Of those screened, 1794 were eligible and 1188 consented to participate. This study uses data from the baseline surveys conducted in 2013. The eligible 12-or 13-year old child and a parent completed online or paper surveys. The child survey focused on the child's dietary behaviors, food purchases at school, and physical activity. The parent survey focused on the family's background, the residential neighborhood, the home environment, and the family's dietary and exercise behaviors. A total of 1052 parents and 933 children completed the surveys with completed surveys for a total of 903 child/parent pairs. The child's height, weight, and waist circumference were also measured by trained field staff during visits to the 12 installations. The study leverages unique quasi-random variation in neighborhood environments generated by the assignment of military personnel to installations to serve the military's needs. This assignment process renders even cross-sectional data valuable because the distribution of families across installations at any given point in time is potentially exogenous to the study outcomes. The study was approved by the Institutional Review Boards at RAND and University of Southern California and by the Army's Human Research Protection Office."}, {"section_title": "Measures", "text": ""}, {"section_title": "BMI and overweight/obesity", "text": "BMI and overweight/obesity are primary outcome measures. One important advantage of the M-TEENS is that height and weight measurements were not only reported by parents and children, but were also collected by trained study staff for a subsample of children (N=522) who were able to attend the onsite installation visits. Given that only 58% of the sample had height and weight measurements, we used these observations as a validation sample to estimate \"correction models\" that are a standard approach in the literature (Cawley, 2002(Cawley, , 2004. For boys and girls separately, the measured height (weight) was regressed on the corresponding self-reported and parent-reported height (weight), quadratic term of height (weight), age in months, and indicators of race-ethnicity. The regression estimates were used to predict corrected children's height (weight) in the overall sample. These models yielded very high model-fit (Adjusted R 2 =77.4 for height, 88.3 for weight) and low classification error for obesity (sensitivity, or true positive: 77-85%, specificity, or true negative: 96-99%). Detailed findings from these models are reported elsewhere (Ghosh-Dastidar et al., 2016). There were no statistically significant differences between the measured and unmeasured children in terms of their self-reported BMI or overweight/obese status or in family background characteristics, with one exception -those who were measured were more likely to live on-installation, which is not surprising given that the measurement visits were hosted at an installation youth center. Using the predicted height and weight, we constructed age-and gender-specific BMI z-score and BMI percentile based on the 2000 BMI-for-age and gender growth charts issued by the Centers for Disease Control and Prevention. A child was classified as obese or overweight if the BMI percentile was greater than or equal to 85."}, {"section_title": "Dietary behaviors", "text": "We also examine outcomes measuring children's dietary behaviors. These were collected via a modified version of the Beverage and Snack Questionnaire (Neuhouser et al., 2009) which asks about frequency of consumption of fruits, vegetables, soda, and types of salty snacks and sweets, among other beverages and foods during the past 7 days. The survey response categories (never, 1-3 in past 7 days, 4-6 in past 7 days, 1 per day, 2 per day, 3 per day, 4+ per day) were converted into times per week (0, 2, 5, 7, 14, 21, 28+). We created a weekly measure of salty snacks and sweets by summing responses to the relevant questions: salty snacks (low-fat or non-fat chips; regular chips; other salty snacks) and sweets (candy; doughnuts or other pastries; cookies, brownies, pies and cakes; low fat or nonfat frozen desserts; regular ice cream and milkshakes). Children were also asked how often they ate a dinner that was ready-made in the past 7 days. Parents were asked how often the family had a dinner that was ready-made in the past week."}, {"section_title": "Objectively measured neighborhood food environment", "text": "Objective measures of the neighborhood food environment summarized the availability and number of various food outlets within certain radii from the family's home. Home addresses provided by parents were geocoded to a position along the street network using the 10.0 U.S. Streets Address Locator within ArcGIS (ESRI, Redlands CA). Circular buffers around the family's home were computed using 0.5-, 1-and 2-mile radii from each family's home to generate counts of fast food outlets, restaurants, supermarkets, small grocery stores, and convenience stores within the buffers. The food outlet data were geocoded to latitude and longitude based on the 2012 release of InfoUSA, a dataset of all business establishments that includes the name, location, sales volume, and North American Industry Classification System (NAICS). Fast food outlets were identified as limited service restaurants (NAICS 722513). Our set of fast food outlets also includes the outlets from the National Restaurants Association list of top 100 fast-food chains. The NAICS were used to identify restaurants ( NAICS 7225511), supermarkets with annual sales greater than $2 million (NAICS 445100), small grocery stores with annual sales less than or equal to $2 million ( NAICS 445100), and convenience stores (NAICS 445120). We constructed a similar measure for warehouse/megastores, but there was almost no variation in the measure: 99% of families had no warehouse/megastore within 2 miles of the home. Commissaries are another shopping outlet alternative for military personnel, but were not identified in the data; moreover, we assumed that all military personnel have access the commissary during their time on the installation which implies no variation in this measure across families. Among the three distances, the 2mile radius was selected as the main objective measure because it is consistent with the literature (Ball, Timperio, & Crawford, 2006) and provides sufficient variation."}, {"section_title": "Perceived neighborhood food environment", "text": "Parents completed the parent version of the Neighborhood Environment Walkability Scale -Youth version (NEWS-Y) (Adams et al., 2009;Saelens et al., 2003). To correspond to the objective neighborhood food environment measures, individual questions from the NEWS-Y were utilized, including how long it would take the parent to walk from the home to the nearest convenience/corner store/small grocery store/bodega, supermarket, fast food restaurant, and non-fast food restaurant. Responses included: 1-5, 6-10, 11-20, 21-30, and 31+ minutes. Based on these data, we created indicator variables for whether there was a parent-reported store (of each type) within a 20 minute walk from home."}, {"section_title": "Where family accesses food", "text": "Regarding food-at-home, parents were asked where the family most often shops for each of the following grocery items: fruits and vegetables; meat, fish, eggs, beans; milk and dairy products; bread, rice, pasta, cereals, other grains. Indicator variables were constructed to indicate whether the family shops most often for groceries at the commissary, supermarket, convenience or small grocery store, warehouse or mega store, or other by selecting the modal food shopping location. For away-from-home foods, children were asked how many times they ate a meal or snack from a fast food restaurant in the past 7 days. The survey response categories (never, 1-3 in past 7 days, 4-6 in past 7 days, 1 per day, 2 per day, 3 per day, 4+ per day) were converted into times per week (0, 2, 5, 7, 14, 21, 28+). Children who ate at least one fast food meal in the past 7 days were asked where they most often got it from (on-post or off-post). Parents were also asked, in a typical week, how many evenings their family eats out at a restaurant or gets take-out dinner (response categories were 0 to 7)."}, {"section_title": "Home food environment", "text": "The home food environment variable measured the \"healthiness\" of the food available in the home by summarizing how much parents agree or disagree with the following statements about the food environment in their home: most of the food in the house is healthy; there are a lot of salty snacks in our house (reverse coded); there are a lot of sweets in our house (reverse coded); there are a lot of other high-fat foods in our house (reverse coded); there are a lot of sweetened beverages in our house (reverse coded); a variety of healthy foods is available to my child at each meal served at home. The response categories included strongly disagree, somewhat disagree, neutral, somewhat agree, and strongly agree. These six items were summed to create an overall score for the home food healthiness. Higher scores indicated a healthier home food environment."}, {"section_title": "Parental supervision and children's dietary behaviors", "text": "Two sets of variables captured parental supervision on children's dietary behaviors. First we created a measure of the parents' rules for snack foods. Parents were asked what limits, if any, their family set on the child's intake of the following foods and beverages: Sugary drinks, Salty snacks, and Sweets. Parent responses included No limit, 0-1 per week; 2-3 per week, 4-6 per week, 1 per day, 2 per day, 3 per day, and 4 or more per day. These items we recoded to dichotomous variables indicating whether the family had set a limit of three or fewer servings per week. Second, parents were asked separate questions about how many days per week the family eats breakfast and dinner together."}, {"section_title": "Other covariates", "text": "We included child, family and contextual covariates that may influence dietary and BMI outcomes such as the child's age in months, gender, race/ethnicity (non-Hispanic white, non-Hispanic black, Hispanic/Latino, other), education levels of both parents (less than high school, high school graduate or equivalent, some college, and college graduate or higher), household income (<=$40,000; $40,001-$50,000; $50,001-$75,000; $75,001 or higher), marital status, and number of children in household, whether the family lives on-post, and region (west, south, midwest, northeast, other). In addition, two measures of residential location preference (how important proximity to supermarkets and proximity to restaurants were to selection of family residence) were included in the regressions that examine the neighborhood food environment and dietary behaviors. These measures of residential location preference adjust for one aspect of self-selection."}, {"section_title": "Results", "text": "Descriptive statistics of the M-TEENS sample are presented in a previous paper (Datar et al., 2015). The mean age of children was 13.2 years. Almost 41% of the sample were White, non-Hispanic (40.8%), 20.7% were Black, non-Hispanic, 24.6% were Hispanic/Latino, and 13.9% were other. Almost 44% had an income of less than or equal to $50,000. The 903 children in the M-TEENS sample lived in 408 Census Block Groups. Approximately 26% of the children in the sample were obese or overweight. The average number of servings of fruits (8.9), vegetables (8.1), soda (3.1), sweets (12.5) and salty snacks (7.6) per week are reported in Table 1 as are the number of child-and parent-reported ready-made meals (1.3 and 0.9) per week. Most families shopped at the commissary (57.7%) followed by discount/big box/wholesale clubs (16.6%), supermarkets (15.3%), convenience/small grocery stores (1.9%) and other outlets (8.5%). Many families reported having limits on sugary drinks (64.4%), salty snacks (50.1%) and sweets (59.7%). On average, the families ate dinner together (5.5 times per week) twice as often as breakfast together (2.7 times). There was considerable variation across food outlet types and across families. The modal number of fast food outlets and restaurants was 5+, but almost one in four families had no fast food outlets and 14.4% had no restaurants within 2 miles of their home. Convenience stores, small grocery stores, and supermarkets were less common with modal responses of 1-2 convenience stores and 0 small grocery stores and supermarkets. Using parent-perceived measures of outlets within a 20-minute walk, convenience stores/small grocery stores were most common (72.4%) followed by supermarkets (44.6%), fast food outlets (44.2%) and restaurants (31.9%).\nIn the child fixed-effects models (Table 3, Panel B), the results were similar to the cross-sectional results for ozone -a significant negative association between annual ozone and math test scores in third grade. Some results from the child fixed-effects models for PM 2.5 were not consistent with the crosssectional results. Using measures of cumulative exposure (K to third grade and K to fifth grade) (Table 4), we found significant association between the number of years with ozone exposure above the NAAQS standards and lower math test scores in third grade. Additional significant associations were found for lower reading tests scores in third and fifth grades when implementing a second measure of cumulative ozone exposure (indicators for whether 1 year above standard or 2 years+ above standard). We also found significant associations between cumulative exposure for PM 2.5 and lower reading and math test scores in 3 rd and 5 th grades using both cumulative measures.\nWhen examining the results by child's asthma status (Tables 2 and 3, Panel D), I found that the association with math test scores in third grade was larger, but non-significant, for children with asthma. The association remained similar to the overall results and significant among children without asthma. I also found significant associations between exposure to ozone and math test scores in third grade among children who regularly get exercise through a public park (Tables 2 and 3, Panel E), but not those that do not regularly get exercise through a public park. The same pattern was seen for reading test scores in third grade using the annual exposure measure, but not the cumulative measure. For reading and math test scores in fifth grade, all results remained insignificant in the subgroup populations using both the annual ozone and cumulative ozone exposure measures."}, {"section_title": "Neighborhood food environment and child BMI and dietary behaviors", "text": "Table presents the estimated adjusted associations between the objective and parentperceived neighborhood food environment and the child's BMI and dietary behaviors. The top panel presents the results using the objective measures of the neighborhood food environment using the 2-mile radius from the child's home. Most of the estimated coefficients were close to zero and none were statistically significant. The bottom panel presents the results using the parent-perceived measures of the neighborhood food environment. Again, there were no significant associations between the neighborhood food environment and child's dietary behaviors, BMI, or overweight/obese. Sensitivity analyses using alternative radii of 0.5 and 1 mile produced qualitatively similar findings. The results thus far suggest that there are no significant relationships between the availability of fast food outlets, restaurants, convenience stores, small grocery stores, and supermarkets in the child's neighborhood and their BMI, obesity or diet. These results are consistent with recent larger crosssectional and longitudinal studies examining food availability and children's outcomes (An and Sturm, 2012;Lee, 2012;Powell and Bao, 2009;Shier et al., 2012;Sturm and Datar, 2005)."}, {"section_title": "Neighborhood food environment and where family accesses food", "text": "Next, we provide insight into why living in neighborhoods with fewer supermarkets or more convenience stores or fast food outlets might not contribute to \"unhealthy\" diets among children. Specifically, we examined whether the availability of certain food outlets is related to where a family shops for or eats food. There were no significant relationships between the availability of particular food outlets and where the family shops for groceries (Table 3). In fact, families with a supermarket within 2 miles of home were no more likely to shop at a supermarket than those who have without (Table 3). These findings may be because families are willing to travel further than two miles from their home to grocery shop. Families may shop for groceries at stores close to the parents' work, their children's schools, or other convenient locations. In our sample, most families shopped at the on-post Commissary (i.e., where at least one parent works and items are sold at lower prices) or a discount, big box store, or wholesale club even though many families live off-post and almost none live within 2 miles of a wholesale club. This suggests that affordability may be an important consideration. Relatedly, a recent nationally representative survey of households found that households do not shop at the nearest supermarket, even if they walk, bike, or use public transportation to get to the store (Ver Ploeg, et al., 2015). A study of residents in a food desert also found that they did not rely on the neighborhood stores, but bypassed closer stores to shop at a preferred supermarket (Dubowitz et al., 2015). The results were similar when we examined the relationships for food outlets offering prepared foods. Children with fast food outlets or restaurants did not consume more fast food meals/snacks or restaurant and take-out meals per week (Table 4), respectively. Further, most children reported that they most often got fast food from locations off-post even if they lived on-post."}, {"section_title": "Food-at-home: home food environment and children's diet and BMI", "text": "Next, we examined whether the type of food outlet the family shops at was related to the healthiness of foods available at home, children's diet, and BMI. The regressions indicate that where the family shops for groceries is not associated with the healthiness of food available at home (Table 5). In particular, even shopping at a supermarket was not associated with healthier food environment at home. The estimated relationships with children's diet were also small and non-significant with one exception. Compared to shopping at the Commissary, shopping at convenience/small grocery stores was associated with children eating fewer ready-made dinners (-0.993). While these results may initially seem counterintuitive, most families shopped at supermarkets or the Commissary that may provide greater opportunity for junk food purchases given that all food outlets devote more shelf space to unhealthy items than healthy items and supermarkets offer more total shelf space (Farley et al., 2009). We found evidence of significant relationships between the home food environment and children's diet. Healthier home food environments as reported by the parents were significantly associated with higher consumption of fruits and vegetables, less consumption of soda, salty snacks, and sweet snacks, and fewer dinners of ready-made food among children (Appendix). Although we found no significant association with BMI and overweight or obese, these results underscore the importance of the role that parents can play in contributing to the obesogenic environment at home."}, {"section_title": "Away-from-home foods: fast food and restaurant meals and child dietary behaviors and BMI", "text": "Consistent with the existing literature (Bauer et al., 2009;Bowman et al., 2004; Nguyen, 2013), we also found evidence of significant relationships between fast food and restaurant consumption and children's diet (Appendix). An additional fast food meal/snack per week was associated with lower frequency of eating fruit (-0.580) and vegetables (-0.442) and higher frequency of drinking soda (0.489), eating sweet snacks (1.056) and eating salty snacks (0.430). An additional restaurant meal per week was associated with eating vegetables fewer times per week (-0.611), drinking more soda more times (0.362) and eating ready-made dinners (0.249) more times per week. However, these results are more likely to be biased due to endogeneity since the same factors may contribute to the choice to eat at a fast food outlet and the choice of what to eat overall. Children who eat a lot of fast food or restaurant meals may also eat lower quality foods at home. We found no significant relationships with BMI or the probability of being overweight or obese."}, {"section_title": "Parental supervision and children's diet and BMI", "text": "Finally, we examined the role of parental supervision defined as limits on sugary drinks, salty snacks, and sweets and the number of breakfast meals and dinner meals eaten together. With few exceptions, the significant relationships between the home food environment and children's diet and between fast food meals/snacks and diet were robust to the addition of parental supervision covariates (Appendix and Table 6) suggesting that parental supervision has a separate influence on dietary behaviors. In both food-at-home (Table 6, Panel A) and away-from-home regressions (Table 6, Panel B), setting limits was significantly associated with children consuming fewer sugary drinks and salty snacks, but not sweet snacks. Finally, eating an additional dinner, but not breakfast, together as a family was associated with children eating fewer ready-made dinners. These results confirm a strong relationship between parental supervision and children's diet."}, {"section_title": "Conclusion", "text": "Several recent federal and local policies and programs focus on promoting access to supermarkets and restricting access to fast food outlets despite growing evidence that availability of particular food outlets may not be associated with diet and BMI among children and adolescents (An and Sturm, 2012;Lee, 2012;Shier et al., 2012). This study adds to the growing body of evidence that the availability of supermarkets close to home is not associated with positive children's dietary outcomes, lower BMI and lower probability of overweight/obesity and, similarly, that the availability of fast food outlets and convenience stores is not associated with negative outcomes among children. These confirmatory findings are noteworthy given that our sample of military families, whose relocation generates unique variation in neighborhood environments, is not subject to the same level of residential selection that undermines typical observational studies and that we examine both perceived and objective measures of multiple aspects of the environment. Our additional contributions are a rich exploration of 1) the potential reasons for these null findings and 2) the role of the home environment and parental supervision on children's dietary behaviors. The availability of grocery food outlets was not associated with where a family shopped for groceries and the family's choice of outlet was not associated with the healthiness of the food in the home nor children's diet. Likewise, the availability of fast food outlets was not associated with how often children eat fast food meals. However, we did find significant associations between both the healthiness of food available at home and consumption of fast food and restaurant meals as well as measures of parental supervision on children's diet. An important limitation of this study is the quality of the InfoUSA business dataset, as field observations have been found to have only fair to good agreement with commercial data (Bader et al., 2010;Powell et al., 2011) which increases the noise and the probability of a null finding. However, we also found no association between whether the parent-perceived food outlets were close to home and children's diet. Another option would have been field observations, but that would be infeasible for such a large and geographically-dispersed sample of participants. Second, neighborhoods were defined using Euclidean distance to measure the 2-mile buffer, but a street network distance might provide better measure of travel distance or time. Third, there may be remaining selection bias because families can choose where to live around their assigned installation. However, two measures of residential location preference were included in the analyses that examined the neighborhood food environment, which adjust for one aspect of self-selection. Finally, our data focuses on families with an Army-enlisted parent in an effort to address the common concern regarding neighborhood selection, but, as a result, our findings may not be completely generalizable. These families exhibit similar patterns of obesity and related behaviors as civilian populations and the availability of a commissary may provide a similar affordable shopping option to big box or discount stores available to civilian families, which suggests that our findings may provide some insights for civilian populations living in similar environments. The main take-away from our analyses is that focusing only on the availability of particular food outlets in the neighborhood may ignore other important factors, including how families make decisions about food purchases and where to shop for foods, availability of healthy foods at home, consumption of fast food and restaurant meals, and parental limits, that may collectively impact children's obesity and dietary behaviors. However, we caution that our models examining the healthiness of the home food environment, consumption of fast food and restaurant meals, and parental limits and children's outcomes are vulnerable to bias from potential endogeneity because unobserved individual characteristics may be correlated with the explanatory variables and children's outcomes. Given the current research and policy emphasis on the neighborhood food environment, policy initiatives and interventions could focus greater attention on the home food environment and the role of parents. Parents have a central role in helping to shape their children's dietary habits (Savage et al., 2007). Parents can help promote healthy eating behaviors through the types and amounts of foods available in the home (Cullen et al., 2003;Jago et al., 2007;Kratt et al., 2000) and accessibility of foods in home (e.g., having fruits on the counter) (Cullen et al., 2003). Modeling healthy food consumption (Arcan et al., 2007;Fisher et al., 2002;Young et al., 2004) is also important. Parent fruit and vegetable intake has been associated with fruit and vegetable intake among children (Hanson et al., 2005;Fisher et al., 2002). Child dietary behaviors may also be influenced by parenting practices. Authoritative parenting styles that are firm but warm (likely to set limits for children based on reasoning rather than intimidation) have been associated with greater intake of fruit and vegetables and lower intake of junk food (Gable and Lutz, 2000;Lytle et al., 2003), while authoritarian (firm and likely to set rigid limits with punishment) and permissive (warm but not firm and less likely to set limits) parenting styles may not have the intended effect and lower intakes of fruits and vegetables (Cullen et al., 2000;De Bourdeaudhuij, 1997;Patrick and Nicklas, 2005). The home environment can either facilitate or inhibit healthy eating among children and parents play a key role in maintaining and supporting the home environment. Future research and interventions should address the complexity of the role of the home environment and familial influences on child diet and obesity. Figure 1: Conceptual model of relationship between neighborhood food environment and child diet and BMI  Notes: SE = Standard Error. Each cell represents a separate regression. All regressions controlled for child, family, and contextual covariates and how important proximity to supermarket or produce market and restaurants were in selecting family's current residence.   Notes: SE = Standard error. Reference group is shopping at the Commissary. Each column represents a separate regression. Home food healthiness is a summary score of 6 parent questions about food in the home. Higher score indicates healthier home food environment. All regressions controlled for child, family, and contextual covariates.  Children are more vulnerable than adults to the adverse effects of ambient air pollution because they spend more time outdoors (Wiley, 1991), have higher incidence of outdoor physical activity, have more rapid breathing, and their biological and immune systems are still developing . Therefore, even thresholds deemed safe for adults may have consequences among children."}, {"section_title": "Tables and Figures", "text": "A growing literature has linked higher concentrations of ambient air pollution to adverse health effects among children including preterm delivery, lower birth weight, infections, exacerbation of asthma, development of lung function, and childhood cancer Janet Currie and Neidell, 2004;. In addition to health effects, vulnerability to neurotoxic exposures is crucial during childhood and adolescence because the central nervous system is still developing . Preliminary biological evidence suggests a link between exposure to air pollution and neurobehavioral development . Animal model studies find that acute and chronic exposures to ozone and PM have neurotoxic effects . Studies of the lung and cardiovascular system suggest that air pollution damage includes inflammation and oxidative stress . And when PM is inhaled, it may be toxic to lung and cardiovascular tissue, cross the blood-air barrier of the lungs into circulation and the brain, and may be associated with neurodegenerative pathology ). In addition to this biological evidence on cognitive outcomes, there is emerging epidemiological and econometric evidence that air pollution may be associated with children's cognitive outcomes. Children and young adults exposed to ambient and traffic-related air pollution have been shown to perform worse on neurobehavioral tests and cognitive tasks . There is additional evidence linking air pollution to cognitive function in older adults (Ailshire and Crimmins, 2014;Ranft et al., 2009;Weuve et al., 2012), who, like children, may be particularly susceptible to adverse outcomes associated with air pollution. A few key studies have also specifically examined the association between ambient air pollution and children's test scores . For example, one study found that reductions in 0 3 , PM 10 (course particulate matter, smaller than 10 micrometers in diameter), PM 2.5 (fine particulate matter, smaller than 2.5 micrometers in diameter), and NO 2 (but not CO) were associated with significant but modest increases in academic performance on math and English/language arts standardized tests among 2 nd through 6 th graders in California . A second study found that annual exposure to PM 10 and O 3 , but not PM 2.5 , CO, or NO 2 , were associated with lower math and reading test scores in students in Chile . Although these studies suggest there is a relationship between air pollution and academic achievement, there is little consistency across studies in the pollutants that are found to be associated with cognitive outcomes. However, there are several limitations to the existing literature and gaps remain. First, existing studies examining the relationship between air pollution and cognitive outcomes are based on geographically-limited samples (e.g. city, state) or not located in the U.S. thereby limiting generalizability for U.S. children. Second, these studies have examined either previous year exposure  or shorter-term exposure   , and school absences have been associated with negative outcomes, the extent to which absenteeism due to air pollution affects academic performance has not been adequately studied. To address these gaps, we use rich longitudinal data on a national sample of children in the U.S. to examine the relationship between annual and cumulative exposure to ambient air pollution during elementary school years and children's cognitive outcomes. We also seek to explore some of the potential mechanisms by examining the role of short-term exposure and school absences.\nFigure 1: Conceptual Framework 11.7% 10.8% 75% or more 23.5% 24.1% Number of siblings 1.5 (0.01) 1.6 (0.02) Single parent 24.5% 27.4% Sample size ranges from 9400-9550 Table 2: Measures of ozone, PM 10, and PM 2.5 using kriging interpolated ambient air pollution concentrations in 5 th grade (2003)(2004) Ozone (      . There is also emerging evidence of cognitive effects of ambient air pollution. Biological studies suggest a link between exposure and neurobehavioral development  and econometric and epidemiological studies have found associations between ambient air pollution and children's test scores  and neurobehavioral tests and cognitive tasks ). The mechanisms underlying the relationship between ambient air pollution and health, and particularly cognitive, effects are not well understood. Exposure to ambient air pollution may impact children's cognition directly through neurotoxic effects of exposure . Air pollution may also impact a child's health, such as through exacerbation of respiratory illness. Studies of the lung and cardiovascular system suggest that air pollution damage includes inflammation and oxidative stress . Reduced health could then impact cognitive outcomes through increased absences school  or fatigue and attention problems. Children are more biologically susceptible to the adverse effects of ambient air pollution than adults because their biological, immune, and central nervous systems are still developing . Even among children, health and cognitive impacts may be greater for groups that are more susceptible or vulnerable to the effects of ambient air pollution. Certain groups, such as those with underlying health conditions, may have a negative response at lower doses, or may be more likely to have adverse effects or have greater severity of outcomes at a given dose. A reduction in pollution levels and exposure for these groups with the highest vulnerability may lead to greater health benefits. Some subgroups, such as children from families with low income, may also have more exposure to high levels of air pollution. However, there is no existing evidence on the heterogeneity of the relationship between ambient air pollution and children's cognitive outcomes. An understanding of these heterogeneous effects across subgroups of children will not only improve the ability to identify risk of cognitive and health effects in future studies, but also help explain the potential mechanisms of these effects. In this study, I use rich data on a national sample of children in the U. were sampled within PSUs and children were sampled within schools . Data were collected from multiple sources including direct cognitive assessments of children, interviews with parents, and surveys of school administrators and teachers. Children were followed from kindergarten through eighth grade (1998 -2007). Data on ambient air pollution I analyzed data on the ambient concentrations of ozone (O 3) recorded at U.S. Environmental Protection Agency (EPA) Air Quality System (AQS) monitors. Data from the four years prior and six years prior to the children's test assessments in spring of 3 rd and 5 th grades (kindergarten through 3 rd grade and kindergarten through 5 th grade), respectively, were used. "}, {"section_title": "Conceptual Framework", "text": "The conceptual framework in Figure 1 illustrates the factors that influence children's exposure to ambient air pollution and the subsequent relationship with their health and cognitive outcomes. Child and family factors (e.g., socioeconomic status) influence neighborhood choice, which may be correlated with the level of exposure to air pollution as well as the availability of opportunities for outdoor activities. These individual and neighborhood characteristics together influence exposure to ambient air pollution through factors such as the amount of time spent outdoors. This framework highlights the potential mechanisms through which air pollution may impact children's test scores. Exposure to ambient air pollution may impact children's cognition directly , with preliminary evidence from biological and epidemiological studies as described earlier. Air pollution may also impact children's test scores through its effects on physical health in several ways . First, air pollution on the day of testing or the immediate days before testing could exacerbate respiratory illness impacting the child's ability to perform on the test date. There is evidence of a causal effect of air pollution on exacerbation of respiratory illness (Lleras-Muney, 2010; . Second, air pollution throughout the school year that affects the child's health, including exacerbating respiratory illness, could result in increased illness-related absenteeism . Children with respiratory problems, such as asthma, could be absent from school because of exacerbation or because parents keep their child home to avoid exposure. In addition to impacting school absences, air pollution throughout the school year may have more subtle effects on child's health such as fatigue and attention problems that could impact cognitive outcomes. Finally, there may also be feedback from cognitive to health outcomes: for example, sickness contributes to poor school performance which, in turn, affects behavioral health."}, {"section_title": "Methods", "text": ""}, {"section_title": "Data on children and families", "text": "We analyzed data from the Early Childhood Longitudinal Study -Kindergarten Class (ECLS-K), a longitudinal survey of a nationally-representative cohort of U.S. kindergarteners starting in the 1998-1999 school year. The ECLS-K used a multistage probability sample design where the primary sampling units (PSUs) were geographic areas of counties or groups of counties. Schools were sampled within PSUs and children were sampled within schools . Students were followed from kindergarten through 8 th grade with data collection in fall and spring of kindergarten and spring of 1 st , 3 rd , 5 th , and 8 th grades. The study collected information on children's cognitive, health and developmental outcomes, and contextual data on their families, teachers and schools in each wave. We focused on test scores collected in spring of 3 rd and 5 th grades because data on school absences were collected in both of these years. The analytic sample includes 9400 children in 3 rd grade and 9550 children in 5 th grade, with valid census tract identifiers and air pollution data, and complete data on covariates. Children in the sample were more likely than those who did not remain in the sample to have family income greater than or equal to $75,000 and a mother who completed college or more in kindergarten. There were no differences in race/ethnicity or gender. School Absences: The number of excused and unexcused absences for the school year were obtained from school record abstraction. Covariates: Detailed socioedemographic characteristics of children and their families at 3 rd and 5 th grades were included as control variables in the regressions. These include child's gender, raceethnicity (white, black, Hispanic, Asian, and other/Multi-race), socioeconomic status, age in months, mother's education (less than high school; high school; some college; college and more), single parent household, indicators of household income (<15k, 15k to <25k, 25k to <35k, 35k to <50k, 50k to <75k, and >=75k), number of siblings, percent minority in school (<10%, 10% to <25%, 25% to <50%, 50% to <75%, 75% or more), and urbanicity (rural, town, urban). In addition, we also included controls for weather: the maximum annual temperature and mean annual temperature. Maximum annual temperature and mean annual temperature were created based on daily weather data, measured at more than 20,000 stations throughout the country. We used the same methods to assign weather covariates to children's residential locations as we used to assign pollution exposure (described below). Weather data was included as potential confounders because hot temperatures in some geographic locations may raise O levels and also result in poor health. Descriptive statistics for covariates are reported in Table 1. Additional controls used in sensitivity analysis include school size (0-149, 150-299, 300-499, 500-749, 750+), whether the student attended a private school, percent of students eligible for free or reduced lunch, and region (indicators for south, west, and northeast)."}, {"section_title": "Air pollution exposure", "text": "We used data on the ambient concentrations of O 3 , PM 2.5 , and PM 10 recorded at U.S. Using the interpolated data, we constructed three types of air pollution exposure: (1) annual measures to capture pollution exposure in year preceding testing (third and fifth grades), (2) cumulative measures to examine pollution exposure from kindergarten through third and kindergarten through fifth grades, and (3) short-term measures to capture pollution exposure on the day of and the week before testing. Annual air pollution measures in third and fifth grades: For annual pollution exposure, three measures were created for each pollutant using data from the year prior to each child's test date. These measures of air pollution exposure were created based on the National Ambient Air Quality Standards (NAAQS) for each pollutant. These measures were created to capture both the maximum exposure the child was exposed to during the year and also how much high levels of exposure the child was exposed to. The measures of O 3 exposure created include: (1) the highest daily maximum 8-hr concentration in the previous year; (2) the percentage of days in the previous year when the daily 8-hr concentration was >= 75 ppb; and (3) whether the highest daily maximum 8-hr concentration was >= 75 parts per billion (ppb). Similarly, three measures of PM 2.5 were created: (1) the highest daily 24-hour average in the previous year; (2) the percentage of days in the previous year when the daily 24-hour average was >=35 μg/m 3 ; and (3) whether the highest daily average was >=35 μg/m 3 . Similar measures of PM 10 were created using the daily average cutoff of 150 μg/m 3 . Cumulative air pollution measures (kindergarten to third grade, kindergarten to fifth grade): For cumulative measures of pollutant exposure, two measures were created: (1) the number of years where the highest daily maximum concentration was above the NAAQS standard (>= 75 parts per billion (ppb) for ozone; >= 35 μg/m 3 for PM 2.5 ; ,>= 150 μg/m 3 for PM 10 ) and (2) indicators for whether the highest daily maximum concentration was above the NAAQS standard during one year or two or more years. These measures were created using data from kindergarten through third and kindergarten through fifth grades. Short-term air pollution measures in third and fifth grades: Two measures of short-term pollutant exposure were created: (1) the daily value (daily maximum 8-hr concentration for ozone and 24-hour average for PM and PM 2.5 ) on the day of testing and, (2) the maximum of these values during the week prior to each child's testing date. Descriptive statistics of the measures of are reported in Table 2. (Descriptive statistics of the measures for PM 10 are presented in Appendix 1). On average, children were exposed to a daily maximum 8-hour concentration of 61.3 ppb of ozone in the year preceding the testing. At the time of testing, the NAAQS specified the annual fourth-highest daily maximum 8-hour concentration, averaged over 3 years should not exceed 75 ppb of ozone. For PM 2.5 , children were exposed to a maximum of 32.1 µg/m 3 in the year preceding the testing, while NAAQS specifies the 98 th percentile of daily average, averaged over 3 years should not exceed 35 µg/m 3 . Children were more likely to be exposed to abovestandard concentrations of PM 2.5 than ozone in the years between Kindergarten and fifth grade."}, {"section_title": "Analyses", "text": "The relationship between ambient air pollution and cognitive development is a complex relationship to estimate empirically. Therefore, in addition to examining several measures of annual, cumulative, and short-term air pollution exposure, we also took a comprehensive approach to analysis. We started with cross-sectional linear regression models to examine the association between annual ambient air pollution and cognitive outcomes in third and fifth grades. We conducted separate analyses for each of the three pollutants and their associated measures evaluating air pollution exposure in relation to reading and math test scores. Next, we leveraged the longitudinal nature of the data by estimating two additional models. First, we estimated a child fixed-effects model that leverages within-child changes in exposure and helps address bias from potential endogeneity if time-invariant unobserved individual and neighborhood characteristics are correlated with air pollution and academic outcomes. However, the within-child change in exposure each year may be small and it is possible that cumulative exposure may matter more than yearly exposure for cognitive development. Therefore, second, we estimated the relationship between the cumulative exposure of air pollution (Kindergarten to 3rd and Kindergarten to 5th) and reading and math test scores in third and fifth grades, respectively. Test scores in kindergarten were also added to these models to control for pre-school achievement that would not be impacted by the air pollution exposure starting in Kindergarten We examined the robustness of these cumulative model results by conducting additional regression models that added the following controls: (1) school: school size, whether a private school, and percent of students eligible for free or reduced lunch; and (2) region fixed effects. Next, we fitted the models separately for children who did not move between kindergarten and fifth grade to address the potential selection within children if parents choose to move to a new location for reasons that are related to the air pollution in their current neighborhood, their child's health, or cognitive outcomes. Finally, for findings found to be robust in the previous analyses, we began to explore some of the potential mechanisms through which air pollution might impact test scores including air pollution levels on the day of testing and whether total absences in the school year helps explain some of the relationship between air pollution test scores. Statistical analyses were conducted using Stata/MP 13 (StataCorp LP, College Station, Texas). Our analyses used ECLS-K weights constructed for the analyses of the particular wave of interest and combined data from the parent interview, child assessment, and school administrator questionnaire. Sample sizes were rounded to the nearest 10 to comply with the restricted data license of the National Center for Education Statistics. grade. There were no significant associations between annual PM 10 measures and reading and math test scores (Appendix 2)."}, {"section_title": "Robustness checks", "text": "We examined the robustness of the cumulative model findings for O 3 and PM 2.5 by considering additional covariates to control for school (Table 5, Panel A)and region ( Table 5, Panel B) using the number of years (K to 3 and K to 5) where pollutant exposure was above the standard. The coefficients and significance remained similar to the main model results for both math and reading scores. When we restricted the sample to children who did not move between kindergarten and third and between kindergarten and fifth grades ( Table 5, Panel C), again the coefficients remained similar in magnitude and significance to the results for third and fifth grades, respectively."}, {"section_title": "Potential Mechanisms", "text": "We shed light on two potential mechanisms through which air pollution may impact children's test scores. First, we examined ozone on the day of testing and the week prior to testing (Table 6, Panel A) and found no association with child test scores. This suggests that the association between ozone and math test scores is not due to decreased health on the day of testing. Second, we examined whether air pollution impacts the child's health throughout the year resulting in increased illness-related absenteeism, contributing to lower test scores. We tested this by adding annual school absences as a covariate to the annual ozone model to examine math test scores in third grade (Table 6, Panel B) and found that the coefficient on ozone exposure (number of years with exposure above standard) was reduced from -0.037 to -0.028 and was no longer significant. These results suggest that the relationship between ozone and lower math test scores may be partially explained by increased school absences."}, {"section_title": "Conclusions", "text": "This study adds to the emerging body of evidence that ambient air pollution is associated with cognitive outcomes using a national U.S. sample of children, sophisticated interpolation methods, and exploring some of the potential mechanisms of this association. We found that annual and cumulative measures of ozone and PM2.5 during third grade were significantly associated with lower reading and math test scores among children. The significant negative association between ozone and math test scores is consistent with two recent studies that examined academic performance in California  and Chile . One of these studies also found a significant relationship for PM 2.5 . Although no previous studies have examined cumulative exposure and cognitive outcomes, studies of health outcomes have shown that long-term repeated exposure is associated with increased risk of cardiopulmonary disease, mortality, and potentially lower lung function (Pope 3rd, 2000). While no significant association was found between ozone and reading test scores, it is possible a significant association would be found among more vulnerable or more susceptible subpopulations. This would include children with respiratory health issues or children who are more  . In contrast, our results suggest that the association between ozone and math test scores is not due to decreased health on the day of testing. However, it may be that children who have decreased health on the day of testing miss the testing altogether or that the short-term effect of air pollution may not be substantial enough to impact the test scores. One previous study in Israel also examined the association between air pollution on the day of exams, and found an association with a decrease in college entrance exam scores, but this study simply averaged the monitors within the city limits, did not set a maximum distance of the monitors, and did not discern between monitors closer or further from the school Lavy et al., 2014). Air pollution could also impact the child's health throughout the year, causing increased illnessrelated absenteeism. Our results suggest that the relationship between ozone and lower math test scores may be partially explained by increased school absences. These results are consistent with a previous study that found a change in ozone was associated with an increase in school absences due to respiratory illness ). Increased absences, as a partial explanation for the relationship between ozone and test scores could also help explain why we consistently found larger associations between ozone and math test scores, compared to reading test scores. Math performance has been found to be more dependent on attendance and hours of instruction . In contrast to associations between ozone and PM 2.5 and test scores, we found no signification associations for PM 10 . We considered potential explanations for these null findings. Insufficient statistical power seems unlikely given that we had sufficient power to detect very small significant associations in O 3 and PM 2.5 . . However, it is possible that PM 10 is associated with cognitive outcomes that are not best measured through reading and math testing. Responses to exposure of different air pollutants may vary by brain region and function. Examining healthy, cognitively normal adults, one study found that PM 2.5 was associated with lower verbal learning performance, while O 3 was associated with lower executive functioning and logical memory (Gatto et al., 2014). Thus, it may be the case that ozone and PM 2.5 exert effects on cognitive domains that are captured by the reading and math scores used in the ECLS, whereas PM 10 could impact cognitive domains that are not measured by the ECLS tests. This study had several limitations. First, we used ambient air pollution concentrations measured at central monitoring sites to assign exposures to the study sample. Personal monitors may better capture individual exposure by incorporating individual activity patterns and time spent outdoors. Second, we do not have residential information to represent the geographic location of the children prior to kindergarten so cannot characterize the life-course cumulative exposure. Finally, while our study begins to explore some of the potential mechanisms for a relationship between ozone and test scores, we were not able to investigate whether air pollution impacts fatigue or attention issues. Within these limitations, our results provide some of the strongest findings to date linking ozone and PM 2.5 with cognitive outcomes using a national sample of children, with significant geographic, socio-economic, and racial-ethnic diversity. Additional research should focus on: (1) the biological effects on cognition, (2) the potential roles of neurobehavioral, fatigue, and attention issues, and 3effects among potential vulnerable subpopulations, to better understand the mechanisms behind the relationship between ambient air pollution and children's cognitive effects."}, {"section_title": "Measures of ozone exposure", "text": "The main explanatory variables are annual and cumulative measures of ozone exposure. Using the interpolated data of ozone, for the annual measure of exposure, I constructed the highest daily maximum 8-hr concentration in the previous year to capture the maximum exposure each child was exposed to during their third and fifth grade years. For cumulative ozone, I constructed a measure of the number of years where the highest daily maximum ozone concentration was above the National Ambient Air Quality Standards (NAAQS) of >= 75 parts per billion (ppb). These measures were created using data from kindergarten through third and kindergarten through fifth grades."}, {"section_title": "Covariates", "text": "Detailed socioedemographic characteristics of children and their families at 3 rd and 5 th grades were included as control variables in the regressions. These include child's gender, raceethnicity (white, black, Hispanic, Asian, and other/Multi-race), age in months, mother's education (less than high school; high school; some college; college and more), single parent household, indicators of household income (<15k; 15k to <25k; 25k to <35k; 35k to <50k; 50k to <75k; and >=75k), number of siblings, percent minority in school (<10%; 10% to <25%; 25% to <50%; 50% to <75%; 75% or more), and urbanicity (rural, town, urban). In addition, I also included controls for the maximum annual temperature and mean annual temperature. Maximum annual temperature and mean annual temperature were created based on daily weather data, measured at more than 20,000 stations throughout the country. These temperature covariates were assigned to children's residential locations using the same EBK method that was used to assign ozone exposure. Temperature data was included as confounders because hot temperatures in some geographic locations may raise O 3 levels and also result in poor health."}, {"section_title": "Analysis", "text": "I first estimated the cross-sectional relationship between annual ozone exposure and cognitive outcomes. Leveraging the longitudinal nature of the data, I then estimated the relationship between the cumulative exposure of air pollution (Kindergarten to third and Kindergarten to fifth) and reading and math test scores in third and fifth grades, respectively. Test scores in fall of kindergarten were also added to these models to control for any impact of exposure prior to when home location is known and air pollution exposure can be measured. In addition to the full sample in third and fifth grades for the annual and cumulative measures of ozone, these models were estimated for a series of subgroups to examine any heterogeneous effects and explore whether results are driven by particular subgroups. I examined whether the relationship between ozone and reading and math test scores differed across children based on socioeconomic status, gender, whether the child has asthma, and whether the child gets exercise at a public park. For socioeconomic status, I used a five category variable constructed by ECLS-K based on household income, mother's education, father's education, and mother's occupation, and father's occupation. Each component of the SES was converted to a z-score with a mean 0 and then averaged to create the SES composite measure. The high SES and low SES groups were created based on the top two quintiles and bottom three quintiles, respectively. For whether the child has asthma, parents indicated whether a doctor, nurse, or other medical professional ever told him/her that the child has asthma. Parents also reported whether their child regularly got exercise through a public park or recreation center. Statistical analyses were conducted using Stata/MP 13 (StataCorp LP, College Station, Texas). ECLS-K weights that constructed for the analyses of the particular wave of interest and combined data from the parent interview, child assessment, and school administrator questionnaire were used. Sample sizes were rounded to the nearest 10 to comply with the restricted data license of the National Center for Education Statistics. Table 1 presents descriptive statistics for cumulative ozone measure, dependent variables, and covariates in third and fifth grades. In third grade, the same was almost 60% white, non-Hispanic, more than 20% Hispanic, and approximately 13% black, non-Hispanic, Less than 5% were each Asian or other. Almost 40% had mothers with an educational level of High school or less than high school. Children most often lived in towns (44.2%) or cities (36.3%), with only 19.4% living in rural areas. Table 2 presents the results for the associations between annual exposure to ozone and reading and math test scores in third and fifth grades for the overall sample, as well as by subgroups. In the overall sample (Table 2, Panel A), an additional part per billion for the highest daily maximum 8-hr concentration was significantly associated with 0.04 lower math test score in third grade. There was no significant association with reading test scores in third grade or either test score in fifth grade. Similarly, Table 3 presents the results for the associations between cumulative exposure to ozone (kindergarten to third and kindergarten to fifth) and reading and math test scores for the overall sample, as well as by subgroups. The results for the overall sample (Table 3,  The results by subgroups were also similar using the annual and cumulative ozone measures. Examining the associations by socioeconomic status, the association between exposure of ozone and math test scores in third grade was larger and remained significant for families with high socioeconomic status, but smaller and not significant for families with low socioeconomic status (Tables 2 and 3, Panel B). This was also true for reading test scores in third grade using the annual measure of ozone, but not the cumulative measure. There was also a larger and significant association between ozone exposure and math test scores in third grade among girls (Tables 2 and 3, Panel C). This relationship was smaller and not significant among boys."}, {"section_title": "Discussion", "text": "In the overall population, I found a significant association between annual and cumulative ozone exposure and math test scores in third grade, but not reading test scores in third grade or either test score in fifth grade. The significant association for math test scores, but not reading test scores, may be because math testing requiring more attention, memory, or executive functioning than reading tests. Math performance has also been found to be more dependent on attendance and hours of instruction . The difference between third and fifth grades could be due to different activity patterns, behaviors, or developing physiology. Younger children inhale more air per time and per body weight (Moya et al., 2004). The effects of ozone exposure may also differ across children based on their vulnerability to health or cognitive effects of air pollution and their exposure to high levels of ozone. A priori, the relationship between ozone exposure and children's test scores among family socioeconomic status is unclear. Previous research has shown mixed evidence for differences in associations between pollution and mortality according to socioeconomic status in short-term relationships (Laurent et al., 2007). On the one hand, children in families with low socioeconomic status may live in conditions that elevate exposure to air pollutants. Lowincome families may be more likely to live in areas with high ambient air pollution and have poorer housing, which can offer less protection indoors from ambient air pollution (Lipfert, 2004). These children may also be more susceptible to air pollution due to more underlying conditions, poorer health status, multiple pollutant exposures (passive smoking), and less access to healthcare (Adler and Newman, 2002;Goodman, 1999). On the other hand, as these results suggest, children in families of low socioeconomic status may already be impacted by many adverse factors and other environmental exposures (e.g., noise, water quality, crowding, housing quality, neighborhood conditions) that the effect of ozone on cognition is only seen among children in high socioeconomic families. Similarly, gender differences in associations between ozone and cognitive outcomes may be attributable to multiple factors -namely exposure differences, biological differences, or both. Girls spend less time exercising and less time outdoors than boys and children exercising outdoors have greater exposure to air pollutants. This is particularly true for ozone, which has very low levels indoors (Lee et al., 2002) due to a short half-life in indoor air (Weschler, 2000). Time spent exercising increases ventilation rates, which may also increase the child's exposure to air pollutants. The significant association between ozone and math test scores among children who regularly get exercise through a public park provides some additional evidence for this relationship. However, I also found a larger (in magnitude) and significant association among girls compared to boys, which suggests that differences in activity patterns (i.e., outdoor play) are not the only factor at play. Although the biological mechanisms are not well understood, some studies have suggested that differences in response between girls and boys may be due to biological differences in lung function growth rates, hormonal factors, and size (Berhane et al., 2000;Clougherty, 2010;Oftedal et al., 2008;Peters et al., 1999). Underlying medical conditions may also impact susceptibility to ambient air pollution. Although I found a non-significant association between ozone and math test scores among children with asthma, the magnitude of the association was larger among children with asthma than those without. Only 12% of the sample of children had asthma which may contribute to why the association among children with asthma was insignificant. A strong relationship between ozone and math test scores among children with asthma was expected because air pollution is related to exacerbation of asthma, children with asthma are absent from school more often than students without asthma (Taras and Potts-Datema, 2005), and persistent asthma is associated with lower test scores (Moonie et al., 2008). However, these results also indicate that it is not only children with asthma who may react adversely to ozone exposure. Therefore, the impact of air pollution on test scores is not only through exacerbation of asthma symptoms, but potentially through other decreased health, increased fatigue, or a direct neurodegenerative effect. This study had several limitations. First, personal monitors, instead of ambient air pollution concentrations measured at central monitoring sites, may better capture individual exposure and also incorporate individual activity patterns and time spent outdoors. However, the use of personal monitors is unlikely feasible in larger national studies. Second, the variables that make up socioeconomic status, asthma status, and whether the child regularly gets exercise at a public park are reported by the parent. This study is the first to explore factors, including socioeconomic, gender, medical conditions, and outdoor exercise that may impact susceptibility and/or vulnerability of exposure to ambient air pollution on cognitive outcomes among children. This provides insights into the role of ozone and the mechanisms of any impact. Future work should also examine whether different subgroups also have differential impacts at varying thresholds. Identifying the heterogeneous effects will help us understand the mechanisms underlying the relationship between ambient air pollution and cognitive outcomes. These results also elucidate the importance of understanding the interplay between greater exposure and biological susceptibility. The public health implications of the understanding of heterogeneous effects on health and cognitive outcomes and thresholds among children are significant because many air pollution standards aim to reduce average exposure, rather than targeting reduction to the areas receiving the highest exposure or among subgroups at highest risk to adverse effects.    were significantly associated with lower reading (PM 2.5 ) and math (ozone and PM 2.5 ) test scores. There are several potential mechanisms through which air pollution may impact children's test scores. First, these results suggest that the association between ozone and math test scores is not due to short-term effect of air pollution on the day of testing. The results also suggest that the relationship may be partially explained by increased school absences throughout the school year. Additional research should focus on: (1) the biological effects on cognition and (2) the potential roles of neurobehavioral, fatigue, and attention issues. In the third paper, I examined the heterogeneous effects of ozone exposure by child characteristics including socioeconomic status, gender, asthma status, and regular outdoor exercise. The effects of ozone exposure may also differ across children based on their vulnerability to health or cognitive effects of air pollution and their exposure to high levels of ozone. These results suggest that children in families of low socioeconomic status may already be impacted by many adverse factors and other environmental exposures (e.g., noise, water quality, crowding, housing quality, neighborhood conditions) that the effect of ozone on cognition is only seen among children in high socioeconomic families. I also found a significant association between ozone and math test scores among children who regularly get exercise through a public park, likely contributed to the increased exposure to air pollutants from additional time spent outdoors exercising. I also found a significant association among girls but not boys, which suggests that differences in activity patterns (i.e., outdoor play) are not the only factor at play. Although not well understood, biological mechanisms including lung function growth rates, hormonal factors, and size may contribute to gender differences. Finally, I found a significant association between exposure and math test scores among children without asthma indicating that it may not only be children with asthma who react adversely to ozone exposure. Therefore, the impact of air pollution on test scores may not only be due to exacerbation of asthma symptoms, but potentially through other decreased health, increased fatigue, or a direct neurodegenerative effect."}]