[{"section_title": "Abstract", "text": "A middle-grades homework intervention was investigated to determine if variations in prompting families to be involved with mathematics homework would influence their level of involvement. The extent to which family involvement was a predictor of student achievement in mathematics was also examined, as were the relationships among family involvement, student achievement, and parent education level. Families in the 2 prompted groups were significantly more involved with mathematics homework than were families in the noprompt group. Level of family involvement was not significantly related to student achievement on the posttest. However, students across the 3 groups whose parent(s) held a 4-year college degree scored significantly higher on the post-test than did students neither of whose parents held a college degree, even though reported levels of family involvement were nearly identical across parent education levels. Qualitative data elicited in follow-up interviews with family members indicated that \"quality of involvement\" with homework merits examination in future research.\nDoing homework is a nightly routine for most school-age children, and research suggests that parent involvement with their children's homework is associated with improved academic performance ("}, {"section_title": "", "text": "In contrast, Sui-Chu and Willms (1996) analyzed data from the National Education Longitudinal Study (NELS, 1988) and found that parents provided relatively similar levels of homework supervision, regardless of SES. Achievement, however, was more strongly associated with home discussions about school than with homework supervision alone, and home discussions were moderately related to SES. Salerno and Fink (1992) argued that low SES need not necessarily be a barrier to family involvement and student achievement. They found that children from low-educated migrant families who successfully completed their education had family support for academic pursuits. Likewise, Clark (1993) surveyed 460 families from 71 elementary schools and found that regardless of parent education level, students whose parents \"pressed\" for academic success experienced higher academic achievement than did students whose parents did not press for success.\nIn examining the long-term influence of low SES, Kinard and Reinherz (1986) found that low SES tends to correlate with low academic achievement, which, in turn, can trigger dropout behavior (see also Cairns, Cairns, & Neckerman, 1989; Ekstrom, Goertz, Pollack, & Rock, 1986) . However, we can infer from the Salerno and Fink (1992) and Clark (1993) studies that the association between academic achievement and a student's family background is more complex than a simple linear function."}, {"section_title": "Summary", "text": "The literature review suggests two conclusions. First, there is a need for more research on family involvement with middle-grades homework; middle school is precisely the time when family involvement declines (Epstein & Connors, 1995; Greenwood & Hickman, 1991; National Education Goals Panel, 1995; Steinberg, 1988) . Second, there is inconsistent evidence concerning the association of parent education level with family involvement and student achievement.\nOur purpose in the present study was to investigate an intervention designed to increase family involvement with the mathematics homework of their middle-grades students. We formed three groups as follows: Group 1--students were prompted to involve family members, and family members were prompted to be involved; Group 2--students were prompted to involve family members; and Group 3--no prompting was given. We made four predictions:\nThe two groups receiving prompts to involve a family member with mathematics homework would each report significantly higher levels of family involvement than would the no-prompt group.\nThe two prompted groups would be more involved with the mathematics homework assignments than with other homework assignments.\nThe students in the two prompted groups would score significantly higher on the mathematics posttest than would the students in the no-prompt group.\nConsistent with indications from previous research, the students whose parent(s) held a 4-year college degree would experience significantly higher levels of family involvement with mathematics homework and significantly higher achievement on the posttest than would the students whose parents did not hold a college degree."}, {"section_title": "METHOD", "text": ""}, {"section_title": "Sample and Design", "text": "Seventy-four White sixth graders and their families participated in the study. The students were enrolled in one of three mathematics classes taught by the same teacher in a midwestern middle school. Enrollment procedures ensured that the classes were similar in student academic ability and background. The classes were randomly assigned to one of three treatment groups. During whole-class instruction, each group received unique verbal and written directions for completing 20 mathematics assignments at home.\nTo determine mathematical equivalence among the three groups, we used mean mathematics achievement scores from the students' most recent standardized test (administered the prior school year to all students in the study with the exception of two transfer students whose mathematics achievement scores from their previous school were used). An analysis of variance (ANOVA) indicated that the three groups were nearly identical in prior mathematics achievement, F(2,71) = .001, p = .99."}, {"section_title": "Materials and Instruments", "text": "Assignments. We adapted the instructional materials from a set of middle-grades mathematics homework assignments that were part of a program called \"Teachers Involve Parents in Schoolwork\" (TIPS; Epstein, 1988) . TIPS assignments require that students gather information, explain and demonstrate concepts, and guide interactions with a family member in order to complete homework. The TIPS mathematics assignments cover basic concepts including whole numbers, fractions, decimals, measurement, integers, and using data.\nEach assignment was printed on one sheet of yellow paper (to differentiate it from other papers given to students) and included three sections: (a) instruction on the skill to be learned, (b) sample problems to be solved, and (c) application activities to be completed. For purposes of the present study, we altered the 20 assignments for two of the three groups according to the following experimental conditions: Student/family prompts (Group 1): This set of 20 assignments was used as originally designed and included the mathematics instruction, examples, and application activities. These assignments prompted students to involve a family member and prompted families to offer written comments about the assignments on a feedback section. The feedback section also requested a family member's signature. These assignments further requested that students indicate \"who helped\" (e.g., mother, brother, no one).\nStudent prompts (Group 2): This set of 20 assignments included the mathematics instruction, examples, and application activities. These assignments prompted students with directions on how to involve a family member, requested that students indicate \"who helped,\" but did not include a feedback section for families to offer comments about the assignments or a signature.\nNo prompts (Group 3): This set of 20 assignments included only the mathematics instruction, examples, and application activities. There was nothing printed on the assignments to prompt family involvement, and there was no feedback section.\nPosttest. We constructed a posttest consisting of 40 mathematics problems. Two similar problems from each of the 20 homework assignments were included in the posttest. The sixth-grade mathematics teacher and a mathematics professor (not connected with this study) compared each of the posttest questions with the 20 assignments. We made suggested changes to ensure content validity.\nLetter to families. We constructed introductory letters to inform families about the homework assignments to correspond to each of the three prompting conditions. The student/family-prompt letter informed Group I families about the yellow mathematics assignments and indicated that the students would be responsible for involving a family member. The letter also requested written comments about the assignments and about family interaction with the students. On the feedback section of each assignment sheet, comments and a family member's signature were requested. The student-prompt letter for Group 2 families was similar to the Group I letter except that it did not request feedback or a signature on the assignments. The no-prompt letter informed Group 3 families about the yellow mathematics assignments that the students would be bringing home but made no mention of family involvement.\nHomework survey. A homework survey consisting of 10 questions was constructed to assess family involvement with mathematics homework and with other homework assignments. Questions focused on the extent to which family members discussed, helped, checked answers, and encouraged their children with homework. Two examples of survey items that deal with mathematics homework were \"I (or another family member) helped my child with the yellow math homework sheets\" and \"I (or another family member) helped my child with other homework.\" We used a 5-point Likert-type scale, with responses ranging from 5 (always) to I (never)."}, {"section_title": "Procedure", "text": "The introductory letters to families were mailed a week before the homework assignment distribution. The mathematics assignments were distributed to students at the teacher's discretion to correspond with the regular curriculum. No other mathematics homework was assigned during the 3-month duration of the study. After distributing a homework assignment, the teacher reviewed assignment directions and applied differential prompting. The students in the student/family-prompt group were told to complete the assignments at home, were coached to involve a family member as directed on the assignments, and were alerted to the feedback section that prompted families to provide written feedback and sign the assignment sheet. Students in the student-prompt group were told to complete the assignments at home and were coached to involve a family member as directed on the assignments. There was no feedback section on this group's assignments. Students in the no-prompt group were told to complete the assignments at home, but were given no prompts (either verbally or in print) to involve family members. Students in all three groups were asked to turn in assignments, usually 1 or 2 days after an assignment was distributed. Directions were reviewed and prompting was given each time an assignment was distributed.\nAfter each assignment was completed and turned in, it was graded, recorded, and returned to the students. The students' written reports of who helped with each assignment were recorded for the student/family-prompt group and the student-prompt group (assignments for the no-prompt group did not ask who helped). Any written comments included on the student/family-prompt assignments were entered into a data base (assignments for the two other groups did not ask for written comments).\nAfter all 20 assignments were completed, the students were given the posttest. The test was scored with I point given for each correct response. The most recent mathematics standardized achievement score was obtained for each student and used as a covariate to control for variability in the posttest scores that were attributable to prior achievement.\nThe homework survey was mailed to parents in all three groups after the homework assignments had been completed. The surveys were coded, linking a specific survey to a specific student. The survey included directions for completion and asked parents to enclose the survey in an accompanying envelope and return it to the school."}, {"section_title": "Measures", "text": "Parent-reported family involvement. Four questions on the homework survey were used to assess family involvement with the 20 mathematics assignments. A coefficient alpha of .86 indicated internal consistency on responses to these questions. An additional four questions assessed family involvement with other homework assignments, and a coefficient alpha of .71 indicated internal consistency."}, {"section_title": "Student-reported family involvement.", "text": "The students in the two prompted groups recorded the occurrence of family involvement on each assignment by answering \"Who is working with you?\" Student achievement. Scores on the 40-question posttest assessed student achievement. A reliability coefficient of .90 was assessed using the Kuder-Richardson 20 (Hopkins, Stanley, & Hopkins, 1990) . Mean scores on the 20 homework assignments were also examined for evidence of student achievement.\nInfluence of parent education level. Demographic data on parent education level were obtained from school records. Parent education data were divided into two groups (i.e., one or both parents 4-year degreed or neither parent degreed). The involvement and achievement data for the three homework groups were each collapsed into two groups based on parent education level to provide a large enough sample for meaningful analysis.\nComments and interviews. We collected two forms of qualitative data to illustrate the family dynamics. First, family members in all three groups who were willing to discuss their involvement with homework were asked to indicate their telephone numbers on the homework survey. The telephone interviews normally lasted about 10 min and focused on the challenges associated with homework involvement. We examined interview responses for common themes (Seidman, 1991) . Second, we examined written comments offered by family members in the student/family-prompt group. Two individuals who worked independently sorted the written comments into categories of common themes."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Summary of Data Collected", "text": "Seventy-four students in the three groups completed 20 mathematics homework assignments (100% return ratel,480 total assignments), and all 74 students took the posttest. Sixty-nine families (93% return rate) returned the follow-up survey used to assess family involvement with homework. Twenty-four families (31%) agreed to be interviewed by telephone. We conducted 10 interviews with the participants in the student/family-prompt group, 7 with the participants in the student-prompt group, and 7 with the participants in the no-prompt group. Interviewees included 15 mothers, 8 fathers, and I grandmother representing various educational backgrounds and levels of involvement with homework. The children of the interviewees represented a full range of achievement on the posttest. In addition to the interview data, 68 comments were written on the assignments by family members from the student/family-prompt group (the only group prompted to write comments)."}, {"section_title": "Involvement With Mathematics Homework", "text": "An ANOVA used to compare the mean levels of reported family involvement with mathematics homework among the three groups was statistically significant, F(2,66) = 13.61, p < .01. Pairwise comparisons among the three group means showed that the two prompted groups each reported significantly more family involvement with the mathematics homework than did the no-prompt group (see Table 1 ).\nStudent reports of family involvement (recorded on assignments for the two prompted groups) indicated that approximately 90% of family involvement was from parents and 10% was involvement from other family members. Families interviewed in the two prompted groups suggested that student prompting influenced their involvement. For example, one parent reported, \"Our child said it was something we were supposed to do with him. Typically, he does not show us his homework.\" Another parent commented, \"I looked forward to doing the homework. She [the student] hasn't always asked me to help before.\" In contrast, one father from the student/family-prompt group who was involved with 3 of the 20 assignments suggested the prompts were coercive: \"I don't like the idea of forcing children to work with parents on homework. Our daughter only asks if she has trouble.\" This was the only explicit comment that suggested that some parents did not like being asked to participate with homework.\nAccording to 16 of the 24 interviewees across all three groups, time constraints were the greatest challenge associated with their involvement with homework. For example, a father commented, \"When I get home late, it's harder to help. I want to set a schedule--like one hour to decompress and then do homework.\" Another father said, \"Like most families, my wife and I work long hours and the kids are involved in extra curricular activities, but homework comes first.\"\nThere was no statistically significant difference in reported family involvement between the student/familyprompt group and the student-prompt group. However, student reports of family involvement recorded on each assignment indicated that the mean percentage of family involvement for the 20 assignments was 90% for the student/family-prompt group and 51% for the student-prompt group."}, {"section_title": "Involvement With Other Homework", "text": "Four questions on the homework survey concerned reported family involvement with homework other than the 20 mathematics assignments. An ANOVA conducted on the relationship among the three groups' reported family involvement with other homework was nonsignificant, F(2,66) = 2.24, p =. 11, indicating that families in the three groups were similarly involved with other homework (see Table 1 ).\nAn examination of the means in Table 1 , however, indicated a difference between family involvement with other homework and family involvement with the mathematics homework for each of the three groups. A twofactor ANOVA (i.e., groups, homework types) with repeated measures on the second variable indicated a statistically significant interaction between the three groups and the two homework types (i.e., mathematics homework, other homework), F(2,66) = 11.24, p < .01 (see Figure 1) .\nWe examined each group for within-group differences. As predicted, the two prompted groups reported significantly more family involvement with mathematics homework than with other homework. In contrast, the no-prompt group reported significantly more family involvement with other homework than with the mathematics homework (see Table 2 ).\nIn addition to the eight survey questions that assessed family involvement with mathematics homework and with other homework, two final questions concerned the extent to which families would be involved with homework if their children prompted them to be involved and if their children's teacher prompted them to be involved. In all three groups, the families reported that they would more likely be involved with homework if their children prompted them to be involved and to a slightly lesser extent if only their children's teacher prompted the involvement."}, {"section_title": "Student Achievement", "text": "The mean posttest score for the student/family-prompt group was only slightly higher (68%) than the mean scores for the student-prompt group (66%) and the no-prompt group (67%). Pearson correlations between posttest scores and prior mathematics achievement scores indicated positive and significant correlations for each of the three groups (.66, .74, and .88, respectively), suggesting that these scores were an appropriate covariate for examining posttest means. An analysis of covariance (ANCOVA) used to assess the relationship among the three groups' posttest achievements was nonsignificant, F(2,70) =. 15, p = .85. Consequently, the predicted hypothesis that higher levels of family involvement would be associated with higher posttest achievement was not supported.\nLooking at the entire sample, there was a significant negative correlation between family involvement with mathematics homework and posttest achievement (-.24, p = .04). Correlations by group, however, indicated a significant negative correlation only for the no-prompt group (-.52, p = .008). Families in this group were not prompted to be involved and were significantly less involved than were families in the other two groups; however, the students in the no-prompt group scored as well on the posttest as did the students in the other two groups. There was no significant correlation between family involvement with mathematics homework and posttest achievement for either the student-prompt group (.01, p = .95) or the student/family-prompt group (-.16, p = .47).\nIn addition to posttest achievement, mean scores on the 20 mathematics homework assignments were examined for achievement differences among the three groups. The student/family-prompt group had the highest mean score (82%), followed by the student-prompt group (79%) and the no-prompt group (75%). Although these means show a pattern in the hypothesized direction that could be associated with variations in family involvement, the differences were nonsignificant, F(2,57) = 2.05, p = .13.\nRegarding achievement, one of the themes that emerged from the telephone interviews indicated that some involved family members found the homework difficult. For example, a father indicated, \"It is getting harder to help now. It was easier when my child was little.\" A mother reported, \"We need guides to help the kids. You all teach differently than I was taught.\" Another father reported, \"The worst part is figuring out what I forgot. I don't use math on a day-to-day basis.\" Further, a sample of written comments from family members in the student/family-prompt group indicated some frustration with the mathematics concepts. For example, a mother wrote, \"I don't think my son understands the concept of measures of central tendency, and he would not let me explain.\" A father commented, \"I became frustrated at times because my child was looking for quick, easy answers instead of thinking through the problem.\""}, {"section_title": "Benefits of Involvement", "text": "Higher levels of family involvement were not associated with higher student achievement in this study; however, the telephone interviews suggested that some families experienced other benefits from being involved with homework, including companionship and an increased awareness of what their children were learning in mathematics. For example, one parent commented, \"I was more involved. Usually I have no idea what she is doing.\" A mother reported, \"We sat down together to do the assignments and I enjoyed it. It helped my son realize I'm not just a person who does dishes and takes out the trash.\" Further, nearly half the total written comments were affective comments such as \"Enjoyed the activity\" and \"Liked the application part.\" A father commented, \"It was fun. I think my daughter can open her own business now.\" A mother wrote, \"My son understands these concepts. I enjoyed working with him.\" Commenting on a specific assignment activity, another mother wrote, \"I loved the stock market questions.\" Many wrote comments directed to the teacher. For example, a father wrote, \"This is a good idea. Keep it up,\" and a mother wrote, \"Hi [teacher] . You got me on this one. I don't understand it.\" One parent commented on the request for a signature: \"It was great to have the sign-off part; it made us accountable.\""}, {"section_title": "Parent Education Level", "text": "Of the 74 participating students, 34 students were from families where one or both parents held a 4-year college degree and 40 students were from families where neither parent held a college degree. As predicted, across the three groups the students whose parent(s) held a 4-year college degree scored significantly higher on the posttest than did students whose parents did not hold a college degree (see Table 3 ). Interestingly, however, the same table indicates no significant difference in reported family involvement with mathematics homework based on parent education level.\nControlling for group assignment indicated similar results. Specifically, an ANOVA on posttest achievement based on parent education level was statistically significant, F(2,71) = 16.02, p = .00, and an ANOVA on family involvement based on parent education level was nonsignificant, F(2,66) = .32, p = .56.\nInterviews with nondegreed parents illustrated their involvement. One nondegreed mother suggested, \"I've been out of high school for 25 years. I try to help, but math has changed since I was in school.\" A 62-year-old father revealed, \"I never went to high school and I am basically illiterate. I took some adult education math courses so I could help my kids, but it is difficult. Kids have much more to learn now than when I went to school.\" When asked if they thought school-sponsored workshops would be helpful, 13 of the 24 interviewees reported that workshops or a homework hotline would be beneficial. A mother indicated, \"At some point the kids will be beyond us.\" Others pointed out that it would be hard to attend a workshop unless it were offered at convenient times and child care were available, linking back to the time issue identified earlier."}, {"section_title": "DISCUSSION", "text": ""}, {"section_title": "Family Involvement With Homework", "text": "We attempted to offer direct evidence of family involvement with homework by comparing students who were enrolled in the same school, who were taught by the same teacher, and who completed the same assignments. We found that student and family prompts were associated with higher levels of family involvement with middle-grades homework, an occurrence contrary to well-documented declines in family involvement when children make the transition from the elementary to the middle grades (Epstein & Connors, 1995; Greenwood & Hickman, 1991; National Education Goals Panel, 1995; Steinberg, 1988) .\nThe Goals 2000: Educate America Act suggested that all schools implement family involvement partnerships by the year 2000 (National Education Goals Panel, 1995) . Traditionally, such partnerships begin with teachers inviting families to participate in school-related activities (Bowman, 1994) . Consistent with Hoover-Dempsy and Sandler (1995) , in the present study we point out that coaching students to invite family involvement is another way to facilitate partnerships between families and the education community. Students can take a more active role in creating an area of overlapping influence (Epstein, 1992) , and our survey results confirm that families are more likely to be involved when their child encourages involvement in combination with teacher invitations.\nAlthough family perceptions indicated similar levels of involvement for the two prompted groups, studentreported family involvement indicated higher levels of involvement when student prompts were coupled with family prompts. A possible explanation for this discrepancy could be that the families in the student/familyprompt group were held accountable for their involvement based on the request for written comments and a signature on each assignment. These families may have been hesitant to overstate their involvement on the homework survey, believing that their actual involvement with each of the 20 assignments could be traced to their comments and signatures.\nInterestingly, we found that the families in the two prompted groups reported significantly higher levels of involvement with the mathematics homework than with other homework assignments collectively. Perhaps the prompting caused a change in patterns of family involvement with homework."}, {"section_title": "Family Involvement and Student Achievement", "text": "Our results do not support findings in the literature indicating that higher levels of family involvement are associated with higher levels of student achievement (Astone & McLanahan, 1991; Fehrmann et al., 1987; Keith, 1992; Lareau, 1987; Leone & Richards, 1989; Muller, 1993; Revicki, 1981; Stevenson & Baker, 1987) . However, mean scores on the 20 assignments suggest a pattern in the hypothesized direction (i.e., student/family-prompt, 82%; student-prompt, 79%; no-prompt, 75%). Such patterns should be studied longitudinally, as family involvement is most effective when sustained over time (Gordon, 1979; Salerno & Fink, 1992; Schrick, 1992) . Further, Cooper (1989) found that homework has a greater effect on student achievement at the high school level than at the middle-grades or elementary levels.\nTelephone interviews with involved families suggested that some parents had difficulty with the mathematics concepts. This finding lends support to previous research suggesting that parents who find subject matter difficult to understand may not be able to help with homework in productive ways (Cooper, 1989; Epstein & Connors, 1995; Salerno & Fink, 1992; Schrick, 1992) . When this is the case, increased student achievement based on family involvement cannot necessarily be expected, and a diminished sense of efficacy will further decrease levels of family involvement (Hoover-Dempsey & Sandler, 1995) .\nAccording to Goals 2000, one objective of family involvement is academic growth (National Education Goals Panel, 1995) . Because family involvement with homework was not associated with higher student achievement in this study, other homework interventions should be investigated for potential achievement effects of family involvement. Indeed, an interviewee from the student/family-prompt group, who was involved with 9 of the 20 mathematics assignments, commented, \"Our children do too many worksheets and are not engaged in other more interesting life-like projects.\" It is possible that the mathematics skill sets used in the assignments were not perceived as meaningful (McDermott et al., 1984) . If that is true, then future researchers could examine family involvement with mathematics activities that may be more consistent with contemporary mathematics curricula (e.g., National Council of Teachers of Mathematics, 1989) . At the same time, improved student achievement need not necessarily be the only goal of family involvement efforts. Interviews and written comments from the present study suggest that involvement can support family companionship and increased awareness of what children are learning in school. However, more research is needed to define specific benefits of family involvement if the education community is to continue expending the effort to involve families."}, {"section_title": "Quality of Involvement", "text": "Our research suggests that the quality of family involvement with homework is at least as important as the quantity of involvement. Cooper (1989) and Walberg, Paschal, and Weinstein (1985) synthesized empirical studies on homework and concluded that the \"curriculum of the home\" varies in quality and is decisive in children's learning (see also McDermott et al., 1984) . Although quality of involvement was not examined in this study, interviews and written comments indicated that quality of involvement should be operationalized and explored in future studies. For example, of the 68 comments written by families from the student/family-prompt group, 56 comments (or 80%) were written by the 10 families whose children achieved the highest posttest scores. These 56 responses included comments reflecting sustained and creative family-child interaction with the assigned problems. One mother wrote, \"We found the answer to number two, but couldn't figure out what formula to use. We instead used a clock face to figure it out.\" This is consistent with additional research indicating that intellectual activities in the home are correlated with middle-grades student achievement (Bradley, Caldwell, & Rock, 1988) .\nQuality of involvement may not be a variable only across families but may also be a variable within a particular family. For example, a student from the student/family-prompt group achieved 40% on the posttest (group mean was 68%) and had consistently lower scores on the homework assignments with which her mother helped. However, this same student earned 100% on each of three homework assignments with which her grandmother helped. In the interview, this student's mother characterized her homework interactions with her child as \"Let's just get it done.\" A contrasting attitude was apparent in an interview with the child's grandmother who characterized her interactions with her granddaughter as \"Enjoyable.\" \"We take breaks,\" she said, \"I explain the concepts and watch her do every problem.\" She reported that her granddaughter had recently telephoned her saying, \"I'm coming to visit you Grandma, and I have homework. Will you help me?\" The notion that the attitude of family members who are involved with school-related activities can influence student achievement is consistent with research indicating that students who describe their family as warm and encouraging earn higher grades in school than their peers do (Steinberg, Elmen, & Mounts, 1989) ."}, {"section_title": "Effects of Parent Education Level", "text": "Student achievement in this study was more closely associated with parent education level than it was with family involvement. The results support findings that parent education level is a good predictor of student achievement (Dornbusch, 1986) and lend support to the broader literature suggesting that higher SES is related to higher achievement (Astone & McLanahan, 1991; Fehrmann et al., 1987; Lareau, 1987; Muller, 1993; Revicki, 1981; Stevenson & Baker, 1987) . However, our findings do not support the assertion in the literature that lower SES is associated with lower levels of family involvement (Revicki, 1981) . Consistent with Sui-Chu and Willms (1996) , we found that parents across education levels reported similar levels of family involvement, even though the involvement did not similarly influence student achievement."}, {"section_title": "Future Research", "text": "A question that needs to be addressed by future researchers concerns the relationship between parent education level and quality of involvement. Underscored by interview data and written comments, the results of the present study indicate that parents with less education may need guidance from the school in order for them to assist their children in productive ways Amato, 1994) . It may be advantageous for educators to focus on family guidance related to homework involvement rather than rely exclusively on extending invitations for family involvement in the absence of ensuing support. DIAGRAM: FIGURE 1. Comparison of reported family involvement with mathematics homework and with other homework (5 = always, 1 = never)."}]