[{"section_title": "Abstract", "text": "Die Dokumente auf EconStor dürfen zu eigenen wissenschaftlichen Zwecken und zum Privatgebrauch gespeichert und kopiert werden.\nSie dürfen die Dokumente nicht für öffentliche oder kommerzielle Zwecke vervielfältigen, öffentlich ausstellen, öffentlich zugänglich machen, vertreiben oder anderweitig nutzen.\nSofern die Verfasser die Dokumente unter Open-Content-Lizenzen (insbesondere CC-Lizenzen) zur Verfügung gestellt haben sollten, gelten abweichend von diesen Nutzungsbedingungen die in der dort genannten Lizenz gewährten Nutzungsrechte. www.econstor.eu \nTerms of use:\nDocuments in\nD I S C U S S I O N P A P E R S E R I E S"}, {"section_title": "I. INTRODUCTION", "text": "Understanding the labor market return to college quality is crucial for parents deciding where to send their children to college, for colleges selecting students, and for policymakers deciding whether to invest additional resources in higher quality institutions. However, obtaining unbiased estimates of the return to college quality is difficult due to unobserved characteristics that affect both a student's attendance at a highly selective college and their later earnings. In particular, the same characteristics (such as ambition) that lead students to apply to highly selective colleges may also be rewarded in the labor market. Likewise, the attributes that admissions officers are looking for when selecting students for college may be similar to the attributes that employers are seeking when hiring and promoting workers.\nEarly research attempted to overcome this omitted-variable bias by controlling for observed student characteristics, such as high school grades, standardized test scores, and parental background (see, for example, Monks 2000 and Brewer and Ehrenberg 1996) . More recent research has tried to overcome the bias created by unobserved variables through a variety of techniques. Hoekstra (2008) uses a regression discontinuity design that compares the earnings of students who were just above the admissions cutoff for a state university to those that were just below it. He finds that attending the flagship state university results in 20 percent higher earnings five to ten years after graduation for white men, but he does not find an effect on earnings for white women. Lindahl and Regner (2005) use sibling data to illustrate that the returns to college quality might be overstated if family characteristics are not fully adjusted for, as cross-sectional estimates of the return-to-schooling are twice as large as within-family estimates. Black and Smith (2004) use propensity score methods to estimates to estimate the return to college quality for the 1979 cohort of the National Longitudinal Survey of Youth. The magnitude of the effect of college 3 quality is similar whether they use OLS or propensity score methods, however, when they use propensity score methods, the standard errors are large so the effect of college quality is not statistically significant. Dale and Krueger (2002) hold unobserved student quality constant by controlling for the selectivity of colleges that students apply to and are accepted or rejected by, and find that the return to a variety of college characteristics falls substantially after implementing their selection-correction.\nTo reconcile the findings across methods and data sources, Long (2008) re-estimated the models used by Dale and Krueger (2002) and Black and Smith (2004) ; he also estimated an ordinary least squared (OLS) model that controlled for student attributes, family background and neighborhood characteristics, as well as an instrumental variables model that used the quality of colleges located within a certain radius of the student's home as an instrument for the quality of the college that the student attends. In general, he found that a variety of college characteristics have positive effects on educational attainment, even within specifications that adjust for selection bias; however, there is not consistent evidence for a positive relationship between college characteristics and earnings across the selection adjusted models.\nBecause the percentage of students enrolling in college has increased over time, one might expect that it would be more important for students who entered college recently to distinguish themselves by attending more selective colleges.\n1 However, little research has examined recent cohorts, and those studies that do use recent cohorts tend to model earnings early in the career. Long (2008 and , for example, used the 1992 cohort of the National Education Longitudinal Study (NELS) to examine the earnings of students relatively early in their careers, when they were only 26 years old."}, {"section_title": "4", "text": "This paper replicates and extends earlier work that examined the relationship between the college that students attended in 1976 and the earnings they reported in 1995 in the C&B follow-up survey (Dale and Krueger 2002) in important respects. First, we estimate the return several college characteristics that are commonly used as proxies for college quality (college average SAT score, the Barron's index, and net tuition) for a recent cohort of students-those who entered college in 1989. By linking the C&B data to administrative records from the Social Security Administration (SSA), we are able to follow this cohort for 18 years after the students entered (and 14 years after they likely would have graduated from) college. Second, we estimate the return to college characteristics for the 1976 cohort over a long time horizon, from 1983 to 2007. Because we use administrative earnings records from tax data, our earnings measure is presumably more reliable than much of the prior literature, which is generally based on self-reported earnings. The use of administrative earnings data allows us to follow a recent cohort of students over a longer period of time than is possible in many of the longitudinal databases that are typically used to study the returns to college characteristics. For example, the NELS, High School and Beyond, and the National Longitudinal Study of the High School Class of 1972 only follow students for 6 to 10 years after students would have likely graduated from college; while the National Longitudinal Study of Youth (NLSY) follows students for a long period of time, students from the relatively recent cohort (who were age 12 to 16 in 1997) are now too early in their post-collegiate careers to generate accurate estimates of the return to college characteristics.\nAs in the rest of the literature, we find that the return to each college characteristic is sizeable for both cohorts in cross-sectional least squares regression models that control for variables commonly observed by researchers (such as student characteristics and SAT scores).\nHowever, when we adjust for a proxy for unobserved student characteristics -namely, by controlling for the average SAT score of the colleges that students applied to -our estimates for the return to college characteristics fall substantially and are generally indistinguishable from zero for both the 1976 and 1989 cohort of students. Notable exceptions are for racial and ethnic minorities (black and Hispanic students) and for students whose parents have relatively little education; for these subgroups, our estimates remain large, even in models that adjust for unobserved student characteristics. One possible explanation for this pattern of results is that highly selective colleges provide access to networks for minority students and for students from disadvantaged family backgrounds that are otherwise not available to them."}, {"section_title": "II. METHODS", "text": "The college application process involves a series of choices. First, students choose where to apply to college. Then, colleges decide which students to admit. Finally, students choose which college to attend from among the set of schools to which they were admitted. The difficulty with estimating the labor market return to college quality is that not all of the characteristics that lead students to apply to and attend selective colleges are observed by researchers, and unobserved student characteristics are likely to be positively correlated with both school quality and earnings.\nWe assume the equation relating earnings to the students' attributes is:\nwhere Q is a measure of the selectivity of the college student i attended, X 1 and X 2 are two sets of characteristics that affect earnings, and  i is an idiosyncratic error term that is uncorrelated with the other explanatory variables (1). X 1 includes variables that are observable to researchers, such as grades and SAT scores, while X 2 includes variables that are not observable to researchers, such as 6 student motivation and creativity (that are at least partly revealed to admissions officers through detailed transcript information, essays, interviews, and recommendations). Both X 1 and X 2 affect the set of colleges that students apply to, whether they are admitted, and possibly which school they attend. The parameter  1 represents the monetary payoff to attending a more selective college.\nIn the early literature on the returns to school quality, researchers estimated a wage equation that omitted X 2 :\nQ i is typically measured by the average SAT score of the school where the student attended college.\nEven if students randomly select the college they attend from the set of colleges that admitted them, estimation of (2) will yield biased and inconsistent parameter estimates of  1 and  2 . If students choose their school randomly from their set of options, the payoff to attending a selective school will be biased upward because students with higher values of the omitted variable, X 2 , are more likely to be admitted to and therefore attend highly selective schools. Since the labor market rewards X 2 , and Q and X 2 are positively correlated, the coefficient on school quality will be biased upward.\nTo address the selection problem, we use one of the selection-adjusted models-referred to as the -self-revelation model‖--in Dale and Krueger (2002) . This model assumes that students signal their potential ability, motivation and ambition by the choice of schools they apply to. In fact, students may have a better sense of their potential ability than college admissions committees. If students with greater unobserved earnings potential are more likely to apply to more selective colleges, the error term in equation (2) could be modeled as a function of the average SAT score (denoted AVG) of the schools to which the student applied: u i = t 0 + t 1 AVG i + v i . If v i is uncorrelated with the SAT score of the school the student attended, one can solve the selection problem by including AVG in the wage equation. This approach is called the \"self-revelation\" model because individuals reveal their unobserved ability by their college application behavior. This model also includes dummy variables indicating the number of schools the students applied to (in addition to the average SAT score of the schools), because the number of applications a student submits may also reveal unobserved student traits, such as their ambition and persistence. Dale and Krueger (2002) also estimated a matched applicant model that included an unrestricted set of dummy variables indicating groups of students who received the same admissions decisions (i.e., the same combination of acceptances and rejections) from the same set of colleges.\nThe self-revelation model is a special case of the matched applicant model. The matched applicant model and self-revelation model yielded coefficients that were similar in size, but the self-revelation model yielded smaller standard errors. Because of the smaller sample size in the present analysis, we therefore focus on the self-revelation model.\nAs discussed in more detail Dale and Krueger (2002) , a critical assumption of the self-revelation model is that students' enrollment decisions are uncorrelated with the error term of equation (2) sample of other students. Our regressions are weighted by the inverse of the probability that a student was included in the sample.\nEarly in the C&B questionnaire respondents were asked, \"In rough order of preference, please list the other schools you seriously considered.\" 6 Respondents were then asked whether they applied to, and were accepted by, each of the schools they listed. Because our analysis relies on individuals' responses to these survey questions, the sample for our primary analysis is restricted to survey 3 At the time that Dale and Krueger (2002) The C&B Survey data are linked data drawn from individuals' applications to college (such as their SAT scores) as well as data drawn from their transcripts (such as grades in college).\nThe C&B data were also merged to the Higher Education Research Institute's (HERI) Freshman Survey."}, {"section_title": "B. Regression Control Variables", "text": "Our basic regression model controls for race, sex, high school grade point average, student SAT score, predicted parental income and whether the student was a college athlete; our self-revelation model includes these same variables, and also includes the average SAT score of the schools to which a student applied and the number of applications they submitted. Race, gender, parental education and occupation (used to predict parental income), information on the schools the student applied to, whether the student was an athlete, and student SAT score were drawn from the C&B data. To construct other variables about students' performance in high school and their parents' income, we used data from the HERI freshman survey. Because parental income was missing for many individuals in the sample, but information for other family background information (such as parental education) was generally available, we predicted parental income by first regressing log parental income on mother's and father's education and occupation for the subset of students with available family income data, and then multiplied the coefficients from this regression by the values of the explanatory variables for every student in the sample. When regression control variables for SAT score or high school GPA were missing, we set the variable equal to the mean value for the sample, and also included a dummy variable indicating the data were missing."}, {"section_title": "C. College Characteristics", "text": "Each college's average SAT score and Barron's index of college selectivity (as reported in the 1978 and 1992 Barron's guides) was linked to student's responses to the questions concerning the schools they applied to. "}, {"section_title": "D. Earnings Measures", "text": "The Social Security Administration linked College and Beyond data to SSA's Detailed\nEarnings Records for the period of 1981 through 2007. The earnings measure for this analysis included the total earnings an individual reported to the Internal Revenue Service, including earnings from self-employment and earnings that were deferred to retirement plans."}, {"section_title": "9", "text": "SSA ran computer programs written by MPR on our behalf so that individual-level earnings data were never viewed by researchers outside SSA. SSA was able to match over 95 percent of the student records we provided. We converted annual earnings for each year to 2007 dollars using the 12 Consumer Price Index (CPI-U). The SSA earnings measure used in our primary analysis is not topcoded; however, to compare to the C&B survey, for one analysis, we deliberately topcode the SSA data to be consistent with the C&B data, as described in more detail below.\nIn addition to creating outcome measures that captured annual earnings, we also created outcome measures that were the median of an individual's log annual earnings in 2007 dollars over five year intervals (1983 through 1987, 1998 through 1992, 1993 through 1997, 1998 through 2002, and 2003 through 2007) . For example, the dependent variable for the period of 1993 to 1997 was the median (for each individual) of his or her log earnings in the five years from 1993 to 1997.\nBy using medians over five-year intervals, we reduce noise in the earnings measure that would result from brief periods of time that the students may have spent out of the labor market or in non-covered employment.\nFinally, the focus of this study is on the productivity of individuals who are employed (and not on whether individuals choose to or are able to work). Because we cannot identify full-time workers or hourly wages in the SSA administrative data, we generally restrict the sample to those earning over $13,822 (in 2007 dollars) during the year, the equivalent of earning the minimum wage for 2,000 hours at the 1982 federal minimum wage value (in 2007 dollars). For those regressions in which the dependent variable is median earnings over a five year interval, individuals were included in the sample if they had earnings that were less than $13,822 in a particular year as long as their median earnings over the five year interval exceeded $13,822.)\nEstimates based on a sample that use this restriction are more precise than those based on a sample of all non-zero earners. 10 Also, as shown in Table 3 , estimates based on the sample defined by this 10 Approximately 10 percent of workers in our sample (that is, those with any earnings) in the 1976 cohort and 8 percent those in the 1989 cohort had earnings that were between zero and this minimum wage threshold ($13,822)."}, {"section_title": "13", "text": "restriction are closer to estimates drawn from the sample of full-time workers (according to the C&B survey) than estimates drawn from a sample of all non-zero earners."}, {"section_title": "IV. DESCRIPTIVE STATISTICS FOR SCHOOLS AND STUDENTS", "text": ""}, {"section_title": "A. Characteristics of Colleges and Students in Sample", "text": "While the average SAT score for colleges in the C&B dataset ranged from approximately 800 to over 1300, most of the C&B schools were highly selective. The majority of C&B colleges fell into one of the top two Barron's categories (Most Competitive or Highly Competitive; see Appendix Table 1 ), and had an average SAT score of greater than 1175. The high selectivity of the colleges within the C&B database make it particularly well-suited for this analysis, because the majority of students that attend selective colleges submit multiple applications, which is necessary for our identification strategy. In contrast, many students who attend less selective colleges submit only one application, because many less selective colleges accept all students who apply. For example, according to data from the National Longitudinal Study of the High School Class of 1972, only 46 percent of students who attended college applied to more than one school.\nThe regression sample includes students who entered (but did not necessarily graduate from) one of the C&B schools. The student and school characteristics among those included in the regression sample are shown in Table 1 . Because the schools included in the database were highly selective, the students were in the sample had high academic qualifications. The students in the 1976 cohort had an average SAT scores of 1160, and an average high school grade point average of 3.6. (Note that for ease of interpretation, in our tables and regression analysis, we divide our measures of school SAT score and student SAT score by 100). Similarly, for the 1989 cohort, the average student SAT score was over 1200, and the average GPA was 3.6. The percentage of students that were racial and ethnic minorities was higher for the 1989 cohort than for the 1976 cohort. Of the 1976 cohort, 6 percent of students were black and 1 percent were Hispanic, whereas 8 percent in the 1989 cohort were black and 3 percent were Hispanic. Finally for the 1989 cohort. Table 2 provides descriptive statistics about the application behavior of the students who entered one of the C&B schools in our study in 1976 or 1989. Nearly two-thirds of the 1976 cohort and 71 percent of the 1989 cohort submitted at least one additional application (in addition to the school they attended). For both cohorts, of those students submitting at least one additional application, over half applied to a school with a higher average SAT score than that of the college they attended, and nearly 90 percent of students were accepted to at least one additional school. Of those accepted to more than one school, about 35 percent were accepted to a more selective school than the one they ended up attending. The data for black and Hispanic students (shown in columns 2 and 4) are similar, though blacks and Hispanics were somewhat more likely than students in the full sample to be accepted to at least one additional school, and to be accepted to a more selective school than the one they attended."}, {"section_title": "B. Application and Matriculation Patterns", "text": "While we could not explore whether students' unobserved ability is related to the school they attend, we were able to examine how students' observed characteristics are related to their choice of school, among those who were admitted to similar schools. Appendix Table 2 shows the relationship between student characteristics and the average SAT score of a school they choose to 15 attend (conditional on the average SAT score of the most selective school to which they were accepted). For 1976, the coefficient on student SAT score is positive and statistically significant (for both the full sample and the black and Hispanic subgroup). While the relationship between high school GPA and the selectivity of the college attended is close to zero for the full sample, it is positive for black and Hispanic students. These results suggest that students in the 1976 cohort with better academic credentials tended to matriculate to more selective schools, controlling for the average SAT score of the most selective school they were accepted at.\nFor the 1989 cohort, there was not a consistent pattern between student characteristics and students' choice of schools. While the relationship between SAT score and school selectivity was positive and statistically significant (within both the full sample and the black and Hispanic subgroup), the relationship between high school GPA and the selectivity of the college attended was negative and statistically significant.\nTaken as a whole, these results do not suggest that students with greater potential chose to attend less selective schools; in fact, if anything, results from the 1976 cohort suggest that students with greater potential attend more selective schools. If, among students who were admitted to similar schools, more ambitious students choose to attend more selective schools, then even our selection-adjusted estimates of the effect of college selectivity will be biased upwards."}, {"section_title": "V. RESULTS", "text": ""}, {"section_title": "A. Comparison of Earnings Using C&B Survey and SSA Administrative Data", "text": "We begin by comparing earnings drawn from the C&B survey to those drawn from SSA administrative data. to estimates of the reliability of self-reported earnings data in Angrist and Krueger (1999) .\nTo compare results from this analysis to the results reported in Dale and Krueger (2002) ,\nwe first estimated a regression where the log of C&B earnings is the outcome measure, but restricted the sample to students in the merged C&B and SSA sample (that is, they matriculated at one of the C&B schools participating in this study, reported that they were working full-time during all of 1995 on the C&B survey, and matched to the SSA data). The coefficient on school SAT score/100 in the basic model using this sample restriction is .068 (.014) (see Table 3 , column 3), indicating that attending a school with a 100-point higher SAT score is associated with approximately 7 percent higher earnings later in a student's career. This estimate is similar (though slightly less than) the .076 (.016) estimate for the C&B sample reported in Dale and Krueger (2002) (shown here in column 1). 12 In both samples, the return becomes indistinguishable from zero in the self-revelation model (shown in columns 2 and 4).\nNext, we use earnings drawn from the SSA data. In column 5, we use the same sample of full-time workers, but use SSA earnings that were topcoded in the same way that earnings in the C&B survey were topcoded. In column 7, we use SSA earnings and use the same sample of full-time workers, but do not topcode the data. In column 9, we use the median of [log(1993 earnings) through log (1997 earnings)] (in 2007 dollars) as our outcome measure, and restrict the sample to those with non-zero earnings. In column 11, we restrict the sample to those with annual earnings that were greater than a minimum wage threshold (defined as $13,822 in 2007 dollars). In each model, the estimates for the coefficient on school SAT score drawn from our basic model range from .048 to .061, and are similar to (but somewhat less than) the estimate using earnings from the C&B survey as the outcome measure.\nColumns 6, 8, 10, and 12 show results from the self-revelation model for each of these samples. The return to school SAT score in each of these selection-adjusted models is negative and indistinguishable from zero.\nIn summary, for the 1976 cohort, across a variety of sample restrictions and across both sources of earnings data (C&B survey data and SSA administrative data), the return to school SAT score has a large and positive effect on earnings when we do not adjust for unobserved student characteristics. However, when we adjust for unobserved student characteristics in the self-revelation model, the return falls substantially, becoming indistinguishable from zero."}, {"section_title": "B. Alternative Selection Controls", "text": "We also re-estimated the series of models from Dale and Krueger (2002) that use a variety of selection controls in place of the average SAT score that the student applied to. For example, in one model, we controlled for the highest SAT score of the schools a student was accepted by but did not attend. In another model, we controlled for the average SAT score of the colleges that rejected the student. Consistent with Dale and Krueger (2002) , in each of these models, the return to the school SAT score of the school that the student actually attended was less than return to the colleges they did not attend. For example, for the 1976 cohort, the coefficient on average school 18 SAT score among the schools a student was rejected by was .079 (.022), and from this same model the coefficient on the average SAT score for the school the student attended was .035 (.028). A full set of these results is available upon request.\nThe finding that the average SAT score of schools that rejected a student is more than twice as strong a predictor of the student's subsequent earnings as the average SAT score of the school the student attended provides powerful evidence that conventional estimates of the payoff to attending highly selective colleges is biased upward."}, {"section_title": "C. Estimated Effect of College Characteristics over the Lifecycle for the 1976 Cohort", "text": "To assess the return to school characteristics over the course of student's career for the 1976 cohort, we estimate regressions where the outcome measure was the median of log(annual earnings) for each individual (in 2007 dollars) over a five year interval (1983 through 1987, 1998 through 1992, 1993 through 1997, 1998 through 2002, and 2003 through 2007) . Results are shown in Table 4 .\nIn our basic model with a standard set of regression controls, the return to college SAT score increases over the course of a student's career, from indistinguishable from zero for the earliest period (1983 to 1987, about 3 to 7 years after students likely would have graduated), to over seven percent in for the period of 2003 to 2007 (23 to 27 years after college graduation).\nHowever, in our self-revelation models, the estimates are not significantly different from zero for any time period. (To save space, we only report parameter estimates for school characteristics in these tables. In Appendix Table 3 , we report a full set of parameter estimates for selected models).\nWe also estimated regressions separately by gender. In the basic model, the return to college SAT score for men was about 5 percent in 1988 to 1992, and increased over time, reaching a high of nearly 9 percent for the period of 1998 through 2002. For women, the return was consistently lower than the return for men, ranging from 3 percent (in 1988 to 1992) to nearly 6 percent (in 2003 to 2007) . The lower return for women does not appear to be due solely to the fact that we cannot identify which women were working full time in SSA's administrative data, as the return for women (5 percent) was smaller than the return for men (7 percent) in the C&B survey when we limited the sample to those who reported working full-time. For both men and women, the coefficient was zero (and sometimes even negative) the self-revelation model. 13 To increase sample size and improve the precision of our estimates, we focus on results based on the pooled sample of men and women together throughout the rest of the paper.\nWe estimated these same regressions for two other college characteristics, the Barron's Index and the log of net tuition. The results are summarized in Table 5 . In our basic model, the estimated impact of these school characteristics increased over the course of the career, with the coefficient on log tuition reaching a high of 0.14 and the Barron's Index reaching 0.08 at in the last five year interval (last set of rows, Table 5 ). However, in the self-revelation model the estimates fall substantially and are statistically insignificant at the 0.10 level.\nThese results are partly a contrast to Dale and Krueger (2002) , in that the earlier analysis of self-reported earnings data showed a statistically significant relationship between earnings and the log of net tuition in the self-revelation model, as the coefficient on net tuition was of .058 (.018).\nTo attempt to reconcile these results with Dale and Krueger (2002) , we re-estimated the effect of net tuition on self-reported earnings for full-time workers from the C&B survey in 1995 using the subset of students from the schools participating this study, and found that the coefficient (adjusted 20 for clustering) on log (net tuition) from the self-revelation model was somewhat smaller: .041\n(.038), and not statistically significant. When we estimated the same regression for the same sample, but used SSA's administrative earnings data in 1995 (instead of self-reported earnings data from the C&B survey), the coefficient (and standard error) on net tuition was even smaller:\n.033 (.046). Moreover, over the full study period (1983 to 2007) the coefficient on net tuition was generally between 0 and .02 (and never greater than .033) in the self-revelation model based on earnings drawn from SSA administrative data as the outcome measure. Thus, the effect of net tuition based on the single year of self-reported earnings reported in Dale and Krueger (2002) appears to been atypically high relative to the series of estimates we were able to generate using SSA's administrative data, though the large standard errors make it difficult to draw inferences."}, {"section_title": "C. Estimated Effects of College Characteristics for the 1989 Cohort", "text": "Unlike the 1976 cohort where we have data for most of the student's career, we only have a limited number of post-college years for the 1989 cohort. As shown for the 1976 cohort, there is no return to college characteristics in the early part of a student's career, possibly because many graduates from highly selective colleges attend graduate school, and thus forego work experience early in their careers. Therefore, for the 1989 cohort, we focus on the most recent year with earnings data available, 2007, when the students, were, on average, 35 years old. Although the 1989 cohort is too young to assess changes in the return to school selectivity over the student's career, it does allow us to assess whether estimates for the return to school selectivity are similar across cohorts at one point in the lifecycle.\nIn 2007, the coefficient for school SAT score/100 was .056 with a standard error of .014\n(or .031 if we adjust for clustering among students who attended the same schools) in the basic model (Table 6 ). Consistent with the results for the 1976 cohort, the coefficient was indistinguishable from zero (-.008 with a standard error of .019) in the self-revelation model.\nWhen we estimated these models by gender, the results are also similar to those of the 1976 cohort:\nthe coefficient for women (.032) was lower than the coefficient for men (.067) in the basic model, and in the self-revelation model, estimates for both men and women are indistinguishable from zero (not shown).\nThe results for the Barron's index were consistent with the results for school SAT score.\nSpecifically, the return to the Barron's index was nearly 7 percent in the basic model, but was close to zero in the self-revelation model. For net tuition, our estimates from both models were negative and had large standard errors."}, {"section_title": "D. Estimated Effect of College Characteristics for Racial and Ethnic Minorities", "text": "Because some past studies have found that the return to college selectivity varies by race (Behrman et al. 1996 , Long 2009 , and Loury and Garman 1995), we also examined results separately for racial and ethnic minorities. To increase the sample size, we pooled blacks and Hispanics together, both of which often receive preferential treatment in the college admissions process (Bowen and Bok, 1998) . For the 1976 cohort, the return to each proxy for school quality increased over the course of the students' career, and the magnitude of the coefficients did not fall substantially in the self-revelation model. The coefficient was most pronounced for the Barron's index, where going to a school in a higher Barron's category translated to 6.7 percent higher earnings (for the period of 2003 to 2007) in the basic model and 6.2 percent higher earnings in the self-revelation model (not shown). However, the standard errors were large, so the estimate for the Barron's index in the self-revelation model was not statistically significant at the .10 level.\n14 Estimates for the 1989 cohort are shown in Table 7 . Parameter estimates for each proxy for school quality are large in the basic model, ranging from 6.3 for the Barron's Index to 17.3 percent for the log of net tuition (Table 7 ). In the self-revelation model, these estimates remained large, ranging from 4.9 for the Barrons Index to 13.8 for the log of net tuition. While the standard errors are also large, some of the estimates are significantly greater than zero. For example, the coefficient on school SAT score/100 was .076 with a standard error of .032 (or .042 after accounting for clustering of students within schools).\nBecause the historically black colleges and universities in this sample had lower average SAT scores (and lower Barron's indices and net tuition) than the rest of the institutions in the C&B database, we investigated whether the reason that there was a return to school selectivity for minority students (but not for all students) was due to the greater range in school selectivity observed for minority students. 15 Specifically, we re-estimated the regressions but excluded the HBCUs from the sample. For the 1976 cohort, the return to the Barron's Index fell from 6.2 percent to 1.6 percent (and indistinguishable from zero) when we imposed this sample restriction.\nHowever, for the 1989 cohort, the estimates for minority students remained large when we excluded the HBCUs, implying returns of 12 percent for attending a school with 100 point higher SAT score and 14 percent for attending a school in a higher Barron's category, even in the self-revelation model."}, {"section_title": "E. Estimated Effect of School Average SAT Score by Parental Education", "text": ""}, {"section_title": "23", "text": "Finally, we explored whether the effect of college selectivity varied by average years of parental education. 16 The interaction term for school-average SAT and years of parental education was negative for both cohorts, implying a higher payoff to attending a more selective school for students from more disadvantaged family backgrounds (Table 8) Krueger (2002), we also found a negative interaction between predicted parental income and school average SAT score, though for most years, the interaction term was not statistically significant."}, {"section_title": "VI. CONCLUSION", "text": "Consistent with the past literature, we find a positive and significant effect of the return to college selectivity during a student's prime working years in regression models that do not adjust for unobserved student quality for cohorts that entered college in 1976 and 1989 using administrative earnings data from the SSA's Detailed Earnings Records. Based on these same regression specifications, we also find that the return to selectivity increases over the course of a student's career. However, after we adjust for unobserved student characteristics, the return to college selectivity falls dramatically. For the 1976 cohort, the return to school-SAT score for the 16 Average years of parental education was equal to the average of the mother's and father's education; if data were missing for one parent, the average was set equal to the years of education for the parent for whom data were available. The 13 students in the 1989 cohort and 22 students in the 1976 cohort that were missing education data for both parents were excluded from these regressions."}, {"section_title": "24", "text": "full sample is always indistinguishable from zero when we control for the average SAT score of the colleges that students applied to in order to control for omitted student variables. Similarly, the returns to other college characteristics (the Barron's Index and net tuition) are substantial in the basic model that controls for commonly observed student characteristics but small and never statistically distinguishable from zero in the self-revelation model, which (partially) controls for unobserved student variables.\nThere were noteworthy exceptions for subgroups. s. First, for the 1989 cohort, the estimates indicate a positive return to attending a more selective school for black and Hispanic students, which is robust in the selection-adjusted model. Second, our results suggest that students from disadvantaged family backgrounds (in terms of educational attainment) experience a higher return to attending a selective college than those from more advantaged family backgrounds. For example, for the 1989 cohort, our estimates from the selection-adjusted model imply a positive return to attending a more selective college for students who had parents with an average of less than 16 years of schooling; however, the return to attending a more selective college was zero (or even negative) for students whose parents averaged 16 or more years of education. One possible explanation for this pattern is that while most students who apply to selective colleges may be able to rely on their families and friends to provide job-networking opportunities, networking opportunities that become available from attending a selective college may be particularly valuable for black and Hispanic students, and for students from less educated families.\nContrary to expectations, our estimates do not suggest that the return to college selectivity (within the set of C&B schools) increased for students who entered college more recently, as estimates for the 1976 and 1989 cohort are similar when we compare the returns for each cohort at a similar stage relative to college-entry (approximately 18 to 19 years after the students entered college). Specifically, for the 1976 and 1989 cohorts, attending a college with a 100-point higher SAT score lead to students receive about 6 percent higher earnings (in 1995 and 2007 respectively) according to results from the basic model; for both cohorts, this return was close to zero in our selection-adjusted model.\nSeveral caveats should be borne in mind in interpreting our findings. First, the analysis does not pertain to a nationally representative sample of schools, as the sample is derived from the 27 colleges and universities in the C&B dataset, the majority of which are very selective.\nHowever, estimates of the return to school selectivity based on the C&B dataset were similar to --indeed, slightly higher than --those based on a nationally representative dataset, the National\nLongitudinal Study (NLS) of the High School Class of 1972 (see Dale and Krueger, 2002) . In addition, Dale and Krueger (2002) found an insignificant payoff to attending more selective schools when they used the NLS to estimate the self-revelation model.\nSecond, the estimates from the selection-adjusted models are imprecise, especially for the 1989 cohort. Thus, even though the point-estimates for the return to school quality are close to zero, the upper-bound of the 95 percent confidence intervals for these estimates are sometimes sizeable. Nonetheless, our results do imply that estimates that do not adjust for unobserved student characteristics are biased upward. Indeed, the finding that the average SAT score of the highest ranked school that rejected a student is a much stronger predictor of that student's subsequent earnings than the average SAT score of the school the student actually attended should give pause to those who interpret conventional regression-based estimates of the effect of college characteristics as causal effects of the colleges themselves."}, {"section_title": "26", "text": "Finally, it is possible that our estimates are affected by students sorting into the colleges they attended from their set of options based on their unobserved earnings potential. About 35 percent of the students in each cohort in our sample did not attend the most selective school to which they were admitted. 17 Our analysis indicates that students who were more likely to attend the most selective school to which they were admitted had observable characteristics that are associated with higher earnings potential. If unobserved characteristics bear a similar relationship to college choice, then our already-small estimates of the payoff from attending a selective college would be biased upward. It is also possible that the benefit in terms of future earnings from attending a selective varies across students, and that students sort into college based on their perceived benefit. For example, students who expect a lucrative career because they intend to earn an M.B.A. after college may sort into less selective undergraduate colleges. If students sort on the basis of their idiosyncratic return from attending a selective college, then equation (1) cannot be given a causal interpretation. However, if this is the case, then our results suggest that the typical student does not unambiguously benefit from attending the most selective college to which he or she was admitted. Rather, our results would suggest that students need to think carefully about the fit between their abilities and interests, the attributes of the school they attend, and their career aspirations. Notes: Means are weighted to make the sample representative of all students in the C&B institutions. Means for the regression control variables for the 1976 cohort reflect the sample used in the 1993 -1997 earnings regression (reported in Table 3 ). Means for the 1989 cohort reflect the sample used in the 2007 earnings regression (as reported in Table 6 ). Earnings means exclude those with annual earnings below the minimum wage threshold (equivalent to $13,844 in 2007 dollars). Among those submitting at least one additional application:\nAmong those accepted to at least one additional school :\nSample Size (Unweighted)\nNotes: Sample includes all survey respondents from C&B schools participating in this study. Means are weighted to make the sample representative of all students attending the C&B schools participating in this study."}, {"section_title": "Cohort 1989 Cohort", "text": "Source: College and Beyond Survey Notes: Estimates are drawn from weighted least squares regressions that control for age, race, student SAT score, a dummy for whether student SAT score was missing, high school grade point average, a dummy for whether high school grade point average is missing, predicted parental income and student athlete. Weights were used to make the sample representative of the population of students at the C&B schools. Each cell corresponds to a different regression. Standard errors are in brackets and are robust to correlated errors among students who attended the same institutions. Minimum wage threshold is equal to $13,822 in 2007 dollars. The top earnings category for the C&B data (greater than $200,000) was assigned a value of $242,662 (see text for details). For comparison puroses, we topcoded the SSA data in the same way as the C&B data were topcoded in columns 5 and 6. Notes: Parameter estimates drawn from a weighted least squares regression. Each cell represents a separate regression. Both the basic and self-revelation models control for race, gender, predicted parental income, student's SAT score, a dummy indicating if student SAT score was missing, student's high school grade point average, a dummy indicating if high school grade point average was missing, and whether the student was a college athlete; the self-revelation model also controls for the average SAT score of the schools to which the student applied and dummies for the number of applications the student submitted. Notes: Parameter estimates drawn from a weighted least squares regression. Each cell represents a different regression. Both the basic and self-revelation models control for race, sex, predicted parental income, student's SAT score, a dummy indicating if student SAT score was missing, student's high school grade point average, a dummy indicating if high school grade point average was missing, and whether the student was a college athlete; the self-revelation model also controls for the average SAT score of the schools to which the student applied and dummies for the number of applications the student submitted. Weigths were used to make the sample representative of students at C&B schools. Two sets of standard errors are reported, one in parentheses and in brackets. Standard errors in brackets are robust to correlated errors among students who attended the same institution. The Barron's measure is coded as a continuous measure. Within our sample, this measure ranged from 2 to 5, where \"2\" represented \"Competitive Colleges\" and \"5\" represeneted \"Most Competitive Colleges.\" Individuals are excluded if the median of annual earnings over the five year interval was less than $13,822 in 2007 dollars. Notes: Parameter estimates drawn from a weighted least squares regression. Each cell represents a different regression. Both the basic and self-revelation models control for race, sex, predicted parental income, student's SAT score, a dummy indicating if student SAT score was missing, student's high school grade point average, a dummy indicating if high school grade point average was missing, and whether the student was a college athlete; the self-revelation model also controls for the average SAT score of the schools to which the student applied and dummies for the number of applications the student submitted. Weigths were used to make the sample representative of students at C&B schools. Two sets of standard errors are reported, one in parentheses and in brackets. Standard errors in brackets are robust to correlated errors among students who attended the same institution. The Barron's measure is coded as a continuous measure. Within our sample, this measure ranged from 2 to 5, where \"2\" represented \"Competitive Colleges\" and \"5\" represeneted \"Most Competitive Colleges.\" Individuals were excluded if their annual earnings was less than $13,822 in 2007 dollars. Notes: Parameter estimates drawn from weighted least squares regression models. Weights were used to make the sample representative of the population of students at C&B schools. Both the basic and self-revelation models control for race, sex, predicted parental income, student SAT score, a dummy variable indicating if student SAT score was missing, student high school grade point average, a dummy variable indicating if high school grade point average was missing, and whether the student was a college athlete; the self-revelation model also controls for the average SAT score of the schools to which the student applied and dummies for the number of applications the student submitted. Two sets of standard errors are reported, one in parentheses and in brackets. Standard errors in brackets are robust to correlated errors among students who attended the same institution. The Barron's measure is coded as a continuous measure. Within our sample, this measure ranged from 2 to 5, where \"2\" represented \"Competitive Colleges\" and \"5\" represeneted \"Most Competitive Colleges.\" Individuals are excluded if they earned less than $13,822 in 2007.\nSchool SAT Score/100 Log(Net Tuition) Barron's Index "}, {"section_title": "Model", "text": "Notes: Parameter estimates drawn from a weighted least squares regression. In addition to the variables listed in the first column of the table, both the basic and self-revelation models control for race, gender, student's SAT score, a dummy indicating if student SAT score was missing, student's high school grade point average, a dummy indicating if high school grade point average was missing, and whether the student was a college athlete; the self-revelation model also controls for the average SAT score of the schools to which the student applied and dummies for the number of applications the student submitted. Two sets of standard errors are reported, one in parentheses and one in brackets. Standard errors in brackets are robust to correlated errors among students who attended the same institution. The dependent variable for the 1989 cohort is the log(2007 earnings), and for the 1976 cohort is the median [log (1993 annual earnings) through log (1997 annual earnings)]. Individuals are excluded if their annual earnings for the 1989 cohort (or median annual earnings for the 1976 cohort) was less than $13,822 in 2007 dollars. Years of parental education is the average of the mother's and father's education; if data was missing for one parent, the average was set equal to the years of education of the parent with data. Individuals with no parental education data for either parent are excluded from the regression. The average (and standard deviation) of years of parental education was 15.23 (2.70) for the 1976 cohort and 16.18 (3.24) for the 1989 cohort.\nAppendix Notes: Parameter estimates drawn from weighted least squares regression models where the dependent variable is the average SAT score of the college attended. Regressions only include students who were accepted to more than one college. Standard errors are in parentheses. Weights were used to make the sample representative of the population of students at C&B schools.\nAppendix Weights were used to make the sample representative of the population of students at C&B schools.\nSource: College and Beyond Survey and Detailed Earnings Records from the Social Security Administration."}]