[{"section_title": "Abstract", "text": "Abstract: Effective conservation of short-distance migrants requires an understanding of intraspecific variation in migratory patterns across small spatial scales. Until the advent of ultra-light geolocation devices, our knowledge of the migratory connectivity of songbirds was limited. For the Hermit Thrush (Catharus guttatus), subspecies delineations and connectivity patterns have been unclear in the portion of their breeding range in western North America from southeastern Alaska to northwestern Washington, where individuals wintering in the San Francisco Bay Area of California purportedly breed. To determine breeding locations and migratory timing of the Bay Area's wintering Hermit Thrushes, we deployed geolocators at sites to the north and south of the San Francisco Bay. We compared results from these two regions to one another and to connectivity patterns suggested by subspecies definitions. We collected morphometrics to identify regional differences. Hermit Thrushes that wintered in the North Bay had a wider and more southerly breeding distribution from the British Columbia coast to northwestern Washington, whereas South Bay thrushes migrated to southeastern Alaska and the British Columbia coast. In general, North Bay thrushes departed wintering grounds and arrived on breeding grounds earlier than South Bay thrushes, but we cannot eliminate sex as a factor in these differences. Regional morphology differed only in bill length. Intraspecific isolation in glacial refugia during the Late Pleistocene may explain these fine-scale geographic variations in migration patterns and morphology."}, {"section_title": "Introduction", "text": "Migratory connectivity describes the geographic association between breeding and wintering populations of a migratory species [1, 2] . Identifying the connectivity patterns of migratory species is an essential step toward understanding their ecological requirements throughout the full annual cycle [3, 4] , exploring evolutionary history [5, 6, 7] , and informing conservation efforts [8] . Intraspecific patterns of migratory connectivity, however, can be complex. For example, divergent migratory patterns can occur between sympatric populations of conspecifics [9] and can evolve rapidly [10] . Determining intraspecific differences in connectivity patterns, especially at a fine geographic scale, may be necessary in order to identify populations that are vulnerable to environmental perturbations [11] . The Hermit Thrush (Catharus guttatus; Fig. 1 ), a North American temperate migrant, offers an unparalleled opportunity to examine this type of smallscale variation in migratory connectivity.\nIn the San Francisco Bay Area (hereafter Bay Area) of northwestern California, U.S.A., four or more subspecies of Hermit Thrush may winter sympatrically [12, 13] , therefore conspecifics in this region may exhibit diverse connectivity patterns. Hermit Thrushes breed in southern Alaska, much of Canada south of Nunavut and the Northwest Territories, and western and northeastern continental United States, and they winter throughout the southern and western United States, Mexico, and localized areas of Central America [14] . Subspecies definitions, based primarily on plumage coloration and morphometrics [13] , imply that individuals wintering in the Bay Area may breed anywhere from coastal Alaska to northwestern Washington: Catharus guttatus verecundas breeds on Haida Gwaii (Queen Charlotte Islands) off Existing knowledge of Hermit Thrush migratory connectivity is largely based on morphological similarities of specimens collected at disparate geographic locations [20] [21] [22] . However, complications such as subspecific overlap in coloration and morphometrics of specimens [13, 15, 23, 24] , fading of specimen color [12, 20, 25] and debate regarding collection location [12, 16, 17] have rendered morphology-based connectivity knowledge incomplete [12] . Bird banding data provides some insight into the species' migratory connectivity, but less than 0.20% of Hermit Thrushes banded in North America between 1960 and 2013 have been recaptured or recovered at a location other than the original banding site (U.S. Geological Survey Bird Banding Laboratory [USGS BBL], unpublished data). Only five of these individuals were captured or recovered in both breeding season (JuneAugust) and wintering season (November-February) in the previously-mentioned regions: two individuals banded during breeding season on the western and central coast of Alaska were recovered in winter in Vancouver, British Columbia, and three individuals banded during the breeding season on Haida Gwaii were recovered in winter in coastal northwestern California (one each in Humboldt and Mendocino counties, well north of the Bay Area, and one in Sonoma County, in the northern reaches of the Bay Area). A sixth individual was banded during breeding season in the Alexander Archipelago and recovered in late October in San Mateo County, which lies due west of the south end of San Francisco Bay. Since 2009, light-level geolocation has greatly improved our ability to study the migratory connectivity of small passerines [26, 27, 28] , including the Hermit Thrush. Alvarado et al. [7] combined molecular methods and geolocator data to confirm the existence of a migratory divide in the Hermit Thrush's breeding range in British Columbia. In that study, three individuals tagged on their breeding grounds on Haida Gwaii migrated south to wintering locations in Oregon and northern California, while two birds tagged in eastern British Columbia wintered in Arkansas. No other existing publications have established specific migratory connectivity patterns of the Hermit Thrush (but see [29, 30] for studies utilizing the Hermit Thrush as a model to demonstrate methods for assigning connectivity through stable isotope or combined isotope/genetic analysis).\nWe articulated two competing hypotheses to describe the migratory connectivity of Hermit Thrushes wintering in the San Francisco Bay Area. Based on literature that implies that Hermit Thrushes wintering in the Bay Area may be individuals from any one of the four or more abovementioned subspecies whose combined breeding ranges the coast of British Columbia, the C. g. nanus/osgoodi group breeds in Alaska from the southwest coast to the Alexander Archipelago, C. g. guttatus breeds along the central coast of British Columbia and east to the interior, and C. g. vaccinius breeds in northwestern Washington or on Vancouver Island in British Columbia and the adjacent coast. These subspecies descriptions [12] [13] [14] [15] [16] , however, contain overlaps in their morphologies, and the boundaries of their breeding ranges are imprecise, particularly in northwestern Washington and southwestern British Columbia. In that region, the breeding ranges of two additional subspecies, C. g. jewetti and possibly C. g. slevini, overlap with that of vaccinius, but their wintering ranges do not encompass the Bay Area [12] . While the Hermit Thrush is found across a broad geographic range, certain subspecies (e.g. C. g. verecundas and C. g. slevini) exhibit a distinct morphology paired with a limited distribution [12, 17] , potentially reflecting evolutionary divergence in isolation [18] or specialized adaptation to the local environment [19] . Our ability to plan for the conservation of groups such as these would be greatly increased through an improved description of the species' migratory connectivity. span from the coast of Alaska to northwestern Washington [13] , we hypothesized that the Bay Area's wintering Hermit Thrushes migrate to a variety of locations throughout the coastal Pacific Northwest within the suggested breeding ranges. Under this scenario we would expect little or no evidence that wintering birds from the north and south of the Bay migrate to distinct breeding locations (i.e., weak migratory connectivity). The second, and in our view less likely, hypothesis was that Hermit Thrushes wintering to the north and south of the Bay represent distinct groups that segregate in the Bay Area in winter and migrate to geographically distinct breeding locations, retaining the spatial structure present on the wintering grounds (i.e., stronger migratory connectivity).\nTo investigate the migration patterns of Hermit Thrushes wintering at sites located north and south of the San Francisco Bay (hereafter North Bay and South Bay) and test our hypothesis, we deployed light-level geolocators on birds in both regions. Our goals were to 1) identify and compare breeding locations and migration timing of North Bay and South Bay Hermit Thrushes, 2) quantify migratory connectivity and determine whether connectivity patterns are consistent with those described by accepted subspecies groupings, and 3) determine if North and South Bay Hermit Thrushes exhibit distinct morphologies."}, {"section_title": "Methods", "text": ""}, {"section_title": "Study sites", "text": "In the North Bay, we tagged and measured birds at three long-term banding sites operated by Point Blue Conservation Science in western Marin County, northwest of the San Francisco Bay (Fig. 2) [31] . Muddy Hollow and Pine Gulch are riparian sites dominated by arroyo willow (Salix lasiolepis) and red alder (Alnus rubra), with an understory of blackberries (Rubus ursinus and R. armeniacus) and other species [32] .\nIn "}, {"section_title": "Data collection", "text": "Between January 8 and March 13, 2013, we deployed 32 Migrate Technology Ltd model P65C2J13 light-level geolocators on wintering Hermit Thrushes (Fig. 1) . These geolocators measured light levels every minute and stored the highest level recorded for each five minute period. We tagged 17 Hermit Thrushes in the North Bay region (7 at Muddy Hollow, 7 at Pine Gulch, 3 at Palomarin), and 15 in the South Bay region. We captured all birds according to standard mist-netting protocols [34] . We attached tags with a leg loop harness of 1mm diameter clear beading cord (Stretch Magic®, Pepperell, MA) and used a crimp bead (Darice®, Strongsville, OH or Blue Moon Beads®, Provo, UT) to size and secure the harness. We banded birds with a uniquely numbered U.S. Geological Survey (USGS) aluminum band and one color band to aid resighting. We aged birds based on skull ossification and plumage characteristics [13] and weighed them to the nearest 0.1g. The combined weight of tag, harness and color band was approximately 0.7 -1.1g. The tags averaged 3.46% ± 0.55% of the bird's body weight (24.53g ± 1.46g).\nThe following winter (October 2013 -February 2014), we recaptured tagged birds through passive constanteffort mist netting, or in one case, by target netting using playbacks of conspecific vocalizations. At the time of recapture, we measured unflattened wing chord, Kipp's index (the difference between the longest primary and the longest secondary feathers, [35] ), tarsus length, bill width, bill depth, exposed culmen, and length from the distal end of nare to bill tip. Because male and female Hermit Thrushes have monomorphic plumage and cannot be sexed in winter, we collected blood samples (approximately 0.5 -0.7 ml) via brachial venipuncture [36] from 9 of the 10 returned tagged birds for the purpose of genetic sexing. To increase our sample size for sexing and morphological analysis, we also sampled 57 non-tagged birds from November 1 -February 28 of 2012-2013 and 2013-2014 (South Bay n = 38, North Bay n = 19); some to all of the above morphometrics were recorded for each of these individuals. Although we also sampled outside of this period, we restricted analysis to birds captured from November through February to eliminate passage migrants. Because of the extensive overlap in subspecific morphology, we did not attempt to identify individuals to subspecies."}, {"section_title": "Sexing and sex ratio analysis", "text": "DNA was extracted from whole blood using the Wizard® SV Genomic Purification System, (Promega, Madison, WI). To sex Hermit Thrushes, we used polymerase chain reaction (PCR) to amplify the CHD-W and CHD-Z genes with the primers P8 (5'-CTCCCAAGGATGAGRAAYTG-3') and P2 (5'-TCTGCATCGCTAAATCCTTT-3') according to Griffiths et al. [37] , with some revisions. PCR was carried out in a total of 25 µL. Reaction conditions were as follows: 5 µL 5x buffer, 0.5 µL dNTP, 2.5 µL MgCl 2 , 1.5 µL of each primer, 0.15 µL Taq polymerase (Promega), 10.85 µL H 2 O, and 3.0 µL of genomic DNA template. We used an annealing temperature of 46°C. PCR products were separated by electrophoresis in a 1.8% agarose gel for 55 minutes at 120V and stained with ethidium bromide. Individuals that we were unable to confidently sex were excluded from analyses.\nIn order to determine whether sex might influence regional differences in migration timing or morphology, we examined the sex ratio of our sample. We performed a Chi-squared test of independence to determine if the sex ratio of our North and South Bay samples differed from one another, and we used a Chi-squared goodness-offit test to determine if the sex ratio of our entire Hermit Thrush sample differed from an expected ratio of 50:50."}, {"section_title": "Geolocator analysis and migratory connectivity", "text": "We processed light-level data recorded by the geolocators with tools in the R version 3.0.2 (R Development Core Team 2013) package GeoLight (https://cran.r-project. org/web/packages/GeoLight/, [38] ). To calibrate the tags and generate a sun elevation angle for each tag, we used the known winter deployment location for a 10-or 20-day period beginning 2 days following deployment; the number of calibration days chosen depended on how late in the winter the tag was deployed. We used a 2-day delay to avoid shading effects due to any behavioral changes related to tag application. We were confident that the birds whose tags were recovered were still at the deployment location during the period chosen as the latest deployment date (March 1, 2013) was well prior to an expected spring departure date.\nWe identified sunrise and sunset times using a light threshold of 3, 5, or 6. We chose these values because they corresponded to a sun elevation angle close to -6.0 degrees (range = -6.2 to -5.0, mean = -5.7 ±0.5) and generated location coordinates consistent with known deployment locations during the calibration period. We eliminated outliers in sunrise and sunset times by using the loessFilter function to delete twilight transitions (range = 7 -87 per individual) that were greater than 2 times the interquartile range of residuals from the smoothed line.\nUsing the calibrated sun angle for each tag, we calculated the latitude and longitude for each twilight event. Latitudes were not calculated for 21 days before and after the vernal and autumnal equinoxes [39] . We then used the distanceFilter function to remove locations which would have required movements between consecutive positions to have exceeded a continuous speed of 25 km·h -1 . We identified spring migration departure and arrival dates by combining information from the latitude and longitude data and movement and residency periods generated with the changeLight function (probability of change = 0.85, minimum stationary period = 5 days). We were unable to determine fall migration dates because they coincided with the equinox period when latitude cannot be calculated.\nBased on the spring arrival dates and residency periods, we chose a breeding window that began 10 days following the breeding region arrival date and ended 30 days later. Restricting our analysis to this time period, we described approximate breeding locations by calculating 50% kernel densities estimates (KDE, [40] ) and summarized these data by computing their centroids with the R package adehabitatHR (https://cran.r-project. org/web/packages/adehabitatHR/). We chose the initial 10-day delay because the latitudes of all birds appeared higher at the time of breeding region arrival than during the majority of the breeding period. This may have been caused by shading or a change in position immediately prior to establishing breeding territories [41] , such as movement from the mainland to a breeding location on an offshore island.\nWe compared spring arrival date, departure date, and duration of spring migration of thrushes from the North and South Bay using 2-sample t-tests.\nTo assess the strength of migratory connectivity, we used the R package Imap to create matrices of great-circle distances between wintering deployment locations (see Study sites above) and breeding location centroids (See Sup. Mat. Table S1 ) for all individuals whose tag had been retrieved (n = 10). We then tested the correlation between the distance matrices of wintering and breeding locations by conducting a Mantel test with the R package ade4, specifying 10000 random permutations [42, 43] ."}, {"section_title": "Morphological analysis", "text": "We compared measurements of genetically-sexed tagged and non-tagged individuals that were captured at North and South Bay wintering regions. When multiple measurements were taken on different dates for the same individual, we used the average for the analysis. To determine difference in wing chord, Kipp's index, tarsus, exposed culmen, nares to tip, bill width and bill depth between the regions, we performed a two-way ANOVA using wintering region and sex as factors."}, {"section_title": "Results", "text": ""}, {"section_title": "Geolocator returns", "text": "Between October 17, 2013 and February 21, 2014, we recaptured ten of the 32 birds (31%) that were originally tagged, and we removed their geolocators. Six out of 17 (35%) North Bay birds returned (1 to Palomarin, 3 to Muddy Hollow, 2 to Pine Gulch), and 4 out of 15 (27%) South Bay birds returned. There was no tag loss from any bird we recaptured, and data from all tags were recovered. An 11 th individual that had been tagged was resighted at Palomarin but not captured; we could not confirm if its tag was intact. (See Sup. Mat. 1 for comparison of return rates of tagged to non-tagged birds). Two birds that returned to the North Bay were female, two were male, and the sex of two was unknown (we did not have a blood sample for one and were unsuccessful at genetically sexing the other). All four birds that returned to the South Bay were female."}, {"section_title": "Migration timing", "text": "North Bay Hermit Thrushes departed from wintering grounds significantly earlier than South Bay Hermit Thrushes (t = 4.36, df = 6.44, P = 0.004; Table 1 North Bay Hermit Thrushes also arrived on breeding grounds significantly earlier than South Bay birds (t = 3.81, df = 6.46, P = 0.008; Table 1 \nMean spring migration duration was 26.7 ± 6.4 days for North and South Bay sites combined, ranging from 16 to 37 days. Migration duration was not significantly different between sites (t = -0.37 days, df = 7.23, P = 0.719, Table 1 ).\nThe South Bay departure and arrival dates were more temporally concentrated than those of North Bay birds: the 4 South Bay birds, which were all females (Table 1) , departed over a period of 8 days; and the North Bay birds, which were of mixed sex, departed over a 35 day period. South Bay birds arrived on breeding grounds over the course of 9 days, while the arrival window for North Bay birds was 32 days. "}, {"section_title": "Breeding locations and migratory connectivity", "text": "Hermit Thrushes that wintered in the San Francisco Bay Area migrated to a region spanning from the south end of the Alexander Archipelago in the Alaska Panhandle, along the British Columbia coast, to the Olympic Peninsula in Washington (Fig. 3) Fig. 3 ; Sup. Mat. Table S1 ). However, the shortest distance between a North Bay and South Bay bird's breeding centroid was approximately 0.37° in latitude and a great-circle distance of 160 km (North Bay tag 715 and South Bay tag 720) and their 50% KDEs do overlap (Fig. 3) . The greatest distance between two North Bay breeding centroids (702 and 715) was approximately 6.53° in latitude and a great-circle distance of 832 km, and the greatest distance between two South Bay breeding centroids (720 and 726) was approximately 2.29° in latitude and a great-circle distance of 287 km.\nThe distances between wintering locations and breeding locations were significantly correlated (Mantel's r = 0.33, P = 0.039)."}, {"section_title": "Sex ratio", "text": "The sex ratios of the North Bay sample (n = 19, 31.6% male) and the South Bay sample (n = 38, 23.7% male) were not significantly different from one another (χ 2 = 0.10, df = 1, P = 0.750). However, the overall sex ratio of the total Bay Area sample (n = 57, 26.3% male) was significantly different from a 50:50 sex ratio (χ 2 = 12.77, df = 1, P < 0.001)."}, {"section_title": "Morphology", "text": "Our sample size of birds that we had both measured and genetically sexed was relatively small (n = 57), but we did find significant variation associated with sex or region for certain morphometrics (Table 2) . Wing morphology did not vary between birds from the North Bay and South Bay regions. For Kipp's index, there was no difference associated with sex (n = 19, F = 1.140, P = 0.301) or region (n = 17, F = 0.361, P = 0.556). Wing chord was significantly greater for males than females (n = 56, F = 19.39, P <0.001), but there was no significant difference associated with region (n = 56, F = 1.69, P = 0.200; Fig. 4a ). Similarly, variation in tarsus length was associated with sex (n = 41, F = 7.58, P = 0.009; Fig. 4b ), but not region (n = 43, F = 1.86, P = 0.179; Fig. 4b ). Exposed culmen and nares to tip were significantly greater for North Bay birds than South Bay birds (exposed culmen: n = 40, F = 9.06, P = 0.005; nares to tip: n = 41, F = 16.86, P < 0.001; Fig. 4c ). Neither morphometric significantly differed between males and females (exposed culmen: n = 40, F = 0.70, P = 0.410; nares to tip: n = 41, F = 2.09, P = 0.157; 4c). Bill depth did not differ by sex or region (sex: n = 40, F = 0.120, P = 0.731, region: n = 40, F = 0.301, P = 0.586), nor did bill width (sex: n = 40, F = 0.001, P = 0.983, region: n = 40, F = 0.948, P = 0.337)."}, {"section_title": "Discussion", "text": "We found that Hermit Thrushes wintering in the San Francisco Bay Area migrated to breeding sites spanning the northwest coast of North America from southeastern Alaska to northwestern Washington. This is consistent with currently accepted subspecies groupings [13] indicating that coastal northern California's wintering birds breed throughout that region. Overall, our entire sample of Bay Area wintering birds had a geographically broader breeding distribution than wintering distribution. North Bay birds as a whole migrated to breeding sites [16] , and Pyle [13] .\nfarther south than South Bay birds (Fig. 3) , exhibiting a small-scale pattern of leap-frog migration [44, 45] , the first documented evidence of this in the Hermit Thrush. The breeding locations of South Bay birds were more geographically concentrated than those of North Bay birds. For South Bay birds, breeding locations were concentrated toward the south end of the Alexander Archipelago and nearby mainland. North Bay birds, however, migrated to two somewhat-clustered breeding areas (one on or near Haida Gwaii, and one around Vancouver Island and the Olympic Peninsula; Fig. 3) . These results are supported by two of the above-mentioned band recoveries in the Bay Area (USGS BBL, unpublished data). One band recovered in winter in the northern reaches of the North Bay (Sonoma County, just north of Marin County) was that of a bird originally banded on Haida Gwaii. Likewise, the individual that was banded in breeding season in the Alexander Archipelago and recovered in San Mateo County in late October (approximately 30 km due west of our South Bay wintering site) may have been an overwintering bird, consistent with our finding that South Bay birds migrated to that region of Alaska.\nWe found a significant correlation between the spatial structure of wintering sites and the spatial structure of breeding location centroids, indicating that birds that wintered close together bred more closely together (Fig. 3) . This supports the hypothesis that, across a fine geographic scale (i.e., from one end of San Francisco Bay to the other; Fig. 2 ), Hermit Thrushes exhibit stronger migratory connectivity and maintain consistent spatial structure on wintering and breeding grounds. Based on the apparent distribution of the breeding locations identified, we propose that birds wintering in the two Bay Area regions originate predominantly from different breeding populations.\nBay Area wintering Hermit Thrushes may be associated with at least four different subspecies ( Fig.   3 ): South Bay birds could either be assigned to the C. g. nanus/osgoodi group (see [12, 16, 17] for debate regarding subspecies lumping) or C. g. guttatus [12, 13, 15, 16] , while North Bay birds could be assigned to C. g. verecundas, C. g. guttatus, C. g. vaccinius, or (715 only) C. g. nanus/osgoodi [12, 15] . Although Phillips [12] states that C. g. verecundas only rarely winters to Marin County (where our North Bay sites are located), 2-3 of the North Bay birds migrated to the breeding location, Haida Gwaii, described for this subspecies ( [12, 13] , but see [15, 17] ).\nWe acknowledge that the relatively close proximity of the breeding ranges of Hermit Thrush subspecies presents a challenge for definitively describing Hermit Thrush migratory connectivity. For example, there was overlap in the 50% KDEs of certain individuals from the North and South Bay. Future studies may be able to refine these results through the use of tracking devices that offer higher resolution, such as GPS tags [46] .\nMuch of the confusion regarding subspecies definitions of northwestern Hermit Thrushes undoubtedly stems from overlaps in morphology between adjacent breeding populations. Aldrich's 1968 study of Hermit Thrush morphology [15] found extensive overlap in wing chord, tarsus and bill measurements of C. g. verecundas, C. g. guttatus, and C. g. vaccinius (at the time verecundas was lumped with nanus and osgoodi was not yet lumped with nanus, [12] [13] [14] ). Consistent with his results, our study did not find differences in wing morphology between North and South Bay birds. Because birds from the South Bay evidently travel a longer distance to breeding grounds than North Bay birds, we might expect South Bay birds to have longer and more pointed wings [7, 47, 48] . It is possible that the difference between North and South Bay birds' migration distances is not large enough for these populations to have evolved significant differences in wing morphology. We found that North and South Bay thrushes did exhibit significant differences in bill length (Fig. 4c) . Other than the findings of Aldrich [15] , we are unaware of any published studies that have examined intraspecific variation in Hermit Thrush bill morphology. We could not appropriately compare his data to ours as subspecies definitions and their respective ranges have been revised since publication of his results. No known published studies have measured bill width, depth, or nares to tip.\nWe also found that North and South Bay Hermit Thrushes exhibited significant differences in migration timing, with birds from the North Bay departing wintering grounds and arriving on breeding grounds significantly earlier than South Bay birds (Table 1) . While this finding could potentially reinforce our proposal that North and South Bay individuals originate from different breeding populations, we suspect that the different sex ratios of the tagged birds from each region may partially explain the earlier spring departure and arrival dates of our North Bay sample. In many species, male birds depart for spring migration earlier than females [49] . Males thus arrive on breeding grounds before females to establish breeding territories and optimize mate selection opportunities and fitness [50] . In Stouffer and Dwyer's study [51] of C. g. faxoni, an eastern subspecies, they found that males passed through Chicago on spring migration weeks earlier than females. Bowlin's study [52] of Swainson's Thrush (Catharus ustulatus) also found that that males arrived at a spring stopover site earlier than females. Although the overall sex ratios of our Bay Area wintering birds was female-biased, the two known males (703 and 715) and two birds of unknown sex (594 and 718) from the North Bay departed wintering grounds on the earliest dates, potentially reinforcing findings of previous studies. The greater range of the North Bay birds' spring departure and arrival dates compared to that of the South Bay birds could be explained by the fact that the North Bay sample was composed of males and females while all South Bay birds were female.\nOur results add to a growing body of research on migration patterns of Catharus species in western North America. In studies of a congener, the Swainson's Thrush (Catharus ustulatus), researchers identified a migratory divide along the coastal ranges of western North America using genetic and banding data [5] and confirmed its presence using geolocators [53, 54] : western (coastal) breeding individuals migrate to wintering grounds in northern Central America and Mexico (also see [55] ) while adjacent, eastern (continental) individuals migrate to southern Central America and South America. Molecular dating indicates that genetic divergence between coastal and continental Swainson's Thrush populations occurred during the Late Pleistocene, and intraspecific variation in current migratory patterns may be an artefact of range expansion [5, 56] . The results of studies across the western range of the Swainson's Thrush have demonstrated strong connectivity [55] . While our results originate from deployment areas in wintering rather than breeding locations, our findings are similar to those of Swainson's Thrush studies in that Hermit Thrushes also exhibit different migratory patterns associated with distinct yet proximal deployment locations; therefore, Hermit Thrush populations may also be characterized by relatively strong connectivity.\nSimilar to the Swainson's Thrush, it is possible that the morphological and migratory variation between North Bay and South Bay Hermit Thrushes reflects the species' evolutionary history as populations were subjected to the varying availability of breeding and wintering grounds during the Late Pleistocene. From approximately 14,000 to 10,000 years ago, the Cordilleran Ice Sheet, which covered much of North America west of the Continental Divide, was absent from the western coasts of many islands of the southwestern Alexander Archipelago and portions of Haida Gwaii [18, 57, 58] . These ice-free areas served as refugia for floral and faunal colonization: island populations isolated from those of the mainland genetically diversified, resulting in large numbers of endemics in this region [59] [60] [61] . On the breeding grounds, these changes may have created alternating periods of increased or decreased gene flow for the Hermit Thrush. During that time, what is now the San Francisco Bay was a wide valley divided from east to west by the ancestral Sacramento and San Joaquin Rivers. Post-Wisconsinan deglaciation caused the sea to rise approximately 200 feet above current levels, inundating this basin and spreading across the land at the rate of as much as 30 m·yr -1 [62] . The rapidly-changing environment on the Hermit Thrush's wintering grounds may have differentially exposed the various Pacific Northwestern breeding populations to limiting factors during migration and in winter [63] . Fragmenting of the geographical distributions of Hermit Thrush populations on both the breeding and wintering grounds may therefore have provided conditions that led to the evolution of the current migratory patterns of northwestern Hermit Thrushes, as has been documented in Alvarado's study of the Hermit Thrush [7] and other species of migratory birds [5, 56, 64] .\nBased on our results, we propose that across relatively short distances (e.g., the ~90 km between our North Bay and South Bay wintering sites or the ~225 km between Haida Gwaii and Vancouver Island breeding grounds), Hermit Thrushes in the northwestern portion of their overall range should have substantial genetic variation that likely originated during the Last Glacial Maximum (as in other species [5, 61] ). The Turdinae subfamily, in particular Catharus thrushes, has been a model system in the study of the evolution of migration [6, 65, 66] , variation in migratory patterns and phenotype across a migratory divide [5, 7, 53, 54, 67] , and genomic divergence as a reflection of the variation in migratory patterns across a divide [68, 69] . However, molecular research specific to C. guttatus at the intraspecific level has primarily focused on genetic divergence between eastern and western lineages [7, 70] . Genetic techniques such as next-generation sequencing and SNP analysis would provide a means to investigate the fine-scale genetic structuring and timing of divergence [68, 69] of Hermit Thrush populations breeding in the Pacific Northwest, especially along a north-south gradient.\nKnowledge of migratory connectivity contributes greatly to our understanding of full life cycle biology of migratory species and is critical for their conservation and management [71] . The Hermit Thrush's population trends appear stable relative to those of its congeners, which are all experiencing significant declines across substantial portions of their ranges (USGS North American Breeding Bird Survey data, http://www.mbrpwrc.usgs.gov/bbs/bbs.html). The Hermit Thrush's adaptability in winter habitat choice, paired with its wide distribution [14] , may contribute to this fact. What we learn about the qualities and habits that have led to the relative success of this species may inform efforts to conserve declining Catharus species. However, Breeding Bird Survey data indicate that the Hermit Thrush may be declining in some breeding areas utilized by the Bay Area's wintering birds [72] . Further research on the species' migratory connectivity, paired with investigation of ecological requirements and spatial structuring of genetic variation, may allow us to identify localized Hermit Thrush populations that require protection or attention. and the Santa Clara Valley Water District for their support of our research; the USGS Bird Banding Lab for their support and for providing band encounter data; Tony Gaston and the Laskeek Bay Conservation Society, and Mary F. Willson, for permission to include their band recovery data herein; Palomarin interns and staff (especially Mark Dettling) and the many Coyote Creek Field Station volunteers for assisting with field work; Antonia Zhang and Aiko Wevereka for technical assistance; and Kristen Ruegg for comments on the manuscript.\nWe thank the March Conservation Fund for partial funding of this project and San Francisco State University for partial funding of Allison R. Nelson's research. We are also grateful to the Kimball Foundation, the Karen A. & Kevin W. Kennedy Foundation, the Makray Family Foundation, the Howard Allen Foundation, three anonymous donors, and the members and board of directors of Point Blue Conservation Science for their support of the Palomarin Field Station; and the members and board of directors of San Francisco Bay Bird Observatory for supporting the Coyote Creek Field Station.\nAll databases are available from the corresponding author. The authors have no conflicts of interest to report. This is Point Blue Conservation Science contribution number 2057."}]