[{"section_title": "", "text": "Uncoupling protein 1\nAbstract Temperature has profound effects on behavior and aging in both poikilotherms and homeotherms. To thrive under the ever fluctuating environmental temperatures, animals have evolved sophisticated mechanisms to sense and adapt to temperature changes. Animals sense temperature through various molecular thermosensors, such as thermosensitive transient receptor potential (TRP) channels expressed in neurons, keratinocytes, and intestine. These evolutionarily conserved thermosensitive TRP channels feature distinct activation thresholds, thereby covering a wide spectrum of ambient temperature. Temperature changes trigger complex thermosensory behaviors. Due to the simplicity of the nervous system in model organisms such as Caenorhabditis elegans and Drosophila, the mechanisms of thermosensory behaviors in these species have been extensively studied at the circuit and molecular levels. While much is known about temperature regulation of behavior, it remains largely unclear how temperature affects aging. Recent studies in C. elegans demonstrate that temperature modulation of longevity is not simply a passive thermodynamic phenomenon as suggested by the rateof-living theory, but rather a process that is actively regulated by genes, including those encoding thermosensitive TRP channels. In this review, we discuss our current understanding of thermosensation and its role in aging."}, {"section_title": "Introduction", "text": "Both genetic and environmental factors affect aging. In the past two decades, studies from model organisms such as worms, flies, and mice have identified a number of evolutionarily conserved genetic pathways, such as insulin and insulin-like growth factor 1 (IGF1) signaling (IIS) , that modulate aging (Finch and Ruvkun 2001; Kenyon 2010) .\nOn the other hand, relatively less is known about the mechanisms by which environmental factors regulate longevity, although studies have suggested that the environment is an equally, if not more, important determinant (up to 80 %) of aging in many organisms, including humans (Gurland et al. 2004; Herskind et al. 1996) . Food and temperature are the two primary environmental factors that affect lifespan in nearly all tested animal models. Nutrient, odor, and tastant in the food all regulate longevity, and dietary restriction (DR) is considered one of the most effective means to extend lifespan (Gems and Partridge 2013; Kenyon 2010; Mair and Dillin 2008) . Food regulates lifespan through various diet-sensitive genes and signaling pathways. Recent work has identified a number of genetic pathways (e.g., mTOR signaling, insulin signaling, AMPK, autophagy signaling, etc.,) through which DR extends lifespan (Bishop and Guarente 2007; Mair and Dillin 2008) . By contrast, very little is known about how temperature affects longevity.\nTemperature modulates a plethora of physiological and behavioral processes such as aging, development, reproduction, mating, and circadian rhythm (Cabanac 1975; Clarke and Portner 2010) . With the exception of extreme temperatures which may threaten survival, poikilothermic animals are long known to live longer at lower environmental temperatures, and vice versa. This phenomenon was first documented a century ago (Loeb 1908; Loeb and Northrop 1916) . Interestingly, lower core body temperature was also shown to extend lifespan in homeothermic mice (Conti et al. 2006) , implying a general role of temperature in lifespan modulation. Historically, the rate-of-living theory was adopted to explain the apparent inverse correlation between longevity and ambient temperatures (Lints 1989) . According to this theory, lower temperatures reduce the rate of chemical reactions of living species, thereby slowing down the pace of aging. This theory suggests that temperatureregulated longevity is purely a passive thermodynamic phenomenon. However, since genes have been shown to actively mediate the effect of food on longevity, one may question why temperature would be an exception (Finch and Ruvkun 2001; Kenyon 2010) .\nAnimals detect temperature changes through their sensory systems (McKemy 2007) . Temperature modulates both behavior and aging. Strikingly, animals across species have evolved evolutionarily conserved mechanisms to sense temperature. Namely, distinct types of temperaturesensitive membrane proteins (ion channels and membrane receptors) are widely involved in thermosensation in all metazoans (Dhaka et al. 2006; Jordt et al. 2003) . In this review, we will briefly discuss our current understanding of thermosensation and its potential roles in behavior and aging, with a focus on aging."}, {"section_title": "Molecular sensors of temperature", "text": "Among various temperature-sensitive membrane proteins, a subset of thermosensitive transient receptor potential (TRP) channels (called thermoTRPs) have been extensively characterized in the past two decades. TRP channels were first cloned in Drosophila and later found to form a family of evolutionarily conserved non-selective cation channels (Montell and Rubin 1989; Venkatachalam and Montell 2007) . As cellular sensors, TRP channels play important roles in chemosensation, mechanosensation, osmosensation, photosensation, and thermosensation in diverse organisms (Venkatachalam and Montell 2007; Xiao and Xu 2009) . These channels are found in Caenorhabditis elegans (17 members), Drosophila (13 members), and mammals (28 members), and together they form seven subfamilies, including TRPC (TRP-canonical), TRPV (TRP-vanilloid), TRPM (TRP-melastatin), TRPN (TRP-NompC), TRPA (TRP-ankyrin), TRPP (TRP-polycystin), and TRPML (TRP-mucoLipin) (Fowler and Montell 2013; Venkatachalam and Montell 2007; Xiao and Xu 2009) .\nThermoTRPs, a subset of TRP proteins found from at least four TRP subfamilies (TRPV, TRPA, TRPM, and TRPP), display superb temperature sensitivity and play critical roles in thermosensation and other temperatureregulated processes in a wide spectrum of organisms ranging from C. elegans to humans. ThermoTRPs are typically featured with remarkably high Q 10 coefficient values (a measure of the reaction rate change as a function of temperature increase by 10 °C). For example, the heat and capsaicin receptor TRPV1 has a Q 10 value >20, whereas most temperature-insensitive enzymatic reactions and ion channel gating exhibit a Q 10 value <3 (Clapham and Miller 2011; Hille 2001) . Functional studies using electrophysiology and calcium imaging have identified multiple thermoTRPs and other types of temperature-sensitive ion channels and receptors such as two-pore domain potassium channels (KCNKs), rhodopsin, and certain insect gustatory receptors (Dhaka et al. 2006; Jordt et al. 2003; Lotshaw 2007; Luo et al. 2011; Ni et al. 2013; Shen et al. 2011) . In this review, we will mainly focus on thermoTRPs as they are the ones that have been best characterized."}, {"section_title": "Mammalian thermosensors", "text": "Mammalian peripheral thermosensation is mainly mediated by sensory neurons located in the dorsal root ganglia (DRG) and trigeminal ganglia (TG) (Vriens et al. 2014) . Additionally, skin keratinocytes play a role in thermosensation by signaling to epidermal nerve endings (Caterina 2014) .\nInvestigators have identified at least seven thermoTRPs from thermosensitive tissues in mammals, including TRPM8 and TRPA1 which are cold-sensitive, and TRPV1-TRPV4 and TRPM3 which are heat-sensitive (Ramsey et al. 2006; Venkatachalam and Montell 2007) (Fig. 1a) . These thermoTRPs are widely expressed in various temperature-sensing tissues as described above and have distinct temperature activation thresholds, thereby covering a wide spectrum of ambient temperature. Interestingly, the temperature sensitivity of some thermoTRPs appears to be species specific. For example, TRPA1 is a cold-sensitive channel in C. elegans and mice but functions as a heat-sensitive channel in flies and snakes (Chatzigeorgiou et al. 2010; Gracheva et al. 2010; Story et al. 2003; Viswanath et al. 2003; Xiao et al. 2013) . Similarly, mammalian TRPV3 is activated by warming, yet amphibian TRPV3 is a coldsensitive channel (Saito et al. 2011) . In addition, different isoforms of certain thermoTRPs can exhibit distinct temperature activation thresholds. For instance, a trigeminal ganglia-specific splicing isoform of TRPV1 from vampire bats features a thermal activation threshold of ~30 °C which is significantly lower than other TRPV1 isoforms, endowing vampires bats with an exceptional thermosensitivity (Gracheva et al. 2011) . A similar phenomenon is also present among distinct isoforms of Drosophila TRPA1 (Kang et al. 2012; Zhong et al. 2012 ). The temperature sensitivity of distinct thermoTRPs and other thermosensitive ion channels may be largely determined by the heat capacity during channel gating, and thus, altering a few residues may switch the directionality of thermosensitivity or even confer thermosensitivity to an otherwise thermo-insensitive channel (Chowdhury et al. 2014; Jabba et al. 2014; Yang and Zheng 2014) . It should be noted that knockout mice of thermoTRPs still exhibit considerable temperature sensitivity, implying that unknown thermosensors must be present in mammals and other species."}, {"section_title": "Drosophila thermosensors", "text": "Drosophila larvae and adults are highly sensitive to changes in environmental temperatures. At the cellular level, class IV multidendritic (MD) neurons in the periphery sense hot temperatures (>39 °C) (Tracey et al. 2003) , while anterior cell (AC) neurons in the brain mediate warmth sensing (>24 °C) (Hamada et al. 2008 ). In addition, distinct groups of antennal neurons in the periphery sense cool and warm temperatures (Gallio et al. 2011; Kwon et al. 2010; Rosenzweig et al. 2008) . Other less characterized temperaturesensing organs and cells are also present in flies (Fowler and Montell 2013) . Genetic analysis and behavioral assays are widely used to identify and characterize thermoTRPs in Drosophila. At least three TRP channels (TRPA1, Painless, and Pyrexia) are heat-sensitive, all of which belong to the TRPA subfamily (Lee et al. 2005; Lee and Montell 2013; Tracey et al. 2003; Viswanath et al. 2003) (Fig. 1b) . These TRPA channels may be directly activated by heat. Additionally, thermotaxis behavioral assays suggest that the TRPC channel TRPL, the TRPV channel Inactive, and the TRPP1 homologs Brivido 1-3 play important roles in cold sensation (Gallio et al. 2011; Kwon et al. 2010; Rosenzweig et al. 2008) (Fig. 1b) . However, none of these channels has been demonstrated to be directly activated by cooling in vitro. It remains possible that they may function as transduction channels in cold sensation. The molecular identities of direct cold sensors in flies require further investigation."}, {"section_title": "C. elegans thermosensors", "text": "Caenorhabditis elegans is also highly sensitive to temperature changes. AFD neuron is the best-studied heatsensitive neuron in C. elegans (Garrity et al. 2010; Mori et al. 2007 ). In addition, AWC, ASI, FLP, and PHC neurons may also play a role in sensing heat (Chatzigeorgiou et al. 2010; Liu et al. 2012; Mohammadi et al. 2013; Mori et al. 2007 ). Interestingly, PVD neuron can respond to both heat and cold in C. elegans (Chatzigeorgiou et al. 2010; Mohammadi et al. 2013; Xiao et al. 2013) . While neurons dedicated to cold sensing have not been identified in C. elegans, a recent study has shown that C. elegans intestine is highly sensitive to cooling, expanding the repertoire of cold receptors from neurons to nonexcitable cells (Xiao et al. 2013) . As C. elegans intestine is in fact its fat tissue (McGhee 2007) , this study suggests that fat tissues in other organisms may also be sensitive to cooling (Xiao et al. 2013) . Indeed, a recent study reported that mammalian fat cells show temperature sensitivity (Ye et al. 2013) .\nIn C. elegans, TRPA-1 can be directly activated by temperature drop (<20 °C) in both the intestine and PVD neuron (Chatzigeorgiou et al. 2010; Xiao et al. 2013) (Fig. 1c) , supporting their function as a cold receptor. On the other hand, although the cyclic nucleotide-gated (CNG) channel TAX-2/TAX-4 can be activated by warming and closed by cooling in AFD neuron (Ramot et al. 2008) , these types of channels require intracellular signaling for activation and are probably not temperature-gated per se (Ramot et al. 2008) . The molecular identity of the heat sensor(s) in AFD neuron remains to be identified. In addition, the TRPV channels OSM-9 and OCR-2 seem to be involved in heat avoidance behavior (Chatzigeorgiou and Schafer 2011; Glauser et al. 2011; Liu et al. 2012; Mohammadi et al. 2013) . For example, OSM-9 and OCR-2 may play a role in sensing noxious heat (>35 °C) in FLP neuron in the head and PHC neuron in the tail (Chatzigeorgiou and Schafer 2011; Liu et al. 2012) , while OCR-2, but not OSM-9, is required for this response mediated by PVD neuron at the midbody (Mohammadi et al. 2013) . However, the temperature sensitivity of these C. elegans TRPV channels was not fully characterized. As these channels can also be activated by G protein signaling (Kahn-Kirby and Bargmann 2006; Xiao and Xu 2009), it is not clear whether they act as thermosensors or transduction channels."}, {"section_title": "Temperature and behaviors", "text": "Temperature changes drive complex behavioral responses in diverse organisms. Due to the simplicity of the nervous systems of simple model organisms such as C. elegans and Drosophila, it is feasible to map the neural circuits underlying thermosensory behaviors in these organisms.\nThe nervous system of adult C. elegans hermaphrodites contains only 302 neurons. As a result, the complete wiring diagram has been reconstituted by electron microscopy (White et al. 1986 ). Though equipped with a simple nervous system, C. elegans is capable of most sensations, including photosensation, chemosensation, touch sensation, proprioception, osmosensation, and thermosensation (Bargmann 2006; Bounoutas and Chalfie 2007; Garrity et al. 2010; Li et al. 2006; Ward et al. 2008; Xiao and Xu 2009 ). In the case of thermosensation, C. elegans remembers its past cultivation temperature and tends to move toward that temperature on a temperature gradient, a phenomenon termed thermotaxis (Hedgecock and Russell 1975) . The neural and genetic mechanisms underlying thermotaxis have been well studied and extensively reviewed elsewhere (Fig. 2a) (Garrity et al. 2010; Luo et al. 2014; Mori et al. 2007 ). Briefly, AFD appears to be the principle thermosensory neuron mediating thermotaxis behavior, though other sensory neurons (e.g., AWC and ASI) are also involved (Fig. 2a) . AFD, together with the interneurons AIY, AIZ, and RIA, forms the core of the neural circuitry underlying thermotaxis (Fig. 2a) . AFD senses temperature through an unknown thermosensor which transduces signals through cGMP signaling, leading to opening of the CNG channel TAX-2/TAX-4. In addition to thermotaxis, C. elegans exhibits robust escape responses to noxious heat stimuli (Glauser et al. 2011; Liu et al. 2012; Mohammadi et al. 2013; Wittenburg and Baumeister 1999) . Neuropeptide signaling and the TRPV channels OSM-9 and OCR-2 may regulate the threshold of noxious heat avoidance behavior in C. elegans (Glauser et al. 2011; Liu et al. 2012; Mohammadi et al. 2013) . Furthermore, the nociceptor PVD neuron seems to be involved in thermal avoidance behavior by sensing noxious heat at the midbody (Mohammadi et al. 2013) .\nThermoTRPs also play important roles in fly thermosensory behaviors. For example, TRPA1 is required in a small number of central brain neurons for Drosophila thermotaxis behavior, in which case it acts as a transduction channel downstream of G protein and phospholipase C (PLC) signaling (Kwon et al. 2008; Rosenzweig et al. 2005) . Rhodopsin is required for this behavior likely as a direct thermosensor (Shen et al. 2011) . The other two fly TRPA channels, Painless and Pyrexia, have higher temperature activation thresholds and are important for mediating noxious heat avoidance behavior (Lee et al. 2005; Tracey et al. 2003) . In flies, peripheral thermosensory inputs converge onto three regions in the brain: mushroom body, lateral horn, and posterior lateral protocerebrum through projection neurons (Frank et al. 2015; Liu et al. 2015) . These projection neurons can be excited by warming, cooling, or both (Frank et al. 2015; Liu et al. 2015) . Heat-sensitive projection neurons receive excitatory inputs from heat receptors, as well as crossover inhibitory inputs from cold receptors via inhibitory interneurons. Through this mechanism, non-thermal noises could be canceled while thermal activities could be reinforced (Frank et al. 2015; Liu et al. 2015) .\nIn mammals, perceived temperatures trigger both physiological and behavioral thermoregulatory actions, including thermosensation, hibernation, mating, migration, etc., (Schmidt-Nielsen 1997; Vriens et al. 2014) . As for thermosensation, activation of thermoTRPs at the peripheral nerve terminals of DRG and TG neurons sends temperature information to the pons, thalamus, and other regions of the central nervous system, which in turn elicits various behavioral responses such as thermotaxis and thermal avoidance (Caterina 2007; Vriens et al. 2014) . A simplified mammalian thermosensation diagram mediated by the well-studied heat sensor TRPV1 and the cold sensor TRPM8 is outlined in Fig. 2b (Caterina et al. 1997; Dhaka et al. 2008; Julius 2013; Peier et al. 2002) ."}, {"section_title": "Temperature and longevity", "text": "In addition to behavior, the sensory environment has a profound impact on many other aspects of life, including aging. For example, studies in C. elegans and Drosophila show that chemosensory neurons regulate lifespan presumably by sensing chemical cues from the environment (Alcedo and Kenyon 2004; Apfeld and Kenyon 1999; Libert et al. 2007; Linford et al. 2011; Ostojic et al. 2014; Waterson et al. 2014) . As a sensory cue, temperature influences aging in both poikilotherms and homeotherms. The lifespan of poikilothermic animals, such as worms, flies, and fish, shows an inverse correlation with ambient temperatures; namely, with the exception of extreme temperatures which may threaten survival, animals exhibit a longer lifespan at lower temperatures but a shorter lifespan at warmer temperatures (Conti 2008; Klass 1977; Loeb 1908; Loeb and Northrop 1916) . Both body and environmental temperatures regulate the lifespan of homeotherms as well. For example, lowering the core body temperature of mice increases lifespan (Conti et al. 2006 ). In addition, lower core body temperature is associated with longer lifespan in both mammals and humans (Hauck et al. 2001; Hunter et al. 1999; Roth et al. 2002) . In the case of environmental temperature, brief exposure to cool temperatures on daily basis extends the lifespan of rats and protects them from aging-associated diseases (Holloszy and Smith 1986) . Furthermore, therapeutic hypothermia has long been used to treat various agingassociated cardiovascular arrest, stroke, and brain injury in animal models and humans (Diller and Zhu 2009 ). All these observations point to a general role of temperature reduction in lifespan extension. However, unlike dietary modulation of longevity which has been extensively characterized, little is known about the mechanisms by which temperature regulates lifespan.\nThe rate-of-living theory suggests that the extended and shortened lifespan at low and warm temperatures is attributed to the reduced and increased chemical reaction rates, respectively, and that genetic programs are not involved in this process (Holloszy and Smith 1986; Lints 1989) . However, as genetic mechanisms play active roles in all known aging paradigms, one may wonder if temperature modulation of longevity is truly an exception. Using C. elegans as a model, a recent study has investigated whether genetic pathways actively regulate lifespan at low temperatures (Xiao et al. 2013 ). This study hypothesized that a thermosensor(s) may detect temperature drop in the environment to initiate longevity signaling, thereby actively promoting lifespan at low temperatures. TRPM8, the best characterized cold sensor in mammals, does not have a homolog in C. elegans. Therefore, the potential role of another cold sensor, TRPA-1, in longevity was interrogated at different temperatures. trpa-1 mutant worms are shortlived at low temperatures (15 and 20 °C) but not warm temperature (25 °C) compared to wild-type worms. Conversely, overexpression of TRPA-1 extends lifespan at low but not warm temperatures. Thus, TRPA-1 promotes lifespan in a temperature-dependent manner. Given the molecular nature of TRPA-1 as a thermosensor, these results support the notion that TRPA-1 detects temperature drop in the environment to promote longevity. TRPA-1 does so by recruiting a signaling cascade, including TRPA-1-mediated calcium influx, PKC-2 (a calcium-sensitive protein kinase C), SGK-1 (serum-and glucocorticoid-inducible kinase-1, a DAF-16/FOXO kinase), and the FOXO transcription factor DAF-16, which is a key regulator of lifespan (Fig. 3a) (Xiao et al. 2013) . Interestingly, SGK-1 and its upstream mTOR complex 2 (mTORC2) are also reported to modulate C. elegans lifespan in a context-dependent fashion (Mizunuma et al. 2014) . At low temperatures, SGK-1 promotes lifespan by upregulating DAF-16 (Mizunuma et al. 2014; Xiao et al. 2013) , whereas dietary input such as HT115 bacterium can direct SGK-1 to inhibit the Nrf transcription factor SKN-1, another major regulator of lifespan, thereby shortening lifespan (Mizunuma et al. 2014) .\nExpression of TRPA-1 in either neurons or the intestine is sufficient to extend lifespan. The nervous system and intestine/fat are the two primary signaling tissues that coordinate body-wide longevity signaling in C. elegans (Kenyon 2010; Libina et al. 2003) . Notably, the nervous system and fat tissues also play a critical role in aging in mammals (Timiras 2003) . While the underlying cold-sensitive neurons have not yet been identified in C. elegans, intestinal cells appear to directly sense cooling, as acutely isolated intestine responds to temperature decrease. This temperature sensitivity is diminished in trpa-1 mutant worms, supporting that it is mediated by TRPA-1. Together, these results argue that low temperature-promoted lifespan extension is not a pure passive thermodynamic The AFD neuron detects heat stimulus and transmits the temperature signal to DAF-9/DAF-12 in a cell-non-autonomous manner, thereby counteracting the life-shortening effect of high temperatures. HSF-1 may sense heat, albeit indirectly, through heat shock signaling to extend lifespan in both adult and larva phenomenon but rather a process that is actively regulated by genes. Nevertheless, it should be noted that trpa-1 mutants still exhibit some temperature sensitivity, suggesting the presence of other cold sensors and perhaps other genetic pathways. Indeed, low temperatures are known to induce the expression of a group of cold-shock proteins (CSPs) across species from bacteria to humans, with many of them belonging to the RNA-binding protein family (Horn et al. 2007) . These CSPs could mediate certain protective effects of cooling during neurodegeneration and aging (Peretti et al. 2015) . Low temperatures can also stimulate the proteasome degradation pathway in fish, which may contribute to longevity (Lu and Hsu 2015) . It is unclear how CSPs and the proteasome pathway are turned on by low temperatures. One possibility is that this could be triggered by cell surface cold receptors in sensory neurons and other thermosensitive tissues. Lastly, the passive thermodynamic mechanism may also contribute to lifespan extension at low temperatures.\nC. elegans has a shorter lifespan at high temperatures. The question arises as to whether genetic components are actively involved in shortening lifespan when the environmental temperature increases. Interestingly the opposite has been revealed: genetic components extend lifespan at high temperatures (Jeong et al. 2012; Lee and Kenyon 2009 ) and this effect is mediated by AFD neuron, a highly versatile heat-sensitive neuron that also regulates thermosensory behaviors. Additionally, AFD neuron mediates a bodywide heat shock cellular response cell-non-autonomously (Prahlad et al. 2008; Sugi et al. 2011 ). Ablation of AFD or mutations reducing AFD activity further shortens lifespan at high but not low temperatures, demonstrating that AFD neuron antagonizes the detrimental effect of high temperatures on longevity. DAF-9/Cytochrome P450 and the nuclear hormone receptor DAF-12, but not the FOXO transcription factor DAF-16, are required for AFD neuron to promote or maintain normal lifespan at high temperatures (Fig. 3b) . Furthermore, HSF-1/Heat Shock Factor-1 may act independently of AFD neuron and DAF-9/DAF-12 signaling to promote C. elegans lifespan at high temperatures (Fig. 3b ) (Jeong et al. 2012; Lee and Kenyon 2009 ). In addition to AFD, two other thermosensory neurons involved in thermotaxis, AWC and ASI, may also play a role in lifespan regulation. Laser ablation of ASI neuron or a combination of ASI and AWC neurons extends lifespan (Alcedo and Kenyon 2004) . As both ASI and AWC are also chemosensory neurons (Bargmann 2006) , another possibility is that they regulate longevity through chemosensory signaling. Proper protein folding is critical for cellular physiology (Labbadia and Morimoto 2015) . Temperature has a great impact on protein folding, and various molecular chaperones play essential roles in assisting protein folding (Labbadia and Morimoto 2015) . DAF-41/ZC395.10, the C. elegans homolog of p23 chaperone, regulates C. elegans longevity in a temperaturedependent manner (Horikawa et al. 2015) . daf-41 mutant worms are long-lived at high temperatures (e.g., 25 °C) but short-lived at low temperatures (Horikawa et al. 2015) . The two opposing longevity phenotypes are mediated by two different sets of transcription factors. It is not clear whether DAF-41 interacts with the TRPA-1-and AFD-dependent pathways. Collectively, these studies clearly demonstrate that genetic pathways play active roles in regulating lifespan at both low and high temperatures.\nAlthough genetic studies described above reveal a critical role of genes in lifespan regulation in response to temperature alternations, the \"temperature law\", remains: lower temperatures extend lifespan while higher temperatures shorten it. This \"temperature law\", though widely accepted, has not been extensively tested until recently (Zhang et al. 2015) . In this study, Zhang et al. systematically evaluated the role of temperature on longevity in C. elegans, and found that temperature differentially regulates lifespan at different stages of animal life. While exposure to low temperatures at the adult stage prolongs lifespan, low temperature treatment at the larval stage surprisingly reduces lifespan (Fig. 3a) (Zhang et al. 2015) . This developmental stage-dependent differential effect of temperature on longevity is mediated by the same thermosensitive TRP channel TRPA-1 that signals to the transcription factor DAF-16/FOXO (Fig. 3a) . At the larval stage, TRPA-1 likely acts as a direct cold sensor to shorten lifespan through DAF-16/FOXO, while HSF-1 indirectly responds to heat to extend lifespan (Zhang et al. 2015) . At the adult stage, by contrast, TRPA-1 directly detects environmental temperature drop and promotes longevity at low temperatures through DAF-16/FOXO (Fig. 3a) . This raises an interesting question: how could DAF-16 produce two opposite lifespan outcomes in larvae and adults? Through microarray analysis and quantitative PCR assays, it was shown that DAF-16 differentially regulates gene expression in larvae and adults in a temperature-dependent manner (Fig. 3a ) (Zhang et al. 2015) . Such DAF-16-dependent differential regulation of gene expression in larva and adulthood may explain the distinct effects of temperature on longevity at the larval and adult stages. The fact that temperature treatment at the larval stage affects adult lifespan also uncovers an interesting phenomenon: temperature experience in the early life of an animal can induce a long-lasting effect on its late life. Apparently, temperature modulation of longevity in C. elegans is much more complex than previously thought and demands further investigations."}, {"section_title": "Temperature modulation of longevity in homeotherms", "text": "The longevity of homeothermic animals is also regulated by temperature, though little is known about the mechanism.\nLowering the core body temperature of mice by 0.5 °C in a transgenic model increases lifespan by 12-20 % (Conti et al. 2006 ). In addition, mice under DR and those showing hypopituitary and growth hormone-resistance all display a lower core body temperature and are long-lived (Hauck et al. 2001; Hunter et al. 1999) . Notably, a reduced core body temperature is also associated with longer human lifespan as shown in data from the Baltimore Longitudinal Study of Aging (BLSA) (Roth et al. 2002) . Therefore, both body and environmental temperatures modulate longevity in homeotherms. However, the underlying genetic mechanisms remain largely unexplored.\nAs many thermoTRPs are expressed in both the peripheral and central nervous systems, they may play important roles in transforming temperature information into longevity output. Knockout mice lacking TRPV1, a heat and capsaicin receptor, are long-lived, demonstrating that mouse TRPV1 shortens lifespan (Riera et al. 2014) . A similar phenomenon was also observed in mutant worms deficient in the TRPV channels OSM-9 and OCR-2 ( Lee and Ashrafi 2008; Riera et al. 2014) . TRPV1 in DRG neurons triggers intracellular calcium signaling and modulates longevity by activating CRTC, a CREB-regulated transcriptional coactivator (Riera et al. 2014) . Together with CREB, CRTC promotes the transcription and release of the neuropeptide calcitonin gene-related peptide (CGRP) from DRG sensory endings, which in turn inhibits insulin release from pancreatic β cells, leading to aging-associated metabolic decline (Riera et al. 2014) . As TRPV1 is a heat-sensitive channel enriched in sensory neurons, this raises the interesting possibility that TRPV1 or other thermoTRPs may act as a peripheral thermosensor to detect temperature increase in the environment to shorten lifespan in mice.\nFat cells are known to be critical in mammalian insulin signaling, metabolism, and aging (Picard and Guarente 2005; Tchkonia et al. 2010 ). These cells respond to ambient temperature changes through sympathetic pathways. Specifically, upon low temperature stimulation, cutaneous thermoreceptors (e.g., thermosensitive TRPs) located in primary sensory neurons and skin tissues deliver the temperature information to the preoptic area (POA) and hypothalamus through the spinal and trigeminal dorsal horn. At POA and hypothalamus, the temperature signals are integrated and then transduced to fat cells and other tissues through sympathetic output (Morrison et al. 2012) . Indeed, at low temperatures, fat cells exhibit an enhanced expression of multiple thermogenic genes, including uncoupling protein 1 (UCP1), peroxisome proliferator-activated receptor gamma coactivator 1-alpha (PGC-1α), and type II iodothyronine deiodinase (Dio2) (Rosen and Spiegelman 2014) . Interestingly, upregulated UCP1 and PGC1α activities are both linked to improved healthspan and extended lifespan in transgenic mouse studies (Gates et al. 2007; Wenz et al. 2009 ), implying a potential mechanism for promoting longevity at low temperatures in homeotherms. In this regard, it is possible that fat tissues may act downstream of the nervous system to mediate the effect of temperature on longevity in homeotherms. Nevertheless, these are circumstantial evidence at best, and future studies are needed to directly explore the mechanisms underlying temperature modulation of longevity in homeotherms."}, {"section_title": "Concluding remarks", "text": "Temperature affects nearly every aspect of animal life. Throughout evolution, animals have evolved various mechanisms to respond and adapt to temperature fluctuations in the environment. Remarkably, a subset of thermoTRP channels play evolutionarily conserved roles in thermosensation. In this review, we mainly highlighted our current understanding of molecular thermosensors in model organisms such as C. elegans, Drosophila, and mice. Activation of these thermoTRPs and other molecular thermosensors elicit complex behavioral responses in a context-dependent manner. It is notable that thermoTRP knockout animals still display temperature sensitivity, indicating that other molecular thermosensors are probably present. Further investigations are required to identify and characterize these novel temperature sensors.\nIn addition to behavior, ambient temperature modulates aging. Both poikilotherms and homeotherms live longer at lower temperatures, and vice versa. Though the rate-ofliving mechanism may still contribute, studies in C. elegans demonstrate that genetic programs play important roles in mediating the effect of temperature on longevity. Temperature modulation of longevity is apparently more complex than previously thought, as recent work shows that temperature differentially regulates lifespan in C. elegans at different stages of life. As both neurons and intestinal cells are involved in regulating this process, it is interesting to investigate the mechanisms by which neurons communicate with intestinal cells. Moreover, how temperature signals are transmitted from neurons and the intestine to other tissues remains enigmatic.\nBody temperature affects lifespan in homeothermic animals; however, the underlying mechanisms remain largely unexplored. Lower body temperature is also linked to longer life expectancy in humans. While lower environmental temperatures extend lifespan in rodents, it is unclear whether this phenomenon can be extended to humans. Similar to C. elegans, certain mammalian tissues are temperature sensitive. These tissues may act as cellular thermosensors mediating the effect of temperature on longevity in mammals. Future studies are needed to verify whether these thermosensitive tissues modulate longevity, identify the thermosensors in these tissues, and investigate how longevity signals are transmitted from thermosensitive tissues to other tissues in mammals. As the aging mechanisms tend to be evolutionarily conserved, work in C. elegans and other simple model organisms will continue to provide novel insights into how temperature modulates longevity in mammals, including humans."}]