[{"section_title": "Introduction", "text": ""}, {"section_title": "Background Information", "text": "Consisting of 1.5 million acres of federally protected land, the Everglades National Park (ENP) is the largest subtropical ecosystem in the United States (Todd et al., 2010). A variety of habitats are contained within the park, with mangrove forests along the coastline that transition into a brackish mix of lowland scrubs and sawgrass prairies, to freshwater marshes further inland (Davis, 2005). A 120 mile freshwater river known as the \"River of Grass\" provides the ENP with much of its freshwater flow, allowing for a high diversity of wildlife (Alles, 2012). The extensive mangrove forests along the coastline of the park help make this ecosystem function as well. Mangroves act as a transition zone between salt and freshwater habitats by filtering out saltwater through their root systems (Stevens et al., 2006). However, saltwater is intruding further inland of the ENP, and contributes to the loss of approximately 50% of the original Everglades freshwater habitats (Ingebritsen, 1999). Flooding became an issue in the early 1900s, and because of this the United States Congress decided to implement flood control measures by enacting the South Florida Project, which consisted of over 1000 miles of canals, 720 miles of levees, and 16 pumping stations (Perry, 2004). Due to this initiative, freshwater flow was dramatically changed throughout the park. As a result, the ENP is undergoing one of the largest restoration efforts in the National Park Service's history (Comprehensive Everglades Restoration Plan (CERP), n.d.). The location of mangroves within the ENP designate how far saltwater extends inland from the Florida coastline and informs researchers how the ecotones are responding to climate change and current restoration efforts. Understanding the extent of the mangroves within the ENP may provide insight to the overall ecosystem health (Zweig and Kitchens, 2008). The hydrological changes to the park can influence the extent of mangrove trees, so investigating how the mangroves are shifting in conjunction to changing water routes is important in understanding these hydrological changes (Doren et al., 1999). By correlating the past changes of mangrove extent with hydrological changes within ENP, ecological modeling can be conducted to predict future changes to the park. Mangrove forests are vastly important for the development of coastal communities around the world as well. Providing many ecosystem services, including acting as a large carbon sink, mangroves help make it possible for freshwater habitats to flourish alongside saltwater habitats (Twilley and Revera-Monroy, 2005). In the U.S. alone, mangroves are estimated to provide around $186 million in goods and services (Rath, 2016). Mangroves are thus important to the wetland ecosystem, but imbalances arise when they displace freshwater marshes farther inland causing a decrease in habitat for various plants, birds, and other wildlife. For the NPS to make informed decisions about the future health of the park, sustainably managing where mangrove forests grow is important for maintaining a balance between these freshwater and saltwater habitats. The tool created for this project shows promise in its ability to successfully observe changes with mangrove forest extent and its implications on freshwater marsh. Further studies and enhancements to this tool can complement current methodologies used to understand the extent of mangroves around the globe in order to incite sustainable mitigation plans to halt the decline of these habitats."}, {"section_title": "Project Partners & Objectives", "text": "This project addresses the Ecological Forecasting application area through the creation of a methodology utilized to forecast the mangrove extent in ENP to the year 2030. Park officials at ENP identified that delineating mangrove extent is crucial to understanding how freshwater flow is changing in the park. Future water routing plans intend to divert up to 80% of westerly freshwater flow towards the eastern side of the park, so monitoring the health of the ecosystem is instrumental to making sound management decisions. This project will update the current mangrove extent map with the Generalized Random Tessellation Stratified (GRTS) sampling technique selected in this study, and will provide a replicable process for the park staff to expand in upcoming years. between each image. Access to multiple Landsat images for each year allowed the team to minimize cloud coverage by utilizing a cloud masking algorithm and aggregating the data within GEE editor. In addition to the Landsat series, the Coastal Change Analysis Program (C-CAP) raster, updated in 2010, was downloaded from the National Oceanic and Atmospheric Administration (NOAA). This raster file allowed the team to delineate a buffer along the study area approximately 10 km 2 along the mangrove and marsh transition area. In conjunction with this, the NPS provided a detailed vegetation map that also incorporated in situ vegetation points. The team used this detailed vegetation map to identify the class types within the study area. A Generalized Random Tesselation Stratified (GRTS) shapefile, the boundary shapefile of the park, and a topography shapefile with detailed elevation data was also provided by the National Park Service. These shapefiles allowed the team to utilize similar methods that the NPS uses to analyze vegetation data for other projects ongoing in the same area. A water mask and coastline shapefiles were created by using the Sentinel-2a classified imagery. STATSGO provided the soil data and Route 41 was collected from street information provided by TIGER."}, {"section_title": "Data Processing", "text": "The Landsat image collections, already calibrated for top of the atmosphere reflectance, orthorectified, and fit with a Function of Mask (Fmask) band, were imported directly into the GEE user interface. The Fmask band provided a means for the clouds and cloud shadows to be removed through spectral and brightness temperature thresholds from each Landsat image with the Fmask function GEE provides ( Figure 2). The collection of images was reduced using the median value of pixels for aggregating the image collection into a single image that is free of cloud cover and shadows ( Figure 2). Any Landsat images that contained missing data pixels as a consequence of the Fmask function were aggregated with the prior year's dry season collection to fill in the missing pixels. Before aggregation, the prior year was processed in the same manner. Figure 2: FMask algorithm essentially cuts out the cloud and cloud shadow pixels for the dry season for each study year. Pixels from other images are used to fill in the holes that the missing pixels left behind and are aggregated to produce a whole image exhibiting the median pixel value. Challengingly, there is no cloud masking band or thermal band available for the Sentinel-2 images. Therefore, an alternate approach to the Fmask operation was necessary. This was accomplished by applying a cloud score using band QA60, a bit mask with cloud information, to compute a cloud-likelihood for the Sentinel-2 images. Pixel values less than 1024 were considered cloud-free. A singular cloud-free image was produced by reducing the image to the 15 th percentile due. Landsat and Sentinel-2 cloud-free images were clipped to the boundary of the ENP. NOAA's C-CAP raster was used to identify the interior edge of the mangrove-marsh transition in order to create a 10-kilometer buffer from that edge. This buffer was then used to clip the GRTS shapefile to isolate grids only over the mangrove and marsh extent. Since the GRTS shapefile is already formatted in a random fashion, the first 30 grids were then selected to create the random sampling sections where training sites were drawn ( Figure 3). This random sampling technique provided a spatially-balanced sampling grid so that no grid is located too far from another grid and few grids are close to another. This reduced any biased sampling for the training sites as well as the uncertainty of classification. Figure 3: GRTS (Generalized Random Tesselation Stratified) sampling technique that allowed us to test our accuracy randomly so that we could decrease the bias in our supervised classification results."}, {"section_title": "Data Analysis", "text": "A supervised classification was used to define the boundaries of mangroves and marsh extent for this project. Seven categories were identified within the image collections: Water, Mangrove Forest, Freshwater Marsh, Saltwater Marsh/Sawgrass Prairie, Shrub/Scrub, and Bare Ground/Developed (Table 2). Training sites were selected within the random sample grids provided by GRTS. Thirty grids were selected with an effort to identify each class within each grid. An average of 35 samples were drawn for each class. The random forest classification algorithm was applied to the training sites to create a land cover map for each epoch. To calculate the accuracy of the land cover maps, the training points were divided to produce a random sample of 10% for testing and 90% for classifying. The accuracy refers to the rate of correct classification that occurs when the testing points are compared to the classifying points (See Appendix B).  x 100 Net change = Total Gain (ha) -Total Loss (ha) Forecasting to the year 2030 considered three different analyses provided by the TerrSet Geospatial Monitoring and Modeling System Land Change Modeler. Land Change Modeler empirically models the relationships of changes in land cover with driver variables to predict the land cover to a future date. The first step was to identify what changes have occurred between the earlier and later year using TerrSet's Change Analysis. This analysis pinpoints exactly where the changes have occurred, how much change has occurred (net), and which classes contributed to the change in a specified land cover. The second step was to identify the potential of a class to transition to a different class through the Transition Potential Modeling using the multi-layer perceptron (MLP) neural network machine learning tool. Transitions are empirically evaluated by identifying transitions that are likely caused by the same driver variable. Two forecasts were performed where one was influenced by current restoration efforts and the other had little to no influence. This was determined using the transition sub-models to identify restoration as a transition from mangrove forest to freshwater marsh and/or saltwater marsh/sawgrass prairie. Forecasting with little to no restoration effort effect was identified as a growth in mangrove forest where freshwater marsh and/or saltwater marsh/sawgrass prairie transition to mangrove forest. Table 3 provides the transitions used in the forecasting model where there was little to no influence in restoration and Table 4 shows transitions with influence. Driver variables used in this analysis are shown in Table 5. Drivers were tested to produce a Cramer's V -a measure of predictive power of the variables on a scale of 0-1. Each driver displayed a Cramer's V higher than 0.3 for the mangrove class signifying them as strong predictors. Finally, Markov Chain analysis was used to model the transitions and predict the land cover to the year 2030.   "}, {"section_title": "Distance to saltwater", "text": "Saltwater influences the extent of mangrove forests and locations of freshwater marsh. Mangrove forests are located near saltwater while freshwater marsh prefers to be farther inland, away from saltwater."}, {"section_title": "0.365", "text": ""}, {"section_title": "Distance to the coastline", "text": "Mangroves are found near the coastline and freshwater marsh is located farther inland away from the coastline."}, {"section_title": "0.407", "text": ""}, {"section_title": "Land cover", "text": "Quantitative representation of land cover using evidence likelihood. This represents the likelihood of finding a land cover type at any given pixel that would likely transition. Mangrove forest influences freshwater marsh and vice-versa and are likely to transition 0.639"}, {"section_title": "Elevation", "text": "Mangroves prefer lower elevations near sea level while freshwater marsh prefers the higher elevations away from sea water 0.339"}, {"section_title": "Soil type", "text": "Soil types influence the vegetation that is found 0.513"}, {"section_title": "Results & Discussion", "text": ""}, {"section_title": "Analysis of Results", "text": "Seven land cover maps were produced using GEE for each epoch of the study period (Appendix A). One of the obvious changes observed from the year 1995 to 2016 was the visible increase in vegetation (mangrove and marshlands) on the islands south of the Florida peninsula (A-1 & A-6). Freshwater marsh appears to cover a larger area in the epoch 1995 and may be a result of an unusually wet year causing some bias towards the water class. Evidence of current restoration efforts are visible in the 2016 image due to the presence of water encroaching into the freshwater marsh system from the north-eastern region (A-6 & A-7). The transition from 2000 to 2005 show over 1000ha of loss with freshwater marshes, while mangrove forests increased over 1000ha. The year 2005 was hit heavily by hurricanes, which could account for the increase of bare ground as well. Hurricanes can take many years to recover in some instances, and seeing an exposure of bare ground and less vegetation along the intertidal zones could be indicative of this. On average, the overall accuracy for all maps was approximately 97.7%. This overall accuracy is very high displaying very good agreement between the testing and training pixels. Confusion matrices produced for each image consistently show that the shrub/scrub and bare ground/developed classes were the most difficult to classify as indicated by the extremely low producer accuracies (Appendix B). Producer accuracy identifies the fraction of the correctly classified pixels in relation to all of the pixels of the testing sites. The user accuracy calculates the reliability of the class being a certain class. The bare ground/developed and the shrub/scrub classes were also deemed the least reliable due to the low user accuracies. Fortunately, the mangrove class had the highest user and producer accuracies and was thus very easy for GEE to classify and the results were very reliable. In-situ vegetation points helped establish more confidence in the supervised classification approach as well for the later study years. From 1995 to 2016, mangrove forest extent has risen and decreased multiple times with the largest decrease during the 2005 to 2010 increment (Appendix C & Table 4). Results show an overall decline in mangrove forest extent for the study period with a slight increase within the most recent year of 2015 to 2016 (Table 6 & Figure 4). Freshwater marsh has been the largest contributor to mangrove forest growth with saltwater marsh/sawgrass prairie class being the largest influence to a decline in mangrove forest extent ( Figure 5).  Identifying where the mangrove changes are is important to understanding how mangroves are changing. Much of the loss of mangrove forest has occurred along the saltwater marsh and freshwater marsh transition -the area extending most inward from the mangrove extent away from the coastline -and in the southwestern portion ( Figure 6). Growth of mangroves have occurred along the coastline and other waterbodies, with some growth along the saltwater and freshwater marsh transition zone ( Figure 6). Change maps within each study period are located in Appendix D. The periods of 2000 to 2005 and 2015 to 2016 have mangrove forest growth along the saltwater and freshwater marsh transition zone, while all other years experienced loss; the largest being during the 1995 to 2000 and 2005 to 2010 epochs (Appendix D). TerrSet's Land Change Modeler produced two important prediction maps: hard and soft. The hard prediction produced a forecasted map with the same categories as the input maps while soft prediction is essentially a map of the susceptibility of a landcover class to transition. By forecasting to the year 2030, Figure 7 indicates the changes that could potentially be seen if restoration efforts do not impact the mangrove extent within the park. The transition zones between saltwater and freshwater habitats exhibit the highest vulnerability. Mangroves are not particularly vulnerable in this scenario because the freshwater habitats are declining while the mangrove forests are expanding inward. However, if restoration efforts are to impact the park significantly, the areas of vulnerability shift to the mangrove forests and to the coastline (Figure 8). This is an expected outcome since this vulnerability is more balanced along the mangrove-marsh transition and displacing mangroves with freshwater marsh will take time. As freshwater is re-routed into the Northeastern section of the park, freshwater flows through the freshwater marsh/sawgrass prairie system and pushes saltwater further towards the coastline. This is predicted in figure 8 by the shift in mangrove forests as they shift towards the coastline.  Validation results of accuracy and skill measure for both forecasting scenarios were provided from the testing and training process that MLP performs. The skill measure represents the measured accuracy minus the accuracy expected by transition. Forecasted results that have little to no impact of restoration efforts had an accuracy rate of 70% and a skill measure of 0.66. The opposite scenario where restoration efforts do affect the mangrove extent measured an accuracy rate of 62% and a skill measure of 0.55. Tables 7 and 8 give an indepth breakdown of the skill per the modeled transitions. For both scenarios, the driver variables were very effective in establishing most of the transitions as explained by the high skill measure. However, saltwater marsh/sawgrass prairie to mangrove forest and mangrove forest to saltwater marsh/sawgrass prairie transitions had the lowest skill measure. This means that the driver variables used are not very effective at predicting the transition between these two sub-models. A reasonable cause to this low skill measure is from the combined class of the sawgrass prairie (a freshwater grass) and saltwater marsh resulting in an inadequate forecast for these two transitions. This is so because saltwater and sawgrass prairie are driven by different variables. Sawgrass prairie is influenced by freshwater movement into the area while saltwater marsh is driven by the presence of saltwater. "}, {"section_title": "Future Work", "text": "Studying the effects of restoration of the Everglades National Park is a highly complex and difficult task due to the high percentage of cloud cover in satellite images, inaccessibility to study sites, rapidly changing habitats, and effects of unpredictable natural disasters. Although this project was successful in creating a historical timeline of the land cover changes within the park, future work should consider using higher resolution imagery within GEE, such as the Sentinel-2 image collection, for increased land cover accuracy. Problematically, the elevation gradient within the Everglades is very low causing the accuracy of freely available Digital Elevation Models (DEMs) to be questionable. Producing a higher resolution DEM could capture this low gradient and improve the forecasting model results. Due to time constraints, the effects of sea level rise on the Florida Everglades was not included in the forecasting model. However, rising sea levels is an important factor that future research should consider when forecasting. In situ data would also increase the accuracy of the classification process as a comparable analysis can be done more thoroughly. One of the limitations to this study was that the training sites were limited within the 30 random sample grids. Expanding the random sample grids to the entire park would enable a higher confidence of the land cover classifications and improve the maps themselves."}, {"section_title": "Conclusions", "text": "Google Earth Engine API proved to be a reliable source for monitoring the extent of mangrove forest through the Everglades National Park. The supervised classification approach taken for the years 1995, 2000, 2005, 2010, 2015, and 2016 produced an overall accuracy of 97.7%. The changes seen between consecutive land cover maps can be used to delineate how mangrove forests are responding to new mitigation efforts of re-routing freshwater back into the park. Over the study period, mangroves have shown a general decrease. Forecasting reveals that if restoration efforts influence the mangrove extent, mangroves do shift backwards toward the coastline allowing for the growth of the freshwater marsh ecosystem. Areas of high vulnerability will be along the coastline where mangroves are likely to expand seaward. On the other hand, if restoration efforts fail to impact mangroves, the mangrove and marsh transition zone is the most susceptible to change in which mangroves will continue to encroach upon the land and reduce freshwater marsh habitat. This demonstrates that restoration efforts will impact the mangrove extent and freshwater habitats in one of the two scenarios. However, since mangroves have historically been declining along the mangrove and marsh transition, it is reasonable that this trend will continue into the year 2030 and that the restoration efforts will be seen to have a positive effect within the Everglades. This tool will help the NPS delineate targets for sustainable development goals of managing forests within the park. It can also be used for further analysis for distinguishing landcover characteristics in threatened forests around the globe. Carrie Kelley for facilitating partner interactions, managing deliverables, and for their unwavering encouragement. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reflect the views of the National Aeronautics and Space Administration. This material is based upon work supported by NASA through contract NNL11AA00B and cooperative agreement NNX14AB60A. Content Innovation #5 Brochure Emailed to tiffani.n.miller@nasa.gov with filename 2016Fall_LaRC_EvergladesEcoII_Brochure"}, {"section_title": "Content Innovation #3 Inline Supplementary", "text": ""}, {"section_title": "Appendices", "text": "Appendix A: Land Cover Maps for Each Epoch.             "}]