[{"section_title": "Abstract", "text": "Mounting evidence has firmly established that low levels of cardiorespiratory fitness (CRF) are associated with a high risk of cardiovascular disease, all-cause mortality, and mortality rates attributable to various cancers. A growing body of epidemiological and clinical evidence demonstrates not only that CRF is a potentially stronger predictor of mortality than established risk factors such as smoking, hypertension, high cholesterol, and type 2 diabetes mellitus, but that the addition of CRF to traditional risk factors significantly improves the reclassification of risk for adverse outcomes. The purpose of this statement is to review current knowledge related to the association between CRF and health outcomes, increase awareness of the added value of CRF to improve risk prediction, and suggest future directions in research. Although the statement is not intended to be a comprehensive review, critical references that address important advances in the field are highlighted. The underlying premise of this statement is that the addition of CRF for risk classification presents health professionals with unique opportunities to improve patient management and to encourage lifestyle-based strategies designed to reduce cardiovascular risk. These opportunities must be realized to optimize the prevention and treatment of cardiovascular disease and hence meet the American Heart Association's 2020 goals.\nM ounting evidence over the past 3 decades has firmly established that low levels of cardiorespiratory fitness (CRF) are associated with a high risk of cardiovascular disease (CVD) and all-cause mortality, as well as mortality rates attributable to various cancers, especially of the breast and colon/digestive tract. [1] [2] [3] [4] Importantly, improvements in CRF are associated with reduced mortality risk.\n5 Although CRF is now recognized as an important marker of cardiovascular health, it is currently the only major risk factor not routinely assessed in clinical practice.\nIn 2013, the American Heart Association and the American College of Cardiology jointly released new guidelines for the prevention and treatment of coronary artery disease.\n6 Although CRF is the fourth-leading risk factor for CVD and has long been established as a significant prognostic marker, 7 it was excluded from the risk calculator. The authors of the guidelines noted that the evidence that CRF would enhance risk classification was inconclusive, and thus, the added contribution of CRF to determine CVD risk was uncertain. There is, however, a large body of epidemiological and clinical evidence demonstrating not only that CRF is a potentially stronger predictor of mortality than established risk factors such as smoking, hypertension, high cholesterol, and type 2 diabetes mellitus (T2DM), but that the addition of CRF to traditional risk factors significantly improves the reclassification of risk for adverse outcomes."}, {"section_title": "M", "text": "ounting evidence over the past 3 decades has firmly established that low levels of cardiorespiratory fitness (CRF) are associated with a high risk of cardiovascular disease (CVD) and all-cause mortality, as well as mortality rates attributable to various cancers, especially of the breast and colon/digestive tract. [1] [2] [3] [4] Importantly, improvements in CRF are associated with reduced mortality risk. 5 Although CRF is now recognized as an important marker of cardiovascular health, it is currently the only major risk factor not routinely assessed in clinical practice.\nIn 2013, the American Heart Association and the American College of Cardiology jointly released new guidelines for the prevention and treatment of coronary artery disease. 6 Although CRF is the fourth-leading risk factor for CVD and has long been established as a significant prognostic marker, 7 it was excluded from the risk calculator. The authors of the guidelines noted that the evidence that CRF would enhance risk classification was inconclusive, and thus, the added contribution of CRF to determine CVD risk was uncertain. There is, however, a large body of epidemiological and clinical evidence demonstrating not only that CRF is a potentially stronger predictor of mortality than established risk factors such as smoking, hypertension, high cholesterol, and type 2 diabetes mellitus (T2DM), but that the addition of CRF to traditional risk factors significantly improves the reclassification of risk for adverse outcomes.\nThe purpose of this statement is to review current knowledge related to the association between CRF and health outcomes, increase awareness of the added value of CRF to improve risk prediction, and suggest future directions in research. Although the statement is not intended to be a comprehensive review, critical references that address important advances in the field are highlighted. The underlying premise of this statement is that the addition of CRF for risk classification presents health professionals with unique opportunities to improve patient management and to encourage lifestylebased strategies designed to reduce cardiovascular risk. These opportunities must be realized to optimize the prevention and treatment of CVD and hence meet the American Heart Association's 2020 goals. 8 "}, {"section_title": "CRF AS A PREDICToR oF HEALTH oUTCoMES", "text": "CRF reflects the integrated ability to transport oxygen from the atmosphere to the mitochondria to perform physical work. It therefore quantifies the functional capacity of an individual and is dependent on a linked chain of processes that include pulmonary ventilation and diffusion, right and left ventricular function (both systole and diastole), ventricular-arterial coupling, the ability of the vasculature to accommodate and efficiently transport blood from the heart to precisely match oxygen requirements, and the ability of the muscle cells to receive and use the oxygen and nutrients delivered by the blood, as well as to communicate these metabolic demands to the cardiovascular control center. Clearly, CRF is directly related to the integrated function of numerous systems, and it is thus considered a reflection of total body health. About half of the variance in CRF is considered to be attributable to heritable factors 9 ; similarly, the contribution of inherited factors to the response of CRF to physical activity approximates 45% to 50%. 10 It is noteworthy that these heritability estimates are similar in magnitude to other CVD risk factors, including, for example, insulin, glucose, lipoproteins, blood pressure, and high-sensitivity C-reactive protein. 11 CRF can be measured directly, expressed as maximal oxygen consumption (V ⋅ o 2 max), or estimated from is more objective and precise, but because it is easier to obtain, estimated CRF derived from the peak work rate is the more common expression of fitness, particularly in epidemiological studies involving large populations. Numerous studies have reported that both measured and estimated CRF strongly predict health outcomes; in the following overview of these studies, CRF refers to estimated fitness unless otherwise stated."}, {"section_title": "oVERVIEw oF CRF AND HEALTH oUTCoMES", "text": "Since the late 1950s, numerous scientific reports have examined the separate relationships between physical activity, CRF, and all-cause mortality. The past 2 decades in particular have seen an exponential growth in the number of studies assessing the association between measures of CRF, mortality, and other health outcomes. [12] [13] [14] [15] [16] A consistent finding in these studies was that after adjustment for age and other risk factors, CRF was a strong and independent marker of risk for cardiovascular and all-cause mortality. This observation has been made in healthy men and women, those with suspected or known CVD, and those with comorbid conditions, including obesity, T2DM, hypertension, and lipid abnormalities. [12] [13] [14] [15] [16] [17] [18] [19] [20] [21] [22] [23] In a growing number of studies, CRF has been demonstrated to be a more powerful predictor of mortality risk than traditional risk factors such as hypertension, smoking, obesity, hyperlipidemia, and T2DM. In addition, CRF has been shown to be a more powerful predictor of risk than other exercise test variables, including ST-segment depression, symptoms, and hemodynamic responses. 13, 16, 18, [23] [24] [25] [26] [27] [28] [29] [30] Moreover, numerous recent studies have expressed CRF in the context of survival benefit per metabolic equivalent (MET; a multiple of the resting metabolic rate approximating 3.5 mL·kg −1 ·min −1 ); selected studies are presented in Table  1 . These studies are noteworthy in that each 1-MET higher CRF (a small increment achievable by most individuals) was associated with considerable (10%-25%) improvement in survival.\nAlthough a variety of indirect estimates or surrogates for CRF have been associated with health outcomes dating back to the 1950s, Blair and colleagues 2 published a seminal study in 1989 in which fitness was estimated using maximal treadmill testing in >13 000 asymptomatic men and women. Participants were followed up for 110 482 person-years (averaging >8 years) for all-cause mortality. Key results from this analysis are presented in the Figure. Age-adjusted mortality rates were lowest (18.6 per 10 000 person-years) among the most fit and highest (64.0 per 10 000 person-years) among the least fit men; the corresponding mortality rates among women were 8.5 and 39.5 per 10 000 person-years, respectively. These findings closely parallel an earlier report among asymptomatic men from the Lipid Research Clinics (LRC) Mortality Follow-up, 39 in which each 2-standard deviation decrement in CRF (roughly 2-3 METs) was associated with a 2-to 5-fold higher coronary heart disease (CHD) or all-cause death rate. Numerous research groups worldwide have reported similar findings over the past 2 decades. These follow-up studies included subjects with and without CVD, T2DM, obesity, and lipid abnormalities and of varying ethnicities, as well as women who were apparently healthy at the time of their fitness evaluation. [14] [15] [16] [17] [18] [19] [20] [21] [22] [23] [24] [25] [26] [27] [28] [29] [30] Gulati et al 23 suggested that the strength of exercise capacity in predicting risk of mortality was even greater among women than men, demonstrating a 17% lower risk for every 1-MET increase in CRF. Similarly, Nes et al 38 reported a 21% lower risk for every 1-MET increase in CRF for both sexes in a large healthy population followed up for an average of 24 years. Furthermore, in the LRC Mortality Follow-up trial, nearly 3000 asymptomatic women underwent maximal exercise testing and were followed up for up to 20 years. 28 A 20% lower survival was observed for every 1-MET decrement in CRF. This study also highlighted the relative limitations of ischemic electrocardiographic responses in predicting cardiovascular and all-cause mortality among women."}, {"section_title": "ASSoCIATIoN BETwEEN CRF AND HEALTH oUTCoMES", "text": "In recent years, the association between CRF and a wide range of health outcomes has also been addressed in varied populations, for example, patients referred for exercise testing for clinical reasons. 16, 18, 19, 22, [25] [26] [27] 40, 41 In a study performed among US veterans, 6213 men underwent maximal exercise testing for clinical reasons and were followed up for a mean of 6.2 years. 18 Subjects were classified into 5 categories by quintiles of CRF. After adjusting for age, the largest gains in survival were noted when comparing the lowest to the next lowest CRF groups. Among apparently healthy subjects and those with CVD, the least fit individuals (<5 and <6 METs for subjects with and without CVD, respectively) had >4-fold increased risk of all-cause mortality compared with the most fit. Importantly, an individual's CRF level was a stronger predictor of mortality than established risk factors such as smoking, hypertension, high cholesterol, and T2DM. Over the past several years, other cohorts, such as those from the Cleveland Clinic 25, 26, 40 and the Mayo Clinic, 29, 41 as well as numerous ongoing follow-up trials in the United States and Europe, 12, 15, 16, 43, 44 have documented the importance of CRF as a predictor of mortality among clinically referred populations. These clinically based studies confirm the early observations of Blair et al, 2 Framingham, 44 and the LRC Trial 28,39 among asymptomatic populations, underscoring the fact that the CRF level has a strong inverse association with the incidence of all-cause mortality. The strength of the association between CRF and mortality was further reinforced in a meta-analysis by Kodama et al. 16 Data were extracted from 33 studies, including nearly 103 000 participants. Compared with subjects in the most fit tertile, those with low CRF had a 70% and 56% higher risk for allcause and cardiovascular mortality, respectively. Across all studies, 13% and 15% reductions in cardiovascular and all-cause mortality, respectively, were observed per 1-MET increase in exercise capacity. This meta-analysis also confirmed the previous finding that the greatest mortality benefits occur when progressing from the least fit and the next least fit group; lesser improvements in health outcomes were noted when individuals in the moderate-to high-fit groups were compared.\nMany recent studies have also demonstrated that low CRF is a stronger predictor of risk for adverse cardiovascular outcomes than traditional risk factors, including lipid abnormalities, hypertension, insulin resistance, obesity, and smoking. 12, 13, [16] [17] [18] [19] [20] [21] 24 Despite these observations, the importance of CRF in the risk paradigm has historically received less attention from health professionals and CVD specialists. Moreover, when an exercise test is performed, there has been the tendency to focus on ischemic ST-segment displacement and the potential need for coronary revascularization without considering the prognostic value of CRF. 24, 29, 30 Reasons for the inverse association between CRF and mortality are not fully understood. Possible explanations include the fact that fitter people tend to have more cardioprotective cardiovascular risk profiles (mediated in part through higher activity levels), autonomic tone (potentially reducing arrhythmogenic risk), lower risk for thrombotic events, and improved indices of endothelial function. Numerous studies have documented that biological mechanisms for disease are favorably influenced by CRF. For example, in a cohort aged 20 to 90 years (n=4631), in which directly measured CRF was determined, women and men below the sex-specific median for CRF (women <35.1 mL·kg −1 ·min −1 ; men <44.2 mL·kg −1 ·min −1 ) were 5 and 8 times, respectively, more likely to have a cluster of cardiovascular risk factors than those in the highest quartile of CRF. 45 Additionally, each 5-mL·kg −1 ·min −1 lower level of CRF corresponded to a 56% higher odds of cardiovascular risk factors. Similarly, Arsenault et al, 46 in a cross-sectional evaluation of 169 healthy men without T2DM, noted that those in the lowest tertile of CRF had higher triglyceride levels, higher apolipoprotein B, and higher total cholesterol/ high-density lipoprotein ratios than those in the highest tertile of CRF. Others have shown that higher CRF is associated with lower visceral adiposity, improved insulin sensitivity, lower levels of inflammation, more favorable lipid and lipoprotein profiles, and lower blood pressure.\n20,46-48 Kawano et al 48 performed a randomized trial of exercise training and dietary intervention in 217 at-risk men and women and reported that lipid profiles improved with increases in CRF. Numerous recent studies have observed that C-reactive protein and other inflammatory markers are also lower among more fit individuals than among those who are less fit."}, {"section_title": "15,47", "text": ""}, {"section_title": "DoSE-RESPoNSE ASSoCIATIoN BETwEEN CRF AND HEALTH oUTCoMES", "text": "The observations cited above highlight the fact that exceptionally high CRF levels are not necessary to provide significant health benefits. Individuals with a CRF level <5 METs tend to have a particularly high risk for mortality, whereas many epidemiological studies have observed that CRF levels >8 to 10 METs are associated with relative protection. 14, 16, [18] [19] [20] 42 However, a consistent observation is that the largest benefits occur between the least fit and the next least fit group of individuals studied. Stated differently, health benefits are most apparent at the low end of the CRF continuum. Although studies vary, this is generally the case for both all-cause and CVD mor-groups, higher CRF is associated with reduced risk. This has implications for physical activity counselling, given that considerable benefits are likely to occur by encouraging the most sedentary or low-fit people to engage in modest activity levels. Simply stated, every effort should be undertaken to increase physical activity levels in sedentary adults (ie, some exercise is better than none). This might initially equate to increasing physical activity and exercise habits in previously sedentary individuals who continue to fall below current recommendations (guidelines). Over time, an individual can be \"up-titrated,\" approaching or exceeding the physical activity recommendations. This pragmatic approach could serve to enhance compliance with increased physical activity and exercise training, because a sedentary person who has been accustomed to minimal levels of physical activity for decades might perceive the immediate adoption of an active lifestyle to the level of current recommendations as unattainable. When counselling sedentary people, it is important to emphasize that substantive gains in health can be achieved with relatively modest increases in physical activity."}, {"section_title": "CRF AND CVD MoRTALITY IN ASYMPToMATIC PoPULATIoNS", "text": "Risk prediction in the general population is challenging, because most people are at low risk. Nes and colleagues 38 found that CRF in healthy men (n=18 348) and women (n=18 764) <60 years of age at baseline was inversely associated with CVD mortality. Mean follow-up time was 24 years. Men <60 years of age at baseline and with a CRF below 85% of the age-expected value had an approximate 2-fold risk of dying of CVD compared with those at or above the age-predicted value. For each 1-MET increase in exercise capacity, the risk of CVD mortality was 21% lower in both men and women. Women below 85% of the age-predicted CRF had a 24% higher risk of CVD mortality. Similarly, Artero et al 51 evaluated 43 356 adults (21% women) aged 20 to 84 years who were free of baseline history of CVD or cancer and followed them up for a median of 14.5 years. Both measured and estimated CRF were inversely associated with risk for fatal and nonfatal CVD events in men and for nonfatal CVD events in women. The risk reduction per 1-MET increase in measured CRF was 17% for fatal CVD and 10% for nonfatal CVD in men and 5% for fatal CVD and 23% for nonfatal CVD in women. Comparable findings have been reported in ongoing follow-up studies from cohorts including the Veterans Exercise Testing Study, [17] [18] [19] 22 the Aerobics Center Longitudinal Study (ACLS), 2, 5, 13, 20, 51 and the Henry Ford Exercise Testing Project. [52] [53] [54] Importantly, the overall discriminative ability of CRF in these studies is comparable to that normally obtained in widely used risk models, such as the Framingham risk score and European SCORE (Systematic Coronary Risk Evaluation) algorithm. 55, 56 For example, Laukkanen et al 57 reported that a 1-MET increment in CRF and a 1% increment in European risk score were associated with 16% and 15% changes, respectively, in risk for all-cause mortality. Subjects with high European or Framingham score and low peak V ⋅ o 2 represented the highest risk group."}, {"section_title": "Conclusions and Recommendations: CRF as a Predictor of Health outcomes", "text": "• CRF is as strong a predictor of mortality as established risk factors such as cigarette smoking, hypertension, high cholesterol, and T2DM.\n• A CRF level <5 METs in adults is associated with high risk for mortality; CRF levels >8 to 10 METs are associated with increased survival. • More than half the reduction in all-cause mortality occurs between the least fit (eg, CRF <5 METs) group and the next least fit group (eg, CRF 5-7 METs).\n• The influence of race on the relationship between CRF and health outcomes requires further investigation.\n• Small increases in CRF (eg, 1-2 METs) are associated with considerably (10% to 30%) lower adverse cardiovascular event rates.\n• Efforts to improve CRF should become a standard part of clinical encounters (eg, an accepted \"vital sign\")."}, {"section_title": "CRF AS A PREDICToR oF oTHER CVD oUTCoMES", "text": "Beyond cardiovascular and all-cause mortality, habitual physical activity and CRF have been linked to both cardiovascular and noncardiovascular surgical outcomes, including the timing of cardiac transplantation in ambulatory patients with heart failure (HF), their risk stratification, and the likelihood of HF hospitalization in later life, as well as the incidence of stroke in older adults. The prognostic value of CRF, including peak V favor of more advanced diagnostic imaging procedures (eg, exercise stress echocardiography, exercise myocardial perfusion imaging, pharmacological testing). 58 This section reviews clinically relevant epidemiological and observational studies, with specific reference to possible biological mechanisms underlying these associations, or the lack thereof."}, {"section_title": "CRF as a Preoperative Predictor of Surgical Risk", "text": "Recent studies suggest that in addition to being a strong predictor of cardiovascular and all-cause mortality in both asymptomatic and clinically referred populations, CRF could be especially helpful in the preoperative risk assessment of patients undergoing cardiovascular and noncardiovascular surgery, 58 predicting surgical complications and short-term outcomes in patients subjected to abdominal aortic aneurysm repair, [59] [60] [61] hepatic transplantation, 62, 63 lung cancer resection, 64 upper gastrointestinal surgery, 65, 66 intra-abdominal surgery, 67, 68 bariatric surgery, 69 and coronary artery bypass grafting. 70 In addition, when patients with coronary artery disease who had to wait in the hospital for coronary artery bypass grafting were randomized into an exercise training group, outcomes were superior to those in the standard care group, because a reduced rate of postoperative complications and shorter hospital stays were observed (Table 2) . 71 Nine of the 12 studies reviewed sufficiently investigated the predictive value of preoperative CRF for postoperative complications, and 8 found CRF to be a valid outcome indicator. Fewer studies reported investigating the role of the anaerobic or ventilatory threshold (a submaximal measure of CRF) in this regard, but in the 6 that did so adequately, 4 found it to be helpful in gauging surgical risk. Clearly, the level of preexisting comorbid conditions tolerated for surgery can affect the predictive value of directly measured CRF. Moreover, the weaker support for the lactate threshold as a predictor of short-term surgical outcomes might be a reflection of the submaximal nature of this variable or its indirect assessment via concomitant ventilatory responses. 58 There is no firmly identified causal mechanism in the literature that directly links a higher CRF or anaerobic threshold with reduced postoperative complications. One possible explanation is that fitter patients (eg, those with elevated CRF) are simply better able to cope with the aerobic and myocardial demands created by the trauma of major surgery. A lower level of CRF could be associated with greater numbers and greater severity of unhealthy comorbid conditions that individually or collectively could increase mortality. Another possible explanation is that a low CRF identifies a subset of patients who are more difficult to operate on, requiring longer operative and intubation times, or those characterized by a high-risk, proinflammatory state that could be related to the development of heightened postoperative complications. 69 "}, {"section_title": "CRF and HF", "text": "HF represents an increasingly important health problem because of the aging population, improved survival rate after acute CVD events, and the escalating costs attributable to the exacerbation of symptoms and associated serial hospitalizations, despite optimal medical therapy. CRF appears to have independent and additive value in the risk stratification of this escalating patient subset, as well as for the development of HF at later ages. In a 20-year follow-up of >44 000 men without a history of CVD, CRF was strongly and inversely associated with HF mortality, regardless of the number of HF risk factors present, with low CRF (unfit) and obesity serving as the strongest risk factors. 49a In a seminal report, Mancini et al 72 used directly measured CRF, specifically peak V ⋅ o 2 , to clarify the optimal timing of heart transplantation in ambulatory patients with HF. Among those patients not accepted for heart transplantation, CRF >14 mL·kg "}, {"section_title": "·min", "text": "−1 yielded markedly lower survival. These data have had profound implications in assessing the timing of heart transplantation. Since this landmark report, newer studies have provided additional support for CPX as a primary assessment in patients with HF. [73] [74] [75] [76] CPX assessment in patients with HF has evolved to a multivariate model that incorporates aerobic capacity, ventilatory efficiency, hemodynamics, heart rate (HR) and electrocardiogram, and subjective symptoms, which allows for a 3-dimensional perspective of CRF and improved prognostic resolution. As an alternative approach when CPX is not feasible, Hsich et al 77 sought to determine whether treadmill exercise time, a correlate of CRF, could be of value as an initial prognostic screening tool in patients with impaired systolic function (left ventricular ejection fraction <40%) for the prediction of all-cause mortality. During a mean follow-up of 5 years, 742 of 2231 patients (33%) died. Using a modified Naughton treadmill protocol, for each 1-minute decrease in exercise test duration, there was a 7% increased hazard of death. Interestingly, even among patients with an estimated CRF >14 mL·kg\n, that is, those classified as lower risk, a reduced treadmill exercise time was associated with markedly worse outcomes. These findings suggest that the simple measurement of treadmill exercise time provides a valuable initial prognostic screening tool in patients with impaired left ventricular ejection fraction.\nTo clarify the effects of CRF on HF risk, researchers recently linked individual subject data from the ACLS with Medicare claims. 78 The study population had a low prevalence of traditional risk factors and included 19 485 subjects (78.8% men) who received Medicare coverage over a 10-year span (1999) (2000) (2001) (2002) (2003) (2004) (2005) (2006) (2007) (2008) (2009) ). Midlife CRF (at mean age 49 years) was estimated from the achieved Balke treadmill time, expressed as METs, and related to HF hospitalizations after age 65 years. After adjustment for traditional risk factors, higher midlife CRF was associated with a lower risk for HF hospitalization. In fact, each 1-MET higher level in midlife CRF was associated with a 17% lower risk for HF hospitalization in later life. Collectively, these data suggest that the increased HF risks associated with low CRF could be favorably modified in midlife, irrespective of antecedent HF risks."}, {"section_title": "CRF and Risk of Stroke", "text": "Although cardiovascular and stroke prevention strategies are commonly recommended for middle-aged and older adults, including aggressive risk factor modification (eg, hypertension, T2DM, cholesterol) via lifestyle changes and pharmacotherapies, as well as efforts to reduce or eliminate cigarette smoking, alcohol consumption, and obesity, 79 limited data are available regarding the potential prophylactic role of CRF in reducing the incidence of cerebrovascular events. Nevertheless, according to a 10.9-year follow-up study of older men, there was a strong, inverse dose-response association between time spent walking and risk of stroke, independent of walking pace (intensity) and established and novel risk factors. 80 More than a decade ago, researchers examined the association between CRF and stroke mortality in 16 878 apparently healthy men aged 40 to 87 years using the ACLS database. 81 Each subject initially underwent a complete medical examination that included a peak or symptom-limited treadmill exercise test to volitional fatigue. Subjects were classified into 3 CRF groups (ie, low fit, moderate fit, high fit), expressed as METs, based on the attained treadmill speed, grade, and duration. Over an average followup of 10 years, men in the highest CRF group (13.1±1.4 METs) had a 68% lower risk of stroke death than men who were in the lowest CRF group (8.5±1.0 METs). However, men in the moderate CRF group (10.5±1.0 METs) had nearly the same stroke mortality, corresponding to a 63% lower risk. The inverse association between CRF and stroke mortality remained after adjustment for potential confounding variables, including cigarette smoking, alcohol consumption, overweight/obesity, hypertension, T2DM, and family history of CVD. These findings, like those for CHD, suggest an \"asymptote of gain\" beyond which further improvements in CRF were associated with little or no additional stroke survival benefit.\nCollectively, these data, primarily derived from epidemiological and observational studies, suggest that interventions aimed at reducing the morbidity and mortality associated with stroke should consider efforts to improve CRF in middle-aged and older adults. Nevertheless, additional clinical trials and supporting biological plausibility data are needed before we can unequivocally state that these cardioprotective associations truly imply causation."}, {"section_title": "Conclusions: CRF as a Predictor of other CVD outcomes", "text": "• CRF strongly predicts outcomes across a wide spectrum of CVD outcomes, including those related to stroke, HF, and surgery.\n• Optimizing CRF prior to surgical interventions (termed \"prehabilitation\") improves outcomes including surgical risk, mortality, and function in the postsurgical period."}, {"section_title": "APPLICATIoN oF CRF To RECLASSIFICATIoN oF CARDIoVASCULAR RISK", "text": "Numerous studies have reported that adding CRF to a single or several established risk factors for CVD substantially improves the precision of risk prediction for CVD morbidity or mortality. 8, [12] [13] [14] [15] [16] [17] [18] [19] [82] [83] [84] However, although the evidence that CRF is inversely associated with mortality is strong and convincing, it does not necessarily mean that CRF directly enhances CVD mortality risk prediction. For CRF to truly be a novel risk marker, it must improve risk prediction beyond traditional markers. 85 There exists no single statistical test that provides all the information necessary to evaluate a new biomarker, and a combination of ≥2 statistical approaches has been suggested. [85] [86] [87] [88] [89] Recent studies suggest that the net reclassification improvement (NRI) and the integrated discrimination improvement can provide important insights beyond traditional statistical tools (eg, hazard ratios, odds ratios, C-index) when estimating risk for adverse outcomes. These tools more directly address the extent to which a given risk marker adds to existing markers to predict adverse outcomes. NRI indicates whether the addition of a biomarker correctly and significantly alters risk classification; it is defined as the net change in risk among those who do and do not experience an event. 86, 88 Integrated discrimination improvement determines whether the addition of a new biomarker significantly improves risk discrimination, reflecting the improvement in true-positive rates minus the worsening of false-positive rates. [86] [87] [88] [89] Several recent studies have used these metrics to help determine the additive value of CRF to traditional risk markers (Table 3) .\nWickramasinghe et al 95 reported that the addition of CRF to a traditional risk prediction model (including age, body mass index, systolic blood pressure, T2DM, total cholesterol, and smoking) improved 30-year risk prediction in 13 627 men and 2906 women without known CVD at baseline. A low level of CRF (defined as an estimated peak V In men, at 10 and 25 years of follow-up, the addition of CRF to the traditional risk model resulted in NRIs for CVD mortality of 12.1% and 4.1%, respectively. This suggests that 12.1% and 4.1% of subjects were correctly reclassified for CVD mortality beyond traditional risk factors at these time points. The corresponding relative integrated discrimination improvements were 29% and 11.1% at 10 and 25 years. The addition of CRF to the traditional risk model in women resulted in an NRI of 13.1% and relative integrated discrimination improvement of 13.5% at the 25-year follow-up, where-evaluated whether CRF improved CVD mortality risk prediction in 17 669 women and 14 650 men aged 35 to 70 years who took part in health surveys in England and Scotland between 1994 and 2003. During a mean follow-up of 9 years, NRIs for CVD mortality were 27.2% and 21.0% for men and women, respectively. Myers et al 92 followed up ≈7000 men referred for exercise testing for clinical reasons for a mean of 10 years and observed that the addition of CRF to a model that included traditional risk factors resulted in an NRI of 42.8%. Holtermann et al 94 reported an NRI of 30.5% for CVD mortality and an NRI of 24.5% by adding selfreported CRF to traditional risk factors among 8936 men and women in the Copenhagen City Heart Study."}, {"section_title": "APPLICATIoN oF CRF To RISK PREDICTIoN MoDELS", "text": "Despite the aforementioned evidence linking CRF to longevity, it is not included in any of the currently used CVD risk prediction models from health authorities or health organizations throughout the world. A principal argument against the use of CRF in CVD risk-score models could be its precise quantification or the lack of evidence from randomized clinical trials, which would need to include all age groups and both sexes and use hard end points such as CVD morbidity and mortality. Although this limitation also applies to cigarette smoking, few people would dispute that smoking increases CVD risk. Nevertheless, data from large population-based studies and small-scale randomized clinical trials in selected populations suggest that CRF should be included in future CVD risk prediction models.\nNumerous studies have assessed CRF in the context of established risk prediction models such as the Framingham risk score. ). The study also stratified subjects into low, moderate, or high Fram- ingham risk score groups at baseline and found that CRF was significantly protective across the range of Framingham risk scores."}, {"section_title": "Conclusions: Application of CRF to Risk Prediction Models", "text": "• The addition of CRF to traditional risk factors significantly improves reclassification of risk for adverse health outcomes.\n• Traditional risk scores (such as Framingham risk score) are enhanced by adding CRF."}, {"section_title": "SERIAL CHANGES IN CRF AND RISK PREDICTIoN", "text": "The impact of CRF as a biomarker is valuable not only to determine a person's risk for future adverse clinical outcomes, but also to optimize treatment strategies. Determining CRF on a serial basis is valuable in gauging the effectiveness of treatment strategies, including recommendations for participation in physical activity. Blair et al 31 studied 9777 men given 2 preventive medical examinations, each of which included assessment of CRF by maximal exercise testing, a mean of 5.1 years apart. The highest age-adjusted all-cause death rate was observed in men who were unfit at both examinations (122.0/10 000 man-years); the lowest death rate was observed in those who were physically fit at both examinations (39.6/10 000 man-years). Men who improved from unfit to fit between the first and second examination had a reduction in mortality risk of 44% relative to men who remained unfit at both examinations. Lee et al 97 reported that in relatively fit men (n=14 345, average estimated CRF 41.7 mL·kg −1 ·min −1 ), maintaining or improving CRF from baseline to a second examination 6 years later was associated with 27% and 42% reduced risks for CVD and all-cause mortality, respectively, during an 11.4-year follow-up period compared with those whose CRF decreased over the same period. Importantly, men who had a reduction in CRF between examinations were at increased risk of dying of CVD regardless of changes in body mass index. Every 1-MET increase in CRF was associated with a 19% lower risk of CVD mortality. Similarly, Kokkinos et al 98 reported that unfit individuals whose CRF improved had a 35% lower mortality risk during a median follow-up period of 8.1 years compared with those who remained unfit. The largest randomized trial of exercise training in HF patients, HF-ACTION (Heart Failure and a Controlled Trial Investigating Outcomes of Exercise Training), reported that every 6% increase in CRF (measured peak V ⋅ o 2 ) over 3 months was associated with a 4% lower risk of cardiovascular mortality or cardiovascular hospitalization and an 8% lower risk of cardiovascular mortality or HF hospitalization after adjustment for potential confounding variables. 99 "}, {"section_title": "Conclusions: Serial Changes in CRF and Risk Prediction", "text": "• CRF is a variable that is responsive to therapy, and serial measures of CRF are valuable in risk stratification. Individuals whose CRF increases between examinations have a lower risk of adverse health and clinical outcomes than those whose CRF decreases, and this should be communicated to patients."}, {"section_title": "EMERGING RoLE oF CRF AND ITS ASSoCIATIoN wITH oTHER HEALTH oUTCoMES", "text": "Although is it well documented that higher levels of CRF are associated with lower CVD risk, over the past 2 decades numerous other health benefits have been linked to higher levels of CRF."}, {"section_title": "CRF, Dementia, Alzheimer Disease, and Psychological Stress", "text": "Several studies have linked higher levels of CRF to a reduced risk of developing both dementia and Alzheimer disease. [100] [101] [102] [103] Defina et al 100 reported that people in the highest quartile of CRF had a 36% lower risk of developing dementia than those in the lowest quartile. Although the mechanisms whereby the brain is favorably impacted by regular exercise or increased CRF are incompletely understood, several have been suggested. [101] [102] [103] [104] [105] [106] [107] [108] [109] [110] [111] [112] [113] [114] [115] [116] [117] Higher levels of CRF are associated with lower measures of anxiety and symptoms of depression. 118, 119 In addition, regular exercise has been shown to reduce symptoms of anxiety and depression, 120, 121 whereas in subjects who survived a suicide attempt, mountain hiking appeared to confer modest improvements in hopelessness, depression, and suicide ideation."}, {"section_title": "122,123", "text": ""}, {"section_title": "CRF and Prediabetes, T2DM, and Metabolic Syndrome", "text": "Skeletal muscle is the largest consumer of glucose within the human body. When it is functioning properly, more glucose is removed from the blood for a given amount of insulin. This not only helps maintain normal levels of blood glucose but spares the pancreas from having to overproduce insulin. Numerous studies have reported inverse associations between CRF and the risk of developing prediabetes, metabolic syndrome, and T2DM."}, {"section_title": "Importance of CRF in Clinical Practice", "text": "Circulation. "}, {"section_title": "CLINICAL STATEMENTS AND GUIDELINES", "text": "vilinear in nature. 124, 125 Among people with moderate to high levels of CRF, there are only small differences in rates of T2DM between each CRF level. However, in the lower range of CRF, small increments are associated with large differences in T2DM risk. Thus, the lowest levels of CRF are associated with disproportionate levels of risk. Similarshaped CRF risk curves are found for metabolic syndrome and markers of inflammation. 126, [128] [129] [130] [131] [132] These findings reinforce the observation that physical activity interventions targeting the least fit individuals have the largest benefit.\nThe view that CRF represents more than simply physical activity habits when evaluating metabolic risk has been supported by a series of reports using specially trained rats. To examine the relation between intrinsic CRF and metabolic health, Britton and colleagues [133] [134] [135] bred rats for either low or high running capacity. Low-CRF rats had higher blood pressures, visceral adiposity, fasting glucose, insulin, triglycerides, and free fatty acid levels. In contrast, highly fit rats had considerably higher levels of CRF, skeletal muscle oxidative enzyme capacity, and proteins such as PGC-1α, known to be integral to mitochondrial content and function. [133] [134] [135] The investigators suggested that these \"observations support the notion that impaired regulation of oxidative pathways in mitochondria may be the common factor linking reduced CRF to cardiovascular and metabolic risk.\"\ntesting is typically obtained from the achieved treadmill speed/grade and duration or the peak attained cycle ergometer workload (watts); CRF is then estimated by use of established prediction equations that convert the highest workload attained to exercise time, for some standardized protocols. Although estimating CRF from standardized exercise test protocols is quite common, only a few studies have established these prediction equations. Examples of equations from some commonly used protocols are shown in Table 5 . Many of the early studies with the incremental Bruce, 154 Balke, 155 and modified Balke 156 treadmill protocols had relatively small sample sizes. The Ball State University Bruce ramp equation 157 was developed from a slightly larger group of 698 apparently healthy men and women.\nThere is inherent error in using these prediction equations, particularly when the protocol selected for exercise testing is too aggressive given an unfit person's limited physiological capacity (eg, Bruce protocol in a patient with HF). Myers et al 159 evaluated the protocol used to predict CRF from peak work rate in 41 men during an individualized ramp protocol, demonstrating a significant reduction in prediction error compared with conventional, more aggressive incremental exercise test protocols (Table 5) . Another critical limiting factor for estimating peak V ⋅ o 2 from treadmill protocols, either from test time or peak work rate, is the common practice of allowing patients to hold handrails while walking/ running. This practice allows subjects to extend time on the treadmill and potentially achieve a higher work rate, 160 but with increased prediction error. McConnell et al 158 developed a regression equation to predict CRF (Table 5 ) using the Bruce treadmill protocol in 128 men who were allowed handrail support, but not gripping. In summary, selection of a protocol that best matches a person's physiological or functional capacity (eg, Bruce for athletes and Ramp for HF) while minimizing handrail use during treadmill testing can significantly reduce the error in predicting CRF.\n, maximal oxygen consumption;\n, peak somatic oxygen consumption;\n, velocity associated with\n; and W, watts.\n*All increases are statistically significant except those indicated as NS. †Total work between groups was held constant. ‡Significant difference from the lowest-intensity group. ) for all subjects. In this study, women in the 3 physical activity groups trained at HRs equal to 50% peak/maximal V ⋅ o 2 but with different physical activity amounts, and the increases in CRF were 0.6, 0.9, and 1.9 mL·kg\n(or 4.2%, 6.2%, and 8.2%) for programs requiring 4, 8, and 12 kcal/kg body weight per week, respectively. Thus, at this moderate absolute intensity, there was a dose effect for physical activity amount. Also, in the 3 physical activity training groups, the percentage of participants who demonstrated a meaningful improvement in CRF increased as the amount of physical activity increased. Other studies in participants with low baseline CRF have shown significant increases in CRF with physical activity of moderate intensities and bout durations in middle-aged overweight women 240 and in overweight men and women, 226 as well as with different modes of exercise (aerobic and resistance) in older women with abdominal obesity. 232 Murphy et al 271 conducted a meta-analysis of health outcomes including CRF changes that resulted from 13 exercise \"brisk walking\" programs in men and women. The mean baseline CRF was ≈8 to 9 METs (≈30 mL·kg ) was compared with regular walking, both at 50% HR reserve (40 minutes per session, 4 times per week, for 13 weeks), an increase of 2.5 mL·kg −1 ·min −1 was observed (9.7%), which was significantly different from control subjects but comparable to the 10% increase by women who performed regular walking. 273 These studies demonstrated results similar to those of previous walking studies conducted in men 274 and women 275, 276 and support previous recommendations that brisk walking for at least 3 to 4 sessions per week for ≥30 minutes per session can significantly increase CRF in people with low CRF.\nThe results of the STRRIDE study 234 suggest that both exercise amount and intensity affect CRF in 40-to 65-year-old overweight men and women after 7 to 9 months of training. Groups that were compared with an inactive control group included those with a low amount of moderate-intensity exercise, a low amount of high-intensity exercise, and a high amount of high-intensity exercise, where low intensity was defined as 40% to 55% peak V ⋅ o 2 and high intensity as 65% to 80% peak V ⋅ o 2 . The low-amount groups walked or jogged the equivalent of 19 km/wk, and the high-amount group walked or jogged 32 km/wk. Baseline CRF was 27 to 29 mL·kg −1 ·min −1 for the 4 groups. Compared with the control group, the increase in CRF was significant for the 3 exercise groups: 6% for low amount, moderate intensity; 11% for low amount, high intensity; and 18% for high amount, high intensity. These results demonstrate a dose response for increases in both physical activity intensity and amount in initially inactive overweight men and women. Ross et al 257 reported similar CRF dose-response effects for exercise intensity and amount over 24 weeks in 300 obese men and women. At a fixed intensity of CRF (ie, 50% of peak V ⋅ o 2 ), exercise performed 5 days per week for ≈30 minutes per day was associated with a 9.4% increase in CRF, whereas exercise performed 5 days per week for ≈60 minutes per day at the same intensity was associated with a 15.6% increase in CRF. Moreover, an increase in exercise intensity from 50% to 75% of CRF was associated with a 19.6% increase in CRF, which was greater than the increase in CRF observed in response to the same amount of exercise performed at 50% CRF. 257 From these carefully controlled trials, it is clear that exercise consistent with consensus recommendations is associated with an ≈10% improvement in CRF in previously sedentary adults. Increasing either the amount or intensity of exercise further improves CRF.\nA meta-analysis of 41 physical activity trials in generally healthy older men and women (mean age ≥60 years) reported that CRF increased an average (net above change in control subjects) of 3.8 mL·kg , respectively. Average session frequency was 3.3±0.7 times per week, duration was 38.1±10 minutes, and intensity generally approximated 40% to 75% of HR reserve. Greater increases in CRF were seen in physical activity programs that lasted longer than 20 weeks and with a physical activity intensity ≥60% but <70% of peak/maximal V Intermediate Baseline CRF (9- reserve) for people in this category is in the range of 5-10 METs, which indicates that aerobic activities for increasing CRF would include brisk walking on a flat surface at >4.0 mph, hiking 3.0 mph in hilly terrain, slow jogging (5.0-6.0 mph), road cycling (9-15 mph), or swimming (moderate effort). 279 Exact speeds for each person during any of these activities can be guided by their target HR. 280 High Baseline CRF ( ≥14 METs) Physical activity studies investigating changes in CRF have been conducted in physically active and highly fit men and women, including noncompetitive and competitive distance runners and cyclists with mean baseline CRF values between 14 and 20 METs (reviewed in Midgley et al 281 ). Much of the recent physical activity dose research in fit and highly fit men and women has focused on a comparison of the effectiveness of physical activity intensities between 70% and 80% versus exercise at or near (90% to 95%) of peak/maximal V ⋅ o 2 or maximal HR. [235] [236] [237] For subjects with CRF in the range of 15 to 18 METs, the results of these studies indicate that physical activity at an intensity ≥70% CRF of adequate training volume and length (ie, ≥3 days per week, ≥8 weeks) results in significant increases in CRF. It is still not clear under what circumstances very high-intensity interval training (HIT; ≥90% CRF or maximum HR) elicits greater increases in CRF than the less intense exercise programs in fit and very fit people. 231, 237 Among people with a CRF ≥13 METs, the primary goal of increasing CRF is generally more related to improving performance than health."}, {"section_title": "CRF and Cancer", "text": "Higher levels of CRF are associated with a lower risk of developing certain cancers, including lung and breast cancer and cancers of the gastrointestinal system. [136] [137] [138] [139] [140] [141] A recent meta-analysis 141 reported 20% and 45% lower risk of all-cause cancer mortality in moderately and highly fit people, respectively, than in the low-CRF group, irrespective of adiposity. Although the mechanisms by which regular moderate to vigorous physical activity, a strong determinant of CRF, might influence malignant cell growth is not clear, associated interactions between adiposity, immune, and endocrine function could serve to suppress cancer development. Possible underlying mechanisms include decreased gastrointestinal transit time, improved immune function and insulin sensitivity, alterations in insulin-like growth factors and other modulating hormones (eg, leptin), favorable changes in body composition, and combinations thereof."}, {"section_title": "CRF and Disability", "text": "Lower levels of CRF are associated with a higher risk of disability later in life. 142 Interestingly, a recent substudy of the Look AHEAD (Look AHEAD: Action for Health in Diabetes) behavioral intervention trial focused on disability and found that after 4 years, improvements in CRF were associated with a reduced risk of developing disability among obese adults with T2DM. 145 Moreover, the exercise testing modality has a significant impact on peak/ maximal V ⋅ o 2 , with values 10% to 20% lower when using a cycle ergometer compared with a treadmill in untrained individuals. 146 In close conjunction with the most accurate clinical quantification of V ⋅ o 2 peak, CPX provides an objective determination of subject effort as reflected by the peak respiratory exchange ratio, which is the V ⋅ co 2 divided by the V ⋅ o 2 during the same time interval. A peak respiratory exchange ratio ≥1.10 is generally considered the \"gold standard\" indicator of maximal effort. 74 144, 146 because the latter has a large population standard deviation (±12 bpm) and thus is not an ideal indicator of exercise effort. It has also been shown that CRF levels influence the decline in maximal HR with age. 148 The simultaneous measurement of V ⋅ e and V ⋅ co 2 by CPX allows for the more comprehensive assessment of other clinically significant variables, including CRF. The V ⋅ e/ V ⋅ co 2 slope is a key indicator of ventilatory efficiency, which is abnormally elevated in most patients with cardiovascular or pulmonary disease, including those with HF, pulmonary arterial hypertension, and interstitial lung disease. 75 In these and other clinical patient populations, the peak V ⋅ o 2 and V ⋅ e/ V ⋅ co 2 slope, as well as selected respiratory measures obtained from CPX, provide both prognostic and functional indices that are responsive to numerous therapeutic interventions. 75, 149 In addition, most commercially available CPX units have pulmonary function testing capabilities, which allow for the simultaneous diagnosis of certain respiratory limitations to exercise (eg, exercise-induced bronchospasm). 74 The performance of CPX in patients with dyspnea on exertion of unknown origin and those diagnosed with HF has been a clinical standard of care for >10 years. 74, 75 In patients with unexplained dyspnea, the independent and additive variables obtained from CPX often allow for the determination of likely underlying mechanisms for exercise intolerance or abnormal exertional symptoms, or at least are helpful in narrowing the potential causes. 74 For example, a normal pulmonary function test at baseline with the development of an obstructive pattern after CPX is a clear indication of exercise-induced bronchospasm. Conversely, an abnormally elevated (Table 4) . 75 Patients with HF who have a ventilatory and Weber class of I and A, respectively, are considered to be at very low risk for adverse events. Conversely, those with a ventilatory and Weber class of IV and D, respectively, are classified as being at extremely high risk for adverse events and as appropriate candidates for cardiac transplantation based on CPX normative data. There is mounting evidence that peak V ⋅ o 2 and the V ⋅ e/ V ⋅ co 2 slope also have high clinical utility in other patient populations, including those with suspected or diagnosed secondary pulmonary hypertension, pulmonary arterial hypertension, interstitial lung disease, and hypertrophic cardiomyopathy. 75 Although peak V ⋅ o 2 and the V ⋅ e/ V ⋅ co 2 slope are primary prognostic and functional assessment variables in these patient populations, a detailed, evidencebased, and condition-specific description of related CPX measures is provided elsewhere. 75 From a technical perspective, the routine use of CPX to determine CRF in selected patient populations has become increasingly accepted. 152 Factors that were once considered barriers, such as the rationale for CPX, costs associated with equipment, and the need for professionals with advanced training, are less problematic. 74 A major hurdle to performing CPX in the clinical setting was cleared with the recent recommendation that most maximal exercise tests can be supervised by appropriately trained nonphysician health professionals. 153 In many patient populations, considerable evidence now indicates that the added value of the unique clinical information obtained by CPX is clearly justified."}, {"section_title": "74,75", "text": ""}, {"section_title": "Conclusions: Maximal Exercise Testing With CPX Measurements", "text": "• CPX, especially peak V ⋅ o 2 , represents the \"gold standard\" for assessing exercise capacity; other parameters, including the V ⋅ e/ V ⋅ co 2 slope, have become primary clinical measures in many patient subsets, including those with HF, pulmonary arterial hypertension, and lung disease; • Although CPX involves higher levels of training and proficiency, as well as equipment and costs, for many patients the independent and additive information obtained justifies its use.\n• The use of CPX for direct determination of CRF has become more feasible."}, {"section_title": "Maximal Exercise Testing without CPX Measurements", "text": "When the instrumentation and trained personnel to perform CPX are either not available or deemed inappropriate, clinicians can choose from various options to estimate CRF. Estimation of CRF from maximal exercise "}, {"section_title": "Conclusions: Maximal Exercise Testing Without CPX Measurements", "text": "• For many patients, CPX is not readily available, and CRF can be estimated based on the attained treadmill speed, grade, and duration or the cycle ergometer workload, expressed as watts, from standardized protocols.\n• Importantly, when CRF is estimated using a treadmill protocol, tests should be performed without allowing patients to hold the handrails; resting hands on the handrails without gripping may be acceptable.\n• Care should be taken to select a protocol that optimally matches a person's exercise or functional capacity."}, {"section_title": "Submaximal Exercise Testing without CPX Measurements", "text": "Submaximal exercise tests can be performed on cycle ergometers or treadmills, with estimations of CRF from the relation between the incremental HR response and work rate. Typically, 2 submaximal work rates are performed, with measures of steady-state HR being recorded after ≈3 minutes at a fixed submaximal work rate. Ideally, the HR should exceed 110 bpm at each of the 2 work rates, to eliminate the possible influence of other non-exercise-related factors that could stimulate HR at lower levels of exertion. 161 A regression equation to estimate CRF is generated from the work rate and associated HR relation to predict the maximal work rate corresponding to age-predicted maximal HR. This method cannot be applied with patients using HR-modulating medications (eg, β-blockers). The major sources of error are the relatively high standard error of the estimate (SEE) of age-predicted maximal HR (±10-15 bpm) 162, 163 and mechanical efficiency differences at given work rates between individuals. Although these tests can be performed with little risk to the subject, the usefulness of the prediction of CRF must be considered in regard to the relatively larger SEE, typically in the range of ±10% to 15%. 164, 165 Field and Clinic Tests There are numerous exercise-related tests to predict CRF that can be applied in either a clinical or fitness setting. Two running versions, the maximal distance covered in 12 minutes or the time to complete 1.5 miles, have long been used by the military and in school settings to estimate CRF. 61 A potential safety concern associated with these tests is that they require maximal or near-maximal effort. A modification designed to limit the exercise intensity, and thus make it more widely applicable, is the 1-mile walk test. 166 To improve the prediction of CRF beyond that of test time, the regression equation also included sex, age, body weight, and peak HR in the study population (343 people aged 30 to 69 years). 166 The advantages of these running and walking tests are that they require minimal resources (measured course, timing device, and palpated pulse rate) and can be self-administered.\nIn clinical settings with patients who are markedly deconditioned (eg, chronic obstructive pulmonary disease and HF), a common method to estimate CRF is the 6-minute walk test for distance (6MWT). 167 Some investigators have reported that patients who perform poorly on the 6MWT have a poorer prognosis. 168 Additionally, the 6MWT may be able to detect differences attributable to therapy, especially in cardiac rehabilitation programs. However, the 6MWT may not necessarily provide an accurate estimation of CRF, which limits its usefulness as an indicator of CRF. 169 Others, however, have shown that the simple 6MWT in outpatients with stable CHD provided a reasonable estimate of CRF and was similar to treadmill exercise capacity in predicting cardiovascular events over a median follow-up of 8.0 years. One systematic review 171 of 13 nonexercise equations is presented in Table 6 . 172, [179] [180] [181] [182] [183] [184] [185] [186] [187] [188] [189] [190] These equations were developed with cross-sectional data using age, sex, body weight (or body mass index, percentage of body fat, waist circumference), physical activity/exercise/ training (self-reported or measured), smoking, resting HR, or perceived functional ability as predictors of CRF. The R 2 and SEEs ranged from 0.50 to 0.86 and 2.98 to 6.90 mL·kg\n, respectively. The nonexercise CRF estimates were similar in accuracy to submaximal exercise prediction models. 172, 174, 181, 191 A limitation of these equations is that they tend to underestimate and overestimate CRF at the upper and lower ends of the distribution, respectively. 172, 179, 180, 182, 185, 190 The underestimation is unlikely to affect highly fit individuals, who will still be correctly classified into the higher CRF categories; however, the overestimation for people with low CRF could be a concern because of the associated heightened risk among these men and women. 38, 172, 182, 192 Despite this, most models derived from large studies correctly classify individuals into low-fitness categories. For example, in a study by Nes et al 190 that included 2067 men and 2193 women, 90.2% of women and 92.5% of men in the 2 lowest quartiles of fitness were correctly classified into 1 of the 2 lowest measured quartiles when using their CRF prediction algorithm. That study also correctly classified a high percentage of men (93.6%) and women (91.2%) within the closest measured \"high-fit\" quartile.\nOne group who developed nonexercise equations using objective measures of physical activity reported more accurate prediction of CRF in Japanese men and women than with more traditional models using self-reported physical activity. [187] [188] [189] More recently, a new longitudinal nonexercise algorithm has been developed using data from the ACLS that addressed 2 limitations from previous cross-sectional studies. 191 First, the longitudinal equations used quadratic modeling to account for the well-documented nonlinear relationship between age and CRF. Second, the longitudinal nonexercise models "}, {"section_title": "Conclusions and Recommendations: Nonexercise Prediction Equations for Estimating CRF", "text": "• While avoiding the costs and and modest risk associated with exercise testing, nonexercise algorithms using readily available clinical variables may provide reasonably accurate estimates of CRF.\n• Nonexercise estimated CRF should not be viewed as an alternative for objective assessment of CRF, especially in some at-risk patient populations."}, {"section_title": "ASSoCIATIoNS BETwEEN NoNEXERCISE ESTIMATED CRF AND CVD", "text": "Recently, several studies have sought to determine the validity of nonexercise estimated CRF and long-term health risk, including mortality. 38, 51, 90, 193 Pooled data from 8 British cohorts included 32 319 people aged 35 to 70 years, with a 9-year follow-up. 90 In this study, the 2005 nonexercise model proposed by Jurca et al 185 derived previously. 190 The sample included 37 112 individuals who were followed up for a mean of 24 years in the HUNT study (Nord-Trøndelag Health Study). After adjustment for potential confounders, each 1-MET higher CRF was associated with 21% lower CVD mortality for both men and women who were <60 years of age at baseline, and the corresponding lower risks for all-cause mortality were 15% for men and 8% for women. Artero et al 51 investigated the association between nonexercise estimated CRF using a longitudinal 2012 model 191 that examined all-cause mortality and nonfatal CVD events among 43 356 adults (21% women, aged 20-84 years) from the ACLS. With a median follow-up of 14.5 years, estimated CRF among men was associated with a 15% and 13% lower risk of all-cause death and nonfatal CVD events per MET, whereas in women the values were 11% and 13%, respectively. Martinez-Gomez et al 193 also explored the impact of this new longitudinal model 191 on all-cause mortality among 2930 adults >60 years of age during an average follow-up of 9.4 years. The investigators reported a 20% lower risk of death with each 1-MET increment only in older women. The aforementioned studies demonstrate that the risk reduction associated with each 1 MET increase in nonexercise estimated CRF ranges from 7.4% to 21% and from 8% to 16.9% for allcause mortality and CVD mortality, respectively. These results are consistent with the risk reduction as reported from a meta-analysis of 33 studies (13% and 15% for all-cause and CVD mortality, respectively). 16 In summary, nonexercise estimated CRF provides an alternative approach for large epidemiological research and routine clinical practice with the goal to identify individuals with low CRF who are at increased health risk. Researchers or practitioners should select the equations that are most suitable for the population being evaluated. The 13 nonexercise equations given in Table 6 90, 98 and showed a comparable risk reduction to measured CRF. 16 A stepby-step procedure for using the Nes equation 190 to estimate CRF with routine clinical measures can be readily accessed by both the practitioner and the patient. 194 Estimation of CRF provides the practitioner with a platform for counselling the patient regarding the importance of physical activity. However, in most clinical patient subsets, nonexercise estimated CRF should not be viewed as a replacement for objective assessment of CRF."}, {"section_title": "Conclusions and Recommendations: Nonexercise CRF and CVD", "text": "• Nonexercise estimates of CRF may be useful to provide an initial estimate of one's CRF, particularly to identify those at increased risk of CVD because of low CRF.\n• In most clinical patient subsets, nonexercise estimated CRF should not be viewed as a replacement for objective assessment of CRF."}, {"section_title": "ASSIGNING CRF VALUES ACCoRDING To AGE AND SEX", "text": "For a given age, men generally demonstrate higher CRF levels than women, which is largely attributed to their higher peak cardiac output, hemoglobin levels, and skeletal muscle mass. 195, 196 Also, a recent report showed those with moderate or high CRF had blunted age-related declines in maximal HR. 148 Although it is widely accepted that CRF decreases with age, the rate and causes of the decrease in aerobic capacity remain poorly understood. Using men (n=435) and women (n=375) from the Baltimore Longitudinal Study of Aging, researchers found a decline in peak V ⋅ o 2 of 3% to 6% per decade for the third and fourth decades, but after age 70, the rate accelerated to >20% per decade. 196 Using the much larger ACLS data set (3429 women and 16 889 men), others have confirmed that the longitudinal decline in CRF of women and men is not linear, noting an increase in the rate of decline starting at approximately age 45. 195 Jackson et al 191 observed the rate of decline in CRF was steeper for men than women, but when the rate of decline was expressed as a percentage of peak CRF, men and women were almost identical."}, {"section_title": "Conclusions: Assigning CRF Values According to Age and Sex", "text": "• Age and sex significantly impact average CRF levels and should be considered when using CRF in clinical situations.\n• Multiyear studies need to be conducted to better delineate the changes in the biological mechanisms by which sedentary behavior and exercise alter CRF."}, {"section_title": "BIoLoGICAL ADAPTATIoNS ELICITED BY EXERCISE TRAINING THAT IMPRoVE CRF", "text": "CRF is directly influenced by the hemodynamic determinants of the Fick equation: V ⋅ o 2 =Qc×a-v O 2 difference (oxygen uptake = cardiac output times the arteriovenous difference for oxygen) (see Levine 197 and Heinonen et al 198 for discussion). Cardiac output is determined by the product of HR and stroke volume. Because virtually every exercise training study, regardless of length or intensity, has reported no change or even a slight decline in HR max, increases in CRF occur primarily via increases in stroke volume, arteriovenous O 2 difference, or both. Although total blood volume and hemoglobin increase with training, hemoglobin concentration remains stable or declines slightly, so that arterial oxygen content reby guest on September 10, 2017 http://circ.ahajournals.org/ Downloaded from mains unchanged. Therefore, the 2 major adaptations that occur with exercise training are an increase in maximal stroke volume and a decrease in venous oxygen content caused by increased O 2 extraction.\nGenerally, stroke volume increases via an increase in end-diastolic volume as a function of 3 key adaptations: an increase in total blood volume 199 ; an improvement in left ventricular distensibility (larger left ventricular enddiastolic volume for the same filling pressure) 200 ; and improvement in diastolic function. 201 Stroke volume can also increase via a decrease in end-systolic volume with improved ventriculoarterial coupling, likely because of enhanced endothelial function. 202, 203 Enlargement of the right ventricle appears to occur early in the course of exercise training and might be necessary to facilitate left ventricular adaptations. 200 There are also significant changes in skeletal muscle that increase O 2 extraction. Probably the most important is an increase in muscle capillary density, which increases mean transit time for diffusion. 204 There are also increases in the size and number of skeletal muscle mitochondria and oxidative enzymes after training, 205 although the capacity for mitochondrial respiration and skeletal muscle blood flow far exceed that of the circulation to deliver blood and oxygen to the muscle, even in untrained individuals. For young people, most studies show a balanced increase in maximal cardiac output (from an increase in maximal stroke volume), and arteriovenous O 2 difference 200, 204, 206 with training. For older people, the training responses are more variable, although the final mechanisms of improvement largely depend on the duration and intensity of training."}, {"section_title": "Conclusions: Biological Changes Produced by Exercise That Contribute to the Increase in CRF", "text": "• Habitual endurance-type exercise produces a variety of biological adaptations that lead to an increase in peak/maximal CRF, primarily because of an increase in stroke volume and a decrease in venous oxygen content resulting from an increase in o 2 extraction in the trained muscle.\n• CRF can be increased in most people by regularly performing rhythmic contractions of large muscle groups continuously for an extended period of time at a moderate or vigorous intensity or with recovery breaks at lower intensity if the exercise approaches maximal effort."}, {"section_title": "DoSE oF EXERCISE REqUIRED To INCREASE CRF", "text": "The concept of peak/maximal V ⋅ o 2 was established in 1923 by Hill and Lupton. 207 Early on, it was reported to vary with age, sex, and endurance training status [208] [209] [210] and to be increased by regular physical activity. 211, 212 Also, CRF was shown to be an excellent measure of cardiorespiratory integrity. 213, 214 Subsequently, numerous scientists evaluated a wide variety of factors that impact a person's peak/maximal V ⋅ o 2 , with specific reference to the dose of physical activity needed to increase CRF. The key components of physical activity considered in determining the exercise dose include activity type, intensity, session frequency, time (session duration), program duration, activity pattern, and progression. 215 Although frequently considered separately, each of these components interact with one another to impact the training response. Collectively, these data were consolidated into recommendations by the American College of Sports Medicine (ACSM) in \"Position Stands\" published in 1978, 1990, 1998 , and 2011. [215] [216] [217] [218] Studies Reporting on Physical Activity Dose and CRF Response (2000 Response ( -2015 In establishing dose recommendations for increasing CRF, we considered the results of experimental studies published between 2000 and 2015, as well as the relevant recommendations provided in the ACSM Position Stands from 1978, 1990, 1998 , and 2011. We also considered systematic reviews and meta-analyses of studies that provided information on the dose response conducted in healthy adults and patients with chronic diseases. Key elements of these studies are included in Table 7 and summarized in the text. Table 7 was modified from a previous report on physical activity dose for increasing CRF 268 that served as a major reference in the 2011 ACSM Position Stand. 215 We systematically searched the English literature for physical activity intervention trials published between 2000 and 2015 that included details describing a standardized exercise dose, documentation of a high level of adherence to the prescribed regimen, and CRF measurement with expired air or estimated from maximum work rate on a motor-driven treadmill or cycle ergometer at baseline and follow-up. In particular, we searched for data that augmented study results used in developing the 2011 ACSM recommendations for physical activity dose to increase CRF, as well as additional physical activity dose data on understudied populations.\nWe included 49 studies published between 2000 and 2015 that met the inclusion criteria. Because of the significant role baseline CRF plays in the absolute intensity of the exercise regimen, the review was stratified by the mean baseline CRF of study participants using the following categories: (1) HFpEF, heart failure with preserved ejection fraction; HIT, high-intensity interval training; HR, heart rate; HRmax, maximum heart rate; HRR, heart rate reserve; HRvt, heart rate at ventilatory threshold; LAHI, low amount/high intensity; LALI, low amount/low intensity; LAMI, low amount/moderate intensity; LIFE, lifestyle group; M, male; METs, metabolic equivalents; MHR, maximal heart rate; MIT, moderate-intensity training; NS, nonsignificant; reps, repetitions; RM, repetition maximum; RPE, rate of perceived exertion; SIT, sprint interval training; T2DM, type 2 diabetes mellitus; TM, motor-driven treadmill; Tmax, time to exhaustion; vLT, velocity at lactate threshold;"}, {"section_title": "Conclusions: Research Establishing the Dose of Exercise Required to Increase CRF", "text": "• When performed frequently over weeks or months, a wide variety of endurance-type physical activity regimens produce clinically significant increases in CRF (ie, ≥1 MET) in most adults.\n• In general, the greater the activity amount or intensity, the greater the increase in CRF. Increases in CRF appear more responsive to increases in intensity than increases in session duration or frequency.\n• The higher the baseline CRF, the more vigorous the intensity needed to produce a clinically significant increase in CRF. For example, in adults with a CRF <10 METs, a training intensity of ≈50% HR reserve or V ⋅ o 2 R is adequate; at a CRF level of 10 to 14 METs, training intensities in the range of 65% to 85% of HR reserve or V ⋅ o 2 R are likely more effective, and among those with a capacity >14 METs, a training intensity >85% HR or V ⋅ o 2 R may be needed for most participants to obtain a significant increase in CRF."}, {"section_title": "HIGH-INTENSITY TRAINING AND CRF", "text": "In recent years, the major addition to the CRF doseresponse literature was from the increasing number of reports evaluating the effects of HIT and sprint interval training. Interval training, the alternating of higher-and lower-intensity bouts of exercise during a single session, was originally used by endurance athletes and evaluated by sport medicine scientists in Europe >50 years ago. 282, 283 More recently, moderate-intensity interval training (50%-75% HR reserve or V ⋅ o 2 R) has been used in health-oriented fitness regimens for healthy adults and in cardiovascular and pulmonary rehabilitation. 272, 284 In healthy adults, HIT regimens have been shown to be effective by inducing greater increases in CRF than moderate-intensity continuous training (MICT) regimens, especially when total amounts of energy expended in the different regimens are similar. 236, 237, 285 For example, Gormley et al studied 61 healthy young men and women who were randomized to a nonexercise control group or 1 of 3 exercise groups: MICT (60 minutes, 4 days per week at 50% V was significantly different between each of the exercise groups, demonstrating a dose response for exercise intensity at the high end of the intensity spectrum. HIT and MICT effects on CRF have also been compared in healthy obese men and women, 258 people with metabolic syndrome, 261 hypertensive patients, 250 and patients with T2DM, 238 with HIT eliciting significantly greater increases in CRF than MICT despite similar energy expenditure.\nIn several recent randomized controlled studies involving patients with CVD, including HF, that compared the effects of HIT versus MICT on CRF or physical working capacity, HIT was found to be superior in some 256, 264, 266 but not all studies. 230, 258, 262 SAINTEX-CAD (Study on Aerobic Interval Exercise Training in CAD) compared the effects of HIT versus MICT on CRF in 200 patients with coronary artery disease. 230 After 12 weeks of training, investigators found no difference in the mean increase in peak/maximal V ⋅ o 2 (22.7% for HIT and 20.3% for MICT). However, in this study, the difference between training intensity was smaller than planned between the 2 groups (the MICT group trained at 80% versus planned 65%-75% of peak HR, whereas the HIT group trained at 88% versus the planned 90%-95% of peak HR), which made the training protocols nonisocaloric. Three small meta-analyses reported significant increases in CRF in response to selected HIT and MICT regimens in patients with various manifestations of CVD. 277, 286, 287 In another meta-analysis, 6 randomized clinical trials with a total of 153 patients were included, but only 4 randomized controlled trials with 111 patients had adequately reported peak/maximal V ⋅ o 2 data. 277 Compared with MICT, HIT significantly improved peak/maximal V ; 95% confidence interval, 2.3-4.9). Similar results were shown in patients with HF with preserved ejection fraction. 219 Weston and colleagues 286 ). On the basis of their metaanalysis of 6 randomized controlled trials comparing HIT and MICT in patients with coronary artery disease, Elliott and colleagues 287 concluded that HIT was more effective than MICT for increasing CRF but also recommended that long-term studies assessing morbidity and mortality after HIT are required before this approach can be more widely adopted. Moholdt et al 249 compared HIT and MICT regimens in patients after coronary artery bypass surgery and reported that for short-term training (4 weeks), peak/maximal V ⋅ o 2 increased significantly in both groups. However, with continued training up to 6 months, those patients performing HIT further increased their V ⋅ o 2 peak (P<0.001), whereas the MICT patients did not. 249 Thus, the duration of the training program might influence which regimen is most effective for increasing CRF in selected patient populations."}, {"section_title": "Conclusions: High-Intensity Training and CRF", "text": "• Both HIT and MICT regimens can be effective for increasing CRF in healthy adults and patients with CVD. When total work performed during training is held constant, HIT is likely to elicit greater increases in CRF than MICT. Results across studies are inconsistent in comparisons of the effects of HIT and MICT on increasing CRF. Reasons for these differences may include population-specific response differences, training protocol variations (intensity, session duration, training duration), and differences in testing protocols.\n• The role of HIT regimens in the reduction of cardiovascular clinical events remains unclear, and the added risk of musculoskeletal and cardiac complications in selected patients needs additional evaluation. Most studies on the clinical benefits of HIT in cardiac rehabilitation have used MICT for comparative purposes, and long-term validation in patient populations is needed.\n• Although HIT may be as safe as MICT for patients with CVD, more data are needed. In summary, there is an age and sex effect on the distribution of CRF in the general adult population, with women and older people having lower values. Also, inactive men and women vary in their CRF, in part because of genetic differences and other factors, and there are genetic-based interindividual differences in their response to a standardized physical activity regimen. 10, 288 However, CRF responses to a standardized physical activity regimen (similar type, amount, and intensity as percentage of capacity) are not significantly influenced by age or sex. 278, 289 Thus, a standardized approach to recommending dose parameters can be used in adult populations, taking into consideration individual levels of CRF, exercise preferences, and opportunities for increasing physical activity over the long term. Most of the lower mortality risk associated with a higher CRF occurs by the time a CRF of 10 to 12 METs is achieved. CRF values >12 METs are associated with a relatively lower impact on risk of all-cause and CVD mortality. Below 10 METs, as CRF decreases, risk progressively becomes higher at an accelerated rate. 290 Thus, to lower CVD risk by increasing CRF, the gains appear in men and women with baseline CRF ≤10 METs. Results from various studies evaluating CRF and CVD risk indicate that an increase in CRF of even 1 MET is associated with a 10% to 20% decrease in mortality rates. 2, 16, 18, 97 In addition, a review of varied physical activity regimens (Table 7) indicates that exercise increases CRF by at least 10% (a 1-MET increase for individuals with a capacity of 10 METs). Thus, to decrease CVD risk, physical activity regimens should be implemented with an initial target of increasing CRF ≥10%. Further increases in CRF may require additional increases in physical activity intensity or amount. Recommendations listed in Table 8 provide information on each of the physical activity components that should be considered in the implementation of a physical activity program."}, {"section_title": "FUTURE DIRECTIoNS AND CoNCLUSIoNS", "text": "Although there is now substantial evidence that low levels of CRF are associated with a heightened risk of cardiovascular and all-cause mortality, unanswered questions remain. Here, we provide recommendations for future research that although not exhaustive, offer direction to unravel some of the vagaries between CRF and selected health outcomes.\n• Additional evidence is required to identify the cut points or thresholds that identify low, moderate, and high CRF across age, sex, and race. Organizations such as the American Heart Association and National Institutes of Health should convene a consensus development conference and invite leading scientists in this area to develop these data.\n• Prospective trials should be initiated to determine how the routine implementation of CRF assessment in the primary care setting alters the trajectory of clinical care (ie, identifying individuals with a low CRF and using that information to help guide clinical decision making). Would such an approach improve clinical outcome and reduce healthcare expenditures? Conducting such trials was suggested previously. 291 • Because much of the CVD risk associated with low CRF is in the range of 4 to 10 METs, long-term randomized clinical trials (≥3 years) of moderateintensity activities in community-based facilities (eg, group walking, dancing) will help to clarify the associated improvements in fitness and other CVD biomarkers. There remains a need to document the impact of scalable approaches to increase the longterm physical activity of populations with CRF levels that put them at risk of CVD."}, {"section_title": "CoNCLUSIoNS", "text": "An underlying premise of this statement is that CRF should be measured in clinical practice if it can provide additional information that influences patient management. Indeed, decades of research have produced unequivocal evidence that CRF provides independent and additive morbidity and mortality data that when added to traditional risk factors significantly improves CVD risk prediction. On the basis of these observations alone, not including CRF measurement in routine clinical practice fails to provide an optimal approach for stratifying patients according to risk. As noted in numerous recent American Heart Association scientific statements, the measurement of CRF in clinical settings is both important and feasible. 74, 75, 152, 153, 292 Additionally, estimates of CRF using nonexercise algorithms have pragmatic importance and provide values for CRF that enhance risk prediction when direct CRF measures are not feasible. In fact, routine estimation of CRF in clinical practice is CRF indicates cardiorespiratory fitness; CVD, cardiovascular disease; HRR, heart rate reserve; MET, metabolic equivalents; and V no more difficult than measuring blood pressure, and procedures for incorporating CRF estimation into routine clinical assessments in a pragmatic manner are provided in Tables 9 and 10 . Finally, of crucial importance is the repeated observation that one does not need to be highly fit to gain benefit from improvements in CRF.\nIndeed, numerous epidemiological studies have now demonstrated that more than half the reduction in allcause and CVD mortality generally occurs when moving from the least fit group to the next least fit group. For many people, this can be achieved by routine, moderateintensity exercise consistent with consensus guidelines; lower levels of physical activity may be all that is needed to derive a clinically significant benefit in habitually sedentary individuals. This has implications for physical activity counselling, given that considerable benefits are likely to occur by encouraging the most sedentary or low-fit individuals to engage in modest amounts of physical activity accumulated throughout the day. Although gaps in knowledge remain, and refinement of CRF targets for risk reduction across age and sex need further investigation, the evidence reviewed suggests that the measurement of CRF improves patient management and that its omission from routine clinical practice for the vast majority of patients is unacceptable. Accordingly, the inclusion of CRF measurement or estimation in routine practice affords clinicians with a vitally important opportunity to improve patient management and, more importantly, patient health."}, {"section_title": "FooTNoTES", "text": "The American Heart Association makes every effort to avoid any actual or potential conflicts of interest that may arise as a result of an outside relationship or a personal, professional, or business interest of a member of the writing panel. Specifically, all members of the writing group are required to complete and submit a Disclosure Questionnaire showing all such relationships that might be perceived as real or potential conflicts of interest.\nThis statement was approved by the American Heart Association Science Advisory and Coordinating Committee on June 28, 2016, and the American Heart Association Executive Committee on July 20, 2016 . A copy of the document is available at http://professional.heart.org/statements by using either \"Search for Guidelines & Statements\" or the \"Browse by Topic\" area. To purchase additional reprints, call 843-216-2533 or e-mail kelle.ramsay@wolterskluwer.com.\nThe American Heart Association requests that this document be cited as follows: Ross R, Blair SN, Arena R, Church TS, Després J-P, Franklin BA, Haskell WL, Kaminsky LA, Levine BD, Lavie CJ, Myers J, Niebauer J, Sallis R, Sawada SS, Sui 2. Ideally, all adults should have CRF estimated using a maximal test, † if feasible using CPX,* ‡ on a regular basis similar to other preventative services. 293 The specific age of first assessment and schedule for follow-up are yet to be established. However, patients with higher CVD risk profiles should have an initial test at an earlier age and be tested more frequently than patients with lower risk profiles.\n3. Adults with chronic disease should have CRF measured with a peak or symptom-limited CPX on a regular § basis.\nCRF indicates cardiorespiratory fitness; and CPX, cardiopulmonary exercise testing.\n*Recommendation to estimate CRF is for the purpose of assessing fitness and not coronary heart disease. Nonexercise estimates of CRF provide clinicians the opportunity to counsel patients regarding the importance of performing regular physical activity.\n†See \"Maximal Exercise Testing Without CPX Measurements.\" ‡See \"Maximal Exercise Testing With CPX Measurements.\" §The schedule for this is specific to the chronic disease status. "}, {"section_title": "75", "text": ""}]