[{"section_title": "Abstract", "text": "Equal contribution (*) †Data used in preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (adni.loni.usc.edu). As such, the investigators within the ADNI contributed to the design and implementation of ADNI and/or provided data but did not participate in analysis or writing of this report. A complete listing of ADNI investigators can be found at: http://adni.loni.usc.edu/wpcontent/uploads/how_to_apply/ADNI_Acknowledgement_List.pdf Plasma cortisol and cerebral glucose metabolism Wirth, Lange, and Huijbers; p. 2\nObjective: Hypothalamic-pituitary-adrenal (HPA) dysregulation is proposed as a risk factor for Alzheimer's disease (AD). This cross-sectional study assessed relationships between plasma cortisol levels and neuroimaging biomarkers, specifically brain glucose metabolism and gray matter volume, across the AD spectrum.\nMethods: Cognitively normal older adults and patients with mild cognitive impairment (MCI) and AD dementia were included from the Alzheimer's Disease Neuroimaging Initiative. Participants (n = 556) were selected based on availability of baseline measures of plasma cortisol levels and gray matter volume, as estimated with magnetic resonance imaging. Within a subsample (n = 288), we examined brain glucose metabolism (n = 288) as with positron emission tomography. Relationships between plasma cortisol and AD neuroimaging biomarkers were assessed using regions-of-interest and voxel-wise analyses.\nResults: Across the entire cohort, higher plasma cortisol was also related to lower gray matter volume, most notably in the left lateral temporal-parietal-occipital regions.\nImportantly, higher plasma cortisol concentration was also related to hypometabolism, especially in lateral temporo-parietal and medial parietal regions. When stratified by diagnosis, these negative associations were most pronounced in MCI and AD patients.\nInterpretation: High plasma cortisol was associated with hypometabolism predominantly in AD-sensitive regions. Our results indicate that HPA axis activation could influence brain metabolism and exacerbate existing AD pathological processes. This is consistent with a notion that stress is a conceivable target for intervention to slow down AD Plasma cortisol and cerebral glucose metabolism Wirth, Lange, and Huijbers; p. 3 progression. Future studies should delineate underlying pathological mechanisms and investigate if clinical or lifestyle interventions could alleviate negative actions of stress on AD."}, {"section_title": "Introduction", "text": "Stress, mediated by the hypothalamic-pituitary-adrenal (HPA) axis, has been proposed as a risk factor for the development of Alzheimer's disease (AD) 1 . Known as the most important human glucocorticoid released by HPA axis activation, cortisol modulates homeostatic body functions, including negative feedback mechanisms in the brain 2 . Elevated levels of circulating cortisol over time may, however, prompt brain injury and increase vulnerability to neurodegenerative diseases [3] [4] [5] .\nThere is evidence that HPA axis activation and dysregulation may aggravate pathological processes related to AD. Cortisol levels, commonly measured in blood plasma/serum, salvia, urine or cerebrospinal fluid (CSF), are increased in patients with AD and amnestic MCI 6, 7 . Moreover, higher cortisol levels were previously related to gray matter atrophy in the hippocampus [8] [9] [10] [11] across the AD spectrum, from cognitively normal older adults, to mild cognitive impairment (MCI) and clinical AD. These brain changes may contribute to cognitive deficits 9, 10, 12 and higher risk of clinical progression 7, 13, 14 associated with stress hormone elevation.\nBy contrast, effects of circulating cortisol on cerebral glucose metabolism are largely unknown in the course of AD pathogenesis. Decreased glucose metabolism within frontal-temporal-parietal association cortices, measured using positron emission tomography (PET), is a key feature of prodromal and clinical AD [15] [16] [17] . Chronic exposure to increased glucocorticoid concentration was formerly linked to impaired glucose metabolism in the hippocampus and other brain areas in rat models 18 as well as in hypercortisolemic patients with Cushing syndrome 19, 20 . Given these observations, we hypothesize that brain glucose metabolism may be affected by the actions of stress hormones along the AD spectrum.\nThe present cross-sectional study aimed to determine the relationship between plasma cortisol levels and cerebral glucose metabolism, measured using 2-[F-18]-fluoro-2-deoxy-D-glucose (FDG) Positron Emission Tomography (PET), across the AD spectrum. First, we assessed the effect of plasma cortisol on gray matter volume, measured using structural magnetic resonance imaging (MRI), with the aim to replicate previous findings 8 . Secondly, we investigated the unexplored relationship between circulating cortisol and FDG-PET. The methodological approach was chosen to highlight specific regional patterns of cortisol-associated effects in each imaging modality."}, {"section_title": "Methods", "text": "Cross-sectional data used in this study were obtained from the Alzheimer "}, {"section_title": "Participants", "text": "Participants were selected from the ADNI database (ADNI I cohort) with regard to availability of following assessments: (i) baseline plasma cortisol concentration, (ii) baseline structural (high-resolution T1-weighted) MRI, and baseline cerebral FDG PET (subgroup). Neuroimaging data was restricted to image data acquired within a time window of ±100 days anchored to the clinical baseline assessment (incl. collection of plasma cortisol data). The selection flowchart is depicted in Figure 1 . Standard protocol approvals, registrations, and patient consents. Ethics approval was obtained by the ADNI investigators. All study participants provided written informed consent."}, {"section_title": "Acquisition of data", "text": ""}, {"section_title": "Plasma sample collection and analysis", "text": "Plasma cortisol data was provided by the Biomarkers Consortium Plasma Proteomics Project and extracted using the ADNImerge package. Essays and quantification methods are described in detail in the data primer, available at (http://adni.loni.usc.edu/methods/) and explained in previous publications 8, 24 . In brief, baseline plasma cortisol was quantified in overnight fasting blood samples collected from each participant. Whole-blood samples were collected into 10 ml BD lavender top K2EDTA coated vacutainers, centrifuged within one hour after collection. Immediately after, blood plasma was transferred to a polypropylene transfer tube and placed in dry ice.\nSamples were shipped to the ADNI Biomarker Core Laboratory at the University of Pennsylvania. Following thawing at room temperature, 0.5 mL aliquots were prepared from plasma samples and stored in polypropylene aliquot tubes at "}, {"section_title": "Acquisition of MRI images", "text": "MRI acquisition protocols were set-up to harmonize image quality across MR hardware platforms 25 . In particular, high-resolution T1-weighted MR images were acquired using a sagittal 3-dimensional magnetization prepared rapid gradient echo (3D-MPRAGE) sequence with an approximate TR = 2400 ms, minimum full TE, TI = 1000 ms, and flip angle of 8º (scan parameters vary between sites, scanner platforms, and software versions)."}, {"section_title": "Acquisition of FDG PET images", "text": "Cerebral FDG PET data was acquired on multiple PET scanners of varying resolution, but platform-specific acquisition and reconstruction protocols were used to harmonize image quality across all ADNI centers 26 . FDG PET was performed according to a dynamic protocol resulting in 6 frames, each with a 5 min duration from 30 to 60 min post injection."}, {"section_title": "Preprocessing of structural MRI images", "text": "In general, image processing and voxel-wise statistical testing was conducted in\nMatlab environment (version R2013b, The Mathworks, Natick, USA). All images were downloaded from the ADNI repository as \"unpreprocessed\" data. probabilistic labels thresholded at 100% overlap) and inclusion of both, modulated gray matter and white matter voxel values 30 . Total intracranial volume (TIV) was estimated by the method of Keihaninejad and colleagues 31 . Hippocampal volumes were corrected for TIV using a simple ratio method.\nIn order to prepare voxel-wise multiple regression analyses, the gray matter volume images were smoothed by a three-dimensional (3D) Gaussian kernel with full width at half maximum (FWHM) of 6 mm."}, {"section_title": "Preprocessing of FDG PET images", "text": "Reconstructed dynamic (or static, if dynamic was not available) PET data was downloaded from the ADNI repository in its original image format (\"as archived\", DICOM, Interfile, or ECAT). Image data was converted to Nifti, i.e. from DICOM and ECAT using SPM12 or from Interfile using ImageConverter (version 1.1.5, Turku PET center).\nPreprocessing was performed fully automatically using a custom-made pipeline described elsewhere 32 , except that the PET data was spatially normalized to MNI space using the parameter estimates from the MRI (see section 2.3). The relative standardized uptake value (SUVr) was calculated voxel-wise using the whole brain parenchyma as reference region.\nMean FDG SUVr was evaluated using a regions-of-interest (ROI) template, comprising neocortical areas that known to be hypometabolic in AD. Specifically, the FDG-based AD template included parietal, temporal, and frontal regions and was defined previously from voxel-wise comparisons of FDG PET images in an largely independent ADNI sample of CN and AD patients (except for five overlapping individuals) 32 .\nIn order to prepare voxel-wise multiple regression analyses, SUVr images were smoothed by a 3D Gaussian kernel with FWHM of 12 mm."}, {"section_title": "Statistics", "text": "In general, statistical analyses of sample characteristics and ROI analysis were performed with IBM SPSS Statistics (version 22, IBM Corp., Armonk, NY, USA). Whole brain data was visualized using Python (3.6.0) and the nibabel (DOI:\n10.5281/zenodo.1464282) and nilearn (version 0.5.0b) modules. Scatterplots were generated using R (version 3.5.1) and ggplot2 33 ."}, {"section_title": "Sample characteristics", "text": "The entire sample and each diagnostic groups were characterized using baseline demographic, clinical, and biomarker characteristics, as extracted from the ADNImerge data (R package) downloaded on April 17 th 2018 34 .\nFollowing clinical and neuropsychological measures were selected for sample description: individual baseline scores from the CDR Sum of Boxes (CDR-SB), the MMSE, the Rey auditory verbal learning test (RAVLT), percent forgetting subscale 35 , and the Geriatric Depression Scale (GDS) 36 . The entire sample and diagnostic groups were further characterized using the Apolipoprotein E number of ε 4 alleles (APOE4 status), the average FDG SUVr within AD-sensitive regions, total hippocampal volume, and baseline plasma cortisol levels.\nOne-way analysis of variance (ANOVA) models were computed with diagnostic group as independent factor and the respective sample characteristics as dependent variable. In case of a significant effect between groups, post-hoc multiple comparisons were performed using either the Tukey's honestly significant difference test (assuming equal variance) or the Games Howell test (unequal variance)."}, {"section_title": "Regions-of interest analysis", "text": "A regions-of interest (ROI) analysis was performed in pre-defined ROIs representing regions that are sensitively affected by hypometabolism and gray matter atrophy in AD patients. For structural MRI, we assessed bilateral hippocampal volume according HarP 30 , corrected for TIV using a simple ratio method. For FDG, we examined the mean SUVr in the combined AD ROI described above 32 .\nPearson correlation analysis was performed to evaluate relationships between plasma cortisol and each AD-sensitive ROI for the entire sample. Follow-up stratification by diagnostic group was conducted to explore respective relationships within each diagnostic group. To evaluate possible group differences, one-way ANOVA models were computed with each AD-sensitive ROI as dependent variable and diagnostic group (CN, MCI, and AD), plasma cortisol level, and their interactive term as independent factors.\nScatter plots were created to visualize the relationships between plasma cortisol and glucose metabolism as well as gray matter volume measured in each pre-selected AD ROI, respectively."}, {"section_title": "Voxel-wise analysis", "text": "Voxel-wise regression analysis was run under SPM12 to evaluate relationships between plasma cortisol and imaging modalities (FDG PET and structural MRI) in the entire sample. Results were evaluated for significance at a False Discovery Rate (FDR) adjusted p value of < 0.05 and a minimum cluster size of 20. Voxel-wise analyses were adjusted for age and TIV (note: gray matter volume only) and restricted to cerebral gray matter using an explicit mask (cerebellum excluded).\nFor follow-up analysis, average FDG SUVr and total gray matter volume were delineated from combined clusters of significant negative associations between plasma cortisol and the respective imaging modality (here referred as cortisol meta ROI). For MRI, the cortisol meta ROI values were corrected for TIV using a simple ratio method.\nPearson correlation analyses were performed to estimate associations between plasma cortisol and each cortisol meta ROI for the respective diagnostic groups. To explore possible group differences, one-way ANOVA models were computed with each cortisol meta ROI as dependent variable and diagnostic group (CN, MCI, and AD), plasma cortisol, and their interactive term as independent factors.\nScatter plots were created to visualize the relationships between plasma cortisol and glucose metabolism as well as gray matter volume measured in each cortisol meta ROI, respectively."}, {"section_title": "Adjustment procedure", "text": "Second-level statistical analyses within each cortisol meta ROI respective both imaging modalities, FDG and MRI, were carried out with adjustments for appropriate covariates as follows: Using correlation analyses, we assessed preliminary relationships between age, education, gender, subclinical depression (measured using the GDS), APOE status, and respective ROIs (dependent variable). In case of a considerable correlation (p < 0.1) of any covariate with the dependent variable of interest, partial correlation analyses were conducted including the particular covariate(s)."}, {"section_title": "Results", "text": ""}, {"section_title": "Characteristics of participants", "text": "Descriptive demographic, clinical, and biomarker characteristics are provided for the entire sample and within each diagnostic group in Table 1 . Diagnostic groups were comparable in age, gender and education. As expected, CN, MCI, and AD groups differed significantly in clinical measures, the APOE4 status, and the selected AD-sensitive ROIs for FDG SUVr and gray matter volume. Plasma cortisol levels were significantly increased in AD patients compared to the MCI group. "}, {"section_title": "MRI ROI", "text": "Higher plasma cortisol was significantly related to lower hippocampal volume in the entire sample ( Figure 2 and Table 2A , correlation analysis). When stratified by diagnostic group, the significant negative relationship between plasma cortisol and hippocampal volume was present only in the MCI group. There was no significant interaction between diagnostic group and plasma cortisol in the hippocampal ROI (F [2,550] = 1.446, p = 0.236, n = 556).\nAdjustment for covariates (age, education, gender, subclinical depression, and APOE4) did not change the results with regard to the entire sample and diagnostic groups (Table 2A , partial correlation analysis)."}, {"section_title": "FDG ROI", "text": "Higher plasma cortisol levels were significantly related to lower glucose metabolism in the FDG AD template for the entire sample ( Figure 2 and Table 2A , correlation analysis). When stratified by diagnostic group, significantly negative relationships between higher plasma and glucose metabolism were seen only in the MCI and AD groups ( Table 2 ). The interaction between diagnostic groups and plasma cortisol was significant (F [2,282] = 3.749, p = 0.025, n = 288).\nAdjustment for covariates (age, subclinical depression, and APOE4) did not essentially change the results with regard to the entire sample and diagnostic groups (Table 2A , partial correlation analysis). Figure 3 , Table 3 ). There was no significant positive relationship between plasma cortisol levels and gray matter volume at the given statistical threshold.\nStratification by diagnostic group indicated that the negative relationship between plasma cortisol and gray matter volume in the respective cortisol meta ROI was significant in each diagnostic group ( Figure 3 and Table 2B , correlation analysis). There was no significant interaction between diagnostic group and plasma cortisol (F [2,550] = 0.292, p = 0.747, n = 556).\nAfter adjusting for covariates (age and gender), results were maintained with regard to the entire sample and diagnostic groups (Table 2B , partial correlation analysis). Table 3 : see end of manuscript ==="}, {"section_title": "Statistical maps (left side) are depicted on a glass brain. Color scales represents t-values starting at p < 0.05, corrected using false discovery rate (FDR). Scatter plots (right side) depict relationships between plasma cortisol and total GMV (measured as % total intracranial volume [TIV]) and average FDG relative standardized uptake value (SUVr) within the corresponding cortisol meta ROI. Dots represent individual data points, with cognitively normal [CN] in green, mild cognitive impairment [MCI] in orange and", "text": ""}, {"section_title": "= = =", "text": "\n"}, {"section_title": "FDG", "text": "At the voxel level, higher plasma cortisol levels were related to lower FDG SUVr mainly within lateral temporo-parietal regions, posterior cingulate, and medial parietal regions including the precuneus of both hemispheres across the entire sample ( Figure 3 and Table 4 ). There were no significant positive relationships between plasma cortisol levels and glucose metabolism at the given threshold.\nFollow-up stratification by diagnostic group indicated that the negative relationship between plasma cortisol and glucose metabolism in the respective cortisol meta ROI was only significant in the MCI group ( Figure 3 and Table 2B , correlation analysis). There was, however, no significant interaction between diagnostic group and plasma cortisol (F [2,282] = 0.519, p = 0.596, n = 288). Table 4 : see end of manuscript === Adjustments for covariates (age and APOE4) did not essentially change the results in the entire sample and within diagnostic groups (Table 2B , partial correlation analysis)."}, {"section_title": "Discussion", "text": "Findings of this study show detrimental effects of plasma cortisol on cerebral glucose metabolism and gray matter volume across the AD spectrum, with a somewhat divergent distribution. Increased plasma cortisol was related to lower glucose metabolism, mainly in medial parietal and lateral temporo-parietal regions. In addition, plasma cortisol was inversely associated with gray matter volume, mainly in lateral temporo-parieto-occipital regions and in the hippocampus. Our results are consistent with the notion that HPA axis activation could exacerbate pathological processes associated with AD and increase the vulnerability to AD development."}, {"section_title": "Relationship between plasma cortisol and cerebral glucose metabolism", "text": "We found that higher overnight fasting plasma cortisol was associated with lower cerebral glucose metabolism across the AD spectrum. This adverse effect was mainly seen within lateral temporo-parietal, medial parietal, and posterior cingulate brain regions. The finding converges with data from animal models, indicating that glucocorticoids may inhibit cerebral glucose metabolism in the hippocampus and other brain regions 18, 37 .\nUsing FDG PET, previous studies on Cushing's syndrome patients have further related increased cortisol levels to global and regional patterns of perturbed cerebral metabolism 19, 20 15, 16, 43 , is suggested to evolve from synergistic interactions of Aβ-and tau-related pathways 44 .\nGiven these findings it appears that metabolic dysfunction could be aggravated by the impact of stress hormones on existing AD pathologies.\nInterestingly, a moderate positive relationship between plasma cortisol levels and "}, {"section_title": "Relationship between plasma cortisol and gray matte volume", "text": "Higher plasma cortisol levels were associated with lower gray matter volume in the hippocampus and other cortical areas. At the given statistical threshold, the effect was mainly found in restricted left lateral temporal-parietal-occipital regions, with a spatial pattern somewhat distinct from the one found for cerebral metabolism. The finding parallels observations, suggesting that circulating glucocorticoids are associated with volume reduction in widespread brain regions, often comprising but not limited to the hippocampus [8] [9] [10] 47 . The adverse relationship between plasma cortisol and regional volume was found even in cognitively normal individuals, similar to previous reports 11, 47 . One possible explanation might be that circulating glucocorticoids may affect brain structure via several damaging pathways, for example, through synapse remodeling 48, 49 .\nSuch mechanisms work prior to and independent of AD pathology and may increase the vulnerability of the brain to aging and disease."}, {"section_title": "Synopsis and outlook", "text": "Taken together, our findings are convergent with the idea that HPA axis activation may be a vigorous mechanism that accelerates AD pathogenesis. The study shows detrimental relationships between stress hormone levels and brain integrity within regions sensitive to AD pathology across the AD spectrum. Moreover, we replicate the presence of higher cortical levels in AD patients compared to healthy older adults 50 . A similar effect was not detectable in MCI patients, albeit reported previously using cortisol measures in CSF 7 . Clinical or lifestyle interventions could help to reduce elevated stress hormones levels at early disease stages and have a positive impact on disease progression, a hypothesis to be evaluated in future studies."}, {"section_title": "Strengths and limitations", "text": "Our study has strengths and limitations. The present findings are based on the large and well-characterized ADNI cohort with standardized operation procedures that are publicly available. As a result, we were able to investigate plasma cortisol levels across the spectrum of AD, from cognitively normal to mildly and clinically impaired older individuals. However, the use of ADNI is also a limitation, as our findings are not independent from other observation in the same cohort (Toledo et al 2013) . Furthermore, the cross-sectional nature of assessments precludes conclusions on the temporal sequence between HPA axis activation and brain injury associated with AD pathogenesis.\nLongitudinal studies including biomarkers of neuropathology will be needed to further Forthcoming studies could assess more fine-grained effects of plasma cortisol exposure across the complete AD continuum."}, {"section_title": "Conclusion", "text": "The present study demonstrated that higher plasma cortisol levels is related to reduced glucose metabolism in AD signature regions across the AD spectrum. Higher cortisol is also related to reduced regional gray matter volume, with partially overlapping spatial regions across the brain. The detrimental relationship between plasma cortisol and glucose metabolism were most pronounced in prodromal and clinical stages of AD. The findings suggest that HPA axis activation could aggravate existing AD pathological processes and thereby accelerate AD progression."}, {"section_title": "Acknowledgments", "text": "We sincerely thank the ADNI research group for their contributions to this work and Dr. Etienne Vachon-Presseau (Northwestern University, Chicago) and Gloria Benson (Charité -Universitätsmedizin, Berlin) for valuable comments on the manuscript."}, {"section_title": "Study funding", "text": "The present study was supported by the Hans Gerhard Creutzfeldt scholarship "}]