[{"section_title": "Abstract", "text": "Groupwise image registration provides an unbiased registration solution upon a population of images, which can facilitate the subsequent population analysis. However, it is generally computationally expensive for performing groupwise registration on a large set of images. To alleviate this issue, we propose to utilize a fast initialization technique for speeding up the groupwise registration. Our main idea is to generate a set of simulated brain MRI samples with known deformations to their group center. This can be achieved in the training stage by two steps. First, a set of training brain MR images is registered to their group center with a certain existing groupwise registration method. Then, in order to augment the samples, we perform PCA on the set of obtained deformation fields (to the group center) to parameterize the deformation fields. In doing so, we can generate a large number of deformation fields, as well as their respective simulated samples using different parameters for PCA. In the application stage, when given a new set of testing brain MR images, we can mix them with the augmented training samples. Then, for each testing image, we can find its closest sample in the augmented training dataset for fast estimating its deformation field to the group center of the training set. In this way, a tentative group center of the testing image set can be immediately estimated, and the deformation field of each testing image to this estimated group center can be obtained. With this fast initialization for groupwise registration of testing images, we can finally use an existing groupwise registration method to quickly refine the groupwise registration results. Experimental results on ADNI dataset show the significantly improved computational efficiency and competitive registration accuracy, compared to state-of-the-art groupwise registration methods."}, {"section_title": "Introduction", "text": "Groupwise registration provides an unbiased registration solution for a group of images, which is an essential process of population analysis in modern medical image analysis tasks, e.g., analyzing brain structural variations for brain developmental and neurological disorder studies [1] . Unlike conventional pairwise registration which needs to manually select a template image, groupwise registration method can simultaneously align all images to a common space, i.e., their group center. Obviously, by adopting groupwise registration, the bias of individual brain anatomy can be alleviated during registration, which helps facilitate the precise population analysis, especially for the brain diseases that are only related to subtle brain structural changes.\nTo date, many groupwise registration methods have been developed in order to provide effective groupwise registration solutions. Joshi et al. [2] proposed an efficient groupwise registration method, which iteratively estimated the group center image by simply averaging all registered subject images at the tentative group mean image. Although the group center could be converged by only a few iterations in their method, it did not yield a sufficiently sharp group mean image, which indicates that the registration accuracy needs further improvement. To address this limitation, Ying et al. [3] proposed a hierarchical unbiased graph shrinkage (HUGS) method for groupwise registration. This approach first employed a graph model to fit the data representation on the image manifold, and then regarded groupwise registration as a dynamic graph shrinkage problem. By only connecting similar images on the graph, all images can efficiently move to the group center along the graph edge. Wu et al. [4] further improved this method with multi-layer graph model to address the heterogeneity issue in the imaging data. These methods can contribute to an accurate group center image with much sharper anatomical structures. However, all these methods require very long computational time because of numerous iterative optimizations, which makes these methods less practical in clinical application.\nIn order to tackle this limitation, we propose an efficient groupwise registration method by using a fast initialization technique, which is able to achieve comparable registration accuracy with the state-of-the-art methods, while significantly reducing the computational time. Specifically, we calculate an accurate group center image from a set of training images, as well as their deformation fields to the group center. When group-wisely registering a new group of images, we first quickly initialize all new images to a roughly estimated group center image, where all new images can be quite close to each other. Then, the final group center can be refined by adopting a conventional groupwise registration method efficiently. The main contributions of this paper can be summarized as follows:"}, {"section_title": "1.", "text": "An accurate and fast groupwise registration method is proposed by fully exploiting the established deformation fields of the existing training dataset. This can help provide a fast initialization for a new image set, where the anatomical variation among the individuals can be greatly reduced. In this way, the final accurate registration results can be efficiently achieved by using a certain groupwise registration method."}, {"section_title": "2.", "text": "A novel data augmentation strategy is introduced to generate an abundantly enlarged training set from the limited number of training images and establish the respective deformation fields to a training group center. By generating the simulated data, the training images can be well distributed on the image manifold, which is essential to transfer the group center from the training set to the new testing image group to achieve an accurate initialization.\nOur proposed method is evaluated on Alzheimer's Disease Neuroimaging Initiative (ADNI) dataset. The registration results show competitive registration performance with significant reduced computation time, compared to a state-of-the-art groupwise registration method [3] .\nGiven a set of training images, the goal of our work is to group-wisely registering all new images to their group center efficiently and accurately compared to the state-of-the-art registration method. Our proposed method composes of two stages: training data augmentation and efficient groupwise registration supported by fast initialization. To construct a training dataset with an adequate number of images, we enlarge the existing dataset by simulating MR brain samples via a wavelet-based PCA (WPCA) model [5] . In groupwise registration stage, new images in the testing set can be easily warped to the center of training dataset group by register each new image to its most similar image in training dataset. Then, the testing group center can be quickly estimated by iteratively evolving from the training group center. Finally, it is straightforward to refine all testing images to their final group center by adopting a conventional groupwise registered method in an effective way."}, {"section_title": "Training Dataset Augmentation", "text": "All training images should be well distributed in the image manifold, which requires the image samples to cover the possible variability of individual brain anatomical structures. Based on the limited training data, we propose to use the WPCA-based data augmentation to enlarge the dataset in order to simulate diversified images.\nAssume we have N training images . The first step is to use a certain groupwise registration method to simultaneously align all training images to their group center image G s , and obtain a set of dense deformation fields , which bring each training image to its group center image G s , respectively. Here, we employ the HUGS method [3] , one of the state-of-the-art groupwise registration methods, to obtain the accurate group center image by exhaustively iterative optimization, as well as the deformation fields of all training images to the group center. In the second step, a WPCA model is employed to generate simulated deformation fields from the previous established deformation fields u s with the warped MR brain images using the simulated deformation fields. Here, in order to accurately estimate a set of simulated deformation fields from a limited training deformation fields, we employ an wavelet-based PCA model [5] regularized by its Jacobian determinants and a Markov random field, to generate a set of simulated deformation fields and their respective MR brain images . Therefore, we can obtain an augmented training dataset with N + M brain images corresponding to their deformation field , which can directly bring the images to the group center image G s . Fig.1 shows an illustration of simulating MR brain images in the highdimensional image manifold. The orange circle denotes the group center image G s . The blue circle and solid curves denote the training image and its deformation pathway to the group center image G s . The blue circular ring and the dashed curves denote the simulated images and the simulated deformation pathway , respectively."}, {"section_title": "Efficient Groupwise Registration by Fast Initialization", "text": "Our proposed groupwise registration consists of two parts: 1) fast group center initialization and 2) efficient groupwise registration.\nThe group center for the testing group is fast initialized based on the group center G s of training dataset. Given a new image group with P testing images , we first combine them with the augmented training dataset I s̃. Then, the initialized group center can be obtained by two steps.\nIn the first step, each new image finds its closest sample in the augmented training dataset I s̃ by measuring the similarity between images on the image manifold. Here, for the computational efficiency, we use the sum of squared differences (SSD) as the similarity metric. Therefore, the image distance between a testing image and a training image can be defined as: (1) Then, we apply a conventional deformable registration method to obtain the deformation field (blue curved arrow shown in Fig. 2 ) between the new image I m to its closest image in I S̃ in an efficient manner. Note that, many existing deformable registration algorithms [6] [7] [8] [9] can be used for this purpose, since the two images are already very similar and easy to register. Here, we use diffeomorphic Demons [7] to perform the deformable registration. After that, a set of deformation fields , which are from each testing image to the group center of the training set (orange curved arrow shown in Fig. 2) , can be obtained.\nIn the second step, we aim to iteratively estimate a tentative testing group center G′ based on the testing image set, and obtain the respective deformation field of each testing image to this group center G′. Specifically, we first calculate an averaged deformation field ū t→G s from the previous obtained deformation fields, which can be defined as: (2) Then, we compute its reverse deformation field (ū t→G s ) −1 , which can bring the training group center image G s to an initially estimated testing group center . After that, the updated the deformation fields from each testing image to this initial estimated testing group center can be obtained, which is calculated by: (3) where the symbol ∘ denotes the composition of the two deformation fields. Then, after iteratively repeating Eq. (2) and (3), we obtain the updated testing group center G′ with the respective deformation fields u t→G′ of each testing image to G′. By using the deformation fields u t→G′ , we can fast initialize all testing images to the estimated testing group center, where we can obtain P warped testing images . Note that, the warped testing images I G′ will be located closely to each other in G′ image space.\nBased on the fast group center estimation, we further perform accurate groupwise registration by adopting an existing groupwise registration method to quickly calculate the final testing group center image G t . It should be noted that, the reason that why using groupwise registration method can be fast at this stage is that all testing images in I G′ image space are very similar to each other. Comparing to conventional groupwise registration methods, which align all images without initialization by using many iterations to gradually move all images to their image center, our proposed method can benefit from the fast initialization, which contributes to dramatically saving the computational time by significantly reducing the iteration numbers. "}, {"section_title": "Experiments and results", "text": "In the experiments, we selected 50 subjects as our training dataset and another 50 subjects as the testing image group from the dataset. All images were processed with standard preprocessing procedures. Specifically, all images were first resampled to an image size of 256×256×256 with a voxel size of 1mm×1mm×1mm. Then, we used N3 algorithm [6] to correct the inhomogeneous intensity. After that, we employed BET [7] for skull stripping. Next, each image was further segmented into gray matter (GM), white matter (WM) and cerebrospinal fluid (CSF) by using FAST software [8] . These tissue segmentations were manually corrected with visual inspection and were regarded as the ground truth for evaluating the registration performance. Fig. 3 shows several typical images used in our experiment.\nBefore performing groupwise registration, affine registration was applied to register all images to a selected image which is the closest to the geometric mean of image set using FLIRT [9] . Then, in the training stage, we employed HUGS [3] to generate the group center of the training dataset along with their deformation field to the group center. Next, we used the WPCA model to generate 250 simulated MR brain samples to enlarge our training dataset. In the application stage, we separately perform HUGS [3] registration and our proposed registration method (Fast-HUGS) on the testing dataset. For our proposed method, each new image was first registered to its closest image in the training dataset using demons [7] . At the final stage, we used HUGS method to group-wisely refine the registration result.\nTo quantitatively evaluate our method, the Dice ratio is used to measure the overlap degree of each tissue among the group-wisely registered images. Since no label image is available in the common space of testing images, we generate a label image in the common space by using majority voting on all aligned testing label images. The Dice ratio of different tissue types is then calculated with respect to the label image in the common space for each certain subject. The Dice ratio of each tissue type and the computational time using HUGS and Fast-HUGS are reported in Table 1 . It can be observed that our method achieves a comparable Dice ratio compared to HUGS, while the number of iterations and computational time are significantly reduced. Fig. 4 shows a boxplot of the Dice ratio of the three tissue types. Fig. 5 illustrates the results between the two groupwise registration methods."}, {"section_title": "Conclusion", "text": "In this paper, we proposed an efficient groupwise registration method by introducing fast initialization. We first enlarge the brain anatomical variability of the training MR images with the existing deformation fields to their group center. When group-wisely registering a new set of testing images, each new testing image can find its closest image in the training dataset for fast estimating its deformation field to the group center of the training image. Then, by quickly estimating a tentative group center for the testing images, all new testing images can be fast initialized to this initialized group center, where all warped new images are close to each other. Thus, the real group center of the new testing images can be quickly refined by using an existing groupwise registration method with only a few iterations. Experimental results show our proposed registration method can dramatically reduce the computational time while maintaining competitive registration accuracy compared to the state-of-the-art groupwise registration method. Our preliminary experimental results suggest that, our groupwise registration method can be potentially extended to more applications of the large population analysis."}]