[{"section_title": "", "text": "Recent decades have shown increasing reliance on cross-national education assessments and international benchmarking among developed nations (Kamens and McNeely 2010). Notably, test results from the Programme for International Student Assessment (PISA) spark considerable attention in educational research and media reports (Dillon 2010;Fuchs and Woessmann 2007;Hanushek 2004). While these results provide researchers with valuable data, we know less about learning and cross-national achievement gaps before children enter school. As a lead researcher at Harvard's Center on the Developing Child, Gunther Fink states, ''Where you are at age 6, before you enter school, predicts so many things in your life, and yet we have no way of comparing one country to another'' (Center on the Developing Child 2011). In the present study, I seek to fill this void in the literature by comparing the cognitive skills of U.S. and Canadian children before and during school. Such early childhood comparisons provide valuable insight regarding the interpretation of results from assessments of adolescents such as PISA. For instance, while the mediocre performance of U.S. high school students on international tests is well documented (Hanushek 2004), there is little consensus about when cross-national learning gaps first emerge and how schooling affects these gaps over time. The most popular interpretation of the lackluster U.S. performance is that the education system is at fault and is in need of greater efficiency, accountability, and curricular reform (Chubb and Moe 1990;Hanushek 2011). But this view assumes that U.S. schools face the same challenges that schools in other countries confront. There is reason to believe, however, that social conditions in the United States, such as high levels of inequality, poverty, and poor access to health care, present special challenges to teaching U.S. children, making it difficult to interpret international test scores (Condron 2011). In this study, I document the U.S. deficit in reading relative to Canada among 15-to 16-year-olds, but I also compare reading skills among the same cohort of children 11 years earlier, when they were 4 to 5 years old. These unique data allow me to identify the time period in which the Canadian advantage emerges. It turns out that the large Canadian advantage observed among 15-to 16-year-olds is already evident among young children, before formal schooling has started."}, {"section_title": "EXPLAINING VARIATION IN INTERNATIONAL TEST SCORES: THE SCHOOL-BASED APPROACH", "text": "A large portion of the literature that seeks to explain differences in cross-national educational performance focuses on the influence of teachers, curriculum, and various features of schools (Baker 1993; The Finland Phenomenon 2011; Tucker 2011). From this perspective, low U.S. scores on international tests are indicative of poorly performing schools often characterized by inefficient or outdated curriculum (Hirsch 2006;Wagner 2008), ineffective teaching (Gordon, Kane, and Staiger 2006), and unproductive use of instructional learning time (Baker et al., 2004;Silva 2007). U.S. schools are also questioned for their lack of standardization (Asia Society 2006;Zhao 2009) and an unequal allocation of classroom resources (Greenwald, Hedges, and Laine 1996;Roscigno 1998). Furthermore, scholars supporting marketbased reforms have questioned the efficiency of current educational practices and the functioning of educational institutions at large (Chubb and Moe 1990;Walberg and Bast 2003)."}, {"section_title": "Teacher Quality", "text": "Recently, scholars have directed considerable attention toward understanding teacher quality, teacher preparation, and how different teachers influence student learning (Akiba, LeTendre, and Scribner 2007;Chetty, Friedman, and Rockoff 2011;Hanushek 2011). In a study by Gordon et al. (2006), teachers were ranked according to the impact they made on student learning during two consecutive years in order to predict an estimated impact for year three. The results indicate that the accumulated effects of high-quality teachers (top quartile) are substantial. The authors note that continued effects of top-quartile teachers for four consecutive years would be enough to close the black-white test score gap. Similarly, Chetty et al. (2011) studied teachers of third-through eighth-grade students and concluded that replacing a teacher whose value-added rating is in the bottom 5 percent with an average teacher would increase the average classroom's lifetime earnings by more than $250,000. Clearly, teacher quality varies and students learn more, perhaps substantially more, with high-quality versus low-quality teachers. While studies by Gordon et al. (2006) and Chetty et al. (2011) are confined to the domestic realm, teacher quality has also become an increasingly researched topic at the international level (Akiba et al. 2007; The Finland Phenomenon 2011; Fuchs and Woessmann 2007;Tucker 2011). This trend is further evidenced by continued developments in data collection targeting teacher information via large-scale international tests (PISA, Trends in International Mathematics and Science Study [TIMSS], and Progress in International Reading Literacy Study [PIRLS]) as well as the specific Teaching and Learning International Survey (TALIS)."}, {"section_title": "Curriculum", "text": "In addition to concerns about teacher quality, another school-based explanation for the poor performance of U.S. students on international tests has to do with curriculum. Concerns about school curriculum focus on a lack of standardization and efficiency and the need for wholesale revision (Hirsch 2006;Wagner 2008). After witnessing the academic rise of several East-Asian nations and economies that rely heavily on curricular standardization (Shanghai, Taiwan, Macao, Hong Kong, etc.), some U.S. education reformers and policy makers have diagnosed the fragmented and decentralized U.S. curriculum as a major obstacle (Zhao 2009). Moreover, cross-national research has established a positive relationship between test scores and the presence of centralized curriculum-based exit examinations in secondary school 1 (Fuchs and Woessmann 2007). If the U.S. curriculum is decentralized in such a way that some students are simply not exposed to the concepts tested in PISA, then this would surely help explain the below expectation performance. Toward this end, curricular reform efforts have resulted in the adoption of the Common Core Curriculum by 46 of the nation's states. This common core strives to provide a ''consistent, clear understanding of what students are expected to learn, so teachers and parents know what they need to do to help them'' (Common Core State Standards Initiative 2011). Additionally, some maintain that the U.S. curriculum is outdated and rather ineffective in today's world of global and technological innovation (Wagner 2008;Zhao 2009). Portions of PISA 2009 were conducted via computer, and the overall material is designed to assess competency for real-life problems (OECD 2009). An outdated and repetitive curriculum would not prepare U.S. students well for this assessment."}, {"section_title": "Learning Time", "text": "Many have also found the allocation and use of learning time as a cause for concern (Büttner and Thompsen 2010;Silva 2007). There is some evidence that American students spend more time in the classroom, in after-school programs, and on homework, yet their achievement levels trail behind their counterparts in other nations. Out of 30 OECD nations, only 4 countries (Mexico, Greece, United Kingdom, and Canada) report a higher amount of total learning hours (OECD 2011a). Many researchers maintain that this epitomizes an instance of quality over quantity; that is, learning time is important up to a certain threshold, but after this we see diminishing returns (Baker et al. 2004;Silva 2007). The focus, therefore, should be on quality and the effective delivery of academic content, not simply the time spent in school (hence the current focus on teacher quality). The effects of time on learning, however, are unclear. It is perplexing that the United States is reported to have more total learning hours in the 180day school year than Japan or South Korea, which have 243 and 220 respective school days per year (Pinar 1995). It seems logical that more exposure to school would result in more learning. A range of studies concerning teacher strikes (Podair 2004), school year restructuring (Pischke 2007), and student absenteeism (Ready 2010) reveal the detrimental effects of decreased exposure to school on learning outcomes. These contradictions regarding time and learning are a prime example of the complexities of educational research, especially from a cross-national perspective."}, {"section_title": "AN ALTERNATIVE APPROACH: SOCIAL CONDITIONS AND EARLY LEARNING GAPS", "text": "Understanding how schools matter requires recognizing that they operate in different contexts. Schools serving children from poor family environments, for example, face very different challenges than schools serving advantaged children (Ladd 2012). Seasonal comparative education research within the United States demonstrates the utility of this perspective. Seasonal research examines how children's lives and learning change from when they are in school (academic year) versus when they are out of school, during the summer months (Davies and Aurini 2012;Downey, von Hippel, and Broh 2004;Downey, von Hippel, and Hughes 2008;Entwisle and Alexander 1992;Heyns 1978). For example, Downey et al. (2004) found evidence that schools increase average learning rates for all students while also reducing inequality in learning rates between students. In short, inequality would be much greater if not for schools. These results indicate that the driving force of learning inequality comes from children's disparate non-school environments and suggest that we rethink the relationship between schools and inequality. In addition, seasonal research upends thinking about which schools are performing well and which are failing. Most methods for measuring school quality confound school and nonschool factors, making it difficult to identify school quality, but seasonal researchers have developed unique ways of isolating school effects. Downey et al. (2008) gauged school quality by observing the extent to which students' learning rates increased between summer and the school yearwhat they termed impact. Using this evaluative tool, they concluded that three out of four schools currently vulnerable to the ''failing'' label are actually performing well. The key lesson from this research is that successfully comparing schools in terms of quality requires recognizing the different contexts in which those schools operate. In this study, I extend these lessons from U.S.based seasonal research to our understanding of international test scores. Rather than assume that differences in scores among countries are a product of school-related factors, I consider how societallevel contexts matters. Perhaps some countries do well not so much because their education systems are excellent, but because they have low poverty rates, generous welfare systems, and high-quality early child care. However, separating the school from the non-school factors that influence international test scores is a difficult challenge. Internationally comparable seasonal data do not yet exist. My strategy is to compare children's scores at a young age (4-5), a period when most have not yet started formal schooling. Of course, many children at this age have already experienced some form of schooling, such as preschool or child care, 2 and so comparisons among 4-to 5-year-olds do not strictly represent ''non-school'' patterns, but they provide important information about when gaps in cognitive skills between countries first emerge and the role that formal schooling processes play. If there are minimal gaps between countries at ages 4 to 5 but large gaps among adolescents, formal school systems are implicated. But if large gaps between countries already exist at ages 4 to 5 and change little after that, then we should direct our attention to differences in children's early childhood experiences across countries. Indeed, a growing body of research points to the crucial importance of early childhood cognitive development for later academic achievement and school success (Duncan et al. 2007;Esping-Anderson 2007;Lee and Burkham 2002), yet currently, all large-scale international education data collection and research take place later in the school process. Perhaps the learning gaps we observe in these international test score results are already formed before children even start school, a scenario that would implicate social inequalities outside of school as the engine behind adolescent skill differences. This approach not only highlights the importance of broader contextual conditions that are apparent at a very young age, but also the lasting consequences of these influences for children as they progress through school (Alexander, Entwisle, and Olson 2007;Duncan and Magnuson 2011). In what follows, I detail several possible ways in which social conditions beyond the control of local schools affect learning in the United States and Canada."}, {"section_title": "THE PRESENT STUDY: THE UNITED STATES AND CANADA", "text": "In this study I compare the trajectory of early cognitive skills in the United States with a reference group in Canada. I compare U.S. scores with Canada for several reasons. First, Canada is among the several nations that tend to outperform the United States on international tests of math and reading skills among adolescents. Second, Canada provides an apt comparison to the United States as the two nations hold many broad similarities (living standards, occupational structures, demographics, educational attainment, decentralization, and expansive geographies), yet they also differ in significant ways (Davies and Hammack 2005;Ogmundson 2002;Zuberi 2006). For instance, Canada has distinct social welfare policies (Brady 2009;Lipset 1990;Zuberi 2006) that provide a different early childhood context that could be of consequence for children's learning trajectories. Finally, it is especially difficult to locate data that allow for international comparisons of children's cognitive skills at an early age. Because the Peabody Picture Vocabulary Test-Revised (PPVT-R) is administered to 4-to 5year-olds in both the United States and Canada through nationally representative surveys, the U.S./Canadian comparison is one of the few currently available to researchers. In the following, I contrast some of the societal-level features that vary across the United States and Canada."}, {"section_title": "Explaining the Canadian Advantage: The School-based Approach", "text": "Canadian students have continually and significantly outperformed U.S. students in reading, math, and science since the first PISA assessment in 2000. 3 Findings indicate that U.S. reading scores are .3 to .4 standard deviations lower in the United States than in Canada, a difference of about one year of schooling (Willms 2004). A recent report from the OECD (2010) documents the development of current educational practices in the province of Ontario to serve as a reference point for U.S. education reform. The authors argue that Canada provides a valuable model for reform in the United States as both countries serve a culturally heterogeneous population through a highly decentralized school system spread across large geographic areas. In institutional terms, educational paths and groups (general, advanced, vocational) are also mirrored from one country to another (also see Levin 2011). When asked to explain the overall success of the Canadian school system, common responses from Canadian officials focused on policy implementations such as equalized funding across schools and teacher selectivity as well as the influence of Canadian culture. Levin (2008) attributes the success of educational reforms in Ontario to the strategic implementation of key goals focused on professional development, reductions in class size, leadership development, and the collection and effective use of data. Last, an interesting difference between recent reforms in the United States and Canada is the lack of marketbased principles (performance pay, accountability, and competition) in the Canadian reform agenda. Instead, Canadian reforms have focused on ''culture, leadership, and shared purpose'' (OECD 2010:75)."}, {"section_title": "Explaining the Canadian Advantage: Social Conditions", "text": "While there is variation in educational practices across the United States and Canada, I posit that the greater and more meaningful variation between the countries lies in the social conditions outside of school. Differences in absolute and relative deprivation, poverty rates, as well as social welfare policies represent the most influential social conditions that may contribute to the differential development of learning and cognitive skills across the two countries. The use of seasonal comparison in Canada by Davies and Aurini (2012) speaks to this point. In their analysis of children in Grades 1 through 3, the authors find that while summer learning loss also occurs in Canada, especially for low socioeconomic status (SES) students, it does so to a lesser degree than in the United States. This finding suggests that the social conditions outside of school affect learning in both countries, yet these conditions have a greater impact within the U.S. context. In what follows, I discuss the possible role of these social conditions in the emergence of early childhood learning gaps across the United States and Canada. I also detail several additional non-school factors (health/health care, racial/ethnic disparities, and family structure/ involvement) intricately related to these broad societal-level conditions."}, {"section_title": "Differences in Absolute Social Conditions", "text": "If absolute living conditions are simply worse (and moderated less through social policy) in the United States, then life conditions at the lower end of the socioeconomic distribution may play a significant and negative role for childhood cognitive development and later academic achievement (Lee and Burkham 2002;Rank 2004). Furthermore, poverty, especially the experience of childhood poverty, has been confirmed as a substantial hindrance to learning, school achievement, and school completion (Ladd 2012;Rank 2004). In this regard, Rank (2004:114) states, ''Poor children are often unable to take full advantage of the education they do receive as a consequence of poverty.'' Some notable differences in absolute living conditions between the United States and Canada include: infant mortality rates (5.98 per 1,000 live births in the United States vs. 4.85 in Canada), life expectancy (78.5 years in the United States vs. 81.5 years in Canada), and poverty rates (15.1 percent in the United States vs. 9.4 percent in Canada 4 ) (CIA 2012)."}, {"section_title": "Differences in Relative Social Conditions", "text": "In addition to the absolute level of material conditions, U.S. scores on international tests may lag behind those of Canada's because greater income-based inequality exists in the United States. The Gini income inequality index (0-1, where 1 corresponds to higher inequality) depicts this relationship with respect to the present study; while the U.S. coefficient ranks in at .45, between Bulgaria and Cameroon, the Canadian coefficient is .32, neighboring countries such as Taiwan and Spain (CIA 2011a). Hence, there is substantially greater inequality in the United States than in Canada. A society with high inequality, independent of absolute conditions, may struggle to produce strong scores on international tests because of the performance of its poorest students. In this regard, Willms's (2004) analysis of SES-based learning gradients reveals that (1) U.S. scores are more variant and (2) the slope of the SES gradient line is much steeper in the United States than in Canada. In other words, relatively affluent students have similar scores across countries, yet disadvantaged students in Canada score far better than their counterparts in the United States (Willms 2004). 5 Recent research that focuses on the relationship between education and inequality is consistent with this view. Condron (2011) finds that higher rates of national-level inequality increase the proportion of low-achieving students, therefore decreasing average scores overall. One possible explanation of this pattern is that higher inequality contributes to a greater dispersion of necessary resources. In addition, a comprehensive study of cognitive test results over a period of 40 years by Reardon (2011) provides compelling evidence that the current achievement gap between the rich and poor in the United States is now 30 percent to 40 percent larger than it was in the 1970s. The author posits that this widening gap may be due to a number of mechanisms, including increasing income inequality, a higher return on income in regards to securing educational and cognitive advantages, as well as the higher probability for parents who are well off to invest time and resources in their children's education."}, {"section_title": "Culture, Policy, and Institutions", "text": "In an extensive review and analysis of historical, cultural, and institutional features of the United States and Canada, Lipset (1990) utilizes historical analysis and comparable public opinion polls to demonstrate the dominant mentalities and ideologies that occur across the United States/Canada border. While the United States has been characterized by radical individualism, populism, anti-statist sentiments, and liberalism, Canada emphasizes group rights over individual rights, deference to authority, trust in federal government, and collective sentiment. These opposing identities have continuously shaped policy, action, and institutions within the two nations and have therefore had substantial repercussions in the realms of health care, welfare, and education, among others. Indeed, Canadian policies on education and poverty have been and continue to be focused on early intervention (both academic and medical) as well as the overall importance of schools as instruments of equity (Ferguson, Bovaird, and Mueller 2007). Brady (2009) examines a number of social spending features across 18 nations. Canada and the United States are both categorized as liberal welfare states, but with notable differences. Adapted results from Brady (2009) are listed in Table 1. From the data in Table 1, one can see how the Canadian support system provides more generous benefits to its citizens in terms of welfare expenditures, public health, and unemployment insurance (percentage paid and duration). Ogmundson (2002) also notes that as a result of the more generous welfare system, the Canadian working class is able to enjoy greater income security and access to public services when compared with the United States (see also Zuberi 2006). Moreover, as social welfare policy is particularly important for moderating the effects of poor living conditions (Kenworthy 2011), these patterns may affect a nation's educational outcomes in meaningful ways."}, {"section_title": "Health and Health Care", "text": "Child health and access to health care represent additional examples of non-school factors that readily translate into academic performance (Rothstein 2004). Low birth weight has been associated with weaker academic abilities before the start of formal schooling and with subsequent performance later in school (Conley and Bennett 2000; Lynch 2011). The World Health Organization (WHO) estimates the percentage of low birth weight infants to be 6 percent and 8 percent in Canada and the United States, respectively (WHO 2004). Additionally, health care practices and insurance programs vary between the United States and Canada (Lasser, Himmelstein, and Woolhandler 2006), with the United States commonly criticized for its fragmented and unbalanced system (Reid 2009). Meanwhile, Canadians have the benefit of a well-established national health insurance program and a strong social safety net (Zuberi 2006). In this way, one can envision the divergent early childhood paths that are constructed in these two different countries and perhaps one possible way to explain the higher proportion of low-achieving students in the United States."}, {"section_title": "Racial/Ethnic Disparities", "text": "Levels of racial and ethnic heterogeneity provide another example of broader non-school factors that can affect educational systems and outcomes. School systems serving more diverse populations can encounter challenges associated with culture, language, residential segregation, and embedded disadvantage. Fischer et al. (1996:172) note, ''groups score unequally on tests because they are unequal in society.'' The National Center for Education Statistics (NCES) released a report following the 2009 PISA assessment in which U.S. scores are categorized based on race and ethnicity. While the overall mean score for U.S. students in reading was 500, the mean score for white, non-Hispanic students was 525 (NCES 2010). The overall PISA reading score for Canadian students was 524. Many of the high-performing countries such as Finland, Canada, and Japan contain relatively homogenous populations. In Canada, 20 percent of the population identifies as a visible minority (including those identifying as aboriginal; Statistics Canada 2006); meanwhile, approximately 35 percent of the U.S. population identifies as a minority or of Hispanic origin (CIA 2011b). In both the United States and Canada, students born in each country perform better than their foreign-born counterparts on PISA; yet once again, the difference between the two groups is more drastic in the United States (additional analysis available upon request). This difference likely derives from the number, education, types of social services provided in each country, and country of origin of those foreign-born students taking the PISA reading assessment. A brief assessment of immigration rates over the time period of the current study provides insight as to how national differences in immigration may explain test score differences, especially as foreign-born students may have taken PISA reading but did not participate in the PPVT-R at ages 4 to 5. From 1990 to 2009, the U.S. foreign-born population rate has climbed from 7.9 percent to 12.5 percent of the total population, with the largest numbers of immigrants coming from Mexico, China, and the Philippines (Migration Policy Institute 2010). Meanwhile, the foreign-born population in Canada has risen from 16.1 percent in 1991 to nearly 20 percent by 2006, with large proportions of immigrants arriving from China, Hong Kong, Philippines, India, Morocco, Pakistan, Iran, the United Arab Emirates, and many Caribbean nations (Human Resources and Skills Development Canada 2011). Moreover, immigrants to Canada tend to be highly educated; for instance, 35.7 percent of immigrants from 1996 to 2001 held a university degree (Migration Policy Institute 2011)."}, {"section_title": "Family Structure and Involvement", "text": "Last, many researchers have found that family structure has an impact on educational achievement and that children from single-parent households are at a disadvantage when compared to children who live with both parents (Downey 1994;Lee and Burkham 2002). Using PISA 2000 data, Hampden-Thompson (2009) discovered that single-mother households make up a sizeable population in many OECD countries, yet the performance gap between children from single-mother households and their counterparts with both parents varies across countries, with the largest gap occurring in the United States. As of 2000, single-mother families accounted for 18 percent of families in the United States but just 11 percent across the Canadian border. Yet, what is most striking is that the performance gap between the two different family structures on the PISA reading assessment is 13 points in Canada and 36 in the United States. The author suggests that this pattern may be attributed to economic deprivation, the lack of a strong social safety net, higher costs of child care, and higher proportions of never-married single mothers in the United States. A related body of research shows the importance of promoting scholastic achievement at home; this is especially significant given the amount of time children spend outside of school (Walberg 1984). Two recent reports, ''What Can Parents Do to Help Their Children Succeed in School'' (OECD 2011b) and ''Back to School: How Parent Involvement Affects Student Achievement'' (Center for Public Education 2011), emphasize the importance of learning that takes place at home in addition to school. Not surprisingly, these extracurricular learning goals are closely tied to family structure, home environment, and related social policies (Booth and Crouter 2008;Esping-Anderson 2007)."}, {"section_title": "HYPOTHESIS", "text": "Based on the higher degree of economic inequality (Condron 2011) and salience of detrimental nonschool factors in the United States (Hampden-Thompson 2009;Willms 2004), I hypothesize that the learning gap observed between U.S. and Canadian 15-to 16-year-olds' PISA scores will already be in place when measured using PPVT-R scores at ages 4 to 5."}, {"section_title": "DATA AND METHODS", "text": "I utilize three separate data sets to address my research questions: (1) the National Longitudinal Study of Youth 1979-Children and Youth (NLSY79), which administers the Peabody Picture Vocabulary Test-Revised in the United States; (2) the National Longitudinal Study of Children and Youth (NLSCY), which administers the PPVT-R in Canada; and (3) the Programme for International Student Assessment, which administers a reading assessment to students in both the United States and Canada. In both NLSY79 and NLSCY, the PPVT-R is used to assess nationally representative samples of 4-to 5-year-old children on a biennial basis as an assessment of early cognitive skills and school readiness. For the later assessment, the reading portion of PISA provides nationally representative crosssectional samples of 15-to 16-year-old U.S. and Canadian students. While this method requires the use of distinct data sets with different sampling strategies, each is considered nationally representative. Moreover, this strategy has been utilized successfully in previous research (Grodsky, Warren, and Kalogrides 2008;Reardon 2011). For the early assessments, I limit each sample to children aged 48 to 71 months (4-5 years) old at the time they were administered the PPVT-R. In order to gain a broader perspective of these learning gaps across time, I utilize data from three consecutive cycles (1994, 1996, and 1998), roughly corresponding to the age trajectory at which the similar youths would take PISA 11 years later (the 1998 PPVT-R cohort matches perfectly with the PISA assessment in 2009). Sample sizes for the United States are 483, 296, and 493 for the respective assessment years of 1994, 1996, and 1998. For the majority of analyses, these samples are combined to increase sample size. In these instances, sample sizes are also combined for the other assessments in order to mirror this adjustment. Missing cases are coded as such and not utilized in analysis. Moreover, as the missing cases regard the dependent variable in my study, imputation would not provide more accurate parameter estimates (von Hippel 2007). Similarly, I utilize Canadian data via NLSCY for three consecutive cycles (1994, 1996, and 1998 6 ) that align perfectly with NLSY79 assessments in the United States. It is worth noting that while the child sample of NLSY79 is composed of children of the original female participants, NLSCY is a child-based sample that began data collection more recently in 1994. 7 After restricting each survey year to children ages 4 to 5 who were administered the PPVT-R, final sample sizes include 3,286 in 1994, 2,559 in 1996, and 7,499 8 in 1998. In all survey years, sample sizes in Canada are substantially larger than those for the United States. While each survey is considered nationally representative, it may however be the case that the Canadian results have more statistical accuracy as a result of the larger sample size. Childlevel sampling weights are utilized for all calculations in order to adjust the samples in light of national populations."}, {"section_title": "The Peabody Picture Vocabulary Test-Revised", "text": "The PPVT-R is most often used to measure receptive vocabulary, comprehension, and school readiness for children ages 3 to 6. The PPVT is the leading assessment tool for general verbal ability in standard English 9 and has been well respected for over 50 years in the educational testing field. In the United States, development, norming, and national standardization took place between 1976 and 1980. The norming sample included 4,200 nationally representative American children and youth (economically disadvantaged individuals and minorities were oversampled). Similarly, a norming sample was performed in Canada in conjunction with the original authors of the test during the early 1990s and is also considered nationally representative (although the norming sample and subsequent NLSCY PPVT-R samples do not include participants from the sparsely populated Northern Territories). The PPVT-R is an untimed exercise and is conducted on an individual basis. Assessment typically lasts between 10 and 20 minutes. Each segment of the test consists of four illustrated pictures per page. The examiner clearly pronounces a description of one of the pictures present and the participant must successfully indicates (verbally or nonverbally) the correct picture in order to receive credit (Pearson Education 2011). Age standardization of the sample is achieved by converting raw scores into ability scale scores that account for each question's level of difficulty. 10 These scores are then transformed into standardized scores (mean 100, standard deviation 15) through the use of normal deviates (Dunn and Dunn 1981). In this way, scores from both the United States and Canada are standardized by age and are therefore directly comparable. 11 Duncan et al. (2007) find that measures of early language and reading skills, such as vocabulary and knowing letters, words, and sounds, are almost always statistically significant predictors of later school success in reading achievement. More broadly, the authors find that reading skills, such as those measured in the PPVT-R, at the point of school entry are consistently associated with high levels of academic performance later in school. Indeed, Williams and Wang (1997) report a correlation of .80 between the PPVT-R and the ACT composite score (the most widely accepted college entrance exam in the United States). Research using NLSY data by Han, Waldfogel, and Brooks-Gunn (2001) establishes the consistent predictive power of PPVT-R measurements at ages 3 to 4 with later measurements on the Peabody Individual Achievement Test (PIAT) reading and math assessments at ages 5 to 6 and 7 to 8. The authors note that while they utilize two different cognitive assessments at two different points in time, ''these variables should allow us to assess . . . the cognitive development of a child over time while still using tests that are appropriate to the age of the child'' (Han et al. 2001:340). This methodology is reflected in the present study. While the PPVT-R and PISA are different tests, the subject matter is appropriate to the age of the child/student in order to measure verbal and language skills at two different points in time."}, {"section_title": "The Programme for International Student Assessment", "text": "I establish the magnitude of the Canadian advantage in secondary school by analyzing data from the Programme for International Student Assessment for the years 2000, 2003, and 2009. My sample is limited to two nations, United States and Canada, and focuses strictly on results from the reading portion of PISA. My sample population is therefore all respondents from the United States and Canada. No missing values are reported for student assessment scores. PISA is a nationally representative sample of 15-to 16-year-old students, in both public and private schools, and has been administered every three years since 2000. 12 The 2009 PISA assessment included 65 participating nations or independent economies (32 of which are OECD nations). Typical sample sizes range from 4,500 to 10,000 students (Statistics Canada 2008). Scores are standardized so that the OECD average is 500 with a standard deviation of 100. Each PISA subject assessment (math, science, or reading) lasts at least 60 minutes, depending on the subject focus of the given assessment year. I focus analysis on the reading portion as it most closely relates to the receptive vocabulary and verbal comprehension skills assessed in the PPVT-R. Within the PISA reading section, students are asked to read the given passages, tables, flow charts, and so on and then answer the corresponding questions, which are designed to assess overall life skills such as comprehension and critical thinking. The PISA reading framework defines reading literacy as ''understanding, using, reflecting on and engaging with written texts, in order to achieve one's goals, to develop one's knowledge and potential, and to participate in society'' (OECD 2009). In a similar fashion, yet at a much younger age, the PPVT-R is designed to tap into ''comprehension of the spoken word'' (Dunn and Dunn 1981). Therefore, while these two assessments are not identical or used for the same purposes, the critical testing material in each assessment closely relates to verbal ability, vocabulary, and language. I argue that the PPVT-R assesses verbal skills at ages 4 to 5 that are closely tied to the reading comprehension skills measured later in PISA. Strong correlations of the PPVT-R with later assessments of vocabulary, intelligence, achievement, and language (Williams and Wang 1997) 13 support the argument that the PPVT-R does in fact measure some degree of intelligence and achievement and that it specifically measures those skills linked to vocabulary, verbal comprehension, and literacy skills. Indeed, the development of early vocabulary skills has been strongly and positively associated with later school performance (Duncan et al. 2007;Lee and Burkham 2002). Descriptive statistics and Cohen's d standard deviation units are used to evaluate the data from these different assessments. Cohen's d is a measurement of effect size that is utilized to provide a standardized difference between means. In this way, the PPVT-R gap between the United States and Canada at ages 4 to 5 can be compared, using standard deviation units, with the subsequent United States and Canada gap in the PISA reading assessment at ages 15 to 16. I focus analysis on the learning gaps (standard deviation units) between the United States and Canada in terms of overall mean scores and throughout select portions of the scoring distribution (upper and lower quartiles/deciles). 14"}, {"section_title": "RESULTS", "text": "What Is the U.S./Canada Learning Gap at Ages 15 to 16? Using pooled PISA reading results from 2000, 2003, and 2009, I examine the learning gap between U.S. and Canadian students at ages 15 to 16. Table 2 reveals overall mean scores of 529 in Canada and 500 in the United States, a score difference of nearly 30 points. In Table 3, I convert these score differences to standard deviation units, which can be interpreted as the size of the Canadian advantage. Consistent with previous research (Willms 2004), the overall learning gap between the United States and Canada is represented as 0.30 standard deviation units and can be roughly translated as an advantage equivalent to a year's worth of learning in school. The U.S. scoring distribution contains greater variation, with a standard deviation of 101 versus 91 in Canada. Specifically, U.S. scores are skewed toward the low end. This point is magnified when different portions of the scoring distribution (upper/lower deciles and quartiles) are compared between the two countries. Mean scores on PISA reading in the upper decile and quartile (Table 2) are not separated by a wide margin, yet scores at the low end reveal large differences, as the bottom of the scoring distribution is much lower in the United States when compared with Canada. While mean scores in the upper portion of the scoring distribution are separated by 10 points, the lower end of the distribution depicts a difference up to 33 points. In terms of standard deviation units (Table 3), the Canadian advantage in the upper decile is 0.29 standard deviation units, while this increases to 0.78 in the lower decile. In other words, U.S. students at the low end of the scoring distribution in PISA reading are outpaced by their Canadian counterparts by the equivalent of two years' worth of learning in school. At this point, Table 3 merits some further discussion and explanation. On the surface, it is strange that the overall gap is outsized by learning  2000, 2003, and 2009. gaps in every other portion of the scoring distribution. The reason for this is that the calculations to determine the size of the Canadian advantage utilize pooled standard deviations for each specific subgroup or portion of the distribution. Smaller subgroups will have smaller standard deviations. This means that the calculated standard deviation units are affected by these changes and therefore provide results uniquely interpretable to that selected portion. The raw point differential from one scoring group to the next might not change substantially, but the change in the standard deviation can be more meaningful. For example, a 29-point difference in mean scores for the overall PISA distribution with a pooled standard deviation of 96 yields a standard deviation unit gap of 0.30. Meanwhile, a similarly sized 33-point difference in the lower decile with a smaller pooled standard deviation of 42 yields the much larger gap of 0.78 standard deviation units. To illustrate this point further, a 10-point difference in the upper decile with a pooled standard deviation of 33 produces a standard deviation unit gap of 0.29. While this is remarkably similar to the overall gap of 0.30, it should be kept in mind that a single point change would affect the learning gap in this subgroup more noticeably than it would in the overall scoring distribution. What Is the U.S./Canada Learning Gap at Ages 4 to 5? The unique contribution of this study is to expand the comparison of learning gaps across the United States and Canada in secondary school by also examining the magnitude of this gap at a much younger age, before the start of formal schooling. Using multiple years of data from NLSY and NLSCY, I compare children's test scores on the PPVT-R. Table 2 shows that the Canadian advantage for the overall scoring distribution at ages 4 to 5 is nearly 5.5 points. The PPVT-R and PISA reading scores are set to different scales, so a 5point lead on the PPVT-R means something entirely different than a 5-point lead in PISA. The standard deviation units in Table 3 make this comparison possible. The size of the Canadian advantage for the entire scoring distribution among 4to 5-year-olds is 0.30 standard deviation units. Notably, the learning gap reported in PISA reading (also 0.30) among 15-to 16-year-olds is entirely in place before the start of formal schooling. At the time of this early childhood assessment, the Canadian advantage (Table 3) in the upper decile is 0.63 standard deviation units. However, the advantage in the lower decile is an astounding 3.2 standard deviation unit gap, signifying a sizeable difference in scores between U.S. and Canadian children. Returning to the descriptive statistics in Table 2, this gap in the bottom 10 percent of the scoring distribution is represented by a 31-point difference on the PPVT-R (73.67 in Canada vs. 42.79 in the United States). Yet, perhaps the most striking pattern of the scoring distribution concerns how these learning gaps change over time. From the time of the PPVT-R at ages 4 to 5 to PISA reading at ages 15 to 16, the Canadian advantage decreases at each point in the scoring distribution. This pattern is especially stark in the lower end of the distribution (for the lower decile, a gap of 3.2 for the PPVT-R declines to a gap of 0.78 by the time of the PISA assessment). In other words, the time in between assessments narrows these learning gaps, with especially dramatic reductions in the lower portion of the scoring distribution. What Is the U.S./Canada Learning Gap for Specific Cohort Comparisons? While the previous analyses combined multiple years of data for each assessment in both countries, it may also be useful to examine learning gaps through specific cohort matching. Rather than pooling the data across multiple years, I identify cohorts of children who took the PPVT-R at ages 4 to 5, as well as the PISA reading assessment 11 years later when they are ages 15 to 16. Using this age trajectory, different cohorts can be matched to approximate a longitudinal perspective on cross-national learning gaps. The downside with this approach, however, is the reduction in sample size, especially for the U.S. PPVT-R results (N = 483 in 1994;N = 493 in 1998). In Table 3, Cohort 1 demonstrates results consistent with those calculated with the pooled data. The only sizeable difference is a larger gap in the upper portions of the scoring distribution at ages 4 to 5 (0.90 and 0.89 standard deviation units). However, Cohort 2 reveals some interesting changes in the size of the cross-national learning gap. (1) In Cohort 2, the size of the Canadian advantage has decreased for both assessments at each point in the scoring distribution. (2) For both the overall score as well as the upper quartile, the Canadian advantage increases slightly from one assessment to the other. In terms of the size of the overall learning gap in this particular cohort over time (0.21 in 1998 and 0.26 in 2009), results indicate that 80 percent of the gap is in place before the start of formal schooling. While this cohort analysis adds nuance to the results, the overall findings remain unchanged. Specifically, every portion of the scoring distribution for each assessment reveals a Canadian advantage that is entirely or largely in place at the time of the PPVT-R assessment at ages 4 to 5. In almost every case, the magnitude of the learning gap decreases over time, with the most substantial reductions occurring in the lower part of scoring distribution. In sum, whether the focus is on pooled data or an analysis where the PPVT-R and PISA cohorts match precisely, the conclusion is the same: Most or all of the U.S./ Canadian gap in skills among 15-to 16-year-olds is already evident among 4-to 5-year-olds."}, {"section_title": "DISCUSSION", "text": "The mediocre performance of U.S. students on international education assessments such as PISA is widely known. The most provocative finding of this study is that the learning gap between U.S. and Canadian students in PISA is largely, perhaps entirely, in place before the start of formal schooling, at ages 4 to 5. As the cross-national learning gap is in place before formal schooling had a chance to impact test scores and learning, this evidence suggests that broader social conditions constitute the driving force of learning inequalities. This is consistent with recent research by Duncan and Magnuson (2011) that highlights the existence of income-based achievement gaps at the onset of kindergarten that remain unchanged as children progress through school. Analyses also indicate that the overall learning gap is driven by the bottom portion of the scoring distribution, consistent with the findings of Condron (2011). While high-performing students in the United States and Canada have similar scores across both assessments, the learning gap widens toward the low end of the scoring distribution. This piece of evidence directs our attention toward national-level social conditions consistently associated with lower academic performance, such as poverty, early childhood health/ development, and inequality (Ladd 2012). Another important finding is that in almost every subgroup of the scoring distribution, the magnitude of the Canadian advantage declines from the time of the PPVT-R at ages 4 to 5 to the subsequent PISA reading assessment at ages 15 to 16. This pattern is especially noticeable in the lower end of the distribution. Whether using pooled data or matched cohorts, the Canadian advantage in the lower decile is reduced by 2.0 standard deviation units or more from ages 4 to 5 to ages 15 to 16. What occurs in the 11 years between these assessments is especially beneficial for the lowest scoring students in the United States. This is consistent with the findings of seasonal research within the United States that suggest that schools are most beneficial for the most disadvantaged students (Downey et al. 2004). Furthermore, other scholarship indicates that the positive effects of schooling are more apparent in societies with greater inequality (Chudgar and Luschei 2009). In this light, we can begin to think about early childhood learning gaps and international test score rankings in a different way that accounts for the considerable weight of social conditions outside of school (Ladd 2012). It now becomes possible to suggest that even though one nation's test scores are considered excellent, the educational system of a competing nation with lower scores may actually be performing at a similar pace. Given the weight of persistent social inequalities, U.S. schools and students may in fact be performing much better than what is commonly assumed. As the learning gap in PISA reading is entirely or largely in place when children are 4 to 5 years old, two interpretations concerning the international rankings of national school systems are possible. The first is that contrary to the past decade of PISA results, the United States and Canada are performing on par as the overall learning gap is roughly the same when measured at ages 4 to 5 and then 11 years later at ages 15 to 16. The second interpretation is that U.S. schools are actually performing much better than Canada's, given the initial and accumulated weight of poorer non-school conditions. This point is magnified when observing the reduction of learning gaps over time in the bottom portion of the scoring distribution. If nonschool conditions disadvantage children, schools, and teachers more so in the United States versus other wealthy nations, then it is important to think about the effectiveness of schools within this broader context. Results of large-scale international education assessments need to be understood from a more contextual perspective. However, these findings should not be taken as a victory for the United States. Indeed, the crucial lesson here is that allowing greater inequality in a society has detrimental effects on education and cognitive development. Improving U.S. education requires a broader reform approach that more deliberately considers children's lives outside of school, especially before they start school (Ladd 2012;Rothstein 2004). Of course, this study represents merely a first step toward assessing the emergence of crossnational learning gaps. While I had the advantage of comparing individuals across countries who took the exact same tests within a similar time frame, the current lack of comparable early childhood assessment data is an impediment to more generalizable results. I was only able to compare two countries (United States and Canada) along a single cognitive dimension (reading). It is possible that the U.S. comparison with Canada is an anomaly. However, preliminary analysis of Australian data from the Longitudinal Study of Australian Children (LSAC) reveals results consistent with those reported here. That is, the Australian advantage over the United States in PISA reading is largely in place at ages 4 to 5 when measured with the PPVT. It will be important for future research to assess further the implications of this position by expanding the line of inquiry to a broader number of countries and cognitive assessments. Early comparisons of U.S. students' reading and math skills with some of PISA's highest performing nations, such as Japan and Finland, would be especially provocative. For this to occur, however, there is a critical need for the collection of comparable assessment data during early childhood and continued collection throughout schooling. The ideal data would also include internationally comparable seasonal data that track children as they progress through school. In this way, researchers would be able to separate school year and summer learning rates in order to more clearly assess the effectiveness of school, teachers, and the progress of students. Future research should also focus on a more indepth exploration of the mechanisms that create and moderate these early learning gaps, including but not limited to race, gender, 15 class background, and early educational experiences. For instance, results from supplemental analysis (appendix) indicate that preschool attendance does not explain a large amount of the variance in PPVT-R scores for either country (less so in Canada), 16 yet analysis of PISA 2009 data reveals that on average, students who attended preschool longer score significantly higher on PISA reading than their counterparts who did not attend preschool at all or for less time (OECD 2011a). For the United States and Canada, this could possibly reflect differences in the institutional or curricular organization of early childhood education between the two nations. It is possible to envision a situation in which Canadian preschools may not confer immediate results that would show up in the PPVT-R but that would provide a foundation for continued learning and application that may accumulate by the time of the PISA reading assessment. While early childhood education in the United States and Canada both emphasize social, emotional, cognitive, and motor development, Lall and Lall (1983) reference some notable differences. In Canada, additional points of emphasis include child health and constant cooperation with the home/family in regards to meeting these goals. The example of preschool represents only one of the additional avenues of research related to the findings of the current study. There are additional limitations that need to be addressed before the results can be viewed with great confidence. We do not know what is going on during the 11-year time span between assessments; 17 additional assessments (especially with seasonal components) throughout school would be helpful in highlighting these more nuanced processes. Nevertheless, the fact that the early learning gap exists across countries before school begins is noteworthy itself and strongly implicates the social conditions outside of school as highly significant. Next, some scholars express concerns as to the representativeness of the NLSY79 child sample, as the original sampling frame focused on young, disadvantaged mothers (Wu and Allen Li 2005). Despite the use of revised child sampling weights, there is a possibility that the sample is insufficiently adjusted for disadvantage. 18 If this is the case, then I may be overestimating the large U.S./Canada PPVT-R gap observed among 4-to 5-year-olds. Nevertheless, analysis of the scoring distribution suggests that this concern may be minimized as the top decile of the U.S. distribution is nearly identical to the top decile in Canada. Last, it is important to consider whether there is a disconnect between the kinds of skills measured in the PPVT-R and PISA reading tests. While the formats of the tests are necessarily different because the young children are at a different developmental stage than the secondary school students, there is reason to believe that the skills measured in the PPVT-R are important predecessors for the skills later assessed in PISA reading because they correlate so strongly with similar tests. 19 Despite these limitations, the current study utilizes an innovative method to highlight the emergence of a cross-national learning gap at a very young age. Comparing students in Canada and the United States before and during school, I find that the learning gap commonly referred to in PISA results at ages 15 to 16 is already in place at ages 4 to 5. These patterns, therefore, direct attention toward the important role of broad social factors such as economic inequality, access to health care, child health, racial/ethnic composition, and family structure as the primary sources of inequality in learning and education. If these results are correct and generalizable across countries, it may be that the international differences in test scores are only due in small part to the effectiveness of one nation's schools and educators compared with another. Instead, the larger source of variation may lie in the social inequalities stratified into different national contexts. Examining test scores from a cross-national perspective before and during formal schooling not only reveals the emergence of an early learning gap, but also the enduring nature of these inequalities over time. The findings of this study suggest that we carefully consider the relationship between schools and inequality as well as the implications of international test score comparisons and what they truly mean in regards to school quality and student performance. 1. However, U.S. research on the presence of statewide exit exams finds little support for this relationship (Warren, Grodsky, and Lee 2008). 2. In 1999 the pre-primary (preschool) education gross enrollment rate was 58 percent of the preschool age population in the United States and 64 percent in Canada (UNESCO 2010). The samples in this study reflect similar figures."}, {"section_title": "While Canada generally outperforms the United", "text": "States by a significant margin, there are some exceptions to this pattern (Gaffield 1994;Willms 2004). A number of assessment results from Trends in International Mathematics and Science Study (TIMSS) and Progress in International Reading Literacy Study (PIRLS) provide support for the present study, but depending on the assessment year and grade level, some comparisons are slightly different. However, these exceptions are all drawn from analyses in which the sampling frame in Canada is restricted to a few provinces (typically only 3 out of the 10 Canadian provinces)."}, {"section_title": "The Canadian statistic represents ''the Low Income", "text": "Cut-Off (LICO), a calculation that results in higher figures than found in many comparable economies; Canada does not have an official poverty line (2008)'' (CIA 2012) 5. Baker, Lee, and Heyneman (2003) also find this pattern across socioeconomic status (SES) gradients when comparing TIMSS scores of disadvantaged American students with their counterparts in 12 other wealthy nations. 6. Due to restricted-use data in Cycle 3 of the National Longitudinal Study of Children and Youth (NLSCY; 1998), only certain calculations were made with this particular wave. Results for 1998 data were specifically requested from Statistics Canada."}, {"section_title": "As National Longitudinal Study of Youth 1979-", "text": "Children and Youth (NLSY79) participants are the children born to the original NLSY79 mothers, maternal age is generally higher. Meanwhile, participants for NLSCY were selected based on households with children of the appropriate age. For NLSY79, this means that by the time of the 1998 assessment it is impossible for a 4-to 5-year-old child to have a teenage mother. If anything, this makes the results more conservative as Predictors of Peabody Picture Vocabulary Test-Revised (PPVT-R) scores appear to increase with maternal age. 8. Cycle 3 (1998) of NLSCY contained a one-time topup sample of over 5,000 5-year-olds in order to conduct a thorough cross-sectional comparison of Canadian provinces. 9. A fully compatible French version is administered in Francophone Canada (Statistics Canada 2007). 10. The percentage of children (within each age group) receiving each ability scale score is determined, and then these numbers are summed to cumulative percentages of children scoring at or below each ability scale score (Dunn and Dunn 1981). 11. Child-level sampling weights ensure that the samples are nationally representative. Therefore, age standardization makes cross-national comparison possible (National Longitudinal Surveys 2004;Statistics Canada 2007). 12. The 2006 Programme for International Student Assessment (PISA) reading results were rendered invalid for U.S. students due to an error in printing the test booklets. 13. In a comprehensive review of all correlational studies concerning the PPVT-R, the authors find the following ranges of correlations within each of the following assessment domains: vocabulary tests (.40-.76), intelligence tests (.18-.78), achievement tests (.33-.80), and language tests (.42-.75) 14. Previous research with similar methodology (Reardon 2011) recommends that the reliability of each assessment is accounted for during calculations of the estimates. I have been unable to locate reliability details for each specific assessment year of the PPVT-R in the United States and Canada. This adjustment therefore is not made. However, as most assessment reliabilities are very high (.70 to .90), these calculations would affect the results in a minimal way. 15. Analysis of the learning gap by gender reveals a pattern in which the Canadian advantage for boys decreases over time while the opposite is true for girls. I intend to address this finding in future research. 16. The addition of a dichotomous variable for preschool participation to ordinary least squares (OLS) regression models predicting PPVT-R scores increases the R 2 by .005 in the United States and .004 in Canada. 17. However, it is noteworthy that fourth graders in three out of five participating Canadian provinces (Alberta, British Columbia, and Ontario) scored significantly higher than their U.S. counterparts in PIRLS 2006. 18. A subset of U.S. children (5 years, 8 months and older) scored higher on the PPVT-R than expected. This pattern merits further investigation. However, if this anomalous subset is excluded from analysis in both U.S. and Canadian samples, then the 4-to 5-year-old gap would be even larger. 19. A wide range of studies finds strong correlations between the PPVT-R and later assessments of vocabulary, achievement, and language ranging between .33 and .80 (Williams and Wang 1997)."}]