[{"section_title": "", "text": "Over the past fifteen years, new types of \"professional practice\" doctorates (here abbreviated as \"PPDs\") have emerged in a number of professions that had never had doctoral degrees before, not only in the U.S. but in Canada, the United Kingdom, Australia, and elsewhere. New PPD degrees have been created in at least a dozen fields ranging from physical therapy (DPT) and nursing (DNP) to information management (Doctor of Professional Studies, or DPS) and bioethics (DBioethics). In several cases, these doctorates are now or will shortly be required to enter professional practice; in other fields, even though not (or not yet) required, these doctorates have become the normative degree. In the U.S., PPD programs in newly doctoral fields have skyrocketed from near zero to a total of over 500 programs today, with over 10,000 degrees awarded just in 2012; many more programs are in the planning stage. Professional practice doctorates, sometimes called clinical doctorates, generally are shorter than PhDs and do not require original research, but they typically include a clinical component; beyond this, there is little agreement on what they are or should be (Council of Graduate Schools, 2007). 1 As discussed below, many of these new professional practice doctoral programs are being offered at institutions that a decade ago had no doctoral studies. As a result, these institutions are necessarily facing significant challenges as, or if, they transition into doctoral education. These trends raise important policy questions on the effect of new doctorate credentials and programs on professionals, higher education institutions, and the broader society. For example, are these new doctorate programs producing professionals who serve their clients and organizations more effectively? How do new doctoral credential requirements affect access to the profession? What forces are driving the growth of professional practice doctorates? Are they a response to an increasingly By contrast, educational credentialism states that the growth of higher education and the upward ratcheting of postsecondary credentials mainly reflects a labor system that confers differential economic rewards based on social or cultural capital, including educational attainment, rather than on the actual job-related value of one's skills (Brown, 2001;Collins, 1979). Similarly, the gate-keeping function of professional associations serves to control access to the profession and, by doing so, to raise professionals' status and income (Brint, 1993). Many critics of the new PPDs argue that these degrees are driven by professionals' desires to increase their prestige, salary and independence or by professional associations' desire to control the number of entrants into the profession (Bollag, 2007;La Belle, 2004). If status and income are the main drivers for creation of new doctorate degrees, one would expect a domino effect, with proponents for PPDs citing doctoral growth in related professions as a rationale for creating new PPD titles and requirements in their own field. Also, if growth is driven by factors unrelated to an increasingly complex work environment, one would expect to find some professional programs shifting from master's to doctoral titles without commensurate increase in educational requirements. Finally, theories of isomorphism (homogenization) of organizations and academic drift suggest that, over time, institutions become more like one another and more like the high-prestige research universities in which many of their key professional staff (administrators and faculty) were trained and socialized (DiMaggio and Powell, 1983;Morphew, 2009;Riesman,1956). If external regulatory bodies refuse to accredit any programs except those leading to doctoral degrees -or if regulatory bodies require that any doctorates offered, including professional practice doctorates, meet traditional standards -these coercive external pressures may lead institutions to become more like higher-status institutions. Moreover, even when doctorates are not required, the competitive edge that doctoral programs are perceived to have may sway non-doctorate-granting programs to convert to the doctorate. If isomorphism and academic drift theories are correct, one would expect additional institutions to launch PPDs even without being required to do so, particularly at institutions lower on the traditional status ladder, such as nonresearch colleges, for whom PPDs may be seen as a step up."}, {"section_title": "C. STUDY METHODS AND DATA SOURCES", "text": "This investigation employed multiple methods to analyze the emergence and growth of new types of professional practice doctorates, forces driving PPD growth, and their impacts over the past decade (2000)(2001)(2002)(2003)(2004)(2005)(2006)(2007)(2008)(2009)(2010), especially on higher education institutions that had not previously offered doctorates. The study included analysis at three levels: the population of U.S. fouryear higher education institutions; a subset of 155 newly doctorate-granting institutions (i.e., all institutions that awarded one or more doctorates in 2009-10 but had not done so in [1999][2000]; and case studies of two newly doctorate-granting institutions that now offer PPDs."}, {"section_title": "Population of U.S. four-year higher education institutions", "text": "The primary source of U.S. data on the growth and characteristics of professional practice doctorates for this study was the U.S. National Center for Education Statistics' Integrated Postsecondary Education Data System (IPEDS)' Completions Survey for 1999-2000-10. Prior to 2008 data collection, all doctoral degrees, both research and non-research, were classified as doctor's degrees, except for \"first professional\" degrees in 10 specific fields (including JD, MD, and other mostly medical degrees). In response to the growth of new types of doctoral degrees that differed significantly from traditional research doctorates, IPEDS initiated a new classification system starting with 2008-09 degree completions; this new system divides doctorate degrees (including the old first professional degrees) into three categories: doctor's degree-research/scholarship, doctor's degree-professional practice, and doctor's degree-other. This system became mandatory starting with 2009-10 degree completions, and the earlier classifications were dropped. However, institutions can choose in which category to place a particular doctoral program. IPEDS describes the doctor's degree-professional practice as follows: A doctor's degree that is conferred upon completion of a program providing the knowledge and skills for the recognition, credential, or license required for professional practice. The degree is awarded after a period of study such that the total time to the degree, including both pre-professional and professional preparation, equals at least six full-time equivalent academic years. 2 Using IPEDS' Completions Surveys, this investigation determined which institutions awarded PPDs -or awarded any doctorate or former first professional degree -in 1999-2000 or 2009-2010, by academic discipline and detailed disciplinary field, state, control (public/private/for-profit), Carnegie Classifications for 1994 and 2010, degree level and type, and degrees awarded. In addition, professional associations and professional-program accreditation bodies provided detailed national trend data on programs, enrollments, and degrees for several of the new PPD fields."}, {"section_title": "Subset of newly doctorate-granting institutions", "text": "Drawing from IPEDS' Completions database as well as its Institutional Characteristics Survey, this study created a subset of newly doctorate-granting institutions -all 155 institutions of higher education that awarded a doctorate of any kind in 2010 but did not award either a doctorate or first-professional degree in 2000. 3 Although this excludes some doctorate-granting institutions that had doctoral programs but did not award doctoral degrees in 2010, it is a reasonable approximation of institutions that started offering doctorates over the past decade. The IPEDS databases also provided information on the specific six-digit Classification of Instructional Programs (CIP) code, degree type for each degree awarded, and year the institution first awarded doctorates, as well as a measure of mission change through comparison of 1994 and 2010 Carnegie Classifications. 4 The study also reviewed the websites of each of the 155 institutions in the subset in summer and fall 2012, to ascertain what additional doctoral programs, if any, institutions had begun to offer, as well as institutional name changes and other changes."}, {"section_title": "Institutional case studies", "text": "Case studies of two newly doctorate-granting institutions that now offer PPDs were also conducted. Analysis began with extensive review of campus, system-level, and state documents, reports, and legislative bills. This review led to identification of initial interviewees, who in turn identified other key personnel. Twenty key informants were interviewed through semi-structured interviews lasting between 45 minutes and two hours. For both institutions, the interviews included top administrative leaders, including the provost, deans of colleges that offered the PPDs, and program faculty, as well as university system office administrators who had been involved in gaining authorization, implementing, or reviewing the new doctorate programs. Interviews with regional accreditation staff for one case study provided further information on regulatory requirements for institutions beginning doctoral work. Interviewees were assured of confidentiality, so the study does not identify them or their institutions. While most of this study focuses on new types of PPDs that emerged just in the past decade or so, the case study analysis also drew upon findings from one institution's recent implementation of a new professionally-oriented Doctor of Education (EdD) program that had many of the same characteristics and implementation steps as newer types of PPDs. 5 This was included because the slightly longer existence of the EdD program provided more time to assess impacts, and the campus's experience in implementing the EdD informed its subsequent planning and implementation of a newer type of PPD."}, {"section_title": "D. EMERGENCE AND GROWTH OF NEW PROFESSIONAL DOCTORATES", "text": ""}, {"section_title": "Creation of new professional practice doctorate degrees", "text": "The creation of new doctorate degrees and the upward ratcheting of credential requirements and of expectations for professional entry has accelerated in the past ten to fifteen years. Although several professions, such as medicine, dentistry and law, previously created new doctorate requirements (or, as in law, just changed the degree to a new doctorate title), past changes have occurred over a longer period of time. Most of the new types of professional practice doctorates that emerged in the U.S. over the past ten to fifteen years have been in health-related fields, often taking the place of former master's degrees. However, new PPD degrees have also been created in various non-health fields, and doctorates in other fields are being considered. Table 1 lists some of these new PPDs. Occupational Therapy (OTD) Physical Therapy (DPT) a a Now/soon required to enter profession b Increasingly expected for professional entry To understand these developments better, we examined the origins and rationales of several of the largest new PPDs. A brief summary follows."}, {"section_title": "Audiology", "text": "Audiology was the first U.S. field in recent years to mandate that new professionals graduate from an approved professional doctorate, the Doctor of Audiology (AuD). In the early 1990s, the American Academy of Audiology (1991) began advocating for a professional doctorate as a requirement to enter the profession: The advanced level of training the professional doctorate mandates is necessary to ensure the provision of the highest 5 There is some evidence that EdD programs are being increasingly oriented to professional practice. Following review of EdD programs for 2009-11, the National Science Foundation (NSF) reclassified 149 EdD programs as professional doctorates and therefore dropped them from its annual Survey of Earned Doctorates (SED), which focuses just on research doctorates; only 30 EdD programs remained in the 2011 NSF survey. By contrast, IPEDs allows institutions to choose whether to list EdD recipients as professional, research, or \"other\" doctorates; for 2010 completions, most EdD recipients were listed as research doctorates, although NSF would have defined most of these as professional doctorates. standards of delivery of service to individuals… The professional doctorate establishes audiologists in a clearly defined and prominent role within the hearing health care delivery system and strengthens their position as autonomous practitioners and providers of audiological services. As the quote indicates, the professional association cited both clients' needs and the desire for audiologists to become \"autonomous practitioners\" with a \"prominent role\" in hearing health care delivery as reasons to require a doctorate. As of January 2007, the audiology accrediting body only accredits programs leading to the AuD. Because audiologists must graduate from an accredited program in order to get a license to practice, audiology programs had to convert to doctoral programs; otherwise, their students could not become licensed. As of 2012, there were 74 AuD programs; no accredited master's programs remain. Over 600 AuD degrees were awarded in 2010-11 (Council of Academic Programs in Communication Sciences and Disorders and American Speech-Language-Hearing Association, 2011)."}, {"section_title": "Physical therapy", "text": "Until 1998, physical therapists only needed a bachelor's degree to practice in the U.S., but two years later in 2000, the American Physical Therapy Association (APTA), the field's professional association, set a goal of requiring the Doctor of Physical Therapy (DPT) for professional entry by 2020. As in audiology, the physical therapy association advocated for the doctorate to serve clients better but also to improve the status, autonomy and income of physical therapists. \"Vision 2020\" (American Physical Therapy Association, 2000) stated: Physical therapy, by 2020, will be provided by physical therapists who are doctors of physical therapy . . . Consumers will have direct access to physical therapists in all environments for patient/client management, prevention, and wellness services. Physical therapists will be practitioners of choice in patients'/clients' health networks and will hold all privileges of autonomous practice. In a 2005 fact sheet, APTA expanded on its reasons for the doctorate (American Physical Therapy Association, 2005), stating it was needed, among other things, to: • achieve the level of practice \"inherent to the patient/client management model,\" which it said required a breadth and depth in educational preparation not easily acquired within the time constraints of the typical MPT program; • become a \"fully autonomous healthcare practitioner,\" which it said needed the title of clinical doctor in order to meet societal expectations; • achieve direct access to clients [without an M.D. intermediary], \"physician status\" for reimbursement purposes, and clinical competence consistent with evidence-based practice; • make the field's degree \"consistent with medicine, osteopathy, dentistry, veterinary medicine, optometry, and podiatry\"; • provide graduates of entry-level MPT programs that it said \"already meet the requirements for the clinical doctorate\" a degree [the doctorate] appropriate to their program of study. In October 2009, the accrediting body for physical therapy, which is closely linked to APTA, mandated that all entry-level physical therapy programs lead to the DPT by December 30, 2015. By 2009, however, almost all entry-level physical therapy programs had long since transitioned to or been relabeled as doctoral. Indeed by 2009, only nine of 212 accredited programs led to a master's rather than a doctoral degree, creating competitive pressure on those nine programs to convert to doctoral programs. Physical therapy has been by far the most rapidly growing new PPD field in the U.S. DPT programs grew from 19 in 2000 to 226 in 2012, with a concomitant plunge in master's programs from 184 to two. In 2012, DPT programs enrolled 25,000 students, with nearly 8,000 DPT degrees projected for 2012. These numbers do not include \"post-professional\" or \"transitional\" DPT programs geared toward currently practicing physical therapists seeking to upgrade their credentials from master's to doctoral degrees, since the accrediting body does not accredit those programs and keeps no records on their student numbers or program standards. Nationally, conversion from master's to doctoral programs resulted in only modest change, raising questions about the extent to which adoption of the DPT degree reflected a response to an increasingly complex work environment. As Table 2 shows, on average, DPT programs were only 12 weeks longer than MPT programs; more than half of this change was in additional clinical experience. 6 Admissions standards for master's and DPT applicants appeared to be quite similar; for example, the mean grade point average (GPA) for students enrolled in master's and DPT programs in 2009 was virtually identical, as Table 2 shows (Commission on Accreditation in Physical Therapy Education, 2010). 7 In addition, most DPT programs did not include any kind of doctoral capstone experience.  , 2010, pp. 8, 13, 18 How has obtaining the DPT affected individual practitioners or the clients they serve? What little information there is so far suggests slight impacts at most. For example, a 2006 study found no difference in the licensure pass rates between master's and DPT graduates (Dorsey, 2006). On the other hand, despite the relatively small increase in total program length, students paid considerably more money to complete a DPT, especially in public institutions, as Table 2 shows. There is no evidence to date that holding a DPT leads to a higher salary; in fact, a 2013 survey of physical therapists found that DPT recipients earned less than those with master's degrees (Sitko, 2013), perhaps because most DPT holders are recent graduates with less experience."}, {"section_title": "Nursing", "text": "Programs for Doctor of Nurse Practitioner (DNP) are following closely behind DPT programs in rapid expansion of programs and enrollments in the U.S. In 2004, the American Association of Colleges of Nursing (AACN) member schools voted to recommend that by 2015 all advanced nurse practitioners go through a program leading to a doctorate, and the AACN board adopted this recommendation in 2006. AACN similarly urged that preparation for \"generalist nurses\" be raised to the master's level by 2015. In urging doctoral preparation and a doctoral degree for nurse practitioners, AACN cited labor market needs such as the changing demands of the nation's complex healthcare environment, the rapid expansion of knowledge underlying practice, and shortages of doctorally-prepared nursing faculty. But as in physical therapy, AACN's rationales also included perceived equity and status issues. AACN asserted that master's programs already \"often carry a credit load equivalent to doctoral degrees in other health professions.\" It also argued that \"nursing educational preparation and the time commitment ought to be analogous to other health professions e.g., PharmD, Physical Therapy, Occupational Therapy.\" However, AACN stated that \"transitioning to the DNP will not alter the current scope of practice\" for advanced practice nurses (American Association of Colleges of Nursing, 2009). Unlike physical therapy, the nursing practice accrediting body stated emphatically in 2010 that it will continue to accredit master's (as well as doctoral) nursing programs, including for advanced practice nurses, and that it has \"no intention of changing this policy\" (Commission on Collegiate Nursing Education, 2010). Nevertheless, although most nursing programs still offer a master's option for advanced practice nursing, AACN's position has led many nursing schools to convert to the DNP, according to one expert (Cronenwett, 2011, p. 509): Most schools of nursing with graduate programs … feel tremendous pressure (whether or not they have the resources to mount quality DNP programs) to convert their master's or post-master's DNP programs to DNP programs that prepare NPs for entry into practice because of the American Association of Colleges of Nursing position statements on the DNP… DNP programs expanded rapidly in the past decade, from just two programs in 2002 to184 programs in 2012, with another 101 programs in the planning stage. These programs enrolled over 9,000 students in 2011 and awarded over 1,500 DNP degrees in 2011-12. Nursing has established a greater differentiation between master's and professional doctoral degrees than is true in physical therapy. On average, the DNP requires 21 months of full-time study beyond the master's degree (Udlis and Mancuso, 2012), compared to 12 weeks (three months) for the DPT. Obtaining a DNP nearly doubles the cost of being an advance practice nurse; nationally, the mean cost of graduate work leading to the DNP degree was about $59,000 in 2011, compared to a mean of about $31,600 for master's-level training for advanced practice nursing (Udlis and Mancuso, 2012). As in other PPD fields, it is difficult to assess the impact of the doctoral credential and preparation on practitioners or their clients at this early date. According to a 2011 salary survey conducted by the magazine ADVANCE for NPs & PAs, DNP-prepared nurse practitioners out-earned their master's-prepared colleagues by over $8,500 a year, as Table 3 shows. However, the survey did not ask how many years of experience nurse practitioners had; if DNP holders had on average more years of nursing experience than did those with a master's degree, that could explain the salary differential. At this point, more evidence is needed to examine the impact DNP nurses will have on patient outcomes, costs, quality of care, and access in clinical settings. It is also difficult to discern how DNP nurses could affect the provision of nursing education and whether they will play a significant role in easing faculty shortages. Finally, Cronenwett (2011, pp. 509-10) cautions: With a dearth of qualified faculty, many programs of uneven quality are being mounted. But the bigger issue is that faculty members have begun to realize what a tremendous investment of faculty and student time is required to complete the DNP. Other professional fields New professional practice doctorate degrees have also been created in other professional fields, such as occupational therapy (OTD) and acupuncture and oriental medicine (DAOT), and programs and enrollments in these PPDs have also grown, although their numbers so far are lower than in the other fields described. It is worth noting that fields that created PPDs somewhat earlier, including non-health fields such as education (EdD), clinical psychology (PsyD, Doctor of Psychology), and business (DBA, Doctor of Business Administration), have also seen substantial growth in professional doctorate programs and enrollments. Figure 1 shows the growth in the number of DPT and DNP programs (the new PPD fields with the largest number of programs). Enrollments and degrees show similar trends. Nursing (2012). Numbers include both accredited and developing programs."}, {"section_title": "Growth and characteristics of new PPDs", "text": ""}, {"section_title": "Sources: Commission on Accreditation in Physical Therapy Education (2012), American Association of Colleges of", "text": "Perhaps surprisingly, a relatively small percentage of programs in new PPD fields are in for-profit institutions at least so far, as Figure 2A shows. Most new PPD fields have clinical components, which are often expensive and may be difficult to scale up. Figure 2B shows the distribution of new PPD programs by Carnegie Classification."}, {"section_title": "Figures 2A & 2B Programs in Seven Selected New PPD Fields* by Institutional Control and Carnegie Classification, based on 2010 Awards", "text": "Source: IPEDS Completion Survey 2010. *Programs that awarded a PPD in one of seven fields: acupuncture and oriental medicine, audiology/speech-language pathology, computer and information sciences, nursing, occupational therapy, physical therapy, or physician assistant."}, {"section_title": "PPDs in newly doctorate-granting institutions", "text": "One question this study asked was whether most new PPD programs were being started in newly doctorate-granting institutions, in line with isomorphism theory. The answer is no. However, newly doctoral institutions do compose a significant percentage of those offering such programs. In 2010, nearly 40 percent of programs that awarded a professional doctorate in physical therapy (the largest new PPD field), and an estimated 30 percent of programs in all new PPD fields, were at institutions that a decade ago awarded neither doctorates nor first professional degrees. Nor did research universities offer the majority of programs in new PPD fields. Rather, as Figure 2B shows, these programs were spread across a variety of institutional types. Another question is whether most newly doctorate-granting institutions offered PPDs, rather than PhDs. Here, the answer is yes, at least to date. Between 2000 and 2010, 155 formerly non-doctorate-granting institutions began awarding a doctorate, almost all of which were professional doctorates of some kind. Only 13 percent of newly doctoral institutions awarded a PhD degree in 2010, and more than two-thirds of the institutions awarded doctorates in just one field. The most frequent doctorate awarded was the EdD, an older PPD with many characteristics similar to the new PPDs (awarded by 37 percent of the institutions), followed closely by the new DPT (35 percent). However, both the numbers and kinds of doctoral degrees offered by newly doctorate-granting institutions expanded considerably in recent years. A review of institutional websites in 2012 found that collectively these 155 newly doctorate-granting institutions offered a total of 333 doctoral programs -a 36 percent increase over the 244 programs that awarded doctoral degrees in 2010. The median number of doctoral programs increased from one to two. Nearly a quarter of these institutions offered a PhD program by 2012, as Figure 3 below shows. 8"}, {"section_title": "Sources: IPEDS Completions Survey for 2010, and 2012 review of institutions' websites.", "text": "These institutions now also offer programs in more fields, including pharmacy, engineering, and biosciences. Nevertheless, the great majority of the 333 doctoral programs that these 155 newly doctorate-granting institutions offered still were non-PhD professional doctorates, primarily EdDs or the fast-growing new PPDs in physical therapy, nursing and other health fields. Newly doctorate-granting institutions necessarily face significant challenges as, or if, they transition into doctoral education. Given the significant proportion of new PPDs offered by newly doctorate-granting institutions, the increasing number of their doctoral programs and fields, and the challenges faced by institutions first moving in doctoral education, the next section of this study examines more closely PPD drivers and impacts at two teaching-oriented institutions that moved into doctoral work in just the past few years."}, {"section_title": "E. INSTITUTIONAL CASE STUDY ANALYSIS", "text": "Case studies of two newly doctorate-granting institutions provided in-depth information on why these institutions initiated new PPD programs and how such doctoral programs affected institutions, faculty and students. The two case study institutionshere labeled \"Western State University\" and \"Midwest State University\" -were selected to reflect different histories, emphases, and parts of the country, but both also share a number of similarities. Table 4 summarizes some of these similarities and differences. • Second independent doc.: DPT, fall 2012 • Stand-alone DNP due to start fall 2014"}, {"section_title": "Western State University", "text": "Western State University is a comprehensive public institution that is part of a large state university system of similar comprehensive public colleges and universities that until 2005 were authorized to offer programs only through the master's level. Founded in 1947 as a four-year state college, Western State today enrolls about 30,000 students, including about 4,000 graduate students, a majority of whom are full-time. Western State has over 40 master's programs, a small joint PhD with a public research university that has enrolled just a few students over the years, and two new professional practice doctoral programs. Its first independent doctorate, an EdD in Educational Leadership, enrolled its first students in fall 2007, and the first cohort graduated in May 2010. Western State's second independent doctorate, the Doctor of Physical Therapy, enrolled its first students in fall 2012."}, {"section_title": "Drivers of doctoral education", "text": "The drive to offer doctoral programs at Western State and at other campuses in the university system is not new. For many years, leaders and faculty throughout the system advocated for authority to offer doctoral degree programs, at least in particular areas. For example, at least as early as the 1990s, the system sponsored legislation to grant it authority to award \"applied doctorates\" in all areas, arguing that these would serve workforce needs that the state's public research university was not addressing. But the state legislature repeatedly rejected these efforts, agreeing with opponents that such a move threatened resources for undergraduate instruction, could duplicate costly doctoral programs offered by the state's public research university, and would violate a carefully crafted differentiation of functions among the state's public institutions, designed to ensure complementarity. According to many observers at Western State and elsewhere, the chancellor of the university system was a key player in finally obtaining authority in 2005 for system campuses to offer an independent doctorate in a single area, a narrowly construed professional EdD in Educational Leadership for K-12 and community college leaders. In its successful effort, the system prepared a report that showed high demand for such a degree among school administrators and others. Many Education faculty throughout the system, many of whom had doctoral degrees from research universities, supported the addition of doctoral authority. Despite a competing analysis by the state's public research university, which concluded that there was no evidence of unmet workforce demand for EdD recipients, the legislature agreed with the state system and granted it authority to offer the EdD. In this context, and with strong encouragement and detailed guidelines from the system office, Western State decided to develop an independent EdD program. According to a top campus administrator, the system chancellor wanted to establish a doctoral mission \"as a way to increase its commitment to education\" and, given its importance to the chancellor, \"how could we say no?\" He and other campus informants said that the EdD provided a credential or training important to older place-bound students. Campus documents stated that the new EdD would serve educators in diverse rural and urban communities and would meet an \"urgent need for well trained public administrators\" for the state's schools and community colleges. However, this campus leader noted that many on the campus were ambivalent about offering the EdD because, although it was a good thing to do, it required \"a lot of work and push.\" The impetus behind Western State's second independent doctorate -the Doctor of Physical Therapy (DPT) -was different. As noted above, the national physical therapy professional association began pushing in 2000 for the DPT as the entry credential, and in 2009, the field's accrediting body made it mandatory, starting December 31, 2015. With the 2015 mandatory deadline looming, and as one of the few remaining institutions awarding a master's degree in physical therapy, Western State felt at a competitive disadvantage in attracting students. According to its program director, applications to the master's program were below the national average; by comparison, in the new DPT program's first year, applications increased by roughly 50 percent. Yet many on the campus felt that a physical therapy doctorate was unnecessary. A senior administrator stated, \"We really didn't have much choice…I'm not convinced [the DPT] was needed, although students will be better trained.\" The provost noted that the physical therapy accrediting agency \"pulled the rug out from under our master's program.\" Indeed in 2011, prior to initiating its own DPT program, the campus website asserted that there was no difference between having an MPT or DPT degree in terms of applying for licensure or clinical practice; and the 2011 website stated that its MPT graduates had been successful in finding full-time employment at a salary comparable to that of DPT graduates. In early 2010, the state's physical therapy association sponsored legislation to give the university system authority to award the DPT. A number of Western State's physical therapy faculty and students lobbied legislators for this measure, but the system office remained officially neutral on the DPT legislation, in contrast to its active advocacy for system authority to award the EdD and Doctor of Nursing Practice (DNP) degrees. In September 2010, legislation was enacted that gave the system authority to offer both the Doctor of Physical Therapy and the Doctor of Nursing Practice degrees. Western State immediately began planning to convert its master's program to a DPT and enrolled its first DPT students in fall 2012. The new program required an extra semester of study and additional clinical work. In announcing the new degree program, a Western State press release said the degree was designed to raise graduates' education level to enable them to \"reach the pinnacle of their respective professions.\" Once Western State decided to establish its new doctoral programs, these programs were shaped not only by internal actors, particularly faculty and administrators, but also by external forces, especially accreditation agencies and the system office. Before Western State could establish its first doctoral program (an EdD), the regional institutional accrediting body required it to pass an evaluation that assessed whether the institution as a whole provided a \"doctoral culture\" that supported research and professional practice, demonstrated increased faculty and student intellectual and creative capacity, and provided specialized resources, among other things. According to several campus informants, getting the regional accreditor's approval was a challenging task that required several back-and-forth discussions and revisions. For the DPT, the field-specific accrediting body set minimum standards. (In contrast to the DPT, EdD recipients are not required to graduate from programs accredited by the education accrediting body, although some programs choose to follow that body's standards.) The university system office also played an important role by fleshing out the regional accreditor's general standards into detailed guidelines and sometimes specific systemwide minimum requirements for programs and faculty qualifications (especially for the EdD), helping to manage the conversion of master's programs to doctoral programs, and providing modest resources for campus program start-ups.\nLike Western State, Midwest State University had long sought doctoral authority. In fact, Midwest State spearheaded efforts that led to legislation in 1967 that granted the system's master's-level institutions authority to offer doctorates -but the legislature almost immediately imposed restrictions that prevented those institutions from doing so. In the late 1990s, campus presidents and leaders of the master's-level institutions led renewed efforts to get doctoral authority. Unlike at Western State, the system's chancellor, while supportive, was not a leading player in these efforts. In 2005, campus presidents agreed to two key compromises that overcame opposition from the state's research university and gained legislative agreement for doctoral authority: they agreed to seek authority only for \"applied doctorates\" in a limited number of fields and to do it without any additional state resources. The 2005 legislation granted the system's master's-level institutions authority to offer applied doctoral degrees in six fields: education, business, psychology, physical therapy, audiology, and nursing. Midwest State's president, a strong advocate of transforming the institution into doctoral university, vigorously pushed implementation of doctoral programs on his campus, once authorization was granted. Advocates for doctoral authority at Midwest State and the other institutions argued that \"the knowledge society\" required more doctorates and that the more widely distributed master's-level institutions could offer greater access and be more efficient than the state's research university. A senior administrator in the system office at the time noted additional reasons to offer doctorates: A lot of pressure came from the disciplines in the fields. This was credential ratcheting up, so then the universities had to respond. But the campuses also wanted the status and strength in saying that you do doctoral degrees. Doctoral programs give status to faculty and status to the campus. Similarly, a senior administrator at Midwest State said: There's a shortage [of doctorate-trained professionals], especially in education and nursing…and, yes, there's some issue of prestige: we want to move up in the Carnegie rankings; and [in nursing] the profession is now saying it should be the doctorate, so we need to meet the discipline body's preferred degree. Midwest State \"looked at our strengths and quickly decided to offer the DNP and EdD\" and, following further review, the PsyD, according to a campus administrator. Campus leadership decided there was not sufficient campus strength or an adequate market in the remaining three fields, although those decisions could be reviewed in the future. Although a doctorate is not now required for practice in either education or nursing, several campus respondents perceived external pressure to move programs to the doctoral level. These multiple rationales for doing doctoral work -workforce demands, institutional prestige, and the ratcheting up of credential requirements in the professions -were echoed by other campus administrators and faculty."}, {"section_title": "Institutional impacts", "text": "Faculty -Doctoral education at Western State -and the requirements of its regional accreditor and system office -imposed new demands on faculty. Faculty in the doctoral programs needed to create and teach a curriculum that was more intellectually advanced and to devote more time to mentoring and supervising doctoral students, especially during the dissertation (EdD) or doctoral project (DPT) process. The regional accreditation body pushed Western State to demonstrate that doctoral faculty, especially in the EdD program, maintained active research scholarship. To meet these demands, the system created, and Western State further elaborated, a new category of \"core doctoral faculty\" who met certain qualifications and who alone could chair doctoral committees. For the EdD program, Western State set research productivity standards for doctoral faculty higher than for other faculty and reduced doctoral faculty's teaching workload to help them meet the new doctoral program demands. Compared to research university norms, the new research requirements were relatively low (initially, one publication every two years), while the teaching workload for doctoral faculty remained relatively high (six courses per year instead of eight). Many education faculty, including many who had helped develop the program, did not meet these research requirements and so lost their core faculty status -reducing the core group at one point from about 20 to about seven faculty members. Since enrollments were not reduced, the reduction in core faculty resulted in an insufficient number of faculty for the program, including a heavier dissertation advising load on the core faculty who remained, according to informants. Consequently, the program director then instituted an \"interim doctoral faculty\" designation to give these faculty two more years to meet the standards, during which they were allowed to teach and serve on -but not chair -doctoral dissertation committees. At the time of this research, that interim status was still in place. No specific research requirements were set for core faculty in the brand new DPT program, although a senior administrator insisted that current physical therapy faculty would not automatically become core DPT faculty; rather, administrators said they expected to raise scholarly qualifications for new faculty hires. Curriculum -If judged by program length, the change from master's to doctoral programs appeared to be quite modest, especially for the DPT. The DPT curriculum is a three-year full-time program, an increase of a half-year over the prior master's program, but this includes two courses that previously were prerequisites for the master's program. Like their counterparts in the national professional association but contrary to campus and system officials, some physical therapy faculty felt their master's program was already at the doctoral level and needed little change. The DPT program does not require students to pass a qualifying exam or to complete a dissertation; rather, it requires \"a doctoral project or culminating experience\" that can be met as an evidence-based practice project, a clinical research project, or a case report. Western State's DPT program proposal states, \"This is a professional-practice clinical doctorate not a scholarly research-oriented doctorate.\" By comparison, the EdD program, which (unlike the DPT program) requires a master's degree to be admitted, is also a threeyear program, but it is geared to working professionals, so most classes are offered in intensive two-day formats. Unlike the DPT program, Western State's EdD program requires students to pass a qualifying exam and complete a doctoral dissertation, although the EdD requires fewer total credit units. Both the EdD and the DPT programs are based on a cohort model, where students in each year of the program take courses together, as a mechanism to facilitate peer support and timely completion. Students -Students in the EdD program, as in many such programs, are older, full-time professionals with often demanding jobs and families. For some EdD students, research and quantitative methodology requirements posed a stumbling block, but, despite poor performance, they were not dropping out. A faculty member said, \"it's hard to fail a student, but it's been a huge struggle.\" For the full-time DPT program, where students tend to be younger, the director's biggest concern was whether the higher tuition and fees -three to four times more for the total DPT program than the master's program -would \"close the doors on the low-income students we've been able to serve in the past.\" Whether either program will achieve the goals of student advancement and broader change is uncertain. According to the education dean, some EdD graduates changed their positions, while others remained in their same positions. A bigger question is whether the EdD program will achieve the authorizing legislation's larger goal that the new EdD programs result in educational reform and improved student achievement; a 2011 joint university system-state report concluded that it was too soon to judge this. Since Western State's DPT program was brand new when this research was conducted, no students had yet graduated; the labor market for physical therapists -with or without a doctorate -is expected to be strong.\nFaculty -As at Western State, doctoral education at Midwest State brought pressures and strains on a primarily undergraduate teaching institution that, according to the campus strategic plan, is seeking to transform itself into an \"applied doctoral institution.\" Under this plan, faculty scholarly productivity and external research funding would be substantially increased, and resources and administrative structures would be realigned to support graduate education and research. To date, however, both requirements and support for faculty scholarship and doctoral supervision remain relatively low. Only those designated as \"Research Graduate Faculty,\" a newly created category, are eligible to supervise doctoral dissertations; to be eligible, a faculty member must, among other things, have at least two publications, which do not have to be in refereed journals, over the course of four years. One faculty member asserted that this has created a lot of tension because many faculty are excluded from the doctoral program unless they have \"what's really very little research -it's not even close to being enough,\" yet it is \"an insurmountable barrier\" for many. According to several informants, one consequence is that there are not enough faculty to direct doctoral dissertations or other capstone projects, and faculty who do so feel overburdened. This appears to be a particular problem in the Doctor of Nursing Practice program where, although the administration is ready to increase the program's faculty lines, the national shortage of nursing faculty with appropriate qualifications makes hiring difficult. The teaching workload in the DNP program is also a source of contention. While some administrators said they believed that in practice the workload for faculty in the DNP program was three or even two courses per semester (down from the regular four) and therefore adequate, a nursing faculty member said she had been teaching four courses per term while supervising doctoral students and was feeling burned out. Still she expressed pleasure at the opportunity to teach more academically and clinically prepared students at the doctoral level. Curriculum -Compared to typical Doctor of Physical Therapy programs, Midwest State's new DNP program is more like traditional doctoral study. On the other hand, it is less so than PPD programs in fields where the professional doctorate degree was established several decades ago. Midwest State's DNP program will require five years beyond the bachelor's degreethree years (and 51 credit units) for the master's portion, followed by two years (and 30 credit units) at the doctoral level. This is substantially longer than the typical DPT (which is generally around three years post-bachelor's degree) and represents a marked increment of study beyond the master's degree (although the DNP program is spread out over five years, presumably to enable students to work at least part-time). DNP students will also complete a capstone project that meets the guidelines of the nursing accrediting body, rather than a traditional dissertation. By comparison, the campus's new Doctor of Psychology (PsyD) and EdD programs, which are in fields where the professional doctorate was established much earlier, entail considerably more graduate credit units (90-110) and require students to complete a dissertation. Despite the DNP program's doctoral elements, one DNP faculty member expressed concern that, unless there were adequately trained research faculty, the new DNP program could become \"dumbed down\" to a \"glorified master's\" program; this, she argued, would not meet the nursing profession's needs for nurse practitioners who are able to think more critically, better understand the overall health system, and be leaders in their organizations and the profession."}, {"section_title": "Costs -", "text": "The new professional doctoral programs, even if they extend study by only a semester, cost more to pay for reduced faculty workload, increased research expenditures, additional clinical internships, upgraded library and other information resources. At Western State, students have borne most of these additional costs through substantially increased tuition, as well as a longer period of tuition and foregone income. The legislative bills authorizing the system to offer first the EdD and then the DPT degrees provided no additional funding for these costs and prohibited campuses from reallocating funds for undergraduate enrollment to the graduate level; consequently, raising student tuition was one of the only ways to get the funds needed. From an institutional standpoint, paying for the programs with higher student tuition had advantages. According to a top administrator at Western State, the EdD program was established with \"relatively low bloodshed\" because it didn't reallocate resources from other programs. Similarly, the DPT program gained the backing of support units such as the library and student services because DPT fees paid for additional funds to these units, according to the health sciences dean. Some faculty, however, disagreed with these assessments, suggesting that doctoral faculty were not adequately compensated for their additional workload or that outside departments that contributed faculty to the new doctoral programs were not fully reimbursed. Change over time -For Western State's EdD program, which has now been in place for several years, program and institutional changes continued to evolve over time, and institutional leaders took various steps to address problems. Maintaining sufficient core faculty was challenging. The EdD program set higher research productivity criteria, then had to cut many faculty who failed to meet these criteria, then instituted an interim faculty status to enable the program to continue. Student admission requirements were also reviewed, in light of concern that some students were entering without sufficient research or statistical preparation to meet the program's goals. Given the multiple pressures and perspectives they face, both the EdD and the new DPT program may undergo further revisions over the next several years. Challenges -Chief among the challenges that both the EdD and DPT programs faced, according to those interviewed, was the difficulty of establishing a doctoral culture on a campus with a high teaching workload and little chance that this workload could be reduced in the near future. Second, and related to the first, were cost constraints on creating high quality doctoral programs, given declining state funding, legislation forbidding campuses to reallocate state dollars from undergraduate enrollments, limits on how high student tuition could be raised, and few other funding sources. Several administrators also cited unionization as a barrier to instituting higher research requirements for appointment as core doctoral faculty; one said, \"we're a unionized campus, so everything is negotiated.\" Future plans and prospects -The clear goal of many of those at Western State was, in the words of the provost, \"to morph to a doctoral culture\" but not necessarily that of a research university. As several leaders acknowledged, Western State was \"not there yet.\" At least some on campus, including some top leaders, want the institution to offer additional professional practice doctorates, such as those in nursing or audiology. However, given current challenges, especially budget constraints, further expansion may be difficult."}, {"section_title": "Midwest State University", "text": "Midwest State University was founded in 1868 as a normal (teacher-training) school. Today it is a comprehensive public institution with a student population of about 15,000, including about 2,000 graduate students, the majority of them part-time. Midwest State has about 50 graduate programs, including three new professional practice doctorates. Like Western State, it is part of a larger system of higher education institutions that until 2005 was authorized to offer programs only through the master's level. Unlike Western State's system, the Midwest University System includes both two-year and four-year institutions. Midwest State started independent doctoral work as part of a four-campus Doctor of Nursing Practice consortium, whose first doctoral students enrolled in summer 2007 and graduated in May 2009. That consortium is now being phased out, as three of the four campuses start stand-alone DNP programs. At Midwest State, the doctoral phase of its stand-alone DNP is scheduled to start in fall 2014, when students who enrolled in its nursing master's program in fall 2012 are eligible to continue into the doctoral segment. Midwest State also offers two other professional doctorates: an EdD (with separate programs in counseling education and in educational leadership) that graduated its first cohort in December 2011, and a Doctor of Psychology (PsyD) program that will graduate its first students in spring 2013."}, {"section_title": "Students -", "text": "The four-campus DNP consortium program, now being phased out, enrolled 12-16 students in each cohort. One concern, therefore, is whether Midwest State's stand-alone program (and the other two stand-alone DNP programs being established) will be able to enroll sufficient numbers of doctoral students to be viable. Even if applications are adequate (and that is uncertain), the program may not be able to enroll sufficient students unless it hires additional qualified faculty and finds more clinical sites for internships. Another question is the career outcomes of graduates. According to those interviewed, the consortium program was intended mainly to prepare two groups: advanced nurse practitioners and faculty for the state's twoyear associate degree nursing programs. However, few graduates have returned to the field, and the majority of graduates have taken nursing faculty positions in the state's four-year public or private institutions, rather than in the associate programs. This may help address the nursing faculty shortage in the state, but it is not the goal the program was designed to meet. Costs -Because no state or system office funds were provided to start up or operate the new doctoral programs, and because Midwest State made a commitment to maintain existing programs' base allocations, doctoral programs' additional costs have been met largely through higher student tuition, and according to faculty and some administrators, \"out of [faculty's] hide.\" Higher tuition has allowed the campus to buy out workload released time for doctoral faculty, but some faculty argued that the buyout is inadequate and that they have taken on additional workload without equivalent reduction in their other responsibilities. Going forward, some administrators expect that additional monies will go toward the doctoral programs (while preserving the base allocations of other programs); conversely, if future budgets are cut, administrators expected the doctoral programs to be more protected. Challenges -Those interviewed repeatedly cited several major challenges, especially the heavy workload on the small number of faculty primarily responsible for doctoral supervision, an absence of faculty with appropriate backgrounds for supervising doctoral students, and the lack of funds to change this situation. Overall, the challenge for Midwest State has been to try to transform itself into a place that is \"thinking and acting like a doctoral institution,\" in the words of the campus strategic plan. As a senior administrator noted, \"We're negotiating between the tradition of graduate programs and our heritage as an undergraduate teaching institution…there is an ongoing discussion, not resolved, over who are we and what do we want to be when we grow up.\" Future plans and prospects -Although the campus strategic plan sets out ambitious goals, including expanding the number of applied doctoral programs and eventually gaining authority to offer the PhD, progress toward these goals has been slow, partly because of budget cutbacks. Nevertheless, discussion about adding new applied doctoral programs continues, and the campus recently established a new position of associate vice president for research, intended to elevate attention to research and graduate education."}, {"section_title": "F. FINDINGS AND DISCUSSION", "text": ""}, {"section_title": "Patterns and scope of new professional practice doctorates", "text": "Programs, enrollments, and degrees in new professional practice doctorate fields in the U.S. skyrocketed over the past decade, often driven by new mandates or expectations that individuals complete a doctorate to enter the professional field. Most of the new types of PPDs have been in health-related fields, but new PPD degrees have been created in non-health fields as well. Physical therapy, nursing practice, and audiology have seen the largest growth in PPD programs, degrees, and enrollments to date. Overall, there are now over 500 programs in new PPD fields in the U.S., with more than 10,000 degrees awarded just in 2011-12 and roughly 35,000-40,000 students enrolled. While this is still a relatively small percentage of all U.S. doctorate degrees and enrollments, 9 PPD programs and enrollments continue to grow; for example, over 100 additional DNP programs are in the planning stage. These numbers do not include older professional practice doctorates (such as the EdD, PsyD, and DBA) that are similar to the new PPDs in many ways; these have also been growing substantially. An estimated 30 percent of doctorate programs in new PPD fields in the U.S. have been started by newly doctoral institutions, that is, by the approximately 155 institutions that a decade ago had no doctoral or professional degree program. While more than two-thirds of newly doctorate-granting institutions awarded degrees in just one field in 2010, the numbers and kinds of doctoral programs these institutions offer have been increasing substantially. By 2012, newly doctorate-granting institutions had increased their median number of doctoral programs from one to two, they offered programs in a broader range of fields than earlier, and nearly a quarter offered the PhD."}, {"section_title": "Forces driving increases in doctoral credentials and programs", "text": "This study sought to explain why a number of professional fields developed new doctorate requirements, expectations or options in the past 10 to 20 years, and why so many institutions began offering doctoral programs in these fields, including many institutions that had not previously offered doctoral or first professional programs. A related question is why health fields have dominated the creation of new PPD degrees. To answer these questions, the study assessed the comparative explanatory power of three conceptual frameworks. Consistent with human capital theory, all of the advocates for new PPD degrees and programs cited labor market needs and growing complexity of the environment in which professionals worked as reasons for instituting the PPD as the entry degree for practice. However, there was limited evidence that market needs and more complex work environments were in fact the main drivers of these degrees. The strongest support for human capital theory that this study identified came from a recent survey of nurse practitioners, which found that DNP-prepared practitioners out-earned master's-prepared practitioners by over $8,500 a year; however, the survey did not determine if the DNP practitioners had more years of experience than other nurse practitioners. This study did not find clear evidence in other new PPD fields that the doctorate led to higher salaries, higher license pass rates, or significantly better outcomes for clients or quality of care. However, because these degrees are still so new, it may be too soon to determine how or if PPD recipients are impacting their professional fields. By contrast, credentialism and gate-keeping -that is, ratcheting up of credential requirements in order to try to raise professionals' status, autonomy and income and to increase selectivity into the profession -provided the strongest explanations for the creation of new professional practice doctorates and, in turn, PPD programs. Much of the impetus for new doctorates in health fields came from national professional associations and their related accrediting bodies, not from employers or higher education institutions. In promoting these degrees, professional bodies emphasized practitioners' need to become autonomous from and have the status of medical doctors, a status that some suggested would raise both their client base and insurance reimbursement rates. Advocates asserted that the credential should be raised to a level analogous to that in other health professions -with proponents in each field pointing to recent doctoral moves in other professional fields -even when transitioning to the doctorate would not alter professionals' existing scope of practice. Moreover, contrary to the human capital model but consistent with credentialism, conversion from master's to doctoral programs sometimes resulted in only modest change; in physical therapy, for example, it resulted in an increase of just 12 weeks on average, no change in mean GPA of those admitted, no requirement for a dissertation or other capstone project, and no increase in licensure pass rates. Although some other new professional doctorates, such as the DNP in nursing, placed greater demands on doctoral students and programs, such demands appear to be generally less than those for older PPDs such as the EdD or PsyD, which remain closer to the PhD model. While credentialism and gate-keeping helped explain much of the creation of new PPD degrees, isomorphism and academic drift (i.e., pressures for institutions to become more alike and more like prestigious research universities) helped explain the establishment of many doctoral programs, especially when such degrees were not mandatory. In audiology and physical therapy, mandatory external requirements pushed institutions sometimes unwillingly to convert their master's programs to doctoral ones. But even when institutions were not required to do so, real or perceived competitive pressures often prompted such change. Long before the physical therapy accrediting body mandated the doctorate, all but a handful of programs had already transformed (or renamed) themselves into doctoral programs; in fact, the conversion of so many programs to the DPT may have put pressure on the program accrediting body to mandate that all professional programs lead to the DPT. The same competitive pressures now seem to be exerting themselves on nursing practice programs. Several campus informants acknowledged that obtaining the prestige and perhaps resources perceived to go with doctoral status were factors in campus and system efforts to obtain doctoral authority. 10 In summary, the evidence suggests, first, that professional associations and closely related program accrediting bodies were the leading players in the creation of new doctorate credentials in most fields, and, second, that the primary motivation for increasing the credential was professional associations' and practitioners' pursuit of greater status, autonomy and control (i.e., credentialism and gate-keeping). The health professions have dominated the growth of these new professional doctorates to date probably because accrediting bodies in these fields have power over licensure, since licensure generally requires graduation from an accredited program. Once these doctorate degrees were established, the pressures on institutions to offer doctoral programs came both from mandatory accreditation requirements and from isomorphic pressures. Indeed, credentialism, isomorphism, and academic drift were often complementary forces, with professions ratcheting up credential requirements or expectations by creating new doctorate degrees, and institutions explaining long-desired movement into the doctoral arena on the basis of both the professions' actions and competitive pressures from other institutions."}, {"section_title": "Impacts of new PPDs at newly doctorate-granting institutions", "text": "Implementation of doctoral programs by institutions previously unfamiliar with them led to challenging resource demands and to strains between institutions' undergraduate teaching-oriented mission and new research requirements in the case study institutions. Faculty -Doctoral education at the newly doctorate-granting case study institutions imposed significant new demands on faculty -for example, to create and teach an advanced curriculum, supervise doctoral dissertations or capstone projects, and publish more research -while nevertheless requiring them to maintain relatively heavy teaching loads. By most accounts, the increased research requirements have been small -far too little for some critics, adequate for others who emphasized that these are not research doctorates. In any case, faculty research was limited by several factors: the teaching workload, faculty members' views on doctoral education, union contracts, and insufficient resources. However, because many potential doctoral faculty could not meet these new demands, doctoral programs had too few core faculty, resulting in a workload burden on those who remained and the risk of faculty burnout. Implementation of new doctoral programs also created tensions between those faculty who receive slightly reduced teaching workloads and are eligible to supervise doctoral students and faculty who are excluded from the benefits and satisfaction of supervising doctoral students. Students -For students, a key result of pursuing doctorates rather than master's degrees was the cost of significantly higher tuition fees over a longer period of time, as well as foregone earnings for those in full-time programs. Some students who were full-time working professionals with families and demanding jobs struggled to meet the research requirements that some programs established and expressed feelings of overload and burnout. Nevertheless, attrition in the programs examined appeared to be relatively low, perhaps reflecting students' high level of motivation, programs' reluctance to fail students, and/or a highly structured and cohort-based curriculum. Moreover, in most cases, student demand for these new doctoral programs appeared adequate or high, suggesting that programs will be able to fill enrollment slots -if they can bring in sufficient numbers of qualified faculty and obtain other necessary resources. Contrary to the human capital thesis, however, it remains unclear whether most graduates of the programs examined are achieving the higher salaries or career advancement they anticipated, or whether these PPD recipients are having the broad impacts on schools, clients, or society that advocates asserted. Costs -Students in the two case study institutions (and likely elsewhere) were bearing most of the additional costs of professional doctorate programs through higher tuition. Tuition increases were one of the few ways to support the new doctoral programs because the two states in this study prohibited the reallocation of undergraduate enrollment funds to doctoral programs, did not provide additional state funding for the doctoral programs, and have cut state funds further since then. Some faculty asserted that some program costs were paid \"out of hide,\" through uncompensated workload. In the long run, moreover, tuition dollars alone appear insufficient to meet program costs, since tuition levels are limited by legislation, market competition, and students' ability to pay. To date, relatively little reallocation of resources has occurred, at least in the two case study institutions, either among departments or among different institutions. Future prospects -These programs and their institutions are still evolving. Spurred in part by external regulators and internal expectations, campus administrators and faculty in the institutions examined took steps to strengthen doctoral programs and to try to create a \"doctoral culture.\" For example, some are tightening research standards for doctoral program faculty, making plans to hire additional faculty with more research experience, providing small faculty research grants, rethinking student admissions criteria and graduation requirements, providing students more academic support and mentoring, or revising the organization chart to give more attention to research and graduate education. However, as those interviewed acknowledged, declining public funding, continued importance of the teaching mission, high faculty workload levels, and other competing pressures all limit what institutions can do -and none of these factors will change soon."}, {"section_title": "G. POLICY QUESTIONS", "text": "This study raised a number of policy questions that need further research and discussion. These include the following:"}, {"section_title": "Do professionals who get professional practice doctorates serve their clients and society better?", "text": "This is the fundamental question for public policy. If PPD training enables professionals to serve their clients more effectively, meet new and more complex needs, and, in the words of advocates, transform the organizations and settings in which they work, the added resource costs to individuals and the public may well be worthwhile. To date, there is little empirical evidence of substantially increased effectiveness let alone transformation, but it may be too soon to assess such outcomes. Will doctorate credentials increase the status and autonomy of the professions that adopt them and the individuals within them? Although this study found that desire for greater status and autonomy was a key driver of the movement to doctorate credentials, there was limited evidence that practitioners with PPDs in these fields had seen significant advances in their positions, salaries, or autonomy. Again, more time may be needed to assess such change. Even with a longer time span, it may be difficult to determine whether career advancement results from the doctoral preparation individuals received or from the selectivity represented by holding a doctoral credential. Will higher credential requirements reduce access to professions, especially by low-income, first-generation, or underrepresented minority individuals? Higher tuition costs and longer periods of study prior to entering a profession may become barriers into the profession for lowincome individuals, especially since financial support for these programs is meager in most cases. Addressing this issue is particularly important because many of the fields involved have traditionally been mobility pathways for first-generation students. What should the title of \"doctorate\" mean? Are there fundamental characteristics that all doctorates and doctorate programs should share? Should the doctorate be conferred just based on successful completion of a requisite number of academic and clinical credit units, as is now true for some new and even some redefined older PPDs (such as the Juris Doctor, which law schools adopted in the 1960s and which IPEDS relabeled as a professional doctorate in 2008)? Should even a professional doctorate require some kind of intensive and original culminating project? Who, if anyone, should make these decisions? Some regional institution-level accreditors have begun developing criteria to assess an institution's doctoral culture, although they apply different criteria to different fields, but other regional accreditors have eschewed doing taking on this task. Should external organizations such as professional associations or accrediting bodies determine not only what preparation professionals must have but also which degrees institutions offer in these fields? If individuals must complete an accredited program to obtain a license to practice, and if only doctoral programs are accredited, institutions must either convert existing master's programs to doctoral programs, partner with other institutions, or exit the field. In effect, then, these external organizations determine the degrees institutions must offer. Should they? What are the resource implications of new professional practice doctorates for higher education? The research so far suggests that the resource implications for higher education of these new PPDs are substantial -even if such doctorates remain mostly in health fields, extend study only marginally, and do not open paths to many more costly PhD programs. First, there seems to be a domino effect in health fields, with the PPD becoming the required or normative degree for entering practice in one field after another (audiology, physical therapy, nursing practice, and perhaps eventually occupational therapy). Second, while most new growth has been in health fields, institutions have started new types of PPDs in a range of fields (for example, bioethics, information management, and organizational leadership); in addition, growth of older PPD programs in fields like education and clinical psychology has been substantial. Third, many of these new PPD programs are expensive, so even limited expansion requires more resources. At a time when most institutions face a shrinking resource pie, this means either redistribution of resources from other programs or institutions, a higher workload burden on faculty, or higher tuition and foregone income burdens on students who must spend more time in school. How ready are formerly non-doctorate-granting institutions to offer doctoral education? Nearly one-third of new PPD programs have been initiated by institutions that have little or no experience in conducting doctoral programs, may have few complementary campus programs, and may not have doctoral-level evaluation processes or structures in place. Consequently, they may be unprepared to handle doctoral-level work. Indeed the case studies suggest that newly doctorate-granting institutions are struggling to define and achieve a doctoral culture appropriate to their new degree programs. In its report on the professional doctorate, the Council of Graduate Schools (2007, pp. 22-23) noted: Non-PhD granting institutions face striking opportunities and challenges in offering new professional doctoral programs. In some situations, the creation of new professional doctorates may look like … a logical extension of mission focused on workforce preparation and applied learning… [But] an institution with a strong and successful master's program may find itself confronted by a demand from a disciplinary association that the program be offered at the doctoral level in order to be accredited, even though the institution lacks authorization for doctoral programming. This behavior threatens the viability of good master's programs, and it creates a bad incentive to match degree creep with mission creep. Change takes time. If institutions that take on doctoral-level education are to be successful, they will need time to develop appropriate structures and processes, as well as more resources. Evidence from case studies suggests that institutions are learning from early mistakes and taking steps to modify both expectations and support for faculty and students. But given ongoing fiscal constraints, competing demands, and conflicting visions of what doctorate education means, questions about how well these institutions are making the transition to doctoral education, what doctoral education will mean for them, and what can and should be done either to assist institutions or to rethink these transitions require further attention."}]