[{"section_title": "Abstract", "text": "Abstract: Hypogonadism is a common clinical condition affecting men of different age groups. In addition to its sexual consequences, it has several implications posing significant concerns for a man's health and well-being. Recent advances in testosterone (T) supplementation have facilitated hypogonadism treatment.\nDespite that, patients complaining of infertility or seeking conception are still hindered by the unfavorable effects supplemental T has on testicular function. Consequently, alternative approaches that can stimulate endogenous T production are favored. Selective estrogen receptor modulators, gonadotropins and aromatase inhibitors (AIs) can be successful in restoring serum T levels, preserving fertility, and providing symptomatic relief."}, {"section_title": "Introduction", "text": "Hypogonadism defined as inadequate gonadal function manifested by deficiencies in gametogenesis or hormone secretion (1) , is a common clinical condition affecting men's fertility and sexual health. In the United States, almost 39% of men over the age of 45 years were found to have low serum testosterone (T) levels (2) . While ageing has been considered the principal factor which contributes to the development of hypogonadism, below-normal serum T levels are being encountered more often in men seeking fertility. Such a trend may be secondary to changes in lifestyle and eating habits, or to elective delay of conception age. The Baltimore Longitudinal Study of Aging reported a 3-8% incidence of hypogonadism among men 20-45 years old (3) . Furthermore, a 0.4% yearly decline in T was also detected in men of the same age group (4) . The increase in paternal age at time of delivery has been documented in a study by Kovac et al. , who particularly reported an upsurge in live births in men above 35 years of age (5) .\nHypogonadism is more common among infertile patients. Low T or high luteinizing hormone (LH) levels were detected in about 30% of patients undergoing fertility evaluation (6) . This association may be explained by the higher prevalence of genetic abnormalities, endocrinopathies and clinical varicocele among patients complaining of infertility. In a study by Tanrikut et al. (7) , the serum T levels of 325 patients with varicocele were measured and compared to a control group of 510 vasectomy reversal patients. After adjusting for age, men with varicoceles had significantly lower T levels than the control group. Furthermore, microsurgical varicocele ligation resulted in a significant increase in serum T levels in more than two-thirds of the study participants. These findings suggest that varicocele is a significant risk factor for androgen deficiency and that surgical repair may be beneficial in restoring normal T levels. Hypogonadism carries another clinical implication on male fertility. Exogenous T use has been on the rise over the past few decades in line with the significant advances in T delivery systems and the increase in public awareness of low T level and its associated symptoms in men (8) (9) (10) A 500% increase in physician prescription rates for T has been observed over the past 10 years (11) . Despite this, men desiring to maintain their reproductive potential may not be fully aware of the risks of exogenous T therapy. In a recent survey of urologists, Ko et al. (12) observed that approximately 29% have used exogenous T to treat male infertility. The need for additional efforts to establish recommendations for managing hypogonadism in infertile men and raise physician awareness on the detrimental effects of supplemental T on sperm production were suggested. C u r r e n t c l i n i c a l p r a c t i c e g u i d e l i n e s a d v o c a t e hormone evaluation for infertile men when symptoms of hypogonadism exist or when a sperm concentration of less than 10 million/mL is encountered (13) . Androgen replacement is generally indicated in men who are not trying to conceive and have persistently low serum T levels combined with clinical symptoms of hypogonadism. These include decreased libido, sexual dysfunction, fatigue, lack of concentration, decreased facial and body hair, decreased in lean body mass and increased fat mass.\nIn this review we aim to explore the different options available for the medical treatment of hypogonadism in men desiring to retain their fertility."}, {"section_title": "Hypothalamic pituitary gonadal axis", "text": "A brief understanding of the HPG axis is important in order to recognize the different therapeutic options utilized in androgen replacement in infertile men. Testosterone synthesis is regulated by the hypothalamus and pituitary gland ( Figure 1 ). Gonadotropin-releasing hormone (GnRH) secreted by the hypothalamus, passes through the hypothalamo-hypophyseal portal circulation to the anterior pituitary where it stimulates the production of the glycoprotein hormones, LH and follicle stimulating hormone (FSH). FSH and LH are consequently secreted into the circulation to carry stimulatory actions to the testes. FSH acts on Sertoli cells triggering spermatogenesis and hormone synthesis, primarily inhibin. LH binds to LH receptors on Leydig cells stimulating steroidogenesis and testosterone production. There is some evidence suggesting that FSH may stimulate Testosterone production by Leydig cells secondary to release of activating hormones from Sertoli cells (14) . GnRH is secreted in a pulsatile manner leading to a similar response in LH and consequently testosterone synthesis giving rise to a circadian rhythm that is essential for human health and well-being.\nTestosterone is then aromatized to estradiol, which exerts a negative feedback on the hypothalamus and pituitary gland resulting in decreased production of GnRH, FSH and LH consequently maintaining testosterone in its optimal range. Inhibin also exerts negative feedback on the pituitary gland decreasing LH and FSH production (14) .\nHypogonadism can be primary or secondary. Primary hypogonadism is suggested when a low serum T is associated with high FSH and LH levels. It results from disorders of the testes that lead to low testosterone production and impaired spermatogenesis (primary testicular failure) as seen in Klinefelter syndrome patients or after testicular insult from trauma, infection, surgery or chemo/radiotherapy. Secondary hypogonadism is however considered when both gonadotropins as well as serum T levels are low. It can be idiopathic or due to Kallman "}, {"section_title": "Exogenous T replacement", "text": "Exogenous T has been increasingly used for both anabolic and androgenic purposes. Current estimates indicate the presence of up to 3 million anabolic steroid users in the United States (15) . Internationally, a 3-4% life time prevalence risk of steroid abuse in men has been reported (16) . This prevalence is estimated to be much higher among young gym attenders reaching up to 25% (17) . Studies on high school seniors reveal a staggering 6.6% rate of exogenous T use among students mostly initiated before 16 years of age (18) . Another survey among body builders confirmed T abuse at an early age where almost two thirds of abusers started T replacement before 23 years of age (19) .\nAn understanding of the detrimental effects of T abuse is crucial and should be relayed to patients being evaluated for androgen replacement. Exogenous administration of T results in a negative feedback inhibition of the HPG axis which consequently causes a decrease in endogenous and intratesticular T levels. The latter, which is normally about 50-100 times higher than serum levels, is integral for optimal sperm production. Despite a normal or high serum T concentration in men receiving anabolic steroids, intratesticular T levels may be markedly inhibited resulting in oligozoospermia or azoospermia (20, 21) . Atrophy of the germinal epithelium together with spermatogenesis suppression and subsequent azoospermia after 10 weeks of therapy has been documented by a World Health Organization Task Force investigating exogenous T as a male contraceptive option (22) . Recovery is expected after 6 months of treatment cessation, with almost half the patients returning to their baseline pre-treatment sperm density (22) . However, up to 10% of patients with poor pre-treatment sperm production remain azoospermic after treatment cessation (23) .\nConsequently, exogenous T use should be discouraged in hypogonadal patients who either have infertility or wish to conceive in the future. Such patients should be offered alternative options that can raise their endogenous T instead of receiving synthetic forms of the hormone. More importantly, patients should be properly evaluated to look for correctable secondary causes of hypogonadism."}, {"section_title": "Therapeutic approaches", "text": "Several available treatment options can manipulate the HPG axis ultimately raising endogenous T levels. Most of these medications are not FDA approved for men. However, compelling evidence exist that confirms the efficiency and safety of such medications."}, {"section_title": "Clomiphene citrate (CC)", "text": "CC is a selective estrogen receptor modulator that competitively bind to estrogen receptors in the hypothalamus and pituitary gland. As a result, it prevents the inhibitory effect of estrogen on gonadotropin production thereby increasing LH and ultimately T production by the testes. CC is given at a dose of 25 mg every day or 50 mg every other day. Potential side effects include facial flushing, excessive sweating, gynecomastia and breast tenderness, weight gain, hypertension, cataracts, and acne.\nIn an attempt to investigate the efficacy of CC as a method of androgen replacement, Guay et al. initially treated 21 older men who had secondary hypogonadism with 50 mg CC twice daily for 7 days and demonstrated normalization of serum T levels at such a short term (24) . Following that, they performed a double blind placebo controlled cross over study on 17 symptomatic men with a mean age of 62 years. Treatment was given for 8 weeks and erectile function was assessed by nocturnal penile tumescence testing (NPT) and validated sexual questionnaires. Despite normalization of serum T levels, no improvements in NPT or sexual questionnaires were detected in the whole group initially. However, after adjusting for patient age in a post hoc analysis, statistically significant improvements in sexual function were demonstrated in younger men aligning with a higher likelihood of organic ED in older men that may be refractory to hormonal manipulation. In another observational study by the same group (25), 173 hypogonadal men with self-reported ED were treated with CC (50 mg) 3 times a week for 4 months. In addition to confirming the increase in LH, FSH and free testosterone levels, they reported an improvement in sexual function in 75% of studied men. Taylor and Levine compared CC efficacy to T gel replacement therapy (26) , with an average post-treatment testosterone of 573 and 553 ng/dL in the CC and T gel groups, respectively. Further support of the efficacy of CC in hypogonadal symptom relief comes from a retrospective comparative study by Ramasamy et al. (27) , where CC was compared to T injections and T gels. While post-treatment T levels were highest with injections (1,104 ng/dL) in comparison to CC (504 ng/dL) or T gels (412 ng/dL), Transl Androl Urol 2016;5(6):859-865 tau.amegroups.com © Translational Andrology and Urology. All rights reserved. no significant differences were reported on the degree of symptomatic improvement between the treatment groups. Another study verified the safety and efficacy of long-term CC use (28) . Eighty-six men with hypogonadism were treated with 25-50 mg CC for a mean duration of 19 months resulting in an average testosterone level of 550 ng/dL with significant improvements in libido and energy (28) .\nExisting studies on the influence of CC on sperm production confirm favorable outcomes. Patankar et al. treated patients with oligospermia (including severe oligospermia) with only 3 months of CC and demonstrated a statistically significant improvement in semen parameters (29) . In another clinical trial, 101 oligospermic men were randomized to either receive treatment with CC 50 mg daily (n=56) or receive no treatment (n=45). Significant improvements in sperm density and motility were observed in the treated group. Seven pregnancies were reported in the treated group, while no pregnancies were observed in the control group (30). Wang et al. randomized 46 men with idiopathic oligospermia to 6 months of treatment with a placebo, CC (25 or 50 mg/day), mesterolone (100 mg/day), or pentoxifylline (1,200 mg/day) or 4 months of treatment with testosterone enanthate (100 or 250 mg every other week). Patients treated with placebo, mesterolone, pentoxifylline, and testosterone did not develop any significant improvement in mean sperm concentration or pregnancy. Patients receiving CC at both dosages showed a significant increase in mean sperm concentration and pregnancy rates (36.4% with 25 mg and 22.2% with 50 mg) (31) .\nRecent interest in CC isomers has emerged. Enclomiphene citrate (EC) is a more potent, shorter acting isomer of CC. In a phase IIB study, 12 men previously treated with 1% T gel for at least 6 months, were randomized to 25 mg EC or 1% T gel and results were compared at 3 and 6 months. Before therapy, T levels were comparable between both groups and averaged 165 ng/dL. After therapy, an increase in T to >540 ng/dL was observed in both groups. Unlike T gel, EC increased sperm counts in all men at 3 and 6 months' interval (32) . Another study comparing different doses of EC to 1% T gel or placebo, confirmed a comparable efficacy between EC and 1% T gel on serum T elevation (33) ."}, {"section_title": "Human chorionic gonadotropin (hCG)", "text": "hCG is an LH analog purified from the urine of pregnant women or through recombinant technology (34) . Discovered in 1932, hCG has been used in women to stimulate follicular maturation. In men, it is administered subcutaneously or intramuscularly 2 to 3 times per week at doses of 2,000 to 3,000 international units (IU). It stimulates Leydig cell production of endogenous T and is capable of initiating spermatogenesis in men with hypogonadotropic hypogonadism (35) . This effect, however, is often not sufficient to induce spermatogenesis necessitating the concurrent use of FSH. In one case series, 13 azoospermic men with hypogonadotropic hypogonadism were initially treated with a combination of hCG and human menopausal gonadotropin (hMG) to stimulate spermatogenesis. hMG was then withdrawn and patients continued treatment with hCG alone for a period ranging from 3 to 24 months. After 12 months of treatment, sperm counts significantly decreased in all patients with one of them becoming azoospermic (36) . hCG administered in lower doses also maintained a favorable testicular response. In a randomized trial by Roth et al., experimental gonadotropin deficiency was induced in 37 normal men with GnRH antagonists. Patients were then randomized to receive either several low doses of hCG or T gel daily. Testicular fluid obtained by percutaneous aspiration was assessed at baseline and after 10 days of treatment. Results indicate that intratesticular T levels increased in patients receiving far lower doses of hCG that what is therapeutically prescribed (37) .\nhCG has been investigated in late onset hypogonadism (LOH) despite a prevalent understanding that LOH is secondary to deterioration of the HPG axis. Liu et al. conducted a randomized double-blind placebo controlled trial on 40 healthy, ambulatory, and communitydwelling men with an average age of 67 years (38) . After administration of 5,000 IU of hCG twice weekly for 3 months, serum T levels increased from a baseline of 320 to 778 ng/dL. Despite this improvement, a paradoxical reduction in testicular volume was detected among the study subjects which was unfortunately not correlated with reports of semen parameters (38) . Moreover, the study's primary endpoint was a 20% increase in muscle strength, which was not achieved after treatment. Further studies are still required in this subset of patients before considering hCG as an alternative to T therapy in men with LOH."}, {"section_title": "hCG and testosterone", "text": "The combination of lower doses of hCG with ongoing T replacement has been assessed in few studies. This regimen's ability to maintain intratesticular T levels and spermatogenesis favors it as an alternative approach for men who desire fertility preservation while on T replacement. In 26 men receiving low doses of hCG (500 IU every other day) combined with either transdermal or intramuscular T for a mean duration of 6.2 months, no significant differences in pre-treatment semen parameters were observed even after 1 year from initiating the protocol (39). Coviello et al. assessed intratesticular T levels from 29 men who were randomized to receive 200 mg T enanthate weekly in combination with either saline placebo or 125, 250, or 500 IU hCG every other day for 3 weeks. Intratesticular T levels increased linearly with increasing hCG confirming that relatively low dose hCG maintains testicular function in healthy men with endogenous gonadotropin suppression (40) ."}, {"section_title": "Aromatase inhibitors (AIs) (anastrozole and letrozole)", "text": "Aromatase is an enzyme that belongs to the cytochrome P-450 family. It is present in the testis, liver, brain, and adipose tissue and is responsible for converting T to estradiol. AIs block this conversion thereby minimizing the negative effects of estradiol on gonadotropin secretion and intratesticular T production. The subsequent increase in levels of LH, FSH and T consequently improve spermatogenesis (41) . Such medications are most commonly indicated in the treatment of male infertility in obese patients or when the testosterone to estradiol ratio is less than ten. AIs are classified into steroidal or non-steroidal. Anastrozole (1 mg) and letrozole (2.5 mg) are third generation AIs that are highly specific and well-tolerated.\nAIs have been largely evaluated for the management of age-related hypogonadism. In a recent study by Dias et al. (42) , AIs consistently increased serum T levels and, more importantly, improved patients' bone mineral density (BMD). Fear of a presumed negative effect on BMD emerged initially. It was mainly based on the clinical features of male aromatase deficiency syndrome, a condition caused by a mutation in the CYP19 and characterized by elevated T, LH, FSH, absent estradiol levels, osteopenia, failure of epiphyseal plate closure and tall stature (43) . Unlike male deficiency syndrome, serum estradiol is not totally eliminated from the body with AIs. Studies reveal up to 65% reduction in serum estradiol levels in men taking AI's (44) . This preserves the beneficial effects of estrogen on BMD, which together with the witnessed increase in serum T, maintains or improve BMD measures.\nFew studies have addressed AI effects on serum T levels and on BMD among elderly men. While all studies have shown significant improvements in T levels after treatment, beneficial effects on bone health were not unanimous. Leder et al. randomized 37 elderly men (age 62-74 years) into three groups; anastrozole 1 mg once daily, anastrozole 1 mg twice weekly, and placebo (45) . Treatment was given for 12 weeks and patients were followed with a serum hematocrit level, medical outcome score health survey, international index of erectile function, and American Urological Association symptom index questionnaires. They reported an increase in serum bioavailable and total testosterone levels in the treatment groups to the youthful normal range (207 and 570 ng/dL for group 1; 178 and 520 ng/dL for group 2, respectively), without a significant change on any of the follow up tools (45) . Another randomized double blind placebo controlled trial investigated 69 men more than 60 years of age with borderline or low T levels and symptomatic hypogonadism. Compared with the placebo group, patients treated with anastrozole 1 mg once daily showed significant improvements in serum T level, however, a significant decrease in their spine BMD was also reported (46) . Adverse effects are generally minimal; while a slight insignificant increase in PSA level has been reported in one study, no major effects on serum hematocrit, liver function or urinary symptoms were noted (45) ."}, {"section_title": "Conclusions", "text": "The prevalence rate of hypogonadism in men seeking fertility is increasing. Efforts to raise the public as well as physician awareness about the detrimental effects of exogenous T on HPG axis and sperm production are mandatory. Several alternative medications have been successfully utilized for hormone replacement with documented improvement in hypogonadal symptoms. Patients electing to utilize such medications should be monitored for T related consequences as well as drug specific side effects.\nTransl Androl Urol 2016;5(6):859-865 tau.amegroups.com"}]