[{"section_title": "Abstract", "text": "Students should begin to engage in problem-solving and higher order thinking skills in mathematics in the early years of school in preparation for 21st-century technology and problem-solving competencies.\nUsing the Southern and Eastern Africa Consortium for Monitoring Educational Quality (SACMEQ), this study examines the distribution of significant teacher quality factors related to sixth-grade students' mathematics competencies across the regions of Kenya and Zimbabwe. The mathematics competencies range from Pre-numeracy to Abstract Problem Solving level. First, we use a multi-level regression model to analyze the relationships between teacher quality and students' mathematics competencies to find out which teacher quality variables are important for the improvement in students' mathema tics competencies in the participating countries. We then illustrate the distributions of the teacher quality factors within the regions in Kenya and Zimbabwe. From the multilevel model analysis, the teacher quality factors related to students' increase in mathematics competencies were teaching experience, mathematics competencies, and teachers' academic qualifications. We observe that students taught by permanently employed teachers had lower math competencies and that the days spent by the teachers in professional development influence students' mathematics competencies negatively. The distributions of these teacher quality factors that matter in sub-Sahara Africa are concentrated in the capital cities and particular regions in Kenya and Zimbabwe. Implications for policy and practice are discussed."}, {"section_title": "Introduction", "text": "The need for quality education for all students is one of the millennia development goals the United Nations propose for sustainable development. In developing nations, this goal includes equality of educational opportunities, increased student enrollment in school, more resources for learning, reduction of students' dropout rates, and recruiting more qualified teachers (Ministry of Devolutio n and Planning, 2013; Ministry of Economic Planning and Investment Promotion, 2012; National Economic and Social Council of Kenya, 2014) . One of the pressing issues in educational development is the need to strengthen mathematics development among the graduating high school students and beyond (International Mathematics Union [IMU], 2009) . Particularly, the weakness in the teaching of mathematics in the primary schools and lack of qualified teachers in secondary schools have been a source of concern among the mathematics educators' community in Africa (IMU, 2009 ).\nFurther, to be competitive in the 21st-century technology advancement and to be at par with the problem-solving competency for the present economic development in the African continent, there is a need for students to develop problem-solving and reasoning skills in their initial years of learning mathematics. For the successful transition to higher-level mathematics and familiarity with higher level thinking such as critical thinking and abstract reasoning in mathematics, African students need to be more grounded in these \"21st-century skills\" (National Research Council [NRC] 2013, 1).\nConsequently, these skills enable more students to join professions that require competence in reasoning and problem solving. goals and students' mathematics achievement in both countries was above SACMEQ average (Wasanga, Ogle & Wambua, 2011) . However, within these countries, the students' mathema tics achievement varies across the regions (Chitiga & Chinooga, 2011; Wasanga et al., 2011) .\nNotwithstanding, studies on the link between teacher quality and students' learning is scant in the literature on mathematics education in these countries.\nThe purpose of this study, therefore, is to identify the significant teacher quality factors that influence sixth-grade students' mathematics competencies and to compare the distribution of these factors within, Kenya, and Zimbabwe. The sixth-grade students' mathematics competencies provide information about their level of foundational mathematics competency levels that is essential for success in learning more advanced mathematics. This study contributes information on possible teacher quality factors that contribute to students' success, or lack thereof, of higher order mathema tics competencies. Kenya and Zimbabwe were among the countries whose students and teachers participated in the SACMEQ survey. The ministries of education in these two countries have made significant efforts to improve the teaching and learning of mathematics. These countries, therefore, provide vital information on the differences and similarities in policy and practice that guide the teaching and learning of mathematics in Southern and Eastern Africa.\nTeacher quality is one of the factors that relates to students' learning. It influences instructio na l approaches, curriculum use, and student achievement. This study draws on the teacher quality framework and cites literature on teacher quality research across and within nations. The summary of the research begins with teacher quality defined in a general sense by identifying factors indicative of high-quality teachers. Next, specific studies on teacher quality across different nations are summarized.\nIncluded are studies comparing national education policies from around the world, smaller settings such as selected States in America, Turkey, and different contexts in Sub-Sahara Africa. Finally, we provide a summary of several policy reviews on student achievement in Kenya and Zimbabwe are presented."}, {"section_title": "Theoretical Framework", "text": ""}, {"section_title": "Defining Teacher Quality", "text": "Teacher quality or teacher characteristics include teaching experience, subject matter preparation, professional development attendance, certification status, and educational level (Akiba, LeTendre, & Scribner, 2007; Goe, 2007) . In this paper, we discuss these characteristics as markers of teacher quality.\nTeachers' years of experience is further categorized into \"novice\" or \"experienced teacher\".\nSpecifically, a \"novice teacher\" is defined as one who has two years of teaching experience or less, while an \"experienced teacher has a minimum of ten years of experience (e.g., Goldhaber, Lavery, & Theobald, 2015) . Test scores for certified teachers have been used to define teacher quality in individual states in America. For example, in Washington state, Goldhaber, and colleagues (2015) classified teachers whose scores from the Washington Educator Skills Test-Basic (WEST-B) standardized test fall in the lowest 10% to be of poor quality and those in the top 10% to be of the best quality. Included in the teacher quality definition is evidence of teachers' continued learning through workshops, professional development, or any forms of training related to the improvement of teacher practices (Goe, 2007) . In sum, teacher quality is the resource necessary for teaching that teachers bring to the classrooms. Kennedy (2010) admitted that the measurement of teacher quality could be based on characteristics such as experience and test scores but argued about the underestimation of adjustments that need to be made for situational factors when considering the quality of teachers. Kennedy d identified numerous external factors that contribute to an altered perception of teacher quality such as the shape of the room, allotted time for teaching, availability of classroom materials, and additiona l work assignments beyond teaching. Additionally, contextual constraints such as lack of preparation time, participation in other non-related teaching activities, students' absenteeism, and selection of inappropriate curriculum materials for instruction can reduce the perceived quality of a teacher (Kennedy, 2010) . Therefore, the certification process in countries such as the United States, in which teachers reflect on their instructional practices and then have chances to adjust their thinking during their portfolio development process is influenced by these contextual factors (Sato, Wei, & Darling Hammond, 2008) .\nIn this study, we focus on teacher quality considering it as a useful resource for teaching.\nHowever, we realize that although teachers may have these qualities, the context and conditions in the schools they teach may constrain how they use the resources they bring to the classroom. Nonetheless, a first step towards the improvement of teaching mathematics is to consider the teachers' quality and students' access to qualified teachers."}, {"section_title": "Studies on Teacher Quality", "text": "Cross-nationally, there has been an increased focus on teacher quality. Studies on teacher quality include discussions on the differences and similarities in teacher quality across contexts, the effects of teacher quality on students' achievement, and distributions of teacher quality. Other studies document the process of improving teacher quality. In this section, we first present research on the differe nces and similarities of teacher quality across contexts. We then discuss the literature on the distributions of teacher quality. This discussion is followed by some studies on the relationships between teacher quality and student achievement. We conclude this section with studies on the improvement of teacher quality.\nThere are similarities in teacher quality cross-nationally, but with differences within some countries. It is, therefore, possible to study teacher quality using the characteristics borrowed from studies done cross-nationally, because of the similarities in teacher quality measures across contexts .\nFor example, Akiba, LeTendre, and Scribner (2007) reported that the average eighth-grade teacher quality in the United States was similar to the other 45 countries that participated in the Trends in International Mathematics and Science Study (TIMSS). However, when considering certification as a teacher quality measure, differences are found within countries. Across the United States, certifica tio n process obtained through the Praxis exam differs across the years, grade levels, pass rates, and teacher specializations. Between the 1990s and the early 2000s, the passing rate on the exam dropped (Gitomer, 2007 Although all students should have equal access to qualified teachers, the literature indicates an uneven distribution of teacher quality across countries. Akiba, Letendre, and Scribner (2007) reported a large opportunity gap regarding which students had access to higher quality teachers that is explained by socioeconomic status in the United States. Similarly, Goldhaber and Anthony (2007) found that non-white, poor, and underperforming students were more likely to be taught by lower quality teachers in North Carolina. Likewise, a focus on teacher quality with respect to experience, licensure score and overall effectiveness revealed the unequal distribution of teacher quality throughout the state of Washington (Goldhaber, Lavery, and Theobald, 2015) . Particularly, areas higher in poverty with a larger proportion of minority students are not as enticing to high-quality teachers, meaning they must settle for more teachers of lower quality, further expanding the teaching gap. Similarly, Ozel and Ozel (2013) found that students in Turkey from a low socio-economic status provenance (SES) were much less likely to have a teacher with at least three years of experience than students with a high SES and were also less likely to have a teacher with a mathematics or mathematics education degree. As such, offering teachers incentives for continuing to teach in a disadvantaged school could be a step in leveling the playing field and narrowing the teacher quality gap Students with highly qualified teachers have higher achievement scores (Darling-Hammo nd, 2000; National Research Council [NRC], 2010; Wayne & Youngs, 2003; Wilson, Floden, & FerriniMundy, 2002) . Similarly, a study of teacher quality in North Carolina among four cohorts of sophomores between 1999-00 and 2002-03 documented differences between student achieveme nts based on their teacher's quality. Notably, students who had teachers with more experience tended to perform better up until the teachers' fifth year (Clotfelter, Ladd, and Vidor, 2010) . Additiona lly, students taught by teachers with Master's degrees had a significant improvement at the end of course scores. Clotfelter, Ladd, and Vidor (2010) found a statistically significant positive linear relations hip between teachers' scores on certification exams such as the Praxis II exam and their students' achievement on the end of semester examination. However, teachers with a lateral entry license, whic h allows college graduates with only a Bachelor's degree to teach while completing their certifica tio n over the next three years, were slightly less effective than those with regular licenses. Further, third and fourth grade National Board-certified teachers had the largest effects of the on students' (Clotfelter et al., 2010) . In sum, teacher quality is a significant factor in students' performance, considering the context, certification, and students' grade levels related to the learning outcomes.\nTeacher quality is among the factors that several countries have focused on in their quest for the improvement of mathematics learning outcomes. Hunt (2015) selected 40 countries located in Latin America, the Caribbean, Sub-Sahara Africa, and three regions of Asia and analyzed how each country planned to improve teacher quality and learning outcomes in their national education policy. With regards to improving teacher quality, Hunt found that less than half of the educational plans included provisions to improve the quality of teacher education programs and only seven proposed increasing the standards for teacher qualifications. Although 80% of the plans called for greater accountability for improving teacher quality, there was a difference of opinion as to who should be held responsible, ranging from teachers, head teachers, and the school.\nSimilarly, teachers' subject matter qualifications differ across the African countries. Bonnet (2008) observed that among the participating countries, the Kenyan students had teachers with the highest qualification in mathematics. Further, over 95% of teachers in Kenya reached mathema tics competencies 1 level of eight of the scale measurement of mathematics competencies, indicating that they could identify \"the nature of an unstated mathematical problem\" and turn it into a \"symbolic, algebraic, or equation form\" to solve the problem (Wasanga et al., 2011, p.98) . In comparison, only two other countries (Uganda and the Seychelles) had 50% of its teachers attaining competency level of eight. Carnoy and Arends (2012) reported that teacher quality and teacher knowledge are related.\nFocusing on students in South Africa and Botswana, Carnoy and Arends (2012) found that very few teachers in South Africa had \"university-level training,\" compared to nearly half in Botswana.\nMoreover, teachers in South Africa with university level training had a lower level of mathematica l knowledge than Botswana teachers with coursework from a teacher training college. Indeed, these findings further confirm that subject matter qualifications and teacher knowledge should be further investigated and the relationships with students' mathematics competencies explored.\nComparing teacher quality across selected Anglophone countries in Sub-Sahara Africa reveals teacher quality is dissimilar. Both Kenya and Zimbabwe had high percentages of their teachers with at AJOTE Vol. 7. No. 1, pp. 66 -94 least a secondary education, coming in at 97.8% and 94.8% respectively. One significant differ ence between teachers' backgrounds was on the number of years of teacher training (Makuwa, 2011) .\nWhereas Zimbabwean teachers were above average at 3.1 years, Kenyan teachers had a below average amount of training at 2.0 years. However, Kenyan teachers had more years of teaching experience on average at 13.3 years compared to 11.5 years in Zimbabwe. Teachers in Kenya scored well above average on the reading achievement test in both 2000 and 2007 with their scores coming in second only to the Seychelles in 2000 and third after Seychelles and Zimbabwe in 2007. These differences in teacher quality call for more in-depth studies on the influence in students learning within and across countries."}, {"section_title": "Students' Mathematics Achievement in sub-Sahara Africa", "text": "Students' mathematics achievement in sub-Sahara Africa is available through cross-national studies such as TIMSS, Program for International Student Assessment (PISA), UNESCO, and SACMEQ.\nThree countries from Sub-Sahara Africa consistently participate in TIMSS: Botswana, Ghana, and South Africa. Algeria was the only country in Africa that took part in PISA. Hence, the SACMEQ data provides more information on the quality of education in Sub-Sahara Africa. Studies that have used the SACMEQ data to analyze students' mathematics achievement have focused on the trends over the years and achievement in particular countries in each year the SACMEQ survey cycles. A policy brief of 2011 documented that in 2000 and 2007, there was a decrease in students' mathematics scores from 563 to 557 in the SACMEQ achievement test. (Wasanga, Ogle, & Wambua, 2011) . Nonetheless, these scores were above the SACMEQ means of 500 and 510, respectively. Abuya and colleagues (2015) suggested that the Free Primary Education policy in Sub Saharan Africa led to increased school enrollment and shortages of teachers in public schools, causing some lag in students' learning.\nIn-country comparisons of Kenya and Zimbabwe indicate there are mathematics achieve me nt disparities across the regions and consistently low levels of mathematics competencies among the students. In Kenya, the sixth-grade students across all the regions displayed similar to or greater than the average 2 mathematics scores in the last SAQMEC assessment (Wasanga et al., 2011) . However, in Zimbabwe students in half of the regions had lower than the average SAQMEC score (Chitiga & Chinooga, 2011) . Also, between 2000 and 2007, most of the students' mathematics competencies were AJOTE Vol. 7. No. 1, pp. 66 -94 consistently at the lower levels in Kenya (Hungi &Thuku, 2010; Wasanga et al., 2011) . The students' average mathematics competencies in Zimbabwe are similar to the sixth-grade students' in Kenya with more than 80% of the students having scored at level 5 competencies or lower out of 8. In both countries, the differences in mathematics competencies indicate [that] more students with higher SES and from urban regions had higher mathematics competencies when compared to those from lower SES backgrounds and the rural areas (Hungi et al., 2010) .\nThe studies using SACMEQ data focus more on the achievement and students' mathema tics competency levels across regions in specific countries. Unfortunately, these univariate measures do not provide sufficient information to explain the low mathematics performance levels of sixth-grade students within the Sub-Sahara countries. Further, there is a paucity of predictive studies on teacher quality and students' mathematics competencies in the literature on education in the African context.\nThe integration of teachers' mathematics competencies with teacher quality could provide more information on specific teacher qualities that matter. Therefore, expanding on these init ial findings through the inclusion of teacher mathematics competencies and relational studies provides valuable information for policy and practice and will also help to identify geographical patterns in the countries selected for study. Our study examines the relationship between sixth-grade students' mathema tics competencies and teacher quality across the countries in the 2007-2011 SACMEQ study and the distribution of teacher quality factors in Kenya and Zimbabwe. The questions guiding the study are:\n(a) What is the relationship between the teacher quality and students' mathema tics competencies across the countries that participated in the SACMEQ study, controlling for gender and socio-economic status?\n(b) What are the differences in the significant teacher quality factors across the regions in Kenya and Zimbabwe?"}, {"section_title": "Methods", "text": "In this study, we use the Southern and Eastern African Consortium for Monitoring Educational Quality of teachers, students, and principals in fifteen countries in Sub-Sahara Africa were the respondents in this study. SACMEQ aims to monitor the educational quality across countries in Sub-Sahara Africa and provides information for policy and practice. The students and teachers were sampled using disproportionate sampling, and the data then organized with weighting information to allow for crosscountry analysis. In sum, the data is appropriate for exploring the teacher quality and student achievement between and within the participating countries."}, {"section_title": "Variables of the Study", "text": "The dependent variables selected for this study are the students' mathematics competency levels. The competency levels are set on an ordinal scale indicating the students' proficiency level. The SACMEQ data provides the students' and teachers' competency levels. The teacher quality variables in the study are the academic qualification, the number of years of professional training, years spent teaching, the number of professional development courses attended, days spent on in-service courses, effective professional development (teachers' perceptions), and subject matter preparation. Table A1 presents a summary description of the variables used in the study. "}, {"section_title": "Analysis", "text": "To address the research questions, a predictive analysis using a multi-level model was used to compare the relationships between teacher quality measures and students' mathematics competencies across the countries in the SACMEQ study. This was followed by a descriptive analysis of the significant teacher quality factors in Kenya and Zimbabwe. The teacher quality distributions across the regions within the two countries highlight the differences and similarities between and within the two countries. This analytical method for the relational analysis was selected because it takes the clustering of students in classes and schools into consideration and allows for the inclusion of weights that then provide the corrected standard errors. Notably, the analysis considers the differences that exist between the teachers in the different schools. The equations of the multilevel models are provided."}, {"section_title": "Level 1 (student level variables)", "text": "(MATH PROFICIENCY)ij = β0j + β1j (Gender)ij + β2j (Socioeconomic status)ij + rij\nEquation (1) represents the sixth-grade student i in class j. β0j represents the average mathema tics proficiency, whereas the other beta coefficients, the slopes of the equations, represent the change in \nThe coefficients represent the information on the relationships between the teacher quality variables and the mathematics proficiency between the students' teachers, and are grand mean centered. 00 is the value of the grand mean of mathematics proficiency considering all the students at the country level."}, {"section_title": "Results", "text": "The results are organized by first presenting the relationships between the teachers' quality measures and students' mathematics competencies. Next, we compare the distributions of the significant teacher quality factors within the two countries. The findings illustrate the relationships among pre-service preparation of the teachers in the countries, continued professional development, and students' mathematics competencies."}, {"section_title": "Relationships between Teacher Quality and Students' Mathematics Competencies", "text": "The patterns of relationships between the teacher quality measures and students' mathema tics competencies across all the participating countries, controlling for students' gender and socioeconomic status are illustrated using a multilevel regression model. A summary of the unconditional and the multilevel relationships are presented and include information on the coefficients of the relations hips between the variables and standard errors. Table 2 presents the unconditional models including the variance components. The Intra class correlations ( = 00 /( 00 + 2 ) values (ICC=40%) is above 10% and therefore a multilevel model is allowed (Raykov & Marcoulides, 2012) . In particular, 40% of the students' mathematics competency is between the schools in the participating SACMEQ countries and 60% of the variation in students' mathematics competency is between students. The models of the relationships between teacher quality and students' mathematics competencies are presented on Table 3 . The dependent variable in the multilevel model is the students' mathema tics competency level. The model includes two level 1 covariates: gender and socioeconomic status (SES).\nThe average sixth grade students' mathematics competency in the participating countries in Sub Saharan Africa was 3.15, which is above basic numeracy but below the level of beginning numeracy.\nFurther, there was a significant gender difference in students' mathematics competencies; boys had significantly higher scores when compared to their female counterparts. In addition, the SES was a significant predictor of students' mathematics competency.\nThe model shows that some teacher quality measures were positively related to students' mathematics competencies, while others were] negatively related In particular, teachers academic qualification (= .15, p< .001), years of teaching experiences (=.01, p<.001), and mathema tics competencies (=.22, p<.001) were significant positive predictors of students' mathema tics competencies. However, permanent employment status (=-.20, p< .01) and number of days spent in in-service training (=-.001 .p< .01) were negative predictors of students' mathematics competencies.\nWhile teachers' professional training and attendance of professional development were perceived as effective for building teaching proficiencies, these measure showed positive correlations with students' mathematics competencies, but were not significant. Also, the number of in-service courses taken showed a negative relationship with students' mathematics competencies. A summary of the relationships in the multilevel model is presented in Table 3 ."}, {"section_title": "Understanding the Relationships between Teacher Quality and Sixth Grade Students' Mathematics", "text": "Competencies in Kenya and Zimbabwe The multilevel regression analysis indicates that in Sub-Sahara Africa, teachers' academic qualification, their years of teaching experience, and mathematics competencies are significant teacher quality factors that matter in students' mathematics competencies. Therefore, a further analysis of the distributions of these teacher quality factors provides a direction on where these essential qualities are lacking in Kenya and Zimbabwe. Similarly, a look at the distribution of the teacher quality factors that were negatively related to students' mathematics competencies (permanent employment and number AJOTE Vol. 7. No. 1, pp. 66 -94 of days spent in in-service training) provides further elaborations of the scenarios within the countries.\nIn this section, we first present the distributions of the teacher quality measures that were positive ly related to students' mathematics competencies. We then discuss the distributions of the teacher quality factors that were negatively related to students' mathematics competencies, namely permanent employment status and number of days spent on in-service training."}, {"section_title": "Educational background (Teacher qualifications).", "text": "In general, teachers in Zimbabwe have slightly higher educational backgrounds than their counterparts in Kenya. There is little difference among the least qualified teachers in the two countries with 6.7% of teachers in Kenya and 5.2% of teachers in Zimbabwe attaining either a primary or junior secondary education. There is greater disparity in the attainment of higher levels of education. The senior secondary is the highest level attained by 63% of teachers in Kenya compared to only 43% in Zimbabwe. Although the A-level education levels are similar (26% in Kenya vs. 24% in Zimbabwe), the rate at which teachers attain a first degree, the highest level of education, is seven times higher in Zimbabwe. Over one-quarter of Zimbabwean teachers have the first degree education while less than 4% in Kenya have achieved the same level of education. Within Kenya, the coastal province had the least number of teachers with an A-level educational background. Also, the Northeastern and Western regions had no teachers with the first-degree level of education. In Zimbabwe, Harare and Bulawayo provinces had the highest percentage of teachers with first degrees. Masvingo province had the lowest number of teachers with a first degree. A summary of the distribution is presented in Figure 1 . The regions in Kenya where teachers tended to have the most experience were in Nairobi, Nyanza, and the Central region. The median number of years teaching in the Central region is just under 20, while a quarter of teachers in Nairobi and Nyanza had 20 years or more of experience. The Northeastern area of Kenya employed teachers with the least amount of experience; a half had six years or less of teaching experience and one-quarter had three years or less. In Zimbabwe, the most experienced teachers were in Bulawayo and Harare where the median was above 15 years and a quarter of the teachers had taught for more than two decades. The region with the least experienced teachers was Matabeleland South where the median years of experience were four and one-quarter of teachers had been teaching for two years or less. There tended to be more variability in the median number of years teaching across Kenyan regions than in the regions of Zimbabwe. The distribution of the teachers' years of teaching experience is presented on Figure 2 . In fact, about 4% of teachers in Harare only displayed competencies at level four, Beginning Numeracy. Figure 3 shows the distribution of the sixth-grade teachers' mathematics competencies. "}, {"section_title": "Teachers' Employment Status", "text": "In both countries, most of the sixth-grade teachers have permanent employment. More teachers in Zimbabwe (above 80%) have permanent government appointed status compared to those in Kenya.\nThe Coastal (90.67%) and Western (86.97%) regions had the highest permanent government employed teachers whereas North Eastern (69.34%)regions had the lowest percentage of permanent governme nt hired teachers in Kenya. Besides, North Eastern and Eastern Central, Nyanza and the Rift valley regions had between 15-25% of the sixth-grade teachers on temporary non-government appointme nt.\nIn contrast, the few teachers in Zimbabwe without permanent government employment status were on temporary government appointment, with the highest percentage found in Mashonaland Central (16.38%). The teachers' employment statuses across the regions are presented in Figure 4 . "}, {"section_title": "Number of Days spent on In-service Training.", "text": "In both countries the number of days the sixth-grade teachers spent on in-service training taken was low. More teachers spent time on in-service training in Kenya than in Zimbabwe. However, most of the teachers in both countries had not spent time on in-service training Figure 5 is an illustra tio n summarizing the distribution of teachers that spent time on in-service training in Kenya and Zimbabwe. "}, {"section_title": "Discussion", "text": "This study aimed to identify teacher quality factors that contribute to students' development of higherlevel mathematical skills. The findings focus on the relationships between teacher quality and the students' mathematics competencies in the participating SACMEQ countries. The influence of these measures on students' learning builds understanding on focal areas related to teacher quality that could be contributing to students' lack of problem-solving skills within Kenya and Zimbabwe.\nTeacher qualification is one of the teacher quality factors that developing countries should focus on to improve student learning. The minimum qualification of primary school teachers in Sub-Sahara Africa is upper secondary school without any prospect that this will change in the nearest future (Lauwerier & Akkari, 2005) . In this study, we found that teacher qualification is a significant predictor of students' mathematics competency. A look at the two countries that are the focus of this study shows that the sixth-grade teachers in Zimbabwe had higher educational qualifications when compared to the teachers in Kenya. Also, Harare had the highest percentage (40%) of the sixth-grade teachers with firstdegree qualifications. In Kenya, the region with the highest percentage of teachers with a first degree was Nairobi at about 10%. Notably, there were some areas in both countries that had teachers who did not meet the minimum qualification. In Kenya, the Central, Eastern, Nyanza, and Rift Valley regions had about 10% of the teachers having lower than the minimum required teaching qualification. In Zimbabwe, the Mashonaland East and Matabeleland North had about 10% of the teachers not meeting the minimum educational qualification. In sum, the distribution of teachers with high educational qualifications is not equal across the regions in Kenya and Zimbabwe. Similar to other nations (e.g., Goldhaber et al., 2015) , there is an opportunity gap in students' access to teachers with higher educational qualifications.\nThe sixth-grade teachers' years of experience were significant predictors of student mathematics competencies. The teachers in the participating SACMEQ countries seemed to have been more successful in learning pedagogical practices for improving students' achievement indicating the successful development of The Wisdom of Practice (Shulman & Hutchings, 2004) . A study from a different context shows support for these findings: teachers learn on the job to be more efficient in developing student learning (Harris& Sass, 2011) . In the two focus countries, certain regions have teachers with fewer years of teaching experience. For example, in Kenya, the median years of teaching experience of the teachers in the North-Eastern region was the lowest at about five, but in the Central province, the median years of teaching experience was at about 20. In Zimbabwe, the sixth-grade teachers in Mashonaland East and Matabeleland South had five years as the median years of teaching experience; the least across the regions. However, Harare and Bulawayo had teachers with about median15 years of teaching experience. The findings indicate that perhaps there is a higher turnover of teachers in the North-Eastern Province in Kenya, and Mashonaland East and Matabeleland South in Zimbabwe. Perhaps the situational factors such as the location of the school, access to adequate teaching resources, and student populations could be contributing to the high turnover of teachers in these regions. The fact that the teachers' teaching experience is an important factor for students' development of higher mathematics competencies points to the need for policies focused on incentives offered to retain teachers in these regions. Similarly, The UNESCO report (2006) emphasized the need for incentives to keep best teachers in disadvantaged regions. The correlations between the teachers' and students' mathematics competencies indicate that higher teachers' mathematics knowledge is beneficial for students' development of higher mathema tics competencies. However, the average students' mathematics competencies across the SACMEQ countries were between basic numeracy and beginning numeracy. Such findings suggest that the pedagogical content knowledge the teachers have is insufficient for teaching high-level mathematics.\nAlso, it is possible that contextual factors may influence the learning of mathematics across the two countries. Such factors could include the information available in the curriculum materials, the policies related to grade-level expectations, and other situational factors within the schools and countries (Hiebert & Grouws, 2007) . Hiebert and Grouws (2007) suggested that teachers might have challenges \"enacting complex skills even when known by the teachers (p.393)\". Indeed, pedagogical knowledge is a challenge in Botswana and South Africa. (Sapire & Sorto, 2012) . Therefore, although these teachers seem to have the content knowledge on higher order skills, they need pre-service and in-service programs that emphasize the teaching of higher order skills in the elementary grades.\nAn interesting facet of the analysis was the negative relationship between students' competency levels and their teachers' attendance of professional development. Similarly, Harris and Sass (2011) found that in-service professional development for teachers in Florida did not help to improve students' mathematics achievement. They pointed to lack of resources and need for more pedagogical training in the professional development provided. In the Kenyan and Zimbabwean context, it is possible the content provided is not teacher-directed or does not relate to the needs of the teachers. The fact that the teachers' professional development attendance was negatively related to the students' mathema tics competencies supports the notion that discussions of topics on pedagogy could be lacking in these forums as suggested by Harris and Sass (2011) . Lack of teacher input could lead to the adoption of inappropriate policies for professional development and could also be demoralizing to the teachers (UNESCO, 2006). As such, teachers are likely not to use the knowledge gathered from the professiona l development forums if the content is not relevant.\nAdditionally, the personnel providing these forums should ensure equitable access to these inservice needs across the regions in the two countries. Although the findings on the relations hips between professional development and students' mathematics competencies were negative ly significant in the model, the teachers in Kenya seemed to have more professional development opportunities than the teachers in Zimbabwe. The reports from the teachers from Northeastern, Eastern and Nyanza regions in Kenya and Mashonaland Central and Matabeleland South in Zimbabwe indicate they hardly had in-service courses. Therefore, most of the teachers in these provinces have missed opportunities for continued self-development, yet studies on teacher quality document that teacher education programs curriculum could be lacking in supporting teachers to learn skills that can improve students' achievement (e.g. Harris & Sass, 2011) . As such, the teachers' lack of participation in professional development suggests that the gaps they bring to their classrooms after graduating from their teacher preparation programs are still present.\nTeachers' permanent employment status was negatively related to students' mathema tics competencies. Perhaps teachers who have job security put less effort in supporting their students to develop higher order skills. Indeed, other situational factors that might include, but are not limited to access to teaching materials, school policies or student populations could be a contributing factor to permanent status being a factor that does not improve students' mathematics competencies. Perhaps the introduction of school-based in-service courses for the permanent government employed teachers would be a step towards improving students learning of higher order skills in mathematics (UNESCO, 2006) . Additionally, the UNESCO report (2006) points to having policies for professional development for teachers with permanent government employment status so that they all meet the minimum teacher qualification requirements.\nOverall, students and teachers in Kenya had higher mathematics competencies than their counterparts in Zimbabwe. Kenya's education system has been rapidly developing through the support of agencies such as The Japan International Cooperation Agency (JICA), which was present in Kenya between 1998-2013. JICA supports in-service primary and secondary teacher professiona l development in mathematics and science and was divided into three phases to support teachers (Ishihara, 2012; JICA 2013) The JICA project in Kenya has introduced newer ways of teaching mathematics. Although elementary school students have not reached the levels they should, there is evidence that the new JICA teaching policies have some positive effects. The recent teacher graduates experienced new pedagogies learned from their high school teachers. For example, in the North-Eastern province of Kenya almost 100% of the sixth-grade teachers had the highest mathematics competencies, Abstract Problem Solving, and the median years of teaching experience at about 5. Although the mathema tics competency levels are still low among the sixth-grade Kenyan students, the ripple effect of particular interventions from this initiative suggests Kenya is working to improve on students' math skills.\nHowever, in Zimbabwe, the results indicate that there are pockets of teachers with specific skills that could contribute to students' mathematics competencies, but these qualities are not widespread throughout the country."}, {"section_title": "Conclusion", "text": "Although there have been noticeable improvements in students' mathematics competency in Kenya and Zimbabwe in recent years, steps can still be taken to further mathematics education. There should be an analysis of the curriculum offered to future teachers in the teacher preparation programs and the elementary mathematics taught in school in the two countries to improve on elementary teachers' training. Such an analysis could identify the strengths and weaknesses of the programs for improve me nt in educational policy and practice. Zimbabwe, for instance, could adopt curriculum content and practices from Kenya to fill the possible mathematics content knowledge gaps among their teachers.\nThe fact that teachers in Zimbabwe spend more years in their teacher preparation, but have lower mathematics competencies indicates the quality of the program should be more the focus of attention than the time spent.\nThe teacher retention policies in both countries affect teachers differently, considering that the teachers' years of teaching experience is useful for improving students' mathematics competencies in sub-Sahara Africa. Some regions in Kenya (North Eastern, Nyanza, and Western) and Zimbabwe (Mashonaland East, Mashonaland West, Matabeleland North, and Matabeleland South) had teachers with fewer years of teaching experience when compared to other regions. These findings on the high turnover of teachers in specific areas call for a re-evaluation of the teacher retention policies in both countries. Although the teachers in both countries had higher order skills, their students did not attain these skills. It is possible that the mathematics teaching/classroom practices in Kenya and Zimbabwe are different and do not lead to students having higher order skills in mathematics. Specifically, the last available SACMEQ study findings showed that more than 80% of the students in Kenya and Zimbabwe had competent numeracy skills or lower (Hungi &Thuku, 2010; Wasanga et al., 2011) . These findings indicate that there is a need to study the classroom practices across the two countries. Perhaps, the regions most affected by teacher flight would be the best starting point. Further, investigating how classroom practices influence students' mathematics learning would explain the weak correlations between the students' and the teachers' mathematics competencies.\nContinued professional development of teachers in both countries is very low, especially in the Eastern, North Eastern, and Nyanza provinces in Kenya and most regions in Zimbabwe. Therefore, an increase in professional development or introductions to more in-service courses are needed in these countries. Notably, professional development focused on developing students' higher order mathematics skills in elementary schools is key. Also, ongoing professional development sessions embedded in practice as opposed to one shot, as is usually the case, could support teachers ' instructional practices classroom practices. The in-service courses introduced to teachers through CEMASTEA are a step towards improving teachers' instructional practices. However, a study of how these sessions influence teachers in the different regions in the participating countries is an agenda for research. Not only should professional development be provided across the regions in Kenya and Zimbabwe but also spaces should be opened up for practicing teachers to contribute to the policies and practices related to their career needs is key."}]