[{"section_title": "", "text": "There are a number of threats to coastal areas, in particular wetland habitats. The most significant threats include conversion of wetlands to other land uses and climate change, in particular, sea level rise and increases in hurricane intensity and frequency. In some regions, wetlands are being converted to open water due to land subsidence. Numerous recent reports have examined coastal wetland loss and potential strategies to address threats like climate change. The Association of State Wetland Managers (ASWM, 2009) recommended a national wetland and climate change initiative. The report contains measures to reduce impacts and adapt coastal/estuarine wetlands to climate change. The U.S. Army Corps of Engineers (Army Corps) and the National Oceanic and Atmospheric Administration (NOAA) both published frameworks to guide how they will consider impacts of climate change and sea level rise as they implement restoration activities, including those in coastal wetlands (Army Corps, 2009;NOAA, 2010a). NOAA and the U.S. Fish and Wildlife Service (USFWS) analyzed the status and trends of wetland acreage along the Atlantic Coast, Gulf of Mexico, and the Great Lakes to provide an estimate of losses or gains that occurred in those coastal watersheds. Their report, released in 2008, found that 361,000 acres of coastal wetlands were lost in the Eastern United States alone between 1998 and 2004 (Stedman and Dahl, 2008). This amounts to an average net decrease of 59,000 acres each year. The vast majority of the loss (82 percent) occurred in freshwater wetlands, both tidal and nontidal. Nearly 60 percent of the total loss of coastal freshwater wetlands is attributed to \"other development,\" which includes conversion of wetlands to unknown or undetermined land uses ( Figure 1). There were also losses of saltwater tidal wetlands to open water (deeper than 2 meters), particularly in the Mid-Atlantic region. The 2008 NOAA and USFWS Status and Trends report did not examine the loss of wetland condition or function. In response to these reports, EPA established a two-part Coastal Wetlands Initiative. The first part is the Coastal Wetlands Team, which is a joint effort between EPA's Wetlands Division and the Oceans and Coastal Protection Division. The team's goals are: 1) confirming wetland loss and better understanding contributing stressors; 2) identifying and disseminating tools, strategies, policies, and information to protect and restore coastal wetland resources; and 3) raising awareness of the functions and values of coastal wetlands, threats to these resources, and opportunities to protect and restore coastal wetlands. To achieve its goals, the Coastal Wetlands Team met with stakeholders in the Mid-Atlantic, South Atlantic, Gulf of Mexico, and North Atlantic regions (see Figure 2). For each of these Coastal Wetland Reviews (CWRs), the team identified key stressors; examined regulatory and voluntary efforts at the federal, regional, state, and local level to reduce or reverse coastal wetland loss; and assessed whether successful strategies can be replicated elsewhere. The information from the reviews could be used to help inform policy decisions, influence program direction, and develop projects to reduce or reverse Figure 1. Wetland loss and changes in land cover, 1998-2004: Atlantic, Gulf of Mexico, and Great Lakes. Source: Stedman and Dahl, 2008. coastal wetland loss nationally. The results of these CWRs are provided in a report distributed to the respective participants, and will also be posted on EPA's website. This document is the CWR report for the Mid-Atlantic region. The second part of the Coastal Wetlands Initiative is the federal Interagency Coastal Wetlands Workgroup, which is composed of members from EPA, NOAA, USFWS, the U.S. Geological Survey, the U.S. Department of Agriculture's Natural Resources Conservation Service, the Army Corps, and the Federal Highway Administration. The Interagency Coastal Wetlands Workgroup serves in an advisory capacity to EPA's Coastal Wetlands Team by helping to identify CWR watersheds, participating in the CWR on-site discussions, and providing input on the report. Consistent with other federal agencies, EPA is defining \"coastal wetlands\" as saltwater and freshwater wetlands* within HUC-8 watersheds that drain to the Atlantic, Pacific, or Gulf of Mexico. \"Coastal wetland loss\" is defined as \"a decline in the areal extent and/or ecological integrity** of wetlands in coastal watersheds\" (Figure 2). "}, {"section_title": "EPA Coastal Wetland Regional Reviews", "text": "EPA conducted these CWRs to identify and better understand the stressors on coastal wetlands and the strategies needed to protect and restore them. EPA's Coastal Wetlands Team is interested in identifying the cause(s) of losses in the areal extent of wetlands, as well as examining losses in wetland function and/or ecological integrity. Though quantifiable data on functional loss are limited in availability, EPA recognizes that it is an issue in many watersheds and included qualitative information to reflect this concern where appropriate. EPA coordinated with the Interagency Coastal Wetlands Workgroup and stakeholders to gather information on available tools and strategies used to address wetland function and condition within the region(s) of interest. The CWRs and the subsequent regional reports will not be used to evaluate specific wetland assessment tools or methodologies, but rather to describe which tools are being used and discuss participants' views on their experiences and relative success with such tools. The purpose of the CWRs is to facilitate dialogue among stakeholders who share a vested interest in coastal wetland resource protection such that continued local, regional, and national efforts to stem coastal wetland losses can be increasingly effective. They are not considered a commitment of future resources to address issues identified during the review process. Each CWR is intended to provide information on a particular focal watershed or region and should not be considered a final assessment of the study area. Instead, each review should be considered a baseline reconnaissance to aid in moving the entire Coastal Wetlands Initiative forward. This report contains points raised during the course of the discussions with stakeholder groups. EPA affords participants an opportunity to comment on CWR notes and draft reports in order to provide the broadest perspective possible. EPA also endeavors to supplement these perspectives with documentation (e.g., relevant references, citations), but it is not possible to do so for every comment provided. Thus, the information presented in this report cannot be considered the definitive and most comprehensive presentation of issues within the region or within specific focal watersheds. Instead, it can serve as a starting point for identifying priority stressors, tools and strategies to address them, and key information and data gaps that need to be filled in order to reduce wetland loss in the future. The process for the CWRs was intended to be flexible and encouraged participation from a diverse and representative group of stakeholders in each of the focal watersheds. Four steps were followed for each CWR: 1. Identify focal watersheds. USFWS identified candidate watersheds for the CWRs based on observed wetland loss in the USFWS/NOAA Status and Trends report. These are generally areas where the most wetland loss has occurred, due to development, other human actions, or where losses were attributed to inundation or other coastal processes. The Coastal Wetlands Team further refined this larger candidate watershed to focus in on specific eight-digit HUC watersheds (\"HUC 8 watersheds\"). The focal watersheds selected for analysis are based on existing wetland conditions assessments, available data, a variety of efforts to protect and restore coastal wetlands, and the willingness of local stakeholders to participate. The HUC 8 watersheds identified may correspond directly to National Estuary Program (NEP) study areas (the geographic boundary in which the NEPs work to improve estuary health). In other words, the CWRs often occur in the same watersheds as the NEP study areas or a sub-set thereof. NEPs provide an effective mechanism to assist the CWRs in a few important ways. They consist of broad-based stakeholder groups that work in close partnership to protect and restore habitats in their study area. These groups represent a wide range of interests and expertise at local, state, and federal levels (e.g., general public, state natural resource agencies, academics, local governments, watershed groups). EPA uses stakeholder lists from the NEPs along with contacts provided by the Interagency Coastal Wetlands Workgroup to invite participants to attend the CWRs. NEPs and their partners create and implement a management plan that is based on scientific characterization of the study area, and contains actions to address habitat loss and modification. This characterization is a collection of scientific information that includes an assessment of extent and condition of habitats such as wetlands. These data can help provide key information for the CWR assessments and reports."}, {"section_title": "Conduct a review of current, readily available information.", "text": "For the selected review area, the Coastal Wetlands Team gathered more specific existing information on coastal wetland loss, stressors contributing to coastal wetland loss, tools and strategies used to protect and restore coastal wetlands, and key information gaps that, if addressed, could help reverse the trend of wetland loss. Information was gathered from the Internet, reports provided by the \"host\" organization, and CWR invitees or participants in advance of the local stakeholders discussions. In addition, to estimate coastal wetlands loss, the Coastal Wetlands Team consulted with NOAA's Coastal Change Analysis Program (C-CAP), which uses satellite imagery to measure land cover change in coastal areas. The Team also requested permit data from the Army Corps and state agencies, where applicable, in order to quantify authorized losses and associated mitigation gains for wetlands which are under the jurisdiction of Section 404 of the federal Clean Water Act (CWA) or similar state programs. When made available by the relevant agency, these data were provided in the CWR report. Due to database limitations, permit data provided by the Army Corps did not cover the same time frame as C- CAP (1996CAP ( -2006 and therefore it was not possible to compare the magnitude of losses identified by each. See Appendices C and D for more information on the CWA Section 404 program and C-CAP, respectively."}, {"section_title": "Conduct stakeholder discussions.", "text": "EPA sought an entity to serve as the \"host\" of each review and to help identify a broad range of local stakeholders to participate in the discussions. The host organization (such as an NEP) helped to arrange the meeting logistics and used their partnerships to invite all the appropriate participants to that dialogue. Invited participants included a broad cross-section of business, environmental, academic, and government representatives. Invitee lists were collected from the organization hosting the event, as well as suggestions from the Interagency Coastal Workgroup (which includes their regional representatives). The Coastal Wetlands Team convened a stakeholder forum NEPs are already employing a variety of efforts to protect and restore wetlands. NEPs can assist by: 1) convening the appropriate stakeholders to participate in the CWRs, 2) providing scientific data on wetland conditions in their study areas, and 3) providing a strong platform and scientific understanding to support the CWRs. of the invitees in each selected focal watershed. These one-or two-day facilitated dialogues provided additional insights about on-the-ground (existing) condition of coastal wetlands within the focal watershed and growing pressures within the region; i.e., issues often best identified by those with the most vested interest in the outcome of such efforts. Attendees were asked to provide information on threats to coastal wetlands (including reduction in acreage as well as function and conditions) and tools and techniques used locally to reduce or reverse wetland loss. The term \"stressor\" was not defined for participants in advance of the reviews. While stressors are traditionally limited to \"physical, chemical, or biological entities, or processes that adversely affect the ecological condition of a natural ecosystem\" stakeholders in every CWR also identified programmatic issues as stressors related to loss or degradation of coastal wetlands. While state and federal regulatory programs are tools for wetland protection, limits to regulation are captured in the report under the \"Stressors\" sections in accordance with commonly expressed stakeholder input. EPA acted as a neutral facilitator and captured the discussion in meeting notes. While there may be disagreements among parties regarding the validity of the data presented or provided, EPA considered all documented sources of information. EPA also recognized that reference documents will not be available for all points raised by participants in the discussion. To coincide with the stakeholder discussions, EPA scheduled a visit to nearby wetland protection, restoration, or mitigation projects when feasible. This enabled EPA to obtain a firsthand view of local stressors or approaches being employed to address wetland loss in that watershed. Collection and analysis of raw field data is outside the scope of these field visits."}, {"section_title": "Assemble a coastal wetland regional review summary.", "text": "Once the notes from the stakeholder discussions were vetted with the participants, they were combined with the available data collected in Step 2 to form the basis of a regional report. Although these reports are not exhaustive and only reflect readily available, existing documentation and the viewpoints of participating stakeholders, EPA believes they are a good indicator or snapshot of wetland issues in the focal watersheds. The results of the Mid-Atlantic review are summarized below, and are also presented in Tables 2 and 3 and the \"Conclusion\" section of this report. • Major stressors: » Coastal erosion and shoreline hardening. • Major tools and strategies: » The Virginia Institute of Marine Science (VIMS) tidal wetland inventory and assessment protocol, which systematically assesses coastal wetlands and measures incremental wetland losses over time. » Regulatory program coordination and strengthening such as the Mid-Atlantic Wetlands Work Group and the Partnership for the Delaware Estuary. » The VIMS Wetlands Data Viewer tool, used to collect information for regulators about the quality/condition of non-tidal wetlands in which development is proposed. » Stabilizing shorelines by allowing landward migration of coastal wetlands through rolling easements or living shorelines. • Major gaps: » Additional funding for programs including monitoring and assessment. » Improved collaboration between state and federal regulatory agencies and VIMS. » Access to geographic information systems (GIS) tools and higher-resolution Light Detection and Ranging (LiDAR). » Increased public and stakeholder education and outreach."}, {"section_title": "4", "text": "Questions posed during stakeholder discussions: 1."}, {"section_title": "2.", "text": "3."}, {"section_title": "4.", "text": "What are the root causes of coastal wetland loss in your area? Are there differences between fresh and saltwater stressors? Which are the top three stressors? What are the current regulatory and non-regulatory protection and restoration tools being used to adapt to or mitigate wetland loss in your area? What are the successful strategies being employed to protect and restore coastal wetlands in your area? What information gaps would be most helpful to address loss, and how can these gaps be addressed?"}, {"section_title": "Mid-Atlantic Review", "text": "The Mid-Atlantic region hosts a wide variety of coastal wetlands due to variations in climate, hydrology, soils, vegetation, and other factors. The gradual transition from fresh to salt water supports shrub and forested wetlands in the headwater areas, brackish marshes and tidal freshwater wetlands in the salt-freshwater transition zones, and salt marshes, mudflats, and beaches near the shore. In addition, many open water areas such as lakes and ponds are often regulated with wetlands within the focal watershed. Together, this network of coastal wetlands provides important ecosystem services and is vital to the health of commercially important fisheries resources and other sectors of the economy. Tidal wetlands in particular are likely to provide more ecosystem services than any other habitat type in the region (Partnership for the Delaware Estuary, 2008). The first Mid-Atlantic watersheds chosen for the review were in the Delaware Estuary (Figure 3 and Figure 7), in the states of Delaware, New Jersey, and Pennsylvania. The second review targeted the Pamunkey, Mattaponi, and York watersheds located along the York River in Virginia (Figure 3 and Figure 10). Based on previous work by the Interagency Coastal Wetlands Workgroup, the Delaware Estuary watershed was highlighted as an area experiencing significant coastal wetland loss. In contrast, the York River watershed (a tributary of the Chesapeake Bay) was selected because, despite the presence of stressors, wetland losses seemed disproportionately low. EPA chose to further examine this disparity, i.e., why losses were occurring in some areas, but not in others, in the presence of similar stressors. The focal watershed reviews were conducted to help compile and validate baseline information and provide a more in-depth understanding of what is happening on the ground."}, {"section_title": "Mid-Atlantic Coastal Wetland Stressors", "text": "Historically, coastal wetlands in the Mid-Atlantic region have been subject to losses due to the effects of a variety of stressors from activities such as commercial, residential, and industrial development and associated infrastructure and conversion for agricultural uses. Coastal wetlands have also been affected by dredging projects (e.g., deposition of dredge spoils in wetlands)and conversion of tidal wetlands to open water by construction of impoundments and sea level rise (Tiner, 1987). Data from NOAA's C-CAP were used to estimate acreage losses of coastal wetlands for the Mid-Atlantic region from 1996 to 2006 (see Appendix D for more information on the C-CAP methodology). C-CAP examines overall land use change, including wetlands (excluding submerged aquatic vegetation), for the coastal regions of the United States. The data set currently reports changes in wetland acreage only and does not measure change in wetland function. The C-CAP data was used in order to be consistent across all regions when comparing wetland loss. According to C-CAP estimates, approximately 40,000 acres were lost in the Mid-Atlantic region during this 10-year period and half of all the wetland losses were attributed to conversion to agriculture (Figure 4). Almost 80 percent of these changes to agriculture occurred within the Chesapeake Bay watershed. The literature reviewed (see Appendix B), as augmented by discussions with stakeholders, revealed the following wetland stressors: Hydrologic alterations such as dredging, ditching, channelizing streams, mosquito control practices, stormwater runoff, impervious surfaces, and water supply withdrawals. Climate change and sea level rise exacerbate other stressors such as erosion, and can cause changes in salinity, sediment deficits, and conversion of vegetated wetlands to open water due to inundation ( Figure 5 and Figure 6).    Degraded ecosystems due to invasive species, salt marsh dieback, habitat fragmentation, and lack of buffers. Point and nonpoint source pollution and associated impacts such as eutrophication, and emerging contaminants such as pharmaceuticals. Hard structures along shorelines including seawalls, bulkheads, and other armoring exacerbate erosion and prevent wetland migration. These stressors include both near-term and long-term issues, which will require a shift in response strategies. For example, impacts from residential and commercial development are an immediate issue, whereas climate change and sea level rise represent longer-term impacts. In this regard, the strategies employed to address these stressors must consider temporal variability. In fact, threats associated with sea level rise are receiving increased attention in the Mid-Atlantic region as a result of current (near-term) observations and longer-term projections. A recent report (CCSP, 2009) predicts that this region (as well as the Gulf Coast) will be particularly vulnerable to sea level rise over the next century. The Mid-Atlantic coast's vulnerability is attributed to a sandy shoreline, a high rate of erosion, a \"sediment-starved\" coast, localized sinking of the land surface, and the geomorphology of the coastal plain and the continental shelf. Approximately 53 percent of the relative sea level rise within at least the lower Chesapeake Bay is due to subsidence, as described in the \"Chesapeake Bay Land Subsidence and Sea Level Change\" prepared for the Army Corps' Norfolk District by VIMS (VIMS, 2010). Over one million acres of coastal wetlands are at risk of inundation assuming a one meter rise in sea level along the Mid-Atlantic coast (see Table 1). In Virginia, eighty-three percent of the acreage losses of estuarine wetlands in southeast Virginia have already been attributed to submergence, most likely due to rising sea level (Tiner et al., 2005). The Governor's Commission on Climate Change (2008) expects sea level to rise between 2.3 and 5.2 feet over the next 100 years, which could inundate 50 to 80 percent of Virginia's tidal wetlands. Hardening (or armoring) of shorelines is another example of an activity that is prevalent throughout the region, and can lead to a host of short-term and long-term adverse effects. Armoring of the coast has been a major issue in the Mid-Atlantic states due to some of the same factors that render the area vulnerable to sea level rise. In Maryland, 28 percent of the shoreline has been armored (CCRM, 2004); in New Jersey, 43 percent of the developed shoreline has been hardened. In Virginia alone, 220 miles of shoreline were hardened between 1993 and 2004, with an average rate of 18 miles of hard structures permitted by regulatory agencies each year (Duhring, 2005)."}, {"section_title": "Mid-Atlantic Tools and Strategies", "text": "In the Mid-Atlantic, multi-faceted programs use a variety of tools to address stressors through wetland assessment, protection, mitigation, and restoration. They include non-regulatory programs such as land protection incentives, land acquisition or conservation easements, public outreach and education,  training and technical assistance, monitoring, assessment, mapping, and restoration projects. A number of common regulatory tools are also used throughout the Mid-Atlantic region including permitting, compliance monitoring and assistance, site inspections, regulatory guidance, policies, enforcement, and wetlands compensatory mitigation requirements. Wetland regulatory programs in the Mid-Atlantic region involve a combination of tools from both federal and state agencies. The Army Corps' Regulatory Program, administered by staff employed by the New York, Philadelphia, Baltimore, and Norfolk Districts, has a programmatic goal of no net loss of wetlands and generally requires compensatory mitigation for impacts authorized through its permits. Since the no net loss goal was established in 1990 (Executive Order 11990), the program has contributed to wetland protection in partnership with states that have legislation tailored to protect wetlands. \"No net loss of wetlands\" policies covering all jurisdictional wetlands (see Appendix C) have been adopted by EPA and all five of the coastal Mid-Atlantic states. The Army Corps administers day-to-day federal regulation (including individual and general permit decisions), conducts or verifies jurisdictional determinations, develops policy and guidance, and enforces Section 404 provisions. EPA develops and interprets policy, guidance, and environmental criteria used in evaluating permit applications; determines the scope of geographic jurisdiction and applicability of exemptions; approves and oversees state and tribal assumption; reviews and comments on individual permit applications; has authority to prohibit, deny, or restrict the use of any defined area as a disposal site; can elevate specific cases; and enforces Section 404 provisions. EPA also provides funding, guidance, and training for a variety of wetland programs and works closely with the states through its regional offices and the National Estuary Program. Each state in this region has its own wetland laws and regulations that work in concert with Section 404, such as compensatory mitigation policies and/or guidance.  Coastal areas at risk of inundation due to sea level rise. Source: Titus et al., 2009. Of particular note are strategies under development to address threats of coastal erosion, storm surges, and sea level rise. To address erosion and potential storm surges, Mid-Atlantic states have historically relied on shoreline hardening methods to stabilize vulnerable coastlines along both estuarine and oceanfacing shores. Alternative strategies are now being proposed and implemented for both ocean and estuarine shorelines. The banks of estuaries in particular are receiving much attention; in these areas nourishment rarely occurs and hardening is more common due to lower wave energy and other factors. In order for the region to begin addressing projections for sea level rise over the next century, alternatives to hardening, such as conservation or rolling easements and \"living shorelines,\" are gaining more traction (Titus, 1998;CCSP, 2009; EPA Climate Ready Estuaries website, 2010 http://www.epa.gov/climatereadyestuaries/). Allowing wetlands to migrate inland is a method of sea level rise adaptation, which ensures that coastal wetlands are maintained. Inland migration of wetlands can be accomplished through setbacks, density restrictions, and land acquisition. Regulatory rolling easements refer to a broad range of legal mechanisms used to prevent property owners from armoring their shoreline while allowing other uses of the property. Rolling easements work by automatically moving or \"rolling\" the restriction landward with rising sea level. This allows sediment transport to move inland and wetlands to migrate naturally. Rolling easements prevent armoring of the shoreline regardless of how threatened the structure is by rising sea level. If erosion threatens the structure, the owner has two choices: either relocate the building or allow it to succumb to the encroaching sea (Titus, 1998). EPA's Climate Ready Estuaries program has developed a \"Rolling Easements Primer\" which identifies regulatory and non regulatory options for implementing rolling easements (Titus, 2011). To address the impacts of climate change, the Partnership for the Delaware Estuary (PDE), which is participating in the Climate Ready Estuaries program, released a report called \"Climate Change and the Delaware Estuary: Three Case Studies in Vulnerability Assessment and Adaptation Planning.\" These case studies looked at three key resources: tidal wetlands, drinking water, and bivalve shellfish. With technical assistance from experts, the Sea Level Affecting Marsh Model (SLAMM) was applied to project how the spatial extent of different coastal habitats will change as sea level rises. In addition to significant acreage losses, PDE expects to see shifts in community species composition, desiccation of marsh sediments, and change in habitat support. To address these vulnerabilities, the case study identified six management tactics as potential adaptation strategies for crucial infrastructure and tidal wetlands: watershed flow management; strategic retreat; structure setbacks; creation of buffer lands; living shorelines; and building dikes, bulkheads, and tide gates."}, {"section_title": "Mid-Atlantic Gaps and Needs", "text": "In addition to identifying tools and strategies, the Coastal Wetlands Team gathered baseline information related to needs and gaps to improve coastal wetland protection in this region. In general, there appeared to be a need for: • Increasing coordination and collaboration between wetland regulators and stakeholders. • Increasing resources (staffing and funding) to administer monitoring, assessment, and regulatory programs. • Developing comprehensive and integrated databases using common temporal and geographic scales and standardized categorization methodologies. • Increasing understanding of wetland condition, function, values, and emerging issues such as sediment budgets, sediment management strategies and climate change impacts. Tables 2 and 3 summarize key stressors, tools and strategies to address them, and gaps and needs for both focal watersheds in the Mid-Atlantic region.   "}, {"section_title": "Focal Watershed Review: Delaware Estuary Watershed Introduction", "text": "The Delaware Estuary watershed (HUCs 02040201, 02040202, 02040203, 02040205, 02040206, 02040207) covers 13,611 square miles and includes portions of New York, New Jersey, Delaware, and Pennsylvania, and a very small portion of Maryland. The tidal river, one of the largest freshwater tidal estuaries in the world, runs through the fourth-largest U.S. urban center. It supports the world's largest freshwater port system, including the Port of Philadelphia, which generates more than $19 billion annually. The upper watershed is considered a relatively pristine recreational resource providing a portion of New York City's drinking water supply. The lower estuary is noted for its biological richness, with waterfowl (boasting the secondhighest concentration of shorebirds in North America), fin and shellfish (oyster landings exceed $1.5 million), and the largest breeding population of horseshoe crabs on the planet. This resource gained distinction as home to one of the 28 National Estuary Programs-the only tri-state National Estuary Program (PDE, 2006). Periodic evaluations of coastal wetlands (tidal and non-tidal) of the Delaware Estuary watershed are conducted by PDE. The State of the Delaware Estuary report (PDE, 2008) is a comprehensive assessment effort that tracks more than 20 indicators of overall estuarine and watershed health. The report measures progress as well as challenges associated with implementing the Delaware Estuary Comprehensive Conservation and Management Plan. For example, with respect to tidal marshes, the report concluded the following: Much of our remaining wetlands appear to be considerably degraded and vulnerable to storms, erosion, and sea level rise. These marshes would normally move landward as sea levels rise. However, the \"buffer\" lands adjacent to them have long been developed in the Upper Estuary, and buffer loss in the Middle and Lower Estuary has escalated during the past decade. . . .   The study is part of a statewide effort by DNREC to assess the condition of wetlands on the watershed scale. The St. Jones study, summarized by Rogerson et al. (2010), examined both tidal and non-tidal wetland condition, changes in overall wetland acreage, and stressors responsible for wetland degradation. The study first looked at the change in wetland area in the watershed by comparing the 1992 Delaware state wetland inventory to historic wetland acreage based on hydric soils. Next, to assess the condition of wetlands and identify the prominent stressors, a rapid assessment method was applied to 32 headwater wetland sites, 29 riverine wetland sites, five depressional wetland sites, and 50 tidal wetland sites, randomly located on both private and public land. Indicators of condition and stressors related to plant community, hydrology, and wetland buffers were evaluated for each site. A probabilistic sampling design allowed for extrapolation of sample results to overall wetland condition in the watershed. Since European colonization, the St. Jones watershed has lost approximately 47 percent of its wetland resources. Of the wetlands remaining, 50 percent of the wetland area is considered minimally stressed while 16 percent is severely stressed. The condition of wetlands varied by wetland type: headwater wetlands scored a \"B-,\" riverine wetlands scored a \"C-,\" and tidal wetlands scored a \"C.\" Compared to the nearby Murderkill and Inland Bays watersheds, the condition of wetlands in the St. Jones River watershed was similar to the Murderkill watershed in the Delaware Estuary basin but has more minimally stressed wetlands and fewer severely stressed wetlands than the Inland Bays watershed. This information will be used to guide Delaware's protection and restoration efforts. Protection resources will be focused on the types of wetlands with the highest risk for loss and degradation, and restoration efforts will be targeted on wetlands with the highest restorative value. The results of this study can also be used as baseline information to monitor future changes in the watershed. In collaboration with the Delaware National Estuarine Reserve, DNREC will use the information from this report to educate citizens and decision-makers on the health and importance of wetlands and actions that they can take to improve the condition of wetlands in the watershed. The study recommendations included: • Thoroughly tracking permitted impacts. • Restoring and re-establishing degraded and fragmented flat wetlands to improve wetland services such as water quality, wildlife habitat, and native biodiversity. • Improving tidal and non-tidal wetland buffer regulations. • Collaborating with partners to enhance education and outreach efforts and share coastal wetland information with professionals and decision-makers. • Identifying restoration and protection priority areas. • Ensuring that wetland functions are replaced before they may be destroyed or degraded by adopting assessment methods and monitoring results into the Army Corps' review process and by strictly enforcing current guidelines. • Controlling invasive plants to improve wetland condition, promote native communities, and improve biodiversity. Data from NOAA's C-CAP were used to estimate acreage losses of coastal wetlands for the Delaware Estuary (see Appendix D for more information on C-CAP methodology). According to C-CAP estimates, the Delaware Estuary watershed lost approximately 7,500 acres of coastal wetlands between 1996 and 2006. This represented a loss of 1.5 percent of all coastal wetlands present in 1996. Losses were fairly evenly split between freshwater (approximately 52 percent) and saltwater (approximately 44 percent) wetlands, with some unconsolidated shore losses (approximately 4 percent). Wetland areas were lost to open water (approximately 47 percent), agriculture (approximately 28 percent), and development (approximately 19 percent), with approximately 6 percent lost to bare land ( Figure 9). More than 75 percent of all the saltwater marsh losses were to open water. The C-CAP data are intended to provide a general indication of trends observed on a national level, and may be one of several important screening tools used in the identification of threatened areas, key stressors, and the identification and prioritization of conservation/restoration strategies. This \"big picture\" view is best supplemented by more detailed, field-based, state-level analysis. For example, C-CAP (consistent with many wetland mapping methodologies) only measures coastal wetland losses according to loss of wetland acreage. Some states are taking a more comprehensive approach and are beginning to measure both wetland acreage and condition. A notable example occurs within the state of Delaware and is described in the report \"Condition of Wetlands in the St. Jones River Watershed\" (Rogerson et al., 2010). This report determined the condition of both tidal and non-tidal wetlands and identified the presence of wetland stressors that are degrading wetlands. Wetland condition was measured using 15 metrics representing habitat characteristics (e.g., plant composition, invasives); hydrology (e.g., ditching, draining, fill, stormwater inputs); and condition of the wetland buffer (e.g., extent and intensity of surrounding development, barriers to landward migration). The information will be used to inform and improve future protection and restoration activities for Delaware's wetland resources."}, {"section_title": "Stressors", "text": "The following major coastal wetland stressors emerged from the Delaware Estuary watershed review:  715, 810 [2006]; see Appendix C). This lack of clear guidance was cited as contributing to losses to coastal wetland resources within this focal watershed. For example, Delaware state officials noted increasing losses in the last decade, particularly because the state has very little authority to protect nontidal wetlands. Although state efforts may be showing more acres of mitigation than losses, there is uncertainty about long-term sustainability and the condition and functioning of the mitigation sites. According to review participants, early mitigation failures have led to more focus on ensuring replication of hydrology, but the ability to replicate hydrology is still in the trial phase. It was also noted that there are regulatory barriers (e.g., terminology used in regulations) to the adoption of alternative shoreline stabilization methods such as those contained in \"Living Shorelines\" guidance (VIMS, 2009).\nDiscussion at the review focused on key issues contributing to coastal wetland loss. Overall, it was observed that inconsistent regulation and regulatory exemptions may be the most common drivers of coastal wetland loss within the York River watershed, particularly with respect to agriculture and forestry practices within non-tidal wetlands. In addition, rapid urban development has been cited as being a key contributing factor. Stakeholders indicated these are the three most important stressors: • Inconsistency in state regulations Several possible reasons for or examples of inconsistent regulation were noted: » Participants felt that the existence of two separate wetland protection programs may hinder wetland protection due to inconsistent policies and jurisdictional determinations. Primary authority for issuing state non-tidal wetland permits rests with the Virginia Department of Environmental Quality (VA DEQ). Tidal wetland permits are the purview of the Virginia Marine Resources Commission (VMRC) under the Tidal Wetlands Act. Local wetland boards have the option of regulating their own tidal wetlands with  "}, {"section_title": "Cumulative impacts through incremental filling.", "text": "Cumulative impacts are caused by a combination of small incremental stressors such as wetlands alterations below regulatory thresholds, cutting of vegetation, road crossings, and increased imperviousness. This was a recurring theme throughout the Delaware Estuary watershed.  It should be noted that the information below is based on the opinions and observations of participants, who provided feedback on draft versions of this document and supplemented statements with documentation, where available. A major concern is that small individual acreage losses are adding up to large impacts. For example, in Delaware the greatest wetland loss is occurring to non-tidal wetlands. These losses are often small losses (both permitted and unpermitted) that are being made on a site-by-site basis and not being put into a larger watershed or landscape context to understand the cumulative effects on ecosystem health and the reduction in the services the wetlands provide. Other states noted that incremental losses are occurring as older bulkheads are replaced with newer structures, and as landscaping (including lawns) encroaches into wetland and wetland buffer areas. • Hydrologic alterations. Various natural and artificial factors have converged to modify the hydrology of the Delaware Estuary and its related hydrodynamics and sediment deposition patterns. For example, while dredging has historically resulted in direct wetland acreage loss via deposition (fill) of dredge materials into nearby marshes, the recurrence of channel deepening events (from an average pre-project depth of 18 feet to a deepening of 40 feet) has led to numerous secondary effects on important hydrologic parameters, including increased tidal range, increased shoreline erosion, and upstream intrusion of saline waters. These effects are exacerbated by sea level rise (Sutton et al., 1996). In addition, stormwater runoff and impervious surfaces alter the hydrology of both non-tidal and tidal wetlands by reducing natural recharge and increasing peak flooding.  (Strait and Balletto, 2005). • Salt marsh hay impoundments. The historic practice of diking and impounding salt marshes for hay production has isolated wetlands from the estuary. Participants indicated that this has reduced wetland productivity and other ecosystem functions, though we uncertain about the full range of impacts this isolation may have on sediment dynamics and species composition."}, {"section_title": "• • •", "text": "Climate change and sea level rise. Climate change will lead to increasing frequency and intensity of storms, which affect coastal erosion, saltwater intrusion, and conversion of vegetated wetlands to open water (Kreeger et al., 2010a). Secondary impacts include marsh dieback/browning and changes in species composition due to changes in geomorphology, salinity, and temperature. These vegetation changes lead to a loss in wetland function. Pollution. Point and nonpoint sources of pollution from development and agriculture include stormwater runoff, wastewater discharges, and industrial discharges. Of particular concern are nutrients (e.g., nitrogen, phosphorous), bacteria, sediment, metals, organic compounds (e.g., pesticides), as well as emerging contaminants such as pharmaceuticals and endocrine disruptors (PDE, 2008). Invasive species. Disturbance (e.g., hydrologic alteration, land clearing) enables opportunistic species to invade and out-compete valuable endemic species. In particular, Phragmites (common reed) invasion is a significant stressor in this watershed, which participants believe is likely to spread as wetland disturbances increase. • Focal Watershed Review: Delaware Estuary Watershed (continued)"}, {"section_title": "Tools and Strategies", "text": "There are currently a number of effective tools and strategies in use or under development in the Delaware Estuary watershed to address the above stressors. The focal watershed review highlighted the following: • Mapping. Accurate, current data and high-resolution wetland maps are essential tools to monitor and track changes in wetlands due to the above stressors. The state of Delaware, in partnership with USFWS and Virginia Tech, created wetland maps from aerial imagery in order to complete an analysis of wetland changes between 1992 and 2007 (Tiner et al., 2011). The state of New Jersey also has high resolution wetland GIS data by county. • Regulatory authority. Participants highlighted the importance of exploring the uses of existing state and federal regulations. For example, the implementation of TMDLs and the use of grants provided under CWA Section 319 can be used to improve wetland water quality. • Collaboration. State and local agencies should collaborate in order to protect shared resources and reduce the adverse effects of the identified stressors through consistent regulation and outreach efforts. Inter-state collaboration can also be an effective tool, as shown by the efforts of the Partnership for the Delaware Estuary (PDE). • Land acquisition. Acquisition of land and/or securing protective easements are critical for protecting wetlands and the buffer areas around them, allowing landward migration of coastal wetlands due to sea level rise. Examples discussed in the review included USFWS land acquisition projects and wildlife management areas, which have protected large amounts of bay shore areas in New Jersey, and the U.S. Department of Agriculture's use of Conservation Reserve Enhancement Program (CREP) funds to purchase tidal wetland buffers. The state of Delaware and Gloucester County, New Jersey, both have active programs to purchase agricultural preservation easements on low-lying farmland (Craghan et al., 2010;Hudgens et al., 2010;Titus et al., 2009). • Public access. Along parts of the Delaware Estuary, New Jersey public access regulations require that access to and along the shore be enhanced and preserved whenever permits are issued for more than two homes or a commercial land use (CCSP, 2009). Public access is also a key component of redevelopment along the Pennsylvania shore. Although public access does not directly increase habitat, it does facilitate people's enjoyment of the coastal environment, thereby enhancing public education and support for environmental quality. • Monitoring and assessment. The PDE is leading a collaborative effort to establish the Mid-Atlantic Coastal Wetlands Assessment (MACWA). This large-scale, tri-state assessment will establish baseline conditions and new research methods to assist in decision making, priority setting, and future survey design in the region (Kreeger et al., 2010b).\nThe discussion of tools and strategies revealed a rich array of coastal wetland protection and restoration programs, technological applications, and outreach initiatives, many of which are directly linked to addressing major stressors in the watershed. • Wetland monitoring and assessment strategy. In 2000, the Virginia legislature amended the State Water Control Law by authorizing VA DEQ to implement a state non-tidal wetland program in support of a \"no net loss of wetlands\" policy. The program augments the state's 401 certification of 404 permits and includes protection of isolated wetlands (except those smaller than 1/10 acre). The range of responsibilities assigned to VA DEQ included a comprehensive monitoring and assessment strategy, which was adopted in 2005. VIMS, VA DEQ, and others are working in concert to implement the strategy by developing protocols and guidance and applying them in the field in order to answer the following questions (VA DEQ, 2005): "}, {"section_title": "What's Needed? What's Missing?", "text": "Despite the above array of tools and strategies to reduce stressors to coastal wetlands, there are still gaps that need to be addressed to enable more effective application of these tools and strategies in order to better protect and restore coastal wetlands: • Sustained funds to understand wetland loss, including condition, function, and stressors, and also to implement outreach and incentive programs. Directed wetland development grants to focus on building state capacity and coordinating across geopolitical boundaries through NEPs. • Better understanding of sediment budgets, hydrologic alterations, and their effects upon natural processes such as erosion and accretion. • An integrated mapping, monitoring, and data collection system to inform decision-making, set priorities, and track progress for applications such as the State of the Delaware Estuary report. • Improved National Wetland Inventory (NWI) mapping for quality baseline data at a higher resolution. LiDAR technology is especially needed for coastal mapping because of the dynamic conditions associated with coastal processes. • New tools to address emerging threats such as sea level rise and potential sediment deficits. Several states outside the Mid-Atlantic have rolling easement regulations to ensure that beaches migrate inland as sea level rises (CCSP, 2009). • Increased state regulatory authority over non-tidal wetlands. • Increased interagency collaboration and integration of tools/authorities/enforcement, especially bringing agencies together to prioritize wetland management. • Good information to educate the public and increase awareness.  (Figure 10; HUCs 02080105, 02080106, 02080107). Land use/land cover is predominantly rural, with approximately 73 percent forested, 19 percent in agricultural use, and 8 percent designated as urban (VA DCR, 2008). Based upon C-CAP results, the York River watershed lost approximately 900 acres of wetlands between 1996 and 2006 (see Appendix D for more information on C-CAP methodology). This constituted a loss of 0.5 percent of all of the wetlands present in 1996. The losses were associated primarily with freshwater wetlands (approximately 95 percent), with the majority being forested wetlands. Approximately 3 percent, or 30 acres, of salt marsh wetlands were lost during the same time period. The losses experienced were primarily due to conversion of land for agricultural uses, including both cultivated crops and pasture areas (approximately 60 percent), but there was also significant loss to open water (approximately 24 percent), development (approximately 12 percent), and some loss to bare land (approximately 4 percent) ( Figure 11)."}, {"section_title": "Developed 12%", "text": "."}, {"section_title": "Agriculture 60%", "text": "Open Water 24%"}, {"section_title": "Bare Land 4%", "text": "VMRC oversight (most wetland boards adopt the \"model wetland zoning ordinance\" set forth in Virginia Code Section 28.2-1302). » Participants believed project proponents may be using the fact that they have obtained local building permits as entitlement to bypass \"avoidance and minimization\" requirements of state and federal wetland regulations. » The Chesapeake Bay Preservation Act designates tidal wetlands and an adjoining 100 foot buffer as components of Resource Protection Areas (RPAs). Participants indicated that not all counties require wetland delineation before approving development plans near RPAs, and therefore may not be consistently limiting development within RPAs. Requiring delineations would also provide greater consistency with state/federal regulations. » Participants did not believe there was political will for local wetland boards administering the Tidal Wetlands Act to require less damaging alternatives to shoreline hardening projects. » Virginia's wetland programs do not consistently require avoidance of wetland impacts, and instead settle for modest minimization and compensation schemes (Wetlands Watch, 2006)."}, {"section_title": "• Regulatory exemptions. Examples include:", "text": "» Similar to CWA Section 404, Virginia wetland laws exempt certain activities from permit requirements, such as those related to existing agriculture and silviculture; construction and maintenance of farm or stock ponds; or farm roads, forest roads, and temporary roads for mining activities (subject to BMPs). Participants believed these exempt activities were a significant cause of wetland loss. For example, there is a belief among some participants that large wetland areas are being timbered and later converted to other uses, such as residential subdivisions. Speculative landowners may be taking advantage of a silviculture exemption to install permanent roads and bridges for access, remove trees, and then convert the land for development. » Virginia also exempts from regulation \"isolated wetlands of minimal ecological value,\" which are defined as non-forested wetlands less than one-tenth of an acre located outside the 100 year floodplain and not containing endangered species habitat or other sensitive aquatic communities including vernal pools. In total, it is estimated that there are more than 180,000 acres of isolated wetlands statewide (Hershner et al., 2000). Participants believe exempted and unmitigated impacts have resulted in significant losses on a cumulative basis of isolated wetlands of \"minimal ecological value.\" • Commercial and residential development. Conversion of open space and agricultural lands to commercial and residential development is viewed as a major stressor in the York watershed. In addition to direct impacts associated with construction, this development requires supporting infrastructure along with its associated impacts (e.g., stormwater runoff from roads and impervious surfaces). Stormwater runoff was identified as a major stressor associated, generally, with growth and development. As well as the \"top three\" listed above, other major stressors include: • Shoreline erosion and shoreline hardening. Shoreline hardening is a major stressor in this watershed due to its adverse effects upon natural coastal processes, including sediment transport, water quality improvement, flood events, and wildlife habitat. As stated above, the Tidal Wetlands Act may not be working as well as it should because of pressures on local wetland boards. Armoring is a common response of coastal landowners to stabilize their waterfront properties in response to observed or anticipated erosion ( Figure 12). This aggressive response may be exacerbated by the prospect of sea level rise (Titus et al., 2009). Approximately 11 percent of the York River's shoreline has been armored and 7.5 percent of the York-Pamunkey-Mattaponi's collective shoreline has been armored. It should be noted that the information below is based on the opinions and observations of participants, who provided feedback on draft versions of this document and supplemented statements with documentation, where available. » Studies by VIMS have shown significant ecological impacts of shoreline hardening. In one study, the placement of erosion control structures on the shoreline was associated with reduced fish community integrity. Fish community integrity was lowest along bulkheaded shorelines. In another study, the benthic index of biological integrity was found to be significantly reduced in circumstances where more than 10 percent of the shoreline was developed. Reduction in benthic invertebrates is directly related to the health of the fisheries community (Bilkovic et al., 2006;Bilkovic and Roggero, 2008). • Cumulative impacts. The Wetlands Program at VIMS maintains a database of state permitted tidal wetland losses in order to assess the cumulative impacts of these permits. According to this data, while 132 acres of tidal wetland fill were permitted by state permits between 1993 and 2004, only 20.3 acres of compensatory wetland mitigation was required (Duhring, 2005). Eighty acres of this loss was the result of permits for erosion control structures. Additional, untracked losses occur due to exemption of impacts less than 1,000 square feet in isolated wetlands of minimal ecological value (Wetlands Watch, 2006). In addition, participants cited general permits issued for non-tidal wetlands impacting less than a half acre as another possible source of cumulative wetland loss. Concerns were expressed that these areas were not consistently reviewed for impacts and mitigation. It should be noted, however, that the general permits in Virginia are designed to provide a streamlined process without reducing the level of protection. • Climate change and subsidence impacts. Climate change impacts have been noted as a stressor, particularly in low-lying areas and may not be receiving adequate attention or public visibility. Effects of climate change may include sea level rise, more severe coastal storms, salt water intrusion, and climate change's contribution and relationship to other stressors such as drought and increased demand for ground water withdrawals. These processes are expected to continue. It was noted that tectonic rebound of the earth's crust upon melting of glaciers and subsidence from the Chesapeake Bay Impact Crater (VIMS, 2010) may be accounting for about a third of the sea level rise. Landward migration of coastal wetlands can reduce the magnitude of these impacts upon coastal populations and natural areas."}, {"section_title": "Tool Highlight: living Shorelines", "text": "Among the many tools and strategies available in this watershed, \"Living Shorelines\" holds great promise in addressing shoreline hardening, and has the potential for transferability to other states and regions. Living Shorelines is a scientific methodology that allows users to choose the most appropriate means of shoreline stabilization (Figure 13), and is intended to help implement shoreline management plans. The Living Shorelines model and guidance developed by VIMS (see http://ccrm.vims.edu/livingshorelines) are used to determine the suitability of shoreline areas for various stabilization approaches, which range from no action to armoring, depending on a combination of risk factors. The model contains parameters such as fetch, water depth, vegetation, height of bank, and existing erosion condition, and produces the most effective shoreline stabilization method given a site's characteristics. The Maryland Department of Natural Resources has been the primary user of this tool, having completed shoreline management plans for its entire Chesapeake Bay shoreline, but the tool is receiving the attention of coastal managers throughout the region. Maryland's regulations require the use of the Living Shorelines model when permitting shoreline work. Local governments in Matthews County, Virginia, have piloted the tool, and local wetland boards are using the guidance. The state of Virginia is now considering ways to institutionalize this tool, such as training contractors and others who are in decision-making roles, providing incentives such as expedited/ streamlined permit processes for projects following Living Shorelines guidance, and coordinating among all regulatory programs to promote the guidance early on in the planning process (VIMS, 2009)."}, {"section_title": "Tool Highlight: Non-Tidal Wetlands Condition Assessment-Wetlands Data Viewer", "text": "This online tool was developed to help VA DEQ meet its year 2000 amendments to inland wetland laws. The data viewer helps determine the quality/condition of non-tidal wetlands. Wetlands are categorized as high, medium, and low value for habitat and for water quality. The Virginia DEQ uses the data viewer to assist in permit review, develop mitigation ratios, and guide responsible siting of development. No performance standards currently exist for conditioning (or denying) permits based on the value of the wetlands as indicated in the data viewer. The data viewer is available for use now in non-tidal wetlands (see http://ccrm.vims.edu/wetlands/nontidal_gis_ products/index.html). The tidal application is currently under development, with the York River watershed being the focus of initial assessment and mapping efforts."}, {"section_title": "Tool Highlight: Tidal Wetlands Inventory and Assessment Protocol", "text": "The \"Development of a Tidal Wetlands Inventory and Assessment for the York River, Virginia Watershed\" dataset (O'Brien et al., 2006) provides the basis for a Level I, II, and III wetland  Despite the above array of tools, stakeholders identified several gaps. • Improved coordination between state and federal regulatory agencies will be necessary in order to ensure reductions in coastal wetland loss and protection of remaining coastal wetlands. A state-federal interagency group existed in the 1980s but was dissolved because of lack of funding. Such an entity is needed to ensure a coordinated state-federal wetland protection program, and is a logical next step given the resources dedicated towards wetland inventory, assessments, and mapping within the state. • Improved collaboration between state agencies and VIMS, including more widely accepted use of their inventory, assessments, and mapping tools, is expected to benefit both permitting and enforcement programs through a more comprehensive and consistent approach. • A centralized state database and qualified support staff are needed to track wetland permitting, loss, and restoration to better identify where losses are occurring from the direct, indirect, and cumulative impacts of the stressors identified in this report. • Shoreline management plans are needed in Virginia to address coastal erosion and to respond to sea level rise. The state of Maryland has developed management plans for its shorelines and is developing statewide regulatory maps that will designate where property owners can use hard shore protection structures and those areas where only nonstructural and living shoreline approaches will be allowed. By contrast, Virginia has developed plans for some select locations. • Coastal development needs to be designed to enable wetland migration and reduce the demand for shoreline hardening. Under its Critical Areas Act, the state of Maryland limits development to one home per 20 acres in most rural areas that were not developed prior to the mid-1980s. Two counties in the state of Delaware prohibit development in coastal floodplains (Hudgens et al., 2010). Virginia, by contrast, has no statewide restrictions for development along Chesapeake Bay. • Stronger enforcement presence by state and federal agencies in tidal wetlands is needed to increase the effectiveness of regulatory programs. Participants at the York River watershed review suggested that a reduction in federal agency field presence is creating a \"domino effect:\" when there is a strong, effective federal agency presence in the field, there is a disincentive to violate the wetland regulatory requirements-but with a reduced field presence, this disincentive is not there. • Access to GIS tools is needed by state and local officials for displaying wetland losses, inventory, stressors, and condition, and to provide greater opportunity for retention and dissemination of institutional knowledge. In addition, better-quality, high-resolution LiDAR data are needed to assist with accurately determining elevations and topography, particularly for low-lying areas. These are essential tools that should be shared between state and federal regulatory permitting and enforcement agencies in order to better assess and protect coastal wetlands."}, {"section_title": "Conclusion", "text": "The Mid-Atlantic coastal wetland review is the first in a series that the EPA Coastal Wetlands Team conducted. The team has been able to gain a greater understanding of coastal wetland loss in the region, including important insights into the causes of these losses. Several common themes have emerged from the focal watershed reviews: • Development pressures continue to result in incremental direct and indirect impacts on coastal wetlands, and may lead to cumulatively significant adverse effects. • Consistent coordination between state agencies, federal regulatory agencies, and non-regulatory programs is necessary in order to ensure persistent reductions in coastal wetland loss and to secure additional protections for remaining coastal wetlands. Further, stronger enforcement presence by state and federal regulatory and resource agencies is needed in order to increase the effectiveness of wetland protections. • Coastal erosion, exacerbated by sea level rise, is a stressor that is likely to increase in the future and for which the region needs to develop new strategies such as allowing landward migration of coastal wetlands. A number of tools and strategies were suggested that could effectively address the major stressors discussed on the previous pages, and could be transferred to other watersheds and regions: • Incremental wetland losses: The VIMS tidal wetland inventory and assessment protocol is tool that could be used to systematically assess coastal wetlands and measure incremental losses over time. • Regulatory program coordination and strengthening: Collaborative strategies such as the Mid-Atlantic Wetlands Work Group and the Partnership for the Delaware Estuary are excellent examples of ways to enhance the effectiveness of regulatory programs. In addition, the Wetlands Data Viewer tool, developed by VIMS, promises to provide regulators with critical information about wetlands in which development is proposed, allowing more protection to be applied for wetlands exhibiting high values. • Strategies to address shoreline erosion: The region has two potentially transferable strategies; one is more conceptual in nature and the other is already being applied in the Mid-Atlantic region. The first is allowing landward migration of coastal wetlands in anticipation of sea level rise impacts, for example by implementing rolling easements. This strategy was highlighted in the Delaware watershed review. The second strategy is \"Living Shorelines,\" which is the preferred method for shoreline stabilization and is implemented throughout Maryland's coastline and in other parts of this region (Figure 14). This tool, along with the permitting incentives being contemplated to implement it (e.g., streamlining permit review), has high potential for transferability to other coastal watersheds. Key gaps were identified that need to be filled to reduce the stressors and more effectively use these tools and strategies. The most commonly cited among them included funding, monitoring and assessment data (both obtaining and managing the data), higher-resolution imagery and elevation data, increased interagency collaboration, improved state programs, and increased public/stakeholder outreach."}, {"section_title": "Acknowledgments", "text": "Many people contributed to this effort. We would like to thank all of the participants who took time out of their busy schedules to provide us with this valuable feedback. In particular, we wish to thank Dr. Danielle Kreeger, science director for the Partnership for the Delaware Estuary, for hosting the Delaware watershed sessions and providing valuable information and assistance, and Pamela Mason of the Virginia Institute of Marine Science, Center for Coastal Resources Management, for helping coordinate and provide information for the York River watershed session. Without their support and contributions, these reviews would not have been possible. For more information on the Coastal Wetlands Initiative, contact: Jennifer Linn Linn.Jennifer@epa.gov"}, {"section_title": "Nancy Laurson", "text": "Laurson.Nancy@epa.gov"}, {"section_title": "DISCLAIMER:", "text": "The work reported in this document was funded by the U.S. Environmental Protection Agency (EPA) under Work Assignment B-04 of Contract No. EP-C-09-020 to Eastern Research Group, Inc. EPA, through its Office of Coastal Protection Division, managed and collaborated in the assessment described herein. This document is not based on new research or field work conducted by the Agency or its contractor. It contains readily available existing information and that provided by stakeholders. This document will be subjected to the Agency's review. Neither the U.S. government nor any of its employees, contractors, subcontractors, or their employees make any warrant, expressed or implied, or assume responsibility for any third party's use of, or the results of, such use of any information, product, or process discussed in this report, or represents that its use by such party would not infringe on privately owned rights. Any opinions expressed in this report are those of the author(s) and do not necessarily reflect the views of the Agency; therefore, no official endorsement should be inferred. Any mention of trade names or commercial products does not constitute endorsement or recommendation for use. (1) a practicable alternative exists that is less damaging to the aquatic environment so long as that alternative does not have other significant adverse environmental consequences or (2) the nation's waters would be significantly degraded. Section 404 permitting ensures that dredge and fill projects only proceed if an applicant first has shown that steps have been taken to avoid impacts to wetlands, streams, and other aquatic resources; that potential impacts have been minimized; and -only after the first two measures have been taken -that compensation is provided for all remaining unavoidable impacts. Permits: Proposed activities are regulated through a permit review process. An individual permit is required for projects with more than minimal adverse effects. Individual permits are reviewed by the Army Corps, which evaluates applications under a public interest review, as well as the environmental criteria set forth in the Section 404(b)(1) Guidelines promulgated by EPA in conjunction with the Army Corps. However, for most discharges that will have only minimal adverse effects, a general permit may be suitable. General permits are issued on a nationwide, regional, or state basis for particular categories of activities. The general permit process eliminates individual review and allows certain activities to proceed with little or no delay, provided that the general, regional, and any special conditions for the general permit are met. For example, minor road activities, utility line backfill, and bedding are activities that can be considered for a general permit. For more information, see: http://water.epa.gov/lawsregs/guidance/cwa/dredgdis/ and http://www.usace.army.mil/ Missions/CivilWorks/RegulatoryProgramandPermits.aspx. Lastly, the regulatory definition of wetlands, \"areas that are inundated or saturated by surface or ground water at a frequency and duration sufficient to support, and that under normal circumstances do support, a prevalence of vegetation typically adapted for life in saturated soil conditions,\" may exclude some areas which are defined as wetlands for other purposes (e.g., under the Cowardin classification system). Exemptions: In general, Section 404 of the Clean Water Act requires permits for the discharge of dredged or fill material into waters of the United States, including wetlands. However, certain activities are exempt from permit requirements under Section 404(f ). These include dredge and fill activities related to established (ongoing) farming, silviculture, or ranching practices; certain temporary activities; and certain maintenance activities (e.g., of drainage ditches, farm ponds, or stock ponds). The exemptions are limited in their application. For example, a permit must be obtained for an activity whose purpose is to convert an area of the waters of the United States into a use to which it was not previously subject, where the flow or circulation of waters of the United States may be impaired, or the reach of such waters reduced (33 CFR 323.4). Some projects are also required to implement Best Management Practices in order to remain exempt. See http://water.epa.gov/type/wetlands/outreach/fact20.cfm for more information regarding Section 404 exemptions. Mitigation: Compensatory mitigation involves actions taken to offset unavoidable adverse impacts to wetlands, streams, and other aquatic resources authorized by Section 404 permits and other Department of the Army permits. Compensatory mitigation can be carried out through four methods: the restoration of a previously existing or degraded wetland or other aquatic site, the enhancement of an existing aquatic site's functions, the establishment (i.e., creation) of a new aquatic site, or the preservation of an existing aquatic site. For impacts authorized under Section 404, compensatory mitigation is not considered until after all appropriate and practicable steps have been taken to first avoid and then minimize State programmatic general permits (SPGPs) may be issued by the Army Corps in coordination with states or tribes to allow a state or tribe to review Section 404 permit applications and verify activities without additional Army Corps review, provided the activities have no more than minimal adverse effects individually and cumulatively. SPGPs are often limited to specific activities, geographic areas, resource types, and/or sizes of impacts and can provide a more streamlined permitting process for these activities. In addition, the Clean Water Act gives states and tribes the option of assuming administration of the federal Section 404 permit program in certain waters within state or tribal jurisdiction. State/tribal assumed programs must be at least as comprehensive as the federal program. Furthermore, more than a dozen states have developed their own permit programs, which they operate in coordination with the federal program. In some cases, state programs may protect a greater number of aquatic resources than fall under federal jurisdiction as waters of the United States. States may also have their own wetland mitigation, enforcement, and monitoring programs. The Coastal Change Analysis Program (C-CAP) produces a nationally standardized database of land cover and land change information for the coastal regions of the United States. C-CAP products provide inventories of coastal intertidal areas, wetlands, and adjacent uplands, with the goal of monitoring these habitats by updating the land cover maps every five years. C-CAP products are developed using multiple dates of Landsat (30-meter resolution) imagery and consist of raster based land cover maps for each date of analysis, as well as a file that highlights what changes have occurred between these dates and where the changes were located. C-CAP land cover is produced through documented, repeatable procedures using standard data sources, and includes extensive field sampling, validation, and standard quality control review procedures. It provides the \"coastal expression\" of the National Land Cover Database, a contribution to the Earth Cover layer of the National Spatial Data Infrastructure. C-CAP data sets are not jurisdictional or intended for use in litigation. While efforts have been made to ensure that these data are accurate and reliable within the limits of current technology, NOAA cannot assume liability for any damages or misrepresentations caused by inaccuracies in the data, or as a result of the data to be used on a particular system. NOAA makes no warranty, expressed or implied, nor does the fact of distribution constitute such a warranty. The intended use is in identifying regional landscape patterns and major functional niches (habitat), and for environmental impact assessment, urban planning, and zoning applications. C-CAP data will not identify individual species. This is a national and regional data set that should be used only as a screening tool for very local or site specific management decisions. Small features and changes should be verified with a higher resolution data source."}, {"section_title": "C-CAP Wetland Classifications", "text": "Wetlands are areas dominated by saturated soils and often standing water. Their vegetation is adapted to withstand long-term immersion and saturated, oxygen-depleted soils. Wetlands are divided into two salinity regimes: palustrine for freshwater wetlands and estuarine for saltwater wetlands; they are further divided into forested, shrub/scrub, and emergent wetlands. Unconsolidated shores are also included as wetlands. Palustrine forested wetland: Includes all tidal and non-tidal wetlands dominated by woody vegetation at least 5 meters in height, as well as all such wetlands in tidal areas in which salinity due to ocean-derived salts is below 0.5 percent. Total vegetation coverage is greater than 20 percent. Characteristic species: Tupelo (Nyssa), cottonwood (Populus deltoides), bald cypress (Taxodium distichum), American elm (Ulmus americana), ash (Fraxinus), and tamarack. Palustrine scrub/shrub wetland: Includes all tidal and nontidal wetlands dominated by woody vegetation less than 5 meters in height, as well as all such wetlands in tidal areas in which salinity due to ocean-derived salts is below 0.5 percent. Total vegetation coverage is greater than 20 percent. The species present could be true shrubs, young trees and shrubs, or trees that are small or stunted due to environmental conditions. 1 Characteristic species: Alders (Alnus spp.), willows (Salix spp.), buttonbush (Cephalanthus occidentalis), red osier dogwood (Cornus stolonifera), honeycup (Zenobia pulverenta), spirea (Spiraea douglassii), bog birch (Betula pumila), and young trees such as red maple (Acer rubrum) and black spruce (Picea mariana). Palustrine emergent wetland (persistent): Includes all tidal and non-tidal wetlands dominated by persistent emergent vascular plants, emergent mosses, or lichens, as well as all such wetlands in tidal areas in which salinity due to ocean-derived salts is below 0.5 percent. Plants generally remain standing until the next growing season. Total vegetation cover is greater than 80 percent. Characteristic species: Cattails (Typha spp.), sedges (Carex spp.), bulrushes (Scirpus spp.), rushes (Juncus spp.), saw grass (Cladium jamaicaense), and reed (Phragmites australis). Estuarine forested wetland: Includes all tidal wetlands dominated by woody vegetation at least 5 meters in height, and all such wetlands that occur in tidal areas in which salinity due to ocean-derived salts is equal to or greater than 0.5 percent. Total vegetation coverage is greater than 20 percent. Characteristic species: red mangrove (Rhizophora mangle), black mangrove (Avicennia germinans), and white mangrove (Languncularia racemosa). Estuarine scrub/shrub wetland: Includes all tidal wetlands dominated by woody vegetation less than 5 meters in height, and all such wetlands that occur in tidal areas in which salinity due to ocean-derived salts is equal to or greater than 0.5 percent. Total vegetation coverage is greater than 20 percent. Characteristic species: Sea-myrtle (Baccharis halimifolia) and marsh elder (Iva frutescens). Estuarine emergent wetland: Includes all tidal wetlands dominated by erect, rooted, herbaceous hydrophytes (excluding mosses and lichens), and all such wetlands that occur in tidal areas in which salinity due to ocean-derived salts is at least 0.5 percent and that are present for most of the growing season in most years. Perennial plants usually dominate these wetlands. Total vegetation cover is greater than 80 percent. Characteristic species: Cordgrass (Spartina spp.), needlerush (Juncus roemerianus), narrow-leaved cattail (Typha angustifolia), southern wild rice (Zizaniopsis miliacea), common pickleweed (Salicornia virginica), sea blite (Suaeda californica), and arrow grass (Triglochin martimum). Unconsolidated shore: Unconsolidated material such as silt, sand, or gravel that is subject to inundation and redistribution due to the action of water. Characterized by substrates lacking vegetation except for pioneering plants that become established during brief periods when growing conditions are favorable. Erosion and deposition by waves and currents produce a number of landforms representing this class. Characteristic land cover features: Beaches, bars, and flats. Barren land: Barren areas of bedrock, desert pavement, scarps, talus, slides, volcanic material, glacial debris, sand dunes, strip mines, gravel pits, and other accumulations of earth material. Generally, vegetation accounts for less than 10 percent of total cover. Characteristic land cover features: Quarries, strip mines, gravel pits, dunes, beaches above the high-water line, sandy areas other than beaches, deserts and arid riverbeds, and exposed rock. Open water: All areas of open water, generally with less than 25 percent cover of vegetation or soil. Characteristic land cover features: Lakes, rivers, reservoirs, streams, ponds, and ocean. Palustrine aquatic bed: Includes tidal and non-tidal wetlands and deepwater habitats in which salinity due to ocean-derived salts is below 0.5 percent and which are dominated by plants that grow and form a continuous cover principally on or at the surface of the water. These include algal mats, detached floating mats, and rooted vascular plant assemblages. Total vegetation cover is greater than 80 percent. Characteristic vascular species: Pondweed, horned pondweed (Zannichellia palustris), ditch grass (Ruppia), wild celery, waterweed (Elodea), riverweed (Podostemum ceratophyllum), water lilies (Nymphea, Nuphar), floating-leaf pondweed (Potamogeton natans), water shield (Brasenia schreberi), and water smartweed (Polygonum amphibium). Floating surface species: Duckweeds (Lemna, Spirodela), water lettuce (Pista stratiotes), water hyacinth (Eichhornia crasspies), water nut (Trapa natans), water fern (Salvinia spp.), and mosquito ferns (Azolla). Floating below-surface species: Bladderworts (Utricularia), coontails (Ceratophyllum), and watermeals (Wolffia)."}, {"section_title": "Estuarine aquatic bed:", "text": "Includes tidal wetlands and deepwater habitats in which salinity due to ocean-derived salts is equal to or greater than 0.5 percent and which are dominated by plants that grow and form a continuous cover principally on or at the surface of the water. These include algal mats, kelp beds, and rooted vascular plant assemblages. Total vegetation cover is greater than 80 percent. The Community-based Restoration Program, a part of the NOAA Fisheries Habitat Conservation Program, invests funding and technical expertise in high-priority habitat restoration projects that instill strong conservation values and engage citizens in hands-on activities. Through the program, NOAA, its partners, and thousands of volunteers are actively restoring coastal, marine, and migratory fish habitat across the nation. http://www.habitat. noaa.gov/restoration/programs/crp.html Appendix E: Federal Agency Programs That Support Coastal Wetland Protection, Restoration, and Management"}]