[{"section_title": "Abstract", "text": "The New York City Watershed Agricultural Program seeks to reduce the potential for phosphorus movement from farms to surface waters. A \"phosphorus index for site evaluation\" (P-index) provides planners in the New York City Watershed Agricultural Program with a tool for identifying individual farm business, phosphorus related problems, and evaluating solutions. A linear programming model is employed to examine dairy farm resource use and profitability, with the P-index used to impose phosphorus movement constraints. Results indicate dramatic differences in farm resource use and farm business profitability depending on the level of the P-index. Small changes in the target index level result in large shifts in optimal resource use and business profitability. These differences illustrate that restrictions on phosphorus movement from land to surface waters potentially have major impacts on resource use and farm profitability in the New York City Watershed."}, {"section_title": "", "text": "tural Council, 1997) . To address eutrophication in New York City reservoirs, the New York City Watershed Agricultural Program seeks to reduce the potential for phosphorus movement from dairy farms to surface waters. Since its beginning in late 1992, the program faced a major challenge in identifying workable tools to measure potential phosphorus movement for the purposes of identifying problems and evaluating alternative solutions. The challenge of identifying workable tools for planning and evaluation purposes continues today as the program goes through a range of informal and formal evaluation efforts.\nAdapting the \"phosphorus index\" introduced by Lemunyon and Gilbert (1993) to reflect special conditions in the New York City Watershed, Klausner (1997) developed a \"phosphorus index for site evaluation\" (P-index). P-index values reflect the potential for phosphorus movement from a site to surface waters. The P-index provides planners in the New York City Watershed Agricultural Program with a tool for identifying problems and evaluating solutions at the individual field and whole-farm levels."}, {"section_title": "Figure 1. Catskill/Delaware and Croton segments of the New York City Watershed", "text": "Other watershed protection efforts in New York and elsewhere are looking at tools such as the P-index to measure the potential for phosphorus movement from a site to surface waters for the purpose of guiding planning efforts (Coale, 1999; Jokela, 1999) . Using Lemunyon and Gilbert's phosphorus index, Sharpley (1995) compared index values with measured losses of phosphorus in runoff. He concluded, \"The close relationship between P index rating and total P loss … indicates that the indexing procedure can give reliable estimates of vulnerability to P loss in runoff …\" (p. 949).\nSince a variety of transport and source factors affect the P-index, alternatives to achieve desired targets for the P-index might exist. Runoff and erosion affect transport, and changes in farm business practices can reduce runoff and erosion. Changes in the farm business that affect sources of phosphorus on the farm include changes in the amount, timing, form, location, and method of P applications to land (Sharpley, Daniel, and Edwards, 1993) . We are not aware of any research that analyzes resource use, adaptations in resource use, and profitability associated with reducing the potential for phosphorus movement from farms as measured by the P-index.\nThe objective of this study is to examine the possible effects on dairy farm resource use and profitability associated with meeting P-index targets in the New York City Watershed Agricultural Program. This research contributes to a better understanding of the changes in resource use and tradeoffs required to meet P-index targets by identifying profit-maximizing resource allocations on dairy farms subject to resource constraints. Information regarding possible effects will be useful to the Watershed Agricultural Council-the New York City Watershed Agricultural Program's governing body and policy maker, to New York City Watershed Agricultural Program whole-farm planners, and to others looking at the P-index as a tool for guiding on-farm environmental planning efforts.\nOne of the primary responsibilities of the farmerled Watershed Agricultural Council has been to establish objectives and goals for guiding wholefarm planning efforts in the New York City Watershed. The New York City Watershed Agricultural Program is described as being \"fully funded\" (Watershed Agricultural Council, 1997) . Planning efforts seek to solve priority environmental issues while minimizing the funding required to implement the plan such that: (a) funding compensates farmers for any expected negative changes in profitability associated with the plan; (b) the plan is compatible with the individual and farm business missions, objectives, and goals held by the farm owner; and (c) the plan is feasible given the farm resources available and the level of funding resources for water quality improvements specified for the farm (Hanchar, Milligan, and Knoblauch, 1997) .\nThis research provides Council members with information they can use to compare the benefits and costs associated with achieving alternative P-index targets for the purpose of determining whether the index will be used to guide planning efforts on farms and at what target level, or, alternatively, that the index will not be used.\nWhole-farm planners in the New York City Watershed and elsewhere will benefit from information that helps to identify optimal means for achieving various P-index targets. This research helps to identify adaptations in resource use-for example, optimal rates, timing, and location of manure applications necessary to achieve P-index targets. Information regarding possible effects on dairy farms of meeting P-index targets would be useful to policy makers in other watershed protection programs where the P-index (or a similar measure) is being considered as a tool to guide on-farm planning efforts.\nThe article begins with a description of Klausner's (1997) \"phosphorus index for site evaluation.\" The linear programming model and representative farm data used in the study are then delineated, followed by the empirical results. The study ends with a summary and concluding remarks."}, {"section_title": "Measuring the Potential for Phosphorus Movement Using the P-Index", "text": "A key to reducing the potential for phosphorus movement from farms to surface waters in the New York City Watershed Agricultural Program is the ability to measure potential phosphorus movement. Tools for measuring potential phosphorus movement enable planning teams to better identify problems, examine underlying causes, identify alternatives, evaluate alternatives, and select the best or set of best solutions. Let PI equal the value of the P-index for a site. Then\nwhere ω is a {1× 7} vector of weights equal to (1.5, 1.5, 1.0, 0.75, 0.5, 1.0, 0.75), and K is a {7×1} vector of variables (factors K 1 , K 2 , ..., K 7 ) (Klausner, 1997) . Klausner assigned weighting factors based upon the reasoning of Lemunyon and Gilbert (1993) that \"particular site characteristics may be more prominent than others in allowing potential P movement from the site\" (p. 485).\nThe variables represented by the column vector K are calculated as follows:\n(2) K 1 = 0.5 × SL for 0 # SL # 15, and\nwhere SL is the average soil loss for the site in tons per acre per year estimated using the Revised Universal Soil Loss Equation (Renard et al., 1997) . (4) K 3 = 0.1 × SPT for 0 # SPT # 80, and\nwhere SPT is the value of the Cornell University \"Soil Phosphorus Test Result\" in pounds per acre per year.\n(5) K 4 = 0.1 × PFERT for 0 # PFERT # 90, and\nwhere PFERT is the pounds of P 2 O 5 applied as fertilizer per acre.\n(6) K 5 = 0 if no P 2 O 5 is applied as fertilizer; K 5 = 1 if phosphorus (P) fertilizer is band placed at planting deeper than 1 inch; K 5 = 2, if P fertilizer is topdressed April 1 through August 31, or incorporated just before planting; K 5 = 4 if P fertilizer is applied September 1 through October 31; and K 5 = 8 if P fertilizer is applied November 1 through March 31.\n(7) K 6 = 0.05 × PMANURE for 0 # PMANURE # 150, and K 6 = 7.5 for PMANURE > 150, where PMANURE is the organic P application rate in pounds of P 2 O 5 applied per acre per year.\n(8) K 7 = 0 if no P is applied via manure applications, K 7 = 1 if manure is incorporated deeper than 4 inches, and\nwhere PMANURE t is the organic P application rate in pounds of P 2 O 5 applied per acre in season t; θ t = 2, 2, 4, and 8 for t = 1, 2, 3, and 4, respectively; and t = 1 denotes the April 1 through May 31 period, t = 2 denotes the June 1 through August 31 period, t = 3 denotes the September 1 through October 31 period, and t = 4 denotes the November 1 through March 30 period. Consider a field with the following characteristics: SL = 3 tons/acre/year, HS = 1, SPT = 25 pounds/acre, PFERT = 20 pounds P 2 O 5 /acre, P fertilizer is band placed at planting deeper than 1 inch, PMANURE = 90 pounds P 2 O 5 /acre, and organic P application of 90 pounds P 2 O 5 /acre is in June. Using equations (1)S(8), the P-index value would be 14.3. Klausner (1997) provides some guidelines for site interpretations (table 1) . If a planner calculated a P-index value of 14.3 for a site, then the planner would associate a medium potential for P movement with the site.\nThe New York City Watershed Agricultural Program's Watershed Agricultural Council considered P-index ratings of \"medium\" on fields to guide planning efforts on farms. A basis for the Council's desire for ratings in the medium range is found in Klausner (1997) . Klausner recommends alternative practices, such as changes in manure rates and timing, for sites with \"very high\" and \"high\" ratings to reduce the potential for adverse effects to surface waters. If a site rates \"medium\" or \"low,\" then Klausner recommends no specific constraints on practices. The absence of specific constraints for the medium range implies that ratings within the range are desirable or adequate, thus providing a basis for the Council's desire for medium ratings.\nOur research examines the implications of achieving specific P-index targets within the medium range. Although Klausner recommends no specific constraints for fields with ratings of medium, he suggests \"some remedial action should be taken to lessen the probability of P loss\" (p. 1). Given the Watershed Agricultural Council's expectation that the P-index serve as a standard for planning for phosphorus concerns and the absence of specific direction with respect to the nature and/or extent of remedial action, planning efforts could benefit from the establishment of a specific target, or a narrower range of targets within the medium range. Further, as researchers more fully understand the environmental consequences of phosphorus and the use of the P-index as a measurement, the acceptable range may change.\nThe number of transport and source factors that affect the P-index, combined with the relationships among these factors and other output and input choices farmers must make, hints at the potential complexity of the problem. Moreover, the relatively large width of the medium range suggests that Low potential for P movement from site. If farming practices are maintained at the current level, then there is a low probability of an adverse impact to surface waters from P loss.\n10 to 24 Medium potential for P movement from site. Chance for an adverse impact to surface water exists. Some remedial action should be taken to lessen the probability of P loss.\n25 to 42 High potential for P movement from site and for an adverse impact on surface water to occur unless remedial action is taken. Soil and water conservation, as well as P management practices, are necessary to reduce the risk of P movement and water quality degradation."}, {"section_title": "> 42", "text": "Very High potential for P movement from site and for an adverse impact on surface waters. Remedial action is required to reduce the risk of P movement. Soil and water conservation practices, plus a P management plan, must be put in place to reduce potential for water quality degradation.\nSource: Klausner (1997) .\npossible effects on dairy farm resource use and profitability of meeting various targets within the medium range may vary considerably."}, {"section_title": "The Linear Programming Model", "text": "To evaluate the many possible resource allocations for their ability to achieve a range of P-index targets while maximizing economic performance, a linear programming model for a representative farm in the New York City Watershed was developed and solved. Schmit and Knoblauch (1995) provide the basis for the linear programming model used. Returns above variable costs are a linear function of possible farm activities given a set of estimated gross margins corresponding to the activities. An individual gross margin is a price, return, or cost per unit of the corresponding activity. Key choices examined include the number of cows; feed ration composition; and allocations of resources to production enterprises, including choices regarding fertilizer and manure amounts, timing, and location among crops (see table 2 ). The latter are key factors in measuring potential phosphorus movement from a site using the P-index. A prominent difference reflected in the activities and constraints of the current model relative to Schmit and Knoblauch is the enhanced delineation of the land resource. Twelve tillable land groups, representing three levels of hydrologic sensitivity and four \"Soil Test P\" categories, describe the land resource examined in the current model. This enhancement incorporates two of the seven site characteristics used to compute the P-index for a site.\nThere are three other prominent differences between the set of activities incorporated in our linear programming model and the set used by Schmit and Knoblauch (1995) . First, the current model contains one cow activity for a predominantly corn silage-based total mixed ration, and one activity for a predominantly alfalfa-based total mixed ration. Two replacement heifer activities are defined similarly. In addition to the corn silage and alfalfa-based rations, Schmit and Knoblauch included a predominantly orchardgrass forage-based total mixed ration, because orchardgrass' high nitrogen uptake requirements relative to alfalfa were of interest given the focus on nitrogen loss restrictions. We chose to omit the predominantly orchardgrass forage-based total mixed ration due to the focus on phosphorus in the New York City Watershed Agricultural Program.\n1 Second, the crop activities included here allow for a rotation of corn silage and alfalfa, where four years of corn silage follow four years of alfalfa. The model also allows for continuous alfalfa with a four-year stand life, and for the idling of tillable acres. Crop activities reflect crop selection and rotation practices common to areas in central New York including the New York City Watershed (Schmit and Knoblauch, 1995) .\nThird, activities for manure and fertilizer applications by crop, by land group, by season represent prominent differences relative to the Schmit and Knoblauch model where the set of activities included manure and fertilizer applications by crop only.\nWe note two additional important differences between the set of constraints of the linear programming model used here and the Schmit and Knoblauch constraint set. First, constraints that specify restrictions on the values of the P-index for each land group replace Schmit and Knoblauch's equation which accounts for, but does not limit, the amount of lost P. Klausner (1997) intended that New York City Watershed Agricultural Program wholefarm planners apply the P-index and resulting recommendations on a field and/or site basis. If, for example, a \"medium\" rating was the desired target, then planners would achieve the desired rating on each field-i.e., planners could not use areas with \"low\" ratings to offset areas with \"high\" ratings in order to achieve an overall rating of \"medium.\" A set of constraints reflecting the assumption that the P-index target be met for each land group takes the following form:\nwhere α kl denotes the partial effect on the P-index associated with factors K 1 through K 5 [see equations (2)S(6)] for a given crop k on land group l; CROP kl represents the number of acres of crop k on land group l; β kl t denotes the effect on the P-index associated with the application of a ton of manure to an acre of crop k on land group l in season t; MANURE klt is the number of tons of manure applied to crop k on land group l in season t; χ kl denotes the effect on the P-index associated with a pound of commercial P fertilizer applied to crop k on land group l; τ is the P-index target (see table 1 for possible values); IDLE l is the number of acres of land group l that are idle; and A l is the total number of tillable acres available in land group l. The term τIDLE l ensures the P-index target is met for acres of land group l on which corn silage and/or alfalfa production occurs. Finally, an equation that totals the tons of nitrogen unaccounted for using Klausner's (1995) approach for estimating nutrient balances replaces Schmit and Knoblauch's restrictions on nitrogen lost. Optimal solutions that maximize returns above variable costs were obtained for unrestricted and restricted cases. The model was solved initially assuming a distribution of tillable cropland considered representative of dairy farms in the Catskill/ Delaware, part of the New York City Watershedinitially with no restrictions on the value of the P-index, and then with the following restrictions on the value of the P-index: 24, 17, and 10, where 24 and 10 represent the upper and lower boundaries of Klausner's (1997) \"medium\" range, respectively.\nIn addition to the initial restrictions, we solved the model for P-index targets 16, 15, ..., 11, because results indicated dramatic differences in effects on resource use and profitability between the targets of 17 and 10. We also solved the model using alternative distributions of tillable cropland among levels of hydrologic sensitivity."}, {"section_title": "Representative Farm and Data Description", "text": "A single representative farm is described to represent dairy farms in the New York City Watershed. The 60-cow dairy of Schmit and Knoblauch (1995) provided data for many technical coefficients of the current model. The milking herd size of 60 cows reflects the average herd size for dairy farm businesses in New York City Watershed counties. For example, 1997 Census of Agriculture data indicate the average number of cows per dairy farm in Delaware County (the primary agricultural county in the Catskill/Delaware, segment of the New York City Watershed) is about 61 cows (U.S. Department of Agriculture).\nTo describe the land resource of the representative farm, we derived a distribution of tillable cropland acres by level of hydrologic sensitivity by soil test P category. We used methods and approaches reported by Klausner (1995 Klausner ( , 1997 , and an actual distribution of tillable acres by level of hydrologic sensitivity and soil test P category from a farm in the New York City Watershed in combination with the description of the representative farm that specifies 185 acres of tillable cropland.\nWhole-farm planners in the New York City Watershed Agricultural Program describe the actual farm as a typical, New York City Watershed \"hillside\" dairy farm. Sizeable percentages and lengths of slope, and proximity to creeks and other areas of concentrated water flow characterize such farms which are common to the agricultural landscape in the watershed.\n2 The resulting distribution of tillable cropland acres is shown in table 3.\nIn equation (9), the coefficients α kl for the crop by land group activities, CROP kl , denote the partial effects on the P-index associated with the following factors: average soil loss (SL), soil test P category (STP), hydrologic sensitivity risk level (HS), P fertilizer applied as starter, and P fertilizer application method (table 4) . For example, the value of 13.1 for corn silage on hydrologic sensitivity risk level 2 land, with a soil test P category of low equals (10) (1.5, 1.5, 1.0, 0.75, 0.5)\nwhere K 1 = 0.5 × SL for SL = 10; K 2 = 2 (that is, HS = 2); K 3 = 0.1 × SPT for SPT = 6; K 4 = 0.1 × PFERT for PFERT = 20; and K 5 = 1 (that is, P fertilizer is band placed at planting deeper than 1 inch).\nThe vector (1.5, 1.5, …, 0.5) in equation (10) is a subset of the vector ω from equation (1). The values for SL and SPT represent weighted averages for the land group using individual field-level data for the factors and acres by field. Since the activity in the example is a corn silage activity, the value for SL is calculated using necessary factors for four years of corn silage in an eight-year rotation with alfalfa. The crop by land group activities incorporate recommendations for amounts, timing, and method of starter P fertilizer applications, based on Klausner (1995) . In equation (9) the coefficient β klt for a manure application activity (MANURE klt ) represents the effect on the P-index associated with the application of a ton of manure to an acre of crop k on land group l in season t holding other factors constant. Assume 5 pounds of P 2 O 5 per ton of manure applied (Schmit and Knoblauch, 1995) , and assume all manure is topdressed. Then (11) β klt = γ t × 5, oe k and l, and t =1, 2, …, 4, where γ t is the effect on the P-index associated with a pound of P 2 O 5 applied via manure per acre in season t. Equation (1) yields a nonscalar partial derivative with respect to PMANURE t for t = 1, 2, …, 4 [see equations (7) and (8)]. Consequently, to conform to the linear constraints requirement of the generalized linear programming model, the linear function was estimated:\nwhere Y = the portion of the P-index attributed to organic P applications (amount and timing), X t is the pounds of P applied in manure in season t, g is an error term, γ 0 was restricted to equal zero, and γ 1 = γ 2 since θ 1 = θ 2 from equation (8). Hypothetical organic P applications by season and resulting partial values for the P-index based on equations (7) and (8) provided observations to estimate equation (12). Possible organic P application rates per year of 150, 100, 75, and 50 pounds of P 2 O 5 per acre were allocated among seasons in various combinations. where all estimated coefficients are significant at the 5% level, and the adjusted R 2 = 0.6222. The estimates for γ t and equation (11) yield the technical coefficients associated with manure application activities for equation (9) . A result of this approach is that the P-index constraint for a given land group represents a linear estimate of the relationship between the true P-index and the activities.\nThe third set of activities associated with a set of nonzero technical coefficients for the P-index constraints is the set of P fertilizer purchase and application activities. These activities and/or manure application activities meet nutrient requirements net of the amount recommended as starter. We specify the model to reflect the recommendation that applications would be band placed at planting for corn silage and topdressed from April through August for alfalfa (Klausner, 1995) , and the relationship between the pounds of P 2 O 5 applied as fertilizer per acre and the P-index [equation (5)]. "}, {"section_title": "Results and Discussion", "text": "With no constraints on the P-index, returns above variable costs were maximum at $76,835 for the 60-cow farm (table 5) . The optimal number of cows was at the capacity of 60. All 185 acres of available tillable cropland were in corn silage or alfalfa production. Restrictions on the P-index of 24, 17, and 16 had virtually no effect on profitability, cow numbers, animal rations, and overall crop selection. Results suggest that potential exists for dairy farmers in the New York City Watershed with enterprise configurations similar to the representative farm to achieve P-index targets in the middle of the medium range without sacrificing returns above variable costs. However, achieving these results required adaptations in resource use. Adaptations in resource use occurred with respect to crop selection by land group, and the amount and timing of manure applications among the crop by land group activities (table 6).\nOur findings show that farmers could achieve P-index targets in the middle of the medium range without declines in total crop acres by altering the crop/land group allocations-specifically by allocating hydrologic sensitivity risk level 2 land from continuous alfalfa to the rotation of corn silage and alfalfa, and allocating hydrologic sensitivity risk level 3 land from the rotation of corn silage and alfalfa to continuous alfalfa (table 6) .\nResults also indicate farmers would need to adapt the amount and/or timing of manure applications among crop by land group activities to meet the P-index restrictions. A notable adaptation reflected in table 6 is that the P-index restriction of 16 is achieved in part by allocating a relatively large amount of manure away from corn silage on hydrologically sensitive risk level 3 land during the November through March period, while allocating considerably more manure to alfalfa production on hydrologically sensitive risk level 3 land during this same period. Imposition of P-index restrictions of 15 and 14 reduced returns above variable costs by $1,918 and $5,196, respectively, compared to the unrestricted case (table 5) . Shifts from a corn silage-based ration to an alfalfa-based ration for the cows and greater alfalfa acres relative to corn silage characterized this set of results (tables 7 and 8). The profitability effects for the P-index restrictions of 15 and 14 combined with the results describing adaptations in the feed rations suggest, over this fairly narrow range of P-index targets, farmers might implement these types of changes without experiencing relatively large decreases in returns above variable costs. Note that the optimal number of cows for the P-index target of 14 is 58, which is less than the maximum capacity of 60 (table 7) .\nRestrictions on the P-index in the range 13 to 10 yielded substantial reductions in optimal returns above variable costs and changes in resource use compared to the unrestricted case. Optimal returns above variable costs for the P-index restriction of 13 declined by $16,415 relative to the unrestricted case, while optimal returns above variable costs for the P-index restriction of 10 declined by $52,342 relative to the unrestricted case (table 5) . Dramatic declines in crop acres and optimal cow numbers characterized this set of results (tables 7 and 8) .\nPartial values for the P-index by crop by land group underlie this set of results (refer to table 4 for partial values for the P-index). For example, in table 4, note the crop by land group uses whose values exceed the P-index target of 10-included are all corn silage by land group uses, and many alfalfa by land group uses. With fewer feasible crop choices available that meet the more restrictive P-index constraint for a given land group, the need to idle land translates to declining optimal cow numbers.\nA shadow price associated with a land group constraint represents the value of having an additional acre of land in the given land group providing the same variables remain in the optimal solution. Results indicate that the value to a dairy producer of an additional unit of land decreases for all available land groups, because constraints on the value of the P-index require lower and lower potentials for phosphorus movement from lands to surface waters (table 9). HS3 / STPVH 0 0 2.0 < 0 a HS2 and HS3 denote hydrologic sensitivity risk levels 2 and 3 land, respectively; STPL, STPM, STPH, and STPVH denote soil test P categories low, medium, high, and very high land, respectively. Note that no hydrologic sensitivity risk level 1 land is available for this representative farm. b Negative shadow prices are possible given that land group constraints are specified as equality constraints in the model."}, {"section_title": "P-Index", "text": "The value of an additional unit of land decreases dramatically for all available land groups for constraints at the bottom of the medium range (P-index # 10), when compared to results for the P-index # 16. For example, when the P-index target is # 10, shadow prices for all available land groups are zero. This means additional acres of hydrologic sensitivity risk level 3 land and/or risk level 2 land would not be valuable for the representative farm.\nExpected incremental improvements in water quality associated with achieving lower P-index targets over the range 17 to 12 are generally obtained at increasingly greater costs as measured by expected declines in returns above variable costs (shown in figure 2 ). Note that index targets of 11 and 10 do not follow the pattern of increasing costs as measured by expected declines in returns above variable costs. The distribution of acres among the land groups (table 3) , partial values for the P-index (table 4) relative to P-index targets of 13, 12, 11, and 10, and resulting optimal cow numbers and land use underlie the results.\nLowering the target from 13 to 12 required the idling of 74 additional acres of land. In comparison, lowering the target from 12 to 11 required the idling of 3.7 additional acres (table 8). The latter acres came from the hydrologic sensitivity risk level 2, soil test P very high land group with its partial value from table 4 of 12.0. While optimal acres in crop production and optimal cow numbers declined 47.5% and 41.3%, respectively, when the P-index target declined from 13 to 12, optimal acres in crop production and optimal cow numbers declined by the relatively smaller percentages of 4.52% and 22.2%, respectively, when the P-index target declined from 12 to 11 (tables 7 and 8).\nBased on these results, obtaining P-index targets in the middle to low end of the medium range is associated with dramatic effects on resource use and profitability when resource adaptations are limited to the types discussed above. What if farm business owners and watershed planning staff could identify changes in the farm business such that hydrologic sensitivity risk level 1 land was available? For example, a farm business owner might look to alter the percentage of slope and length of slope of land through strip cropping practices for the purpose of reducing hydrologic sensitivity.\nUnder these conditions, could P-index targets be attained with different effects on profitability? To answer these questions in part, given the scope of the current model, we redefined the land base such that the 185 acres of tillable land were uniformly distributed among the three hydrologic sensitivity risk levels, and solved the revised model assuming a range of P-index restrictions. The uniform distribution of tillable acres among hydrologic sensitivity risk levels is not representative of typical farms in the New York City Watershed given current conditions. However, distributions of tillable land characterized by greater availability of hydrologic sensitivity risk level 1 land may be attainable given changes in some practices-for example, changes in cropping practices that reduce the percentage and/or length of slope, or best management practices that address areas of concentrated water flow. Using a uniform distribution of acres among all three levels of hydrologic sensitivity resulted in maximum returns above variable costs of approximately $74,300 and $68,400 for P-index targets of 13 and 10, respectively. The use of a distribution where 65% of the tillable cropland acres were described as hydrologic sensitivity risk level 3, and the remainder as risk level 2, yielded maximum returns above variable costs of approximately $56,000 and $19,900 for P-index targets of 13 and 10, respectively. Compare these results to the results reported in table 5-$60,420 and $24,493 for P-index targets of 13 and 10, respectively.\nClearly, results are sensitive to the availability of land by level of hydrologic sensitivity. The availability of land which is less hydrologically sensitive allows for achieving P-index targets in the lower end of the medium range with less adverse effects on dairy farm resource use and profitability. Here, we did not attempt to examine the feasibility of altering the current distribution of land through various means, nor did we attempt to determine the associated costs.\nFor the uniform distribution of tillable acres among levels of hydrologic sensitivity, shadow prices associated with the land group constraints were notable. Shadow prices increased substantially for hydrologic sensitivity risk level 1 land for all soil test P categories as P-index targets moved from #17, to #13, and finally to #10. For example, the shadow price associated with the hydrologic sensitivity risk level 1, soil test P low land constraint, increased from $98, to $118, and then to $195, for respective P-index targets of 17, 13, and 10. Land described as hydrologic sensitivity risk level 1, soil test P low increased in value to the dairy producer as P-index constraints became more restrictive."}, {"section_title": "Summary and Conclusions", "text": "This study has examined resource use and profitability on a representative dairy farm in the New York City Watershed given resource constraints, and constraints on phosphorus movement from land to surface waters as measured by the P-index (Klausner, 1997) .\nResults for the representative dairy farm suggest dramatic differences in expected effects on resource use and returns above variable costs between P-index restrictions at the upper end and mid-part of the \"medium\" range (for example, 24, 17, and 16) and restrictions at the lower end of the range (for example, 13 through 10). Results indicate that dairy farmers in the New York City Watershed might achieve P-index targets over the range of 24 to 16 with little or no adverse effects on returns above variable costs. Farmers might achieve the targets in this range by altering crop selection by land group, and by altering amount, timing, and location of manure applications.\nThe results also suggest that expected incremental improvements in water quality associated with achieving lower P-index targets over the range 17 to 12 are obtained at increasingly greater costs as measured by expected declines in returns above variable costs.\nOur findings confirm the selection of the \"medium\" range of the P-index for this analysis. For P-index targets in the upper to middle parts of the medium range, the representative farm does not experience declining returns above variable costs when compared to the unconstrained case. For P-index targets in the low end of the \"medium\" range, and for targets in the \"low\" range, dramatic declines in expected returns above variable costs associated with the current range of alternatives threaten business survival. The \"medium\" range is, in fact, the relevant range.\nWhile a watershed scale examination of effects was beyond the scope of this research, the sensitivity of resource use and profitability to variation in the P-index target within the \"medium\" range strongly implies the choice of a target within the medium range has significant policy implications for choosing a target to guide planning on farms. Specifically, the choice of a target within the \"medium\" range matters very much relative to expected effects on profitability. The choice of a P-index target should also reflect that incremental improvements in the P-index over a range of values are obtained at increasingly greater costs as measured by declines in returns above variable costs. The results assume static technology. If targets were imposed, then new technologies might come under consideration which would reduce the expected adverse effects on dairy farm profitability.\nBased on the results of this analysis, adaptations in resource use with respect to crop selection by land group, and the amount, location, and timing of manure applications among the crop by land group activities might play prominent roles in achieving P-index targets in the middle of the medium range, while not adversely affecting returns above variable costs. The results should point planning efforts in the watershed to the types of changes in the farm business described above as efforts look to address water quality issues related to phosphorus, while simultaneously allowing farmers to achieve other business objectives and goals.\nResults associated with the analyses that assumed a uniform distribution of tillable acres among the three hydrologic sensitivity risk levels indicate other types of changes in the farm business could play roles in achieving P-index targets. For example, changes in the farm business designed to make less hydrologically sensitive land more available could help to achieve P-index targets in the lower end of the medium range. A dairy farm business owner might look to purchase and/or rent hydrologic sensitivity risk level 1 land if available and/or attempt to convert hydrologic sensitivity risk level 3 and/or 2 land to risk level 1 land to accomplish the above.\nMaking less hydrologically sensitive land more available may or may not be the preferred solution for achieving P-index targets in the lower end of the medium range, depending upon the incremental costs and benefits associated with the changes. Shadow price results for the land group constraints given the typical distribution of tillable acres among the three hydrologic sensitivity risk levels, and the results for the uniform distribution of tillable acres, including the shadow prices associated with the land group constraints, begin to quantify the benefits to the representative farm business of having additional acres of land which are less hydrologically sensitive. For example, the latter results combine to suggest that imposition of P-index targets in the lower end of the \"medium\" range would be associated with increased values for hydrologic sensitivity risk level 1 land.\nWatershed protection efforts seeking to reduce phosphorus movement from farms to surface waters will recognize the value of having tools for estimating potential phosphorus movement for purposes of identifying problems and evaluating alternative solutions. Workable tools will be key to successful on-farm planning efforts. The phosphorus index (Lemunyon and Gilbert, 1993; Klausner, 1997) has the potential to meet this need. Research is needed to determine its value as a tool-i.e., does the P-index adequately estimate phosphorus movement from farms to surface waters?\nIf the P-index is found to be a valuable, workable tool, then planning and implementation activities of watershed protection efforts in general would be enhanced by considering three key lessons from this study: P First, adaptations in resource use with respect to crop selection by land group, and the amount, timing, and location of manure applications by crop should receive emphasis. These types of changes have potential to achieve P-index targets in the middle of the medium range, while not adversely affecting profitability.\nP Second, expected incremental improvements in water quality associated with achieving P-index targets near the lower end of the medium range are obtained in general at increasingly greater costs, as measured by expected declines in profitability.\nP Third, changes in the farm business designed to make land that is less hydrologically sensitive more available should be examined for the potential to achieve P-index targets in the lower end of the medium range.\nAs watershed protection efforts choose to use the P-index as a standard for planning for phosphorus concerns, studies designed to extend the work reported here will be useful. Examinations of alternative representative farm sizes and hydrogeology; expanded choices regarding manure applications, including method and storage considerations; and expanded choices regarding feeding strategies, including effects on the nutrient composition of manure, should receive emphasis."}]