[{"section_title": "", "text": "converged toward the same result: the convalescentphase serum from the cat contained immunoglobulins against SARS-CoV-2, which were absent from the serum from control cats. These antibodies target several distinct viral proteins, and they caused a total neutralizing effect up to a much higher dilution than those from the owner's serum. This household cat was therefore productively infected with the SARS-CoV-2 virus excreted by its owner, and the infection caused a nonfatal but nevertheless severe disease, mainly of the respiratory system (Videos 2-6).\nPublic health officials are still learning about SARS-CoV-2, but no current evidence indicates that pets play a role in spreading the virus. Therefore, taking measures against companion animals that may compromise their welfare is not justified. N aturally occurring human-to-animal transmission of severe acute respiratory syndrome (SARS) coronavirus was reported during 2003 when viral RNA was detected in oropharyngeal and rectal swab specimens from healthy domestic cats in a housing estate at the center of a large SARS cluster in Hong Kong, China; infections were confirmed serologically (1). Susceptibility of cats to infection with this virus and transmission between cats were demonstrated experimentally (2) . Pulmonary pathologic changes, similar to those for humans with SARS, developed in infected cats, but the cats remained asymptomatic (2, 3) .\nThese findings informed the current precautionary strategy of the Agriculture, Fisheries and Conservation Department of Hong Kong to quarantine mammalian pets from households with confirmed human coronavirus disease (COVID-19) or their close contacts (defined as a person who had faceto-face contact for >15 min with a person who had confirmed SARS Coronavirus-2 [SARS-CoV-2] infection) in a holding facility, when alternative care was unavailable. Pets are swabbed for SARS-CoV-2 testing and confined until reverse transcription PCR (RT-PCR) results are negative on 2 consecutive oc-We tested 50 cats from coronavirus disease households or close contacts in Hong Kong, China, for severe acute respiratory syndrome coronavirus 2 RNA in respiratory and fecal samples. We found 6 cases of apparent human-tofeline transmission involving healthy cats. Virus genomes sequenced from 1 cat and its owner were identical.\ncasions. Findings for 2 infected dogs have been reported (4). We report testing results for cats.\nSwab (nasal, oral, rectal) specimens and feces collected from nonsedated cats after admission were tested for SARS-CoV-2 RNA at the Agriculture, Fisheries and Conservation Department Veterinary Laboratory by using a commercial RT-PCR targeting the partial envelope and RNA-dependent RNA polymerase genes (Molbiol Lightmix; TIB MOLBIOL, https://www.tib-molbiol.com). This PCR does not "}, {"section_title": "RESEARCH LETTERS", "text": "show cross-reactivity with these genes from enteric coronavirus (5) .\nFor samples with positive or equivocal results, confirmatory quantitative RT-PCRs targeting nonstructural protein 4, nonstructural protein 16, nucleoprotein, and membrane genes were performed at the World Health Organization COVID-19 Reference Laboratory at the University of Hong Kong (4). Animals with positive results were evaluated by repeated sampling to monitor viral shedding by RT-PCR. Serologic analysis was used selectively.\nWe sampled 50 cats during February 11-August 11, 2020. Time from onset of COVID-19 symptoms in owners to first sampling of their cats was available for 21 owners of 35 cats and ranged from 3 to 15 (median 8, interquartile range 4) days. SARS-CoV-2 RNA was detected in samples from 6 (12%) of 50 cats (Table, https:// wwwnc.cdc.gov/EID/article/26/12/20-2786-T1.htm).\nThe first positive case (cat 1) was from a household that had 3 persons with confirmed cases of CO-VID-19; their symptoms (fever, cough, or shortness of breath) started on March 20, 29, and 30, 2020. Their 7-year old, female, domestic shorthair cat was examined by a veterinarian at admission on day 1 (March 30), and reported to be clinically healthy. Nasal, oral, and rectal swab specimens collected on day 1 were positive for SARS-CoV-2 RNA; viral nucleoprotein gene copy numbers were log 10 6.3/mL, log 10 5.6/mL, and 3.2 log 10 /mL, respectively.\nAttempts to culture virus from day 1 samples on Vero E6 (ATCC CRL-1586) cells as described (4) were unsuccessful. Viral RNA was detected in oral swab specimens for 8 days and nasal swab specimens for 11 days, but rectal swab specimens were negative after day 1 (Table) .\nWe performed serologic analysis to detect neutralizing antibodies by using a 90% plaque reduction neutralization test for SARS-CoV-2 (4). The result was positive for the only serum sample collected (on day 19) and had titer >1:320 (4). Viral genomes from cat 1 and 1 owner were sequenced by using a MiSeq Sequencing Platform (Illumina, https://www.illumina.com) after reverse transcription of viral RNA and multiple, overlapping, ≈2-kb PCRs that targeted the viral genome (4). Both genome sequences (29,830 nt sequenced; 99.8% of the genome) were identical (Figure) and deposited in GenBank (accession no. MT628701).\nFour of the other 5 positive cats were from confirmed COVID-19-infected households, and 1 indooronly cat belonged to a close contact who was not confirmed to be infected. Time from onset of COV-ID-19 symptoms in owners to animal sampling was known for 3 cats (5, 11, and 8 days); 1 had equivocal envelope gene PCR results but was positive by a novel surrogate virus neutralization test (6) . Signs of disease did not develop in any infected cats, consistent with experimental feline infections, which are also usually subclinical (7; A. Bosco-Lauth et al., unpub. data).\nCOVID-19-like signs have been reported in domestic cats naturally infected with SARS-CoV-2 in other countries (8) . In addition, 4 tigers and 3 lions with respiratory signs in a zoo in New York, New York, USA, were confirmed to be shedding SARS-CoV-2 in feces (S.L. Bartlett et al., unpub. data). Susceptibility to SARS-CoV-2 might differ between felid species.\nSARS-CoV-2 RNA persisted longest in nasal secretions in 1 case for 11 days at low levels. Viral RNA was detected in nasal washes from kittens experimentally inoculated with SARS-CoV-2 for 8-9 days, after which sampling was stopped (7) . Cats acquiring infection from being cohoused with experimentally infected cats shed virus in respiratory secretions longer (7 days) than directly inoculated cats (5 days) (8) .\nAlthough feline-to-human transmission is theoretically possible, we did not find any evidence of this transmission. The timeline of infection in cat 1 and the finding of an identical SARS-CoV-2 genome sequence in a human from the same household is consistent with human-to-animal transmission. In support of these findings, the cat had no outdoor access.\nMore widespread serologic surveillance of cats in contact with COVID-19 patients is warranted to determine the prevalence of human-to-cat transmission. Some infected cats might have stopped shedding virus before being quarantined because viral shedding periods as short as 3 days have been reported in experimentally infected cats (7) ."}]