[{"section_title": "Introduction", "text": "Wetlands are a valuable natural resource and play a crucial role in the ecological systems of a landscape. Wetlands provide important ecosystem functions such as maintaining water quality by fi ltering nutrients and pollutants, storing fl oodwater and mitigating its effects, and providing habitat for a variety of wildlife adapted to saturated environments. Wetlands also play a role in the global carbon cycle, acting as both carbon sources and sinks (Keddy, 2000; Mitsch and Gosselink, 2000) .\nWetland loss has occurred at a rapid rate in the United States. In the years between European settlement and the 1980s, the 48 conterminous states lost an estimated 53 percent of wetland acreage due to human activities such as agriculture, urbanization, and pollution (Dahl, 1990) . In the state of Minnesota, United States, over 50 percent of the estimated pre-settlement 3.6 million ha of wetlands have been lost statewide. However, the degree of wetland loss is greatest, over 80 percent, in southern and western Minnesota where wetlands were drained primarily for agriculture. Urbanization has caused comparatively smaller wetland area losses, but has signifi cantly altered wetlands' physical, biological, and chemical properties (Johnston, 1989) . The loss of wetlands continues, but some studies suggest that wetland loss is slowing due to regulatory controls (Dahl and Johnson, 1991) . Despite the critical importance of accurate mapping of the spatial distributions of wetlands for making policy decisions related to preservation of existing wetlands (Baker et al., 2006) , the National Wetlands Inventory (NWI) in Minnesota is as much as 38 years out of date in some areas (MNGeo, 2012) .\nAccurate mapping of wetlands can be achieved through a variety of approaches ranging from fi eld investigation to remote wetland assessment. Due to the high costs of performing fi eld wetland mapping, remote sensing-based approaches have been used for several decades (Cowardin and Myers, 1974) . Numerous studies have examined remote sensing based data sources and approaches for wetland mapping.\nFrequently examined methods include aerial photograph interpretation and satellite image analysis of both single and multi-date optical satellite imagery, in which optical properties (e.g., refl ectance) of wetland vegetation and land forms are assessed (Baker et al., 2006; Harvey et al., 2001; Hodgson et al., 1987; Lunetta and Balogh, 1999; Ozesmi and Bauer, 2002; Pope, 1994; Sader et al., 1995; Tiner, 1990; Townsend and Walsh, 2001; Wang et al., 1998a; Wright and Gallant, 2007) . A notable example of a project incorporating these techniques is the National Oceanic and Atmospheric Administration's (NOAA) Coastal Change Analysis Program (C-CAP). C-CAP provides periodic land-use/land-cover classifi cations of areas near coastlines and the Great Lakes, with the goal of studying change, including in wetlands, in those areas. A somewhat less studied optical method involves the use of hyperspectral imagery to map wetlands based on fi ne details in vegetation spectral response. Though hyperspectral imagery can be used to derive accurate wetland maps, the data acquisition, storage, and processing requirements are greater than those of multispectral imagery (Becker et al., 2005 and Hirano et al., 2003; Jollineau and Howarth, 2008; Neuenschwander et al., 1998; Wang et al., 1998b) . Though useful, hyperspectral data were not available for inclusion in this project. In recent years, high spatial resolution satellite and aerial imagery have been assessed for wetland mapping potential. Maxa and Bolstad (2009) used Ikonos imagery and lidar data to map northern wetlands, which outperformed an Despite the aforementioned extensive research in wetland mapping, many questions remain i.e., particularly with respect to studies using high spatial resolution imagery. An important question is which data types, among the many that are available to geospatial researchers, should one prioritize for inclusion in high spatial resolution mapping projects. In the research described here, we examined the effects of data type selection on wetland mapping accuracy using multiple classifi cation schemes in two physiographically different study areas. The specifi c goals of this study were: (a) to examine the advantages and disadvantages of using several input geospatial datasets for mapping wetlands, (b) to describe the suitability of geospatial data for classifying wetlands according to three schemes (wetland/non-wetland, Cowardin class, and MNDNR), and (c) To compare classifi cation accuracies of wetlands in two very different physiographic regions."}, {"section_title": "Study Areas", "text": "Two study areas in Minnesota were selected for this research, one located in the Minneapolis-St. Paul metropolitan area and one located in the northeast forested region (Figure 1 ). These areas were selected because they represent a wide range of wetland types and because geospatial datasets and fi eld reference data (described below) were available. The metro study area encompassed the limits of the City of Chanhassen, Minnesota, a southwestern suburb of Minneapolis with an area of approximately 60 km 2 . Land-use within the city is primarily medium density residential with some areas of industrial and dedicated open space. Wetlands, lakes, ponds, and rivers account for approximately 27 percent of the city's surface area (City of Chanhassen, 2006) .\nThe Fond du Lac Reservation (FDL), located northwest of the City of Cloquet, Minnesota, is part of the boreal forest biome. FDL has an area of approximately 390 km 2 . The land-cover is dominated by both deciduous and evergreen forests and low density residential. Wetlands and water bodies account for approximately 38 percent of FDL's surface area. The FDL area experienced dryer than normal weather conditions during 2009 when some of the FDL imagery used in this study were acquired. Drought conditions persisted throughout the spring and summer of 2009, which may have affected the study results with respect to the measured utility of those images."}, {"section_title": "Methods", "text": ""}, {"section_title": "Classifi cation Schemes", "text": "Three classifi cation schemes were used in this study: (a) A simple wetland versus upland discrimination, (b) Wetlands classifi ed to the Cowardin class level ; Table 1 ), and (c) A simplifi ed plant community classifi cation (hereafter termed \"MNDNR\"). The MNDNR scheme was developed by the Minnesota Department of Natural Resources (DNR) and is based on Eggers and Reed (1997) , with modifi cations to make the scheme more appropriate for remote sensing-based mapping of wetlands. The full classifi cation scheme including class defi nitions can be found in Kloiber and MacLeod, 2011 . The scheme is in offi cial use in Minnesota within the wetland mapping group of the DNR. In addition, it is dissimilar to the Cowardin scheme; thus it provides a useful and applicable base for comparison of the various input data types used. Tables 2 and 3 show the wetland composition in Chanhassen and FDL by Cowardin and MNDNR classes, respectively. Wetland data for the City of Chanhassen were collected during the 2006 Surface Water Management Plan (SWMP) update (described below); data for FDL were derived from a existing wetland inventory for the State of Wisconsin. Laba et al. (2008) used QuickBird imagery to map invasive wetland species. Bowen et al. (2010) used high-resolution aerial images and ancillary data to map playa wetlands in Kansas. Halabisky et al. (2011) used a combination of high-resolution imagery and object-based classifi cation to map semi-arid wetlands. Many other studies have examined issues such as wetland vegetation analysis and coastal wetland mapping with high spatial resolution imagery (Dechka et al., 2002; Ramsey and Laine, 1997; Wei and Chow-Fraser, 2011) .\nRadar imagery has been shown to have utility for wetland remote sensing. Unlike optical sensors, radar sensors operate in the microwave portion of the electromagnetic spectrum and are insensitive to most atmospheric and low light conditions. Radar backscatter is sensitive to soil and vegetation moisture properties and can, to some degree, penetrate the forest canopy and provide sub-canopy vegetation and soil saturation information (Whitcomb et al., 2007) . Because radar is sensitive to moisture, techniques using interferometric analysis of radar data have been shown to identify changes in water levels to within a centimeter (Wdowinski, 2008) . Numerous researchers report that careful selection of the timing of image acquisition with respect to soil moisture levels, radar band(s) to be used, and the combination of radar and optical imagery results in higher wetlands mapping accuracies (Costa et al., 2006; Dobson et al., 1995; Henderson and Lewis, 2008; Hess et al., 1990; Hess et al., 1995; Hess et al., 2003; Kasischke, 1997; Lozano-Garcia and Hoffer, 1993; Ramsey, 1998; Rosenqvist et al., 2004; Wang et al., 1995) . Others caution that radar imagery may be only situationally useful due to the effects of speckle and forest canopy interference on classifi cation results (Corcoran et al., 2012; Li and Chen, 2005) .\nNon-image geospatial data sets may provide valuable information for wetland mapping. Digital Elevation Models (DEM) are commonly used, both for elevation information and a number of topographic derivatives including slope, fl ow accumulation, and probability of soil wetness. Studies on the use of DEMs for land-cover mapping include the effects of DEM resolution on wetland mapping accuracy (Creed et al., 2003) , determination of soil characteristics (NRCS, 2010; Thompson et al., 2001) , use of a depth-to-water index for modeling of wet areas (Murphy et al., 2007) , and the suitability of several DEM derivatives for identifi cation of wetlands (Hogg and Todd, 2007) .\nA large number of studies have focused on the effects of classifi cation algorithm choice on wetland mapping accuracy, with rule-based and decision tree algorithms emerging as strong alternatives to traditional approaches such as maximum likelihood estimation (Bolstad and Lillesand, 1992; Rodriguez-Galiano, 2012) . Hogg and Todd (2007) compared several statistical methods and found the Classifi cation and Regression Tree (CART) algorithm to result in the highest accuracy. Baker et al. (2006) compared the accuracy of Classifi cation Tree Analysis (CTA) and Stochastic Gradient Boosting (SGB) classifi ers and reported that the SGB method performed best. Liu et al. (2008) used a decision tree approach to successfully map mangrove forests. Rover et al. (2011) determined hydrologic function of wetlands using a decision tree classifi er. Li and Chen (2005) , Parmuchi et al. (2002) , and Phillips et al. (2005) developed rule-based wetland mapping methods for combining inputs from a variety of geospatial sources. In terms of more general (i.e., not wetland specifi c) land-cover/land-use mapping, a notable example is the 2001 National Land Cover Database (NLCD), which was created using a decision tree classifi er with inputs composed of several dates of imagery, topography and topographic derivatives, and other ancillary data sets such as impervious surface maps (Homer et al., 2004) .\n2008 one meter aerial image-based wetland inventory provided by FDL. Note that this latter FDL inventory was used for qualitative purposes only, as it was found to be of insuffi cient quality for either classifi er training or results validation."}, {"section_title": "Data Used", "text": "The data used in this research varied depending on the study area. Data common to both study areas included: National Agriculture Imagery Program (NAIP) images (acquired in summer of 2008, one meter spatial resolution, color infra-red, 5 m horizontal accuracy), US Department of Agriculture (USDA) input dataset(s) into the requested output classes (\"leaves\"). Decision trees require no assumptions about the underlying distributions of the input datasets and are able to use both continuous and categorical data (Breiman, 2001; Friedl and Brodley, 1996; Quinlan, 1993) . As mentioned above, these algorithms have been shown to perform well in land use/ cover mapping. The decision tree used was the See5 software package by Rulequest, Inc., along with the NLCD Mapping Tool developed by MDA, Ltd. Three steps were involved in the decision tree classifi cation: data sampling, data mining/tree creation, and classifi cation.\nThe fi rst step, data sampling, involved assembling training data points and collecting values from the input data layers. Training data for the Chanhassen classifi cation were derived from the city's 2006 SWMP data (described in Accuracy Assessment below). Before the SWMP data were used for training, the polygons were edited to correct for changes resulting from a 2008 highway construction project. Five thousand simple random points were generated throughout the study area in each of wetland and upland areas, for a total of 10,000 training points.\nTraining data for the FDL location were created from manual interpretation of the 2008 NAIP and 2009 leaf-off imagery. A Minnesota Certifi ed Wetland Delineator manually delineated 140 training polygons. The polygons ranged in size from approximately 50 image pixels to 300 pixels. Sample pixels representing the range of wetland and upland types present in the study area were selected from the training polygons using a simple random sampling method. This procedure resulted in a total of 5,412 wetland and upland training samples.\nThe NLCD Sampling Tool ver. 2.0, a utility included in the NLCD Mapping Tool, was used to create an input data fi le for use in See5. The NLCD Sampling Tool extracted values from each input dataset at each sampling point. The utility generated a tabular fi le which contained a row for each sampling point with comma separated values for each input data layer.\nIn the second step, data mining/tree creation, the See5 software package was used to create decision trees derived from the data tables created with the NLCD Sampling Tool. The boost, fuzzy thresholds, and global pruning options were enabled for classifi er construction. The boost option caused See5 to create decision trees using a recursive algorithm, in which results from previous trees were weighted more heavily in subsequent trees. The fuzzy threshold option established upper and lower bounds for each independent variable rather Soil Survey Geographic (SSURGO) maps, and the US National Elevation Data (NED; acquired in 2008, ten meter spatial resolution, vertical accuracy estimated at 2.4 m). The extracted SSURGO drainage class (e.g., \"hydric\" and \"poorly drained\") served as the soil-related input variables. For the Chanhassen study area, additional data used included a lidar-derived digital elevation model (lidar acquired in spring of 2006, three meter spatial resolution, 15 cm vertical resolution). For the FDL area, additional data used included: Radarsat-2 C-band radar imagery (acquired 15 June 2009, \"Fine\" 4.7 m spatial resolution, quad-polarization, backscattering coeffi cients scaled in decibels), and leaf-off digital aerial images (acquired mid-May to early-June 2009, 0.5 m spatial resolution, color infra-red, 3.5 m horizontal accuracy). Though C-band radar imagery is not optimal for wetland mapping under forest canopy, we included such imagery for completeness and because it was available at no cost. We recognize that additional polarimetric processing of the radar imagery may have yielded improved results, but software to perform that processing was not available. All data were projected to the Universal Transverse Mercator coordinate system, Zone 15, NAD83 datum. Both the NED and lidar-derived DEMs were hydrologically corrected before use. Topographic derivatives were computed for the elevation datasets: slope, Compound Topographic Index (CTI), and Curvature. The CTI is a well known measure of the likely wetness of an area. It is computed with the formula CTI = ln (As / tan(B)), where As is the upstream contributing area to the pixel and B is the slope in radians (Gessler et al., 1995) . The d-infi nity fl ow model was used to create the CTI. Curvature indicates local convexity or concavity for each pixel, with positive values indicating concavity, zero values indicating linearity, and negative values indicating convexity (Parsons, 1979) ."}, {"section_title": "Wetland Classifi cations", "text": "Since the focus of this research was to test the effects on accuracy of data type selection and classifi cation scheme rather than classifi cation method, a common classifi cation approach was used throughout the various trials. We chose to use a decision tree classifi er in this research. A decision tree is a supervised algorithm that produces a classifi cation by developing a set of decision points, or nodes, that are created by identifying diagnostic features in the training data. The resulting \"tree\" of nodes is then used to partition the Several classifi cations were performed to determine the effects of various input datasets on classifi cation accuracy (Table 4 ). The fi rst classifi cation was a wetland versus upland discrimination using all of the available data types (e.g., imagery, topography, etc.). Then, areas identifi ed as wetlands were classifi ed at higher thematic detail according to the Cowardin and MNDNR schemes. These wetland type classifi cations were creating using a variety of inputs, including: the available data of all types, the available data without topography, and the NAIP/optical imagery alone. Additional classifi cations in Chanhassen were performed to compare differences between high spatial resolution (3 m) and lower resolution (10 m) topography data as well as differences between the CTI and Curvature topographic derivatives. Additional classifi cations in Fond du Lac were performed to determine the effects of including C-band radar data and leaf-off imagery on the classifi cation accuracy.\nBecause some areas identifi ed as wetland in the initial wetland/upland discrimination may not have been wetlands, upland was included as an output class in the wetland type classifi cations. A small percentage of pixels initially classifi ed as wetland in the wetland/upland classifi cation were than using hard values. When constructing the decision tree, a value between the upper and lower bound was assigned a class by See5. The global pruning option allowed the See5 algorithm to remove (prune) parts of the trees exhibiting relatively high error rates. The results of the data mining processes were decision trees that were used to produce the various classifi cation trials (Table 4) . Decision trees were constructed for use in wetland versus upland classifi cation, wetland classifi cation to the Cowardin class level, and wetland classifi cation using the MNDNR scheme. Additional decision trees were constructed to evaluate the mapping accuracy differences resulting from varying the type and number of input data sets (described below).\nThe fi nal step was to produce the classifi cations. The output classes were those drawn from the training data. The area classifi ed was the geometric intersection of all input datasets. The classifi cations were performed using the See5 Classifi er Tool, a part of the NLCD Mapping Tool. The See5 output included an internal validation done using the input sampling points as a measure of error inherent in the resultant decision tree (i.e., contingency accuracy). Cross-validation was enabled to provide validation estimates using \"out of bag\" sampling. The wet meadow, shallow marsh, and deep marsh classes each had fewer than ten fi eld validation points and so were not included in the accuracy assessment. The See5 software's internal cross-validation process was employed to provide a measure of the agreement of the classifi cations' outputs with the training data. With cross-validation, See5 performed a user-determined number of iterations of decision tree construction (i.e., folds) with a subset of the total training points and used the remainder of the points for validation. In this study, a 10-fold cross-validation was used, in which 10 percent of the training points were randomly set aside and the decision tree was constructed using the other 90 percent of points. Repeated iterations were performed with different subsets of points set aside such that after ten iterations each point had been used once in cross-validation."}, {"section_title": "Results", "text": "The results of this research are summarized in Tables 5  through 14 . Full error matrices are presented for the \"All Data\" scenario for each of the different classifi cation schemes and study areas. Due to space constraints, only the overall percent accuracy is given for the many other trials described in Table 4 . Unless otherwise noted, all of the accuracy assessment results in each study area were compared using the kappa-based z-statistic tests described in Congalton and Green (1999) and were found to be signifi cantly different at an alpha level of 0.05. Although there has been controversy surrounding the kappa coeffi cient (e.g., Foody, 1992; Pontius and Millones, 2011; Stehman and Czaplewski, 1998) , we believe that kappa retains value in thematic accuracy assessment i.e., especially for comparison of error matrices. Table 5 shows the results of the wetland/upland discrimination in the Chanhassen study area using the All Data scenario. The overall accuracy was 93 percent, with low errors of omission and commission. When the decision tree classifi er was trained to identify Cowardin classes rather than the simpler wetland/upland determination (Table 6) , overall performance remained strong at 86 percent; however the user's and producer's accuracies of the PFO class were both relatively low. The MNDNR error matrix is shown in Table 7 . The overall accuracy of this trial was lower than the preceding Cowardin class mapping, at 77 percent. Two of the classes exhibited very high errors of omission and/or commission: hardwood wetland and deep marsh. Tables 8 and 9 show the See5 cross-validation (X-Val) and accuracy assessment (Assess) results for the other trials conducted in the Chanhassen area. The combination of high-resolution optical imagery, SSURGO, topography, and a topographical derivative performed signifi cantly better (as measured by the z-test) than the trials without topographical information; and, much better than the optical imagery and SSURGO data alone. However, the differences between the lidar versus NED trials and the CTI versus Curvature trials were not statistically signifi cant. Thus, the source of the topographic data and the choice of topographic derivative were not important infl uences on the overall accuracies of the trials.\nsubsequently classifi ed as upland in the wetland type classifications and were maintained as such in the accuracy assessment. Areas incorrectly identifi ed as upland were included in the error matrices, but the accuracy of the upland class within the wetland type classifi cations was not assessed. This approach was necessary so that the overall accuracy estimates of the various classifi cation trials would better refl ect the performance of the wetland type classifi cations rather than wetland/upland discrimination."}, {"section_title": "Accuracy Assessment", "text": "The accuracy of each classifi cation was assessed by comparison with ground and image-based reference data. Error matrices were calculated using the methods described in Congalton and Green (1999) . For the Chanhassen pilot area, the city's SWMP was used as the reference data source. In the SWMP, uplands, wetlands, and water features throughout the city were identifi ed and observed in the fi eld. Mapping for all areas within city was completed using a combination of fi eld GPS delineation and image interpretation. A Minnesota Certifi ed Wetland Delineator validated all polygons. Further methodology is described in City of Chanhassen (2006). To create the reference data for this study, a random sample of 10,000 points was generated throughout the city. This sample was independent of the 10,000 samples used in training the classifi ers. Wetland classes were extracted from the SWMP for each point. Wetland polygons in the SWMP with two or more wetland types noted were considered to be the dominant wetland type. A simple random sampling scheme resulted in 7,343 upland points and 2,657 wetland points. Wet features in Chanhassen consisted of water, forested wetlands, and emergent wetlands, as listed in Tables 1 and 2 . Wetland type classifi cation by Cowardin class included water (L, PUB, PAB), emergent (PEM), scrub/shrub (PSS), and forested (PFO) wetlands. Scrub/shrub comprised a very small area of the wetland cover in the study area and contained only fi ve fi eld validation points; therefore that class was not included in the accuracy assessment. The MNDNR classifi cation included water, wet meadow, shallow marsh, deep marsh, shrub wetland, seasonally fl ooded, and hardwood wetland classes. Seasonally fl ooded and shrub wetlands each had fewer than ten fi eld validation points and were removed from the accuracy assessment to maintain statistical validity.\nFor FDL, fi eld reference data were collected 13-17 July 2009 by a team from the University of Minnesota, which was led by a Minnesota Certifi ed Wetland Delineator. A stratifi ed random sampling scheme based on the existing NWI classes was used within wetland types to generate a sample of 250 wetland sites. An additional 150 sites were randomly generated within uplands. Data collected at each site included land-cover/land-use type, vegetative species present, crown closure percent, neighboring land-cover/land-use, panoramic and canopy photographs, and general notes about the site. A total of 195 points was collected during one week of fi eld work. These points were used as reference data for the accuracy assessment for the FDL study area. These reference data were independent of the training polygons used in decision tree development. Wet features in Fond du Lac consisted primarily of forested and scrub/shrub type wetlands. Wetland type classifi cation by Cowardin class included water (L, PUB, PAB), emergent (PEM), scrub/shrub (PSS), and forested (PFO) wetlands. Most of the fi eld validation points were scrub/shrub and forested wetlands, so emergent wetlands were not included in the accuracy assessment due to insuffi cient validation points to create statistically signifi cant error estimates for that class. Wetland type classifi cation by MNDNR included water, wet meadow, shallow marsh, deep marsh, shrub wetland, hardwood wetland, and coniferous wetland. Tables 10 through 14 present the results of the FDL study area trials. Table 10 shows the wetland/upland discrimination using the All Data scenario. Both the overall and most of the user's/producer's accuracies were lower than in the Chanhassen area. We attribute these differences to complexity introduced by the greater variety of wetland types and the large extent of forest canopy in FDL. Tables 11 and 12 show the Cowardin and MNDNR classifi cation results. The class-specifi c accuracy estimates were also generally lower than in Chanhassen. In both schemes, upland class commission errors had greater impacts on the overall accuracy than in Chanhassen. Tables 13 and 14 show cross-validation and overall percent accuracy estimates for the FDL trials. The FDL study area trials included input data types that were not available in Chanhassen, such as spring leaf-off aerial images and Radarsat-2 imagery. As was the case in Chanhassen, the exclusion of topography data and its derivatives had the largest negative impact on mapping accuracy. An unexpected result was that the inclusion of leaf-off and radar imagery had no statistically signifi cant impact on accuracy in any of the classifi cation schemes."}, {"section_title": "Discussion and Conclusions", "text": "The overarching goal of this research was to examine the wetland mapping accuracy effects of varying input data types and classifi cation schemes using high spatial resolution datasets. To that end, several classifi cation trials were performed in two physiographically different study areas. In aggregate, the results from both areas broadly suggest that more and varied input data can improve mapping accuracy, but there were unexpected fi ndings along with those more typically seen in the relevant literature.\nFirst, as expected, including topography information signifi cantly improved classifi cation accuracy across the different classifi cation schemes and the input data trials in both study areas. Since the ability to at least temporarily hold water is a defi ning characteristic of wetlands, topographic position is important to discriminate both wetland versus upland and different wetland types. Two unexpected results were that the source of the elevation information, and the choice of topographic derivative did not have statistically signifi cant infl uences on accuracy. The NED and lidar-derived (\"Hi-Res\") topography data produced similar results, which suggest that in areas like Chanhassen, with relatively low wetland and topographic diversities, the coarser resolution NED (10 m) may be suffi cient. The comparisons of the CTI with Curvature also indicated no signifi cant differences in accuracy, no matter whether the topographic derivatives were computed from the NED or lidar-derived DEMs, or which classifi cation scheme or study area was examined. The CTI is a well known method of determining the wetness potential of an area, but it requires signifi cant computational resources to create for large areas at high spatial resolution. It also requires a hydrologically corrected DEM, while Curvature does not. These results indicate that Curvature may represent a suitable alternative in some situations. Second, the choice of classifi cation scheme had a significant effect on classifi cation accuracy. The relatively simple wetland versus upland discrimination unsurprisingly resulted in the highest accuracy estimates in both study areas. In contrast, the accuracies of the wetland type classifi cations were lower, and the results were not consistent between the study areas. In Chanhassen, the Cowardin and MNDNR accuracy estimates (Tables 8 and 9 : \"Assess\") were signifi cantly lower than the wetland/upland discrimination, but were not as different as in FDL. In Chanhassen, the Cowardin class scheme performed much better than did the MNDNR scheme, while in FDL both type classifi cations' accuracy estimates were low. We attribute these differences to the lower wetland diversity in Chanhassen and the higher diffi culty of mapping the forested wetlands in FDL. Of particular note is that the MNDNR classification, which was developed to be suitable for mapping with remotely sensed data, performed worse than the Cowardin scheme in nearly every classifi cation trial. A likely reason for this discrepancy is that the MNDNR scheme is more thematically detailed i.e., especially in specifying multiple types of emergent wetlands.\nThird, the differences between the internal See5 crossvalidation and the accuracy assessment results raise interesting questions. In Chanhassen, the cross-validation values were much more similar to the accuracy estimates than they were in FDL. This indicates that the out-of-bag sampling performed during See5 classifi cations fairly closely represented the actual accuracies of the Chanhassen results as measured by comparison with the reference data. However, the crossvalidation values in FDL were substantially higher in every combination of trial and classifi cation scheme. These large discrepancies may have been caused by the added mapping complexity in FDL; however another important factor may be that fi eld-based reference data were used to assess the accuracy of classifi cations created with image-based training data. By comparison, in Chanhassen the same dataset was used for training and assessment (though with independent training and reference samples). In FDL, the training data were collected by interpreting aerial images, while the reference data were collected by a fi eld crew over one week. Thus, it is likely that the fi eld team made determinations based on information that was not visible on the aerial images, such as counts of obligate wetland plants. In addition, the image interpreter had access to imagery collected on multiple dates, which may have further increased the effective differences between the training and reference databases. Finally, while the training database contained representatives of all Cowardin and MNDNR classes present in the study area, the fi eld database lacked suffi cient representatives of some classes, which resulted in a small downward bias in the overall accuracy estimates.\nFourth, these results show that the inclusion of leaf-off and C-band radar imagery did not increase classifi cation accuracies in FDL. Based on existing literature, challenges to the use of C-band radar in forested areas were expected. Incorporating derivatives of the radar imagery such as polarimetric analyses may have improved the results, but software to perform such tests was not available. Lack of accuracy improvement with the inclusion of leaf-off imagery was surprising. The FDL area contains a mix of coniferous and deciduous vegetation. Spring leaf-off imagery was expected to allow for better viewing of ground features and wetness in deciduous areas; however both the cross-validation and error matrices results showed no signifi cant change in accuracy with its inclusion. It is possible that both the radar and leaf-off results were affected by the especially dry conditions present in FDL during the time of image acquisition (spring/summer 2009), since normal spring wetness that would have been visible on the imagery may not have been as evident. A further potential complicating factor with both the leaf-off and NAIP imagery is differences in illumination levels of the forest canopy. Such differences can be somewhat ameliorated with smoothing of the imagery; however we chose not to degrade the spatial resolution out of concern that doing so would decrease the mapping accuracies of non-forest classes.\nIn summary, this research suggests the following conclusions related to mapping wetlands with high spatial resolution geospatial data: (a) Mapping accuracy is greatly improved by including topography data with optical imagery; (b) The source of the topography data is less important than its presence or absence; (c) Simple topographic derivatives like Curvature can provide mapping accuracy similar to the more complex and labor intensive CTI; (d) C-band radar and leaf-off imagery did not improve mapping accuracy in an area with signifi cant forest canopy; (e) Simpler wetland classifi cations schemes are more likely to perform well than more complex schemes i.e., even those designed with remote sensing in mind; and (f) Mapping wetlands in forested areas is challenging even with the inclusion of several different geospatial data types."}]