[{"section_title": "Abstract", "text": "Abstract A February 2012 survey of almost 5,000 farmers across a region of the U.S. that produces more than half of the nation's corn and soybean revealed that 66 % of farmers believed climate change is occurring (8 % mostly anthropogenic, 33 % equally human and natural, 25 % mostly natural), while 31 % were uncertain and 3.5 % did not believe that climate change is occurring. Results of initial analyses indicate that farmers' beliefs about climate change and its causes vary considerably, and the relationships between those beliefs, concern about the potential impacts of climate change, and attitudes toward adaptive and mitigative action differ in systematic ways. Farmers who believed that climate change is occurring and attributable to human activity were significantly more likely to express concern about impacts and support adaptive and mitigative action. On the other hand, farmers who attributed climate change to natural causes, were uncertain about whether it is occurring, or did not believe that it is occurring were less concerned, less supportive of adaptation, and much less likely to support government and individual mitigative action. Results suggest that outreach with farmers should account for these covariances in belief, concerns, and attitudes toward adaptation and mitigation."}, {"section_title": "Introduction", "text": "Agriculture is both vulnerable to global climate change and a significant source of the greenhouse gases (GHGs) that are driving climate shifts (Beddington et al. 2012; IPCC 2007) . Agriculture is one of the sectors most affected by climate shifts and associated extreme weather (IPCC 2007; NRC 2010) , with recent events such as floods and drought leading to crop losses, fluctuations in global food and feed prices, and food insecurity for millions of people (IFPRI 2010; World Bank 2012) . At the same time, agriculture is a substantial direct and indirect contributor of the GHGs nitrous oxide (N2O), methane (CH4), and carbon dioxide (CO2). It is estimated that agriculture generates up to 15 % of total global anthropogenic GHG emissions (IPCC 2007) . Because climate change-related threats to agriculture represent threats to quality of life on local and global scales, and agriculture can play a substantial role in GHG reduction, calls for the development and implementation of enhanced adaptation and mitigation strategies for agriculture are increasing in their urgency (e.g., Howden et al. 2007; McCarl 2010 ).\nAn understanding of farmers' beliefs about climate change and attitudes toward adaptation and mitigation is required to inform effective outreach strategies. Recent studies in Scotland (Barnes and Toma 2012) and North Carolina (Rejesus 2012) found that less than half of surveyed farmers thought temperature was going to increase in the future (Scotland) or that climate change has been scientifically proven (North Carolina). A 2011 survey of farmers in one California county found that half of farmers believed that the global climate is changing, but only 35 % agreed that human activities are contributing to that change (Haden et al. 2012) . Results from a 2010 survey of Indiana corn and soybean farmers showed that 46 % of farmers agreed that human activities contribute toward climate change while 35 % thought that climate change was an \"issue invented just to scare people\" (Gramig et al. 2013) . Over 45 % of the surveyed farmers also agreed that climate change would cause more extreme events. A survey of farmers and ranchers in Nevada found that belief in anthropogenic climate change was related to higher levels of risk perception regarding the impacts of climate change in their own lives and more broadly (Safi et al. 2012) .\nFarmer willingness to respond to climate change through increasing adaptive capacity and/or decreasing GHG contributions is largely unknown, with only a handful of studies of limited scope having focused on this important area. Weber (1997) found that Illinois farmers who believed in climate change and associated risks were more likely to adopt adaptive practices. Barnes and Toma's (2012) study of Scottish livestock farmers found that plans to change practices were unrelated to beliefs about climate change. Arbuckle et al.'s (2013) research in the US Corn Belt state of Iowa indicated that farmers who were concerned about the impacts of climate change on agriculture were more supportive adaptive and mitigative action and those who attributed climate change to human activities were more likely to support government action on mitigation. Given the scarcity of literature, conflicting findings, and often highly localized focus of previous research, it is critical to develop an improved understanding of farmer beliefs and concerns about climate change and their willingness to both adapt and mitigate in order to minimize the threats that climate change poses to the sustainable production of food and energy.\nThe research presented in this paper contributes to this literature by presenting data from a survey of corn producers in the U.S. Corn Belt, a region in which over one-third of the global corn supply is grown (USDA-NASS 2011; USDA-FAS 2012) . A primary objective of the survey was to evaluate the relationships between climate change beliefs, concerns about impacts, and attitudes toward adaptation and mitigation activities. Our central hypothesis is that farmer concerns about potential impacts of climate change and support for adaptation and mitigation actions will vary according to beliefs about climate change. The results presented in this paper represent an initial test of that hypothesis."}, {"section_title": "Method", "text": ""}, {"section_title": "Sampling approach", "text": "Data were collected through a stratified random sample survey of farmers from 11 states spanning the U.S. Corn Belt. The geographic scope of the survey comprised \"major crop areas\" for corn and soybean as defined by the U.S. Department of Agriculture (USDA 1994). Our sample was drawn from the USDA National Agricultural Statistics Service (NASS) Census of Agriculture sample frame, which is the most comprehensive and up-todate list of U.S. farmers. The sample frame included only farm operations with greater than 80 acres of corn production and a minimum of US$100,000 of gross sales. Across the 11 states, farm operations with 2007 gross sales of at least US$100,000 represent 27 % of farms with cropland and 78 % of all cropland acres (USDA-NASS 2009).\nThe sample was stratified by 22 six-digit Hydrologic Unit Code (HUC) watersheds. The HUC system is a standardized watershed classification system developed by the U.S. Geological Survey that organizes watersheds in a nested hierarchy by size (USGS 2012). The sample was stratified by watershed because: (1) climate and ecological conditions that vary spatially are expected to influence farmer perspectives on climate change; (2) ecological conditions vary largely by hydrological unit and shape agricultural systems; and, (3) many of the predicted impacts of climate change are hydrology-related. The 22 watersheds are contiguous and cover substantial portions of Illinois, Indiana, Iowa, Kansas, Michigan, Minnesota, Missouri, Nebraska, Ohio, South Dakota, and Wisconsin (see Figure 1 in the supplemental materials). For this paper, we present statistics for the region as a whole.\nThe survey was mailed in February 2012 to 18,707 eligible farmers using a three-wave mailing process: first a survey was mailed, then a postcard reminder, then a final survey to non-responders. Completed surveys were received from 4,778 farmers for an effective response rate of 26 %. Statistical tests for non-response bias at the watershed level detected no meaningful differences between respondents and non-respondents, indicating that our sample is representative of the target population. Because our random sample of farmers is stratified by watershed, it was necessary to account for differences in response probability between watersheds prior to calculating statistics for the region as a whole. The resulting weights are applied in the regional-level analyses presented below (see supplemental materials for details on non-response bias assessment and weight construction)."}, {"section_title": "Survey questions", "text": "Climate change beliefs were measured through a five-category question that measures both belief about the existence of climate change and attribution of causes. To assess farmer perceptions of the potential impacts of climate change on agriculture, we provided a list of climate-related phenomena (e.g., drought, extreme rains) that are predicted to become more prevalent in the Corn Belt (Hatfield et al. 2011; ICCIC 2011) , and asked farmers to rate their level of concern about them as threats to their own farm operations on a four-point scale from \"not concerned\" to \"very concerned.\" To evaluate attitudes regarding key adaptation and mitigation activities, we asked farmers to rate their level of agreement or disagreement with statements that proposed adaptive and mitigative actions by individual, private sector, and public sector actors on a five-point scale from \"strongly disagree\" to \"strongly agree\" (See supplemental materials for tabulated results for each item)."}, {"section_title": "Results", "text": ""}, {"section_title": "Beliefs", "text": "Analysis of distribution among the five belief categories found that 8 % of farmers believed that \"climate change is occurring, and it is caused mostly by human activities.\" A plurality-33 %-believed that \"climate change is occurring, and it is caused more or less equally by natural changes in the environment and human activities. About one-fourth (25 %) selected the category \"climate change is occurring, and it is caused mostly by natural changes in the environment,\" 31 % selected \"there is not sufficient evidence to know with certainty whether climate change is occurring or not,\" and 3.5 % chose \"climate change is not occurring\" (see supplemental materials for a table of these results). "}, {"section_title": "Beliefs and concerns", "text": "As hypothesized, analysis of the relationships between climate change beliefs and perceptions of climate-associated risks found that farmers who believe that human activity is a substantial contributor to climate change expressed significantly more concern about impacts on their farm operations. Figure 1 shows the percentage of farmers in each belief category who reported that they were either concerned or very concerned about longer dry periods and drought, increased heat stress on crops and livestock, more frequent extreme rain events, and increases in saturated soils and ponded water. Chi-square tests indicated that all column proportions were significantly different (p<.05), except where otherwise indicated in the figure."}, {"section_title": "Beliefs and attitudes toward adaptation and mitigation", "text": "Concordant with our hypothesis, similar relationship patterns were found between climate change beliefs and support for basic adaptation and mitigation responses to climate change. Farmers who believed that climate change is occurring and due in large part to human activity were significantly more likely to support both adaptation and mitigation actions (Fig. 2) . Belief that climate change is happening and mostly or equally anthropogenic in nature was associated with higher levels of agreement with the adaptation statements, \"Farmers should take additional steps to protect farmland from increased weather variability\" and, \"I should take additional steps to protect the land I farm from increased weather variability.\" As expected, climate change belief was associated with pronounced differences Fig. 2 Percent agree or strongly agree about adaptation and mitigation actions, by climate change beliefs. All column proportions for all charts significantly different at p<.05 in agreement with the statements \"Government should do more to reduce greenhouse gas emissions and other potential sources of climate change\" and \"I should reduce greenhouse gas emissions from my farm operation.\" Farmers who attributed climate change primarily to human activity were far more likely to agree with those statements than farmers in the other belief categories. Chi-square tests indicated that all column proportions were significantly different (p<.05)."}, {"section_title": "Discussion", "text": ""}, {"section_title": "Beliefs about climate change and its causes matter", "text": "The degree to which farmers' responses varied systematically by their beliefs about climate change is striking. Farmers who believed that climate change is occurring and is caused mostly or equally by humans were more apt to express concern about potential impacts, substantially more supportive of farmer-level adaptive action, and far more likely to support government-and farm-level GHG reduction efforts. However, at 41 % these farmers constitute a minority; the balance of farmers (59 %) expressed much lower levels of concern about impacts, support for adaptive action, and, most markedly, endorsement of GHG reduction."}, {"section_title": "Farmers are concerned about climate-related risks", "text": "Many farmers in the Corn Belt are concerned about the impacts of climate change predicted for this region. Concerns were higher among farmers who believe that climate change is happening and caused mostly by human activities, but large proportions of farmers who do not believe that climate change is occurring or are uncertain also reported that they are concerned or very concerned about drought, high heat, and damaging precipitation ( Fig. 1 ; supplemental materials table 2)."}, {"section_title": "Most farmers support adaptive action", "text": "The majority of farmers in our study area expressed positive attitudes toward efforts to protect land from increased weather variability. Two-thirds agreed that farmers in general should take additional steps toward that goal, and 58 % agreed that they as individuals should do the same for the land they farm ( Fig. 2 ; supplemental materials table 3). Even among farmers who indicated that they do not believe that climate change is occurring there was substantial support, with 45 % and 42 % in agreement with those items, respectively."}, {"section_title": "Few farmers support GHG reduction", "text": "Attitudes toward government-led and farmer-level GHG reduction efforts were far less positive on the whole. Only 23 % of farmers agreed that the U.S. government should do more to reduce GHGs, and the same percentage agreed that they should reduce GHG emissions from their farm operation ( Fig. 2 ; supplemental materials table 3). As expected, support for these two mitigation actions was very low among farmers who do not believe that climate change is occurring, believe it is due to natural changes, or are uncertain."}, {"section_title": "Conclusion", "text": "These first results from our comprehensive study support a key hypothesis that shaped our research design: Corn Belt farmers' concerns about potential climate change impacts and their attitudes toward adaptive and mitigative action vary according to their climate change beliefs. The results point to several important conclusions that can inform research and outreach, and lead to enhanced resilience of Corn Belt cropping systems.\nPerhaps the most striking finding is that farmers' beliefs about climate change and its causes vary considerably, and the relationships between those beliefs, concern about the potential impacts of climate change, and attitudes toward adaptive and mitigative action vary in systematic, predictable ways. This result points to a need for segmented approaches to outreach (e.g., Maibach et al. 2009 ) with farmers. For example, although many climate change assessments call for mitigation of agricultural GHG production (e.g., IPCC 2007), because few Corn Belt farmers support actions to reduce GHG emissions, outreach that focuses on mitigation is not likely to resonate with a majority of farmers. However, many of the best management practices (BMPs) that are most appropriate for reducing vulnerability also have substantial mitigative properties through carbon and nitrogen management (Lal et al. 2011) . Our finding that most farmers support actions to protect farmland suggests that promoting dual-purpose practices could be an effective way to achieve both adaptation to and mitigation of climate change.\nThe analysis presented here represents an important first step in the development of a comprehensive understanding of U.S. Corn Belt farmers' willingness and capacity to adjust their cropping systems in response to climate change. Future analyses will build on the findings presented here by further evaluating the influence of climate change beliefs (including belief, uncertainty, and non-belief) on concerns, attitudes, and behaviors and examining relationships among these and other variables including: current use of/attitudes toward innovative BMPs and risk management strategies; knowledge and use of climate information and tools; and, farm-level enterprise and socio-economic characteristics. In addition, the stratification of the farmer sample by HUC6 watershed will facilitate multilevel regression modeling that controls for the influence of contextual variables such as precipitation and drought on beliefs about climate change, and willingness and capacity to adopt practices that enhance the sustainability of cropping systems across this critical agricultural region. The results of these analyses will inform the development of segmented outreach strategies that more effectively support efforts to meet those goals."}]