[{"section_title": "Abstract", "text": "Background: Frailty is related to adverse outcomes in the elderly. However, current status and clinical significance of frailty have not been evaluated for the Korean elderly population. We aimed to investigate the usefulness of established frailty criteria for community-dwelling Korean elderly. We also tried to develop and validate a new frailty index based on a multidimensional model."}, {"section_title": "Introduction", "text": "Frailty is a state of decreased homeostatic capacity against stress in older adults and reflects physiological age rather than chronological age. By this nature, frailty widely overlaps with functional impairment and comorbidity, but has independent features and prevalence [1] . Moreover, it is an independent risk factor for subsequent mortality, institutionalization, and morbidities such as fall, incontinence, and immobility [2, 3] .\nKorea is known for being one of the most rapidly aging countries in the world [4] . Therefore, frailty has been a critically important public health problem due to its self-aggravating character and socio-economic burden. However, there is limited data regarding the prevalence and outcome of frailty in Korea. In addition, to our knowledge, there was no validated criterion of frailty for use with the Korean population, although the 'Korean frailty index' [5] showed some correlation with Cardiovascular Health Study (CHS) frailty index. Nevertheless, it did not show validity through outcome measures.\nAlthough diverse conceptual models of frailty have been reported, the definition of frailty remains controversial [6] . Previous studies presented various diagnostic criteria for frailty [1, 2, 7, 8] , ranging from a simple question appropriate for busy clinical settings to complex models more suitable for research. There have been attempts to diagnose frailty through phenotype model [1] . On the other hand, a model of the accumulation of deficits [8] has been advocated by another group. Recently, a multidimensional model of frailty (Multidimensional Prognostic Index, MPI) showed substantial validity [9] .\nThe phenotype model of CHS frailty index was originally constructed from an epidemiological study and contains fortuitously chosen items from CHS study such as an activity questionnaire that is not typically used in clinical geriatric evaluation. Two later models for frailty have a quantitative feature and use information acquired from a comprehensive geriatric assessment (CGA). The accumulation of deficits model emphasizes the connected features of clinical deficits [10] , assuming that stability is established by increasing the number of variables. This model is known for its strong predictability for mortality and functional outcome in a community setting.\nOn the other hand, MPI was composed of variables from CGA, which has significant predictability for mortality [9] . The MPI was superior to the accumulation of deficit model and operational criteria in predicting the mortality of hospitalized patients [9] . Nevertheless, the validity of the MPI was less clear for functional outcome.\nOn these backgrounds, we comprehensively evaluated the prevalence and adverse outcomes of frailty in community-dwelling older adults in Korea using established frailty criteria. Furthermore, we developed a novel frailty index which has the characteristics of MPI with variables from CGA, and compared the predictability for clinical outcome from this novel index with the existing phenotypic frailty criteria."}, {"section_title": "Materials and Methods", "text": ""}, {"section_title": "Study Subjects", "text": "The Korean Longitudinal Study on Health and Aging (KLoSHA) has been described in detail elsewhere [11, 12] . Briefly, KLoSHA was a population based prospective cohort study of 992 Koreans 65 years or older residing in the city of Seongnam. The KLoSHA subject group consists of 714 randomly sampled individuals 65 years or older reflecting general elderly population and 278 volunteers 85 years or older. The baseline study was conducted from September 2005 to September 2006 in the Seoul National University Bundang Hospital (SNUBH). This study was conducted according to the Declaration of Helsinki. The Institutional Review Board of SNUBH approved the study protocol. Written informed consent was obtained from all subjects.\nAmong the 992 subjects, 693 participants underwent evaluation including the Short Physical Performance Battery (SPPB) and the handgrip strength test. Of the 693 subjects, 442 participants completed the 5-year follow up evaluation from May 2010 through March 2012. The reasons for follow up loss were unavailable contact (N = 17), refusal of recommended follow-up tests (N = 144), and death before follow up evaluation (N = 90).\nThe baseline characteristics of the subjects who lost to follow up were compared with the subjects who completed the follow up. Subjects who lost to follow up were older, more frail, cognitively worse, and more functionally dependent."}, {"section_title": "Baseline Geriatric Examination", "text": "The baseline examination of KLoSHA includes a broad range of geriatric evaluations. The complete list of evaluation items has been described previously [12] .\nFunctional status. Activities of daily living (ADL) were assessed by the Korean Activities of Daily Living (K-ADL) scale, which includes evaluation of dressing, bathing, eating, getting out of bed, and using the toilet, with score ranging from 7 to 21 points. The instrumental ADL was evaluated using the Korean Instrumental Activities of Daily Living (K-IADL) scale, from 0 to 10 points, concerning grooming, housework, meal preparation, bathing, going to places outside the home, using transportation, shopping, managing money, and making phone calls."}, {"section_title": "Body", "text": "composition, physical activity and performance. To assess body composition, a bioimpedence analysis with Inbody 3.0 (Biospace, Seoul, Korea) was performed with measurements of height and weight. Physical activity was measured by the Baltimore Longitudinal Study of Aging (BLSA) Activities Questionnaire [13] . Physical function was measured by the SPPB [14] . Isometric grip strength was assessed using a handgrip dynamometer (JAMAR hydraulic hand dynamometer, Sammons Preston, Bolingbrook, IL, USA). Cognition and mood. Among many scales used in KLoSHA, the authors used the Korean version of the Geriatric Depression Scale (GDS-K), the Center for Epidemiological Studies depression (CES-D) scale [15] , and the Korean MiniMental State Examination (K-MMSE) [16] ."}, {"section_title": "Frailty Indexes", "text": "CHS frailty index. We used a modified version of the original CHS frailty index (CHS index) [1] , which has been well validated. Frailty was defined by the following components: (1) unintentional weight loss of 3 kg or more for 6 months; (2) weakness of handgrip strength, ranking in the lowest quintile of the study population adjusted for body mass index; (3) exhaustion, shown by answers to the CES-D scale questions ''I felt that everything I did was an effort'' and ''I could not get going'' that were rated ''moderate amount to most of the time during the last week''; (4) slowness, determined by a usual walking speed of 0.6 m/s or less; and (5) low physical activity, ranked in the lowest quintile (400 or less Kcal per week) on the BLSA Activities Questionnaire. The subjects having a score of 0 were considered robust, 1-2 indicated prefrail, and $3 indicated frail condition.\nStudy of osteoporotic fracture (SOF) frailty index. A modified SOF frailty index (SOF index) [2] was used with the following components: (1) unintentional weight loss of 3 kg or more for 6 months; (2) inability to stand from a chair 5 times; (3) reduced energy level indicated by answering ''no'' to the question ''Do you feel full of energy?'' on the GDS-K. Subjects having none of these components were considered to be robust, those having 1 component were considered to be prefrail, and those having 2-3 components were considered to be frail.\nKLoSHA frailty index. We intended to develop a multidimensional frailty index to reflect domains of CGA including physical function, physical performance, cognitive function, mood, and nutritional status. To increase dynamic range and discriminability of the new frailty index, applying weighting for each domain by its clinical significance was planned, rather than simple summation used in accumulation of deficits model. Accordingly, we selected the variables in KLoSHA that reflect these domains and show statistical significance for predicting mortality in the preliminary analysis. Among the variables, SPPB, K-MMSE, serum albumin level, K-ADL and K-IADL were selected. On the other hand, GDS-K was excluded because it failed to show statistical significance for mortality by neither continuous nor categorical fashion. The cut-off points for the K-MMSE [10] score were adapted from the literature. The weighting values of each variable were defined using the coefficients of the Cox proportional hazard model. Considering the intrinsic redundancy of the frailty model, unadjusted coefficients were used. A KLoSHA frailty index (KFI), total score of 1, was made (Table 1 ,2). Thereafter, cut-off values for prefrail ($0.2) and frail ($0.35) were defined by distributions of frailty index and clinical frailty scale of another study [8] for comparisons between KFI with other phenotype models of frailty."}, {"section_title": "Outcome Measures", "text": "All of the participants were flagged for mortality at the National Statistical Office of Korea, which provided data for the date and cause of all deaths occurring until the end of December 2011. We added the mortality data from National Statistical Office of Korea to our dataset using each individual identifier. Functional decline at follow-up was defined as an increment in the K-ADL score. The data on hospitalization after the initial examination was gathered by patient interview at the follow-up assessment."}, {"section_title": "Statistical Analysis", "text": "We used an independent t-test for continuous variables and x2 test for discrete variables to evaluate the characteristics of the participants. Cox proportional hazards models were used to assess the associations between variables and death. The appropriateness of the Cox models was checked by log-log plot. The weighting factor of the KFI was derived from the coefficients of the Cox proportional hazards models. The variables included in fully adjusted Cox proportional hazards models were selected from the baseline data. We used Harrell's c-index [17] for each frailty index to compare the capability of discrimination for mortality. For KFI, bootstrapping of the total study sample was performed 1000 times, and the c-index was calculated. The linear correlation between each index was assessed with Spearman's coefficient. The effect of frail status on subsequent hospitalization and functional decline was evaluated by logistic regression analysis. Receiver operating characteristic (ROC) curves were made with each index and compared for functional decline and hospitalization. The statistical analysis was performed using STATA 12.0 (StataCorp, College Station, TX, USA)."}, {"section_title": "Results", "text": ""}, {"section_title": "Baseline Characteristics and Frailty Status by each Index", "text": "The baseline characteristics, including the anthropometric information, comorbidity, and functional status of 693 subjects, are shown in table 3. The mean age was 75.9 (SD = 8.9) years, and 352 subjects (50.8%) were female. Among the subjects, 143 (20.6%) were oldest-old ($85 years old), 117 (16.9%) were old-old (75-84 years old), and 433 (62.5%) were young-old (65-74 years old).\nAmong the 621 subjects who were evaluated for the CHS index, 82 (13.2% total; 19.2% female, 7.3% male) were frail, and 369 (59.4% total; 60.6% female, 58.3% male) were prefrail. In the SOF index of 663 subjects, 61 (9.2% total; 9.9% female, 8.5% male) were frail, and 328 (49.5% total; 49.1% female, 49.8% male) were prefrail. The KFI was calculated for 668 subjects, showing 104 frail (15.6% total, KFI$0.35; 22.2% female, 9.0% male) and 287 prefrail (43.0% total, 0.20#KFI,0.35; 44.3% female, 41.6% male).\nSpearman's coefficient between the CHS index and the SOF index was 0.252 (p,0.001), that between the CHS index and the KFI was 0.487 (p,0.001), and that between the SOF index and KFI was 20.003 (p = 0.949).\nDuring a mean follow-up of 5.57 years (SD = 0.93), 97 subjects died, 139 experienced hospitalization, and 18 showed functional decline. The subjects with follow-up loss were older (p,0.001) and more frail at the baseline evaluation (p,0.001 with KFI, p = 0.001 with CHS index). They had a higher GDS-K score (p = 0.001), more impaired K-ADL (p = 0.002) and K-IADL (p,0.001), and a worse SPPB score (p,0.001).\nThe correlations between KFI and key variables or age are presented in figure 1 and 2 , respectively. In the subjects who were classified as frail by the 3 indexes, the SPPB score, K-IADL score, subjective health status, and duration of education were worse (all p,0.05). Frail subjects by the CHS index and the KFI were older, had lower muscle mass, albumin levels, and MMSE scores (all p,0.05)."}, {"section_title": "Predictability of Clinical Outcomes by each Index", "text": "Outcomes including mortality, functional decline, and hospitalization were evaluated. As shown in table 2, the SPPB score, K-ADL score, low albumin, and K-MMSE were related to mortality. The frailty status defined by the KFI and the CHS index were correlated with mortality, while frailty from the SOF index was not (Table 4 ). Harrell's c-indexes of each frailty index are shown in Functional decline was analyzed with the frailty index using a logistic regression model. Frailty assessed by the KFI and CHS indexes predicted subsequent functional decline, which was defined by 1 or more increments on the K-ADL score ( Table 6 ). The association between the frailty index and hospitalizations was analyzed using a logistic regression model. Frailty from the KFI and CHS index was related to a subsequent hospitalization ( Table 7) . The ROC curves for functional decline and hospitalization by each index are shown in figure 3 . The KFI had a significantly larger area under the curve (AUC) for functional decline compared to the CHS and SOF indexes (AUC of ROC curve: 0.937, 0.704 and 0.565, respectively. Comparing each ROC curve, p = 0.001 between KFI and CHS, p,0.001 between KFI and SOF, p = 0.069 between CHS and SOF). The KFI and CHS showed no significant difference in the prediction of subsequent hospitalization."}, {"section_title": "Discussion", "text": "In this study, we developed a novel frailty index (KFI) scoring from 0 to 1. To the best of author's knowledge, applying weighting factors for an existing CGA component to create a frailty index is a novel approach. We also showed the prevalence and clinical outcomes of frailty, using existing and novel criteria among a population of Korean community-dwelling elderly people. The KFI showed better predictability in mortality and functional decline compared with the CHS index.\nThe prevalence of frailty in this study is higher than that in other studies conducted with Caucasian and Asian [18] populations. In the original CHS study [1] , the prevalence of frailty was 7.3% for females and 4.9% for males. A study [19] conducted in China used a frailty index ranging from 0 to 1, and showed a frailty index pattern by age and sex similar to that in this study. Because the KLoSHA consists of 22% of volunteers aged 85 or older, the study population in this study is generally older than that in other cohort studies and may show an increased prevalence of frailty.\nAn effective frailty index should have the following characteristics [8] . It should be useful, simple, and brief for use in a clinical setting. The domains and characteristics of the KFI were originally chosen to enable automatic calculation from a previously prepared electronic medical record based on CGA data. Although it is cumbersome for primary physicians to use as brief screening test, clinicians can automatically obtain the KFI with CGA and predict the physiological age and quantified vulnerability of a patient.\nA good frailty index should show a general demographic pattern of frailty. Using the KFI in KLoSHA, a gradually rising frailty index was observed with increasing age. The KFI of females was greater than the age-matched KFI of males and never crossed (Figure 2 ). This phenomenon of more prevalent vulnerability in females is observed in many other studies of frailty [19, 20] . Frailty has features independent of functional impairment or comorbidity, although it is broadly correlated with them. The KFI, ADL, and IADL share significant proportions, having vectors of functional impairment that reflect the phenotypic characteristics of frailty.\nAn effective frailty index may predict adverse outcomes, such as mortality, institutionalization, and functional decline. Using cstatistics, the predictive validity for mortality by the KFI is better than that from the CHS index, which has been validated effectively by larger studies [1, 2, 21] . Interestingly, CHS index lost its predictability for mortality in a fully-adjusted Cox proportional hazards model. By comparing the ROC curves for functional decline and hospitalization of the three indexes, the KFI predicted functional decline better than CHS index, and the KFI prediction for hospitalization was comparable with the prediction of the CHS index.\nAlthough the SOF index was significantly correlated with the CHS index, it could not predict mortality, functional decline, and hospitalization contrary to results from previous studies [2, 9] . In a search by the author, there was no report showing the validity of the SOF index in the Asian population. In this study, significant weight loss of 3 kg for 6 months was not related to mortality using the Cox-proportional hazard analysis (HR = 0.912, 95% CI 0.713-1.167, p = 0.465). Furthermore, only 22 subjects were unable to stand up from their seat 5 times without using their arms. Although the CHS index included the weight loss item, it showed superior predictability for outcome compared to the SOF index. This phenomenon may be explained by the low model stability of the SOF index because it is limited to three components. These findings indicate that the variables chosen in the SOF index may not be appropriate for the elderly in Korea. Accordingly, clinicians should be cautious adopting frailty indexes validated in Caucasians for use with other ethnic groups. Similar to other major studies of frailty, KLoSHA was not originally designed to assess frailty. Therefore, not all of domains routinely measured in CGA were included in KLoSHA. For this reason, authors used SPPB for physical performance and serum albumin level for nutritional status rather than originally intended timed get up and go test and mini-nutritional assessment (MNA), which can be acquired from CGA. Because SPPB is not usually performed as a part of CGA, further studies are needed to replace SPPB with another easier method such as timed get up and go test or usual gait speed for universal application of KFI.\nThis study has several limitations. There were many follow-up losses, especially for the 5-year follow-up examination, with poorer baseline characteristics identified in these subjects. Although we used complete government registry data for death occurrences, the unbalanced follow-up losses may weaken the validity of the followup data for functional status and hospitalization. Furthermore, follow-up examination was limited to 5 year later from baseline evaluation, impeding opportunity to assess geriatric outcomes including fall down, time of functional decline, and institutionalization. Due to the relatively small sample size, bootstrapping was used to cross-validate the c-index for the KFI, rather than a validation cohort. Consequently, the problem of over fitting cannot be completely ruled out. In addition, we used the unadjusted coefficients from Cox proportional hazards model as the weighting value for each component of KFI. Accordingly, this method might compromise the generalizability of the study findings to other population. Another external validation study for KFI is needed to solve this limitation. Nevertheless, KFI predicted functional decline better than CHS index and also could predict hospitalization, showed performance beyond its expected data-driven ability for mortality prediction.\nIn conclusion, we showed the prevalence and outcome of frailty in Korea. Also, we devised a new multidimensional frailty index, which includes domains from the CGA. By comparisons with previously developed phenotype models, the KFI showed its validity as appropriate frailty assessment instrument for Korean elderly population. "}]