[{"section_title": "GLOSSARY", "text": "The following terms are used extensively in the document. While some of the definitions are standard, others are specific to the SESTAT system. *Employed: Includes those who did any work for pay or profit during the survey reference week. *Unemployed: Includes those who did not have a job during the survey reference week, but had actively looked for work in the prior four weeks. *Labor force: Includes those who are employed or unemployed. *Not in labor force: Includes those who had no job during the survey reference week and were not looking for one (e.g. they may be retired, etc.) Highest degree type: Level of highest degree received: bachelor's, master's, doctorate or professional. Highest degree field: Field of study of highest degree. If an individual has two or more degrees at the same highest degree level, the highest degree field will be that of the most recent degree earned. Science and Engineering (S&E): The National Science Foundation has developed a unique definition of S&E. Very broadly, educational fields considered to be S&E include computer and mathematical sciences, life sciences, physical sciences, social sciences, and engineering. Occupational categories considered to be S&E include computer and mathematical scientists, life scientists, physical scientists, social scientists, and engineers. All other educational fields and occupational categories are considered non-S&E by NSF. A more detailed definition of S&E and non-S&E educational fields and occupational categories can be found in Appendix Table 1. Educated in S&E: Includes those who have earned at least one degree (at the bachelor's level or higher) in a science or engineering field. Working in S&E: Includes those who were working in a science or engineering occupation during the survey reference week, regardless of education."}, {"section_title": "SESTAT: A TOOL FOR STUDYING SCIENTISTS AND ENGINEERS IN THE UNITED STATES", "text": "ithin the U.S. population exists a group of individuals generically referred to as scientists and engineers. This group includes both people educated in science and engineering (S&E) fields and individuals who, although not educated in these fields, are working in S&E occupations. They include among their number technicians and technologists, researchers, educators, and managers of the S&E enterprise. Although these workers constitute only a small fraction of the total U.S. labor force, their impact on our society exceeds their number. Scientists and engineers contribute to technological innovation and economic growth, to scientific and engineering research, and to a greater understanding of S&E. Determining the population of scientists and engineers in the U.S. can be dramatically affected by the criteria used to define this group. Educational degree levels and fields, occupational categories, or a combination of these factors may all be taken into account. To better define and understand this population, the National Science Foundation (NSF) developed the Scientists and Engineers Statistical Data System, or SESTAT (`SEE-stat'). SESTAT was designed in response to recommendations of the National Research Council's Committee on National Statistics (CNSTAT). The committee, with support from NSF, was asked in the late 1980s to conduct a comprehensive review of the NSF's surveys and data on scientists and engineers and to propose methods and procedures for increasing the quality and usefulness of the data in the 1990s. As NSF was expecting to draw a new sample of experienced scientists and engineers from the 1990 decennial census, the opportunity was provided to examine the design and operation of NSF's S&E data system. The committee's analyses and recommendations for the data system were presented in their 1989 report Surveying the Nation's Scientists and Engineers: A Data System for the 1990s. As one of its principal proposals, CNSTAT stated: \"We strongly urge that the NSF personnel data system for the 1990s strive to provide information that will permit users to apply their own definitions of the science and engineering population to suit their particular research and analysis purposes within a framework that facilitates cross-comparisons with other widely used data sources. Specifically, we believe that the system should support analysis of the science and engineering community from each of two major perspectives... from the perspective of occupational employment or jobs and from the perspective of academic training or careers.\" The NSF has strongly endorsed this recommendation and it has served as the guiding principle in the design and development of SESTAT."}, {"section_title": "WHAT Is SESTAT?", "text": "SESTAT is a comprehensive and integrated system of information about the employment, educational, and demographic characteristics of scientists and engineers in the United States. It comprises data collected through three national sample surveys supported by NSF: the National Survey of College Graduates (NSCG), the National Survey of Recent College Graduates (NSRCG), and the Survey of Doctorate Recipients (SDR). These surveys are conducted biennially; each is administered to a different sample population of bachelor's and above college degree holders. Although there are individuals in the U.S. who have earned science and engineering related degrees at the associate's degree level or who do not have bachelor's degrees but are working in science and engineering occupations, these individuals are not included in the sampling frames for the three SESTAT surveys."}, {"section_title": "THE NATIONAL SURVEY OF COI EGE GRADUATES", "text": "The NSCG was first administered in 1993 and biennially thereafter to a nationally representative sample of all college degree holders who were identified through the 1990 decennial census. The target population for this survey includes individuals in the United States as of April 1990 with a bachelor's degree or higher in any field, not just the sciences or engineering. Besides capturing people with degrees earned at U.S. institutions, the NSCG also includes college degree holders who earned their degrees outside of the United States but who were residing here in 1990. In 1993, two selected groups from the NSCG were incorporated into the SESTAT database: those with science or engineering degrees, and those without such degrees but working in S&E occupations. These two populations are collectively referred to as the NSCG S&E panel) In 1995 and subsequent rounds of the survey, these same two groups were followed. "}, {"section_title": "THE SURVEY OF DOCTORATE RECIPIENTS", "text": "A third survey, the Survey of Doctorate Recipients, has been sponsored by the National Science Foundation and other ' For 1993, the full NSCG file (which includes all college degree holders, both S&E and non-S&E) is available for analysis. This file can be obtained on CD-ROM, or accessed through the SESTAT web site. 2 federal agencies since the early 1970s. In this survey, a sample of holders of S&E doctorates earned at U.S. institutions are followed throughout their careers from year of degree award until age 75. Every 2 years, a sample of new S&E doctoral degree earners is added to the SDR from another NSF-sponsored survey, the Survey of Earned Doctorates. In 1993, the SDR sample frame included all U.S.-earned S&E doctorates through academic year 1992; the 1995 sample frame includes doctorates earned through the 1994 academic year; the 1997 sample frame includes doctorates earned through the 1996 academic year."}, {"section_title": "THE SESTAT INTEGRATED DATABASE", "text": "The SESTAT database was created by the integration of the S&E Panel of the NSCG, the NSRCG, and the SDR. The SESTAT integrated database captures that part of the science and engineering population who either received a college degree (bachelor's or higher) in an S&E field or those who work in an S&E occupation with a bachelor's degree or higher in any field. This is a broad designation that includes many fields of study, as well as many occupations. The dashed oval on Figure 1 shows the groups of individuals included in the SESTAT integrated database. There are other groups in the U.S. population that can be considered part of the population of scientists and engineers, for example persons in technical occupations without college degrees, who are not included in the SESTAT integrated database. The SESTAT system was developed to provide information on the bachelor's and above population of scientists and engineers, with emphasis placed on those trained at U.S. institutions. The 1993 SESTAT integrated database represents 11,615,200 individuals. This included 11,021,500 persons with S&E degrees, and 593,600 persons without such degrees but working in S&E occupations (table 2). Note: Because after 1993 the SESTAT surveys identify individuals for inclusion at the point of earning an S&E degree from a U.S. institution, two subpopulations of scientists and engineers in the United States are underrepresented in the SESTAT integrated database in 1995 and subsequent survey years: (1) new immigrants with S&E degrees earned outside the U.S. who entered the U.S. labor force after 1990, and (2) people with no S&E degrees working in S&E occupations after 1990 (Box M in the diagram). There are other individuals who could be considered part of the population of scientists and engineering, for example person in technical occupations with two-year degrees or other types of training. These individuals are not included in the SESTAT integrated database, nor are they represented in this diagram. SOURCE: National Science Foundation, Division of Science Resources Studies.   The 245,400 persons without S&E degrees or jobs in the 1995 integrated database represent individuals who had S&E jobs in 1993, but by 1995 had moved to non-S&E jobs, become unemployed, or had moved out of the labor force. Although these cases are shown in the SESTAT integrated database, they no longer fit the population of individuals either educated in S&E or working in S&E. These individuals, along with the 334,100 persons in the 1995 integrated database without S&E degrees but still working in S&E jobs are part of a panel of individuals that are being followed throughout the 1990s. The latter group is described in figure 1 as \"Box M\", and is underrepresented in the SESTAT database after 1993 because the SESTAT surveys do not capture new persons entering S&E occupations who are not educated in S&E fields in this decade. The SESTAT surveys only cover persons who earned S&E degrees outside of the U.S. if they were residing in the country in 1990. Persons who earned S&E degrees outside of the U.S. and then entered after that time are not covered in the SESTAT integrated database. Approximately 84 percent of the individuals in the 1993 and 1995 SESTAT integrated databases (9,793,500 and 10,114,500, respectively) were employed. Among this group, about one-third were employed in science or engineering occupations (3,303,400 in 1993 and 3,185,600 in 1995). Individuals in this group are often referred to as those working in S&E. The remaining individuals were either unemployed, but seeking work (322,200 in 1993 and 249,300 in 1995) or were not in the labor force (1,499,500 in 1993 and 1,672,400 in 1995). Many of the individuals in the 1993 and 1995 integrated databases hold either multiple S&E degrees or have degrees in both S&E and non-S&E fields. There were 11,021,500 individuals in 1993 who were educated in S&E; that number had risen to 11,456,600 by 1995. Approximately three-fourths of these individuals reported that their highest degree was in an S&E field (8,571,000 in 1993 and 8,908,000 in 1995).3 Many workers educated in S&E routinely find occupations in non-S&E fields. Roughly 70% of all S&Eeducated individuals in the labor force were employed in non-S&E occupations (6,490,100 in 1993 and 6,718,600 in 1995). Conversely, but to a lesser extent, non-S&E educated individuals are employed in S&E occupations. In 1993, there were 593,600 non-S&E educated persons working in S&E occupations. In 1995, the SESTAT integrated database included only 334,100 persons in this category.4 2 The 245,400 persons without S&E degrees or jobs in the 1995 integrated database represent individuals who had S&E jobs in 1993, but by 1995 had moved to non-S&E jobs, become unemployed, or had moved out of the labor force. Although these cases are shown in the SESTAT integrated database, they no longer fit the population of individuals either educated in S&E or working in S&E. These individuals, along with the 334,100 persons in the 1995 integrated database without S&E degrees but still working in S&E jobs are part of a panel of individuals that are being followed throughout the 1990s. The latter group is described in figure 1 as \"Box M\", and is underrepresented in the SESTAT database after 1993 because the SESTAT surveys do not capture new persons entering S&E occupations who are not educated in S&E fields in this decade. 3 For individuals with two or more degrees at the same highest degree level (bachelor's, master's, doctorate, professional), the field of the most recently earned degree is considered the highest degree field.   To Order Publications or Forms: Send an e-mail to: pubs@nsf.gov or telephone: (301) 947-2722 111 To Locate NSF Employees: (703) 306-1234"}, {"section_title": "26", "text": "The Foundation provides awards for research and education in the sciences and engineering. The awardee is wholly responsible for the conduct of such research and preparation of the results for publication. The Foundation, therefore, does not assume responsibility for the research findings or their interpretation. The Foundation welcomes proposals from all qualified scientists and engineers and strongly encourages women, minorities, and persons with disabilities to compete fully in any of the research and education related programs described here. In accordance with Federal statutes, regulations, and NSF policies, no person on grounds of race, color, age, sex, national origin, or disability shall be excluded from participation in, be denied the benefits of, or be subject to discrimination under any program or activity receiving financial assistance from the National Science Foundation. Facilitation Awards for Scientists and Engineers with Disabilities (FASED) provide funding for special assistance or equipment to enable persons with disabilities (investigators and other staff, including student research assistants) to work on NSF projects. See the program announcement or contact the program coordinator at (703) 306-1636. The National Science Foundation has TDD (Telephonic Device for the Deaf) capability, which enables individuals with hearing impairment to communicate with the Foundation about NSF programs, employment, or general information. To access NSF TDD dial (703) 306-0090; for FIRS, 1-800-877-8339. "}, {"section_title": "IC", "text": "This document is covered by a signed \"Reproduction Release (Blanket) form (on file within the ERIC system), encompassing all or classes of documents from its source organization and, therefore, does not require a \"Specific Document\" Release form. [E(Thi s document is Federally-funded, or carries its own permission to reproduce, or is otherwise in the public domain and, therefore, may be reproduced by ERIC without a signed Reproduction Release form (either \"Specific Document\" or \"Blanket\").  "}]