[{"section_title": "Abstract", "text": "Objective: To evaluate the association of risk and age at onset (AAO) of Alzheimer disease (AD) with singlenucleotide polymorphisms (SNPs) in the chromosome 19 region including apolipoprotein E (APOE) and a repeatlength polymorphism in TOMM40 (poly-T, rs10524523).\nDesign: Conditional logistic regression models and survival analysis.\nSetting: Fifteen genome-wide association study data sets assembled by the Alzheimer's Disease Genetics Consortium.\nParticipants: Eleven thousand eight hundred forty AD cases and 10 931 cognitively normal elderly controls.\nMain Outcome Measures: Association of AD risk and AAO with genotyped and imputed SNPs located in an 800-Mb region including APOE in the entire Alzheimer's Disease Genetics Consortium data set and with the TOMM40 poly-T marker genotyped in a subset of 1256 cases and 1605 controls.\nResults: In models adjusting for APOE ε4, no SNPs in the entire region were significantly associated with AAO at P Ͻ .001. Rs10524523 was not significantly associated with AD or AAO in models adjusting for APOE genotype or within the subset of ε3/ε3 subjects.\nConclusions: APOE alleles ε2, ε3, and ε4 account for essentially all the inherited risk of AD associated with this region. Other variants including a poly-T track in TOMM40 are not independent risk or AAO loci."}, {"section_title": "T", "text": ""}, {"section_title": "HE ASSOCIATION OF THE", "text": "apolipoprotein E (APOE) polymorphism with lateonset Alzheimer disease (AD) is one of the strongest and most robust genetic risk factors for a common disease. Compared with the common APOE ε3 allele, ε4 increases the risk and lowers the age at onset (AAO) of AD in a dose-dependent fashion whereas the ε2 allele confers a protective benefit. 1, 2 Although the frequency of ε4 varies among different ethnic groups, the ε4/AD association is evident in diverse populations, 3 with a few notable exceptions. [4] [5] [6] The strength of the association is greatly influenced by age and sex. 3 Recent genome-wide association studies (GWAS) have repeatedly reported association signals in APOE and genes in its vicinity, [7] [8] [9] but the evidence favoring additional AD risk variants in this region is much weaker after accounting for the strong linkage disequilibrium that extends over 3 Mb including these other proposed AD loci. 8 Nonetheless, interest in this region remains high because several of these genes have a plausible role in AD pathogenesis.\nRoses et al 10 reported an association between a variable length poly-T polymorphism (\"poly-T\") at rs10524523 in the gene encoding the channel-forming subunit of the translocase of the mitochondrial outer membrane (TOMM40) and risk for and AAO of AD. These investigators used an evolutionary network approach to build phylogenies that provided evidence of selection for variable lengths of the poly-T repeats between cases and controls. The number of poly-T repeats at the rs10524523 locus were grouped into 3 alleles consisting of short (s) (Ͻ21), long (l) (21) (22) (23) (24) (25) (26) (27) (28) (29) , and very long (v) (Ն30). Phylogenetic tree analysis indicated that the APOE ε4 allele tracks with the l allele, whereas the APOE ε3 allele tracks with the s and v alleles. The l allele was associated with a 7-year earlier AAO of AD in a small sample (N=34) of APOE ε3/ε4 subjects. Support for an independent role of TOMM40 in AD was obtained from a study showing association of the v/v genotype with lower performance on learning and lower gray matter volume among 117 APOE ε3/ε3 adults. 11 A more recent study of this polymorphism in a much larger sample failed to confirm the original findings after adjusting for the effect of APOE ε4. 12 In this study, we conducted a comprehensive association study of AD with markers in the APOE region using data from nearly 23 000 subjects assembled by the Alzheimer's Disease Genetics Consortium (ADGC) for a GWAS that identified several new AD risk loci. 8 We also evaluated association with the TOMM40 poly-T polymorphism by direct genotyping of 1256 AD cases and 1605 controls and by analysis in the entire GWAS data set of several poly-T proxy single-nucleotide polymorphisms (SNPs)."}, {"section_title": "METHODS", "text": ""}, {"section_title": "STUDY POPULATION", "text": "The primary sample used was 15 GWAS data sets assembled by the ADGC. Details of ascertainment and diagnostic procedures for each data set have been extensively described elsewhere. 8 Data from a total of 11 840 AD cases and 10 931 cognitively normal elderly controls were available for this study. All subjects were recruited under protocols approved by the appropriate institutional review boards."}, {"section_title": "GENOTYPING", "text": ""}, {"section_title": "GWAS Genotyping", "text": "Genotyping for the 15 ADGC cohorts was performed using various genotyping arrays containing between approximately 310 000 and 1.5 million SNPs for each data set. 8 "}, {"section_title": "APOE Genotyping", "text": "APOE genotypes in the Adult Changes in Thought (ACT) Study, the National Institute on Aging (NIA) Alzheimer's Disease Centers (ADCs), the Multi-Site Collaborative Study for GenotypePhenotype Associations in Alzheimer's Disease Study, the Mayo Clinic, the NIA Late-Onset Alzheimer's Disease Study, and the University of Miami/Vanderbilt University/Mt. Sinai School of Medicine data sets were determined based on allelic combinations of SNPs rs7412 and rs429358. APOE genotyping was performed in the Multi-Institutional Research on Alzheimer's Disease Genetic Epidemiology Study cohort using the Roche Diagnostics LightCycler 480 instrument (Roche Diagnostics) LightMix Kit ApoE C112R R158 (catalog number 40-0445-16) from TIB MOLBIOL. 13 APOE genotypes in the Translational Genomics Research Institute series 2, the Alzheimer's Disease Neuroimaging Initiative (ADNI) Study, the University of Pittsburgh, and Washington University cohorts were obtained by pyrosequencing 14 or restriction fragment length polymorphism analysis. 15, 16 APOE genotypes in the Rush University Religious Orders Study/Memory and Aging Project data set were determined using high-throughput sequencing of codon 112 (position 3937) and codon 158 (position 4075) of exon 4 of the APOE gene on chromosome 19."}, {"section_title": "Poly-T Genotyping", "text": "Three ADGC cohorts were genotyped for poly-T: ACT (290 AD cases, 1271 controls), ADC (831 AD cases, 282 controls), and ADNI (137 AD cases, 162 controls). Poly-T genotypes were determined using a modified short tandem repeat genotyping assay. This assay used a polymerase chain reaction primer set (Ch19_50094815-F: VIC-GCTGACCTCAAGCTGTCCTC that labeled with VIC fluorescent dye and Ch19_50095061-R: GGAGGGACAGGGAAAGAAAA) to amplify a 247-base pair fragment from each subject's genomic DNA. For each polymerase chain reaction, 100 ng of genomic DNA, 12µM primers, 3.75 µL of Qiagen HotStarTaq Master Mix (Qiagen), and 1mM magnesium chloride were mixed together with a final volume of 7.5 µL. Polymerase chain reaction was carried out with a profile of 95°C for 15 minutes and then 30 cycles at 95°C for 30 seconds, 55°C for 30 seconds, and 64°C for 30 seconds. Precise length of the amplified fragments was acquired through an ABI 3130xl Genetic Analyzer and processed with ABI GeneMapper version 4.0 software (Applied Biosystems). To increase calling accuracy of poly-T counts of each fragment, we also cloned the same genomic fragments of 4 control poly-T variants (ie, 13xT, 16xT, 22xT, and 35xT) into a DNA vector (pBluescript; Thermo Fisher Scientific) and used them as internal controls to create bins for fragment size standards. Integrity of the bins was further validated by genotyping poly-T inserts from plasmid combinations (eg, 16 plus 22, 16 plus 35, and 22 plus 35). Spacing of the bins was then fine-tuned accordingly. Typically, each allele was associated with a series of peaks and the highest peak in the series was assigned as the allele of interest. Thus, homozygous and heterozygous individuals will have either 1 or 2 alleles, respectively. The final calling of poly-T counts was then determined via manual inspection and cross-checking of the electropherograms.\nAs a check on genotyping accuracy, we genotyped 352 samples from the NIA Late-Onset Alzheimer's Disease Study included in a previous study of the poly-T polymorphism. 12 There were no discrepancies between the 2 laboratories in calling the s, l, and v alleles. In addition, there was complete agreement in the genotypes for 90 ADNI subjects included in this and the Cruchaga et al 12 studies. One genotype was discordant with the genotype publically available from the ADNI website. Finally, genotypes from 16 subjects were confirmed by genomic DNA cloning and Sanger capillary sequencing independently at the University of Washington and the University of Pennsylvania."}, {"section_title": "GENOTYPE IMPUTATION AND QUALITY CONTROL", "text": "The APOE region was defined as SNPs located between map positions 45 000 000 and 45 800 000 base pairs according to the University of California, Santa Cruz Genome browser (hg19, GRCh37). This region encompasses CEACAM22P and EXOC3L2, which contained previously identified significant association signals (PϽ10 −4 ) without adjustment for APOE genotype. 8 Genotypes for all SNPs in this region were imputed with the Markov chain haplotyping software 17 using reference haplotypes for white subjects in the HapMap phase 2 (release 22) database. This procedure also filled in missing data for the genotyped SNPs. Individuals with high genotyping call rates (Ͼ95%) and SNPs with 95% call rates or better were used as seeds for the imputation procedure. We excluded SNPs with low minor allele frequency (Ͻ2%), SNPs not in Hardy-Weinberg equilibrium (PϽ10 −6 ), and SNPs with potential for undetected strand flips (C/G and A/T coding) to ensure consistency of allele frequencies between the test and reference haplotypes and to improve ARCH NEUROL / VOL 69 (NO. 10), OCT 2012the quality of imputation. Imputation quality was determined as R 2 , which estimates the squared correlation between imputed and true genotypes. We applied stringent criteria for quality control assessment of imputed SNPs (R 2 Ն0.8 in each data set), since inclusion of SNPs with lower-quality imputation may lead to spurious associations. 18 After filtering, 367 SNPs in the APOE region were available for this study."}, {"section_title": "ASSESSMENT OF POPULATION SUBSTRUCTURE", "text": "We examined population substructure in each data set by analyzing tagging SNPs from the genome-wide panels using the smartpca module from EIGENSTRAT software 19 in a manner described previously. 8 The strength of association of the top 10 principal components was tested with the outcome (presence of AD and AAO of AD) and also with the rs10524523 genotype. The top 3 principal components were included in association models to adjust for hidden substructure, though none of the principal components were associated with either presence or AAO of AD at PϽ10 −3 ."}, {"section_title": "GENETIC ASSOCIATION ANALYSES", "text": "Poly-T genotypes were determined in the ACT, ADNI, and ADC data sets as described previously. 10, 11 Association of AD risk with poly-T was evaluated using logistic regression models including a term for poly-T defined as dosage for one of the alleles. We also tested genotype models assigning v/v as the reference genotype. Linear regression was used to test association of poly-T with AAO in the case sample. Models for AD risk included covariates for population substructure within data sets, age (AAO or age at death if deceased and AAO unknown in cases; age at last examination or death in controls), and sex. Population substructure and sex were included in models for AAO. The influence of APOE on the associations with poly-T was evaluated in 2 ways. In the first approach, an additive model with a term for the number of APOE ε4 alleles (0, 1, or 2) was added to the models. Significant SNPs were further evaluated in models including APOE genotype as a covariate and randomeffects models allowing for heterogeneity of the association among data sets. In the second approach, models were evaluated in APOE genotype subgroups; conversely, we assessed the effect of the APOE ε4 allele within the poly-T subgroups. To capture information about association with poly-T in other ADGC data sets, we tested association with genotyped SNPs that were in high linkage disequilibrium (LD) (r 2 Ն0.8) with rs10524523. All regression analyses were conducted using the R statistical package in each data set separately, and the results were meta-analyzed using an inverse-variance method as implemented in the package METAL. 20 The respective influences of the APOE and poly-T loci on AAO were also evaluated by comparing Kaplan-Meier survival curves derived using R for subgroups of AD cases defined by APOE and poly-T genotypes. Association of all other genotyped and imputed SNPs from the APOE region with AD risk and AAO was evaluated in all ADGC data sets using the strategy described earlier. "}, {"section_title": "RESULTS", "text": ""}, {"section_title": "ASSOCIATION OF POLY-T WITH AD RISK AND AAO", "text": "To determine if poly-T genotypes at rs10524523 confer risk for AD or affect AAO for AD, we genotyped 1256 AD cases and 1605 controls from the ACT, ADC, and ADNI cohorts ( Table 1) . The mean AAO in the ACT cohort was about 12 years higher (83.8 years) than that in the ADC (71.2 years) and ADNI (71.7 years) cohorts. The distribution of the poly-T lengths within each APOE genotype subgroup was comparable with the corresponding distributions reported in the original study, 10 and these patterns were similar across data sets (eFigure 1, http: //www.archneurol.com). Nearly all subjects with the s/s or s/v genotypes had APOE genotypes ε3/ε3 or ε2/ε3 (eTable 1). Similarly, there was a very high correlation between heterozygosity for the ε4 and l alleles, and nearly all l homozygotes were homozygous for ε4 (Figure 1) .\nWithout adjustment for APOE ε4, the poly-T l allele was significantly associated with increased AD risk (metaanalysis P value [meta-P] = 3.9 ϫ 10 −33 ), whereas the other alleles were protective (meta-P value: s = 5.9 ϫ 10 −8 and v = 1.9 ϫ 10 −8 ) ( Table 2 and eTable 2). The dosage of the l allele was associated with an increased risk of AD (odds ratio [OR], 2.83; 95% CI, 2.39-3.36), while those of the s and v alleles were protective (s: OR, 0.69; 95% CI, 0.61-0.79; v: OR, 0.68; 95% CI, 0.59-0.78). However, the effect of the l allele on AD risk was greatly diminished after adjustment for the APOE ε4 allele (meta-P = .02; OR, 1.70; 95% CI, 1.09-2.65) and not significant in the ε3/ε3 subgroup (meta-P = .45), suggesting that risk of AD is influenced directly and specifically by APOE geno- type and not the poly-T genotype. The apparent lack of association of ε4 with AD risk in the l-negative subgroup and l with AD in the ε4-negative subgroup is explained by the observation that virtually all persons with the ε4 allele also had the l allele. Thus, because very few AD cases and controls had ε4 but not the l allele, these particular association tests have very little power. Analogously, there was evidence of significant association of the l allele with AAO in the combined sample (meta-P = 1.0 ϫ 10 −8 ) and within each data set without accounting for the number of APOE ε4 alleles (Table 2 and eTable 3). These data show that each dose of the l allele is associated with a 2-year earlier onset of AD symptoms. However, this association was no longer significant after conditioning on the number of APOE ε4 alleles (meta-P = .12). Specificity of the association of AAO with APOE was supported by the lack of association with the l allele in the subgroup lacking ε4 (meta-P = .87) and evidence for a moderate association with the ε4 allele in the subgroup lacking the l allele (meta-P = .022) (eTable 2 and eTable 3). These results suggest that APOE ε4 has an effect on AAO independent of the TOMM40 poly-T l allele, whereas the association of the poly-T polymorphism is more likely due to confounding with APOE.\nThe effect of poly-T on AAO was further examined by survival analysis in each data set (Figure 2 ). Among subjects with AD in the l-negative subgroup, the ε4 allele showed a trend of association with earlier onset, but the effect of the l allele among subjects lacking ε4 was inconclusive because of a small sample size (Figure 2A , C, and E). There were no distinguishable differences in AAO according to poly-T genotype among ε3/ε3 subjects with AD, which is not surprising because few of these individuals had an l allele ( Figure 2B, D, and F) .\nEvaluation of the LD structure in this region revealed that in each data set rs10524523 was strongly correlated only with SNPs in the interval including TOMM40 and APOE (eFigure 2). We identified 5 SNPs (rs157580, rs2075650, rs8106922, rs405509, and rs439401) in high LD with rs10524523 (eFigure 2) and thus considered these SNPs as proxies for poly-T in analyses in the other ADGC data sets, which were not genotyped for rs10524523. None of these SNPs was significantly associated with AD or AAO after adjustment for APOE ε4 ( Table 3) ."}, {"section_title": "ASSOCIATION OF AD WITH SNPs THROUGHOUT THE APOE REGION", "text": "To evaluate the hypothesis that multiple loci in the APOE region influence risk or AAO of AD, we tested association using the entire ADGC sample (eTable 4) with all SNPs spanning the 800-kb region surrounding APOE that encompasses previously reported genome-wide significant findings in several genes. 21 Eight SNPs spanning the entire region were significantly associated with AD risk at P Ͻ .001 in models adjusting for the number of APOE ε4 alleles, and one of these results (rs445925 located between APOE and APOC1) was genome-wide significant (P = 4.1 ϫ 10 −11 ). However, significance of these results was greatly diminished after taking into account heterogeneity across data sets and APOE genotypes including the ε2 allele ( Table 4 ). In the model including all APOE genotypes, nominal significance was observed for 3 SNPs (rs29651, P = .04; rs37451, P = .0063; and rs20756, P = .01), but none of these results remained significant after correcting for the number of tests. No SNPs were significantly associated with AAO at P Ͻ .001 in models adjusting for dose of ε4 (eTable 5)."}, {"section_title": "COMMENT", "text": "Our study of nearly 12 000 AD cases and 11 000 cognitively normal controls was unable to confirm association of disease risk or variation of AAO of AD symptoms with SNPs in any gene in the APOE region other than APOE. Although we observed genome-wide significance with many SNPs in several genes in this region, the residual effect of these variants dissipated dramatically in models adjusting for APOE genotype.\nWe also considered the possibility of an independent effect of the TOMM40 variable repeat length polymorphism (rs10524523), which has been reported as a a Adjusted for population substructure, age, and sex for AD risk and population substructure and sex for age at onset. b Adjusted for population substructure, age, sex, and number of APOE ε4 alleles for AD risk and population substructure, sex, and number of APOE ε4 alleles for age at onset. , and Alzheimer's Disease Neuroimaging Initiative Study (E and F) data sets. The effect of the presence or absence of the TOMM40 long (l) allele at rs10524523 and of the apolipoprotein E (APOE) ε4 allele on age at onset is shown in all subjects (A, C, and E) and in the APOE ε3/ε3 subgroup (B, D, and E). s Indicates short allele and v, very long allele. modifier of AAO, 10 by genotyping and evaluating this association in a subset of 1256 AD cases and 1605 controls. We were unable to replicate the original finding in models adjusting for APOE genotype or in subgroups stratified by APOE genotype, even though we used a much larger data set than others published to date. This result is consistent with negative findings in several other recent studies. 12, [22] [23] [24] [25] Moreover, association findings were also negative for 5 SNPs in high LD with rs10524523 evaluated in the entire ADGC GWAS sample. Although Cruchaga et al 12 found a significantly lower frequency of the rs10524523 v allele in cases compared with controls among APOE ε3 homozygotes in a large case-control series, the effect was in the opposite direction as reported in the original study. 10 In our study, there was no effect in either direction for s/s homozygotes with an APOE ε3/ε3 genotype. In a subset of 733 subjects from the Cruchaga et al study, there was no evidence of association of rs10524523 with cerebrospinal fluid tau or ␤-amyloid 42 levels. 12 Johnson et al 11 reported an association of rs10524523 with lower performance on learning tests and with decreasing gray matter volume in a brain region affected early in AD development in a small sample of APOE ε3/ε3 adult children of subjects with AD, but a study of a larger community-based cohort between the ages of 79 and 87 years was unable to disentangle the confounding effects of the rs10524523 l allele and APOE ε4 on poorer performance of verbal memory and abstract reasoning. 26 Since the association of AD with APOE was established nearly 2 decades ago, 1,2 numerous studies have reported significant associations with other genes in the region surrounding APOE, [27] [28] [29] whereas other studies concluded that these findings are not true independent contributors to AD risk. 30, 31 Attempts to resolve this controversy have been complicated by very strong LD in this region, which contains many biologically plausible candidate genes. 25, 29 However, further insight regarding multiple independent association signals can be obtained from analyses in other populations (eg, those of black African descent) having a narrower LD structure in the APOE region. Tycko et al 32 excluded independent influence of APOE or APOC1 promoter polymorphisms on risk of AD in samples of African American and Caribbean Hispanic individuals. Logue et al 33 identified highly significant associations of AD with 3 markers within 25 kb of APOE including PVRL2 SNP rs6859 (P = 5.39x10 −7 ) and TOMM40 SNPs rs157582 (P = 3.26x10 −6 ) and rs10119 (P = 5.95x10 −7 ) in a sample of 513 well-characterized African American AD cases and 504 ethnically matched cognitively normal controls. However, only rs6859 remained nominally significant (P = .008) after adjustment for APOE genotype, which was very strongly associated with AD (P = 9.69x10 −23 ). Our study has several strengths that lead to more conclusive findings than previous association studies of genes in the APOE region. First, genotypes for the APOE isoforms in all ADGC data sets were determined directly using robust methods, 8 rather than by inference using imputed genotypes for the 2 SNPs that determine APOE genotype. The genotype for 1 of the APOE SNPs (rs429538) imputed in the ADGC data sets using the 1000 Genomes reference panel (October 2011; release ICHG2011) was only modestly correlated (r 2 about 0.5) with the actual APOE genotype (data not presented). Second, our sample size is several-fold larger than those in any previous study of this issue and had sufficient power to detect associations with ORs of 1.2 or greater. 21 Thus, even if there were other loci in this region independent of APOE that influenced AD risk or AAO, we would have detected a signal whereas smaller studies probably could not. Third, we conducted a comprehensive examination of all markers in the region, including the poly-T repeat in TOMM40, and tested multiple models to address confounding with APOE.\nAlthough there is some evidence from gene expression, cell biology, and immunohistochemistry studies supporting a connection of AD to the immediate neighbors of APOE including PVRL2, TOMM40 and APOC1, 31, [34] [35] [36] results of our study weigh heavily against the hypothesis of inherited susceptibility to AD due to common variation in genes in the APOE region other than APOE. Abbreviations: AD, Alzheimer disease; APOE, apolipoprotein E; BP, chromosome position in base pairs; OR, odds ratio under a fixed-effects model; P, meta-analysis P value under a fixed-effects model; RA, reference allele; RAF, reference allele frequency; REM-P, meta-analysis P value under a random-effects model; SNP, single-nucleotide polymorphism; 95% CI, 95% confidence interval under a fixed-effects model.\na Adjusted for population substructure, age, sex, and number of APOE ε4 alleles. b Adjusted for population substructure, age, sex, and APOE genotype.\nARCH NEUROL / VOL 69 (NO. 10), OCT 2012"}]