[{"section_title": "Executive summary", "text": "This white paper proposes a new approach to increasing the number of underrepresented minority (URM 1 ) students who pursue graduate study in astronomy: the establishment of a program to support and incentivize the hiring of astronomy faculty at minority-serving institutions (MSIs), where substantial fractions of the country's URM science and engineering majors earn their bachelor's degrees. Precedents for strategic investments in faculty hiring exist in space sciences and nuclear physics, one of which -the National Science Foundation's Faculty Development in the Space Sciences (FDSS) program -was introduced and extended in response to Solar and Space Physics decadal survey recommendations. A faculty development program would increase the number of URM undergraduates with sustained and meaningful access to astronomy coursework, research opportunities, and broader professional networks, thereby supporting their graduate school attainment. It would also strengthen connections between MSIs and the U.S. astronomy community in ways that would benefit both."}, {"section_title": "Key issue and overview of impact on the field", "text": "The National Aeronautics and Space Administration (NASA), the National Science Foundation (NSF), and the Department of Energy (DOE) are strongly committed to full participation in the scientific enterprise by members of all groups in American society, including those currently underrepresented in particular fields. In NASA's 2018 strategic plan, strategic objective 3.3 (\"Inspire and engage the public in aeronautics, space, and science\") justifies \"proactive efforts to diversify the STEM pipeline to NASA internships and employment,\" while strategic objective 4.4 (\"Manage human capital\") highlights \"targeted outreach and recruitment efforts to increase the diversity of the Agency's internship, fellowship, and early career hiring programs\" as a key strategy. In NSF's 2018 strategic plan, the elaboration of strategic goal 2 (\"Advance the capability of the Nation to meet current and future challenges\") notes NSF's commitment to \"expanding efforts to broaden participation from underrepresented groups and diverse institutions across all geographical regions in all NSF activities.\" The DOE Office of Science (SC) in its Statement of Commitment explains that \"SC's effective stewardship and promotion of diverse and inclusive workplaces that value and celebrate a diversity of people, ideas, cultures, and educational backgrounds is foundational to delivering on our mission.\" Histories of marginalization mean that broadening participation is strongly motivated by ethical considerations, but federal agencies' shared interest here is also extremely practical: in the face of serious scientific and technological challenges that demand an \"all hands on deck\" approach, the U.S. cannot afford to be satisfied with a \"some hands on deck\" reality that fails to take advantage of all of the nation's scientific talents. In the context of astronomy and astrophysics, the imperative of broadening participation has driven efforts in the last decade to lower barriers to advancement at key educational 1 The designation \"URM\" is here taken to encompass (i) Black or African American, (ii) Hispanic American or Latino, (iii) Native American or Alaska Native, and (iv) Native Hawaiian or Pacific Islander. This white paper's terminology sometimes varies to match what is used in published statistics. Our focus on institutions that serve African American and Hispanic American students is a consequence of the more accessible statistics on such institutions, and is not meant to preclude the participation of institutions that serve other URM demographics from participating in the initiative we are proposing. transitions, e.g., by de-emphasizing GRE scores in graduate admissions (Miller & Stassun 2014; American Astronomical Society 2016), and to formulate and actuate a new set of \"Nashville Recommendations\" for improving the inclusiveness of the field. Reflecting this greater community attention to issues of diversity, equity, and inclusion, and in contrast to its 2010 analog, the Astro2020 charge explicitly requests \"specific, actionable and practical recommendations to the agencies and community\" that address (among other state-of-theprofession concerns) \"workforce and demographic issues in the field.\" This white paper proposes that the Astro2020 decadal survey endorse a new initiative in support of astronomy faculty hiring at minority-serving institutions (MSIs), with the goal of increasing the number of underrepresented minority (URM) students who pursue graduate study in astronomy. We begin by noting the following facts: • URM astronomy Ph.D. students are underrepresented not only relative to the general U.S. population, but even relative to Ph.D. students in the physical sciences. Table 1 summarizes four years' worth of data from the NSF Survey of Earned Doctorates for U.S. citizens and permanent residents, revealing that astronomy has a worse underrepresentation problem than the other physical sciences among Hispanic/Latino and (especially) Black/African American Ph.D. students. "}, {"section_title": "Recipients", "text": ""}, {"section_title": "Strategic Plan", "text": "In the last decade, the importance of MSIs for broadening participation in astronomy has been recognized in at least some quarters of the field -as seen in, e.g., the development of the California-Arizona Minority Partnership for Astronomy Research and Education (CAMPARE) program 6 to place California State University and community college students in summer research positions, efforts by some astronomy Research Experiences for Undergraduates (REU) programs to undertake coordinated recruiting at HBCUs, and the establishment of institution-to-institution partnerships like the UCSD-Morehouse-Spelman Bridge Program. 7 When astronomy programs are initiated and led exclusively by external partners, however, there can be a risk that an MSI's connection to astronomy will be severed if there are adverse changes on the external side of a partnership. To eliminate this risk and reposition astronomy as a field that is pursued at MSIs themselves rather than elsewhere, we propose the establishment of a program to support and incentivize the hiring of astronomers as MSI faculty members. Helpfully, there are two obvious examples of faculty hiring initiatives in the physical sciences that are available as possible templates: 1. The NSF Faculty Development in the Space Sciences (FDSS) program (current solicitation 19-558 following earlier solicitations 04-582 and 14-506) was established and extended in response to recommendations made by the 2003 and 2013 decadal surveys in Solar and Space Physics. The program's goal is to provide support and incentive for universities to create new tenure-track positions in the space sciences; its mechanism for doing so is to support the salary and benefits of a new tenure-track faculty member for a period of five years, awarding up to $1.5M per institution for 3-4 institutions. Proposals can be submitted by accredited two-and four-year institutions of higher education, and by PIs who have the authority to select and hire a new faculty member. Quoting from solicitation 19-558, \"The proposal shall not designate any candidate for the new faculty position, but a description of the desired skills, background and training of the desired candidate must be included. Particular emphasis will be placed on evaluating the: • Clear articulation of how the faculty member will be integrated into the university program of education, outreach and research. • Plan for space physics curriculum development. • Potential for the faculty position to attract capable students and train future scientists in space physics. • Plan for developing partnerships both within the university and the space sciences community. • Metrics developed to ascertain the success of the program. • Pro-active activities to foster participation by women and underrepresented groups. The proposal must contain a description of how the job search would be carried out. It is required that the search be open and widely publicized.\" 2. The organization(s) responsible for managing the operation of the Jefferson National Laboratory (JLab) on behalf of DOE have for many years provided salary support for the appointment of \"bridged faculty,\" in order to \"build or critically strengthen Jefferson Lab-related research in the nation's universities.\" 8 Individuals hired into these positions are treated as regular, tenure-track faculty members, but are released on a pro rata basis to work on JLab programmatic activities; importantly, these appointments need not be at institutions that are geographically proximal to JLab itself. Both the FDSS and JLab programs involve hiring faculty with specific research interests into a diverse range of institutions. The initiative proposed here, in contrast, would involve hiring faculty with a diverse range of (astronomical) research interests into a specific type of institution. Why do we expect that hiring of astronomers into faculty positions at MSIs would have a positive effect on graduate school attainment? First, we expect astronomers would be able to strengthen undergraduate curricula, e.g., through the development and delivery of handson observing tutorials and calculus-based \"physics of astrophysics\" courses that would give upper-level physics majors a taste of what graduate work in astronomy would be like. Second, astronomers would be able to give new astronomy research opportunities to their students during the academic year, and would be well-positioned to connect their students with astronomy research opportunities at other institutions during the summer. The latter point represents one element of a third benefit, namely, the leveraging of astronomers' professional networks in the community in support of their students' aspirations. The informal knowledge available to someone in the same field -whom to email for help or advice, which high-profile astronomer to invite for a visit, how to pitch an REU or graduate school application, which Ph.D. programs are typically more or less competitive, etc. -can make a huge difference in enabling a student's transition to the next phase of education and research training. Beyond the direct impact on students at an MSI that adds a new astronomer to its faculty, we would argue that there are important benefits of the initiative we are proposing to the field at large. First, by enabling the hiring of astronomers at MSIs, the U.S. astronomy community will be enlarging and broadening itself in an important way. Future decadal surveys aiming to channel the views of \"the community\" would have more ways to include the voices of faculty astronomers from the full spectrum of MSIs, rather than rendering certain types of institutions effectively mute. Second, the opportunity for full multi-year salary support through a faculty development program would provide a bit of extra buoyancy for MSI physics programs struggling to avoid closure by their administrations (see, e.g., Williams 2010;Matthews 2011), and a bit of extra incentive for other MSIs to reinvest in physics programs that may have gone on hiatus. Indeed, many MSIs are not trying to decide between hiring a physicist and hiring an astronomer, but rather between continuing and terminating their physics degree programs. This circumstance motivates aiming for the more ambitious goal of providing full salary and benefit support, rather than the false economy of trying to incentivize faculty hiring with only summer salary or travel support. For readers inclined to ask whether the hire of a single astronomer at a given MSI can really make a difference in student outcomes, we would point to the encouraging example of Jackson State University's meteorology program, which was established with the initial hiring of a single individual (Williams et al. 2006). National Weather Service (NWS) meteorologist Keith Johnson joined the Jackson State faculty in 1978 through a cooperative agreement with the National Oceanic and Atmospheric Administration (NOAA) and spearheaded the early development of the program, which ultimately benefitted from additional faculty hires. As of 2015, Jackson State was the alma mater of one out of every three African Americans holding B.S. degrees in meteorology, and of 30% of the African American meteorologists employed by the NWS. 9 This history reflects the degree to which a single, strategic MSI faculty hire in a new field can have significant positive effects on both the institution and the field, extending over timescales of decades."}, {"section_title": "Organization, partnerships, and current status", "text": "The initiative proposed here has not been discussed with NSF or with other possible funders. Informal contacts with faculty at multiple MSIs have yielded positive reactions, and a majority of the authors of this white paper are MSI alumni/ae. Some care should be taken in structuring the initiative so that it is welcoming to the institutions where impacts would be largest. While MSIs offering degrees in physics would have obvious advantages in putting together competitive faculty development proposals, we would discourage restricting a solicitation to only such institutions. Depending on a given MSI's strengths, it would be possible to integrate an astronomer onto the faculty of a mathematics, computer science, or engineering department, with many of the same salutary effects on the institution's students. We also recognize the risk of a \"rich get richer\" bias given the institutional diversity of MSIs noted above; to guard against this outcome, we suggest adopting as a rough metric of potential impact in broadening participation the ratio number of URM undergraduates (or URM STEM majors) number of astronomy faculty (1) that would be achieved if a given proposal were to be awarded, also taking into account anticipated near-term retirements. This metric would favor MSIs with large undergraduate (and/or STEM major) URM student populations but no faculty astronomers, over those with large preexisting astronomy faculty cohorts, although the ratio alone should not determine proposal outcomes. Because NSF now has over a decade of experience with the FDSS program, we view it as an attractive template for a standalone faculty development program. The evaluation criteria quoted in §2 above, with \"space physics\" replaced by \"astronomy,\" would indeed be a reasonable starting point for an astronomy/MSI-focused solicitation. We would argue, however, that proposals should also be required to address how a new faculty member would be supported in their development as a researcher and (especially) a teacher once in place, since -as is also the case for students -even the most carefully considered recruitment plan is unlikely to deliver positive outcomes in the absence of a supportive work environment. Looking beyond the FDSS model, the precedent of bridged faculty hiring at JLabwith less direct competition, but more deliberate alignment with a facility's research focus and no strong geographic constraints -represents an alternative framework that could be implemented with the involvement of NSF, NASA, and/or DOE operated facilities."}, {"section_title": "Schedule", "text": "We recommend that one set of MSI faculty hires be funded early in the 2020-2030 decade, so that information about the number and competitiveness of the proposals, as well as hiring (and perhaps tenure) outcomes, will be available as inputs to the 2030 Decadal Survey."}, {"section_title": "Cost estimate", "text": "We estimate a cost commensurate with the existing NSF FDSS program: $4.5 million to support 3-4 new faculty positions for five years, at a level of up to $300,000 per position per year."}]