[{"section_title": "", "text": ". The 2013 crop year saw an estimated 87.2 million acres of corn harvested for grain that yielded almost 14 billion bushels-a 5 billion bushel jump from 2002 (USDA-NASS, 2014). However, the USDA estimated that in 2006 about 65% of cropland did not follow N best management practices (BMPs) (Ribaudo et al., 2011). Increasing NUE can occur by adopting BMPs, increasing N-efficient plant varieties, precision agriculture, and other eco-innovations that can diminish environmental externalities (Mosier et al., 2001;Tscharntke et al., 2012;Ribaudo et al., 2012;Chen et al., 2008). The goal of this article is to examine what factors predict farmer adoption of three N-efficient technologies that have not been extensively studied: N soil testing, plant tissue testing, and N transformation inhibitors. This research uses the most recently available USDA Agricultural Resource Management Survey (ARMS) of corn growers, which provides great detail in all areas of farm management. Analyzing potential factors influencing adoption can result in improvement of policy and educational efforts as well as research on innovations that can reduce nonpoint-source pollution."}, {"section_title": "Background", "text": ""}, {"section_title": "Eco-Innovations in Agriculture", "text": "Labor-saving and productivity-enhancing innovations can reduce marginal cost and as a result increase profit, making adoption of the practices in the farmer's self-interest (Miller et al., 2008). An innovation has five main characteristics: (i) relative advantage, (ii) compatibility, (iii) complexity, (iv) trialability, and (v) observability (Rogers, 2003). A broad classification of agricultural innovations includes mechanical innovations (e.g., improving tractor equipment), biological innovations (hybrid seeds), chemical innovations (more efficient fertilizers), agronomic innovations (new tilling practices), biotechnological innovations (genetically modified organisms), and precision technologies (GPS and variable-rate technology) (Sunding and Zilberman, 1999). Agricultural eco-innovations can more efficiently use inputs, reduce capital and labor, and improve long-term ecosystem health. Adoption of technologies that increase profitability and decrease negative spillovers can thus benefit the farmer and the environment (Pannell, 2008), but environmental innovation does not always inherently increase efficiency and decrease cost. In fact, adoption may increase a farmer's cost and risk depending on the innovation, farm debt, climate, market prices, and existing policies (Knowler and Bradshaw, 2007;Johnson and Lybecker, 2012). By understanding farm management's relationship with environmental degradation resulting from social and economic activities, scientists can focus on \"technical fixes\" that diminish problematic side effects (Fischer, 2001). However, environmentally beneficial innovations can be complicated by the public good nature of the technology and environmental externalities ( Johnson and Lybecker, 2012). Nevertheless, agricultural eco-innovations can create \"win-win\" scenarios, making their adoption extremely important for improving the environment while being a sound financial investment for farm managers (Power, 2010;Pretty, 2008). Three innovations relating to improved NUE are N soil testing, plant tissue testing, and N transformation inhibitors."}, {"section_title": "Management Decisions: Improving N Use Efficiency", "text": "A common tool for increasing NUE is the N soil test, which can use field-level data to help farmers decide on application quantities (Williamson, 2011). This is the oldest and most common of the three technologies being examined (Ribaudo et al., 2012). Soil testing determines the level of available nutrients in the soil (Peters and Laboski, 2013). Nitrogen soil testing predicts the amount of plant-available N in the soil, so preseason and in-furrow side-dressing applications can be more precise (Brouder and Mengel, 2003). The Natural Resource Conservation Service (NRCS) recommends soil nitrate and organic N testing as part of annual nutrient management practices to reduce N loss (USDA-NRCS, 2012). It is recommended that at least one sample per 5 acres be taken, costing anywhere from $20 to $50 for each N soil test or $4 to $10 per acre (MU-Extension, 2012;Rutgers, 2014). For context, the 2014 crop budget for Iowa indicates that N costs per acre are about $82 (Duffy, 2014). Previous 2001 and 2005 ARMS data showed that corn farmers who use soil testing can reduce overall commercial fertilizer application compared with nonadopters (Williamson, 2011). If N soil testing similarly reduced N applications in excess of crop needs, this would improve water quality. Along with detailed soil information, plant tissue testing gives farmers quantitative nutrient content information (Schulte and Kelling, 2013). Samples can be taken at different stages in the growing season, providing in-season feedback on macro-and micronutrients, thus helping to diagnose early health problems and gage the effectiveness of a fertility program (McGinnis et al., 2013). This technique measures the essential nutrients being used by the plant, which the plant cannot attain from soil tests because of weather, chemical factors, and genetic variability (Ma et al., 2005;Schulte and Kelling, 2013). Applying N in the amounts and at the times when the corn crop can utilize it limits losses to the environment. A plant tissue sample will contain leaves from a minimum of 20 randomly selected plants from an area or field of interest. Each analysis typically costs $10 to $30 (McGinnis et al., 2013;MU-Extension, 2012), so costs per acre would be similar to the range indicated for N soil tests. In conjunction with these informative tools, N transformation inhibitors can be an added input to fertilizer applications to decrease volatilization, denitrification, and leaching, thus reducing N losses to the environment (Upadhyay and Tewari, 2011). This practice can be especially valuable for the environment when farmers fall-apply N or when there is wet weather after spring fertilization (Frazen, 2011). For this reason, farmers in warmer, dryer areas like the Plains, South, and West may be less likely to adopt this practice. Nitrogen inhibitors may also be relevant for livestock farmers that apply manure in the fall due to limited storage capacity (e.g., Kyveryga and Blackmer, 2014). Nitrogen transformation inhibitors and controlled-release fertilizer are recommended by NRCS as nutrient management conservation practices (USDA-NRCS, 2012). The three classifications of N transformation inhibitors and controlled-release fertilizer are explained below. Nitrification inhibitors are chemicals that help reduce the transformation of N in the ammonium form to the nitrate form and thus reduce losses of reactive N. These chemicals kill or interfere with the metabolism of bacteria that cause nitrification (Trenkel, 2010). The enzymes that convert ammonium to nitrate are blocked, helping delay the conversion and thus prolonging N in the root zone because nitrate is more mobile and susceptible to leaching. This product is most beneficial on poorly drained, wet soils (Schwab and Murdock, 2010). A common nitrification inhibitor is N-Serve by Dow AgroSciences, which costs an estimated $8 acre -1 (Dow, 2014). Urease inhibitors help to block the enzyme urease from converting urea to volatile ammonia (Trenkel, 2010). Ammonium is converted to ammonia gas in the soil until it reaches equilibrium. When this gas is exposed at or near the surface, the gas can volatilize and be blown away, decreasing the overall N content in the soil and under certain conditions increasing N x O emissions (Upadhyay and Tewari, 2011). Urease inhibitors are particularly beneficial under no-till conditions (Schwab and Murdock, 2010). The products can be applied to anhydrous ammonia and to dry urea (Frazen, 2011). A popular urease inhibitor is Agrotain (Koch Agronomic Services), which also costs about $8 acre -1 , depending on fertilizer application rate ( Jackson, 2012). Controlled-release urea is a urea pellet that is covered in a material that slows the microbial activity around dry urea (Trenkel, 2010). Thickness and imperfections in the coating slow release time and therefore delay plant-available N (Schwab and Murdock, 2010). Poly-coated urea has a polymer coating that releases the nutrient when adequate temperatures and/ or moisture levels dissolve the outer coating. A leading polycoated urea fertilizer is ESN (Agrium), which was introduced in 2007. ESN is priced at around $0.10 lb. -1 higher than uncoated urea (Silva, 2011), or about 20% more. This cost may be offset by reduced N application rates and by the reduced number of applications needed (Schwab and Murdock, 2010)."}, {"section_title": "Adoption and Diffusion of Innovations", "text": "For an eco-innovation, such as urease inhibitors, to positively benefit the environment, it must be adopted. Adoption can be defined as a decision to use an innovation; diffusion is the process by which an innovation is adopted in a society over time (Rogers 2003). Thus, adoption is an individual (micro) concept, and diffusion is an aggregate (macro) concept (Leite and Teixeira, 2012). The adoption and diffusion literature is multidisciplinary. Reviews of relevant research have been published in rural sociology (Prokopy et al., 2008;Rogers, 2003), economics (Pannell et al., 2006;Ruttan, 1997), business (Baptista, 1999), and marketing (Tidd, 2010;Goldenberg et al., 2010) publications. Adoption by individuals depends on expected costs and benefits and on situational factors, which differ among potential adopters. Because of complexity and adopter variability, a variety of factors need to be examined when attempting to model adoption of eco-innovations (Knowler and Bradshaw, 2007;Miller et al., 2008). Literature reviews by Prokopy et al., (2008) and Knowler and Bradshaw (2007) found that many BMP adoption studies showed positive, negative, or insignificant results for commonly studied predictors. Up-front cost of adoption, farm size, fluctuating market prices, operator's age and education level, geographic area, regulations, and perception of environmental issues can be factors in adopting eco-innovations (Kemp and Volpi, 2008;Rogers, 2003;Ribaudo et al., 2012;Pannell et al., 2006). The literature review by Prokopy et al., (2008) concluded that the use of social networks and access to information are critical in increasing farmers' likelihood to adopt. The next section begins with a discussion of some of the specific variables that were used in this study."}, {"section_title": "Materials and Methods", "text": ""}, {"section_title": "Adoption Decision Model", "text": "Explanatory variables used in the model and their hypothesized signs are given in Table 1. In our model, independent variables fall into four main categories: education and information sources, location and farm size, farm practices, and technology. Education and information variables include higher level of schooling and sources of information (e.g., extension agents and fertilizer dealers). These variables assume a link between education and knowledge (Knowler and Bradshaw, 2007) and have been shown to increase the likelihood of adoption of more complex innovations, such as variable-rate technology and GPS guidance (Khanna et al., 1999). However, other similar studies on adoption of agricultural technologies found mixed results for education and information sources (Daberknow and McBride, 1998;McBride and Daberkow, 2003;Saha et al., 1994;Soule, 2001). We expect college-educated farmers to be more likely to adopt than those with less education, especially for soil N and plant tissue testing, which require analysis of information, followed by farmer action. McCann et al. 2014found that manure testing was less likely to be adopted than manure application setbacks, in part due to observability and complexity of the practice. Age is another commonly studied adoption indicator. Older farmers typically have shorter planning horizons (Roberts et al., 2004) and are expected to be less innovative (Rogers, 2003), but the influence age has on adoption probability can vary with the nature of individual innovations (Knowler and Bradshaw, 2007;Torbett et al., 2008). For this study, younger farmers are predicted to have a higher likelihood of adoption of NUEs based on an increased time horizon and innovativeness (Rogers, 2003;McBride and Daberkow, 2003;Khanna, 2001). We expect farmers actively seeking information on N recommendations would also be more aware of NUE technologies. In addition to farmer characteristics and information sources, a variable called HighPrices was added as a proxy for farmer's motivation to plant corn in 2010 instead of another crop. This variable could be positively related to adoption of \"win-win\" technologies because these farmers are focused on increasing profitability, or it could be negatively related to adoption if the practices are viewed as just environmentally friendly. The last variable in this category is federal crop insurance, which is predicted to be positively related to adoption. Federal crop insurance was not subject to environmental compliance in 2010 (Claassen, 2012); however, it can be thought of as a substitute for more N fertilizer application \"insurance\" and may reduce overuse (Mulvaney et al., 2009;Huang et al., 2000;Ribaudo et al., 2011). Location and size variables include regional dummy variables, with the Midwest being chosen as the base because it is the largest corn-producing region. Like similar studies, we expect that our three win-win technologies would have higher adoption rates in regions where they are most profitable (Beckman and Livingston, 2012;Gedikoglu and McCann, 2012). Other adoption studies using ARMS survey data that examined fertilizer management or application techniques found farm location to be a significant factor in management (McBride and Daberkow, 2003;Khanna, 2001;Chang and Boisvert, 2009). Larger farm size and farm income can increase the likelihood of adoption in many cases based on economies of scale and increased ability to bear risk (Khanna, 2001;Roberts et al., 2004). The prediction in our model is that increasing farm size leads to increased likelihood of adoption. Current adoption of certain farm practices can be an important predictor of NUE innovation adoption (Knowler and Bradshaw, 2007). Environmental awareness has been found to be an indicator of likelihood of adoption, especially related to conservation practices, such as no till (Prokopy et al., 2008). Our study hypothesizes that adoption of either conservation or no till practices (ConservationTillage) will be a positive indicator of adoption. This BMP practice can increase soil productivity and decrease time in the field (Knowler and Bradshaw, 2007). Similarly, adoption of filter/riparian buffer strips is also expected to have a positive influence as a proxy for environmental awareness. For farmers using manure, a decrease in NUE adoption is predicted because 92% of corn acres from 2001 to 2010 that used manure did not meet USDA's rate, timing, and method criteria for good N management (Ribaudo et al., 2012). Two practices expected to coincide with adoption of N transformation inhibitors are irrigation and fall fertilizer application. Irrigation creates a heightened need for N preservation after application; therefore, N transformation inhibitors can be beneficial (Halvorson et al., 2010;Chen et al., 2008). Fall N application can also benefit from a slowed fertilizer release because it is applied well before planting season, although the effectiveness may wear off before spring (Schwab and Murdock, 2010). To reduce externalities from agriculture, the federal government has developed conservation programs, such as the Environmental Quality Incentives Program, that subsidize farmers to adopt environmentally friendly practices (Ribaudo et al., 2011). We expect participation in federal or state conservation programs to increase the likelihood of adoption of these practices, captured in the binary variable ConservationPayments. There may also be state or local regulations that require decreased N applications in some areas that would also increase adoption; this is represented by a binary variable, Nreq. Technology-related independent variables can be indicators of willingness to adopt other technologies (Knowler and Bradshaw, 2007). Included in this model are technologies with a range of cost and sophistication. Variable rate application of N can adjust application rates across a field. This technology can be expensive and benefit from economies of scale, but when used increases NUE within the farm system (Khanna, 2001).  Some farmers are planting pretreated seeds that are coated with pesticides, insecticides, and/or nematode treatment; this practice reduces early aerial spraying. Using this technology is expected to positively affect adoption. The last two technology variables are GPS soil mapping and remote sensing technology. Both serve different agricultural management purposes and help represent the farmer's innovativeness. GPS soil mapping means a farmer has done extensive soil testing and has details on soil property variations over the landscape. Remote sensing allows in-season variable N applications at various growth stages (Shaver et al., 2007). By including a variety of technology variables in the model, identifiers for influential factors in NUE technology adoption can be better identified."}, {"section_title": "Data Source", "text": "The ARMS survey is a multiphase survey of farms in the continental United States. The survey covers specific crops on a rotating basis, with major commodities (corn, soybeans, wheat, cotton, dairy, and hogs) being surveyed more frequently than others. The survey is used as an information source for financial, production, and economic conditions of farm households. For adoption research, the in-depth information allows scientists to link field-level descriptors of production, including practice adoption, to the economic characteristics of the farm operation. The survey list is assembled in two ways: randomly from a National Agricultural Statistics Service farmer list and then by selecting farms in certain land use segments of the target survey crop (ERS, 2012). Variables from both sample selections are then cross-checked to make sure there are no duplicates. The survey is completed in three phases by in-person interviews, with Phase 1 being screening. Phase 2 is done in the fall and winter of the reference year and involves collecting data on an individual field and gathering information on inputs, practices, and commodity costs of production (ERS, 2012). Phase 3 is done in the spring of the following year and involves gathering information about cost of production and returns, farm income, expenses, household data, and financial practices. This study uses the 2010 ARMS Corn survey. A 2600-observation dataset was collected with farmers from all five NASS regions. Of this sample, only 1840 surveys were fully completed and could be used. Three dependent NUE variables were selected for this adoption study: N soil testing, plant tissue testing, and N inhibitor/controlled-release fertilizer."}, {"section_title": "Multivariate Probit Adoption Model", "text": "Studies of adoption and factors that influence the probability of adoption commonly use a probit or logit model (Hahn and Soyer, 2005). Focusing on NUE technology, a farmer either adopts (y = 1) or does not adopt (y = 0) a technology, forming the dependent variable. Then, given a variety of factors that influence adoption likelihood for a farmer (x = x 1 ,x 2 ,x 3 ... x k ), the probability of adoption is denoted as p i = P(Y i = 1|x i ) (Greene, 2003). For probit models, we assume p i is given by the standard normal distribution F(x′b). The probit regression is thus: Probit models have been favored for relative ease of computation and modeling of covariance structure (O'Brien and Dunson, 2004;Khanna, 2001). More explanatory variables can then be added to the model, where x = x 1 ,x 2 ,x 3 ... x k and b = b 1 ... b k are coefficients for each corresponding x variable. An analyst can extend the probit model to study adoption of two or more dependent variables. This allows for joint prediction of adoption choices. This paper follows Greene (2003) in developing the multivariate probit model shown below for three dependent variables: y 1 = X 1 b 1 + e 1 , y 1 = 1 if technology 1 is adopted, 0 otherwise y 2 = X 2 b 2 + e 2 , y 2 = 1 if technology 2 is adopted, 0 otherwise [2] y 3 = X 3 b 3 + e 3 , y 3 = 1 if technology 3 is adopted, 0 otherwise The error terms, variance, and covariance are denoted as E(e 1 |X 1 ,X 2 ,X 3 ) = E(e 2 |X 1 ,X 2 ,X 3 ) = E(e 3 |X 1 ,X 2 ,X 3 ) = 0 [3] Var(e 1 |X 1 ,X 2 ,X 3 ) = Var(e 2 |X 1 ,X 2 ,X 3 ) = Var(e 3 |X 1 ,X 2 ,X 3 ) = 1 [4] Cov(e 1 e 2 e 3 |X 1 ,X 2 ,X 3 ) = r"}, {"section_title": "[5]", "text": "The first two equations show the error terms as having a multivariate normal distribution where the expected values of the error terms equal 0 and variances equal 1. The r term represents covariance between the error terms. If this is found to be significant, the sign of r indicates the direction of the correlation (Greene, 2003;Khanna, 2001). In the case of our technologies, a positive r means that factors outside the model that increase adoption of the first technology increase the likelihood of adopting the second. All three continuous variables (farmer's age, acres in operation, and yield goal per acre) were transformed by a logarithm for the multivariate probit regression. This was done to shrink the range of the variables to converge the algorithm. The ConservationTillage binary variable was created to represent conservation, no till, and minimum till farmers, with 0 representing adoption of none of the three practices. The Filter/Buffer variable was combined in a similar manner, where 1 represents farmers with field strips, filter strips, or riparian buffers to protect water quality, and 0 represents nonadoption. The remaining variables are binary and were not altered from the original USDA ARMS dataset."}, {"section_title": "Results", "text": "Summary statistics for the 1840 observation dataset are found in Table 2. Approximately 21% of farmers conducted N tests on soil. Adoption rates of plant tissue testing and N inhibitor/controlled-release fertilizer were lower with 3 and 10% of farmers, respectively. For the primary operators, the average age was around 55, with approximately half of those operators having received some college education. Four distinct information sources were examined: contractor, consultant, extension agent, and fertilizer dealer. About 27% of farmers said they received N recommendations from their fertilizer dealer, whereas over half of those surveyed said they did not receive any N fertilizer recommendations. A majority of the corn farmers in the survey (n = 1071) were from the Midwest region, which represents the largest corn-growing region. Smaller corn-growing regions, like the West and South, make up only 4.4% of the survey, whereas Atlantic and Plains regions make up 37%. The mean operating field size was 1030 acres. Due to confidentiality requirements, minimum and maximum values are not reported but were examined. Field and fertilizer practices varied. Conservation, no till, or minimum tillage practices were adopted by 974 of the 1840 farmers (53%). The percentage of farmers receiving conservation payments and/or leaving room for field buffer strips and riparian grass filters was fairly low (12 and 14%, respectively). In certain areas of the country, it is difficult to get fertilizer on the field in the spring due to late winters and wet springs. Fall fertilizer is applied by some farmers in these growing conditions. Approximately 19% of those surveyed applied 40% or more of their N fertilizer in the fall. Only 4% of farmers indicated a reduced N requirement. Corn famers applying manure made up 36% of the dataset. Ribaudo et al. (2012) indicated that the percentage of corn farmers using manure had increased somewhat between the 2005 and 2010 crop years. Direct comparisons are not possible because Ribaudo et al. (2012) used ARMS expansion factors to generalize their results to the U.S. corn sector. In the survey, 77 farmers indicated they had a reduced N requirement; all of them used manure as a fertilizer. In the estimated correlation matrix, these two variables are positively correlated at the 0.6 level (anything above 0.5 is problematic [Greene, 2003]). Every farmer who applied more than 40% of his/her crop fertilizer in the fall used manure, which may indicate limited manure storage capacity of the farmers or of those from whom the farmers receive the manure. These variables were positively correlated. Looking at these two statistics in reverse, of the 664 manure users, 54% applied fertilizer in the fall, and 12% indicated they had a reduced N requirement. Due to the correlations, manure was removed from the multivariate probit regression. The four technologies used as explanatory variables were adopted at different rates. Variable-rate fertilizer was used by only 121 out of 1840 farmers (7%). However, using pretreated seed was widely adopted (50%). The two field mapping variables, GPS soil maps and remote sensing, were used by 11 and 6%, respectively."}, {"section_title": "Multivariate Regression Results and Discussion", "text": "The null hypothesis for this regression is that the three dependent variables are uncorrelated. Table 3 shows r estimates for adoption using a multivariate probit approach. The estimated correlation coefficient parameters show that Viewed from the other direction, plant tissue testing seems to be a practice that may be part of a sequential adoption process so that educational efforts to promote it to groups who have not yet adopted N soil testing may be ineffective. Given the wide variety of explanatory variables in the model, we examined correlation coefficients for pairs of variables and tested for multicollinearity in the regressions as a whole. The absolute values of the correlation coefficients were all <0.4 (after excluding manure). The individual regressions found no multicollinearity problems using variance inflation factor (VIF). The VIF for all variables in the model was <2.7, whereas a VIF of ≥10 indicates that a variable may be deemed a linear combination of other independent variables in the model (Chen et al., 2003). For models with categorical dependent variables, the traditional ordinary least squares measure of fit, R 2 , cannot be used. In addition, the regressions have categorical independent variables, so the appropriate measure is the max-rescaled R 2 value, a likelihood-based measure that is calculated by SAS (Stokes and Davis, 2009). The measure ranges from 0 to 1, with higher values indicating better fit. Max-rescaled R 2 values for the three individual probit regressions ranged from 0.193 for N soil testing to 0.164 for the other practices (Table 4). For this model, the coefficient values measure the conditional probability changes in adoption, given the level of the other ** Significant at the 0.01 probability level. † Merged Phase II and Phase III ARMS data for corn producers for 2010 were used. ‡ Significant at the 0.1 probability level. independent variables. Explanatory variables related to education and information sources had varied significance across the three dependent variables. Natural log of age was negatively associated with N soil testing (p < 0.01) and N inhibitors (p < 0.05). This is in line with our hypothesis that older farmers are less likely to adopt these technologies. Higher education level was insignificant for all three technologies. Five distinct categories of potential information sources for N recommendations were included from the ARMS survey: extension agents, contractors, crop consultants, fertilizer dealers, and a category indicating the farmer received no recommendation. Compared with the base category of consultant recommendations, N soil testing was positively related to contractor recommendations and negatively related to fertilizer dealer recommendations. Getting recommendations from fertilizer dealers was also negatively related to adoption of plant tissue testing (p < 0.10). Fertilizer dealers have an incentive to sell more-not less-N fertilizer. However, educational efforts aimed at fertilizer dealers regarding N inhibitors may be fruitful because this may increase their revenue and may have positive environmental impacts. The coefficient for \"no N recommendation\" was negative and significant for all three dependent variables compared with the base category (for N soil testing and N inhibitors it was significant at the p < 0.01 level). This fits with our prediction that farmers would be less likely to adopt NUE technologies if they did not seek outside recommendations. Reaching these farmers through standard extension and educational efforts is unlikely to be successful. Planting corn due to high prices was significant for all practices, with plant tissue testing being positive and the other two negative. One possibility for this result is that managers are more concerned about maximizing yields when expected prices are high; thus, they are less worried about optimizing N use. Plant tissue testing occurs during the growing season. If expected prices are high or increase during the growing season, farmers could be more likely to test for N or micronutrient stress to make sure that they maximize yield. The strong and contradictory effects of the variable HighPrices need to be investigated in future research. The last variable in the first category is federal crop insurance, which is significant only for plant tissue testing. Some insurance companies require plant tissue testing if farmers are to get a discount for planting geographically appropriate GMO seed (USDA, 2009). The second variable category is location and farm size. Natural log of acres is a proxy for farm operation size and economies of scale. For N inhibitors, ln(acres) was positive and significant at the 0.01 level. None of the coefficients for expected yield per acre was significant. The regression contained four regions, with Midwest as the base. For N soil testing, the four regions in the regression were more likely to adopt than the Midwest, and the results were significant at either the 0.01 or 0.05 level. Drier regions like the Plains, South, and West were negatively correlated with adoption of N inhibitors. This result aligns with the use of N inhibitors in wetter climates (Chen et al., 2008). Plant tissue testing did not have any significant regional coefficients, ceteris paribus. A possible indicator for likelihood of adoption can be adoption of previous innovations, both technologies and practices. Farmers' receipt of some type of state or federal money for conservation was positively associated with adoption of N soil testing (p < 0.05) and plant tissue testing (p < 0.01). This increased likelihood of adoption shows that conservation payments encourage soil and plant testing, as expected. No NRCS funding is available for N transformation inhibitors, so it is not surprising that conservation funding was not associated with adoption of this practice. Conservation tillage/no till was positively associated with plant tissue testing (p < 0.10) and N transformation inhibitors (p < 0.01). These results indicate that farmers who are interested in conservation and improving environmental quality are more likely to adopt these specific NUE practices. In some areas, conservation tillage practices may also result in wetter soils in the spring, which would result in increased denitrification. This N loss could be reduced by the use of N transformation inhibitors. However, filter or riparian buffer strips, fall fertilizer application, and reduced N requirement were all insignificant in predicting likelihood of adoption of any practice, ceteris paribus. The nonsignificant results for the latter two variables are cause for concern because the potential for negative environmental impacts is heightened. Irrigation has a positive effect on N soil testing (p < 0.01) and on N inhibitors (p < 0.05). Farmers who use irrigation tend to have high investment tied to field productivity and are concerned with N retention in soils (Robertson and Vitousek, 2009). Educational programs about nutrient management may be a useful addition to programs about irrigation management, particularly in areas where irrigation is increasing due to drier conditions or when particularly wet springs are expected. Four technologies were chosen as explanatory variables in the model, again acting as a proxy for farmer innovativeness. The use of variable rate fertilizer, a capital intensive technology, showed a positive effect on N inhibitors (p < 0.05). The use of pretreated seed with insecticide, fungicide, and/or nematode coating was also positively associated with N inhibitor adoption (p < 0.01). Nitrogen transformation inhibitors and pretreated seed are additives to traditional farm inputs and represent embodied technologies. This reinforces our previous suggestion that educational efforts for fertilizer dealers may increase adoption of N inhibitors. The use of GPS soil maps was positively associated with adoption of N soil testing (p < 0.01). This shows that managers who have already adopted soil and N testing may be more interested in the additional investment in GPS soil mapping. Finally, remote sensing technology was associated with an increased likelihood of adoption of plant tissue testing and N inhibitors (p < 0.05). This significance shows an added concern for timing-appropriate N by farmers using this technology. It also suggests that remote sensing and plant tissue testing are viewed as complementary technologies rather than as substitutes."}, {"section_title": "Conclusions", "text": "Agriculture is the main source of reactive N emissions into the environment (Ribaudo et al., 2011). Further adoption of NUE innovations is important for U.S. water quality and increased sustainability of agriculture (Pretty, 2008;Ribaudo et al., 2012). Information about the multidimensional factors associated with the adoption of NUE innovations can help shape policy design and tailor outreach by private and government entities. A major finding is that the three N management technologies we examined are not widely adopted by these corn farmers, ranging from 21% for N soil testing to only 3% for plant tissue testing. This is somewhat surprising given that they have the potential to reduce fertilizer costs as well as improve environmental quality. Results of the analysis indicate that adoption of plant tissue testing was positively correlated with N soil testing and N inhibitor or controlled-release fertilizer use. Farmers who adopt plant tissue testing may thus fit the general category of \"innovators\" as described by Rogers (2003). As expected, older farmers were less likely to adopt the technologies (if the effect was significant). All three practices were less likely to be adopted by farmers receiving no N fertilizer recommendations compared with recommendations from a consultant. This result indicates a decreased likelihood of NUE adoption for farmers not actively seeking input on N management. Further research is needed to determine whether information that could be obtained in a passive manner, such as via a radio spot, would be beneficial for this subset of farmers. The internet as a source of N recommendations was not included in the ARMS survey, and this may be especially relevant for the most innovative farmers. For the N soil testing model, all four regions were positive and significant, indicating that those regions were more likely than the Midwest, all else equal, to use this practice. Receipt of conservation payments was positive for N soil testing and plant tissue testing, meaning farmers receiving these payments did follow NRCS suggestions for conservation practices. This, along with some indication of increased NUE practice adoption by farmers using conservation tillage implies that environmental concerns may be a driver for adoption of these win-win practices, although there was no significant effect of having filter/riparian buffers. Given the increasing use of irrigation in the Midwest, the findings on N testing and N transformation inhibitors imply that educational programs oriented to new irrigators may be helpful. Nitrogen inhibitors and controlled-release fertilizers showed a strong connection to current technology implementation, with three of the four innovations being positively associated with adoption of this practice. This study used 2010 ARMS data from the USDA, which gives an in-depth, national representation of corn farmers and their financial and field management practices. The sample was large enough (n = 1840) to help validate our multivariate probit regression results. This dataset is reviewed by USDA workers and policy developers as an indicator of current farm life, which adds to the legitimacy and applicability of the outcomes. However, there are few variables in the survey relating directly to environmental attitudes or personality characteristics relating to innovativeness. This may contribute to the overall low statistical significance of the regression models. Prokopy et al. (2008) indicate that attitudes and behavioral motivations may be important for analyzing farmer conservation behavior. Another reason for the low explanatory power of the models may lie in the fact that variables relating to soil type, drainage, and other locational factors were not included in the model. Regional dummy variables may not capture important differences that occur at a smaller scale. Farmer perceptions about the specific practices may also be important (Adesina and Zinnah, 1993). Further research, including attitudinal and field specific variables, is needed to help explain the drivers of eco-innovation adoption and what measures agribusiness and government should take to increase their use. An unanswered question from our research is whether adoption of these practices results in decreased N use and improved environmental quality. An extension of this research would be to model N application rates as the dependent variable, with the three practices we examined, as well as farming system, farm, and farmer characteristics, as explanatory variables. The reduced adoption by farmers who did not receive nutrient recommendations, the negative effect of receiving N recommendations from fertilizer dealers, and the lack of significant effects of information source on N transformation inhibitors implies that educational efforts to increase NUE need to be modified based on the audience and the technology. The lack of increased adoption of NUE technologies among farmers who apply over 40% of their fertilizer in the fall or who are required to reduce N applications is concerning. Both groups of farmers apply manure, so educational efforts directed at livestock farmers or the development of new technologies may be warranted. Several states have implemented low-level fertilizer taxes that have had little impact on farmer usage (Ribaudo et al., 2011), but fertilizer limits have had some positive effects on water quality in Europe (van Grinsven et al., 2012). The national problem of agricultural N pollution highlights tradeoffs between environmental quality and profitability of agriculture. However, new win-win technologies provide a potential way to reduce this conflict. Further research is needed to develop technologies that are cost effective and easy to use. More generally, addressing environmental and natural resource issues involves understanding the physical, biological, and institutional environment to design appropriate technologies and policies (McCann, 2013)."}]