[{"section_title": "Abstract", "text": "Background: Literacy is a vital skill that forms the basis for academic, occupational, and social success. Minority populations, especially immigrant Latinos in the US, have achievement gaps in literacy when compared to the White population. The Reach Out and Read (ROR) program is a pediatric, primary-care intervention designed to promote emergent literacy skills. The objectives of this study were to provide descriptive information at kindergarten on Latino immigrant children's emergent literacy skills and home literacy environments, and correlation data between ROR exposure and emergent literacy skills."}, {"section_title": "Introduction", "text": "Literacy is a vital skill that forms the basis for academic, occupational, and social success [1, 2] . Low-literacy and poor educational attainment have been correlated with poor health outcomes and all-cause mortality [3, 4] . Poor emergent literacy skills predict lower levels of academic achievement later [5] [6] [7] . Children from low-income, immigrant families are at risk for poor emergent literacy skills and reading difficulties [8] . Moreover, a well-documented achievement gap exists in literacy performance among different racial and ethnic groups in the United States (US) [9] [10] [11] . Recent research suggests that the difference in literacy achievement between Latino children and White, non-Latino children is even greater than that between Black and White children, and that the gap appears as early as 4-years [9] [10] [11] [12] .\nHispanics or Latinos are the largest minority group in the US, and the Hispanic population increased 43% between the 2000 and 2010 census [13] . Hispanic children constituted 23% of the population of children from the 2010 census. Based on data from the 2000 Census, 40% of US children in immigrant families are from Mexico [14, 15] . The growth of the Hispanic immigrant population and their lower literacy achievement is a challenge to the US school and health systems. Early literacy support to immigrant Latino families may be an important factor in preparing children for school and for closing the achievement gap.\nfrom an eco-cultural perspective suggests that ecological and cultural factors shape daily family routines, which then shape children's development [16, 17] . The daily family interactions in which children participate can shape their literacy skills and access to literacy activities [18] . When literacy is examined from the family perspective rather than the population level, the diversity of ways in which people in seemingly similar groups (e.g., recent Latino immigrant families) differ in their home literacy-related experiences becomes apparent [19, 20] .\nThe present study examined the home literacy experiences and emergent literacy skills of Latino children in immigrant, low-income families participating in a pediatric early intervention program designed to promote home literacy-related experiences. Shared book reading is critical to the development of literacy skills [21, 22] . Parentchild reading predicts later child outcomes [23] [24] [25] . Families living in poverty read together less frequently and own fewer books [26] [27] [28] . For example, one study estimated a middle-class child may enter first grade having spent 1,000 hours in one-on-one shared reading, whereas a lowincome child averages only 25 hours of shared reading [29] . Despite these large group differences based largely on income, it is likely that there is substantial diversity among low-income families in parentchild reading. Furthermore, programs that promote shared parentchild book reading and more books in the home may be one facet of a multidimensional intervention approach for improving impoverished children's literacy skills.\nThe Reach Out and Read (ROR) program is a pediatric, primarycare intervention designed to promote emergent literacy skills. It has three components: 1) anticipatory guidance about shared book reading is provided by pediatricians during preventive care visits, 2) children receive a book at each well-child check (WCC) between 6 months and 5 years, and 3) volunteers model effective shared book reading techniques. Pediatricians are critical to the intervention because of the importance parents place on guidance from their child's physician [30] , as well as the regular contact between parents and their pediatrician during the pre-school years. ROR has been implemented at more than 4500 clinics since 1989, reaching almost 4 million children in all US states and territories [31, 32] .\nPrevious research evaluating the ROR program demonstrated that parents who participated in ROR were more likely to report reading as a favorite activity, to read aloud to their children, and to have richer home literacy environments than non-ROR parents [33] [34] [35] [36] [37] [38] . Furthermore, children participating in ROR show higher receptive and expressive vocabulary scores than non-ROR children [34, [39] [40] [41] . Several studies suggest a dose-dependent effect, with larger effects observed with greater ROR exposure [38, 41] .\nDespite these promising outcomes, most previous research has relied on parent-report measures and evaluations of preschool-aged children. No research has examined children's school performance after the ROR intervention using objective assessments and teacher-report. The objective of our study was to provide descriptive information on Latino children from immigrant families at kindergarten who participated in a ROR program from infancy. More specifically, we examined the 1) reported home literacy environment, 2) emergent literacy skills and the associations between ROR exposure and emergent literacy skills, and 3) teacher evaluations of literacy skills."}, {"section_title": "Methods", "text": ""}, {"section_title": "Participants", "text": "Participants were drawn from a clinic providing primary care to low-income women and children. Approximately 75% of the children served by the clinic were enrolled in Medicaid, and 25% were uninsured. Inclusion criteria for this study were: 1) child entering kindergarten fall 2008, 2) child gestational age 37 weeks or greater, 3) child had no known major physical or psychological problems and no history of chronic illness, 4) child had the first WCC at or before 6 months, 5) primary language spoken at home was either Spanish or bilingual Spanish-English, 6) child and family participated in ROR from the age of 6 months, and 7) mother provided consent.\nTwo hundred ninety-six children whose birthdates made them eligible to start kindergarten in 2008 were randomly selected from all clinic patients. We attempted to contact families at least three times by phone. Of those eligible, 231 did not have working phone numbers. Of the 65 families contacted, 61 (94%) agreed to participate. Of those, 21 did not come for the research visit and thus, were not included in the final sample. The final sample was comprised of 40 children with a mean age of 64 months (range 59-72 months) at the pre-kindergarten assessment and their mothers. All mothers were immigrants to the US (87% from Mexico) and spoke Spanish as their primary language. All families had incomes that fell below the federal poverty level; average monthly income per person in the household was $251, Median = $250, SD = $176. Other demographic data for children, mothers, and families are shown in Table 1 ."}, {"section_title": "ROR intervention", "text": "The clinic implemented the ROR program in 1998. The clinic ROR program contains the three core components described above and in response to parent interviews before the ROR program was implemented, also includes several cultural adaptations: 1) all attending and most resident physicians are bilingual and speak to parents in both Spanish and English, 2) Spanish books are offered initially, to meet parental preferences to retain a connection with their native language, with bilingual books provided subsequently; 3) physicians discuss the importance of looking at rather than reading books to accommodate parental low literacy, 4) physicians instruct parents in dialogic reading [42] ; 5) the clinic includes a children's library, staffed by a bilingual librarian, to address the barriers to public library use identified in previous research [26] . The library is operated in collaboration with Salt Lake County Library System, contains ~5,000 children's books, provides bilingual story time, a summer reading program, and literacy resources. Children may keep one book each time they visit the library."}, {"section_title": "Data collection", "text": "The University of Utah Institutional Review Board approved this research. All mothers provided informed consent for family and child participation and permission to contact the child's teacher. Medical records were reviewed to document the number of clinic visits and WCC. In the summer before kindergarten entry, children and their mothers participated in an interview in Spanish with a bilingual interviewer, and children completed emergent literacy assessments. Kindergarten teachers completed questionnaires on the children's literacy skills at the end of kindergarten. Mothers and teachers were blind to the purpose of the study."}, {"section_title": "Measures", "text": "Home literacy environment: Mothers were interviewed to assess the home literacy environment. Interview questions were based on previous research [26, 39] and addressed frequency and enjoyment of adult and child book-reading activities. Several open-ended questions focused on the child's favorite activities, the child's bedtime routine, and whether the child had engaged in specific activities the previous day. Each question was coded on the basis of whether reading was mentioned as a favorite activity, as part of the bedtime routine, and as an activity from the previous day. Closed-ended questions followed, including items on book ownership, demographics, ROR exposure, and library use."}, {"section_title": "Evaluation of emergent literacy:", "text": "We sought to objectively analyze emergent literacy prior to the entry of kindergarten and the initiation of structured reading education. Children were interviewed in Spanish to assess familiarity with print in the summer before the start of kindergarten. Each child was asked whether they could name a favorite book, identify the front of a book, identify a word, identify the starting point for reading, and identify the direction to read a book. A writing sample was taken from each child.\nSeveral tests of the Dynamic Indicators of Basic Early Literacy Skills (DIBELS) were administered in the summer before kindergarten entry to provide a standardized measure of early literacy skills. The DIBELS are validated criterion-based measures [43] . Specific goals or benchmarks have been identified that predict reading outcomes [43, 44] . DIBELS scoring identifies children at high, some, or low risk for reading difficulties.\nThe DIBELS Initial Sounds Fluency (ISF) measures phonemic awareness by assessing children's abilities to identify and produce the initial sound in a word presented orally to the child. The DIBELS Letter Naming Fluency (LNF) assesses the extent to which children can correctly label letter names. Children are presented a page of upper-and lower-case letters arranged randomly and asked to name as many letters as they can. The number of letters they named correctly in either Spanish or English in one minute was the child's score on the test. Kindergarten assessments of letter naming fluency predict first-grade reading scores [44] . The ISF and LNF were administered in English. The DIBELS Fluidez en la Segmentación de Fonemas (FSF) was administered in Spanish in order to obtain a measurement in the child's native language. The test assesses a student's ability to segment one, two, or three syllable words into their individual phonemes fluently and is a good predictor of later reading achievement [45, 46] . Fluency in one's native language is associated with better literacy and language acquisition in a second language [47] .\nTeacher assessment of child's emergent literacy skills: In order to gain a more holistic view and to evaluate the child's literacy performance in the classroom setting at the end of kindergarten, teachers completed a modified version of the Kindergarten Teacher Questionnaire -Part C from the Department of Education Early Childhood Longitudinal Study-K (ECLS-K) [48, 49] . Teachers rated children's proficiency (1 = not yet, 2 = beginning, 3 = in progress, 4 = intermediate, and 5 = proficient) on 12 indicators of early literacy (i.e., uses complex sentence structure, understands and interprets text or story, easily and quickly names letters, produces rhyming words, reads simple books independently, uses different strategies to read unfamiliar word, composes stories, understands conventions of print, matches letters to sounds, identifies beginning sounds of words, identifies ending sounds of words, overall literacy skills). Teachers also rated the child's skills on a 5-point Likert scale (from 1 = far below average to 5 = far above average) relative to all other children of the same grade level (\"How would you rate this child's academic skills in each of the following areas, compared to all other children of the same grade level?\" and to other Latino children of the same grade level who spoke English as a second language (ESL) (\"How would you rate this child's academic skills in each of the following areas compared to other Latino children you have taught of the same grade level who speak English as a second language?\". Teachers were told that the study was investigating factors associated with school readiness; teachers were blind to the purpose of the study and to ROR exposure."}, {"section_title": "Data analysis:", "text": "We completed three analyses in this study. First, we completed descriptive analyses for the demographics of our sample, ROR exposure, home literacy environment, emergent literacy skills and teacher evaluations. Second, we created composite scores of children's print awareness, teacher-rated literacy skills, and ROR exposure. In order to reduce the number of analyses relative to sample size, a composite score of children's emergent literacy skills based upon the child interview was created by taking the mean of the following items: child able to 1) identify his or her name 2) write his or her name, 3) identify a favorite book, 4) describe the sequence of events in the favorite book, 5) identify the front of a book, 6) identify a word, and 7) show the place to start reading and the direction to read, Cronbach's α = .61, M = .43, SD = .23, Range = 0 -1. Similarly, a composite variable of teacher-rated literacy skills was created by taking the mean proficiency of the teacher items on the 12 literacy skills, Cronbach's α = .97, M = 3.62, SD = 1.04, Range = 1.50 -4.83. A composite variable of ROR exposure was created by taking the mean of the number of clinic visits, number of WCC, and number of books received, as documented by chart review, Cronbach's α = .81, M = 9.65, SD = 3.56, Range = 1.33 -18.33. Third, partial correlations controlling for child age and maternal education were conducted between the composite score of ROR exposure and children's literacy skills as assessed by the child interview, the DIBELS test, and teacher-report. Child age and maternal education were controlled. Mean Number Well-Child Checks (Range) 9 (1-14)"}, {"section_title": "Results", "text": ""}, {"section_title": "Demographics and ROR exposure", "text": "Mean Number of ROR Books Received (Range) 6 (0-9)\nVisited Clinic Library >5 times (%) 22 (54)"}, {"section_title": "Home literacy environment", "text": "As shown in Table 2 , mothers reported that children enjoyed being read to and book sharing was common. An adult in the home shared books with the child at least three or more times per week in 80% of households. Book sharing began early with 58% of mothers initiating book sharing by 12 months. Reported book ownership indicated 33% of the families owned 3-10 children's books, 21% 11-25, and 46% more than 25."}, {"section_title": "Emergent literacy skills", "text": "In terms of print awareness, during the interview in the summer prior to kindergarten, 76% of children were able to identify a favorite book by name, 68% were able to identify the front of the book, 50% were able to identify a word, and 32% were able to identify the place to start reading and the direction to read. 56% of children were able to write their first name.\nThe results of the DIBELS emergent literacy testing are shown in Table 3 . On the DIBELS ISF, LNF, and the FSF, 37%, 41%, and 45% of the children, respectively, were identified as at high risk for poor reading skills. The same measures identified 21%, 16%, and 21% of children as low-risk."}, {"section_title": "Teacher Evaluations", "text": "Thirty-one teachers (78%) from 26 different schools completed questionnaires to evaluate children's literacy skills at the end of kindergarten (Tables 4 and 5) . Teachers identified over 50% of the children as proficient in easily and quickly naming all upper-and lower-case letters of the alphabet, matching letters to sounds, and identifying the beginning sounds of words. Teachers reported that 60% of the children were proficient or intermediate in reading simple books independently. Only 10% of children were \"not yet\" reading simple books independently.\nWhen teachers rated children's overall literacy skills at the end of kindergarten (Table 5) relative to all children of the same grade, 77% of the ROR children were rated as average, above average or far above average relative to all other children at the same grade level. Teachers also rated 67% of the ROR children as above average or far above average compared to other Latino ESL children."}, {"section_title": "Associations among ROR exposure and children's literacy skills", "text": "Partial correlations were conducted among between the composite score of ROR exposure and children's literacy skills as assessed by the child interview, the DIBELS test, and teacher-report (see Table  6 ). Child age and maternal education were controlled. Greater ROR exposure was significantly associated with phonemic awareness on the DIBELS ISF test and greater understanding of print at kindergarten entry, after controlling for children's age and parents' education levels. Partial correlations indicated no significant associations between Head Start attendance and the child's emergent literacy skills assessed in the clinic, performance on DIBELS, or teacher ratings of literacy skills, controlling for children's age and parents' education levels."}, {"section_title": "Discussion", "text": "Our study builds on previous research describing parental reported outcomes of the ROR program by assessing children's emergent literacy skills using quantitative measures before kindergarten entry and teacher report at the end of kindergarten. The kindergarten performance of this small sample of Latino children participating in the ROR program from infancy was good. Though these children were living in poverty and had other risk factors for poor-school performance, they had good home literacy environments and average or above average literacy skills by the end of kindergarten. ROR exposure was associated with greater print and phonemic awareness prior to kindergarten. Finally, by teacher evaluation, the majority of children in spite of low socioeconomic status, low educational attainment of their mothers, and English as a second language, demonstrated literacy skills that were average or above average levels by the end of kindergarten. Protective factors including family stability, well-child care, and early and consistent participation in the ROR program may have improved the school readiness of these high-risk children.\nLatino or Latino origin is a self-designation made by over 50 million Americans in 2009, [50] 16 million of whom are children, representing 23% of the US child population [50, 51] . Approximately 2/3 of Latino children in the US are either first or second-generation, meaning that they are foreign-born or US-born sons and daughters of at least one foreign-born parent [51] . These children, like those in our study, are more likely to live in poverty, to have parents who did not complete high school, and to speak English less well than White, Black, or 3 rd generation or higher Latino children [9] . These risk factors may contribute to Latinos having the lowest literacy proficiency scores and high school graduation rates in the US [9] . These data have important implications for the US educational and health systems. Programs that support early literacy and take advantage of the strong Latino home and family orientation may be important in mitigating the achievement gap and the poor health outcomes associated with low literacy [9, 52] .\nAlthough the educational achievement gap for Latinos has been documented by age 4 years, a national sample of Latino families demonstrated that Latino infant cognitive development as measured by the Bayley Scales of Infant Development did not differ from other racial and ethnic groups, and parenting behaviors, particularly reading and linguistic engagement, predicted infant developmental outcomes [9, 12, 53 ]. An early literacy intervention such as ROR that is initiated by six months may encourage parenting behaviors associated with cognitive development. In another study from this clinic population, Latino parents expressed their gratitude for the ROR program and the advice given to help prepare their children for school and indicated they made changes in their activities with their children to incorporate the literacy advice given in clinic [54] .\nAlthough the sample was not randomly assigned to the ROR program, all families were living and poverty, nearly half (44%) of the mothers had not completed 8 th grade, and only 38% of children had "}, {"section_title": "YES", "text": ""}, {"section_title": "Parent reports child read to previous day 59%", "text": "Owns more than 10 books 67%\nOwns more than 25 children's books 46%\nReading a favorite activity 42%\nRead to child before bed 42% Parent enjoys reading to child 61%\nChild read to at least 3 times per week 80% Parent reports reading to child 92% participated in a preschool program (Head Start). Thus, it is unlikely that the present sample was advantaged in terms of educational attainment, socioeconomic status, or resources relative to other samples of Latino families. However, the families sampled in our study also had evidence of protective factors. The majority of children evaluated lived in two parent homes. These children had completed 90% of WCC and had participated consistently in ROR interventions since early infancy. These markers of family stability confound our ability to attribute literacy outcomes solely to the ROR intervention.\nDespite the risks of poverty, low maternal education, and English as a second language, our study demonstrated that the home literacy environment, in terms of book ownership and regular parent-child shared book reading, of these Latino children was good. The literacy orientation of study families was strong in that the majority reported initiation of book sharing by age 12 months and reading with the child several times per week. This finding is in contrast to a survey of Latino parents from the same clinic conducted in 1998, before the introduction of the ROR program, where the majority of parents reported that book sharing should begin by age six years [26] . In addition, 59% of mothers reported that their child had been read to the day before and that 44% requested to be read to daily. National surveys have demonstrated that the US average for daily reading is 48% with 59% of children from high income families read to daily compared with 36% of low-income children [55] . The families in our study, though living in poverty, had reading habits more similar to average or high income Americans [55] . Children who are read to more frequently demonstrate significantly higher reading knowledge in the spring of kindergarten and spring of first grade [56] . Finally, nearly half of the families reported owning 25 or more children's books, in contrast to national estimates and a survey in this same clinic prior to the initiation of the ROR program, indicating that significant proportions of low-income families own fewer than 5 books [26, 31] . The ROR program provides ~ 10 books between 6 months and 5 years. The literacy programs sponsored by the library, including story time and summer reading, may have further increased book ownership. Other ROR providers might consider partnerships with public libraries as a beneficial extension of the traditional ROR intervention. This is the first study to describe children who have participated in ROR from infancy as they enter the educational system. The literacy skills identified by teachers, including phonemic awareness and comprehension, predict later reading achievement [57] . Children with greater exposure to ROR showed more print awareness and phonemic awareness than children who had less ROR exposure and these skills may have contributed to their school performance.\nAlthough we do not have a formal control group, several familylevel risk factors have been identified as predictors for poor school performance by the ECLS-K and allow us to make some comparisons. Identified risk factors for poor school performance include 1) having a mother with less than a high school education, 2) living in poverty, 3) living in a single-parent household, and 4) having parents whose primary language is other than English [49] . Every child in our study had two or more risk of these factors for poor kindergarten performance, 77% had 3 or more, and all had parents whose primary language was not English. Thus, the study children would have been predicted to perform poorly on objective measures of literacy and would be expected to perform at a similar or even worse level than Latino children in the ECLS-K lowest quartile. The results of our study are distinctly different than what would be predicted, with the majority of children (77%) performing at an average or above average level. These findings highlight the heterogeneity among Latino parents and their children [58] .\nThis study has several limitations. First, the sample size is small. However, this is the largest sample reporting on kindergarten performance for children participating in ROR since infancy. Second, the children in this study were drawn from families who, though living in poverty and thus at risk for poor school performance, may have had unmeasured factors that contributed to school performance, such as family stability. The majority of child participants (85%) lived in twoparent families, a factor associated with better school performance [49] . Family stability was also demonstrated by having a working telephone number, transportation, attending 90% or more of recommended WCC, participating fully in the ROR program and using the library. Additional factors may have also included traditional Latino values such as familismo, respeto, and cariño [59] . It may be that the parents in this study, especially those who were most consistent with WCC, were also motivated to provide other literacy experiences to their children. The range of emergent literacy skills of the children in this study points to the importance of moving beyond the achievement gap between Latino and white children and examining the factors associated with the heterogeneity in low income, Latino families literacy practices [18] . The contribution of these factors and traditional Latino values on ROR engagement and school performance deserve further study [59] . Third, we are unable to measure the individual components of the ROR program that might contribute to literacy orientation. The number of books received was dependent on physician record keeping and may result in under-reporting. The presence of the library in the clinic offered additional opportunities for book ownership and literacy encounters beyond the traditional ROR program. Finally, there is no control group for this study. We believed there were ethical issues that prohibited the creation of a control group denied early literacy interventions that were standard of care in the clinic. Efforts to recruit controls from the community failed to identify families with similar socio-economic or education levels as the families served by our clinic.\nFurther, it was difficult to identify children with similar risk factors from our community who did not receive healthcare in a clinic with a ROR program because of its widespread implementation. Despite this limitation, we believe that the Latino children described in this study are at even higher risk than those that have been evaluated in national samples and that suitable comparisons can be made.\nReports from the National Task Force on Early Childhood Education for Hispanics in 2007 and 2008 identified the most urgent need as improving school readiness and achievement among low SES Latino children from immigrant families [60, 61] . The report recommends that state and federal governments, in collaboration with foundations, Latino organizations, educators and researchers, increase investments in the design and evaluation of infant/toddler and prekindergarten literacy programs that serve Latino families [60, 61] . The ROR Program is a low-cost intervention at ~$50/per child for 5 years of support [31] . In combination with other programs, ROR may be helpful in supporting the emergent literacy skills of Latino children from immigrant families and thus improve their school readiness and achievement."}]