[{"section_title": "", "text": "When intermediated sales (locally grown food sold to a grocery store, restaurant, or distributor) are combined with farmers' directto-consumer sales, the size of the U.S. local food market was $4.8 billion in 2008. Local food marketing channels varied with farm size, region of the country, and proximity to population centers. Small and midsized farms with local food sales spent more hours farming, were more likely to list farming as the principal operator's primary occupation, and tended to forgo the opportunity to earn additional labor income more than similarly sized farms without local food sales. In addition to buying directly from farmers, consumers also purchase locally grown food through retail channels that enable consumers to purchase local foods with one-stop shopping convenience (see \"Local Food Supply Chains Use Diverse Business Models To Satisfy Demand,\" in the December 2010 issue of Amber Waves). When intermediated, or indirect, local food marketing channels, such as sales through grocers, restaurants, and regional distributors, are combined with direct-toconsumer sales by farm operations, a more complete picture of the local food market emerges than is the case when only directto-consumer sales are considered. Based on data from USDA's Agricultural Resource Management Survey (ARMS), local food sales amounted to $4.8 billion in 2008 when direct-to-consumer and intermediated sales of locally grown food are measured-four times higher than estimates based on direct-toconsumer sales alone. ERS researchers used these data to explore differences in the marketing channels used by farms selling locally, to examine the relationships between producer location and the marketing channels used, and to assess operators' commitments to farming among farms with and without local food sales."}, {"section_title": "Marketing Channels for Locally Grown Food", "text": "The 2008 ARMS measured local food sales by asking farm operators whether they sold directly to consumers at farmers' markets, roadside stands, onfarm stores, and community-supported agriculture or through intermediated sales to local grocers, restaurants, and regional distributors during the year. Over half of local food sales-$2.7 billion-were from farms sell-ing local foods exclusively through intermediated marketing channels. Farms using both direct-to-consumer and intermediated marketing channels accounted for a quarter of local food sales ($1.2 billion). Use of local food marketing channels varied with farm size. Small farms (gross annual sales under $50,000) relied on direct-to-consumer channels more than large farms, which were more likely to use intermediated channels for their local food sales. Large farms (annual sales over $250,000) that market local foods exclusively through intermediated channels accounted for 92 percent of these intermediated sales, while small and medium-sized farms that market local foods exclusively through direct-to-consumer channels accounted for 73 percent of these sales. While we do not have information on the value of local foods sold through individual marketing channels (such as farmers' markets or grocers), we do know the number of individual marketing channel types each producer used. Farmers' markets and roadside stands each accounted for over one-third of the local food marketing outlet types small farms used (35 and 34 percent, respectively). Farmers' markets and roadside stands were also used by large farms reporting local food sales (15 and 24 percent, respectively). Large farms, however, relied on regional distributors over four times more often than small farms to market their local food. Interestingly, grocers and restaurants, as a share of marketing channel types, were utilized by small and large farms selling locally at similar rates, suggesting that these marketing channels are available regardless of farm size."}, {"section_title": "Marketing Channel Use Varies With the Region of the Country", "text": "Previous research found that directto-consumer sales are highest in metropolitan areas (see \"Urban Areas Prove Profitable for Farmers Selling Directly to Consumers\" in the September 2010 issue of Amber Waves), and this finding also holds for intermediated sales of locally grown food. While farms that reported local food Farms with both direct-to-consumer and intermediated local food sales on the West Coast (California, Oregon, and Washington) accounted for less than 8 percent of all U.S. farms reporting local food sales but were responsible for nearly 24 percent of the value of U.S. local food sales. In 2008, 85 percent of the value of West Coast local food sales occurred through intermediated channels. The dominance of intermediated marketing channels among West Coast local food farms is likely because these farms are typically larger and located farther from metro areas than farms in other regions, necessitating the use of intermediated rather than direct-to-consumer marketing channels. High levels of local food production on the West Coast may also be related to the region's suitability for fruit and vegetable production. Recognized for its varied climates, long growing season, and extensive irrigation networks, the West Coast produces 56 percent of the Nation's vegetables, fruit and nuts, and other specialty crops. In the Northeast, farms reporting local food sales tended to be smaller, located closer to densely populated urban markets, and more likely to use direct-toconsumer marketing outlets than their counterparts on the West Coast. Vegetable, fruit, and nut farms dominate local food sales when compared with other types of farms. An examination of the factors driving spatial location differences finds that climate and topography favoring the production of fruit and vegetables, proximity to and neighboring farm participation in farmers' markets, and good transportation and information access drive direct-to-consumer sales."}, {"section_title": "Farm Operators Involved in Local Food Sales Differ From Those That Do Not Sell Food Locally", "text": "Farm households selling locally earned, on average, 17 percent less offfarm labor income than the average farm household not engaged in local food sales, Small farms rely on direct-to-consumer marketing channels more than do large farms 1 CSAs are community-supported agriculture organizations that link consumers with local producers.  suggesting these farmers are willing to forgo the opportunity to earn additional household income off the farm in order to grow and sell foods locally. In addition, almost two-thirds of local food producers reported that local food sales accounted for at least 75 percent of their total farm sales in 2008, suggesting the importance of local food sales to gross sales for these farms. Farms reporting local food sales require more operator time than do farms without local food sales. The average farm operator with local food sales devoted 1.3 full-time equivalent (FTE) jobs (1 FTE job equals 2,000 hours worked annually) to the farm, compared with 0.9 FTE job for farm operators without local food sales. This pattern held across farm sizes up to $250,000 in annual sales, as multiple members of the farm household may work as operators. For large farms above this sales level, there was no difference between the FTE operators on farms with and without local food sales. Since the operators of large farms often market local food through intermediated channels, they may not face the same degree of labor intensity as operators selling directly to consumers. Small and midsized farms with local food sales were more likely to consider farming as the principal operator's primary occupation than comparably sized farms without local food sales. Overall, farm operators selling locally were 30 percent more likely than other operators to list their primary occupation as farming; small-farm operators selling food locally were 50 percent more likely to do so. As with FTE requirements, the difference in stated primary occupation between farms selling locally and those that do not disappears among operators of large farms. shutterstock Operators of small and midsized farms selling locally put in more hours working onfarm than operators who do not have local food sales Note: A full-time equivalent job equals 2,000 hours worked annually. Source: USDA, Economic Research Service based on data from USDA's 2008 Agricultural Resource Management Survey."}, {"section_title": "Small farms Large farms", "text": "Operators' full-time equivalent jobs per farm "}]