[{"section_title": "", "text": "The outbreak of a novel coronavirus, referred to as severe acute respiratory syndrome coronavirus-2 (SARS-CoV-2) or coronavirus disease-19 , with its sentinel case in Wuhan, People's Republic of China, in December 2019, has spread rapidly beyond the People's Republic of China. On March 11, 2020, the World Health Organization (WHO) declared COVID-19 a worldwide pandemic, at which time >118,000 people across 114 countries, territories, and areas had been infected by this virus 1 .\nCOVID-19 has rapidly become a global public health threat, endangering the health and well-being of all people, but especially vulnerable populations 2, 3 . The pandemic has also precipitated social disruption, exceptional health-care utilization, and economic instability worldwide. Controlling the spread of COVID-19 has become the singular focus of several countries, with unprecedented international collaboration and rapid dissemination of emerging scientific evidence. Table I summarizes what we know about COVID-19."}, {"section_title": "Evidence Review", "text": "We performed a search of electronic databases (PubMed, Embase, Google Scholar) for relevant research articles on March 16, 2020. We accessed the medRxiv database for any unpublished papers, as research in this field is quickly emerging. We also searched the World Health Organization (WHO), the U.S. Centers for Disease Control and Prevention (CDC), and other government health agency websites for relevant information.\nWhat Is COVID-19? COVID-19 is the disease caused by the SARS-CoV-2 virus, which belongs to the family of coronaviruses 4 . Coronaviruses are positive-sense, single-stranded ribonucleic acid (RNA) viruses that infect a variety of mammalian hosts, causing a range of symptoms that primarily affect the respiratory and gastrointestinal systems 5 . Coronaviruses tend to cause mild symptoms in humans, although several strains, including the viruses responsible for the severe acute respiratory syndrome (SARS) and Middle East respiratory syndrome (MERS) outbreaks, have been linked to more severe symptoms and mortality 6 .\nSARS-CoV-2 was isolated from several patients in Wuhan, People's Republic of China, and was identified as a novel coronavirus hitherto unknown to the medical field 7 . The virus was named from its phylogenetic and taxonomic similarities to the SARS coronavirus (SARS-CoV), the cause of the SARS outbreak in 2002 to 2003 4 . SARS-CoV-2 represents the seventh known coronavirus."}, {"section_title": "How Does COVID-19 Spread?", "text": "The transmission characteristics of SARS-CoV-2 were originally unclear, but it soon became apparent that the virus originated from an unknown animal source and was now spreading from human to human 8 . The major route of transmission is through direct routes, such as respiratory droplets produced through coughing or sneezing, between people who are in close contact with one another, and through contact with contaminated surfaces or objects 9 . Although much of the focus has been on isolating symptomatic patients, there has been some potential evidence of transmission in asymptomatic patients (i.e., patients who are infected but not exhibiting symptoms associated with COVID-19) [10] [11] [12] . At the time of this writing, grow-ing evidence suggests that asymptomatic, pre-symptomatic, or mildly symptomatic individuals could be drivers of the community spread of the virus. Some recent reports on asymptomatic cases have suggested that viral shedding can last close to a month 9,13 , although it is unclear how great the risk of transmission might be throughout this period. Emerging mathematical models analyzing the outbreaks in Singapore and Tianjin, People's Republic of China, also support the existence of asymptomatic and pre-symptomatic transmission of COVID-19 14 . Researchers analyzing the outbreak data from Tianjin and Singapore found that infection was transmitted, on average, 2.55 days prior to symptom onset in Tianjin and 2.89 days prior to symptom onset in Singapore in each cluster 14 .\nSeveral studies have sought to establish the basic reproductive number (R 0 ) for SARS-CoV-2. The R 0 represents the number of new cases that can be expected to stem from each unique case. An early examination of the first 425 patients in Wuhan found that the R 0 was 2.2 (95% confidence interval [CI], 1.4 to 3.9), meaning that each person infected with COVID-19 can be expected to infect at least 2 other people 15 "}, {"section_title": "Global Pandemic", "text": "By definition 19 , \"a pandemic is the worldwide spread of a new disease.\" It can be transmitted between people and spread worldwide because of the absence of preexisting immunity against the new virus in humans 19 23 . Figure 1 illustrates a timeline of important events associated with COVID-19. Chinese laboratories successfully isolated a new type of coronavirus, after conducting tests on all suspected cases on January 7, 2020 24 . From the middle to late January 2020, Thailand, Japan, South Korea, and the United States reported their first cases of confirmed COVID-19 21, 25 . By the end of January 2020, 9,826 confirmed cases were identified globally across 20 countries 26 .\nOn the second meeting of the International Health Regulations Emergency Committee on January 30, 2020, the WHO declared a Public Health Emergency of International Concern (PHEIC) 27 . The term PHEIC is defined as 27 : \"an extraordinary event which is determined to constitute a public health risk to other States through the international spread of disease; and to potentially require a coordinated international response.\" Also, according to the WHO 28 , \"This definition implies a situation that is serious, unusual, or unexpected; carries implications for public health beyond the affected state's national border; and may require immediate international action.\" Eleven days later, on February 10, 2020, there were, cumulatively, 40,554 confirmed cases and 910 deaths globally across 25 countries, and the majority were identified in the People's Republic of China 29 . On February 11, 2020, the WHO announced a name for the new coronavirus disease: COVID-19 30 . Timeline of important COVID-19 events.\nSince then, the numbers of confirmed cases and deaths have been escalating globally. By March 10, 2020, there were >110,000 cases and >4,000 deaths across 110 countries 31 . One day later, on March 11, 2020 , in remarks to the media, the WHO Director-General, Dr. Tedros Adhanom Ghebreyesus, announced COVID-19 to be a pandemic based on >118,000 cases in 114 countries and 4,292 deaths due to the disease 26, 32 . The 5 countries with the highest prevalence, to date, are the People's Republic of China, Italy, Iran, South Korea, and Spain 27 ."}, {"section_title": "Clinical Presentation and Diagnosis", "text": "The current understanding of the incubation period, the period between exposure and the appearance of the first symptoms of infection, for COVID-19 is limited. The current best evidence from an analysis of 181 confirmed COVID-19 cases detected from 50 provinces, regions, and countries outside of Hubei Province between January 4, 2020, and February 24, 2020, estimated the median incubation period to be 5.1 days (95% CI, 4.5 to 5.8 days) 33 . Of all infected cases, researchers estimate that <2.5% of cases will show symptoms within 2.2 days (95% CI, 1.8 to 2.9 days) of exposure and that 97.5% of cases will show symptoms within 11.5 days (95% CI, 8.2 to 15.6 days) 33 .\nCurrently, real-time reverse transcription-polymerase chain reaction (RT-PCR) is considered the reference standard for detection of the SARS-CoV-2 virus in respiratory specimens. Mass screening procedures (testing those with and without symptoms) and documented illness of COVID-19 have demonstrated that the clinical spectrum of infection with SARS-CoV-2 appears to be wide, with a range including asymptomatic infection, mild upper respiratory tract illness, severe viral pneumonia with respiratory failure, and death 8, 34, 35 . Table II presents a list of common symptoms among patients with COVID-19 from an unpublished systematic review of 72 retrospective studies including a total of 3,470 patients who were positive for SARS-CoV-2 36 . The authors found that, although fever was the most common symptom in these patients, only 1,522 patients (43.9%) had fever as their onset symptom. Radiographic findings revealed that 2,528 (88.2%) of 2,866 patients had abnormalities on a chest computed tomographic (CT) scan, with either unilateral or bilateral ground-glass opacity and/or consolidation, with a peripheral distribution. Lymphocytopenia (lymphocyte count <1.0 · 10 9 /L) was present in 1,498 (62.8%) of 2,387 patients, and 1,354 (64.8%) of 2,091 patients had elevated levels of C-reactive protein 36 ."}, {"section_title": "Survival, Serious Illness, and Hospitalization", "text": "Because of the disease's rapid increasing case profile, the presence of asymptomatic and untested cases, and its varying effects across different patient demographic characteristics, the estimates of the mortality risk have been wide-ranging. On average, at the time of this writing, the WHO reported that the time between symptom onset and death ranges from 2 to 8 weeks 37, 38 . As of March 23, 2020, the WHO reported a mortality estimate of 4.4% in confirmed cases globally; however, the highest incidence rate was in Italy at 9.3% 39 .\nBaud et al. suggested that a more representative estimate of mortality should not be relative to the number of confirmed cases (as patients are infected much earlier), but should be based on the total number of patients who were infected at the same time as those who died 37 . To re-estimate the risk of mortality based on this approach using data as of March 1, 2020, Baud et al. divided the number of deaths in 1 day by the number of confirmed cases 14 days prior. This analysis led to mortality rates of 5.6% (95% CI, 5.4% to 5.8%) for the People's Republic of China and 15.2% (95% CI, 12.5% to 17.9%) outside of the People's Republic of China; globally, this estimate was 5.7% (95% CI, 5.5% to 5.9%) 37 . In a similar analysis on patients in Wuhan, the estimate was 12.2% 40 . Overall, when not considering the timing of infection, Baud et al. argued that the risk of mortality can be underestimated 37 . In contrast, some believe that this risk is actually overestimated because of the number of undiagnosed cases. Klompas 41 and Wilson et al. 42 suggested that currently reported estimates are inaccurate as asymptomatic positive cases have not been considered in these calculations.\nIn addition, the risk of death increases with age and the presence of comorbidities 38, 43, 44 . In a cross-sectional analysis that included 1,023 COVID-19-related deaths in the People's Republic of China, the Novel Coronavirus Pneumonia Emergency Response Epidemiology Team 43 found that >80% were patients ‡60 years of age; when extending this range to those who were ‡50 years of age, this number increased to >90% 44 . In terms of comorbidities, in this same study, the authors found that the mortality rate in patients with no comorbidities was about 0.9%, whereas it was 10.5% in patients with cardiovascular disease, 7.3% in patients with diabetes, 6.3% in patients with respiratory disease, and 5.6% in patients with cancer 43 . Moreover, in a report by the WHO-China Joint Mission, they estimated that the risk of death in those without comorbidities was 1.4%, and the incidence was higher in those with 38 . Approximately 80% of confirmed cases are diagnosed with mild to moderate disease (pneumonia and non-pneumonia cases), about 14% of cases experience severe disease (dyspnea and other respiratory problems), and the remaining 6% of cases are deemed critical cases (respiratory failure, septic shock, or multiple organ failure); similar to the risk of death, patients who are ‡60 years of age and those with preexisting conditions are at the greatest risk of having severe disease 32, 45, 46 . In a retrospective study on COVID-19 patients in Chongqing, People's Republic of China, Qi et al. evaluated patients who were categorized as severe or non-severe cases and found that patients with severe cases were significantly older (median age of 71.5 years compared with 43.0 years for patients with non-severe cases) and were more likely to have comorbid conditions (30% compared with 12%) 45 .\nSeveral reports have suggested that the median time from symptom onset to intensive care unit (ICU) admission is approximately 10 days 8, 37, 47 . In a recent systematic review, Fang et al. found that 185 (11.5%) of 1,612 patients were admitted to the ICU 36 . In the study by Huang et al. 8 , among 41 confirmed cases in Wuhan, 32% were admitted to the ICU, strictly because of respiratory issues that required high-flow nasal cannula or higher-level oxygen support. In an updated study by Chen et al. 48 on 99 patients, the ICU admission rate was 23%, with 4% needing invasive mechanical ventilation and 13% needing noninvasive mechanical ventilation. In a larger study on 1,099 patients in China, 5% were admitted to the ICU and 2.3% underwent invasive mechanical intervention 34 . In contrast, when looking at patients with severe illness only, Qi et al. showed that 35 (70%) of 50 cases required noninvasive mechanical ventilation, 24% needed high-flow nasal cannula oxygen, and 10% required invasive mechanical ventilation 45 . Although the current evidence shows that older patients and those with underlying health conditions are at higher risks of severe disease and death, younger and, presumably, healthier individuals should still be concerned about experiencing severe outcomes if infected with COVID-19. The CDC recently published a report on U.S. patients with COVID-19, using data from February 12, 2020, to March 16, 2020 , and, although their case-fatality rate may be low (i.e., <1%), patients in the younger age groups had appreciable risks of both hospitalizations and ICU admissions (Fig. 2) 49 .\nAmong the cohort of patients included in the WHO-China Joint Mission report, the median time from onset to recovery (of those who survived) for mild cases was about 2 weeks, whereas this was between 3 and 6 weeks for those who had severe or critical disease 38 . The development of severe disease was about 1 week from onset and deaths occurred at 2 to 8 weeks 38 ."}, {"section_title": "Risk Mitigation", "text": "As the number of cases continues to rise rapidly across the world, there is growing concern that health-care systems will quickly become saturated and unable to adequately respond to the outbreak. The soaring number of cases in Italy (estimated at 59,138 as of March 23, 2020) requiring medical attention and hospitalization has overwhelmed the health-care system; some hospitals are filled to capacity, and there are a shortage of beds and a lack of medical equipment such as ventilators for those patients with more serious illness.\nIn epidemiology, preventing and slowing the virus's spread so that fewer individuals require medical treatment at any given time are referred to as \"flattening the curve\" of the pandemic. Without precautions or measures to slow the rate of infection, the projected number of people who will contract COVID-19 over a period of time will likely increase exponentially. Infection curves with a steep rise place greater demands on health-care systems, overwhelming limited health-care resources and forcing agonizing decisions about which patients will receive life-saving treatment and which patients will not. However, a flatter curve assumes the same or fewer absolute number of cases but over a longer period of time 50 . A slower rate of infection reduces the burden on health-care systems and allows patients to receive appropriate care.\nA major issue faced by policymakers and health-care professionals is the apparent evidence that the virus can be spread by asymptomatic and pre-symptomatic patients [10] [11] [12] . Early evidence from pre-published studies of 2 cohorts indicate that the virus is spread, on average, 2 to 3 days before symptoms present 14, 51 . As there is no current vaccine that can protect against infection, preventing the spread of the virus, particularly in patients without symptoms, requires a comprehensive approach through collective action.\nInternational, national, and local public health authorities have made prevention and control recommendations based on current understanding of modes of transmission of the virus (Table III) .\nPracticing proper hygiene includes frequent hand washing; avoiding touching the eyes, nose, and mouth; coughing or sneezing into a bent elbow or tissue; and wearing of masks for symptomatic individuals 52 .\nSocial distancing involves taking deliberate steps to minimize close contact between people to limit COVID-19 transmission in the community. Examples of social-distancing measures include but are not limited to cancelling events and mass gatherings, closing schools or switching to online learning, working from home, and reducing public services such as access to community centers. Additionally, many countries have begun advising their citizens to avoid all nonessential travel outside of the country, as well as banning or severely limiting incoming international flights. This seeks to limit the spread from countries with higher cases of COVID-19 to the resident country. Finally, an isolation from other individuals by a distance of 2 m (or 6 feet in the United States) is suggested.\nIndividuals who do not have symptoms but may have been exposed to the virus through close contact with someone diagnosed with COVID-19 or those who have traveled outside their home country are recommended to self-isolate for 14 days. The 14-day self-isolation recommendation is due to the time frame for symptoms to present, as previous studies have found that the presentation of symptoms occur by 12 days 33 . Therefore, by isolating for 14 days, a person would theoretically present with symptoms and would be able to be tested, while not actively spreading the virus in the community during the self-isolation period."}, {"section_title": "Race for a Vaccine", "text": "The race for a COVID-19 vaccine has become the focus of several research teams globally as researchers work to develop and test a vaccine that can potentially prevent future cases of the disease in vaccinated patients. Groups in Canada, Germany, the People's Republic of China, and the United States are all at varying stages of vaccine development, with human trials likely under way by the time of this article's publication [53] [54] [55] [56] . At least 4 Phase-I trials are registered on ClinicalTrials.gov, including in the United States and the People's Republic of China (ClinicalTrials.gov Identifier: NCT04283461, NCT04299724, NCT04276896, NCT04292340) ( Table IV) . One of the key lessons from previous attempts at the development of a SARS coronavirus vaccine is the concern for immunopotentiation. In other words, whole-virus vaccines led to an undesired increase in infectivity or eosinophilic infiltration 57 . Johnson & Johnson, the University of Hong Kong, and Codagenix are all exploring whole-virus SARS-CoV-2 vaccine options. However, given the aforementioned concerns with regard to increased infectivity following immunization and the general dangers associated with live virus vaccines, extensive testing will be needed before these vaccines are available for clinical use 58 .\nAnother potential vaccine strategy is subunit vaccines, which rely on eliciting an immune response against the spike (S) protein to prevent its docking with the host angiotensinconverting enzyme 2 (ACE2) receptor 57 . A number of entities, including the University of Queensland, Novavax, Clover Biopharmaceuticals, and Baylor College of Medicine, have all made progress toward either a SARS-CoV or SARS-CoV-2 subunit vaccine. Given the limited potential for host immunopotentiation and the similarities between SARS-CoV and SARS-CoV-2 amino acid expression, the potential for a subunit vaccine may be the most promising in the short term. The final option is a nucleic acid vaccine, for which several major biotechnology companies already have platforms. To date, there has not been a successfully licensed human nucleic acid vaccine, although promising results in animal studies have continued 58 .\nOverall, although there has been impressive and rapid progress toward a vaccine already, a vaccine that is ready for widespread use is still likely months, possibly years, away, given the testing, regulatory, and manufacturing hurdles that will need to be cleared. The race for a vaccine provides hope, but should not be relied on to compensate for a lack of containment strategies in the meantime. Aggressive measures aimed at slowing viral spread will necessarily be the primary public health strategy for the near future."}, {"section_title": "Clinical Management", "text": "No specific treatment is currently recommended for COVID-19. Similar to many other viral illnesses, the current mainstays of treatment include early recognition and isolation, along with symptomatic and oxygen therapy 59 . Considerations for the advanced levels of care including critical care depend on the development of further symptoms, including pneumonia or acute respiratory distress syndrome (ARDS). The use of systemic corticosteroids and antibiotics is not recommended except when targeting specific comorbid conditions 59 .\nNo antiviral treatments are currently approved, but alphainterferon (5 million units inhaled twice daily), lopinavir-ritonavir (Kaletra), remdesivir, and chloroquine have all been proposed as potentially beneficial and may be trialed if available in severe cases [60] [61] [62] . A randomized controlled trial (RCT) of lopinavirritonavir compared with standard care included 199 patents with COVID-19. Eligible patients were adult patients with COVID-19, pneumonia, and compromised oxygen saturation. There was no significant difference between the 2 groups in terms of time to clinical improvement or mortality, with more adverse events in the intervention group 63 . No high-quality evidence exists on remdesivir in this context, but it has been shown to effectively inhibit SARS-CoV-2 in vitro, particularly in combination with chloroquine 64 . At least 2 ongoing RCTs are evaluating the efficacy of remdesivir in COVID-19 (NCT04252664 and NCT04257656).\nChloroquine has been found to inhibit SARS-CoV-2 in vitro 64 , and a number of trials are ongoing to test its clinical efficacy. Although no formal results are yet available, early results have reportedly been promising, so much so that the expert consensus from the Department of Science and Technology of Guangdong Province in the People's Republic of China has recommended chloroquine 500 mg twice daily for patients with mild to severe COVID-19 who do not have any contraindications 65 . Convalescent plasma from recovered patients is also being actively investigated, based on positive experience with previous coronavirus outbreaks. However, there is a lack of evidence for convalescent plasma in COVID-19, and there is a risk of thrombotic events as well as attenuation of the immune response, which can leave patients at a potentially higher risk for reinfection or other infections.\nLessons from History: The First and Second Waves As discussed above, we are now experiencing our third human coronavirus epidemic of the century, with 1 occurring in each decade so far. In addition, the pandemics of H1N1 and the 1918 influenza (also known as the Spanish Flu) may provide clues into what may be expected moving forward. One of the common threads seen in both outbreaks was the phenomenon of multiple waves (Fig. 3) 66 . Both epidemics began in the late winter and early spring, at which point the relevant governments and public health systems began to take steps to limit the viral spread. In the case of the 1918 influenza pandemic, the death rates of the first wave were limited, and, between August and October 1918, there were very few deaths occurring from the disease. However, the second wave, which was by far the deadliest of the 3 waves, occurred between September and November 1918. Many theories have been proposed for the nature and timing of this second wave, including less favorable transmission conditions (rising temperatures, improved airflow, and less indoor crowding) in the summer months, although the exact reasons remain unclear 67 . A smaller, third wave followed in early 1919. The 1918 influenza pandemic also provides an example of the importance and effectiveness of the aforementioned practice of social distancing (Fig. 4) . A 2007 study compared the public health policies of Philadelphia and St. Louis during the pandemic, in which St. Louis enacted public health measures such as social distancing in a rapid and strict fashion, and Philadelphia enacted some less stringent measures weeks after the appearance of the first case 50 . In fact, despite the first case being reported on September 17, 1918, a citywide parade was held in Philadelphia 13 days later. The difference in outcomes between the 2 cities was striking, with Philadelphia showing weekly death rates of 257 per 100,000 and cumulative peak death rates of 719 per 100,000 and St.\nLouis showing weekly death rates of 31 per 100,000 and cumulative peak death rates of 347 per 100,000 50 .\nSimilarly, the SARS epidemic, which was first recognized in late February 2003, also had a spring peak. On May 14, 2003 , the WHO removed Toronto from the SARS concern list, as there had been no new cases of community spread or death for 20 days 68 . Shortly after, as hospitals began to dismantle their precautions, a second peak of cases developed in middle to late May 2003; most of these cases were clustered around a single hospital, with 90 probable and suspect cases during this second wave 69 . We do not have any clear understanding whether the coronavirus will recur in waves; the future behavior is unknown. The MERS epidemic did not present with a second wave, and the timings of the second waves for the 1918 influenza epidemic and SARS were very different. Perhaps the most important lessons that can be taken from these previous outbreaks are simply a continued vigilance and preparedness for a possible second wave and a high index of suspicion for any new cases of undifferentiated respiratory illness in the weeks to months following a slowdown in new cases. Finally, the past can also provide context with regard to the size and impact of past pandemics. Table V contains a list of selected past pandemics with their absolute and relative (as a proportion of the global population) death tolls."}, {"section_title": "Managing Expectations for COVID-19", "text": "We are in the midst of an unprecedented pandemic, the likes of which we have not seen in over a century. Although the global response has been vigilant and focused, research continues to evolve and our understanding of the ultimate impact of COVID-19 remains largely unknown. It is impossible to accurately predict the trajectory of COVID-19 because of its rapidly evolving nature 70, 71 , but some groups have recently attempted to forecast this using advanced modeling techniques 72, 73 . These models are likely gross overestimates, given that they assume no containment measures are in place. Even with aggressive containment procedures, the outbreak is unlikely to see meaningful resolution for weeks to months.\nPeng et al. used public data from the National Health Commission of China from January 20, 2020, to February 9, 2020, and estimated that, for the majority of the People's Republic of China, anti-epidemic success will be seen around mid-March 2020; however, in Wuhan, this is expected to occur closer to the beginning of April 2020 72 . In another model by Wu et al., the authors performed a generalized logistic growth model (data from infected cases between January 19, 2020, and March 10, 2020) 73 and estimated that, in Japan, there will be a total of 1,574 cases by the end of March 2020 and 5,669 cases by the end of June 2020 and that around 0.15% of Italy (>90,000 people) will be infected by the end of the outbreak.\nUnderstanding big data sets will be key to future innovations and prevention. This outbreak has created millions of data points and provides an opportunity to test the promise of machine learning and artificial intelligence. The Allen Institute for AI (Artificial Intelligence) in Seattle, Washington, has recently partnered with other researchers to create the COVID-19 Open Research Dataset (CORD-19) 74 . This free resource contains relevant articles about COVID-19 and related viruses, allowing researchers to apply advanced methods, such as natural language processing, to try to generate new information about the disease."}, {"section_title": "Guiding Surgeons Through This Pandemic", "text": "The COVID-19 pandemic has led to a heavy burden on the health-care system, leaving many surgeons with questions as to how to handle this situation, in terms of their practice and caring for their patients. A number of major institutions, surgical associations, and physicians with direct experience treating patients with suspected or confirmed COVID-19 have recently released statements or published recommendations to offer guidance to surgeons, in particular, and all frontline health-care workers [75] [76] [77] [78] [79] [80] [81] . We summarize their guidance here:\n1. Assess all planned elective or nonemergency surgical procedures and clinic visits to determine whether or not they can be postponed or cancelled, keeping in mind that it may be another 6 to 8 weeks (or more) until we see some resolution. 2. Shift urgent inpatient diagnostics and surgical procedures to outpatient settings, when possible. 3. Minimize the use of essential items (e.g., beds, personal protective equipment, cleaning supplies, ventilators). 4. Plan for the potential surge of critical care patients and have additional space and supplies readily available. 5. Create multiple teams that are completely insulated from each another. 6. Limit or cancel nonessential travel, not only to prevent the spread of the disease, but also to ensure that you are available to help your local health-care system to manage a possible increase in patient admissions or to reorganize the workforce if a colleague becomes infected. 7. If they cannot be cancelled altogether, complete conferences, educational courses, panels, meetings, and even follow-up patient examinations virtually or remotely. 8. If a surgical procedure is necessary for a patient with suspected or confirmed COVID-19, use an operating room with a negative-pressure environment, frequent air exchange, and a separate access. Airborne spread is a concern during aerosol-generating procedures, so it is also important to understand the airflow within an operating room and have the proper equipment and protocols in place to limit the spread of infection in this setting. Anterooms in which to put on and remove protective equipment should be available, or even constructed, adjacent to the operating room. Use disposable surgical items and protective equipment. Use double caps, N95 masks, medical goggles, and boots. Minimize entry into and exit from the operating room during surgical procedures. Allocate time between procedures to allow staff and the operating room to go through proper decontamination procedures. 9. Keep posted on updates provided by the CDC and the WHO on a regular basis.\nSummary COVID-19 is a global pandemic that has currently infected >300,000 globally. Fever and cough are the most common symptoms of the disease, and it is important to remember that the virus can even be transmitted by individuals who test positive for the disease but do not have any symptoms. Currently reported mortality rates vary because of the rapid spread of the disease and different approaches to calculating this estimate, but it is clear that the risk of death is associated with age and the presence of underlying conditions. Risk mitigation techniques (i.e., hand washing, social distancing, and self-isolation) have already been emphasized across major news outlets. It is essential that we continue these practices, as the outbreak is currently expected to last for many more months and we must be mindful of the lessons learned from past pandemics to prevent a second wave from occurring. n "}]