[{"section_title": "Abstract", "text": "There is growing evidence to support that paleo-timescale events are important determinants in the present-day distribution of organisms. We explored the relationship between community composition of tidal marsh birds in the northeastern United States and potential drivers of biodiversity patterns across timescales to explore the relevance of historical contingency in this ecosystem. These potential predictors represent some of the major known influences on biodiversity in tidal marshes, including 1) a recent, intense hurricane event driving a largescale perturbation of this ecosystem (4 yr), 2) gradual modification of marshes through installation of human infrastructure (~ 150 yr), and 3) marsh formation and development after the Last Glacial Maximum (LGM, ~ 20 000 yr). We surveyed  1300 locations in tidal marshes from 2011-2014 using passive point count methods to measure bird community composition at these points. We found that rarefied richness, total individuals (N), and total biomass were best explained by a quadratic relationship with marsh age peaking at 40° latitude, the location of the Last Glacial Maximum of the Laurentide ice sheet. We hypothesize that formation of marsh millennia earlier in the southern part of our survey area allowed for earlier evolution of specialization to tidal marsh by bird species than those occupying much younger, northern marshes, which could have then driven differential rates of colonization in the north (by habitat generalists) and competitive exclusion in the south (by habitat specialists). We tested this theory using a novel functional diversity metric (community habitat specialization index, or CHSI) and find that community specialization decreased linearly with marsh age, supporting our hypothesis. Our findings highlight the importance for consideration of historical contingency in biodiversity research and further exploration of mechanisms operating across geological timescales."}, {"section_title": "41: 684-694, 2018", "text": "doi: 10.1111/ecog.02937\nThere is growing evidence to support that paleo-timescale events are important determinants in the present-day distribution of organisms. We explored the relationship between community composition of tidal marsh birds in the northeastern United States and potential drivers of biodiversity patterns across timescales to explore the relevance of historical contingency in this ecosystem. These potential predictors represent some of the major known influences on biodiversity in tidal marshes, including 1) a recent, intense hurricane event driving a largescale perturbation of this ecosystem (4 yr), 2) gradual modification of marshes through installation of human infrastructure (~ 150 yr), and 3) marsh formation and development after the Last Glacial Maximum (LGM, ~ 20 000 yr). We surveyed  1300 locations in tidal marshes from 2011-2014 using passive point count methods to measure bird community composition at these points. We found that rarefied richness, total individuals (N), and total biomass were best explained by a quadratic relationship with marsh age peaking at 40° latitude, the location of the Last Glacial Maximum of the Laurentide ice sheet. We hypothesize that formation of marsh millennia earlier in the southern part of our survey area allowed for earlier evolution of specialization to tidal marsh by bird species than those occupying much younger, northern marshes, which could have then driven differential rates of colonization in the north (by habitat generalists) and competitive exclusion in the south (by habitat specialists). We tested this theory using a novel functional diversity metric (community habitat specialization index, or CHSI) and find that community specialization decreased linearly with marsh age, supporting our hypothesis. Our findings highlight the importance for consideration of historical contingency in biodiversity research and further exploration of mechanisms operating across geological timescales."}, {"section_title": "Introduction", "text": "The biodiversity patterns we observe across landscapes are directly driven by patterns in habitat use by organisms. The factors that contribute to habitat choices vary between individuals, populations, species, and clade, however drivers of habitat use at any scale can be organized into those that affect the physical characteristics of habitat in question (Roxburgh et al. 2004 , Balée 2014 , the evolutionary forces affecting habitat use traits in organisms (McGill et al. 2006 , Lavergne et al. 2010 , factors influencing demographic rates (Ruskin et al. 2016) , and interactions between organisms concurrently using the landscape (Tylianakis et al. 2008 , Gilman et al. 2010 . Further, traditional biodiversity metrics such as richness or evenness are often paired with functional diversity indices (Lamanna et al. 2014 ) that measure variation in morphological or behavioral traits of habitat use in a species to quantify a community's composition (Fukami et al. 2005 , McGill et al. 2006 ). Due to the extreme complexity with which these mechanisms operate across multiple indices and the general difficulty in testing large-scale patterns empirically (Shea et al. 2004) , which processes most commonly drive diversity patterns remains an open question in ecology.\nIn addition to the varying modes of measurement and mechanism in biodiversity studies, the physical, ecological, and evolutionary forces driving the biodiversity patterns we wish to understand are all active at different timescales, from periods spanning only days to those spanning thousands of years. Physical characteristics of a system can be altered very quickly through short but intense perturbation; fire events and hurricanes routinely alter the physical context of landscapes within only hours or days (Heinselman 1973 , Turner et al. 2006 . At the other extreme, glacially slow processes such as ice sheet advance and retreat take millennia to fully cycle but impose unmistakable influences on the landscape including topsoil removal, glacial scour, and isostatic rebound influencing rates of sea level rise (Kaser et al. 2003, Peltier and Fairbanks 2006) . Ecological change is well documented across many timescales, from the invasion of systems by exotic taxa across only a few years (Lowry et al. 2013) to the stochastic patterns in Earth's biota observed through the fossil record (Davis and Botkin 1985, Reed 1997) . Lastly, evolutionary mechanisms can act across a span of only one generation (e.g. population bottlenecking, Nei et al. 1975) , or over millions of years (e.g. divergence of two species, Gingerich 2009).\nBecause of the potential for physical, ecological, or evolutionary change to occur across different lengths of time spanning several orders of magnitude, it is integral to consider events occurring at multiple timescales when teasing apart influences of biodiversity patterns across landscapes. Historical abiotic change has been repeatedly shown to drive largescale ecological patterns (Ricklefs 1987 , Ricklefs et al. 1999 , Svenning et al. 2015 . The legacy left by long-past events, termed 'historical contingency', receives some attention in species diversity studies (Svenning and Skov 2005, Blonder et al. 2015) , however the links between paleo-timescale events and functional diversity are limited, and even fewer studies use quantitative measures to assess this diversity (Bloch et al. 2015) .\nCoastal marshes present a unique ecosystem in which to explore the legacies of paleo-timescale events in comparison to more recently occurring drivers of biodiversity. This ecosystem experiences disturbance at a wide range of temporal scales, and these events are well documented, specifically along the east coast of North America (Shriver et al. 2004 , Sillman 2009 ). At the longest and largest scales, Pleistocene glaciations over the past 2.6 million years are spatially associated with the almost complete absence of a coastal plain north of New York, the southernmost terminus of glaciation. The latest Pleistocene ice sheets reached their apex at the Last Glacial Maximum (LGM) between 19 000 and 26 500 yr ago (Clark et al. 2009) , and the retreat of these ice sheets then drove profoundly different rates of sea-level rise across latitude (Fig. 1, Belknap and Kraft 1977 , Nikitina et al. 2000 , Kelley et al. 2013 ) driving staggered formation of tidal marsh after the retreat of the ice sheet (see Supplementary material Appendix 1 for additional detail). More recently, installation of human infrastructure after European colonization of North America in the 1600s has disturbed tidal marsh communities on the timescale of centuries (Anisfeld et al. 1999 , Gedan et al. 2009 ) and is known to drive both abiotic (Crain et al. 2009 ) and biotic (Correll et al. 2017 ) change in northeastern tidal marshes. Finally, extreme storm events have potential to permanently alter coastal marsh structure within the span of a year (Scavia et al. 2002 , Arkema et al. 2013 . A recent example of such an event is Hurricane Sandy, which affected the east coast of the United States in October 2012. Sandy was the strongest hurricane to hit this coastline seaboard in decades (McCallum et al. 2013 ) and caused several natural rifts in barrier beaches and marshes along the coast.\nWe used a large, contemporary dataset of tidal marsh bird surveys collected between Maine and Virginia, USA to explore the role of disturbances occurring across different Central Maine coast (Kelley et al. 2013) Delaware coast (Belknap and Kraft 1977, Nikitina et al. 2000) Figure 1. Records of sea level change over time in the eastern United States (modified from Belknap and Kraft 1977 , Nikitina et al. 2000 and Kelley et al. 2013 timescales in the explanation of present-day functional and species diversity patterns. We calculated traditional community diversity metrics (rarefied richness, evenness, total individuals N, and total biomass supported) to quantify avian community structure in these marshes. We examined these indices across 1) time since marsh formation (operating across millennia), 2) degree of tidal restriction (operating across centuries), and 3) degree of storm surge (operating across years) through Hurricane Sandy, which affected the east coast of the United States in late 2012 in the center of our study area. We hypothesized about potential explanations of the species diversity patterns we observe, and developed and analyzed functional diversity through the development of a community habitat specialization index (CHSI) to help test these hypotheses. Our comparisons allow us to begin to explore the relative importance of paleo-timescale events to more modern drivers of pattern in marsh bird diversity and contribute to a growing body of work using both species and functional diversity metrics to explain mechanisms influencing biodiversity in a system."}, {"section_title": "Material and methods", "text": ""}, {"section_title": "Field data", "text": "We conducted point-count surveys to record the presence and abundance of marsh birds during the breeding seasons of 2011-2014 in tidal marshes from Maine to Virginia (n  1319). We selected survey sites based on a two-stage cluster sampling scheme for secretive-marshbird surveys implemented by Wiest et al. (2016) . We overlaid a 40 km 2 North American hexagon grid over National Wetlands Inventory (NWI) Estuarine Intertidal Emergent Wetland polygons (E2EM, USFWS 1979) from Maine to Virginia to identify our sampling extent. We then selected sampling hexagons along the coast using a generalized random tessellated stratified (GRTS) sampling scheme, stratified by biological subregion based on local geomorphic features and watershed boundaries (n  9). We then selected and visited up to 10 survey points (separated by a minimum of 400 m) within each hexagon using a GRTS equal probability sampling design, stratifying by hexagon. We used the 'spsurvey' package (Kincaid and Olsen 2012) in program R (R Core Team) to create the sampling framework.\nWe conducted bird surveys at each point between April 15 and July 31 of each survey year with narrower survey windows within each subregion to account for differences in local phenology along the coastline (Supplementary material Appendix 2). Our point-count surveys implemented a version of the North American marshbird monitoring protocol (Conway 2011 ) involving a five-minute passive survey period during which the distance to each bird detection was estimated. We recorded all visual and aural detections of birds using tidal marsh habitat, including the periodically flooded immediate upland terrestrial border. For our analyses we only used observations recorded within 50-m of the observer."}, {"section_title": "Quantifying disturbance", "text": "We used latitude in decimal degrees (North American Datum 1983) to measure change in marsh bird biodiversity along the coast. Several potential influences on marsh bird diversity vary across this gradient including climate and marsh formation millennia earlier in the south than in the north (Engelhart et al. 2011 , Fig. 1 ). We used a spatial layer developed by S. Birkel (2010) derived from geomorphic interpretations from Dyke and Prest (2002) and Denton and Hughes (1981) to approximate the glacial extent of the Laurentide ice sheet. This glacial mass reached its maximum extent at 40.5 degrees latitude. We also measured the normalized difference vegetation index (NDVI, Pettorelli et al. 2005) , a common metric influenced by local climate that is used to measure primary productivity across the landscape. We used imagery collected between July and August of 2011 from the Landsat 5 satellite at a 30  30 m resolution available from the U.S. Geological Survey. We used z-scores of reflectance values for each band to calculate NDVI to account for atmospheric differences between Landsat scenes.\nTo quantify degree of tidal restriction, a human modification previously shown to explain trends in marsh bird populations (Correll et al. 2017) , we counted the number of tidal restrictions downriver of each survey point (n  1319) using google earth imagery (Google Core Team 2013) following methods in Correll et al. (2016) . We considered any human-made structure crossing a tidal river (e.g., road crossing, culvert) to be a restriction.\nWe quantified storm event intensity during Hurricane Sandy (2012) using data collected by the United States Geological Survey coastal gauges deployed along the coastline to record storm surge during this event (McCallum et al. 2013) . Each measurement represents the peak storm tide experienced between October 29 and 30, 2012. We assigned the storm intensity value of the closest gauge to each survey point.\nValues of NDVI ranged from  0.001 to 403.63 (m  SE  3.63  22.10). We found no relationship between NDVI and latitude (R 2  0.01, p  0.60, Supplementary material Appendix 7)."}, {"section_title": "Species diversity metrics", "text": "We calculated Pielou's evenness index (Pielou 1966) , total number of individuals (N), and total biomass supported for each survey point using averaged count data across all 4 yr of surveys. To produce a measure of species richness independent of the number of individuals detected, we calculated rarefied richness for each survey point (Gotelli and Colwell 2001) . As rarefied richness measures can only be calculated using integer values, we summed the number of species occurring across all visits and years at each survey point and rarefied these numbers using a threshold of the median of all summed counts plus one standard deviation (final threshold  102 individuals). We recorded average adult biomass for each species following Correll et al. (2016) using the Cornell Lab of Ornithology's (2015) estimates for each species. We used the mean mass value when multiple mass estimates were given across sexes or subspecies. For saltmarsh sparrow Ammodramus caudacutus and Nelson's sparrow A. nelsoni we used estimates from Ruskin (2015) from recent work on these two species along the Atlantic coast. We then took a weighted sum of biomass at each survey point by summing the products of biomass estimates and the mean count for each species across all visits and years, producing an index of total bird biomass supported for each survey point.\nWe created a 'before/after' database using averaged counts of all bird species detected across visits in 2011-2012 (before Hurricane Sandy) and to compare communities before and after the storm. We then calculated the change in Pielou's evenness index, total number of individuals (N), and total biomass supported for each survey point between these two time periods. We also calculated the change in rarefied richness after first estimating richness for each time step using identical methods to those described for the 4-yr database above. Any points not surveyed after 2012 due to total habitat loss from Hurricane Sandy were dropped from analysis.\nWe recorded a total of 180 species within the 50 m distance band sampled at points in our study area ( Our 4-yr RDA including marsh age (latitude) and degree of restriction resulted in an adjusted R 2 of 0.22 (Fig. 2) . Marsh age was responsible for the bulk of the variance explained by the full model (partial R 2  0.20), and the inclusion of restrictions actually lowered the variance explained in the model (-0.001). Our before/after RDA exploring the influence of storm surge from Hurricane Sandy on change in our community metrics explained almost no variance in our dataset (Supplementary material Appendix 4, adjusted R 2  0.001). Univariate regressions exploring marsh age exhibited quadratic relationships in three of the four traditional species metrics. The most variance was explained in rarefied richness (R 2  0.23, p  0.001, Fig. 3a) , followed by N (R 2  0.19, p  0.001, Fig. 3c ), and total biomass (R 2  0.08, p  0.001, Fig. 3d ). Little variance was explained by evenness (R 2  0.02, p  0.9, Fig. 3b ). Inflection points for the rarefied richness, N, and total biomass quadratic curves occurred at 40.05, 39.97, and 40.01 degrees north latitude (Fig. 3a, b, d) , respectively, values all within 0.5 decimal degrees of the LGM ice sheet extent."}, {"section_title": "Functional diversity metric (CHSI)", "text": "We identified the most commonly detected species in surveyed tidal marshes by scree plot (n  106) in northeastern U. S. tidal marshes. To quantify tidal marsh specialization for these species, we used the marsh specialization index (MSI, Correll et al. 2016 ) produced through comparison of relative abundance estimates from 2012 as measured by the North American breeding bird survey (BBS, Sauer et al. 2015) to those measured in tidal marshes during 2012 by our tidal marsh surveys. This produced MSI values that quantify a species' relative habitat specialization to tidal marsh, with values ranging from 0 (terrestrial specialist) to 1 (tidal-marsh specialist) with MSI values for generalist species falling in between these two extremes. We used survey data from 2012 because surveys for this year occurred before Hurricane Sandy but after the pilot year of our data collection (2011).\nWe then used MSI values to produce an index of assemblage specialization for each survey point across all surveys. We took a weighted average of MSI for each species detected divided by the average number of individuals of that species detected at the point over all visits. This produced a community habitat specialization index (CHSI) quantifying the average degree of tidal marsh specialization at each survey point. When no MSI value was available for a species, we used an MSI  0. We calculated CHSI using the following equation:\nCommunity habitat specialization index values ranged 0.02-1.00 (m  SE  0.69  0.01, Supplementary material Appendix 5). The linear regression of CHSI against latitude with a quadratic term (Fig. 4) had an adjusted R 2 of 0.12 and a p-value  0.001. This polynomial relationship explained slightly more variance than a simple linear model between the two terms (R 2  0.17, p  0.001). There was no relationship between delta CHSI and storm surge (R 2  0.01, p  0.63)."}, {"section_title": "Landscape metrics", "text": "To account for differences in bird communities based on marsh patch area (Benoit and Askins 2002) , we defined and measured habitat patches using methods developed in Wiest et al. (2016) . We created a 50 m buffer around all tidal marsh polygons delineated in the NWI E2EM layer. When polygons intersected, we considered them the same habitat patch for tidal marsh birds, based on local home range sizes (Shriver and Hodgman 2010) maintained by the saltmarsh sparrow, a passerine endemic to tidal marshes of the northeastern United States. We also measured distance upriver by measuring the distance of each survey point to the coastline in ESRI's ArcGIS 10.3.\nPatch area ranged 0.11-12 706.76 ha (m  SE  1509.93  2831.71) and distance upriver values ranged 0.40-5949.11 m (m  SE  0.69  0.01). We found a strong positive relationship between latitude and patch area (R 2  0.33, p  0.001, Supplementary material Appendix 6) that was not improved by a quadratic term. ) in redundancy analyses (RDA) exploring large-scale patterns in community structure in tidal marsh birds between Maine and Virginia. Potential explanatory variables include linear and quadratic latitude (decimal degrees), number of tidal restrictions affecting the survey point, and impact of extreme storm event hurricane 'Sandy'. All metrics were scaled prior to analyses to allow comparison of relative influence between predictors. "}, {"section_title": "Statistical analysis", "text": "We completed all statistical analyses using program R 3.2 (R Core Team). To satisfy assumptions of normality in our metrics, we transformed values using logit (CHSI, evenness) and natural log (N, total biomass) transformations. We directly compared the explanatory power of disturbances at several timescales through redundancy analysis (RDA) using the 'rda' function in the 'vegan' package (Oksanen et al. 2015) . This is a multivariate analysis technique involving simultaneous constrained ordination of multiple continuous community metrics (rarefied richness, Pielou's evenness, N, total biomass) and continuous explanatory variables (marsh age, degree of tidal restriction, and storm surge) to adjust for collinearity in both the explanatory and response variables, a problem chronic to the analysis of species diversity metrics (Gotelli and Colwell 2001) . We conducted two RDAs: one RDA explored influence of latitude and tidal restrictions on species diversity metrics measured from our 4-yr dataset, while the other explored influence of storm surge on change in our species diversity metrics before and after Hurricane Sandy. We were not able to combine these analyses into a single RDA because the dependent variables differed between these two analyses. We included a quadratic term for our marsh age metric in the first RDA due to the strong quadratic relationship exhibited between this disturbance variable and diversity metrics. In both RDAs we included distance from coastline and marsh patch area to account for differences in community structure due to these landscape characteristics. We compared relative strengths of explanatory variables within each RDA by scaling the variables and including them in a set of candidate models containing subsets of the explanatory variables (Table 1 ) and comparing adjusted R 2 values of models with and without the explanatory variables included. Constrained ordination methods such as RDAs do not have a log-Likelihood and therefore cannot have AIC values calculated (Oksanen et al. 2015) ; we therefore only used adjusted R 2 to compare RDA models with one another.\nBased on the findings from our RDAs we explored the relationship between latitude (including the quadratic term) and our diversity metrics in a set of linear regressions ('lm' function in base R) using adjusted R 2 and p-values using an a  0.05. The use of adjusted R 2 in ecological study (O'Connell et al. 2000 , Hengl et al. 2009 ) allows us to directly compare the variance explained by each model. To explore alternative hypotheses for our findings we explored the relationship between CHSI, NDVI, patch area, and latitude using similar methods."}, {"section_title": "Results", "text": ""}, {"section_title": "Unit of summarization", "text": ""}, {"section_title": "Discussion", "text": ""}, {"section_title": "A Pleistocene-era event explains present-day patterns in bird diversity", "text": "We found that the millennial-scale gradient of marsh establishment after the LGM explains the most variation in species biodiversity in tidal marsh bird communities of the covariates tested (Fig. 2, 3) . We found that species diversity peaked in the center of the latitudinal range surveyed (rarefied richness, abundance N, and total biomass) which is concurrent with the LGM extent of the Laurentide ice sheet (~ 40° latitude), a pattern previously unrecorded in the literature. We posit that the pattern of formation of tidal marshes after the LGM drove staggered rates of marsh colonization by generalist species and subsequent evolution of habitat specialization and competitive exclusion in marshes across latitude to produce the current community patterns we observe here. The linear relationship between marsh age and functional diversity (CHSI, Fig. 4 ) supports this hypothesis, showing the highest levels of habitat specialization occurring in the oldest (southern) marshes and decreasing into the most recently formed (northern) marshes. "}, {"section_title": "Historical contingency in tidal marsh bird diversity", "text": "We hypothesize this pattern of marsh bird diversity peaking at the LGM is driven by the development of local tidal marsh specialization initiated at vastly different points in geological time at the southern and northern parts of our survey areas (Fig. 5) . The coast south of New York experienced relatively regular rise in sea level beginning 18 000 yr ago due to melting ice and sinking ground, while the coastline north of Boston was initially submerged as the ice retreated because of isostatic depression caused by the mass of ice (Boulton and Clark 1990) . Sea level here fell rapidly after deglaciation 12 500 yr ago, and then rose irregularly thereafter. Thus, marsh vegetation south of New York likely began expansion from fringing marshes 18 000 yr ago and expanded as sea level rose over the low-gradient terrain (Belknap and Kraft 1977, Nikitina et al. 2000) . In New England, no marshes likely existed until after recolonization by marsh vegetation during a time of slowing sea level just 7000 yr ago (Engelhart et al. 2011 , Engelhart and Horton 2012 , Kelley et al. 2013 .\nSeveral bird species specialized to tidal marsh habitat currently breed in the northeastern United States, including the saltmarsh sparrow, a species limited almost exclusively to these coastal marshes during the summer months (Greenlaw and Rising 1994) . These marshes, however, did not persist past small fringing patches and were likely unable to support specialist species exclusively during the LGM. Evolutionary change is possible over very short timescales of even a few generations (Grant and Grant 2006) , and niche shifts can also occur on similar timescales (Pearman et al. 2008) . While tidal marsh specialization has been previously suggested to drive speciation over longer timescales spanning multiple glacial-interglacial intervals Avise 1993, Chan et al. 2006) , the lack of local tidal marsh refugia capable of supporting specialist species in and around our study area likely limited the development of local tidal marsh specialization until after the LGM. Because growth of tidal marshes occurred relatively soon after the LGM in the south, this habitat had roughly 18 000 yr to 1) recruit colonizing birds and 2) present a stage on which the evolution of local tidal marsh specialization could transpire. Northern marshes were colonized roughly 7000 yr ago, approximately 11 000 yr later than marshes south of New York. We therefore see lower amounts of specialization in northern marshes, with intermediate levels of specialization between these two extremes. (Fig. 5 inset) .\nThis staggered evolution of specialization could drive differential rates of colonization and competitive exclusion (Hardin 1960 ) that result in the humped distribution of our data. In this scenario, southern marshes support a majority of habitat specialists (e.g. seaside sparrow A. maritimus, MSI  0.99) that exclude more generalist species (e.g. song sparrow, Melospiza melodia, MSI  0.72; savannah sparrow Passerculus sandwichensis, MSI  0.76) due to their heightened ability to utilize and actively defend resources, resulting in low bird diversity in these areas. In northern marshes, generalist species are still actively colonizing this newly-formed habitat, again resulting in low diversity numbers. Specialists in the south may also be dispersing northward due to environmental change (Thomas and Lennon 1999, Doak and Morris 2010) , while colonizing species in the north concurrently disperse southward. In this scenario highest bird diversity would therefore occur where specialist species from the north and generalist species from the north overlap but specialist birds do not occur with enough density to drive competitive exclusion mechanisms occurring in the south. The melting pot of these two communities would therefore occur in the center of the study area (Fig. 4) .\nBut why does species diversity peak at the ice sheet extent during the LGM? We believe this pattern is driven by the properties of physical substrate available to tidal marshes north and south of the LGM, again created by paleo-climate events. Repeated glaciations have removed most sediment cover north of New York and left bedrock with bouldery glacial deposits in many places. The New England coastline is rocky, with bedrock orientation providing the coast with its characteristic, irregular shape and high topographic relief (Hapke et al. 2014) . Marshes exist as fringing marshes in sheltered, rocky estuaries or behind beaches near sandrich rivers or adjacent to eroding bluffs of glacial sediment. South of New York, the Coastal Plain remains a gently sloping surface comprised of sandy and muddy materials, where barrier islands fronting lagoons and extensive marshes dominate the shoreline. This gradient of marsh substrates from north to south drives some of the current patterns in the marsh matrix (Bertness 1991) and could also contribute to the peaked pattern in species diversity we observe centered around the apex of habitat heterogeneity at the LGM extent of the Laurentide ice sheet. Similar spikes in diversity occur in areas of successional or habitat transitions (Araújo 2002 , Smith et al. 1997 ), albeit at different timescales."}, {"section_title": "Support for historical contingency in functional diversity", "text": "It is important to note that our paleo-scale gradient is latitude, which is perhaps the most well-examined and studied of ecological gradients (Pianka 1966, Hampe and Petit 2005) . Major biological properties such as species diversity, range size, body size, pigmentation, and numerous abiotic variables such as precipitation and temperature covary with latitude. The negative relationship we find between CHSI and latitude (Fig. 2b ) therefore provides important secondary support for our hypotheses concerning historical contingency of marsh formation and subsequent evolution of local habitat specialization in tidal marshes. CHSI is highest in the south, indicating high levels of community specialization (many specialists, few generalists) in older marshes. CHSI decreases to the north, indicating lower levels of community specialization, suggesting terrestrial and generalist species are more common in these areas. "}, {"section_title": "Alternate hypotheses for biodiversity patterns", "text": "Known latitudinal trends exist in our study area, providing fodder for alternative hypotheses to explain our findings. Perhaps best known is the latitudinal diversity gradient; biological diversity is negatively associated with latitude across numerous taxa and ecological studies (Mittlebach et al. 2007 ). Local rates of sea level rise are also negatively related to latitude (NOAA 2016). The increasing southward pattern shown in these metrics, however, does not follow the arching pattern peaking at middle latitudes demonstrated in our survey data, making these variables unlikely drivers of the patterns we observe. Urban development and density along the Atlantic coast peaks around New York City in the middle of our survey area, and an influx of terrestrial and generalist species from this urban development could create this peak in diversity. In this scenario, however, we would also expect to see a convex trend in CHSI, with specialization values higher to both the north and the south of this concentration point of urbanization. Our linear trends in CHSI make it unlikely that urbanization is the central driver of diversity in this system. An influence of specialist migrants from the south affecting a resident population of generalists could also produce this pattern, however almost all species regularly breeding in tidal marshes between Maine and Virginia are migrants (Supplementary material Appendix 3), negating the possibility of an underlying resident pattern in our data. Finally, the arched patterns shown in our traditional diversity metrics are also commonly seen in theoretical and empirical depictions of the intermediate disturbance hypothesis (IDH, Connell 1978) . Our gradient of marsh formation, however, does not measure frequency or degree of disturbance that drives the ecological patterns described by the IDH, making this example ill-fitted for support or refutation of this hypothesis. There is also substantial evidence showing a relationship between primary productivity and diversity across taxa (Gillman et al. 2015) ; an increasing pattern in productivity southward or a peak in primary productivity in the center of our study area could explain the species diversity pattern we observe. To explore this alternative hypothesis we measured peak normalized difference vegetation index (NDVI, Pettorelli et al. 2005 ), a common measure of primary productivity, across our study area during green-up (July-September). We found no relationship between latitude and these NDVI values (Supplementary material Appendix 7), suggesting that primary productivity (and the environmental variables influencing primary productivity) were unlikely to have appreciably contributed towards the large-scale trend we observe.\nInterestingly, the extreme storm event of Hurricane Sandy explained almost no variance in our before/after dataset. A similar analysis done at the species level for both birds and plants (Field 2016 ) produced similar results, showing no change in specialist species presence or abundance before and after the storm. The lack of compelling patterns across this particular disturbance scenario adds weight to the description of tidal marshes as one of the more resilient ecosystems occurring globally (Wigand et al. 2015) . Perhaps this resilience is due to selection provided by the daily disturbance of incoming and outgoing tides endured by this ecosystem. An additional extreme storm surge lasting only 1-2 days may not be enough to permanently shift biotic communities in one direction or the other. More research is necessary to determine any long-term impacts of this storm on the tidal marsh bird community.\nLastly, tidal restrictions have been previously shown to be the driving factor of species decline in the specialist marsh bird community in the tidal marshes we examine in this paper (Correll et al. 2017 ). However, our findings at the community level show no noteworthy variation in diversity explained by degree of tidal restriction, demonstrating a stark contrast between drivers across the scale of ecological organization in this system. Changes at the species level in this ecosystem appear to be influenced by disturbances at time scales on the order of decades, while drivers of community diversity are strongest across millennia due to interactions between ecological and evolutionary forces."}, {"section_title": "Conclusions", "text": "Our findings suggest species biodiversity patterns in tidal marsh birds may be best explained by staggered marsh formation across millennia following deglaciation after the LGM. We hypothesize that establishment of tidal marshes across many millennia drove differential rates in colonization of these marshes and subsequent evolution of local habitat specialization. The increasing levels of community specialization shown in CHSI values across latitude support this hypothesis, making this example of historical contingency one of the first to quantitatively describe patterns on this scale using both functional and species diversity metrics. Additional work is necessary to confirm the causative nature of our hypothesis.\nOur work has several implications for future biodiversity studies. We demonstrate a method to compare functional and species diversity using observational data through the relation of habitat use to life history traits. We show that the same driver can create different patterns across species and functional diversity measures, allowing us to triangulate on possible explanations for the patterns we observe. We also find no short-term effect of Hurricane Sandy on tidal marsh bird diversity, and encourage more work in this area in the years following the storm to estimate longer-term effects of this disturbance. Most importantly, we reiterate the importance of the inclusion of historical contingency in future work considering drivers of functional and species biodiversity, both to reproduce the findings shown here as well as to add depth to the explanation of what factors influence patterns of life across our planet. "}]