[{"section_title": "INTRODUCTION", "text": "Human papillomavirus (HPV) is a group of related viruses that cause warts on the arms, chest, hands feet, and mucous membranes. Genital HPV occurs on the mucous membranes, which are the moist surface layers of the body that are open to the outside, such as the vagina, anus, mouth, and throat. High-risk HPV types have been linked with and are known to cause cancer (American Cancer Society, 2015) . High-risk or oncogenic human papillomaviruses cause most anal, vaginal, vulvar, penile, oropharyngeal cancers, and virtually all cervical cancers. Most HPV infections clear without treatment within 1 to 2 years, but infections that persist for many years can progress to pre-cancers or cancers (National Cancer Institute [NCI]), 2015). The Advisory Committee on"}, {"section_title": "Immunization", "text": "Practices recommends routine vaccination of females aged 11-12 years with 3 doses of Cervarix®, Gardasil®, or Gardasil 9® and routine vaccination of males aged 11-12 years with 3 doses of Gardasil® or Gardasil 9®. Vaccination is also recommended for females aged 13 through 26 years and males aged 13 through 21 years who have not been vaccinated previously or who did not complete 3 doses of the vaccine (Petrosky et al., 2015) .\nCervarix® (bivalent) prevents infection with HPV types 16 and 18; Gardasil® (quadrivalent) prevents infection with types 6, 11, 16, and 18; prevents infection with types 6, 11, 16, 18, 31, 33, 45, 52 , and 58, all of which cause anal, vulvar, vaginal and cervical pre-cancers and cancers. Either of the three vaccines can be used to prevent infection with HPV types 16 and 18, which are responsible for 70% of cervical cancers and cause about half of vaginal, vulvar, and penile cancers (NCI, 2015) . Further, these vaccines prevent formation of anal, vulvar, vaginal, and cervical pre-cancers and cancers caused by Other HPV types, such as HPV 31, 33, 45, 52, and 58, cause about 25% of cervical pre-cancers and 10% of invasive HPV-associated cancers. HPV types 6 and 11 cause 90% of anogential warts and most cases of recurrent respiratory papillomatosis (Petrosky et al., 2015) . Further, HPV-16, which causes about 85% of all cases of anal cancer, has been linked to more than half of the cancers diagnosed in the oropharynx (NCI, 2015) . HPV vaccines, which protect against high-risk HPV types known to cause cancer, are most effective when given before an adolescent becomes sexually active. HPV transmission can also be reduced by screening for cervical cancer, using condoms, and limiting the number of sexual partners (American Cancer Society, 2015 The national analysis showed that approximately 26,000 new cancers were attributable to HPV (18,000 among females and 8,000 among males) (Human Papillomavirus-Associated Cancers -U.S., 2012). The objective of the present research was to determine the incidence of HPV-associated cancers in Georgia (GA) by analyzing cancer registry data for GA from 2008-2012, provide estimates on the HPV-associated cancers, and examine the incidence of HPVassociated cancers by geography."}, {"section_title": "METHODS", "text": "The incidence of HPV-associated cancers in GA during [2008] [2009] [2010] [2011] [2012] 2004-2008,\" in order to analyze the burden of invasive cancers at specific anatomic sites known to be associated with HPV, including cancers of the cervix, vulva, vagina, penis, anus, and oropharynx. Additionally, included in the analyses were specific cell types known to contain HPV DNA; these were carcinoma of the cervix and squamous cell carcinoma (scc) for all other sites (Centers for Disease Control and Prevention, 2012) . For oropharyngeal cancers specific sites included were those where HPV was most likely to be found: base of the tongue, tonsils, and other sites in the oropharynx. Age-adjusted rates and age-specific incidence rates were calculated per 100,000 persons using Statistical Analysis Software (SAS®) 9.4 and standardized to the 2000 U.S. Standard Population. Incidence rates were considered significant at p≤0.05. Based on previous reports, the percentage of each cancer found attributable to HPV was calculated by multiplying the average annual number of HPVassociated cancers by the percentage of cancers attributable to HPV (Gillson et al., 2008) . Data were analyzed by sex, age, race/ethnicity, and geographic location. Race/ethnicity categories included nonHispanic (NH) whites and NH blacks. The incidence of HPV-associated cancers by geography was calculated by use of 2013 Rural-Urban Continuum Codes used to classify metropolitan (metro) counties by the population size of their metro area and nonmetropolitan counties by degree of urbanization and adjacency to a metro area or areas. Metro>1million includes counties in metro areas of 1 million population or more (N=29). Metro 250,000-1 million includes counties in metro areas of 250,000 to 1 million population (N=15). Metro<250,000 includes counties in metro areas of fewer than 250,000 population (N=30). Smaller Urban includes urban population of 20,000 or more, adjacent to a metro area, Urban population of 20,000 or more, not adjacent to a metro area, Urban population of 2,500 to 19,999, adjacent to a metro area, and Urban population of 2,500 to 19,999, not adjacent to a metro area (N=63). Rural includes completely rural or less than 2,500 urban population, adjacent to a metro area, and completely rural or less than 2,500 urban population, not adjacent to a metro area (N=22). [2008] [2009] [2010] [2011] [2012] 6 ,056 HPV-associated cancers were diagnosed in GA--2,408 among males and 3,648 among females. For males, oropharyngeal cancer was the most common, with 1,876 cases annually (Table  1) . Males (age-adjusted rate (AAR) =7.8/100,000) were more than four times more likely to be diagnosed with oropharyngeal cancer than females (AAR=1.7/100,000). For both sexes, oropharyngeal cancer was significantly higher among NH whites (males: AAR=9.0/100,000; females:"}, {"section_title": "RESULTS", "text": ""}, {"section_title": "During", "text": "AAR=1.9/100,000) than NH blacks (males: AAR=6.1/100,000; females: AAR=1.3/100,000). Anal cancer was higher among females (AAR=2.2/100,000) than males (AAR=1.6/100,000) and was significantly higher among NH white females (AAR=2.6/100,000) compared to NH black females (AAR=1.5/100,000). However, anal cancer was higher (but not statistically different) among NH black males (AAR=1.9/100,000) compared to NH white males (AAR=1.5/100,000) ( Penile cancer rates were higher, but not significant, among NH black males (AAR= 1.1/100,000) compared to NH white males (AAR= 0.8/100,000). Cervical cancer, with 1,940 cases, was the most common cancer among females (Table 1 ). The rate of cervical cancer was higher among NH black females than NH white females (AAR=8.8 /100,000 vs AAR= 7.7/100,000). Rates of vulvar cancer were significantly higher among NH white females (AAR=2.5/100,000) than NH black females (AAR=1.5/100,000). Vaginal cancer rates were slightly higher among NH black females (AAR=0.7/100,000) compared to NH white females (AAR=0.4/100,000). In GA, 4,629 cancers that occurred during 2008-2012 were attributable to HPV --1,574 among males and 3,055 among females. The most common cancers attributable to HPV were oropharyngeal cancers (1,182) among males and cervical cancers (1,862) among females (Table 2) ."}, {"section_title": "Characteristic", "text": "Males living in metro counties (250,000 to 1 million) had the highest oropharyngeal incidence rate compared to the state incidence rate; males living in rural counties had a significantly lower rate. Males living in smaller urban counties had the lowest anal SCC incidence rate. Males living in smaller urban counties had the highest penile SCC incidence rate and males living in metro counties (1 million or more) had the lowest rate. Females living in metro counties (250,000 to 1 million) had the highest oropharyngeal incidence rate, and females living in metro counties (1 million or more) had the lowest rate. Females living in rural counties had the highest anal SCC incidence rate, and females living in metro counties (1 million or more) had the lowest rate. Females living in smaller urban counties had a significantly higher cervical cancer incidence rate than females living in metro counties (1 million or more) and females living in metro counties (1 million or more) had the lowest rate. Females living in smaller urban counties had the highest vulvar SCC incidence rate, and females living in metro counties (less than 250,000) had the lowest rate. Females living in metro counties (250,000 to 1 million) had the highest vaginal SCC incidence rate. Females living in all geographical areas in GA had similar rates of vaginal cancer (Table 3 )."}, {"section_title": "Site", "text": "*Source: Gillison et al., 2008 . **The estimated number of HPV-attributable cancers calculated by multiplying the HPV-associated cancer counts from Table 1 by the percentage of each cancer attributable to HPV. Estimates were rounded to the nearest tenth or hundredth. Female and male anal cancers do not equal the total number of anal cancers because of rounding."}, {"section_title": "DISCUSSION", "text": "In GA, incidence rates were calculated for specific sites known to be associated with HPV. The vulvar scc incidence rate for GA was higher than the U.S. rate (2.1/100,000 vs. 1.8/100,000). For GA, the incidence rates for vulvar, anal, and oropharyngeal scc among males and females were higher than U.S. rates.\nVaginal and penile cancer incidence rates were slightly higher than those for the U.S., while cervical cancer incidence rates in GA were similar to the U.S.\n(Human Papillomavirus-Associated Cancers -U.S., 2012). In GA from 2008-2012, females had a higher total number of cases than males (females, 3,648; males, 2,408) from 2008-2012. Slightly more than half of the total cases among females in GA were due to cervical cancer (1,940, 53.2%). Of 2,408 cases among males, more than half were from oropharyngeal cancer (1,876, 77.9%).\nAccording to the Behavioral Risk Factor Surveillance Survey in 2014, the cervical cancer screening rate for women aged 21-65, using 2012 screening guidelines, was 89% in GA overall, 88% among NH white females, and 95% among NH black females. Although cervical cancer screening rates were higher among NH black females, from 2008-2012 the age-adjusted cervical cancer incidence for this group was the highest in the state (9.2 per 100,000) (Georgia Comprehensive Cancer Registry, 2015) . High cervical cancer screening rates could indicate a targeted effort in reaching and screening this population and may indicate a reduced access to screening services among this group and/or to a lack of follow up (Shavers & Brown, 2002; Fiscella et al., 2011) . HPV vaccination should help reduce cervical cancer incidence rates. Barriers, including a lack of understanding of the HPV vaccine and age to vaccinate, along with strong physician recommendation must be addressed (Olshen et al., 2005; Brewer et al., 2007; Gilkey et al., 2015) .\nAccording to the National Immunization SurveyTeen, in 2014, in GA 65.4% of females and 41.2% of males aged 13-17 years received ≥1 dose of HPV vaccine, but only 47.1% of females and 21.0% of males aged 13-17 years received ≥3 doses. Nationally, 60.0% of females and 41.7% of males aged 13-17 years received ≥1 dose of HPV vaccine, but only 39.7% of females and 21.6% of males aged 13-17 years received ≥3 doses (Georgia Department of Public Health, 2015). Thus, few adolescents completed the recommended 3 doses of the HPV vaccine. Estimates of HPV vaccine uptake for females in GA were higher than national estimates. GA HPV vaccination estimates among males were similar to national estimates at ≥1 and ≥3 doses, but lower than estimates among GA females, indicating the need for increased promotion of the HPV vaccine among males (Georgia Department of Public Health, 2015) . Increasing vaccination coverage among this age group is necessary to protect adolescents from HPV exposure. Further, improving cervical cancer screening should prevent the development of invasive cervical cancer. Among some parents with at least one child between ages 10 to 15 years old, there is a lack of understanding of the HPV vaccine (Olshen et al., 2005) . Acceptability is higher among parents who believe their child, at some point, would be exposed to HPV. Parents disagree on the age to vaccinate; some believed it would be easier to vaccinate at a younger age; some worry about encouraging unsafe sexual activity; and others want their child to take part in the decision to be vaccinated. Physician recommendation affects parental acceptance of vaccination. Similarities were found in a systematic review of HPV vaccine acceptability. As established in this review, parents had positive reactions to the HPV vaccine and were comfortable with it when they believed that the vaccine was effective, a physician recommended the vaccine, and they felt HPV infection was likely (Brewer et al., 2007) .\nThe uptake of the HPV vaccine is reliant on physician recommendations. When making health decisions for their adolescents, parents generally trust what their health providers recommend. In a study performed in 2014 (Gilkey et al., 2015) , 776 U.S. physicians (53% pediatricians, 47% family medicine physicians) were surveyed. The study assessed perceptions and communication in administering vaccines to 11-12 year old patients. Of the physicians, 73% reported that the HPV recommendation was highly important for adolescents, but only 13% viewed the HPV vaccine as being highly important to parents. Physicians also noted that the explanation for HPV vaccination took twice as long as that for Tdap.\nNews media coverage of the HPV vaccine has affected the uptake of HPV vaccination. One study (Casciotti et al., 2014) found that news media coverage of HPV vaccination often presented HPV infection as unavoidable, used scare tactics, and presented cervical cancer as life threatening, which created fear. Additionally, 30% of articles presented the ideas that HPV vaccination promotes premarital sex and encourages sexual behavior. These issues affected the perceptions, feelings, and attitudes associated with HPV vaccination.\nThe differing incidence rates for HPV-associated vulvar, vaginal, penile, and anal are not fully understood. Differences may be due to demographics, access to screening, tobacco use, or other environmental or specific factors relating to HPV. Differences in the incidence rate of oropharyngeal cancers may be due to tobacco use and alcohol use. HPV infection may also be involved. Differing risk factors, such as age and sexual behaviors may also be responsible for the varying incidence rates (Smith et al., 2010) . Geographically, no apparent trend was seen as related to the Rural-Urban classification."}, {"section_title": "CONCLUSIONS", "text": "HPV-associated cancers can be prevented by HPV vaccines, cervical cancer screening, and educating youth about risk factors associated with HPV infection. Surveillance of HPV-associated cancers using GA cancer registry data is needed to track future changes in incidence data due to administering the HPV vaccine, recommending cervical cancer screening, and educating youth in regard to risk factors. Increasing vaccination coverage among young adults will protect adolescents from HPV-related infections. Parents of adolescents take physician recommendations into consideration when making health decisions. However physician's reluctance in recommending the HPV vaccine creates a missed opportunity for parents to consider HPV vaccination for their adolescent (Olshen et al., 2005; Brewer et al., 2007; Gilkey et al., 2015) .\nProvider education is needed so that HPV vaccination among adolescents can coincide with routine immunizations. Physician reluctance to recommending the HPV vaccine suggests a lack of assurance, understanding, and approach in which to discuss the vaccine with parents. Providing HPV vaccine communication strategies for healthcare providers can enable them to utilize opportunities to present the HPV vaccine to parents when discussing the adolescent immunization schedule (Gilkey et al., 2015) .\nAdditionally, among parents of adolescents there is a lack of understanding about the nature of HPV and the HPV vaccine. Educational campaigns should aim to increase parents' knowledge of HPV, the HPV vaccine, and the importance of completing the HPV vaccine dosage series before their teen engages in sexual activity (Brewer et al., 2007) . HPV planning activities must address these barriers so that the vaccine is recommended with the routine adolescent immunization schedule and is promoted as a safe procedure that prevents HPV infections and HPVassociated cancers. Further, there should be a continued effort to promote cervical cancer screening, especially to minority groups where disparities remain. Since there are no screening programs for oropharyngeal, anal, penile, vulvar, and vaginal HPVassociated cancers, HPV vaccination can be an effective tool in the prevention of these cancers. . However, registry data do not capture HPV status. Estimates are provided in this report, but the number of HPV associated cancers and HPVattributable cancers may have been under-or overestimated. Smoking, demographics, and behavioral factors may also be involved in the variation in rates of HPV-associated cancers; these factors are not captured in cancer registry data."}]