[{"section_title": "Abstract", "text": "Understanding the impacts of the Uruguay Round (UR) Agreement on southern commodities serves as a starting point to assess the potential impacts of the next global trade negotiations in terms of hope (expanding export markets) and fear (new competition). Key issues examined in this research include whether or not the UR Agreement resulted in new markets or new competition for key southern commodities-cotton, poultry, tobacco and rice. For new markets, exports were analyzed to determine if they increased since the passage of the UR Agreement in 1994. Also, countries which are leading world importers of these key southern commodities were identified to determine whether the U.S. is exporting to these top markets.\nAlternatively, to analyze whether the UR Agreement resulted in new competition for southern commodities, countries that are leading world exporters were identified to determine whether the U.S. is among these leading exporting countries. Data analyses was supplemented with interviews of southern commodities experts, who assess impacts of the GATT-UR and identify issues for the next round."}, {"section_title": "", "text": "Today, my SAEA Presidential Address focuses on the next round of global trade negotiations and the hopes and fears as sociated with potential outcomes for southern agriculture. I will briefly discuss the history of the General Agreement on Tariffs and Trade (GATT) and the World Trade Organization (WTO); the impacts of the Uruguay Round Agreement on major southern agricultural commodities; the potential outcomes for the next round of global trade agreements on these key southern commodities-whether or not they provide new market opportunities, which is the \"hope\" part of my title, or new competition, which is the \"fear\" part of my title. I will also discuss general issues for the next trade agreement; and close with a challenge to our profession."}, {"section_title": "History of the GATT/WTO 1", "text": "The General Agreement on Tariffs and Trade was established by 23 countries in 1947-48. Originally the GATT focused on traded goods only and included a forum for trade negotiations, tariff reductions, and a cumbersome dispute settlement procedure. The World Trade Organization, which evolved from the GATT-Uruguay Round now has more than 130 member countries. The GATT/WTO is headquartered in Geneva, Switzerland.\nEight trade rounds have occurred since the inception of the GATT in 1947 in Geneva (WTO, 1998 . The first five rounds concentrated solely on reducing tariffs. Fewer than 40 countries were involved. The Kennedy Round, from 1964 Round, from -1967 , also focused on anti-dumping in addition to tariff reductions and involved 62 countries. The Tokyo Round, 1973 Round, -1979 , also examined some non-tariff barriers with 102 countries involved. The most recent round, the Uruguay Round, lasted from 1986 to 1994, with 123 countries participating. In this Round, for the first time, agricultural commodities and intellectual property rights were included in the discussions. Further, a dispute settlement mechanism was proposed, and the World Trade Organization was created. The Uruguay 1 For more information on the GATT/WTO, see Agriculture in the WTO, recently published by the U.S. Department of Agriculture (USDA)-Economic Research Service (ERS), as well as the following web sites, which are specified in the references: the World Trade Organization (WTO), the U.S. Trade Representative (USTR), the USDA-ERS WTO Briefing Room, USDA-Foreign Agricultural Service (FAS), the Foreign Agricultural Organization (FAO) of the United Nations, and the International Institute for Sustainable Development.\nRound is described in more detail below."}, {"section_title": "Outcomes of the GATT-Uruguay Round Agreement", "text": ""}, {"section_title": "Overview", "text": "Starting from a broad perspective, the Uruguay Round (UR) created the World Trade Organization, which covers trade in goods, services and intellectual property rights. In contrast, the GATT focused solely on traded goods; thus the WTO serves as an umbrella organization encompassing all three areas (World Trade Organization, 1998) . Additionally, the UR Agreement established a Dispute Settlement Body (DSB), for the purpose of settling disputes among WTO member countries. Most recently, the DSB sided with the U.S. over the preferential treatment by the European Union (E.U.) to former European colonies in the banana trade.\nAs described in the WTO's 1998 publication Trading into the Future, although the legal texts of the Uruguay Round consist of a \"daunting list of about 60 agreements, annexes, decisions and understandings,\" the agreements fall into a simple structure. \"The agreements for the two largest areas of trade-goods and services-share a common three-part outline, even though the detail is sometimes quite different.\"\n• \"They start with broad principles: the General Agreement on Tariffs and Trade (GATT) (for goods), and the General Agreement on Trade in Services (GATS). (The agreement on TradeRelated Aspects of Intellectual Property Rights (TRIPS) also falls into this category although at present it has no additional parts.)\n• Then come extra agreements and annexes dealing with the special requirements of specific sectors or issues.\n• Finally, there are the detailed and lengthy schedules (or lists) of commitments made by individual countries allowing specific foreign products or service-providers access to their markets. For GATT, these take the form of binding commitments on tariffs for goods in general, and combinations of tariffs and quotas for some agricultural goods.\"\n\"Much of the Uruguay Round dealt with the first two parts : general principles and principles for specific sectors\" (WTO, 1998) .\nFor goods, (under GATT), many sector specific agreements were included. Specific agreements that relate to agriculture include the\n• Agreement on Agriculture (described in more detail below), which established numerical targets for cutting subsidies and protection. Developed countries were given a six year target, from 1995 to the year 2000, while developing countries were given a 10 year target, from 1995 to 2004. The three target reduction areas included market access, export subsidies and domestic support (See Table 1 for specific cuts. Source: WTO, 1998).\n• Agreement on the Application of Sanitary and Phytosanitary (SPS) Measures, with the intent that these measures were to be based on science, such as the international standards used by the World Health Organization, rather than used as trade barriers (WTO, 1998) .\n• \"Under the URAA, countries pursued comprehensive liberalization of agricultural trade by agreeing to numerical targets for cutting subsidies and protection\" (Table 1 ).\n• \"Market ac cess. In the URAA, countries agreed to open markets by prohibiting nontariff barriers (including quantitative import restrictions, variable import levies, discretionary import licensing, and voluntary export restraints), converting existing nontariff barriers to tariffs, and reducing tariffs. Countries were obligated to provide a minimum level of import opportunities for products that were previously protected by nontariff barriers by establishing tariff-rate quotas (TRQs). TRQs set a relatively low tariff on imports up to the minimum access level, while additional imports face much higher protection. The guidelines established a minimum access level at 3 percent of domestic consumption initially, expanding to 5 percent by the end of the implementation period.\n• Export subsidies. URAA signatory countries also agreed to reduce expenditures on export subsidies and the quantity of agricultural products exported with subsidies, and to prohibit the introduction of new export subsidies for agricultural products.\n• Domestic support. Domestic support reductions were realized through commitments to reduce an Aggregate Measure of Support (AMS), a numerical measure of the value of all trade-distorting domestic policies, with certain exceptions. The intention was to allow governments to support their agricultural sectors and rural economies so long as the measures employed are non-or minimally-trade distorting.\nPolicies not subject to reduction, called \"green box\" programs, include research, inspection, income stabilization, natural disaster relief, and other programs like crop insurance, environmental programs, and rural assistance which could have an effect on production and trade\" (Normile and Simone in USDA-ERS WTO Briefing Room).\nGiven these general outcomes of the GATT-Uruguay Round, the impact of the UR on southern commodities is next discussed."}, {"section_title": "Trade Impacts on Major Southern Commodities", "text": ""}, {"section_title": "An Overview", "text": "Understanding the impacts of the Uruguay Round Agreement on southern commodities can serve as a starting point to assess the potential impacts of the next global trade negotiations. Data analyses are presented below, followed by results of interviews with experts on major southern commodities, who assess impacts of the GATT-UR, and identify issues for the next round.\nFirst, I defined southern agricultural commodities using data from the Census of Agriculture (U.S. Department of Commerce Alternatively, to analyze whether the UR Agreement resulted in new competition for southern commodities, countries that are leading global exporters are identified using the PS&D View database. The key question is to determine whether the U.S. is among these leading exporting countries."}, {"section_title": "Southern Commodities", "text": "This analysis focuses on the top four Southern agricultural commodities by export value-cotton, poultry, tobacco and rice (USDA-FAS; BICO). Given these commodities, key questions concern the relative production of the Southern region of the U. S. and whether U.S. export data for these commodities can be used to proxy exports from the South. The U.S. Department of Commerce's Census of Agriculture produces maps of the U.S. showing the location and amount of production for agricultural commodities. The Southern region of the U.S. dominates cotton production, with additional production in California and Arizona. For broilers, again, the majority of U.S. production occurs in the South. The Census also includes maps showing the change in production between 1987 and 1992. Broiler production has rapidly expanded in the South, while it decreased in California and Washington over this five year period. For tobacco, the South dominates production. And for rice, once again the South is the major producer in the U.S., with some rice production also occurring in California. Since the majority of U.S. production is in the Southern region of the U.S. for these commodities, then U.S. export data serves as a proxy for exports from the South."}, {"section_title": "GATT UR Impacts-The Hope or the Fear?", "text": ""}, {"section_title": "Exports of Key Southern Commodities", "text": "In regards to new market opportunities for major agricultural southern commodities, the general criterion is to determine whether U.S. exports of these commodities have increased since the Uruguay Round was adopted in 1994. Figure 1 includes U.S. export values of our four leading Southern commodities-cotton, poultry, tobacco and rice (USDA-ERS; FATUS). Exports have increased for all four Southern commodities, although some have increased more than others. Exports have increased dramatically for poultry, while cotton exports dramatically increased in 1995, but have since fallen. Less dramatic increases in export values have occurred for rice, while tobacco export values experienced relatively small fluctuations throughout the 1990s. Thus, overall, it appears that exports have increased for these major southern commodities.\nMajor southern commodities are now examined individually to identify (1) leading world exporting countries, and to determine whether the U.S. is among these leading exporters; and (2) leading world importing countries, and to determine whether the U.S. is exporting to these leading markets. This research procedure is consistent with a similar analysis that examined the impact of developing countries on key southern commodities, since developing countries are both important markets and competitors for the South, and this balance varies, depending on the commodity (Marchant and Ruppel, 1993) . Following data analyses, results of interviews with commodity experts are presented to assess the impacts of the GATT-UR as well as identify issues for the next round of global trade negotiations."}, {"section_title": "Cotton", "text": "Cotton is an input into textile manufacturing; thus, the demand for cotton is a derived demand. In figure 2 , major exporting countries for cotton are listed (USDA-ERS; PS&D View). The U.S. has led the world export market throughout the 1990s with Uzbekistan in second place, excluding 1992. Other leading exporting countries include Australia and Syria, both with recent increases in cotton exports, and Argentina and Turkmenistan. Thus, the U.S. has been competitive on the world market in terms of being a leading exporter of cotton.\nTurning to the question of new markets, two questions are relevant: (1) Which countries are leading world markets for cotton exports? And (2) Does the U.S. export to these top markets? In figure 3 , the top world importing countries of cotton are listed (USDA-ERS; PS&D View). Russia was the leading importer in the early 1990s, followed by Japan; however, both countries' cotton exports declined throughout the 1990s. China was the leading cotton importer in the mid-1990s. The recent economic crisis in Asia is reflected by its decline in imports. Other leading cotton importing c ountries include Indonesia, Brazil, and South Korea.\nIn figure 4 , the leading six U.S. export markets for cotton are identified-China, Mexico, Japan, South Korea, Indonesia and Turkey (USDA-ERS; FATUS). Thus, four of the six markets for U.S. cotton exports are also leading world markets-China, Japan, Indonesia, and South Korea. Note the dramatic increase in exports to Mexico, indicating the impact of the North America Free Trade Agreement (NAFTA) and the development of the Maquiladora processing area on the U.S.-Mexican border. Thus, overall U.S. cotton exports have increased since passage of the Uruguay Round Agreement; the U.S. has been the number one world exporting country for cotton, indicating competitiveness; and the U.S. is exporting to countries which comprise top world markets, plus Mexico.\nI spoke with cotton experts Drs. Don Ethridge and Eduardo Segarra (Texas Tech University) about the impact of the GATT-Uruguay Round Agreement on cotton, as well as issues for the next round of global trade negotiations. As shown above, U.S. exports of cotton have increased overall since 1994, when the Uruguay Round Agreement was approved, and exports to Mexico particularly increased. The development of the cotton processing Maquiladora area, on the U.S./Mexican border spurred this increase. In the future, the phase-out of the MultiFiber Agreement (MFA) will hurt U.S. cotton producers and exporters by eliminating U.S. bilateral trade agreements and increasing competition with developing countries. Also for the future, potential problems exist with the economic \"Asian Flu,\" where U.S. cotton exports to China have declined in recent years. This is particularly important since China has been the leading U.S. export market for cotton during 1994-1997."}, {"section_title": "Poultry", "text": "Exports of U.S. poultry have dramatically increased in the 1990s, from just over $1 billion in 1993 to nearly $2.5 billion in 1997 (Figure 1) . On a volume basis, U.S. poultry exports have increased from 554 thousand metric tons in 1990 to over 2.5 million metric tons in 1998 ( Figure 5 ; USDA-ERS; PS&D View). In figure 5 , the leading poultry exporting countries in the world are identified. The U.S. has been the leading world poultry exporter by both volume and value throughout the 1990s, while France has maintained its secondary position, followed by the Netherlands, whose poultry exports were recently surpassed by Brazil on a volume basis (USDA-ERS; PS&D View; FAO; FAOSTAT). China and Hong Kong complete the major poultry exporting countries. Thus, the U.S. has been very competitive in exporting poultry throughout the 1990s.\nOn the marketing side, the leading world importing countries for poultry are identified in Figure 6 by export volume (USDA-ERS; PS&D View). From 1995-97, Russia was the leading importer of poultry followed by Hong Kong and China, where respective poultry imports have steadily risen in the 1990s. Other key importers of poultry include Japan and Germany, who become the top two ranking poultry importing countries from a value basis (FAO; FAOSTAT).\nThe United Kingdom and the Netherlands are also important importing countries from a value perspective, while Saudi Arabia is a leading poultry importer from a volume perspective.\nIn figure 7 , the leading U.S. export markets for poultry are identified by volume (USDA-ERS; FATUS). Russia has been our number one export market both by volume and value (USDA-ERS; FATUS; FAO; FAOSTAT). Russian poultry imports from the U.S. dramatically increased in the mid1990s, peaking in 1997, followed by a recent downturn due to their economic crisis. Hong Kong is the second U.S. export market for poultry, followed by Mexico, and to lesser extent Canada, Japan and Latvia, which are closely grouped. The U.S. top three markets-Russia, Hong Kong and Mexico-hold the same rankings, regardless if the U.S. export data is viewed from a volume or value perspective. Of the six major U.S. export markets, three of the six are also major world markets-Russia, Hong Kong and Japan.\nAccording to poultry expert Dr. H. L. Goodwin (University of Arkansas), phytosanitary regulations prevent the U. S. from exporting poultry to the European Union, which includes important importing countries-Germany, the Netherlands and the United Kingdom. The U.S. and the E.U. currently have a working group of veterinarians trying to harmonize standards. Also, a slow down of industry growth is expected given the economic \"Asian Flu\" and the Russian economic crisis. Recall that Russia and Hong Kong have been the leading U.S. poultry export markets since 1994. Japan may be a potential growth market, since the Japanese do not impose trade restric ting phytosanitary standards. Additionally, growth of U.S. domestic consumption for poultry is slowing. Thus, in summary, U.S. poultry exports have dramatically increased in the 1990s; the U.S. is competitive on the global export market for poultry, being the leading exporting country; and the U.S. does export to top global markets."}, {"section_title": "Tobacco", "text": "Tobacco is a differentiated product. Different tobacco types-such as, burley, flue-cured, and oriental--are blended together during processing. In figure 8 , leading world exporting countries of tobacco are identified by volume (USDA-FAS; Tobacco: World Markets and Trade). Brazil and the U.S. have been the leading exporting countries throughout the 1990s. If exports were shown on a value perspective instead of a volume perspective, the U.S. becomes the number one global tobacco exporter throughout the 1990s (FAO; FAOSTAT). According to tobacco expert Dr. Will Snell (University of Kentucky), the U.S. is quality competitive on the world market but not price competitive. Other important tobacco exporters include Zimbabwe (where its tobacco exports peaked in 1994), Turkey (whic h produces the oriental type of tobacco), and Greece. Italy and Malawi are also major tobacco exporting countries.\nThe leading tobacco importing countries are identified in figure 9 (USDA-FAS; Tobacco: World Markets and Trade). In addition to being a leading tobacco exporter, the U.S. is the top tobacco importing country, followed by Germany, on both a volume and value basis (USDA-FAS; FAO; FAOSTAT). Other leading importers include Russia (on a volume basis only), the United Kingdom, the Netherlands, and Japan.\nGiven the differentiated product characteristics of tobacco needed for the blending process, it makes sense that the U.S. is both a leading importer and exporter of tobacco. In figure 10 , the top U.S. export markets are shown (USDA-ERS; FATUS). Japan and Germany are the top U.S. export markets on both a volume and value basis. Other key importing countries include the Netherlands, Turkey, Belgium and Thailand. Thus, the U.S. does supply tobacco to top world markets-Germany, the Netherlands (which contains a key transhipment port for the European Union), Japan, and the U.S., through domestic consumption. According to Dr. Snell, tobacco markets have been more impacted by political issues, both domestically and internationally, as well as price/quality trade-offs related to blending, compared to the impacts from previous trade agreements. 2 "}, {"section_title": "Rice", "text": "Rice is characterized by a \"thinly-traded\" world market, where individual countries (e.g., China, Japan, and Vietnam) can have a major impact on the world market, depending on their domestic production, be it a shortfall or surplus. In figure 11 , leading world rice exporters are identified by volume (USDA-ERS; PS&D View). Thailand has been the leading exporter throughout the 1990s, both by volume and by value (USDA-ERS; FAO; FAOSTAT). The U.S. has historically been the second leading global exporter of rice by value throughout the 1990s, and by volume during the early 1990s. Vietnam's exports have generally increased throughout the 1990s. India was a major exporting country by volume in the mid to late 1990s, however Italy replaces India as a major rice exporter when viewed from an export value basis. Pakistan is also a leading exporter of rice, on both a volume and value basis, although to a relatively lesser extent than other major exporting countries. China's exports have been highly variable, exhibiting the \"thin\" world rice market characteristics. Thus, the U.S. is one of the world's top exporters of rice, both by value and by volume.\nIn figure 12 , the major importing countries of rice are listed on a volume basis (USDA-ERS; PS&D View). Once again, the \"thin\" world rice market characteristics play a role, so that a variety of major importing countries become dominant in different years. Most recently, Bangladesh has been the top rice importing country. Indonesia's rice imports have been highly variable throughout the 1990s, with 1997 and 1998 imports dramatically rising. Alternatively, rice imports by Brazil and Iran have been less erratic. The Philippines also increased their rice imports in the mid to late 1990s. Japan's imports peaked during the 1993 marketing year--again demonstrating the \"thin\" ric e world market--bottomed-out in 1994, and have generally increased since then, indicating the positive impact of the Uruguay Round. Other leading rice importing countries throughout the 1990s include Saudi Arabia, Iraq, South Africa, Turkey, Nigeria, and Malaysia, although their relative ranking varies by year. On a value basis, top world rice importing countries include Saudi Arabia, Japan, Brazil, the United Kingdom, France, and the United States (FAO; FAOSTAT).\nIn figure 13 , U.S. leading export markets for rice are identified by volume (USDA-ERS; FATUS). Mexico's rice imports from the U.S. have steadily increased throughout the 1990s. Mexico has become the number one market for U.S. rice exports by volume in the late 1990s. Alternatively, Japan's imports of U.S. rice have been highly variable. Japan is the number two market for U.S. rice exports by volume, and the number one market by value (FAO; FAOSTAT). Other top markets for U.S. rice exports include Canada, Haiti, Turkey and Saudi Arabia. Given the \"thin\" world market characteristics for rice, where individual major importing countries vary by year, it is difficult to apply the above competitiveness criterion regarding U.S. exports to top world markets. Based on export volume, the U.S. is exporting rice to one leading global importing country, Japan. However, by export value, the U.S. is supplying rice to three top global importers-Japan, Saudi Arabia, as well as ourselves, the United States. In both cases, other top U.S. export markets include NAFTA neighbors Mexico and Canada.\nAccording to rice expert Dr. Gail Cramer (University of Arkansas), the minimum access requirement of the GATT-Uruguay Round opened up Japanese and South Korean rice markets. It's a start and it should improve.\nExports of U.S. rice have increased since passage of the Uruguay Round Agreement, especially to Japan and Mexico. Also, phytosanitary regulations affect trade with Central and South America to the benefit of U. S. rice producers and exporters. For the future, continued reduction in trade barriers are expected, but the key question is how fast will trade liberalization occur (Cramer, Hansen, and Wailes)? Japan implemented tariffication on rice on April 1, 1999. Considering that the price of rice in Japan is about ten times that of the world price, trade liberalization is expected to dramatically affect their domestic production."}, {"section_title": "General Issues for the Next Trade Agreement", "text": "In the previous sections of this paper, the impacts of the GATT-UR Agreement on major southern commodities were examined in terms of both the hope (expanding export markets), and the fear (new competition). Additionally, key issues for the next round of global trade negotiations were identified through interviews with commodity experts. This section identifies general issues for the next round of global trade negotiations, which may indirectly impact southern commodities. As countries enter this next round of trade negotiations, the \"80:20 Rule\" may prevail. This refers to the concept that the first 80 percent of trade negotiations dealt with \"easy\" issues in terms of trade liberalization in prior trade negotiations, and that the remaining 20 percent of trade liberalization issues are difficult, and that is what is left for future rounds (Robinson) .\nUnresolved issues to be addressed in the upcoming agricultural negotiations include further reductions in export subsidies, moving towards their elimination; expansion of market access through tariff reductions and liberalization of tariff rate quotas; further reductions in domestic support, moving towards decoupling; stricter WTO disciplines on state trading enterprises' (STEs) with increased transparency of STE pricing and operational activities (see Kennedy, Koo, and Marchant); and tighter restrictions on the use of sanitary and phytosanitary (SPS) measures, ensuring that these measures are based on scientific evidence and principles.\nAdditionally, biotechnology used in commercial agriculture raises new issues for the next trade round. Agricultural biotechnology has significant potential for consumers and producers by helping to guarantee a global food supply through increased agricultural production, while conserving habitat. Examples of these genetically modified organisms (GMOs) include corn and soybeans that are insect resistant and herbicide tolerant. The U.S. leads the world in acreage planted to GMOs and in their regulatory approvals.\nDifferences among countries' GMO regulations pose potential barriers to these exports and raise the need for mutual recognition of countries' regulations, harmonization of existing regulations among countries, or by negotiation of an international standard (Normile and Simone). Additional concerns for the next round include the concept of multifunctionality. This refers to issues beyond agricultural trade that enter into the trade negotiations, for example, the impact of trade policies on the environment, rural communities and quality of life.\nThe E.U. is particularly interested in multifunctionality. And finally, there are process issues related to the upcoming negotiations. Specifically, will the next round be long and comprehensive, similar the Uruguay Round, or short and focused, given that it is scheduled to start on January 1, 2000 and the agriculture portion in late 1999 in Seattle, Washington?\nGiven the above discussion of the history of the GATT/WTO, the impact of the Uruguay Round Agreement on southern agricultural commodities and potential outcomes for the next round-the \"hopes and the fears,\" and general issues confronting the next round, I would like to close with a challenge to our profession."}, {"section_title": "Challenge to Agricultural Economists", "text": "In closing this paper on the hopes and fears associated with the upcoming global trade negotiations and potential impacts on southern agriculture, I ask myself does this next round of global trade negotiations present \"hope or fear\" for southern agricultural commodities? It may be both. We agric ultural economists can provide the leadership in addressing these important issues. We have the analytical skills and tools to address these \"hopes and fears\" issues. Regardless of your area of specialization within the field--be it production, marketing, international trade, agribusiness management, resources and the environment, risk assessment, policy analysis, economic development, and others--I challenge you to use your analytical skills to enter this global policy debate. Each of us can contribute valuable information to our peers, students, the general public, the private sector, policymakers and government officials regarding the impact of next round of global trade negotiations. This need for education and outreach to the general public regarding the benefits of trade becomes glaringly apparent during political campaigns. It is important that agricultural economists provide the facts-both positive and negative-on the impacts of international trade. "}]