[{"section_title": "Abstract", "text": "ABSTRACT\nUsing a dataset which allows students to be linked to their teachers, this paper examines how educators with an immigrant background affect the academic achievements of secondary school students in the United States. To account for the possibility that immigrant and native teachers may be assigned to different types of schools, and even within schools, to different types of students, two estimation strategies are employed. The first estimates the immigrant teacher impact by comparing the achievements of students with immigrant teachers to the achievements of observationally similar students with native teachers, within schools. The second compares the achievement of a student with an immigrant teacher in one subject to the achievement of the same student with a native teacher in another subject. The results suggest that, overall, immigrant teachers do not have a negative impact on the educational achievements of native students. Additional tests suggest that this non-adverse effect is due to the greater effectiveness of White immigrant teachers relative to native teachers.\nI21, J15, J61"}, {"section_title": "INTRODUCTION", "text": "The number of teaching professionals with a migrant background has been increasing in the United States (U.S.) over the last decade. A report by the American Federation of Teachers (AFT) estimates that the number of primary and secondary school teachers working in the U.S. on temporary visas has increased from 14,943 in 2002 14,943 in to 19,329 in 2007 14,943 in (AFT, 2009 ). This represents roughly a 30% increase in the number of foreign teachers working in the U.S., in just 5 years. In some cities, immigrants occupy a considerable and growing proportion of the teaching force. For example, the AFT report notes that in 2005, public schools in Baltimore began employing just over a hundred teachers from the Philippines to meet staffing shortages. By 2009, however, the number of Filipino teachers working in Baltimore's public schools had risen to 600. This number means that, by 2009, nearly 10% of the city's entire teaching force was staffed by teachers from the Philippines. Given the growing shortage of teachers in the U.S., this trend of international recruitment across schools looks set to continue. Despite this, little is known about how the presence of these immigrant educators has affected American students' academic achievements and learning experiences.\nAlthough a small number of studies have made efforts in this direction, these have focused exclusively on examining the effects at the undergraduate level and are predominantly based on evidence from the Economics discipline.\nMixed results have been found at the undergraduate level. While a number of studies have found evidence suggesting that immigrant Teaching Assistants and Associates impact the academic performance of undergraduates adversely (Watts and Lynch, 1989; Borjas, 2000; Marvasti, 2007; Becker and Powers, 2001) , an equally large number of studies, some of which have recently emerged, report quite the opposite effects -suggesting that immigrant educators can be as (Jacobs and Friedman, 1988; Saunders, 2001; Asano, 2008) , if not more (Norris, 1991; Fleisher et al., 2002 ) effective in classroom instruction than their native counterparts. The inconsistency in evidence is possibly due to the fact that each study's data come from a different university. Because each university has its own set of instructor hiring requirements (with some universities requiring that potential instructors be trained in teaching methods and/or the English language, or even undergo screening through interviews before they are allowed to teach), the results across studies are unlikely to be comparable. The above studies generally assume Teaching Assistants and Associates to be randomly assigned across students enrolled in a course. As such, simple regression control strategies are typically employed to identify the effect of immigrant educators 1 .\nThe literature has advanced a number of reasons to explain why immigrant educators may not be as effective as their native counterparts in classroom instruction. These include the lack of English language proficiency (Jacobs and Friedman, 1988; Watts and Lynch, 1989; Norris, 1991; Borjas, 2000; Fleisher et al., 2002) , differences in teaching cultures (Jacobs and Friedman, 1988; Watts and Lynch, 1989; Fleisher et al., 2002; Liu et al., 2006; Asano, 2008; Alberts, 2008) , and/or a lack of insights into local situations which might otherwise aid in the presentation of concepts and ideas (Watts and Lynch, 1989; Fleisher et al., 2002; Asano, 2008) . These factors potentially prevent effective instruction and inhibit students' learning processes. Nevertheless, because immigrant educators are a select group who have chosen to brave the uncertainties of living and teaching in a foreign culture, it is possible that they possess qualities which make them more desirable instructors compared to natives. In particular, they may be more motivated and less-risk averse (Chiswick, 1978; Norris, 1991) and these factors may potentially enhance the learning experiences and achievements of their students 2 . Together, these imply that it is not possible to know, a priori, how having an immigrant teacher will affect student achievement 3 .\nStudent learning effects at the lower academic levels 4 have until now been completely ignored in the extant literature, although as highlighted above, immigrant teachers continue to 1 Note that these studies often do not clearly and explicitly detail the process by which instructors are matched with students. Because the variables that determine instructor assignment are often unknown, it is unclear whether the simple regression control strategies used by these studies are sufficient to identify the causal impact of immigrant educators. 2 I find some evidence in support of this with data from the National Education Longitudinal Study of 1988. The data show that immigrant teachers are more likely to spend additional time each week outside of regular school hours planning / preparing for teaching and supervising students. They are also more likely to express being either \"very well prepared\" or \"well prepared\" (as opposed to being either \"adequately prepared\", \"somewhat prepared\", or \"totally unprepared\") to teach the subject matter covered in the course. Further, immigrant teachers are more likely to use innovative pedagogical techniques such as non-textbook based instruction in lessons (see Appendix Table A1 ). 3 Ideally, the ceteris paribus question in this context should contrast the achievement of a student with an immigrant teacher to the achievement of the same student with an otherwise identical native teacher (identical in every respect such as educational qualification, certification, motivation, risk aversion, etc, with the exception of nativity). However, since I am not able to measure and control for unobserved teacher characteristics (like motivation and risk aversion), even with a within-student identification strategy, the estimates in this paper should be viewed instead as representing an \"overall treatment effect\". In other words, the results should be seen as an attempt to contrast the achievement of a student with an immigrant teacher to the achievement of the same student with a native teacher (where unobserved characteristics like motivation and risk aversion of the native and the immigrant teacher need not be the same). The results in this paper are the average of these individual treatment effects. 4 The lack of suitable data at the lower academic levels likely explains the absence of such studies. A review of the available educational statistics databases reveals that the nativity statuses of teachers are not usually reported be absorbed in considerable numbers by U.S. schools to teach at the elementary and secondary school levels. The purpose of this paper is to fill the gap in the literature by examining whether the migration background of the teacher matters for how well secondary school students in the U.S. perform. This is the first study that I am aware of which aims to identify a causal relationship between teacher nativity and student achievement outside the university level. Specifically, this paper attempts to address two research questions: (1) How does having an immigrant teacher affect the academic achievements of secondary school students in the U.S.? (2) Do immigrant teachers affect the academic achievements of immigrant and native students in the same way? Or do the effects differ depending on student nativity? To answer both questions, the study draws on evidence from the National Education\nLongitudinal Study of 1988 (NELS) -a dataset consisting of a nationally representative sample of 8 th grade students in the U.S..\nTo account for the possibility that immigrant teachers and native teachers may be assigned to different types of schools, and even within schools, to different types of students, I employ a within-school and a within-student strategy respectively. The former approach estimates the immigrant teacher impact by comparing the academic achievements of students with immigrant teachers to the achievements of observationally similar students with native teachers, within schools. This approach, also known as the school fixed effects approach, will yield unbiased estimates of the immigrant teacher impact, as long as, within schools, there is no tendency for immigrant and native teachers to be assigned to different types of classes or to different types of students. The latter approach (which we will later also call the firstdifference approach) estimates the immigrant teacher impact by comparing the achievement of a student with an immigrant teacher in one subject to the achievement of the same student with a native teacher in another subject whilst controlling for the student's prior achievement in both subjects. The latter approach will yield unbiased estimates of the immigrant teacher impact as long as students do not differ in terms of unobservable traits (like motivation) across the two subjects (in other words, this approach will yield unbiased estimates as long as student traits like ability and motivation are similar for a given student across the two subjects).\nin the data. Often, the demographic information available on instructors are limited only to race, Hispanic ethnicity, age, and sex. Country of origin is almost always never reported (an exception is the \"National Study of Postgraduate Faculty\". However, this study does not allow one to match instructors to their students and is therefore not suitable for our purposes).\nThe results from this study indicate that, overall, immigrant teachers do not have a negative impact on the educational achievements of native students. In fact, there is even some evidence that these teachers actually enhance native student achievement. Additional tests suggest that this non-adverse effect is driven primarily by the greater effectiveness of White immigrant teachers relative to native teachers.\nThree aspects of this study deserve attention. As mentioned, this is the only study which investigates the effects of having an immigrant teacher on student achievement outside the university level. In addition, unlike most studies in this field, which have considered learning effects largely in the subject of Economics, this paper considers learning effects in Science, Mathematics, Social Studies, and English -subjects that form the core foundation for a variety of other disciplines. Lastly, in contrast to the findings of previous studies, which have limited generalizability to other settings and institutions (because they typically draw on evidence from specific universities, which may have unique student/teacher populations or teacher hiring practices), the findings from the present study can be generalized, at least, to student learning across the 8 th grade U.S. population in the 1980s."}, {"section_title": "DATA", "text": "The source of data for this study is the U.S. National Center for Education Statistics' National Education Longitudinal Study of 1988 (henceforth referred to as \"NELS\"). This is a nationally representative sample of 8 th grade students and schools in the United States that were first surveyed in 1988. Subsets of these students were resurveyed through four followups in 1990 (when most were in their 10 th grade), 1992 (when most were in their 12 th grade), 1994, and 2000. In these surveys, students provided detailed personal information about themselves (e.g. sex, race / ethnicity, hispanicity, language use), their families, and their school experiences (e.g. prior grades in each subject). Together with the surveys in 1988, 1990 , and 1992, standardized curriculum-based achievement tests in 4 subjects -Science, Mathematics, Social Studies, and English -were also administered to each student 5 .\nStudents in NELS were sampled through a two-stage process. In the first stage, schools were stratified by superstrata and substrata. That is, schools were first sorted into To provide contextual information, students' teachers, parents, and school administrators were surveyed along with the students in the first 3 waves (1988, 1990, and 1992) 6 . Not all teachers for a given student were surveyed. In any year, only 2 teachers were sought for any given student. Selection of the respondents for the teacher survey for each student was based on the assignment of 2 subject areas per school. Specifically, each of the sampled schools was assigned one of the following combinations of subject areas: (a) English and Mathematics (b) English and Science (c) Social Studies and Mathematics (d) Social\nStudies and Science. These assignments were designed so as to achieve approximately balanced representations of the four combinations of subject areas within schools in each strata. A given student's teachers in the 2 designated subject areas were then contacted for the survey. Responses to the teacher survey provided extensive information regarding each teacher's background characteristics and attributes (e.g. sex, race / ethnicity, hispanicity, native language, subject of instruction, years in the teaching profession, type of teaching certification held, employment status in the school, highest educational qualification) as well as the class environment in which the student was in (e.g. number of students in his/her class, number of students in the class that were limited in their English language proficiency).\nResponses to the parent questionnaire provided information on family background characteristics such as family income, family size, and parents' highest level of education.\nFinally, responses to the school administrator questionnaire provided information on the characteristics of the school student body (e.g. school enrolment, urbanicity, whether the school is private, share of minority students, share of students from single parent families, share of students on reduced price / free lunch programmes).\nA unique feature of the NELS is that it is designed so that the basic unit of analysis is the student. This allows one to match teacher characteristics and class-level information to each individual student, by subject, and permits analyses that examine the relationship 6 Parent surveys were not administered in 1990.\nbetween student performance in a subject and the qualities and attributes of the subject teacher.\nAlthough teacher surveys were conducted in 1988, 1990, and 1992, only (and vice-versa) will produce estimates of the immigrant teacher impact that are biased towards zero (Aigner, 1973; Hirsch and Schumacher, 2004; Lewbel, 2007) . Hence, the estimates in this study can be viewed as conservative estimates of the true causal effect of having an immigrant teacher. In fact, the way migrant status is classified in this paper could actually be more useful for policy purposes since the debate on immigrant educators in the U.S. has often centred on those immigrant teachers with the least adept English communication skills (see for instance, Smith et al., 1992; Finder, 2005; Lacey, 2011) .\nBecause the above language proficiency questions were not asked in the subsequent surveys in 1990 and 1992, my study uses only data from the base year of 1988. The 1988 wave included responses from 24,599 students and 5,193 teachers from 1,052 schools."}, {"section_title": "Sample", "text": "Since the objective of this study is to examine the effect of having an immigrant teacher on student achievement, I restrict my sample only to those students with at least one subject teacher who had reported his/her native language 7 . The unit of observation is a studentteacher pairing. As each sampled student contributes approximately 2 student observations, this provides me with a final dataset of 44,077 student observations. The Science sample includes 10,775 student observations for which teacher native language are reported while the Mathematics, Social Studies, and English samples contain 11,285, 10,561, and 11,456 student observations respectively 8 ."}, {"section_title": "Descriptive Statistics", "text": "Student achievements are measured by the scores received by students in standardized tests for the respective subjects (Science, Mathematics, English, and Social Studies). The scores in the standardized tests administered with the NELS survey can be used to gauge student achievements in the respective subjects since the tests were designed to assess curriculum knowledge in the 4 disciplines. Note that all test scores in this paper are normalized, by subject, to a mean of 0 and a standard deviation of 1 so that the coefficient estimates can be interpreted easily as fractional changes of a standard deviation. To analyze whether the types of students taught by immigrant and native teachers differ, Panel B of Table 1 reports the mean characteristics of students with immigrant and with native teachers, by subject. Knowing whether the types of students differ across teachers by nativity is important because it will help alert one to potential selection issues. For example, if immigrant teachers tend to be matched with certain types of students (e.g. matched with say, immigrant / minority students or with students from less-privileged socioeconomic backgrounds) that tend to be relatively poor academic performers, then it is possible for the empirical analyses to pick up a spurious relationship between teacher nativity and student performance if the analyses fail to account for such non-random sorting patterns.\nSince the process of how immigrant teachers are actually assigned across schools, classes, and students is unclear, such an analysis will provide useful indication on whether there might be non-random sorting processes at work.\nPanel B of Table 1 reveals some noteworthy differences in the types of students associated with both kinds of teachers. Across all subjects, immigrant teachers have a considerably higher likelihood of teaching Hispanic students, students from non-English speaking homes, and students from larger families. They also have a lower likelihood of teaching White and Black students. Further, for Science and Mathematics, immigrant teachers appear to be more likely than native teachers to teach students from less-advantaged socioeconomic backgrounds. In particular, immigrant teachers in Science have a lower likelihood of teaching students with parents (both father and mother) that are college graduates while immigrant teachers in Math have a lower likelihood of teaching both students with high family incomes (students with annual family incomes of $35,000 9 and above) and students with mothers that are college graduates. However, the converse appears to hold true for Social Studies and English. Compared to native teachers, immigrant teachers in these two subjects have a higher likelihood of teaching students with parents that are college graduates 10 .\n< Insert Table 2 here > Do immigrant teachers differ in terms of observable characteristics from native teachers? Table 2 presents mean characteristics for immigrant and native teachers, by subject. Noteworthy differences are found in terms of teacher ethnicity, with immigrant teachers much more likely to be Hispanic and much less likely to be either White or Black than native teachers. Immigrant teachers are also less likely to possess a standard teaching certification and are more likely instead to hold a temporary teaching certification. Further, immigrant teachers appear to teach weaker classes: on average, immigrant teachers teach classes with higher proportions of LEP students than native ones."}, {"section_title": "METHODOLOGY", "text": "To examine the effect of having an immigrant teacher on student achievement, I\nemploy the standard approach used in the Economics of Education literature, by estimating an educational production function of the form:\nWhere 1 denotes the academic performance of student in subject 1 11 with teacher .\ndenotes a vector of observed student, family, and school characteristics for student while 1 denotes a vector of observed teacher and class-level attributes. Also included in 1 are fixed effects for the subject of the class. and represent respectively the return to individual, family background, and school characteristics and the return to teacher and class characteristics. 1 denotes a dummy variable indicating the nativity of teacher teaching subject 1: it is equal to 1 if the teacher is an immigrant and is equal to 0 if the teacher is native. is an unobserved student effect and 1 represents a mean zero random error term.\nThe main interest here is in the parameter , which captures the effect of having an immigrant teacher on student performance. If < 0, then having an immigrant teacher and Social Studies often requires better language skills. Therefore, immigrant teachers teaching English and Social Studies may possess attributes (better social skills, for example) which place them in a better stead of being hired at the higher quality schools (where students tend to perform better academically and come from more-privileged socioeconomic backgrounds). 11 Subject 1 denotes either Mathematics or Science.\nadversely affects student achievement. Conversely, if > 0, then having an immigrant teacher enhances student achievement.\nUnderlying this model is the assumption that the academic achievement of a given student in a subject is determined by a host of individual, family, teacher, class, and school factors (Hanushek, 1979 (Hanushek, , 1986 ).\nHere, it will initially be assumed that, conditional on the observables, and 1 , the term ( + 1 ) is uncorrelated with 1 (i.e. conditional mean independence is satisfied).\nThat is, we start by assuming that the unobserved student characteristics embodied in (such as student ability or motivation) are uncorrelated with teacher nativity. If this assumption is true, then OLS estimation of equation (1) will yield an unbiased estimate of .\nIt is assumed that a similar relationship holds for a given student in all subjects (and hence in some second subject; subject 2 12 ).\nThe initial approach I take involves estimating the immigrant teacher effect through estimating stacked versions of equations (1) and (2).\nHowever, there may be a cause for concern that the unobserved student characteristics could be correlated with teacher nativity. For example, due to the non-random matching of students with teachers across schools as well as across classrooms within schools, it may well be the case that students with lower unobserved abilities have a greater likelihood of being assigned to immigrant teachers 13 . If the unobserved determinants of student achievement and the teacher nativity variable are correlated due to such non-random sorting, then OLS estimations of equations (1) and (2) will yield biased estimates of the immigrant teacher effect. Of course, a number of strategies may be used to reduce the bias that arises from the non-random matching of students with teachers. These include incorporating a detailed set of student, family background, teacher, class, and school level variables into the regressions to try to control for such sorting behaviour as well as the use of school fixed effects to ensure that any bias due to the non-random sorting of students and teachers across schools is 12 Subject 2 denotes either English or Social Studies. 13 Consider the fact that schools in disadvantaged districts, where students tend to be lower achieving, are typically the ones suffering from staffing shortages (Ingersoll, 2004) . If such schools attempt to mitigate the shortage of teachers by hiring internationally, then students from these schools (who may be less motivated or who may care less about education) will have a greater likelihood of being assigned an immigrant teacher.\neliminated (note, however, that using school fixed effects will not mitigate the bias that arises from the non-random sorting of teachers and students among classrooms within schools). As far as possible, these strategies will be employed in the study to minimize the bias from nonrandom sorting. This said, it might not be possible to control for each and every variable which might be correlated with both student achievement and teacher nativity. Clearly, some of these variables (including student ability or motivation) may simply be unobserved.\nTo further minimize any bias due to the non-random sorting of teachers and students among classrooms within schools, I employ the following approach: Because the NELS dataset allows one to observe a given student's performance as well as his/her teacher's characteristics in 2 different disciplines (see Section 2), it is possible to estimate a withinstudent relationship between teacher nativity and student performance. Equations (1) and (2) are first-differenced to yield:\nAs before, captures the relationship between teacher nativity and student performance. However, differencing effectively removes the unobserved student effect .\nHence, estimating the above first-difference (FD) specification ensures that the estimates of will not be biased by the presence of subject-invariant unobserved student attributes.\nThe differencing procedure implies that the effect of having an immigrant teacher is estimated within students. In other words, the coefficient on the teacher nativity variable is identified based on the variation in teacher nativity across the 2 subjects for each student.\nHence, the bias that occurs in estimates of due to the non-random sorting of students and teachers across classrooms within schools, is addressed. The estimates obtained using the within-student approach will be unbiased as long as unobserved student characteristics (such as student ability or motivation) do not differ across the two subjects for each student.\nNote that, in this paper, the main purpose of the within-student analysis is to complement the results from the standard cross-sectional approach (by serving as a robustness check) and does not constitute a preferred approach in practice because the firstdifferencing procedure results in a situation where there is little variation in the teacher nativity variable for identifying the effect of interest 14 . The reason is because most students in the dataset had been assigned a native teacher in both subjects. Furthermore, of those students that had immigrant teachers, many had immigrant teachers in both subjects (either because the schools they attended tend to be staffed by relatively more immigrant teachers in all subjects or because the student had the same teacher in both subjects). As such, the firstdifferenced nativity variable is equal to 0 (i.e. ∆ = 1 − 2 = 0) for the vast majority of students in the dataset. Only the small number of students in the dataset who had an immigrant teacher in one subject and a native teacher in the second subject would have ∆ = ±1 15 . The lack of variation in the teacher nativity variable under first-differencing implies that tends to be estimated imprecisely when the within-student approach is used.\nFurthermore, measurement errors in the explanatory variables, which bias the estimated effect of having an immigrant teacher toward zero, tend to be magnified when firstdifferencing is used (Griliches and Hausman, 1986 ).\n< Insert Table 3 here > Before moving to the main results, note that because we partly exploit within-school models (i.e. specifications incorporating school fixed effects) to identify the achievement effect of an immigrant teacher, any non-random sorting of teachers among classrooms and students within schools would undermine the validity of our estimates. As such, I perform regressions of various class and student-level characteristics on a dummy indicating teacher nativity, whilst controlling for school fixed effects. If immigrant and native teachers are nonrandomly allocated across classes and students within schools, then the coefficient on the dummy indicating teacher nativity from these regressions would be non-zero. Table 3 presents the results from these regressions. Separate regressions are run for each class and student-level characteristic. In the vast majority of cases, we cannot reject the hypothesis that the coefficient on the teacher nativity dummy is equal to zero. Hence, there is little evidence that immigrant teachers are non-randomly allocated across classes or students within schools.\nThis balancing test lessens any concerns regarding the validity of the estimates from the within-school specifications.\n14 The teacher nativity variable has a very small within standard deviation of 0.108. In contrast, it has a considerably larger between standard deviation of 0.140 (approximately 30 percent greater). This implies that the variation in teacher nativity observed within a student across the two subjects is much smaller than the variation in teacher nativity across students. 15 Of the 24,599 students in the dataset, only 1,200 had an immigrant teacher in one subject and a native teacher in the other subject. 234 students had immigrant teachers in both subjects, 23,159 students had native teachers in both subjects, and 6 students had at least 1 teacher that did not respond to the native language question. Table 4 here > Table 4 presents results from a variety of regressions showing the estimated effect of having an immigrant teacher on student achievement 16 . Columns (1) to (6) of the table report results from a standard cross-sectional approach (that is, the OLS estimates based on equations (1) and (2)) while columns (7) to (9) report results from the within-student approach (that is, the first-difference (FD) estimates based on equation (3)). Specifically, column (1) displays the OLS estimate from running a stacked version of equations (1) and (2) in the absence of any controls (apart from subject fixed effects). Columns (2) through to (5) show the estimates when controls for teacher and class attributes 17 (Column (2)), student characteristics and prior grades 18 (Column (3)), students' family background characteristics 19 16 The full regression results for With regards to the teacher's years of teaching experience, observations may fall into 1 of 9 categories: less than 4 years; 4-6 years; 7-9 years; 10-12 years; 13-15 years; 16-18 years; 19-21 years; 22-24 years; or 25 or more years. Years of teacher experience is intentionally specified using a series of indicator variables (rather than a continuous variable) so as to allow for the returns to teacher experience to be nonlinear (see Clotfelter et al., 2006 Clotfelter et al., , 2007 Clotfelter et al., , 2010 . Included in the set of class characteristics are the number of students enrolled in the student's subject class (i.e. class size) and the percentage of students in the class that are limited English proficient. 18 Included in the set of student characteristics are dummy variables for the student's sex, race / ethnicity, and his/her previous grades in the subject under investigation. For race / ethnicity, observations can fall into 1 of 5 groups: Asian/Pacific; Hispanic; non-Hispanic Black; American Indian/Alaskan Native; or non-Hispanic White. The student's prior grades in the subject is indicated by 5 dummy variables: whether the student received mostly A, mostly B, mostly C, mostly D, or mostly below D grades in the subject from grade 6 up till the survey date. Note that previous grades are included in the regressions in an attempt to control for students' prior subject knowledge and to account for the cumulative nature of the educational process (Hanushek, 1979 (Hanushek, , 1986 . However, it is recognised that past grades may not be a perfect indicator for the level of prior knowledge students possess since they may have been evaluated by different teachers who applied different grading criteria. I therefore view previous grades as being reflections of students' prior knowledge, but which are measured with noise. 19 Included in the set of family characteristics are dummy variables for annual family income, the highest level of education attained by either of the student's parents, and whether English is predominantly spoken in the student's home. It also includes a continuous variable indicating family size. Observations may fall into 1 of 10 family income categories: below $10,000; $10,000-$14,999; $15,000-$19,999; $20,000-$24,999; $25,000-$34,999; $35,000-$49,999; $50,000-$74,999; $75,000-$99,999; $100,000-$199,999; or $200,000 and above."}, {"section_title": "EMPIRICAL ANALYSIS", "text": ""}, {"section_title": "Main Results", "text": ""}, {"section_title": "< Insert", "text": "Observations may fall into 1 of 6 parent education categories: Parent has less than high school education; Parent (Column (4)), and observable school attributes 20 (Column (5)) are successively added to the regression. Column (6) presents the estimate when controls for observable school characteristics are replaced by school fixed effects 21 . For the within-student analysis, column (7) presents the FD estimate from running equation (3) in the absence of controls (apart from subject fixed effects). Column (8) shows the estimate when teacher and class attributes are additionally controlled for. Finally, column (9) displays the estimate when students' prior grades are added as controls.\nThe purpose of starting with regression models without any controls and then adding groups of regressors in a successive manner is to allow one to identify the set of attributes which matter most for immigrant teacher selection. To correct for potential intra-school correlations, in all analyses, I present standard errors which are clustered at the school level.\nThe estimate in column (1) of Table 4 indicates that, on average, students with immigrant teachers receive somewhat lower test scores compared to those with native teachers (this difference is not significant though). However, when teacher and classroom characteristics are controlled for, the magnitude and the sign of the estimated coefficient on the immigrant teacher dummy changes dramatically. More precisely, it turns positive and is economically sizeable (0.122 standard deviations). This occurs because immigrant teachers tend to possess weaker credentials and teach classes that are academically weaker compared to native teachers. The coefficient estimates on the immigrant teacher variable remain positive, although they decrease in magnitude, as student, family background, and school characteristics are successively controlled for. The estimate in column (5) accounts for any is a high school graduate; Parent has some college education (but did not graduate from college); Parent is a college graduate; Parent has a Master's degree; or Parent has a PhD. 20 Included in the set of school-level characteristics are dummy variables for school enrolment, the share of minority students in the school, the share of students from single parent families, and the share of students on reduced price or free lunch programmes. Indicator variables for whether the school is private (or public) and whether the school is located in an urban, suburban, or rural area are also included. Observations may fall into 1 of 7 categories in regards to school enrolment: 1-199; 200-399; 400-599; 600-799; 800-999; 1000-1199; or 1,200 or more students. Observations may fall into 1 of 6 categories in regards to the share of minority students in the school: 0-10%; 11-20%; 21-40%; 41-60%; 61-90%; or 91-100%. Observations may fall into 1 of 6 categories with regards to the share of students on reduced price or free lunch programmes: 0-10%; 11-20%; 21-30%; 31-50%; 51-75%; or 76-100%. Lastly, observations may fall into 1 of 5 categories in regards to the share of students from single parent families: 0-25%; 26-50%; 51-75%; 76-99%; or 100%. 21 By including school fixed effects, the coefficient on the teacher nativity dummy would be identified on the basis of variation in teacher nativity across students within each school (i.e. the coefficient on the teacher nativity dummy would effectively be picking up the within-school relationship between student achievement and teacher nativity). Hence, conditioning on school fixed effects addresses any bias due to the non-random sorting of students with teachers across schools. However, because many of the immigrant teachers in the dataset are clustered in the same schools (immigrant teachers came from only 130 of the 1,052 schools), a specification with school fixed effects may not yield a test with as much power as one conditioning only on observable school characteristics.\nbias due to differences in observable student, family, teacher, class, and school characteristics between students (i.e. the set of characteristics controlled for in column (5)) and indicates that comparing students with these observable characteristics, students with immigrant teachers outperform those with native teachers by 0.080 standard deviations. Although this estimate is not statistically significant, the 95% confidence interval for the effect size lies between -0.027 and +0.187 standard deviations. The inclusion of school fixed effects in the regression does not alter the sign of the estimated coefficient, though it leads to a considerable fall in its magnitude (to about one-third of its existing value). The FD estimates presented in columns (7) through (9) are likewise positive, though again, none are statistically different from zero.\nWhile none of the estimates in Table 4 are significant, they do at least suggest that immigrant teachers have non-adverse impacts on student achievement.\nRecall that we are interested to know whether the effect of having an immigrant teacher is different for native and immigrant students. To answer this question, I repeat the analyses described above, separately for the sample of native and immigrant students 22 . For the sake of brevity, in what follows, I concentrate only on presenting the results from fully-specified models (for example, in Table 4 , this would correspond to models in columns (5), (6), and (9)).\n< Insert Table 5 here > Table 5 reports the immigrant teacher effect, separately for native and immigrant students. Columns (1), (2), (4), and (5) report results from estimations that employ the standard cross-sectional approach while columns (3) and (6) report results from estimations that employ the within-student approach. Specifically, columns (1) and (4) display the OLS estimates from running stacked versions of equations (1) and (2), controlling for observable student, family background, teacher, class, and school characteristics. Columns (2) and (5) show the estimates when observable school attributes are replaced instead with school fixed effects. Finally, columns (3) and (6) report the estimates from running the first-differenced equation (3) with controls included for subject fixed effects, teacher and class-level characteristics 23 and the previous subject grades received by the student. 22 By estimating separate equations for native and immigrant students, I am implicitly allowing for all parameters to differ across both nativity groups. None of the conclusions about the effects of immigrant teachers change though even if I had restricted these parameters to be the same across these groups. 23 All student and family background observables drop out from this model since these do not vary within a given student.\nThe estimate in column (1) indicates that native students with immigrant teachers outperform observationally similar students with native teachers by 0.115 standard deviations (statistically significant at the 5% level). This effect is sizeable and comparable to that relating to English home language use: as compared to a student that speaks only or primarily English at home, a student that does not, performs approximately 0.110 standard deviations worse. Once the regression conditions on school fixed effects however, the estimated coefficient decreases in magnitude (to 0.058) and loses statistical significance. However, the 95% confidence interval for this effect lies between -0.042 and +0.158 standard deviations.\nAs with the case of the full student sample, the FD estimate obtained in column (3) is positive (0.067 standard deviations) but is not significant at the conventional levels.\nFor immigrant students, not much can be said about the impact of having an immigrant teacher since none of the specifications yield a teacher nativity coefficient which is precisely estimated.\nThere is some evidence from Table 5 that immigrant teachers have a positive impact on the academic achievements of native students. The lack of statistical significance in the FD estimates is likely due to insufficient variation in the teacher nativity variable. As mentioned in Section 3, most students in the dataset had been assigned a native teacher in both subjects.\nOf those students that actually had immigrant teachers, many had immigrant teachers in both subjects. As such, the first-differenced teacher nativity variable is equal to 0 for the vast majority of students in the dataset. Only a relatively small number of students in the dataset\n(1,200 of them) had an immigrant teacher in one subject and a native teacher in the second subject. Hence only a small number of students had a first-differenced teacher nativity variable equal to +1 or -1. The lack of variation in the teacher nativity variable within students implies that tends to be estimated imprecisely when a within-student approach is used. Nevertheless, it serves as a useful check for the OLS estimates based on the standard cross-sectional method.\n"}, {"section_title": "An Alternative Specification", "text": "In all regressions performed in the former section (Section 4.1), teacher ethnicity was controlled for because that might be correlated with both student achievement and teacher nativity. However, controlling for teacher ethnicity may not be ideal since a lot of the variation from the teacher nativity variable may be absorbed by also controlling for teacher ethnicity (for example, approximately half of all immigrant teachers in the NELS dataset are\nHispanic. Appendix Table A3 shows the breakdown of immigrant teachers by subject and ethnicity). To circumvent this problem, I estimate specifications which allow for student achievement to vary across 4 different groups of teachers defined by nativity / ethnicity (Hispanic Immigrant teachers, White Immigrant teachers, Immigrant teachers of \"Other Race\", and Native teachers). Operationally, this involves replacing the single teacher nativity dummy in equations (1), (2), and (3) with indicator variables for Hispanic immigrant, White immigrant, and immigrant teacher of \"other race\" 24 and then leaving out teacher ethnicity controls. The excluded base category is the group of native teachers (of all ethnicities). This way, the alternative specification allows one to compare how immigrant teachers of different ethnicities (Hispanic, White, and \"Other Race\") affect student achievement relative to native teachers.\n< Insert Table 6 here >\nThe estimated immigrant teacher effects based on this modified specification are reported in Table 6 , separately for all students, native students, and immigrant students.\nFor the group of all students, the results from the OLS specifications (i.e. Columns (1) and (2)) suggest that relative to native teachers, White immigrant teachers have positive effects on student achievement. The estimated coefficient on the White immigrant teacher dummy in column (1) indicates that holding all observable characteristics the same, students with White immigrant teachers outperform those with native teachers by 0.142 standard deviations (this effect is statistically significant at the 5% level). The size of the estimated effect falls somewhat (to 0.103) when school fixed effects are introduced, but nonetheless, remains significant at the 10% level. The estimated coefficient on the White immigrant teacher dummy from the FD specification (Column (3)) is likewise positive, though it is smaller in magnitude and insignificant.\nThe pattern of results for native students is very similar to the one obtained for the full sample of students. In particular, after adjusting for differences in observable characteristics, native students with White immigrant teachers are found to achieve test scores of approximately 0.157 standard deviations higher (significant at the 5% level) than those with native teachers (Column (4)). The estimated effect falls to 0.102 standard deviations when school observables in the regression are replaced by school fixed effects (Column (5)).\nHowever, it remains significant at the 10% level. These results suggest that relative to native teachers, White immigrant teachers have a positive impact on native student achievement.\nAgain, not much can be said about the impact of immigrant teachers on immigrant students since the coefficients on the teacher nativity variables are found to be imprecisely estimated in all specifications."}, {"section_title": "Does the Effect of an Immigrant Teacher Vary by Subject?", "text": "Thus far, the analysis implicitly assumes that the effect of an immigrant teacher does not vary across subjects. However, this assumption may not be reasonable. For instance, since communication skills may be more important in bringing ideas across to students in some subjects (such as in English or Social Studies) than in others (such as in Science or Math), it may be possible that any English language deficiencies among immigrant teachers may render them less effective in teaching those subjects requiring greater communication abilities. Hence, in this section, I relax the assumption of a homogenous immigrant teacher effect across subjects and instead allow the effect of immigrant teachers to vary by subject. This is done by employing the cross-sectional approach and estimating the specification given by equation (1) (or (2)) separately, by subject 25 . For brevity, for each of the 4 subjects:\nnamely, Science, Mathematics, Social Studies, and English, I present only the OLS estimates from running equation (1) (or (2)) with the full set of controls (i.e. controls for student demographic characteristics and prior grades, family background characteristics, as well as teacher and class attributes) and school fixed effects.\n< Insert Table 7 here > 25 Using a within-student estimator to analyze the effect of an immigrant teacher by subject is infeasible because it entails sample sizes which are too small. For example, suppose we want to estimate the effect of having an immigrant teacher in Math. Employing a within-student estimator would first require dropping all students that have an immigrant teacher in subject 2 (English and Social Studies). This is so that all effects can be attributed solely to having an immigrant teacher in Math. Because many students in the dataset who had an immigrant teacher in one subject also had an immigrant teacher in the other, a large number of students in the dataset with immigrant teachers in Math would inevitably also be dropped. The end result is that the first-differenced nativity variable is non-zero for only a small number of cases.\nPanels A and B of Table 7 report respectively, the estimated effects of having an immigrant teacher on native student achievement and on immigrant student achievement, by subject.\nThe estimates suggest that, across all 4 subjects, immigrant teachers do not have an adverse impact on native student achievement. However, in contrast, the point estimates do not allow one to rule out the possibility that immigrant teachers have no negative impacts on immigrant student performance; this is true for Science and Math.\nAlthough none of the estimates presented in Table 7 are actually statistically significant, a few of them are quite sizeable in magnitude. The lack of significance arises from the large standard errors involved, owing to the small number of students who actually had immigrant teachers within each subject."}, {"section_title": "Comparing Immigrant Teachers to Native Teachers of the Same Ethnicity", "text": "Thus far, the results suggest that, as compared to native teachers, White immigrant teachers have a positive impact on native students' achievement. However, it is possible that these results may have been driven by ethnic differences rather than by differences in nativity status. In order to isolate the achievement effects due only to differences in teacher nativity, I\nconduct an alternative analysis where I compare the achievements of students taught by immigrant teachers to the achievements of observationally similar students taught by native teachers of the same ethnicity (for instance, I compare the test scores of students taught by White immigrant teachers to those of observationally similar students taught by White native teachers). (1) and (2), with controls included for observable student, family, teacher, class, and school attributes. Columns (2) and (4) "}, {"section_title": "CONCLUSION", "text": "Using a dataset consisting of a nationally representative sample of 8 th grade students in the United States, this paper examines the effect of having an immigrant teacher on student achievement. The present study is the first to examine how educators with an immigrant background affect the educational achievements of students at the secondary school level.\nPrevious research on this issue have focused exclusively on student experiences at the undergraduate level and are predominantly concerned with learning effects in Economics.\nThe experiences of students at the elementary and secondary levels and in subjects beyond\nEconomics have, until now, been ignored.\nTo account for the non-random sorting of teachers across schools as well as across classrooms and students within schools, we employ two estimation strategies. The first estimates the immigrant teacher effect by comparing the academic achievements of students with immigrant teachers to the achievements of observationally similar students with native teachers within schools. The estimates from this approach account for any bias due to the non-random sorting of immigrant and native teachers across schools. The second compares the academic achievement of a student with an immigrant teacher in one subject to the achievement of the same student with a native teacher in another subject. Since this comparison is within student, the estimates account for any bias due to the non-random sorting of immigrant and native teachers across classes and students, within schools. The overall effect of having an immigrant teacher is found to depend on a student's nativity.\nWhile there is little evidence that having an immigrant teacher affects the educational achievement of immigrant students, there is some evidence that it affects the achievements of native students positively. My findings for native students are consistent with previous work by Norris (1991) and Fleisher et al. (2002) which show student learning to be enhanced by immigrant educators.\nAlternative specifications which allow for student achievement to vary across 4 different groups of teachers defined by nativity / ethnicity (Hispanic immigrant teachers, White immigrant teachers, immigrant teachers of \"other race\", and native teachers) indicate that compared to native teachers, White immigrant teachers enhance the academic achievements of native students.\nBecause the above findings may have been driven by ethnic differences rather than by differences in teacher nativity status, I additionally conduct a robustness check by comparing the test scores of students taught by immigrant teachers to the test scores of students taught by native teachers of the same ethnicity in order to isolate the achievement effects due to differences in teacher nativity. The results from this exercise affirm the positive effects of White immigrant teachers.\nThe findings from this paper help us understand how teacher nativity has affected student learning in U.S. secondary schools and constitute an assessment of how immigrant teachers might have performed relative to native ones. One question is whether we could use these results even further, perhaps by using them to predict how immigrant teachers in the future are likely to affect student achievement. One should caution against doing that. After all, the composition of immigrants and the incentives facing teachers in the U.S. in the future may be quite different from those which existed in the 1980s -the time period in which my data come from. As such, the characteristics (like motivation or risk-aversion), and hence effectiveness, of future cohorts of immigrant teachers cannot be expected to be the same as those of their predecessors.\nAn interesting question which is left for future research is why immigrant teachers might have affected student achievement in the ways documented above. A number of reasons may explain why immigrant teachers differ in effectiveness from native teachers.\nThese include differences in English language abilities, teaching methods, local knowledge, and unobservable qualities (e.g. intrinsic motivation and risk-aversion) between immigrant and native educators. The nature of the NELS dataset does not allow for an investigation of the precise channels leading to the observed difference in the performance of immigrant and native teachers. There is scope for future research to study the mechanisms through which these differences arise.\nDee, Thomas S. (2007) Notes: This table reports average student characteristics for those with immigrant and those with native teachers, by subject. Sample weights used in all computations. ***Difference is statistically significant at the 1% level. **Difference is statistically significant at the 5% level. *Difference is statistically significant at the 10% level. Data from the National Education Longitudinal Study of 1988."}, {"section_title": "29", "text": "(Cont'd) (1) and (2), controlling for observable student, family background, teacher, class, and school characteristics. Columns (2) and (5) show the estimates when controls for observable school attributes are replaced by school fixed effects. Columns (3) and (6) report the estimates from running the first-differenced equation (3) with controls included for subject fixed effects, teacher and class-level characteristics and the previous grades received by the student for the subject. NELS sample weights are used in all regressions. Standard errors in parentheses are clusterrobust standard errors that allow for correlation in individual error terms within schools. *** p-value<0.01, ** p-value<0.05, * p-value<0.1. Note: All models include the full set of control variables (i.e. controls for student demographic characteristics and prior grades, family background characteristics, teacher and class attributes) and school fixed effects. NELS sample weights are used in all regressions. Standard errors in parentheses are cluster-robust standard errors that allow for correlation in individual error terms within schools. *** p-value<0.01, ** p-value<0.05, * p-value<0.1. "}]