[{"section_title": "Abstract", "text": "We evaluated the performance of CSF biomarkers for predicting risk of clinical decline and conversion to dementia in non-demented patients with cognitive symptoms. CSF samples from patients in two multicentre longitudinal studies (ADNI, n = 619; BioFINDER, n = 431) were analysed. Aβ(1-42), tTau and pTau CSF concentrations were measured using Elecsys CSF immunoassays, and tTau/Aβ(1-42) and pTau/Aβ(1-42) ratios calculated. Patients were classified as biomarker (BM)-positive or BMnegative at baseline. Ability of biomarkers to predict risk of clinical decline and conversion to AD/ dementia was assessed using pre-established cut-offs for Aβ(1-42) and ratios; tTau and pTau cut-offs were determined. BM-positive patients showed greater clinical decline than BM-negative patients, demonstrated by greater decreases in MMSE scores (all biomarkers: -2.10 to -0.70). Risk of conversion to AD/dementia was higher in BM-positive patients (HR: 1.67 to 11.48). Performance of Tau/Aβ(1-42) ratios was superior to single biomarkers, and consistent even when using cut-offs derived in a different cohort. Optimal pTau and tTau cut-offs were approximately 27 pg/mL and 300 pg/mL in both BioFINDER and ADNI. Elecsys pTau/Aβ(1-42) and tTau/Aβ(1-42) are robust biomarkers for predicting risk of clinical decline and conversion to dementia in non-demented patients, and may support AD diagnosis in clinical practice.\nPathological processes underlying Alzheimer's disease (AD) begin during a preclinical phase, often years before clinical symptoms associated with early stage disease 1 . Early diagnosis of AD and identification of disease progression are important for planning patient treatment and care. However, diagnosis at the mild cognitive impairment (MCI) stage, a known risk factor for progression, is challenging as: MCI does not always progress to dementia; dementia may be due to other causes; rates of progression vary; identifying individual conversion points is difficult 2,3 .\nAmyloid (positron emission tomography [PET]) scanning is a Food and Drug Administration (FDA)-approved biomarker for supporting AD diagnosis 4 , with MCI patients showing evidence of amyloid pathology having a higher risk of clinical decline 5-7 . However, many amyloid-PET-positive patients remain cognitively normal for several years, highlighting the need for more robust biomarkers 8, 9 . Recent efforts have focused open Scientific RepoRtS | (2019) 9:19024 | https://doi.org/10.1038/s41598-019-54204-z\nwww.nature.com/scientificreports www.nature.com/scientificreports/ on cerebrospinal fluid (CSF) biomarkers, and several studies have demonstrated the potential value of Aβ(1-42), phosphorylated Tau (181 P; pTau) and total Tau (tTau) biomarkers in MCI patients [9] [10] [11] [12] [13] [14] [15] .\nElecsys CSF immunoassays have been developed for measurement of Aβ(1-42), pTau and tTau, and have demonstrated excellent analytical performance, with high precision, good lot-to-lot comparability and low variability between and within laboratories [16] [17] [18] [19] [20] . Clinical evaluation in Alzheimer's Disease Neuroimaging Initiative (ADNI) and BioFINDER studies also showed good concordance between measured CSF Aβ(1-42), ratios tTau/ Aβ(1-42) and pTau/Aβ(1-42) and visual read outcomes of amyloid-PET 17 . We compare the performance of Aβ(1-42), pTau, tTau and ratios pTau/Aβ(1-42) and tTau/Aβ(1-42) for predicting the risk of clinical decline and conversion to AD or dementia in non-demented patients with cognitive symptoms.\nStudy populations. Individuals with MCI from ADNI and mild cognitive symptoms (MCS) from BioFINDER were included in the retrospective analyses, based on the following criteria: availability of a baseline Mini-Mental State Examination (MMSE) score; a baseline CSF sample; and a valid baseline measurement of the Elecsys biomarkers Aβ(1-42), pTau and tTau. ADNI. ADNI is an ongoing, longitudinal, multicentre study of volunteers with MCI or early AD, as well as cognitively normal healthy individuals enrolled at over 50 clinical centres, which started in 2004. Definitions of the participant classifications are presented below. Normal cognition: MMSE scores between 24 and 30 (inclusive), a Clinical Dementia Rating (CDR) of 0, non-depressed, non-MCI and non-demented. MCI: MMSE scores between 24 and 30 (inclusive), a memory complaint, have objective memory loss measured by education-adjusted scores on Wechsler Memory Scale Logical Memory II, a CDR of 0.5, absence of significant levels of impairment in other cognitive domains, essentially preserved activities of daily living and an absence of dementia. Mild AD: MMSE scores between 20 and 26 (inclusive), CDR of 0.5 or 1.0 and meets National Institute of Neurological and Communicative Disorders and Stroke and the Alzheimer's Disease and Related Disorders Association (NINCDS-ADRDA) criteria for probable AD.\nParticipants undergo annual examinations including magnetic resonance imaging (MRI) and amyloid-PET imaging, plasma and CSF sampling, as well as clinical and neuropsychological assessments. Further details are available at adni-info.org.\nOverall, 619 of the total 872 patients (253 omitted due to missing baseline measurements) from the ADNI MCI population were included; 277 had early-MCI (criteria included memory function approximately 1.0 standard deviation [SD] below expected education-adjusted norms) and 342 had late-MCI (criteria included memory function approximately 1.5 SDs below expectation) 21 .\nCancer Study 22 , and inclusion criteria were: aged > 60 years, MMSE score 28-30 at the screening visit, no cognitive symptoms and absence of MCI or dementia. Exclusion criteria were: presence of significant neurological or psychiatric disease, refusing lumbar puncture or MRI and significant alcohol or substance misuse. Subjects with MCS (i.e. either subjective cognitive decline [SCD] or MCI) were recruited consecutively at three memory clinics in southern Sweden. Inclusion criteria were: referral to the memory clinic due to cognitive symptoms experienced by the patient and/or an informant, criteria of any dementia disorder not fulfilled, MMSE score 24-30 and age 60-80 years. Exclusion criteria were: cognitive impairment that without doubt could be explained by a condition other than prodromal dementia, refusing lumbar puncture or neuropsychological investigation and current alcohol or substance misuse. The classification of MCS into SCD or MCI was based on a neuropsychological battery and the clinical assessment of a senior neuropsychologist as previously described 23 . AD diagnosis was confirmed by clinical evaluation and was based on the Diagnostic and Statistical Manual of Mental Disorders, 3rd Edition Revised (DSM-IIIR) criteria for dementia 24 combined with the NINCDS-ADRDA criteria for AD 25 . Participants underwent bi-annual examinations including MRI, CSF and plasma sampling, and detailed clinical and neuropsychological assessments. Further details, including eligibility criteria, are available at BioFINDER.se. A total of 431 MCS patients from the BioFINDER population were included in the present analyses, and were classified into subgroups based on neuropsychological assessment: MCI (n = 233, including 172 patients with amnestic MCI), SCD (n = 191) or unknown SCD/MCI status (n = 7).\nCopernicus Group Independent Review Board and Regional Ethics Review Board in Lund. All procedures performed in studies involving human participants were in accordance with the ethical standards of the institutional and/or national research committee and with the 1964 Helsinki Declaration and its later amendments or comparable ethical standards. Written informed consent was obtained from all patients who participated in ADNI and BioFINDER.\nBiomarker measurements. CSF concentrations of Aβ(1-42), pTau and tTau were measured using Elecsys CSF immunoassays on a cobas e 601 analyser at the University of Pennsylvania (ADNI) and the University of Gothenburg (BioFINDER). Aβ(1-42), pTau/Aβ(1-42) and tTau/Aβ(1-42) . Based on BioFINDER data, cut-off values for Aβ(1-42), pTau/Aβ(1-42) and tTau/Aβ(1-42) have previously been determined for concordance between CSF biomarkers and visual read of amyloid-PET images 17 . The previously derived cut-off values were: Aβ(1-42), 1,100 pg/mL; pTau/Aβ(1-42), 0.022; tTau/Aβ(1-42), 0.26. Similarly, for ADNI, the cut-offs Scientific RepoRtS | (2019) 9:19024 | https://doi.org/10.1038/s41598-019-54204-z www.nature.com/scientificreports www.nature.com/scientificreports/ optimised for concordance of CSF biomarkers with amyloid-PET visual read were: Aβ(1-42), 977 pg/mL; pTau/ Aβ(1-42), 0.025; tTau/Aβ(1-42), 0.27 17 . As a sensitivity analysis, ADNI analyses were also performed using cut-offs derived from BioFINDER and adjusted for pre-analytical handling in ADNI: Aβ(1-42), 880 pg/mL; pTau/Aβ(1-42), 0.028; tTau/Aβ(1-42), 0.33, as previously described 17 .\nPre-specified cut-offs for CSF"}, {"section_title": "", "text": "Statistical analyses. Analyses were conducted using SAS version 9.4 and R version 3.4.0.\nDerivation of cut-offs for CSF pTau and tTau. To derive cut-offs for the assessment of clinical decline by single tau biomarkers (pTau and tTau), progression analyses were performed across a grid of cut-offs (in 2.5% steps) in ADNI. Based on findings for different models (as specified below), and outcomes evaluated across the grid, cut-offs were derived using visual assessment that provided a good separation between MCI patients with a higher versus lower risk of clinical decline. The ability of biomarker status (based on the selected cut-offs) to predict risk of clinical decline was evaluated in the BioFINDER population.\nAs a sensitivity analysis, cut-offs were derived based on concordance (Youden-index optimisation) with the outcome AD versus cognitively normal controls in both studies.\nMixed-effects modeling. Based on biomarker status (as specified by the cut-offs), CSF samples were classified as biomarker-positive (BM-positive) or biomarker-negative (BM-negative). MMSE scores from visits at baseline, 12 and 24 months for BioFINDER and from visits at baseline, 6, 12 and 24 months for ADNI were evaluated as the main outcome measure. Clinical Dementia Rating Scale Sum of Boxes (CDR-SB; ADNI), Functional Activities Questionnaire (FAQ; ADNI and BioFINDER) and Alzheimer's Disease Assessment Scale-cognitive (ADAS-cog; ADNI) were also evaluated as outcome measures.\nPrediction of change in clinical score based on biomarker status was analysed using linear mixed-effects regression models, including random effects (random intercepts) for the patient and fixed effects for biomarker test result at baseline (BM-negative and BM-positive), visit (categorical), baseline clinical score (continuous), interaction between visit and baseline clinical score, interaction between visit and biomarker test result and the adjustment covariates age, sex and years of education (with [data not shown] and without adjustment for APOEε4 allele status). The model was fitted using restricted maximum likelihood estimation and the Satterthwaite approximation for the degrees of freedom. The model was used to evaluate the following three effects: change in clinical score from baseline to 24 months in BM-negative patients; change in clinical score from baseline to 24 months in BM-positive patients; difference in clinical scores from baseline to 24 months between BM-positive and BM-negative patients.\nTime-to-event modeling. Time-to-event analyses were performed for the outcome time-to-dementia diagnosis in the ADNI MCI and BioFINDER MCS populations (6 years' follow-up). In the BioFINDER MCS population, time to AD diagnosis was also assessed; this was not assessed in ADNI, as most subjects progressed to AD. Cox proportional hazards models were fitted with covariate biomarker status (BM-negative and BM-positive) adjusted for age, sex, years of education, baseline MMSE and baseline CDR-SB (ADNI). Hazard ratio (HR) estimates with 95% confidence intervals (CIs) were obtained and Kaplan-Meier curves estimated according to biomarker status.\nMulti-marker modeling. Mixed-effects and time-to-event analyses were performed to evaluate the contribution of tau, in addition to amyloid biomarkers, to the prediction of risk of clinical decline and conversion to dementia, when tau was combined with markers of amyloid pathology: Aβ(1-42), Tau/Aβ(1-42) ratios or amyloid-PET. The evaluation was performed using linear mixed-effects and Cox proportional hazards models as described above, and four-categorical variables were defined as: amyloid + |Tau + , amyloid -|Tau + , amyloid + |Tau -, amyloid -|Tau -. Likelihood ratio tests (LRTs) were used to assess the contribution of tau in the models."}, {"section_title": "Results", "text": "Study populations. Baseline characteristics for ADNI (MCI) and BioFINDER (MCS) populations are presented in Table 1 . Age, baseline MMSE and APOEε4 genotype were broadly similar between the ADNI and BioFINDER populations, but key differences included lower measured baseline Aβ(1-42) concentrations (962 versus 1,142 pg/mL) and baseline FAQ score (3.06 versus 5.67), and higher proportion of patients with a first-degree family history of dementia (57% versus 41%)."}, {"section_title": "Derivation of cut-offs for CSF pTau and tTau.", "text": "Patient classification as BM-positive versus BM-negative using single tau biomarker cut-offs of 27 pg/mL (pTau) and 300 pg/mL (tTau) provided good separation between patients with higher versus lower risk of clinical decline, and these values were therefore selected for evaluation. The selected cut-offs showed robust separation of BM-positive and BM-negative patients when clinical decline was based on change in the clinical scores MMSE, CDR-SB (ADNI only), ADAS-cog (ADNI only) and FAQ, or dementia diagnosis in ADNI (Supplementary Figs. S1-S3).\nIn a sensitivity analysis, single tau cut-offs were optimised for identification of AD patients versus normal controls in the BioFINDER and ADNI populations. Cut-offs identified were 28 pg/mL (pTau) and 307 pg/mL (tTau) in BioFINDER, and 24 pg/mL (pTau) and 266 pg/mL (tTau) in ADNI. Derived cut-offs for each study were similar and demonstrated a similar performance to the original cut-offs of 27 pg/mL (pTau) and 300 pg/mL (tTau) in both study populations, thus confirming the robustness of the chosen cut-offs (Supplementary Figs. S1-S3).\nCSF biomarkers as predictors of clinical decline. MMSE scores for BM-negative patients remained stable from baseline to 24 months, with a mean change of -1.20 to -0.04 across all five biomarkers in the ADNI and BioFINDER populations ( Table 2 ). In contrast, MMSE scores for BM-positive patients decreased steadily, with a mean change of -2.31 to -1.90, indicating that cognitive decline was greater among BM-positive compared with BM-negative patients. This trend was evident in both ADNI and BioFINDER populations and for all five biomarkers ( Table 2 ; Fig. 1 ); however, amongst BM-negative patients, mean changes in MMSE score were slightly lower in ADNI (-0.68 to -0.04) compared with BioFINDER (-1.20 to -0.74).\nThe difference in change in MMSE score between BM-negative and BM-positive patients ranged from -2.10 to -0.70 across all five biomarkers in both populations, with upper 95% confidence limits of < 0. The difference between BM-positive and BM-negative patients was a little more pronounced in ADNI (-2.10 to -1.40) than in BioFINDER (1.57 to -0.70) ( Table 2 ; Fig. 1 ); the smaller between-group difference in BioFINDER reflects the greater change in MMSE score in BM-negative patients described above. Estimates for all covariates can be found in Supplementary Table S1 . Additional analyses based on FAQ, CDR-SB (ADNI only) and ADAS-cog (ADNI only) clinical scores also showed good separation between BM-negative and BM-positive patients, indicating greater clinical decline among BM-positive patients ( Supplementary Table S2 ; Supplementary Fig. S4 ). Sensitivity analyses, to evaluate the robustness of the data, show that risk of clinical decline was accurately predicted in the ADNI cohort even when using cut-offs derived from BioFINDER and adjusted to account for differences in pre-analytical handling in ADNI ( Supplementary Table S3 ; Supplementary Fig. S5 ). When comparing the performance of each biomarker for predicting risk of clinical decline, the Tau/Aβ(1-42) ratios were superior to single biomarkers, as demonstrated by the greater difference in MMSE scores between BM-negative and BM-positive patients, i.e. -2.10 for tTau/Aβ(1-42) versus -1.40 for tTau in ADNI ( Table 2) . When comparing the performance of different cut-offs, separation between MMSE scores for BM-negative and BM-positive patients was robust, and the PET-optimised cut-offs were not substantially outperformed by any of the other cut-offs analysed; findings were consistent for clinical scores CDR-SB, FAQ and ADAS-cog (Supplementary Figs. S1 and S2)."}, {"section_title": "CSF biomarkers for prediction of conversion to dementia or AD. CSF biomarker status at baseline", "text": "identified patients with a higher (BM-positive) versus lower (BM-negative) risk of conversion to dementia within 6 years, as demonstrated by good separation on Kaplan-Meier curves (Fig. 2) . HRs for conversion to dementia were highest for pTau/Aβ(1-42) and tTau/Aβ(1-42), and lowest for pTau and tTau (Table 3 ). Although HRs for www.nature.com/scientificreports www.nature.com/scientificreports/ conversion to all-cause dementia were lower in BioFINDER than in ADNI, exploration of conversion to AD dementia in BioFINDER showed larger HRs; the greatest differences were observed for pTau/Aβ(1-42) (HR 11.48 versus 3.38) and tTau/Aβ(1-42) (HR 10.31 versus 3.38; Table 3 ).\nWhen comparing the performance of different cut-offs across a grid, results were robust, and cut-offs derived in BioFINDER and adjusted for differences in pre-analytical handling procedure in ADNI showed similar results to those based on the PET-optimised cut-offs, for all clinical scores ( Supplementary Fig. S3 )."}, {"section_title": "Contribution of single tau biomarkers when combined with biomarkers of amyloid status for the prediction of risk of clinical decline and conversion to dementia.", "text": "Mixed-effects model estimates of differences in clinical decline from baseline to 24 months, based on MMSE score, were greatest for patients who were positive for both biomarkers compared with patients who were negative for both biomarkers (reference) across all biomarkers in both ADNI and BioFINDER populations. When considering amyloid Table 4 ; Fig. 3A, C) . In both cases, the contribution of pTau was significant, with P LRT ≤ 0.05 ( Table 4 ). The contribution of pTau was also significant when added to amyloid status defined by pTau/Aβ(1-42) or visual PET read-out in the ADNI population, but not in the smaller BioFINDER population (Table 4 ; Supplementary Figs. S6 and S7) . Results were also similar for the contribution of tTau (Table 4) .\nTime-to-event modelling, considering amyloid status defined by Aβ(1-42) in combination with pTau, showed clear separation according to biomarker status for analysis of conversion to all-cause dementia in ADNI, and to a lesser extent in BioFINDER (Fig. 3B, D) . Corresponding HRs were consistently highest for amyloid + |Tau + compared with the reference amyloid-|Tau-and confirmed the contribution of tau for predicting conversion to dementia (Table 4 )."}, {"section_title": "Discussion", "text": "Our findings show that Aβ(1-42), pTau and tTau are promising CSF biomarkers for predicting the risk of clinical decline and conversion to AD or dementia in patients with MCI/MCS, using novel Elecsys immunoassays. Tau/ Aβ(1-42) ratios demonstrated superior performance to the single CSF biomarkers Aβ(1-42), pTau and tTau. Cut-off values for single tau biomarkers were also derived and validated.\nThe ability to diagnose AD early in the disease course and identify disease progression is of utmost importance for planning patient treatment and care. Robust biomarkers that can accurately assess clinical decline are therefore needed to support clinical assessment of patients in practice and the evaluation of potentially disease-modifying drugs in trials. This study demonstrates that classification of MCI/MCS patients as BM-positive or BM-negative according to CSF biomarkers pTau/Aβ(1-42), tTau/Aβ(1-42), Aβ(1-42), pTau or tTau can distinguish between those who are at higher versus lower risk of clinical decline, based on the change in clinical scores over 24 months. In addition, time-to-event analyses show that these biomarkers can predict the risk of conversion to dementia within 6 years according to BM-negative versus BM-positive status at baseline. Importantly, we validated the Biomarker Mixed-model estimate (95% CI) of difference in clinical decline (24 months) versus reference, BM-/BM- Previous studies of CSF biomarkers Aβ(1-42), pTau and tTau have reported encouraging evidence for their utility as predictors of clinical decline 11, 26, 27 . In our comprehensive evaluation of five CSF biomarkers across four clinical scoring algorithms, we demonstrate the consistently superior performance of the Tau/Aβ(1-42) ratios compared with single biomarkers for prediction of clinical decline and conversion to dementia. Specifically, pTau/ Aβ(1-42) demonstrated the best performance for prediction of clinical decline in MCI patients over 24 months. These data suggest that Tau/Aβ(1-42) ratios are the most sensitive and specific of the AD CSF biomarkers currently under investigation, a finding supported by previous studies 10, 12, 28 . Superior performance with both pTau/Aβ(1-42) and tTau/Aβ(1-42) compared with Aβ(1-42) observed in our study may relate to the extended degree of neuronal dysfunction and death, induced by tau hyper-phosphorylation and aggregation 29, 30 . It could also be linked to improved amyloid-PET-concordance of Tau/Aβ(1-42) ratios compared with Aβ(1-42), pTau and tTau [31] [32] [33] . This seems to reflect AD pathology, as amyloid-PET imaging mostly detects neuritic plaques, containing tau and Aβ 29 . www.nature.com/scientificreports www.nature.com/scientificreports/ For the first time, we report cut-offs for single pTau and tTau CSF biomarkers; these cut-offs were derived using the ADNI population and then validated in BioFINDER. Our approach of optimising CSF biomarker cut-offs for concordance with amyloid-PET status, as previously used for derivation of Aβ and Tau/Aβ(1-42) ratio cut-offs, is therefore newly validated as a method for determining cut-offs for clinical decline analyses. Of note, the optimal cut-offs for pTau and tTau were similar in both cohorts even though CSF was collected using different protocols and the Elecsys analyses were performed in different laboratories, demonstrating the robustness and transferability of data generated with the Elecsys pTau and tTau CSF assays."}, {"section_title": "LRT P value", "text": "Analyses conducted based on tau status added to an Aβ assessment, such as Aβ(1-42), Tau/Aβ(1-42) or visual PET, may closely reflect clinical practice and provide insight into performance differences between biomarkers 34 . Using the newly established single tau cut-offs, we showed that the benefit of tau in addition to Aβ(1-42) is consistently significant across two study populations. However, the added benefit of tau in addition to Tau/Aβ or PET was less compelling. This may be because Aβ and combined Aβ/tau pathology are strong predictors of clinical decline and conversion to AD, whereas tau is associated with other pathologies, and is therefore not an ideal single marker for the prediction of specific dementia types. Further, the effect of tau in addition to Tau/Aβ(1-42) may be minimal because tau is already present in the ratio. Small sample sizes limit the conclusions that can be drawn. Our findings are, however, consistent with other studies where tau showed clinical value in combination with Aβ(1-42) 34 , and Aβ(1-42) only predicted conversion to AD dementia when combined with pTau as a ratio 10, 35 . Such findings are consistent with the hypothesis that as tau pathology emerges with pre-existing amyloid pathology, the overall rate of disease progression increases 35 .\nNotably, all biomarkers predicted progression more strongly in ADNI compared with BioFINDER, which may reflect the smaller sample size and differences in population characteristics. ADNI was developed to simulate an AD clinical trial, which is reflected in the enrolment criteria and may have resulted in a more select AD population compared with BioFINDER, by including fewer patients with other forms of dementia or any significant neurological disease other than AD. This may also account for the stronger performance of the CSF biomarkers when used to predict conversion to AD, rather than all-cause dementia, in BioFINDER. In BioFINDER, although most dementia cases are due to AD, many patients developed other forms of dementia, consistent with post-mortem studies comprising patients with MCI at baseline 36 . Similarly, although AD may be the primary diagnosis in ADNI patients, many patients had more than one co-pathology such as Lewy body pathology and TDP-43 deposits (observed in approximately 42% and 21% of patients, respectively) 37, 38 .\nStrengths of this study include the comprehensive analysis of samples from two large, international cohorts, including many follow-up visits, thus improving the reliability of the results. The Elecsys immunoassays have an excellent analytical performance, therefore enabling accurate and precise measurement of CSF biomarker concentrations between and within laboratories. This is demonstrated in both the consistency of cut-offs for pTau and tTau, when derived from CSF samples collected from two different cohorts and analysed at different laboratories, and the ability of Tau/Aβ(1-42) ratios to accurately predict risk of cognitive decline in one cohort (ADNI) even when using cut-offs established in another cohort (BioFINDER). Our approach of optimising CSF Tau/Aβ(1-42) ratio cut-offs for concordance with amyloid-PET status also contributed to the consistency of these analyses. Findings were also consistent between both continuous clinical scores as outcomes and time-to-event analyses.\nThis study provides valuable data supporting the potential benefits of CSF biomarker assessment as a robust and accurate alternative to imaging techniques. Advantages of CSF biomarkers over imaging techniques include lower cost and the opportunity to detect other pathologies by the same procedure, for example analysing other CSF components such as neurofilament light chain and neurogranin. Plasma-based assays are also in development, and could provide a less invasive means of assessing patients with cognitive symptoms and suspected AD in primary care settings 39 . However, measurement of AD biomarkers, e.g. tau protein and Aβ , in blood samples may face analytical challenges due to their low abundance relative to the very high levels of plasma proteins, resulting in matrix interference, as well as possible biological confounders such as expression of these proteins in peripheral tissue with release into plasma 40 . Greater utilisation of CSF biomarkers in clinical trials could aid identification of appropriate patients most likely to benefit from potentially disease-modifying drugs and help to assess their efficacy 11, 13, 41 . Elecsys CSF assays also offer the benefit of minimising potential inter-observer variability that can occur with imaging."}, {"section_title": "Data availability", "text": "ADNI data are available at http://adni.loni.usc.edu/data-samples/access-data/. For the BioFINDER study, anonymised data is available upon request from any qualified investigator for the sole purpose of replicating procedures and results presented in the article, subject to data transfer aligning with EU legislation on the General Data Protection Regulation."}]