[{"section_title": "Abstract", "text": "Context: Hearing impairment affects many older adults, but the incidence is unknown.\nObjective: To determine the 5-year incidence and progression of hearing impairment.\nDesign: A longitudinal, population-based study of adults aged 48 to 92 years at baseline examination. Hearing sensitivity was measured twice, 5 years apart. Main Outcome Measure: The examinations included otoscopy, screening tympanometry, and tone air-and bone-conduction audiometry. Incidence of hearing impairment was defined as a pure-tone average (PTA) of thresholds at 500, 1000, 2000, and 4000 Hz (PTA 0.5, 1, 2, and 4 kHz ) greater than 25 dB HL (hearing level) in either ear at follow-up among those without hearing loss at baseline. Progression was defined as a change of more than 5 dB in the PTA 0.5, 1, 2, and 4 kHz among those with hearing loss at baseline.\nThe 5-year incidence of hearing impairment was 21%. More than half of those with hearing loss at baseline experienced a decline in hearing. Age was an important risk factor for both incidence and progression. Male sex, occupation, and education were associated with the incidence of hearing loss after adjusting for age.\nOlder adults have a high risk of developing hearing loss. Among those with hearing loss, most experience further declines in hearing sensitivity over time. These data indicate that hearing impairment is an important public health problem and underscore the need for appropriate hearing screening and treatment."}, {"section_title": "B", "text": "ASED ON data from the Health Interview Survey, more than 2.2 million adults older than 70 years have hearing impairment in the United States, making hearing impairment one of the most common chronic health conditions affecting older adults in the United States. 1, 2 In a population-based study of hearing in Beaver Dam, Wis, 21% of adults aged 48 to 59 years had hearing loss defined as a puretone average (PTA) of thresholds at 500, 1000, 2000, and 4000 Hz (PTA 0.5, 1, 2, and 4 kHz) greater than 25 dB HL (hearing level) in either ear, and 90% of adults 80 years or older had hearing loss. 3 Despite this high prevalence, more than 36% of the population reported that they had never had their hearing tested. 3 Although it is well recognized that hearing loss is associated with important communication problems, most older adults with hearing loss do not use hearing aids. In Beaver Dam, only 14% of those with hearing loss based on audiometric testing used hearing aids. 4 Hearing loss in older adults remains an underdiagnosed and undertreated health problem.\nWith the shifting age distribution of the US population, it is expected that large numbers of older adults will experience hearing impairment in their later years. However, there are few epidemiologic studies of the incidence of hearing loss in older adults on which to base projections for managing this growing public health problem. In the Framingham Study, which followed up a cohort of people initially free of cardiovascular disease, hearing was tested twice, 6 years apart, in adults aged 58 to 88 years. 5 Among left ears with average hearing thresholds within normal limits at the first hearing examination (examination 15), 13 .7% developed a hearing impairment by the follow-up exami-nation. 5 The incidence in right ears was slightly lower (8.4%). 5 In the Baltimore Longitudinal Study of Aging 6 of men without a history of noise exposure or middle ear disease, 17% of those 70 years or older (mean followup, 5 years) and 13% of men aged 60 to 69 years (mean follow-up, 7.8 years) developed hearing loss. These studies may have underestimated the population incidence of hearing loss, because cardiovascular disease and noise exposure are common exposures for older adults and may be associated with age-related hearing loss. 7 Population-based data about the incidence and progression of hearing loss in older adults are needed to estimate the need for hearing-related health care services. This study was designed to measure the 5-year incidence and progression of hearing loss in a populationbased cohort in Beaver Dam, Wis."}, {"section_title": "METHODS", "text": ""}, {"section_title": "POPULATION", "text": "During 1987-1988, a private census was conducted to identify residents of the city or township of Beaver Dam who were aged 43 to 84 years. 8 This cohort subsequently was invited to participate in the Beaver Dam Eye Study, a study of age-related ocular disorders. 9, 10 Of the 5924 eligible people, 4926 (83%) participated in the eye examination phase (1988) (1989) (1990) . The Beaver Dam Eye Study participants alive as of March 1, 1993 , were eligible for baseline examination for the Epidemiology of Hearing Loss Study (EHLS; n=4541), which occurred at the time of the 5-year follow-up visit for the eye study. 3 Of those eligible for the EHLS, 3753 (82.6%) participated in the hearing study, 180 (4.0%) died before being seen, 604 (13.3%) refused to participate, and 4 (0.1%) were lost to follow-up. Some participants (n = 182) refused the hearing testing but completed the interview. 3 Of the 3407 EHLS participants alive as of March 1998, 2800 (82.2%) participated in the 5-year follow-up study, 436 (12.8%) refused, 164 (4.8%) died before being seen, and 7 (0.2%) were lost to follow-up. The mean length of follow-up was 5.3 years. Participants (n = 2800) were younger than living nonparticipants and those who died before being reexamined (n=510) (64.1, 66.4, and 74.7 years, respectively; PϽ.001). After adjusting for age, nonparticipants in the 5-year follow-up (n=953) were more likely than participants to have a hearing loss at baseline, have a lower socioeconomic status as indicated by education level and type of occupation, and smoke ( Table 1) . Neither the ageadjusted sex distribution nor the prevalence of cardiovascular disease differed between participants and surviving nonparticipants. People who died before participating in the 5-year follow-up study were more likely than participants to be male and to have a history of cardiovascular disease."}, {"section_title": "EXAMINATIONS", "text": "Informed consent was obtained at both the baseline and follow-up examinations. The same standardized methods were used at both examinations, except as noted herein. The hearing examination included an otoscopic evaluation, 11 screening tympanometry (GSI 37 Autotymp; Grason-Stadler Inc, Madison, Wis), 11, 12 and pure-tone air-and bone-conduction audiometry. 3 Audiometric testing was conducted according to the guidelines of the American Speech-Language-Hearing Association in sound-treated booths (Industrial Acoustics Company, New York, NY). 13 Pure-tone air-conduction thresholds were obtained for each ear at 500, 1000, 2000, 3000, 4000, 6000, and 8000 Hz. Bone-conduction thresholds were measured at 2 frequencies at baseline (500 and 4000 Hz) and 3 at follow-up (500, 2000, and 4000 Hz). Masking was used as necessary.\nAt baseline examination clinical audiometers (Virtual 320; Virtual Corporation, Seattle, Wash) equipped with TDH-50 earphones and insert earphones (E-A-Rtone 3A; Cabot Safety Corp, Indianapolis, Ind) were used. At the follow-up examination, clinical audiometers (GSI 60; Grason-Stadler Inc) equipped with TDH-50 earphones and insert earphones were used to ensure re liable equipment would be available throughout the entire 2 1 ⁄2-year examination period. The baseline audiometers could no longer be serviced, because parts were no longer being manufactured. During both examination phases, people unable to travel to the clinic site (nursing home residents, home-bound participants, and people living in remote areas; n=132 at baseline and n=139 at follow-up) were tested at their place of residence using a portable audiometer (Beltone 112; Beltone Electronic Corp, Chicago, Ill). All audiometers were calibrated in accordance with American National Standards Institute standards 14 and were recalibrated every 6 months during the study periods. Ambient noise levels were measured at each home or nursing home visit and were routinely monitored at the clinic site at the Beaver Dam Community Hospital to ensure that testing conditions complied with American National Standards Institute standards. 15 A questionnaire about ear-and hearing-related medical history, noise exposure (during leisure, military service, and work), 16 occupationalhistory,andself-perceivedhearingfunction 17, 18 was administered as an interview at the baseline and follow-up examinations. Questionnaire data on educational attainment, medical history, lifestyle factors, and medication use were obtained as part of the concurrent Beaver Dam Eye Study examinations in the same cohort. The participants completed the hearing examination and the eye study examination an average of 1.1 days apart."}, {"section_title": "DEFINITIONS", "text": "At baseline, the presence of hearing loss was defined as a PTA 0.5, 1, 2, and 4 kHz greater than 25-dB HL in either ear. 3 A person was considered to be at risk of incident hearing loss during the 5-year follow-up period if the PTA 0.5, 1, 2, and 4 kHz in both ears was less than 25-dB HL at baseline. Incident hearing loss was defined as a PTA 0.5, 1, 2, and 4 kHz greater than 25-dB HL in either ear at follow-up among participants at risk of incident hearing loss (ie, no hearing loss at baseline).\nParticipants with hearing loss at baseline 3 were considered to be at risk of progression of hearing loss if the PTA 0.5, 1, 2, and 4 kHz in the worse ear was less than 100-dB HL. There were 29 people with hearing loss at baseline with a PTA 0.5, 1, 2, and 4 kHz of 100 dB HL or more. These people were excluded from analyses because their hearing thresholds at baseline were near the limits of measurement. Progression of hearing loss was defined as a PTA 0.5, 1, 2, and 4 kHz at follow-up that was more than 5 dB greater than the baseline PTA 0.5, 1, 2, and 4 kHz . Improvement was defined as a PTA 0.5, 1, 2, and 4 kHz at follow-up that was more than 5 dB better than the baseline PTA 0.5, 1, 2, and 4 kHz . This amount of change is greater than that expected due to normal variability. 18 A conductive loss was considered to be present if an airbone gap of 15 dB or greater was present at 500 or 4000 Hz in the ear with the worse hearing. Other signs of possible middle ear problems were considered to be present if, in the absence of a conductive loss, the tympanogram showed a flat or severely reduced peak compensated static acoustic admittance (peak Y tm , Յ0.1 millimho), high peak Y tm (Ն3.0 millimho), or an equivalent earcanal volume of 3.0 mL or more, or if the examiner reported evidence on otoscopic evaluation of drainage, a bulging or retracted eardrum, a visible air-liquid line, or a perforated eardrum.\nCardiovascular disease was based on self-report of physician-diagnosed myocardial infarction, stroke, or angina. Cigarette smoking status was based on self-report at baseline. Participants who reported having smoked at least 100 cigarettes were considered to be smokers. Of these, past smokers were defined as participants who at baseline examination reported having stopped smoking. Occupation was classified on the basis of the job held the longest.\nAnalyses were conducted using SAS software version 6.09 (SAS Institute Inc, Cary, NC). Univariate analyses used the 2 test of association for categorical variables, the MantelHaenszel test of trend for ordinal data, 19 and t tests of mean differences for continuous data. Age-adjusted comparisons between participants and nonparticipants (Table 1) used the Cochran-Mantel-Haenszel statistic for general association 20 as did age-adjusted comparisons of prevalence and incidence rates between men and women. Logistic regression was used to evaluate the associations of age, sex, socioeconomic and occupational factors, and the incidence and progression of hearing loss."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "FIVE-YEAR INCIDENCE OF HEARING LOSS", "text": "As shown in Figure 1 , 1925 participants in the baseline study were considered to have normal hearing and were, therefore, at risk of developing incident hearing loss by the 5-year follow-up examination. Participation was high in this subgroup, with 1636 (85%) being reexamined. Among those at risk of incident hearing loss, there were no statistically significant differences between participants and surviving nonparticipants in age, sex distribution, baseline PTA 0.5, 1, 2, and 4 kHz, occupation, education, or history of cardiovascular disease (data not shown). Nonparticipants were more likely to be smokers at baseline. incidence of hearing loss increased with age group for men and women ( Table 2) . Age-specific incidence rates were greater for men than women at younger ages (Ͻ70 years), but no sex differences were detectable within the older age groups. There were few participants 80 years or older who were at risk of incident hearing loss. The age-adjusted, 5-year incidence of hearing loss was 30.7% for men and 17.0% for women. Adjusting for age and sex, the risk of incident hearing loss was greater for men than women (odds ratio [OR], 2.71; 95% CI, 2.04-3.59) and increased with age (OR, 1.81; 95% CI, 1.66-1.97; for 5 years of increased age). The average age at onset was 65.9 years for men and 72.9 years for women."}, {"section_title": "EDUCATION, OCCUPATION, AND INCIDENCE OF HEARING LOSS", "text": "We evaluated the association of education and occupation with the incidence of hearing loss in this population. In separate age-and sex-adjusted models, education and occupation were each associated with the incidence of hearing loss ( Table 3) . Participants with less education were more likely to develop a hearing loss than those with 16 or more years of education. Participants who had worked in industrial jobs (production, operator, or fabricator positions) were almost twice as likely to develop incident hearing loss as participants who had management and professional positions. In models that included both indicators of socioeconomic status, employment in operations or fabricator positions (OR, 1.68; 95% CI, 1.08-2.63) and low educational attainment (OR, 1.46; 95% CI, 0.99-2.15) were associated with the incidence of hearing loss. Self-reported history of noise exposure in occupational settings was not significantly associated with the 5-year incidence of hearing loss."}, {"section_title": "TYPE OF HEARING LOSS", "text": "Among the incident cases (n=337), 37 (11.0%) had evidence of a conductive loss at follow-up and 26 (7.7%) had other signs of possible middle ear problems without any conductive loss. Among those with conductive components, 18 participants would continue to meet the definition for incident hearing loss based on boneconduction thresholds, if the conductive problems were resolved. Thus, most participants with incident hearing loss (94%) seemed to have hearing loss that was likely to be due primarily to changes in the cochlea or neural pathway. The average frequency-specific hearing thresholds at follow-up are illustrated in Figure 2 for incident cases and those who remained free of hearing loss as defined herein. The sloping pattern of hearing loss, with higher (worse) thresholds at higher frequencies, is considered typical of sensorineural hearing loss."}, {"section_title": "FIVE-YEAR PROGRESSION OF HEARING LOSS", "text": "As shown in Figure 1 , 1631 participants in the baseline study were considered to have prevalent hearing loss and were, therefore, at risk of progression (worsening) by the 5-year follow-up examination. Participation was lower in this subgroup, with 1085 (66.5%) being reexamined. The mortality rate was higher among the prevalent cases than those at risk of incident hearing loss, reflecting the older age at baseline of participants at risk of progression compared with those at risk of incident hearing loss (71 vs 61 years, respectively; PϽ.001). Among participants at risk of progression, there were no statistically significant differences between participants and surviving nonparticipants in age, sex distribution, baseline PTA 0.5, 1, 2, and 4 kHz , or history of cardiovascular disease. Compared with participants, nonparticipants were less educated, less likely to have management or professional occupations, and more likely to be smokers at baseline examination (data not shown). The mean PTA 0.5, 1, 2, and 4 kHz of the at-risk group was 46.3-dB HL at follow-up compared with 39.5-dB HL at baseline examination. The overall 5-year progression of hearing loss (greater than a 5-dB increase in PTA 0.5, 1, 2, and 4 kHz) was 53.3% (95% CI, 50.2%-56.4%). Only 2.3% (n=24) of participants showed an improvement of more than 5 dB in PTA 0.5, 1, 2, and 4 kHz . The 5-year rate of progression increased by age group (Table 4) . There were no differences in the age-specific or age-adjusted rates of progression between men and women. The overall ageadjusted, 5-year progression of hearing loss was 51.1% for men and 56.3% for women. In a logistic regression model that adjusted for age and sex, the risk of progression was similar for men compared with women (OR, 0.80; 95% CI, 0.61-1.05) but increased with age (OR, 1.34; 95% CI, 1.24-1.44; 5 years of age). There was no association between education or occupation type and the risk of progression of hearing loss."}, {"section_title": "COMMENT", "text": "These results indicate that the risk of developing hearing loss during a 5-year follow-up period was high for both men and women. Overall, more than 1 in 5 developed impaired hearing during the 5-year follow-up period. This rate is higher than reported in longitudinal studies in the United States, which may reflect differences in the age and sex distributions of the cohorts studied or the impact of their initial selection criteria. 5, 6 The 5-year incidence in the Beaver Dam population was similar to that seen in a small (n=98), longitudinal study 18 in Great Britain, where the incidence of hearing loss was 18% after an average of 4.56 years of follow-up. In that study, subjects were sampled from participants in a larger, population-based, cross-sectional survey.\nIn Beaver Dam, men were more likely than women to develop a hearing loss, which is consistent with crosssectional results from this and other studies. 2, 3, 21 This sex difference was not explained by age or occupation. This is the first epidemiologic study to report a sex difference in incidence of hearing impairment. Although residual uncontrolled confounding may explain some of the sex difference, it seems that a sex difference in noise exposure in occupational settings does not fully account for the higher rates of hearing loss among older men than women.\nAge was a significant risk factor for incidence of hearing loss. Although there were few older adults at risk of hearing loss, the incidence in these groups was high, suggesting that people remain at risk of hearing loss throughout the life span.\nPeople who had engaged in jobs with a greater potential for exposure to damaging levels of noise were more likely to develop hearing loss. Many of the participants were no longer engaged in these jobs because many were retired. Although baseline PTA 0.5, 1, 2, and 4 kHz was slightly worse among participants who had jobs more likely to be noisy than participants with other jobs, this difference was small (1.4 dB) and unlikely to explain the risk differential observed. This finding suggests that occupational noise exposure during working years may cause subclinical damage, which predisposes individuals to agerelated changes, or that occupation serves as a broader marker for many lifestyle and socioeconomic factors, which may contribute to the risk of hearing loss. The marginally significant association between educational attainment in models with occupation, age, and sex and the lack of an association between our measure of history of noise exposure at work and incidence of hearing loss are consistent with the latter hypothesis.\nThe 5-year progression of hearing loss was high in the participants with hearing loss at baseline examination. Age was the only factor associated with the risk of worsening hearing. Studies 5, 6, [22] [23] [24] [25] of the progression of hearing loss over time have focused on frequency-specific rates of change or have included those with and without prevalent hearing loss, so no direct comparison with published reports is possible. Nonetheless, these data indicate that older people with hearing loss should expect their hearing to deteriorate. This poor prognosis emphasizes the need for improvements in delivery of hearing-related health care services. Older people with hearing loss likely will experience increased hearing impairment and need appropriate referrals for auditory rehabilitation. This may include hearing aids, assistive listening devices, and/or training in listening strategies to reduce communication problems. Hearing loss is associated with lower self-reported quality of life 26 and has been suggested to lead to social isolation. 27 The strengths of this study include the large, representative cohort, high participation rates, and use of standardized, audiometric testing to measure hearing sensitivity at 2 points. An important limitation is that the Beaver Dam cohort is predominately non-Hispanic white, which may limit the generalizability of these results to minority groups. There are no published reports, to our knowledge, about the incidence of hearing impairments in minority groups. These results have important public health implications. Based on these data, we estimate that, in the United States, there will be 9 million new cases of hearing loss in older adults in 5 years and hearing will worsen in 17 million older people with hearing loss. We have previously reported that only 14.6% of people with a hearing loss at baseline used hearing aids and more than one third had never had their hearing tested. 3, 4 It is likely that the growing number of older adults will need greater access to audiologic services to maintain quality of life in their later years. The relatively young average age at onset among incident cases (66 years for men and 73 years for women) shows that older adults face many years of life with hearing impairment. For clinicians, these findings emphasize the need to be aware that most older patients are likely to have impaired hearing. Physicians might consider making assistive listening devices available in their offices to improve effective communication of important health information and should consider including questions about hearing as part of routine care. The US Preventive Services Task Force has recommended that physicians include routine hearing screening for patients older than 65 years. 28 In addition to rehabilitation efforts for those with hearing loss, epidemiologic studies are necessary to identify potential interventions to delay or prevent the onset of hearing impairment in older adults. "}]