[{"section_title": "Introduction", "text": "In the US, opioid use disorders (American Psychiatric Association, 1994 are a significant public health problem, with estimates of over 1 million individuals using illicit opioids in the past year (U.S. Department of Health and Human Services & Substance Abuse and Mental Health Services Administration Office of Applied Studies, 2010). Effective treatments are available, with opioid antagonist (naltrexone) and opioid agonist (methadone and buprenorphine) medications (Ball & Ross, 1991 ;Fiellin & O'Connor, 2002;Fiellin et al., 2006;Fudala et al., 2003;Johnson et al., 2000;Kakko, Svanborg, Kreek, & Heilig, 2003;Mattick, Kimber, Breen, & Davoli, 2008;National Consensus Development Panel, 1998;National Institute of Drug Abuse, 2006;National Institute of Drug Abuse National Quality Forum, 2005;Sees et al., 2000;Volkow, 2004). Opioid agonist therapy (OAT), including the use of methadone in licensed opioid agonist treatment programs, is the gold standard treatment for opioid use disorders, reducing deleterious health effects and unnecessary healthcare utilization. Historically, however, fewer than 25% of opioid dependent individuals have ever received opioid agonist therapy (American Methadone Treatment Association, 1998). A range of factors influence the utilization and diffusion of effective substance use disorder interventions, including attributes of the intervention, attributes of the clinical setting where the intervention will be implemented and the broader community context in which such clinical settings exist, characteristics of individuals receiving the intervention, and the process of implementing the intervention (Damschroder & Hagedorn, 2011). The Drug Addiction Treatment Act of 2000 (DATA 2000) allowed buprenorphine to be prescribed for 30 patients by credentialed, waivered physicians in regular office-based settings, as well as allowing it to be prescribed by physicians in licensed OAT programs. The potentially increased availability addressed some of the challenges facing more widespread diffusion of methadone, including the regulatory burden involved in opening and running an opioid treatment program, (Barnett, 2009;Barnett, Zaric, & Brandeau, 2001;Connock et al., 2007;Doran et al., 2003;Harris, Gospodarevskaya, & Ritter, 2005;Oliva, Maisel, Gordon, & Harris, 2011), the lack of support in many communities for a local opioid treatment program, (Bell, Dru, Fischer, Levit, & Sarfraz, 2002;Oliva et al., 2011) the limited number of available spaces in many opioid treatment programs, and the common requirement that most patients take methadone dispensed at the clinic. As a result, many factors that may have limited the more widespread implementation of methadone treatment for opioid use disorders, such as the traditional requirement that it be dispensed in opioid treatment programs (OTPs), are not relevant for buprenorphine. The FDA's 2002 approval of buprenorphine (collectively defined as buprenorphine mono and buprenorphine/naloxone combination products) was welcomed by many addiction experts as an opportunity to increase the number of patients with opioid use disorder receiving OAT (Ducharme & Abraham, 2008). Compared to methadone, buprenorphine is effective and cost-effective in a number of clinical situations (Barnett, 2009;Harris et al., 2005;Jones et al., 2009;Mattick, Breen, Kimber, & Davoli, 2009;Mattick et al., 2008), and buprenorphine's approval was therefore expected to increase access to evidence-based OAT treatment (O'Connor et al., 1998;Sullivan, Chawarski, O'Connor, Schottenfeld, & Fiellin, 2005). Despite the documented use in non-OTP settings (Arfken, Johanson, di Menza, & Schuster, 2010), the implementation of buprenorphine as a treatment for opioid use disorders is not as widespread as expected (Ducharme & Abraham, 2008;Adam J Gordon, Fiellin, et al., 2008;Adam J. Gordon et al., 2007;Ling et al., 2010;Roman, Abraham, & Knudsen, 2011). As of 2011, fewer than 10% of those receiving treatment for opioid use disorders in publicly funded treatment facilities were receiving buprenorphine (Substance Abuse and Mental Health Services Administration, 2012), almost a decade after its approval. Studies have examined several factors, including organizational characteristics, state policies and regulations, and physicians' concerns, related to this slower than expected diffusion Ducharme & Abraham, 2008;Ling et al., 2010;Roman et al., 2011), while other studies have documented substantial variation in buprenorphine use across counties within a state. (Stein et al., 2012) A few studies have considered the role of the number of buprenorphine-waivered physicians, finding that the number of such physicians has been increasing, although unevenly across geographic regions (C. Cunningham, Kunins, Roose, Elam, & Sohler, 2007) and urban/rural areas (Center for Substance Abuse Treatment, Substance Abuse and Mental Health Services Administration, & U.S. Department of Health and Human Services, 2006), possibly explaining variation in buprenorphine use (Fiellin, 2007;Koch, Arfken, & Schuster, 2006;Stein et al., 2012). However, no study has yet explicitly considered how external factors such as state policies and regulations may influence the geographic distribution of waivered physicians, which could subsequently influence access to and utilization of buprenorphine. One might reasonably expect that state policies that influence substance abuse treatment program use of buprenorphine, such as Medicaid support and state efforts to make clinicians more aware of the appropriate use of buprenorphine (Ducharme & Abraham, 2008), might also influence the number of buprenorphine-waivered physicians. Nor have studies examined to what extent county characteristics influence the number of buprenorphine-waivered physicians, although such county characteristics play an important role in the location of the general physician workforce, (Carpenter & Neun, 1999;C. Phelps, 2009) and factors such as the need for opioid use disorder treatment vary substantially across counties within a state. To enhance our understanding of the factors associated with the distribution of buprenorphine-waivered physicians, and to inform state policymakers seeking to increase the number of physicians able to prescribe buprenorphine, an effective treatments for opioid use disorders, in their communities, we examine the association between the number of physicians waivered to prescribe buprenorphine and states' policies and efforts to support the dissemination of buprenorphine and county characteristics."}, {"section_title": "Materials and Methods", "text": ""}, {"section_title": "Data Sources and Variables", "text": "Using the Buprenorphine Waiver Notification System available from SAMHSA and Census data, we calculated the number of buprenorphine-waivered physicians per 100,000 county residents for all United States counties from 2008-2011. As waivered physicians who were interested in prescribing for additional patients and pursued an additional waiver to be able to prescribe for up to 100 patients might be different than waivered physicians who were limited to prescribing for 30 patients, we also calculated the number of physicians waivered to prescribe for 100 patients per 100,000 county residents. State policies related to providing reimbursement for buprenorphine use were obtained from a 2008 National Conference of State Legislators survey of state Medicaid program OATrelated policies. (D. Rinaldo, 2008) For purposes of analysis, we categorized states as having (1) Medicaid or other state sources of funding (e.g., grant support or support from the state General Fund) for reimbursing office-based buprenorphine use among the publicly insured, (2) both Medicaid and other state funding for reimbursing office-based buprenorphine use among the publicly insured, or (3) no funding from either Medicaid or other state sources for reimbursing office-based buprenorphine use. Information from a survey conducted in 2006 (Ducharme & Abraham, 2008) was used to categorize additional state efforts to promote buprenorphine use, such as requiring/encouraging methadone programs to advise patients of the availability of buprenorphine, formally issuing guidance to treatment providers on clinical practice for using buprenorphine, and distributing and encouraging review of clinical practice guidelines for buprenorphine treatment (SAMHSA Treatment Improvement Protocol (TIPS) 40) (Center for Substance Abuse Treatment, 2004). We used three complementary variables, each correlated with the use of opioids, as proxies for demand for opioid use disorder treatment. The first variable used state-level estimates of nonmedical use of prescription pain relievers during the past year NSDUH,(Substance Abuse and Mental Health Services Administration Center for Behavioral Health Statistics and Quality) which publishes estimates of 2-year average rates, by state. We assigned the data by year (from 2008 to 2011) based on the second year of the NSDUH 2-year average. The second variable included counts of opioid-related overdose deaths by county for each year from 2008-2011 from the National Vital Statistics System (Centers for Disease Control and Prevention National Vital Statistics System, 2012). We converted these data to opioidrelated overdose death rates per 10,000 inhabitants of the county. The third variable involved county-level market price data for each year from 2008-2011 for illicit opioids from the Drug Enforcement Agency's System to Retrieve Information from Drug Evidence (STRIDE). (U.S. Drug Enforcement Administration) As the STRIDE data are a convenience sample reflecting law enforcement activities and not all counties have data for heroin purity in each year, we used data trimming and imputation techniques to generate predicted potencies for each county that we then enter into the regression. The imputation methods were identical to those we have employed previously in other work, and make use of information on each observation related to the year/quarter, location, and acquisition specifics (see Caulkins et al., 2004;Arkes et al., 2004 and2008.) Each of these variables (illicit painkiller use, opioid-related overdose deaths, and heroin price and purity) are correlated with opioid use. We obtained county-level data for each year from 2008-2011 from the Area Resource File (ARF) about county-level characteristics shown to influence the supply of physicians more generally (Hargraves & Hadley, 2003;Litaker, Koroukian, & Love, 2005;, including urbanicity (defined as the USDA urban-rural continuum codes), census region, unemployment rate, percent of the population that is in poverty, median income, percent of adults who are uninsured, the number of hospital beds per capita, and the number of HRSA identified community health centers. (U.S. Department of Health & Human Services) We supplemented these data with information from the National Survey of Substance Abuse Treatment Services (N-SSATS), which contains information regarding use of methadone by treatment facilities in each county and each year from 2008-2011. We excluded three states (Mississippi, North Carolina, and Rhode Island) for which no data were available from the NCSL survey of state Medicaid offices, one state (South Carolina) for which no data were available from the 2006 survey of buprenorphine use, and the District of Columbia, which was not included in either survey. The study was determined to be exempt by the RAND IRB."}, {"section_title": "Analysis", "text": "We first explored differences in the mean number of waivered providers per 100,000 residents at the county level in each year from 2008 to 2011 with respect to various state policies and county characteristics. For binary policy variables, we used t-tests to assess differences in means. For policy variables with more than two levels, we used analysis of variance (ANOVA) and Tukey's method to assess differences in means for each level. We estimated multivariable negative binomial models, in which the unit of analysis was the county-year (from 2008 to 2011), to characterize the number of waivered physicians as a function of state policies and efforts to support the dissemination of buprenorphine, socioeconomic and demographic characteristics of counties, and measures of the health care environment, including the uninsured rate, the number of hospital beds per capita, the number of community health centers per capita, the presence of a substance abuse clinic in the county dispensing methadone, and calendar year indicators. This allowed us to identify those county characteristics associated with significantly greater numbers of waivered physicians, and then to identify state level variation after controlling for these county level factors, providing a more precise estimate of state-level policy effects. To account for differences in population size, we specified county population as an exposure variable, including ln(population) in the model with coefficient restricted to 1. To account for correlation among the errors, we calculated Huber-White sandwich estimators of the standard errors, clustered at the state level, in all multivariable models. All analyses were performed using Stata version 12.0. All independent variables representing counts (e.g. the number of unemployed, the number of adults with no insurance, and the number of overdose deaths) were entered as rates per population. We present all model estimates as incident rate ratios (IRR). For each continuous independent variable, the IRR is expressed based on a one standard deviation change in the independent variable. We tested for over-dispersion, rejecting Poisson models in favor of negative binomial models. Because the NCSL survey reimbursement-related state-policy measures were from 2008, and the measures characterizing efforts to support dissemination were from 2006, we estimated an alternative specification that admitted each policy variable with a main effect and with annual calendar-time interactions. This flexible specification allowed for trends in policy effects over time, as well as allowing for differences in estimates due to unmeasured changes in the policy variables during our study period. Because none of the time-interactions by policy were jointly statistically significant, indicating that there were no differences in the relationship between the state policies and the number of waivered physicians in each year (2008 to 2011), we present results for the specification without the time interactions. As a sensitivity analysis, we re-estimated our models limiting the dependent variable to those physicians who sought a waiver to prescribe buprenorphine in 100 patients. We also conducted a sensitivity analysis excluding states that do not support methadone services for Medicaid enrollees (North Dakota, South Dakota, and Wyoming). Because the presence of an opioid treatment clinic that dispenses methadone is highly correlated with several county variables, including the rural-urban continuum codes, poverty rate, and median income, we estimated a specification of the model that excluded the indicator for the presence of an opioid treatment clinic to see whether this influenced our main policy results. As a final sensitivity analysis, we estimated specifications in which we admitted a one-year lag in overdose deaths, under the assumption that it could be lagged predictor of demand for treatment. Because we found that the contemporaneous overdose deaths fit the data much better, and that there were no significant or substantively important differences in any of the other estimated parameters, we present only those specifications with contemporaneous overdose deaths."}, {"section_title": "Results", "text": "In 2008, there were a total of 13,838 buprenorphine-waivered physicians (2,829 eligible to prescribe to 100 patients) in our sample of 2,905 counties, with a mean of 4.8 (sd=19.5) per county. By 2011, the number of waivered physicians had increased to 20,248 (5,548 eligible to prescribe to 100 patients), with a mean of 7.0 (sd=27.7) per county. Information on the average number of waivered physicians masks significant differences in the availability of waivered physicians across counties. About half of the counties (50.1%) had no buprenorphine-waivered physicians in 2008, and 43.4% had none in 2011, and at the 75 th percentile of the distribution of waivered physicians across counties, the number of waivered physicians was just 2 in 2008 and 3 in 2011. About 5% of counties had 20 or more waivered physicians in 2008, a fraction that increased to 7% in 2011. The county with the most waivered physicians had 458 in 2008 and grew further to 642 in 2011, so waivered physicians remained highly concentrated in selected counties during this time period. The distribution of waivered physicians per capita across counties is similarly skewed, with a mean of 3.3 (sd=6.6) in 2008 and 4.82 (sd=8.2) in 2011 (Table 1), with only 5% of counties having more than 13 waivered physicians per 100,000 residents in 2008 and 17.6 per 100,000 residents in 2011. Most counties (n=2,026) were in states with some publicly supported office-based opioid treatment (either Medicaid or another state program). (Table 1) Relatively few counties (n=486) were in states with no public support for office-based buprenorphine treatment, or were counties (n=393) in states with coverage for office-based buprenorphine treatment by both Medicaid and another state program. State policies supporting buprenorphine use also varied widely in reach, with far more counties (n=2,103) in states that distributed clinical guidelines on buprenorphine use to providers or that had encouraged providers to review such guidelines. Fewer counties (n=1,084) were in states that required or encouraged methadone treatment programs to advise patients on the availability of buprenorphine or were counties (n=524) in states that issued guidance to treatment providers regarding buprenorphine use"}, {"section_title": "Multivariable Negative Binomial Results", "text": "We found that counties in states that provided either Medicaid or other state support for office-based opioid treatment (OBOT) had more buprenorphine-waivered physicians per capita than did counties in states that provided neither type of support (IRR=1.20, 95% CI 1.04 to 1.4), and counties in states that provided both types of support had substantially more waivered physicians than counties in states that provided neither (IRR= 1.45, 95% CI 1.08 to 1.96). The effect of non-reimbursement-related state policies were mixed, with no significant impact from encouraging methadone programs to advise patients of buprenorphine availability (IRR=0.87, 95% CI 0.71 to 1.07); however, both the specific state guidance to providers regarding the use of buprenorphine (IRR=1.35, 95% CI 1.11 to 1.65) and the distribution of clinical guidelines (IRR=1.42, 95% CI 1.16 to 1.73) were associated with significantly more waivered physicians Among the county characteristics we examined, the number of hospital beds per capita (IRR=1.19, 95% CI 1.12 to 1.27), the total number of opioid-related overdose deaths per capita (IRR=1.16, 95% CI 1.10 to 1.22), and the purity adjusted heroin price per gram (IRR=1.16, 95% CI 1.5 to 1.29) were all positively and significantly associated with the number of waivered physicians. There were statistically significant and substantively important differences in the number of waivered physicians by census region (P<0.001). We also found that the percent of uninsured adults (IRR=0.88, 95% 0.78 to 1.00) and having no methadone clinics in a county (IRR=0.71, 95% CI 0.66 to 0.76) were negatively associated with the number of waivered physicians. Though not statistically significant, we found weak evidence of positive relationships between the number of waivered physicians and the unemployment rate (IRR=1.09, 95% CI 0.99 to 1.19. p=0.07), median income (IRR=1.11, 95% CI 0.99 to 1.23. p=0.08), and illicit painkiller use per capita (IRR=1.09, 95% CI 0.98 to 1.21). There were no significant associations between the number of waivered physicians and the percent in poverty, the number of community health centers per capita, or heroin potency. (Table 2) None of our sensitivity analyses generated substantive differences in any of the estimated results except the model in which we dropped the indicator for the absence of an opioid treatment facility that provided methadone in a county. Although the main state policy results were unchanged, the estimate of the percent in poverty was positive and statistically significant (IRR=1.11, CI 1.00 to 1.24; p<0.05)."}, {"section_title": "Discussion", "text": "In our examination of the distribution of buprenorphine-waivered physicians, we found that approximately half of the counties in the United States had a buprenorphine-waivered physician in 2008 and about 57% had at least one waivered physician by 2011. Among those counties that had at least one such physician, there was substantial variation in the total number of physicians. Recognizing that population density affects the number of physicians eligible for a waiver, and that many rural counties with low populations often have few or no such physicians, we calculated the number of waivered physicians per 100,000 county residents. Even when controlling for a county's population, however, we found that the mean number of waivered physicians was heavily influenced by a few counties with a large number of waivered physicians. Despite the fact that a large number of counties had no waivered physicians per capita, we found almost a 50-fold difference between the mean number of waivered physicians per capita and the number in the one county with the most waivered physicians per capita in 2008, and about a 30-fold difference in 2011. At a time when there are continued efforts to address the unmet need for opioid agonist treatment by training physicians to prescribe buprenorphine or waivered physicians to prescribe up to their treatment limit (30 or 100 active buprenorphine prescriptions) (Center for Substance Abuse Treatment State Systems Technical Assistance Project, 2010; Hobbs, Freese, & Laurie, 2012;Magellan Health Services, 2013;PCSS-O, 2013) as an increasingly important complement to methadone for the treatment of opioid use disorder, our findings suggest that there may be benefits to enhancing efforts to target physicians in those communities in which there is a current dearth of such practitioners. Numerous studies have shown that Medicaid reimbursement influences physician participation in Medicaid (P. J. Cunningham & O'Malley, 2009;Watson, 1995), consistent with our findings that public sector reimbursement for office-based buprenorphine treatment is associated with more waivered physicians per capita. We note, however, that the greatest numbers of physicians were seen in counties in those states in which there was both Medicaid and non-Medicaid public sector funding, such as block grant funding, for officebased buprenorphine treatment. A substantial proportion of individuals receiving treatment in substance abuse treatment settings are uninsured, (SAMHSA, 2009) and non-Medicaid public sector funding supports much of this care.(SAMHSA, 2010) Our findings suggest that similar non-Medicaid public sector support for office-based buprenorphine treatment, particularly in combination with Medicaid funding, is meaningfully associated with a more robust supply of buprenorphine-waivered physicians. We found that several state strategies to support the implementation of buprenorphine that were not reimbursement-based were significantly associated with a community having more waivered physicians per capita. There was a significant positive association between the number of waivered physicians and both specific state guidance regarding the use of buprenorphine and the distribution of clinical guidelines for buprenorphine treatment. In contrast, requiring or encouraging staff at methadone programs to advise patients of buprenorphine availability was not associated with the number of waivered physicians. Our findings that policies with more detailed guidance to providers were associated with more waivered physicians, in contrast to policies with less specific guidance to providers, are consistent with quality of care studies, which have found that detailed provider guidance, such as that occurring in academic detailing (Jin et al., 2012;Soumerai, 1998), can result in providers changing behavior. It may also be that efforts to enhance the use of buprenorphine through methadone programs, whose patients are clinically different than individuals receiving buprenorphine, (Baxter, Clark, Samnaliev, Leung, & Hashemi, 2011) and which already have an established infrastructure and alternative business model to provide an alternative opioid agonist treatment, are less effective than initiatives targeting broader groups of providers. As we did not have details regarding the specific guidance provided by states to providers, further research to determine the common characteristics of such approaches are needed to help inform state efforts to most effectively enhance the number of waivered providers. We also note that we are unable to ascertain if the policies we examine caused an increase in the number of waivered physicians. Important unobserved factors could have generated bias in our estimates. We recognize, for example, that strong community-based advocacy could induce physicians to obtain waivers while simultaneously effectively lobbying for an expansion of state Medicaid coverage policies. We found that several of the measures we included as proxies for the demand for illicit drugs, including the number of opioid-related overdose deaths per capita, the purity adjusted price of heroin, and (though weakly) the use of illicit painkillers per capita, were positively associated with the number of waivered physicians. The extent to which demand for illicit drugs translates into demand for treatment, our results suggest that the supply of waivered physicians is responsive to the demand for their services. We acknowledge that while it is possible that greater availability of buprenorphine could lead to more opioid related overdose deaths (Hayes, Klein-Schwartz, & Doyon, 2008;Megarbane et al., 2010), this is less likely in the US compared to other countries due to the predominant use of the buprenorphine/naloxone combination in the US, and given the small fraction of opioidrelated deaths due to buprenorphine, it is unlikely that this is driving the relationship. Nevertheless, further research is warranted on the relationships among the supply of waivered physicians, greater availability and use of buprenorphine, and opioid related overdose deaths. Counties with methadone clinics had significantly more waivered physicians, which suggests that, conditional on county characteristics such as rural status, the presence of a methadone clinic could be a proxy for high demand for treatment. It could also be that waivered physicians feel more comfortable prescribing buprenorphine in counties with methadone clinics given the greater availability of guideline recommended counseling services. Such a pattern is also somewhat troubling, however, since it is individuals with opioid use disorders in the counties without methadone clinics that could potentially benefit the most from improving access to opioid agonist treatment. To understand better the relationships between the provision of methadone and buprenorphine, and in particular, the extent to which buprenorphine acts as a substitute for methadone, it will be important for future investigations to examine the role of county characteristics that influence the demand for each, and how this affects physicians' decisions to seek waivers to prescribe buprenorphine. We found that median income (weakly) and adult insurance rates were associated with having more waivered physicians per 100,000 residents, findings consistent with the physician workforce literature (Cooper, Getzen, McKee, & Laud, 2002; Department of Health and Human Services & Resources and Services Administration, 2008;C. E. Phelps, 2012). Interestingly, we also found, in our sensitivity results, that when we excluded a control for the presence of a methadone dispensing clinic in a county, the percent in poverty had a positive and statistically significant association with the number of waivered physicians. It is notable that the federal government's matching rate for Medicaid spending increases with a state's poverty level, effectively decreasing the price of coverage to a state. These results are consistent with theory that greater demand for treatment services may drive the supply of waivered physicians, but the evidence (and theory) suggests that demand for services also drives location decisions for methadone clinics. The difference in the results regarding the number of waivered physicians, with and without controlling for the presence of a methadone clinic, is consistent with the interdependence of the supply of and the demand for these two forms of opioid agonist therapy. Our findings must be viewed in the context of the study and data limitations. Although we have longitudinal data on waivered physicians and county characteristics, all or our data are observational and our policy data are limited to a single year, both of which limit our ability to make inferences regarding causality. We focus on state policies that are directly intended to support the use of buprenorphine. It is possible that smaller and/or more time limited general funding for substance abuse treatment might also be used to reimburse providers using buprenorphine, but such funds that were available in the years we are examining (which included a major recession) would be spread across a range of substance use disorder treatment activities, and hence we believe the impact of such funding on buprenorphine use would be limited. We also recognize that there are likely unobserved factors, such as a community's philosophy toward the treatment of substance use disorder and the prevalence of opioid use disorder and subsequent demand for treatment, that are likely to influence both policies and waivered physician decisions regarding where to practice. Having fewer waivered physicians in counties with a larger population in need of treatment of opioid use disorders would be of greater concern than in counties in which opioid use disorders are less of an issue. In addition, as with any geographic-based analyses, the use of county borders to define markets may miss important contributions from contiguous counties. We have included in our analysis several variables (price and purity of heroin, opioid-related overdose deaths, and the use of illicit painkillers) that are correlated with use of opioids in a county, and therefore serve as likely proxies for demand for treatment for opioid use disorders. Future analyses, however, should seek to incorporate additional available information that can serve as proxies for the demand for treatment for opioid use disorders. We also acknowledge that the presence of a waivered physician as a proxy for a physician prescribing buprenorphine to patients is only adequate, as a substantial number of waivered physicians are not actively treating patients (Adam J Gordon et al., 2011;Adam J Gordon, Liberto, et al., 2008;Adam J Gordon et al., 2009), and many others may not be prescribing to the full number of patients allowed under their waiver. Despite these limitations, this study has uncovered strong associations between the number of waivered physicians and state policies and practices encouraging buprenorphine use, making an important contribution to our understanding of factors potentially influencing the distribution of buprenorphine-waivered physicians. We are encouraged by recent reports indicating that policymakers are increasingly aware of the importance of opioid agonist treatment, and that at least one large Medicaid plan in each state now includes coverage for buprenorphine as an outpatient pharmacy benefit for at least some enrollees (S. G. Rinaldo & Rinaldo, 2013). However, states commonly have multiple Medicaid managed care plans, with different formularies and pharmacy tiers, and there is substantial variation across states with respect to the number of Medicaid enrollees covered by managed care (Gifford, 2011). In addition, individuals enrolled in Medicaid managed care plans are predominantly children, parents/caretaker relatives, and pregnant women (The Kaiser Commission on Medicaid and the Uninsured, 2012), and individuals with substance use disorder are more commonly Medicaid-eligible due to disability or income, eligibility groups for whom a number of states benefits do not currently include buprenorphine (Personal Communication, Laura Tobler, Health Program Director, National Conference of State Legislatures). It therefore remains difficult to determine to what extent opioid agonist treatment is available for all Medicaid-enrollees, and while these findings contribute to our understanding of the possible influence of state policies and county characteristics on the availability of waivered physicians, further research examining data over a longer period involving policy changes is needed to more confidently understand how the evolving landscape with respect to state policies and buprenorphine is truly influencing access to and use of the medication in the treatment of individuals with opioid use disorder. Opioid use disorder is a significant public health issue with substantial societal costs and unmet need for treatment, and the buprenorphine prescribed by waivered physicians is a clinically and cost-effective intervention for individuals with opioid use disorder. At a time when Medicaid expansion is likely to significantly increase the number of individuals with opioid use disorder seeking treatment, state efforts to increase the number of waivered physicians may be an important response to this anticipated increase in demand for effective treatments. In the absence of more comprehensive and longitudinal examinations of the impact of state policies on the use of buprenorphine, this study joins multiple other crosssectional studies that have examined factors that can contribute to the use of buprenorphine, contributing to the evidence base available to clinicians, policymakers, and other stakeholders seeking to better understand factors that can support greater use of buprenorphine in their communities.  "}]