[{"section_title": "", "text": "arterial elastance; cardiovascular performance THE ARTERIAL SYSTEM IS INCREASINGLY recognized as an important modulator of cardiac performance (6) , and a potent predictor of cardiovascular (CV) outcomes (30, 52) . The arterial system imposes a load on the heart, both at rest and during exercise. A higher arterial load increases the heart's energetic costs to eject a given amount of blood (10, 24) .\nEffective arterial elastance (E A ) characterizes the net arterial load that is imposed on the heart (51). E A was originally derived from a 3-element Windkessel model, which characterizes the arterial system in terms of resistive and pulsatile components (51) . Operationally, E A is defined as end systolic arterial pressure/ stroke volume index. A higher E A reflects a greater arterial load imposed on the left ventricle (LV) and is directly related to heart rate (HR) and peripheral vascular resistance (which is determined, in large part, by the small arteries), and is inversely related to total arterial compliance (which is determined, in large part, by the central elastic arteries) (11) . At rest, the resistive component is the dominant determinant of E A (11) . During exercise both arterial resistance and compliance usually decrease, and the relative contribution of the pulsatile component to E A increases, so that by 80% of peak exercise the resistive and the pulsatile components provide nearly equal contributions to E A (37) . In various studies, E A has been shown to increase (34, 37) , decline (3) or remain unchanged (16) during exercise. The pattern of change in E A may vary with age, sex and the intensity of exercise (37, 45) . Such marked inter-individual differences in the change in E A during exercise likely reflect the specific details of the population under study and varying combinations in the determinants of E A (resistance, compliance and heart rate) among study subjects during exercise (21, 36) . How the exerciseinduced change in E A relates to a change in LV filling and ejection has not been established, nor has its relationship with aerobic capacity, a clinically important marker of overall health and mortality (33) . We therefore evaluated whether the variability in the change in E A during exercise is associated with a distinct pattern of change in arterial and cardiac function during exercise that may have important effects on exercise capacity."}, {"section_title": "METHODS", "text": ""}, {"section_title": "Study population.", "text": "The study population consisted of community dwelling volunteers with a broad age-range from the Baltimore Longitudinal Study of Aging (46) , who underwent multi-gated blood pool scans at rest and during exercise. All subjects in the current investigation had a resting LV ejection fraction (EF) greater than 50% without wall motion abnormalities at rest or during exercise. All subjects were free of CV disease as determined by detailed history and physical examination, normal resting and treadmill exercise electrocardiograms, and absence of perfusion abnormality on thallium scintigraphy during treadmill stress testing in men over 40 years, and in women over 50 years of age. From baseline SBP values, 35% of the study population presented with hypertension based on the JNC 7 guidelines (14) . However, no subject was taking any cardiac or antihypertensive medications. The study was approved by the institutional review boards of the National Institute on Aging and Johns Hopkins University. All subjects provided written informed consent to participate.\nEvaluations. All subjects underwent an upright seated bicycle graded exercise test. Pedal speed was maintained constant at 60 rpm, and workloads were increased by increments of 25W every 3 min until exhaustion. Maximum workload (MWL) was defined as the maximum wattage attained during the exercise test. Systolic and diastolic blood pressures (BP) were measured with cuff sphygmomanometry at seated upright rest, and during the final minute of each stage of exercise. End-systolic pressure (ESP) was noninvasively approximated by 0.9 (25) Despite the validation of the estimation of ESP as 0.9 ϫ SBP (13, 25) , some studies have suggested that the multiplier value is closer to 0.73 (39) . When we repeated the analyses using ESP estimated as 0.73 ϫ SBP the results were not affected; thus, only values derived from ESP estimated as 0.9 ϫ SBP are shown. Noninvasive measurements of cardiac volumes at rest and during each stage of exercise were determined with multi-gated blood technetium 99m pool scans as previously described (21) . This method has been validated both at rest (18) and during exercise (47) . Adequate scaling of physiological measures for body size is essential for correct interpretation, and often the relationship between body size and physiological function may not be linear, a major assumption for the ratiometrically scaling approach. The allometric scaling approach accounts for this potential nonlinear relationship by normalizing physiological measures using exponential powers that linearize the relationship. Thus all cardiac volumes were ratiometrically or allometrically scaled to body surface area (5), yielding their respective volume indexes: end-diastolic volume index (EDVI), end-systolic volume index (ESVI), and stroke volume index (SVI). Of note, as the types of scaling for body size did not affect the findings, only the values of the ratiometrically scaled parameters are shown. Cardiac index (CI; l/min/m 2 ) was calculated as SVI ϫ HR. Peripheral vascular resistance index (PVRI; dyne.sec/cm 5 /m 2 ) was calculated as mean arterial pressure (MAP; mmHg) ϫ 80/CI, with MAP calculated as (1/3 ϫ systolic BP ϩ 2/3 ϫ diastolic BP). To convert from Wood units to dyn·s·cm Ϫ5 MAP must be multiplied by 80. A crude estimate of total arterial compliance index (TACI) was calculated as SVI/pulse pressure (PP) (37) . Ejection fraction (EF) was calculated as SVI/ EDVI, and in the absence of Vo is inversely related to EAI/ELVI [EAI/ELVI ϭ (1-EF)/EF]. Peak oxygen consumption (VO2peak) was measured using the Medgraphics CPX-D system (Medgraphics, St Paul, Minnesota, USA). Measurement of VO2peak was introduced in this study in 1986, and data on VO2peak were only available on a subset (49%) of the cohort. Peak arterio-venous oxygen extraction was calculated from the Fick equation (VO2peak/CI).Effective arterial elastance index (EAI) was calculated as ESP/SVI (25) , which was previously shown to closely approximate the arterial load directly measured invasively from aortic input impedance and arterial compliance data (25) . LV end-systolic elastance, a measure of LV chamber performance was calculated as ELVI ϭ ESP/ESV-Vo (51) wherein V0, the volume-axis intercept of the end-systolic pressure volume relationship, was assumed to be zero, as previously reported (15) . Stroke work index was used as an indirect measure of LV systolic performance (4), and was calculated as SWI ϭ SVIxMAP. To adjust for the known effects of chamber size on ELVI and SWI (5), EDVI was added as a covariate in the statistical models, and parameter estimates were used as the EDVI adjusted values for ELVI and SWI. The interaction between the heart and arterial system was depicted by the arterial-ventricular coupling ratio (EAI/ELVI) ϭ ESVI/SVI (9) . Of note, when Vo is assumed to be negligible, EAI/ELVI is related to EF (15) . The changes from rest to peak exercise in EAI (⌬EAI), and in other arterial and cardiac variables, were calculated by subtracting resting from peak values.\nStatistical analysis. All analyses were performed using the statistical packages SPSS version 13 (SPSS Inc, Chicago, Illinois). Grouped data are reported as mean Ϯ SD unless otherwise stated.\n⌬EAI for the entire population exhibited a Gaussian distribution (Fig. 1A) . One analytical approach was to compare the relationship of ⌬EAI in three groups stratified by the lowest, highest, and middle two quartiles to other arterial and cardiac variables. The descriptive characteristics of the three groups, stratified by ⌬EAI, were compared using analysis of variance (ANOVA) or chi-square. The arterial and cardiac parameters measured at rest, at peak exercise, and their change from rest to peak exercise were compared among the 3 groups by ANOVA after adjusting for age, sex and maximal workload, and by a repeated measures ANOVA across relative workloads of 25%, 50%, and 100%of maximum, with an E AI group by workload interaction term.. The analyses were also adjusted for multiple comparisons using Bonferroni's method. We also examined the relationship between ⌬E AI and CV performance by BP group (normotensive vs. hypertensives) and the relationship between a hypertensive SBP response to the exercise stress test and CV performance. A hypertensive response to exercise was defined as an SBPϾ220 mmHg for men and Ͼ190 mmHg for women (26) . A two-tailed P Ͻ 0.05 was required for significance. A second analytical approach was to examine the bivariate relationships among the changes from rest to peak exercise in the arterial and cardiac variables as continuous functions in the entire cohort via Pearson's correlation coefficients, and with linear regression analyses that were adjusted for age, sex and maximal workload. To evaluate the contributions of TACI, PVRI and HR to E AI, multiple regression analysis was performed, and the standardized regression coefficient and the semi-partial correlations were calculated as an index of contribution to E AI."}, {"section_title": "RESULTS", "text": "The descriptive characteristics of the 3 groups in the resting state are shown in Table 1 . The 3 E A I groups did not differ significantly in age, sex, or body size.\n⌬E A I and its determinants during graded exercise. During exercise, the observed changes in E A I ranged from a 44% decline to a 149% increase (Fig. 1A) . In ϳ17% of individuals, E A I was lower at peak exercise than at rest (i.e., ⌬E A I Յ 0 mmHg.m 2 /ml). Conversely, in 19% of individuals, E A I increased by 50% or more from baseline to peak exercise. The interaction term between age and sex was for ⌬E A I was nonsignificant (Fig. 1B) . Furthermore, ⌬E A I was also not associated with body composition. The change in E A I from rest to peak exercise (⌬E A I) was stratified into three groups: E A I group 1, included individuals whose ⌬E A I was in the lowest quartile i.e., ⌬E A I Ͻ 0.22 mmHg.m 2 /ml, (n ϭ 88); E A I group 2 included individuals whose ⌬E A I was in the middle two quartiles i.e., 0.22 Յ ⌬E A I Ͻ 0.98 mmHg.m 2 /ml (n ϭ 176); and E A I group 3 included individuals whose ⌬E A I was in the highest quartile i.e., ⌬E A I Ն 0.98 mmHg.m 2 /ml (n ϭ 88). Fig. 2A shows that the 3 groups differed not only in their ⌬E A I, but dramatically differed in the pattern of change in E A I as the intensity of exercise increased. Group 1, i.e., the group with the lowest ⌬E A I during exercise, had the highest E A I at rest, associated with a higher resting HR, a lower TACI, and a nonsignificant trend for a higher PVRI (Fig. 2) .\nAt rest, the components of E A I, namely TACI (␤ϭ Ϫ0.25; semi-partial correlations ϭ Ϫ0.04) PVRI (␤ ϭ 0.86; semipartial correlations ϭ 0.44) and HR (␤ ϭ 0.54; semi-partial correlations ϭ 0.20) significantly (P Ͻ 0.01) accounted for 98% of the variance in E A I. Similarly, at peak exercise TACI (␤ ϭ Ϫ0.33; semi-partial correlations ϭ Ϫ0.10), PVRI (␤ ϭ 0.93; semi-partial correlations ϭ 0.57), and HR (␤ ϭ 0.52; semi-partial correlations ϭ 0.18) significantly (P Ͻ 0.01) accounted for 90% of the variance in E A I. When considered as a continuous variable across the entire cohort, ⌬E A I was positively associated with ⌬HR (r ϭ 0.12, P Ͻ 0.05), ⌬PVRI(r ϭ 0.41, P Ͻ 0.01), and inversely associated with ⌬TACI(r ϭ Ϫ0.46, P Ͻ 0.01). But the manner and magnitude in which these E A I determinants (PVRI, TACI, and HR) change from rest to max effort differs according to the relative intensity of the exercise workload and among the three E A I groups. HR changes uniformly during exercise in all three groups (Fig.  2B ). Thus group differences in HR acceleration do not account for the group differences in E A I during vigorous exercise. Changes in PVRI and TACI during exercise differed by E A I group (Figures 2C & 2D) (significant E A I group by workload interaction term) whereby E A I group 1 had a blunted reduction in TACI, and a greater reduction in PVRI compared with E A I group 3. Further, despite similar SBP values at rest, E A I group 1 exhibited a smaller increase in SBP during exercise, and E A I group 3 a greater SBP response to exercise such that, SBP at peak exercise was significantly higher in E A I group 3 Ͼ groups 2 Ͼ group 1 (Fig. 2E ).\nIt should be noted that the above comparisons among the 3 groups, and the associations with ⌬E A I persisted even after adjusting for age, sex and maximal workload ( Fig. 2 ; Tables 2  and 3 ). Further, similar results were found when we removed the hypertensive individuals from the analyses (see online supplement). The only significant E A I group by BP group (normotensive vs. hypertensive) interaction was found for ⌬E A I whereby hypertensive individuals in E A I group 1 had a smaller ⌬E A I response, whereas hypertensive individuals in E A I group 3 had a greater ⌬E A I response compared with E A I group 3.\nCardiac volumes at rest and during exercise. Resting EDVI and SVI were lower in group 1 vs. the other two groups whereas resting ESVI did not differ among the 3 groups (Fig. 3) . The ⌬ESVI during exercise did not parallel ⌬E A I, whereas the change in EDVI and SVI across the relative workloads differed by E A I group (Fig. 3) (significant E A I group by workload interaction term). However, despite an initial increase in EDVI and SVI in all three groups E A I group 3 did not utilize the Frank-Starling mechanism above 25% of peak effort and thus no further increase in SVI was noted. Thus the 3 groups exhibited marked differences from rest to peak exercise in ⌬EDVI (20% in group 1, 4% group 2, Ϫ5% group 3) and in ⌬SVI (44%, 27%, 8% respectively). An unexpected finding is that the relationship of EDVI to exercise intensity was an inverse mirror image of the relationship of ⌬E A I with exercise intensity (Fig. 2A) . Indeed ⌬E A I, expressed as a continuous function of EDVI in the entire cohort, was significantly and inversely correlated with ⌬EDVI (r ϭ Ϫ0.58, P Ͻ 0.01). Of note, these relationships were independent of age, sex and maximal workload. In addition, similar results were found when we examined normotensive and hypertensive individuals separately (see online supplement).\nCardiac performance at rest and during exercise. Resting CI did not differ among the 3 groups, but CI significantly higher in group 1 vs. group 3 at peak exercise (Fig. 4A) . Further ⌬CI as a continuous function among all subjects was inversely associated with ⌬E A I (rϭϪ0.37, P Ͻ 0.05).\nAt rest, group 3 had the highest EF; note, however, that at peak exercise group 3 had the lowest EF (Fig. 4B) . ⌬EF was inversely associated with ⌬E A I (r ϭ Ϫ0.20, P Ͻ 0.05) and thus differed between groups. Because EF is influenced by the loading conditions of the ventricle, we also examined SWI and E LV I, measures of LV pump performance; since both SWI and E LV I are affected by chamber size, we therefore adjusted SWI and E LV I for EDVI (a surrogate marker of chamber in size) (5, 40) in the ANCOVA (Fig. 4C and 4D ). At rest, neither EDVI adjusted statistically for SWI nor E LV I differed between E A I groups. . Further SWI did not differ among groups during rest or at peak exercise. In contrast, E A I group 3 demonstrated a blunted increase in E LV I from 50% of peak to peak exercise compared with E A I groups 1 and 2. A significant interaction between E A I group and exercise workload for E LV I was noted which further suggests that E A I group 3 demonstrated a deficit in peak LV performance (i.e., limited Frank-Starling mechanism leading to reduced SVI and CI) (Fig. 4D) . The above relationships persisted when we examined normotensives and hypertensives separately (see online supplementation). In spite of a lower peak exercise CI in group 3 (Fig. 4A) , peak aerobic capacity did not differ between E A I groups because calculated peak arterial-venous oxygen extraction which was highest in E A I group 3 (12.06 Ϯ 3.5 ml/100ml), vs. group 1 (9.58 Ϯ 2.4 ml/100ml), and vs. group 2 (10.02 Ϯ 2.5 ml/100ml), and compensated for the lower peak CI. Further, the differences in arterial-venous oxygen difference between E A I groups were not due to differences in hemoglobin concentrations (E A I group 1 ϭ 14.3 Ϯ 1.3; E A I group 2 ϭ 14.3 Ϯ 1.3; E A I group 3 ϭ 14.5 Ϯ 1.3). These results were also observed when normotensives and hypertensives were analyzed separately (data not shown)."}, {"section_title": "DISCUSSION", "text": "Effective arterial elastance is a measure of the net arterial load that is imposed on the LV and correlates well with aortic input impedance assessed invasively (25) . In the current study, we found that the changes in E A I during exercise in a large cohort of men and women of a broad age range encompassed Fig. 2 . The change in EAI and its components across relative exercise workloads. Comparisons of EAI(A), heart rate (HR: B), peripheral vascular resistance (PVRI: C), total arterial compliance (TACI: D), and systolic blood pressure (SBP: E) among the 3 EAI groups at rest, at 25% and 50% of peak, and at peak exercise (data shown as means Ϯ SEM).*P Ͻ 0.05 EAI group 1 vs. 2, ‡P Ͻ 0.05 EAI group 1 vs. 3, † P Ͻ 0.05 EAI group 2 vs. 3, adjusted for age, sex and maximal workload. a spectrum of values, with 17% of the cohort experiencing a decline in E A I during exercise, and the rest showing varying increases up to 149%. Further the change in E A I during exercise was accompanied by a distinct pattern of change in cardiovascular dynamics.\nThe arterial load has an important effect on LV pump function (20) , whereby a higher resting E A I increases the myocardial energetic costs to provide a given SVI (10, 24) . Those which have examined E A I during exercise in humans have reported that E A I declines (3), remains the same (16), or increases (34, 37) . The mechanisms behind the diverse change in E A I with exercise, reflects the manner and magnitude of the changes in the components of E A I, namely TACI, and PVRI, which vary within an individual and as a function of exercise intensity. Further, the variable changes in E A I during exercise may also reflect subclinical arterial disease, such as insufficient vasodilatory response due to autonomic or endothelial dysfunction. Our study is the first to examine the exercise-induced changes in E A I and the concomitant patterns of exercise induced-changes in ventricular volumes and function. We found a striking inverse relationship between ⌬E A I and the recruitment of EDVI, and the enhancement of SVI and CI with exercise, suggesting that individuals expressing a large increase in E A I during exercise demonstrate a blunted utilization of the Frank-Starling mechanism, irrespective of age, sex, and body size.\nPatterns of arterial alterations. In this study ⌬E A I was not associated with age or sex, which differs from previous studies. Park et al. (38) found that older hypertensive women (59 Ϯ 8 yrs) expressed a greater change in E A I from rest to 75W compared with older (58 Ϯ 9 yrs) hypertensive men. Further, Najjar et al. (34) found that during exercise E A I was similar in young and older normotensive men, but was higher in older vs. younger normotensive women. These differences may be related to our inclusion of normotensive (65%) and hypertensives. Indeed when we separated our cohort into BP groups we find that ⌬E A I is associated with age and sex (data not shown). Further, Park et al. (38) examined the change in E A I in the supine position and only reported data up to 75watts of exercise, which may further explain the differences between studies, as our figures show. E A I was originally derived from a 3-element Windkessel model which characterizes the hemodynamics of the arterial system as TACI, PVRI along with characteristic impedance (51) . TACI provides information about the viscoelastic properties of the arteries. Several methods have been used to estimate TACI derived from the Windkessel model (28), and we direct readers to Westerhof et al. (53) for a detail review. The ratio of SV/PP (which is used in this study) is a simple index of TACI and has a physiological basis in the 2-element Windkessel model (12, 48 -49) . Theoretically, if we assume the periphery is closed, an increase in pressure (PP) resulting from a single stroke volume (SV), TACI relates to compliance as SV/PP. However, because part of the SV outflow leaves the arterial system through the microcirculation while cardiac ejection occurs the SV/PP ratio can overestimates TACI by as much as 60% (43) . Thus, to reproduce the 2-element Windkessel model, only the part of blood ejected within the time of peak pressure should be measured. Despite this overestimation, close relationships have been noted between the SV/PP ratio and more direct measures of Windkessel compliance i.e., the area (r ϭ 0.98 and r ϭ 0.58) (12, 43) , and the PP method (r ϭ 0.97, and 0.80) (23, 43) . Further, Resnick et al. (41) demonstrated that the SV/PP ratio was correlated with both capacitive (reflecting the TACI component associated with the conduit, capacitive function of larger arteries) and oscillatory (depicting the reflective component of TACI) compliance of the arterial tree using a modified Windkessel model (r ϭ 0.92 and 0.68, respectively). However, despite this finding, the SV/PP ratio does not fully take into account the effects of characteristic impedance. It has therefore been suggested that SV/PP is an index of normal/abnormal compliance rather than a calculation or estimation of TACI (12) .\nPrevious studies (11, 37, 42) have demonstrated that the resistive component is the dominant determinant of E A I, at rest and that during exercise the contribution of the pulsatile component (TACI) to E A I gradually increases. These results were confirmed in our study whereby SVRI accounted for most of the variance in E A I at rest (44%; ␤ ϭ 0.86) and peak exercise (57%; ␤ ϭ 0.93). With the contribution of TACI to E A I increasing from rest (4%; ␤ ϭ Ϫ0.25) to peak exercise (10%; Fig. 3 . The change in cardiac volumes across relative exercise workloads Comparisons of ESVI(A), EDVI(B), and SVI(C), among the 3 EAI groups at rest, at 25% and 50% of peak, and at peak exercise (data shown as means Ϯ SEM). *P Ͻ 0.05 vs. EAI group 1 vs. 2, ‡P Ͻ 0.05 EAI group 1 vs. 3, † P Ͻ 0.05 EAI group 2 vs. 3, adjusted for age, sex and maximal workload.\n␤ ϭ Ϫ0.33). However, the contribution of HR to E AI both at rest (20%; ␤ ϭ 0.54) and peak exercise (18%; ␤ ϭ 0.52) was similar. Furthermore, the variance in E A I at rest (r 2 ϭ 0.98) and peak exercise (r 2 ϭ 0.90) were almost entirely accounted for by TACI, PVRI and HR. However, as with ⌬E A I, the manner and magnitude by which the components of ⌬E A I change during exercise differ among individuals and by the intensity of exercise and within a given individual, and therefore cannot be predicted a priori. This was highlighted in E A I group 1 (minimal change in ⌬E A I) in which a blunted reduction in TACI, and the largest reduction in PVRI was noted. The larger reduction in PVRI during exercise in E A I group 1, denotes an augmented peripheral vasodilatation possibly due to an enhanced endothelial reactivity or reduced sympathetic tone. Further, the ability to preserve TACI during exercise in this group, in spite of the exercise-induced increase in BP (and SVI) suggests an attenuated reduction in arterial distensibility. In E A I group 3, the greater reduction in TACI than group 1 could reflect an increased vascular smooth muscle cell tone which would limit the vasodilatory response of central aorta and increase arterial impedance (32) , and thus the greater BP response noted in E A I group 3. However, all groups had a similar HR response to exercise, and therefore HR was unlikely to be the cause of the varied TACI response to exercise. In contrast, at rest HR was lower in E A I group 3 than group 1, and therefore may have contributed to the difference in TACI at rest between groups (27). Further, in E A I group 3, the excessive increase in MAP than group 1, a key determinant of arterial stiffness, may have contributed to the increased arterial load because at higher MAP the less compliant collagen fibers predominate in the maintenance of vessel-wall stresses (2). In contrast, at lower MAP (noted in E A I group 1) the compliant elastin fibers are predominately recruited which may contribute to lower arterial stiffness and reduced arterial load.\nSome of the components of ⌬E A I were themselves related to each other, whereby a greater preservation of TACI during exercise is associated with a greater reduction in PVRI (and a smaller increase in MAP and PP). This suggests that the tandem changes in resistance and compliance appear to be linked, and raises the possibility of a cross-talk between central and peripheral arteries. However, TACI is influenced, in part, by the compliance of the resistive vessels, and the resistive vessels have compliance properties. Further, central arterial compliance is also influenced by the timing and magnitude of the reflective waves, which are not fully accounted for by TACI (originally from the Windkessel model). Further, given that both parameters are derived noninvasively from pressure and flow, more direct and independent measurements of resistance and compliance are required to further explore this interesting theoretical interaction.\nPatterns of ventricular alterations. Another striking and novel finding of the present study is that the changes in E A I during exercise were also coupled to correlated patterns of change in LV preload during exercise. Further, changes in LV preload were also associated with changes in PVRI and TACI suggesting that the cross-talk between the large and small arteries may extend to involve the heart. Indeed, Guyton postulated that cardiovascular performance is simply regulated by the rate of blood flow into the heart from the systemic circulation (22) . In our study individuals with a larger ⌬E A I (i.e., those with a higher ⌬TACI, and a smaller ⌬PVRI) have a negative ⌬EDVI and a smaller positive ⌬SVI. This suggests that these individuals have a blunted reliance on the FrankStarling mechanism to augment SVI during exercise. Further, the pattern of change in ⌬EDVI mimicked the pattern of change in the TACI to PVRI relationship. Similarly, individuals with the largest EDVI at rest, and also at peak exercise, expressed the highest TACI/PVRI ratio. Individuals in E A I group 3 were able to initially augment EDVI from rest to 25% of MWL, which may be attributed to the mobilization of blood in the extremities to the central circulation thereby increasing venous return.. However, at 50% of MWL the EDVI began to decline, corresponding to the higher absolute E A I values, which may be attributed to an elevated PVRI, inadequate venous return (from the higher hydraulic load and higher peripheral resistance), increased LV diastolic stiffness (thereby impairing LV filling) (1), abnormal venous tone (thereby impairing endothelial function), or a combination of these factors. In line with our results, Borlaug at al. (7) found that blunted ⌬PVRI was associated with attenuated increase of EDVI with exercise in heart failure patients with a preserved EF (HFpEF). Previous work (21, 50) had reported that the utilization of the Frank-Starling mechanism during exercise to simply ensure that SVI during exercise did not decline with age. In contrast, in our study, individuals with a smaller ⌬E A I who exhibited greater utilization of the Frank-Starling mechanism (E A I group 1) during exercise, also achieved a higher SVI (and a higher CI) independent of age, sex or MWL. Thus, our findings provide novel insights in that they establish, for the first time, a link between ⌬E A I and the utilization of the Frank-Starling mechanism to increase SVI. The deficit in cardiac performance (blunted preload and CI response) in E A I group 3 did not translate into a deficit in peak aerobic capacity. Since VO 2peak is determined by the product of CI and arterial-venous oxygen extraction, the similar VO 2peak because arterial-venous oxygen extraction was increased in E A I group 3 vs. 1, which was not due to differences in hemoglobin concentrations between groups. Thus, the arterial and cardiac alterations during exercise also appear to be linked to adaptations in peripheral oxygen extraction. The signaling pathways that underlie this adaptive response require further study.\nInterestingly, Borlaug et al. (8) recently identified evidence of global impairment in cardiovascular reserve function in HFpEF patients including a blunted contractile, endothelial, and vascular (E A I and PVRI) reserve. Further, it has been suggested that the depressed reserve responses correlated with a reduced exercise capacity in HFpEF patients (8) . Unlike our study where the blunted increase in E A I was accompanied by a greater reduction in PVRI, the HFpEF patients exhibited a blunted response in both E A I and PVRI, which may suggest that they are no longer able to compensate for the limited E A I response by reducing PVRI to maintain adequate LV filling. Indeed ⌬EDVI was smaller in HFpEF patients compared with healthy controls (8) .\nFinally, the patterns that were observed during exercise are also linked to distinct (albeit more modest) arterial and ventricular patterns in the resting state. At rest, individuals E A I group 1 exhibited higher E A I, and a lower TACI, EDVI and SVI. However, these are the same individuals who, at peak exercise, have a lower E A I, and a higher TACI, EDVI and SVI. This would suggest a more compliant system during exercise but not at rest in E A I group 1 and vice versa in E A I group 3. Acute shifts in compliance from rest to exercise are related to the arterial structure and vasoreactivity (e.g., sympathetic activity, prostacyclins or nitric oxide bioavailability), and mechanical forces (e.g., sheer circumferential stress, and HR), and how these change during exercise and interact with arterial structure determines the compliance of the artery during exercise. Unfortunately we are unable to determine the underlying mechanisms that alter the compliance of the artery from rest to peak exercise and contribute to the differences noted between groups.\nThe effects of hypertension and a hypertensive response to exercise. We examined the effects of hypertension on the relationship between ⌬E A I and the CV performance by categorizing individuals into normotensives and hypertensives groups (14) , and by categorizing individuals based on their BP response during the exercise stress (26) . Individuals who normotensive and hypertensive at rest had similar arterial and cardiac responses to exercise. The only significant E A I group by BP group interaction was found for ⌬E A I whereby hypertensive individuals in E A I group 1 had a smaller ⌬E A I response, whereas hypertensive individuals in E A I group 3 had a greater ⌬E A I response. These data illustrate that the findings of the study are not due the inclusion of individuals with hypertension.\nSeveral studies (19, 31, 44) have shown that a BP response to exercise can predict the development of hypertension and target organ damage. Individuals with a hypertensive response to exercise had a greater ⌬E A I. With the exception of the change in E LV I during exercise, no other hemodynamic differences were noted during exercise between BP response groups. However, differences were noted at rest and peak exercise; individuals with a hypertensive response to exercise had a higher E A I, SVRI, and BP, and a lower TACI both at rest and at peak exercise compared with those with a normotensive BP response. This illustrates that examining the change in SBP alone during exercise does not fully reveal alterations in CV hemodynamic during exercise that are clearly evident when the ⌬E A I response is examined. Future research is required to determine whether the change in E A I during exercise could predict future CV events.\nStudy limitations. Some limitations of the study are worth noting. Because of the noninvasive nature of this study, some of the arterial and LV parameters were calculated using brachial rather than central pressures. Because of BP amplification across the arterial tree, brachial BP is known to overestimate central pressures (35) ; the magnitude of this overestimation is inversely related to age, and is markedly augmented during exercise (45) . Although the estimation of ESP as 0.9 ϫ brachial SBP has been shown to closely estimate central ESP (25) , this was only assessed in the resting state. Because Vo (volume-axis intercept of the end-systolic pressure volume relationship) was not measured and assumed to be zero, E LV I should not be considered an absolute measure of LV contractility but only an approximation of that. Further, arterial compliance was not directly assessed; instead the ratio of SVI/PP was used as a crude estimate of total system arterial compliance (17) . This index, which has been shown to be a predictor of cardiovascular events (17) has well known limitations (17, 29) . However, the ratio of SVI/PP is a practical and feasible measure to acquire during exercise, particularly since this study was largely conducted prior to the availability of modern devices that facilitate the assessment of arterial stiffness during exercise (45) . Finally, because the calculation of PVRI and TACI were measured indirectly through changes in pressure and volumes, caution should be applied to the interpretation of any cross talk between large and small arteries. More direct and independent assessment is required to identify whether there is any cross talk between small and large arteries involved in the change in E A I during exercise."}, {"section_title": "Conclusions", "text": "This is the first study to demonstrate the effects of graded exercise on the changes in E A I and the corresponding changes in cardiovascular dynamics and to show the heterogeneity in E A I among individuals across a range of exercise intensities. The changes in E A I from rest to peak exercise reflect a complex interaction among changes in arterial and cardiac function that appear to be linked to adaptive features in the peripheral cardiovascular system. Because some of the components of ⌬E A I, at least at rest, have been shown to be predictors of outcomes, in future studies it would be worthwhile to examine whether the specific patterns of change in arterial load and the coupled patterns of change in LV response confer any clinical or prognostic information."}]