[{"section_title": "Abstract", "text": "Chronic neuroinflammation is thought to potentiate medial temporal lobe (MTL) atrophy and memory decline in Alzheimer's disease (AD). It has become increasingly important to find novel immunological biomarkers of neuroinflammation or other processes that can track AD development and progression. Our study explored which pro-or anti-inflammatory cerebrospinal fluid (CSF) biomarkers best predicted AD neuropathology over 24 months. Using Alzheimer's Disease Neuroimaging Initiative data (N = 285), CSF inflammatory biomarkers from mass spectrometry and multiplex panels were screened using stepwise regression, followed up with 50%/50% model retests for validation. Neuronal Pentraxin 2 (NPTX2) and Chitinase-3-like-protein-1 (C3LP1), biomarkers of glutamatergic synaptic plasticity and microglial activation respectively, were the only consistently significant biomarkers selected. Once these biomarkers were selected, linear mixed models were used to analyze their baseline and longitudinal associations with bilateral MTL volume, memory decline, global cognition, and established AD biomarkers including CSF amyloid and tau. Higher baseline NPTX2 levels corresponded to less MTL atrophy [R 2 = 0.287, p < 0.001] and substantially less memory decline [R 2 = 0.560, p < 0.001] by month 24. Conversely, higher C3LP1 modestly predicted more MTL atrophy [R 2 = 0.083, p < 0.001], yet did not significantly track memory decline over time. In conclusion, NPTX2 is a novel pro-inflammatory cytokine that predicts AD-related outcomes better than any immunological biomarker to date, substantially accounting for brain atrophy and especially memory decline. C3LP1 as the microglial biomarker, by contrast, performed modestly and did not predict longitudinal memory decline. This research may advance the current understanding of AD etiopathogenesis, while expanding early diagnostic techniques through the use of novel pro-inflammatory biomarkers, such as NPTX2. Future studies should also see if NPTX2 causally affects MTL morphometry and memory performance."}, {"section_title": "a b s t r a c t", "text": "Chronic neuroinflammation is thought to potentiate medial temporal lobe (MTL) atrophy and memory decline in Alzheimer's disease (AD). It has become increasingly important to find novel immunological biomarkers of neuroinflammation or other processes that can track AD development and progression. Our study explored which pro-or anti-inflammatory cerebrospinal fluid (CSF) biomarkers best predicted AD neuropathology over 24 months. Using Alzheimer's Disease Neuroimaging Initiative data (N = 285), CSF inflammatory biomarkers from mass spectrometry and multiplex panels were screened using stepwise regression, followed up with 50%/50% model retests for validation. Neuronal Pentraxin 2 (NPTX2) and Chitinase-3-like-protein-1 (C3LP1), biomarkers of glutamatergic synaptic plasticity and microglial activation respectively, were the only consistently significant biomarkers selected. Once these biomarkers were selected, linear mixed models were used to analyze their baseline and longitudinal associations with bilateral MTL volume, memory decline, global cognition, and established AD biomarkers including CSF amyloid and tau. Higher baseline NPTX2 levels corresponded to less MTL atrophy [R 2 = 0.287, p < 0.001] and substantially less memory decline [R 2 = 0.560, p < 0.001] by month 24. Conversely, higher C3LP1 modestly predicted more MTL atrophy [R 2 = 0.083, p < 0.001], yet did not significantly track memory decline over time. In conclusion, NPTX2 is a novel pro-inflammatory cytokine that predicts AD-related outcomes better than any immunological biomarker to date, substantially accounting for brain atrophy and especially memory decline. C3LP1 as the microglial biomarker, by contrast, performed modestly and did not predict longitudinal memory decline. This research may advance the current understanding of AD etiopathogenesis, while expanding early diagnostic techniques through the use of novel pro-inflammatory biomarkers, such as NPTX2. Future studies should also see if NPTX2 causally affects MTL morphometry and memory performance. Ó 2016 Elsevier Inc. All rights reserved."}, {"section_title": "Introduction", "text": "Alzheimer's disease (AD) is typified by progressive medial temporal lobe (MTL) atrophy and memory decline (Weintraub et al., 2012) . It has become increasingly important to find novel, immunological biomarkers that can track AD development and progression. When exploring biomarkers, neuroinflammation may be a useful process to examine, as it is an early and continuous feature of AD (Hensley, 2010) that underlies neurodegeneration and cognitive deficits (Dursun et al., 2015) .\nIt is now known that neurotoxic inflammatory mechanisms may initiate AD pathogenesis (Akiyama et al., 2000) . Neuroinflammation, on the cellular subunit level, occurs through the release of pro-inflammatory cytokines such as tumor necrosis factor-a (TNF-a), Interleukin-1b (IL-1b), and Interleukin-6 (IL-6), primarily from microglia as well as astrocytes, brain endothelial cells (BECs), and neurons themselves (Akiyama et al., 2000; Guillot-Sestier and Town, 2013; Lee et al., 2008; Tai et al., 2015) , all of which are potential immunological AD biomarkers. Levels of these cytokines and downstream effectors are higher in the AD brain (Griffin et al., 1989) and may mediate neural atrophy over time (Lee et al., 2008) .\nHowever, while the classic pro-inflammatory cytokines do potentiate brain atrophy, they are not necessarily ideal AD Disease Neuroimaging Initiative (ADNI) database (adni.loni.usc.edu). As such, the investigators within the ADNI contributed to the design and implementation of ADNI and/or provided data but did not participate in analysis or writing of this report. A complete listing of ADNI investigators can be found at: http://adni.loni.usc.edu/wpcontent/uploads/how_to_apply/ADNI_Acknowledgement_List.pdf. Brain, Behavior, and Immunity 58 (2016) 201-208 Contents lists available at ScienceDirect Brain, Behavior, and Immunity j o u r n a l h o m e p a g e : w w w . e l s e v i e r . c o m / l o c a t e / y b r b i"}]