[{"section_title": "Abstract", "text": "Abstract. Alzheimer disease (AD) is characterized pathologically by cholinergic deficits, amyloid plaques, neurofibrillary tangles, gliosis, and neuronal and synaptic loss. The primary therapeutic approach that has arisen from the pathological analysis of AD brain has been cholinergic augmentation by cholinesterase inhibitors, which modestly improve cognitive function. Research on the underlying pathophysiological dysfunction have focussed on AD-specific processes such as amyloid precursor protein, tau, and cerebral apolipoprotein E metabolism, and more general neurodegenerative processes such as inflammation, oxidation, excitotoxicity, and apoptosis. Rational neuroprotective approaches have led to recent trials of estrogen, antioxidant and anti-inflammatory medications in AD, and to the development of anti-amyloid strategies for delaying progression or preventing development of AD."}, {"section_title": "INTRODUCTION", "text": "The public health and personal impact of Alzheimer disease (AD) is enormous, and is projected to increase as the proportion of elderly in the population grows over the next 3 decades. In the United States, over 4 million people are affected, with the prevalence rate as high as 10% over the age of 65. The total direct and indirect costs of care for AD patients has been estimated at $20,000 to $61,000 per year for a disease with an average duration of 7-8 yr (1) . Epidemiological and basic research in AD over the past 15 yr have led to an understanding of several fundamental mechanisms of pathogenesis amenable to therapeutic intervention.\nMultiple pathophysiological processes are implicated in AD. Specific epidemiologic risk factors (e.g. age, education, head injury, atherosclerosis) likely interact with genetic risks (presenilin-1 and 2, amyloid precursor protein [APP] , apolipoprotein E, family history of AD) and biochemical processes (APP metabolism, tau phosphorylation, inflammation, oxidative stress, growth factor deficit, hormonal effects, apoptosis). These produce the classic neuropathological features of AD (amyloid plaques, neurofibrillary tangles, neuronal and synaptic loss, microgliosis and astrocytosis), underlying the clinical syndrome of dementia, neurotransmitter deficits and intracortical disconnection. Therapeutic strategies in AD have derived from 2 sources. Evaluation of the neuropathology and biochemical abnormalities in the brain has been by far the richest source of ideas about therapeutics. In addition, epidemiological studies, and, more recently, genetic studies of AD risk factors have suggested additional\nFrom the Alzheimer Disease Research Unit, Center for Aging Genetics and Neurodegeneration, Massachusetts General Hospital, Boston, Massachusetts.\nCorrespondence to: Michael C. Irizarry, MD, Alzheimer Disease Research Unit, Center for Aging Genetics and Neurodegeneration, Massachusetts General Hospital-East, 114 16 th Street, Charlestown, MA 02129.\nSupported by NIH AG00793.\npharmacologic approaches. Moreover, to date, the vast majority of medication trials have been aimed at symptomatic treatment. Only recently have studies been designed aiming to prevent or delay the onset of AD."}, {"section_title": "CHOLINERGIC THERAPY", "text": "The central cholinergic neurotransmitter system is involved in learning and memory, and is dysfunctional in AD. Limbic structures and neocortex receive widespread topographically organized overlapping cholinergic innervation from neurons of the septal nuclei and substantia innominata (including medial septal nucleus, diagonal band, and nucleus basalis) (2, 3) . Basal forebrain lesions in animals impair learning and memory, which can be improved by cholinergic agonists. Cholinergic antagonists (scopolamine) impair learning and memory in humans (4). In AD, cholinergic innervation of the limbic and cortical structures is impaired, with 58%-93% reduction in choline acetyltransferase levels (and other cholinergic markers) in cortex and hippocampus, correlating with dementia severity (5-7). Neuronal loss and tangles in the cholinergic nucleus basalis of Meynert are prominent early in AD (8) .\nInitial AD therapies were directed toward ameliorating this cholinergic deficit. A comprehensive review of clinical trials of lecithin (25-100 g/d) and choline (Յ16 g/d) as acetylcholine precursors did not find significant benefit (9) . Clinical trials of central cholinergic augmentation with cholinesterase inhibitors, however, have consistently detected symptomatic improvement of cognitive impairment in AD. Four cholinesterase inhibitors have been approved by the FDA: tacrine (Cognex; Parke-Davis, Vega Baja, PR), donepezil (Aricept; Eisai, Teaneck, NJ/Pfizer, New York, NY), rivastigmine (Exelon; Novartis, East Hanover, NJ) and galantamine (Reminyl; Janssen, Titusville, NJ/Ortho-McNeil, Raritan, NJ). The clinical trial of tacrine (10-40 mg po qid) was the first to demonstrate a small benefit in cognition, using an unusual enriched trial design complicated by a high dropout rate (10) . Clinical use of tacrine has been limited by the high rate of side effects and the need of serial blood monitoring for hepatotoxicity. More recently, clinical trials of donepezil (5-10 mg po qd) (11, 12) , rivastigmine (1.5-6 mg po bid) (13) , and galantamine (4-12 mg po bid) (14, 15) demonstrated benefits on cognitive and global measures. The magnitude of improvement in these studies was modest, on the order of 2.8-4.0 point improvement on the 70 point Cognitive Subscale of the Alzheimer's Disease Assessment Scale (ADAS-Cog), or 1-1.5 point improvement on the 30 point Mini-Mental Status Examination (MMSE) relative to placebo over 6 months of treatment. Cholinergic therapies may benefit behavioral symptoms and delay progression of illness, although in most studies the slope of cognitive decline is similar in treated and untreated patients after the initial improvement, and the benefit is rapidly lost after discontinuation, suggesting that the primary benefit is symptomatic rather than neuroprotective. These medications are generally well tolerated by patients. They lack hepatotoxicity, and the most common side effects are nausea, vomiting, and diarrhea, which may be reduced by a slow dose titration. Because of the cholinergic actions of these drugs, they should be prescribed with caution in patients with bradycardic arrhythmias (e.g. sick sinus syndrome), asthma, or COPD.\nTherapeutic approaches based on neurotrophic nerve growth factor (NGF) attempt to preserve cholinergic neurons of the basal forebrain. These neurons strongly express TrkA receptors for NGF, and NGF protects forebrain cholinergic neurons from degenerating in fimbria-fornix lesions in animals (16) . Intraventricular installation of NGF, however, was associated with significant side effects in humans (17) . Smaller NGF agonists that can enter the CSF and alternative delivery methods are being investigated (18) ."}, {"section_title": "NEUROPROTECTIVE AGENTS", "text": "Increased markers of oxidation, reduced activities of anti-oxidant enzymes, and evidence for deficits of energy metabolism in AD brain imply that mitochondrial and oxidative damage contributes to the neurodegeneration in AD (19) . Several putative neuroprotective agents assessed in AD include vitamin E, selegiline (Eldepryl; Somerset, Tampa, FL), and Ginkgo Biloba. Vitamin E is a fat-soluble free-radical scavenger utilized to inhibit biochemical oxidative stress and lipid peroxidation. It is clinically well tolerated in doses as high as 1,000 IU po bid, although it can interfere with warfarin (Coumadin; Dupont, Wilmington, DE) dosing. Selegiline is a selective monoamine oxidase type B (MAO-B) inhibitor with antioxidant properties, which despite the low 5-mg po bid dose has the potential for multiple drug interactions. Both selegiline and vitamin E delayed AD progression by 7-8 months in a study of moderate to severe AD; however, the clinical benefit appeared weak, because statistical significance was only achieved after adjusting for slight differences in the baseline MMSE scores and the treatment benefits were not additive (70) . Including the MMSE as a covariant, compared to placebo, time to primary endpoint (functional dependence, nursing home placement, death) was delayed by either vitamin E (by 230 days), selegiline (215 days), or the combination (145 days). A 52-week clinical study of Ginkgo Biloba in AD reported an improvement of 1.4 points in ADAS-Cog relative to placebo, but was limited by a surprisingly high dropout rate (20 "}, {"section_title": "ESTROGEN", "text": "Estrogen in ovariectomized rats preserves CA1 dendritic spine density, enhances glucose utilization, increases choline acetyltransferase activity, and improves sensorimotor behavior. Observational studies and clinical trials of estrogen cognitive effects in nondemented postmenopausal women have been inconclusive. Estrogen therapy may improve cognitive performance in symptomatic recently menopausal women, but there is no evidence of effect in asymptomatic women (22, 23) .\nWhile a meta-analyses of case-control studies suggested a weak protective effect of estrogen on risk for AD (summary odds ratio [OR] for risk of AD in women on estrogen replacement therapy ϭ 0.80, 95% confidence interval [CI] 0.5-1.28), several population-based case control and prospective cohort studies have provided stronger support for a preventative role of estrogen (23) . The relative risk (RR) of developing AD was 0.28-0.50 in the Italian Longitudinal Study of Aging, a Rochester, Minn. medical registry, a Manhattan, N.Y. cohort, and the Baltimore Longitudinal Study of Aging (24) (25) (26) (27) . Three large primary prevention trials are evaluating estrogen in preventing or delaying AD (28) .\nIn established AD, 3 double-blind randomized controlled studies of Premarin (Wyeth-Ayerst, St. Davids, PA) 0.625-1.25 mg/d for 3-12 months showed no significant change in primary outcome measures, and were associated with cases of vaginal bleeding and deep venous thromboses (29) (30) (31) . "}, {"section_title": "ANTI-INFLAMMATORY AGENTS", "text": "Amyloid deposits in AD brains are associated with activated microglia and astrocytes, complement activation, and cytokine release, implicating an inflammatory component to neurodegeneration in AD. The anti-inflammatory medication ibuprofen reduced A␤ deposition in an APP transgenic mouse model of AD (32) . Epidemiological data support a protective role for anti-inflammatory medications in AD. The odds ratio of developing AD with prednisone or nonsteroidal anti-inflammatory drug (NSAID) use was 0.50-0.66 in a meta-analysis of case control studies (33) . NSAID use was associated with a 50% reduction in the relative risk of developing AD in the Baltimore Longitudinal Study of Aging (34) . A twinsib study demonstrated an 11-yr delay in onset of AD at 20% cumulative incidence in NSAID users (35) . As therapy for AD, small clinical trials of indomethacin and diclofenac were confounded by a 44%-50% dropout rate (36, 37) . Nonetheless, larger clinical trials of prednisone (38) and celecoxib (Celebrex; Searle, Chicago, IL) (39) were unable to demonstrate a benefit in established AD."}, {"section_title": "APOLIPOPROTEIN E", "text": "Apolipoprotein E (apoE) allelic polymorphisms are associated with AD risk and pathophysiology. The apolipoprotein E ⑀4 allele is over-represented in patients with AD, while the apoE ⑀2 allele is underrepresented. Clinically, the apoE ⑀4 allele is associated with an earlier age of onset of AD; pathologically, the apoE ⑀4 allele is associated with greater amyloid deposition (both A␤40 and A␤42) (40) . Despite these clinical and pathological data, the function of apoE in the brain is still unclear. ApoE in the central and peripheral nervous system has been implicated in development, cholesterol redistribution during injury and repair, nerve growth, protection against oxidative stress, and immune modulation (41) . More ADspecific roles include modulation of A␤ aggregation and uptake, and tau stabilization. Genomic and proteomic approaches are being applied to determine the differential neurobiological effects of apoE isoforms and allelic polymorphisms, and to identify targets for pharmacologic intervention (42) .\nElimination of apoE in APP transgenic mice reduces cerebral A␤ deposition (43) . Apolipoprotein E levels can be modified pharmacologically by lipid lowering drugs of the statin class (3-hydroxy-3-methylglutaryl-coenzyme A reductase inhibitors). In human and rodent studies, statins reduce plasma apoE levels by 29%-43% (44) (45) (46) . Statin medications decrease Aß formation in cell culture and animal studies (47) . Recent epidemiological data suggest that statin use may reduce the risk of developing dementia or AD. A nested case-control study from the General Practice Research Database in the United Kingdom comparing 284 patients who developed dementia with 1,080 nondemented controls found the relative risk of dementia in statin users was 0.29 (95% CI 0.13-0.63) (48) . A review of databases from 3 hospitals calculated that the prevalence of AD in patients taking statins was 60%-73% lower relative to all patients over the age of 60 (49) . Besides reducing apoE, another biologically plausible mechanism by which stains could affect AD pathology is by reducing cholesterol-modulated A␤ formation in neurons (50) , particularly given that high cholesterol diets can increase amyloid deposition in APP transgenic mice (51) . Another cardiovascular risk factor-hypertension-appears to predispose to cognitive decline in epidemiological studies, so that appropriate treatment of high blood pressure may lower the risk of developing AD (52) ."}, {"section_title": "MODULATORS OF APP, Aß", "text": "A primary target for AD-modifying therapies is the amyloid plaque, composed primarily of amyloid ␤ protein (A␤). A␤ is produced via metabolic processing of the amyloid precursor protein (APP). APP is a transmembrane glycoprotein containing the A␤ sequence within its intramembranous and extracellular domain. Metabolic processing of APP occurs by 2 major pathways, one producing Aß (␤-secretase pathway) and the other producing a presumably nontoxic p3 fragment (␣-secretase pathway), each pathway requiring 2 APP cleavage events. The ␣-secretase pathway involves a primary cleavage within the A␤ domain occurring in a late Golgi compartment or in plasma membrane caveolae, resulting in a soluble N-terminal sAPP␣, and the 10 kD C-terminal fragment that undergoes a subsequent cleavage by ␥-secretase yielding the 3 kD p3 fragment. Presenilin-1 is essential for ␥-secretase function and may indeed be ␥-secretase (53) . The presenilins are highly homologous proteins within the endoplasmic reticulum and Golgi containing 8 predicted transmembrane domains. Presenilins have been implicated in determination of cell fate in development (facilitator of Notch signaling) and cell-cell adhesion (through ␦-catenin). Presenilin undergoes endoproteolysis within its large cytoplasmic loop to yield stable N-and C-terminal fragments and is susceptible to caspase cleavage events (54, 55) .\nAn alternative processing pathway results in production of A␤ (␤-secretase pathway). A ␤-secretase cleavage by the recently characterized 501 amino-acid aspartyl protease BACE generates a truncated sAPP␤ (56) . The remaining membrane associated 11.5-kD fragment is cleaved by ␥-secretase to yield A␤. These cleavage events occur in endosomal or secretory compartments. A␤ peptide is heterogeneous at the C-termini, with most full length A␤ peptides containing 40 (90%) or 42 (10%) amino acids, produced in separate cellular compartments in neurons (A␤40 in trans-Golgi membrane and recycling endosomes; A␤42 in endoplasmic reticulum and nuclear envelope). The A␤42 isoforms are deposited initially in AD and Down syndrome and are more fibrillogenic and toxic in vitro (54, 55) .\nAPP metabolism can be modulated both genetically and pharmacologically. Familial AD mutations in APP and presenilin increase total A␤ or toxic A␤42 in humans, transgenic mice, and cell culture. Stimulation of particular receptor subtypes promotes the ␣-secretase metabolism of APP (sAPP␣ formation) while reducing ␤-secretase processing (A␤ formation). These receptors tend to be G protein-coupled linked to phosphatidylinositol hydrolysis (muscarinic M1, M3; serotonergic 5-HT2a, 5-HT2c; metabotropic glutamate, mGluR). Estrogen has similar effects in several cell lines (54, 55) . Caspase-3 also cleaves APP in its cytoplasmic domain (Asp720), releasing a novel large fragment ⌬C-APP (116.5 kD), that is further processed, increasing A␤ production (57) . This may underlie the formation of A␤ during apoptosis, excitotoxic injury, ischemia, and head injury.\nMuscarinic agonists and estrogen favor the ␣-secretase pathway of metabolism of APP in vitro, but appear minimally effective in clinical AD. The muscarinic agonist AF102B (Snowbrand, Rockville, MD) reduced A␤ in the CSF (58) . Muscarinic agonists such as Lu25-109 (Forest, St. Louis, MO), xanomeline (Lilly, Indianapolis, IN), and SB202026 (SmithKline Beecham, Pittsburgh, PA) have not shown significant global improvement in AD, and have been associated with significant systemic cholinergic side effects (21) . More targeted approaches to altering APP metabolism involve medications that affect BACE or ␥-secretase (59) . Preliminary data demonstrate that ␥-secretase inhibitors or BACE inhibitors can reduce A␤ formation in vitro and in APP transgenic mice; ␥-secretase inhibitors are currently in AD clinical trials.\nAn A␤ clearance mechanism that has generated considerable enthusiasm over the past 2 yr is antibody-mediated A␤ uptake. APP transgenic mice actively and passively immunized against A␤ demonstrate markedly reduced A␤ deposition (60, 61) . Recent studies using in vivo 2-photon imaging of living mouse brain via burrhole demonstrate that A␤ deposits can be cleared by topically applied A␤ antibody within 3 days (69) . In addition to demonstrating that Fc receptors can clear antibody-bound A␤, these studies illustrate the reversibility of a primary pathological feature of AD in APP transgenic mice. Other receptor mediated A␤ clearance mechanisms identified in vitro may serve as therapeutic targets (low-density lipoprotein related protein [LRP] , receptor for advanced glycation end-products [RAGE], macrophage scavenger receptor [MSR] ). Compounds that can intercalate into amyloid deposits to prevent A␤ fibrillization and induce A␤ depolymerization and subsequent clearance have also been conceived (18) ."}, {"section_title": "MODULATORS OF TAU METABOLISM", "text": "The second classical neuropathologic feature of AD is the neurofibrillary tangle. Neurofibrillary tangles (NFT) are intraneuronal accumulations of paired helical filaments composed of abnormally phosphorylated tau protein. NFTs develop in sequence from transentorhinal to limbic, then neocortical regions, and correlate with the severity of dementia and extent of neuronal loss (62) .\nTau, the principle component of neurofibrillary tangles, is a microtubule-associated protein of 352-441 amino acids (alternatively spliced) that stabilizes axonal microtubules involved in neurite outgrowth, cell polarity, and intracellular transport. In addition to alternatively spliced domains and microtubule binding repeats, tau contains many sites susceptible to serine-or threonine-directed phosphorylation that can alter microtubule-binding properties. Neurofibrillary tangles are composed of hyperphosphorylated tau, which dissociates from microtubules, forms filaments (paired helical filaments, 20-nm diameter, 80-nm periodicity), and precipitates as NFTs in the soma, and as dystrophic neurites or neuropil threads in axons and dendrites (63) .\nTheoretical approaches to preventing neurofibrillary pathology include microtubule stabilization, phosphorylation inhibitors, phosphatases, or tau anti-aggregants. Imbalance between kinases and phosphatases has been hypothesized to result in the neurofibrillary pathology of AD. Multiple kinases capable of phosphorylating tau in vitro-such as cyclin-dependent kinase 5 (cdk5), mitogen-activated protein kinase (MAPK), glycogen synthase kinase 3␤ (GSK-3␤), and calcium/calmodulin-dependent protein kinase (CAMK)-may serve as therapeutic targets to prevent destabilization of tau. Inhibitors of tau phosphorylation in vitro include cathepsin inhibitors, lithium, protein phosphatase 2A (PP2A), and PD98059 (a MAPK kinase [MAPKK] inhibitor; NEB, Beverly, MA) (64) ."}, {"section_title": "BEHAVIORAL DISTURBANCES", "text": "Much of the currently available therapy in AD is directed toward the empiric treatment of distressing behavioral disturbances, such as psychosis, agitation, wandering, apathy, disinhibition, depression, anxiety, and sleep disorders (65) . The anatomical and pathological loci of these symptoms in AD are unclear, but may be related to deficits in neurotransmitter systems (e.g. serotonin and depression [66] ) or AD pathology involving frontal and limbic circuits (e.g. orbitofrontal NFTs and agitation [67] ). In addition to behavioral approaches and cholinesterase inhibitors, medications for behavioral symptoms include selective serotonin reuptake inhibitors for depression; neuroleptics, anxiolytics, anticonvulsants, and antidepressants for anxiety and agitation; and modafinil (Provigil; Cephalon, West Chester, PA) and methylphenidate (Ritalin; Novartis, East Hanover, NJ) for hypersomnolence (68 of neuroleptics to treat agitation in AD (21) ; the risk of extrapyramidal side effects appears lower with atypical neuroleptics such as clozapine (Clozaril; Novartis, East Hanover, NJ), risperidone (Risperdal; Janssen, Titusville, NJ), olanzepine (Zyprexa; Lilly, Indianapolis, IN), and quetiapine (Seroquel; AstraZeneca, Wilmington, DE). Patients with dementia with Lewy bodies, however, are particularly sensitive to the extrapyramidal side effects of neuroleptics."}, {"section_title": "CONCLUSIONS", "text": "Current therapeutic approaches to AD include established cholinesterase inhibitors and putative neuroprotective agents of unproven efficacy such as estrogen, Ginkgo Biloba, anti-inflammatory medications, MAO inhibitors, and statins. Clinical trials are beginning to evaluate medications targeting primary pathophysiological processes in AD such as amyloid formation, deposition, and clearance. Supplementary approaches affecting NFT formation are under development. It is likely that the ultimate approach will be a rational combination of secretase inhibitors to prevent A␤ formation, Aß immunization to clear Aß, inhibitors of tau phosphorylation, and neuroprotective/anti-inflammatory medications to prevent the secondary effects of amyloid deposition."}]