[{"section_title": "Introduction", "text": "The North Atlantic Tropical Cyclones (TC) main development region (MDR) spans over 6 N-18 N, 20 W-60 W [Mann and Emanuel, 2006] (see Figure 1). Sea Surface temperatures and upper ocean physical properties in that region during the hurricane season (June-November) have been recognized to have a strong influence on North Atlantic TCs development, maintenance, and intensification [Wang and Enfield, 2001;Emanuel, 2005;Mann and Emanuel, 2006;Ffield, 2007;Vecchi and Soden, 2007;Swanson, 2008;Vizy and Cook, 2010;Balaguru et al., 2012;Grodsky et al., 2012]. As illustrated in Figure 1, one salient ocean feature at the surface of the MDR is the presence of the buoyant plume of freshwater from the discharges of the Amazon and Orinoco rivers [Muller-Karger et al., 1988, 1995Ffield, 2005;Cherubin and Richardson, 2007;Salisbury et al., 2011], spreading during the spring to endsummer period along both east and west coasts of the lesser Antilles [Hellweger and Gordon, 2002]. The plume maximum seasonal extension in the North Western Tropical Atlantic (NWTA) coincides with the Atlantic hurricane season (June to November). The warm and fresh surface waters then create a thick and persistent ocean barrier layer (BL) in the western part of the MDR [Pailler et al., 1999;Mignot et al., 2007;Liu et al., 2009;Foltz and McPhaden, 2009;Romanova et al., 2011;Mignot et al., 2012], to inhibit wind-induced mixing and entrainment of cool thermocline water into the mixed layer [Anderson et al., 1996;Delecluse, 1998a, 1998b;Foltz and McPhaden, 2009]. During the hurricane season, the BL in the western part of the MDR is further thinning, with intense subsurface temperature maxima [Mignot et al., 2012]. The stable plume limits the mixed layer to 20-30 m depth, and the intense radiative heat flux penetrates significantly below, thereby heating the subsurface waters protected from air-sea interactions. As such, these combined physical processes (river discharge, plume advection, development of BL, and intense radiative heat flux penetration), contribute to large sea surface temperature anomalies (SSTAs) and higher upper ocean heat content (OHC) in the river plume region. As illustrated in Figure 1 and first evidenced by Ffield [2007], historical in situ data thus reveal that average ocean surface temperatures first encountered by tropical cyclones moving westward between 12 N and 20 N is only 26 C-27 C east of 50 W, but upon reaching the northern reaches of the Amazon-Orinoco River plume, the average sea surface temperatures encountered by tropical cyclones are 1 C-2 C warmer. As shown in Mignot et al. [2012] (see their Figure 5), the 26 C isotherm is also deepening below the advected freshwater layer in the western MDR, evolving from an average depth of 30 m in May to 70-80 m during the hurricane season. In that context, Vizy and Cook [2010] performed simulations to study the atmosphere response to the presence or absence of the Amazon/Orinoco plume SST anomalies. Convincing results indicate that the plume can significantly influence the frequency (60%) and intensity of summertime storm systems over the Atlantic. To bring new insights into the complex interplay between hurricanes and the Amazon-Orinoco river plume, we reanalyze in this paper the spatial distribution of extreme atmospheric events for that region. Using historical information on the extent of the river plume during the hurricane season, we analyze the cooling amplitude detected from space in the wake of an ensemble of TCs-a key feedback parameter for TC intensification [Emmanuel, 1995]-and the impact of the river plume. Further building on the new space-time sea surface salinity mapping capabilities of two recent orbiting platforms, namely, SMOS (Soil Moisture and Ocean Salinity) [Kerr et al., 2010] and Aquarius/SAC-D [Lagerloef et al., 2012], we analyze SSS changes in the wakes of Tcs [Grodsky et al., 2012], and detail the oceanic response to one particular hurricane, Igor, that attained category 4 in September 2010 as it passed over the north-western edge of the Amazon-Orinoco river plume. The paper is organized as follows: In section 2, we describe the data sets and methods used in this study. An analysis of the location within the NWTA of the occurrence for the most intense hurricanes is first provided in section 3.1. Hurricanes locally intensifying to categories 4 and 5 on the Saffir-Simpson scale are found preferentially as they travel across the northern reach of the Amazon-Orinoco plume. We further analyze (sections 3.2 and 3.3) the sea surface cooling amplitude observed from satellite SST products in the Figure 1. Historical distribution of (a) SSS and (b) SST (in unit of C) in the North Western Tropical Atlantic during the hurricane peak season (August to October). (c) The number of 1950-2010 ''best track'' tropical storms and hurricanes per 1 square (smoothed by a 3 3 3 block average). The brown curve in all plots is showing the historical extent of the Amazon-Orinoco river plume (surface isohaline at 35.4) during the hurricane peak season. The white, red, and magenta squares in Figure 1c are the three regions of study hereafter referred to as North-West (white rectangle), central (red rectangle), and South-East (magenta rectangle) TC Path area."}, {"section_title": "Journal of Geophysical Research: Oceans", "text": "\n10.1002/2014JC010107 cross the NWTA following two preferential corridors. The first (hereafter referred to as the ''northern corridor'') corresponds to the dominant path of all-intensity storms as shown in Figure 1c. This corridor originates at a location centered around (30 W, 14 N) extends northwestward to intercept the northern tip of the Amazon-Orinoco river plume at (55 W, 20 N) and further develops northwestward toward U.S. coasts. The second southernmost corridor shows another preferential intense storm path starting from the lesser Antilles and extending northwestward south of the Greater Antilles toward Cuba. The number of storms that intensified locally to category 4 or 5 within the spatial domain (80 W-20 W; 4 S-35 N) is further shown, Figure 2b. As evidenced, the occurrence of extreme storm events in that area is maximum in the central region of the TC northern corridor around 55 W, 18 N."}, {"section_title": "10.1002/2014JC010107", "text": "wake of an ensemble of TC tracks traveling in the NWTA for the period 1998-2012. Based on the historical extent of the river plume during the hurricane season, the cooling amplitude observed in the wake of TCs is apparently systematically reduced over the river plume waters compared to storms with equivalent intensities but traveling over surroundings open-ocean waters. As analyzed, using historical in situ profiles of salinity and temperature in the NWTA, salt-driven vertical stratification, enhanced oceanic heat content, and barrier-layer presence within the plume waters are shown to be likely oceanic factors triggering the local TC intensification. In section 3.4, the case study of category 4 hurricane Igor that crossed the Amazon-Orinoco river plume in 2010 is detailed. Hurricane Igor major characteristics, atmospheric forcing, and prestorm oceanic conditions are presented. In situ Argo profile measurements are used to reveal the local upper ocean responses and to discuss the associated potential impact of the plume haline stratification on the cooling inhibition. In section 3.5, the potential to directly use satellite SSS data as a proxy to infer ocean stratification below the plume is presented and discussed, to finally be illustrated for the ensemble of TCs that developed in that region since 2010.\nbetween their prestorm and poststorm cycles are ranging from 7 to 42 km for seven of the floats. Two of them, namely A7 and A9 (see Figure 12) were however significantly displaced by 78 and 100 km, respectively. Five floats over nine sampled the left-hand side of the storm (A1, A2, A4, A5, and A8) and four provided measurements within or close to the prestorm plume region boundaries (A2-A5). SMOS detected that the prestorm northeastern tip of the plume (within the high-wind wake region) slightly extended further east after the storm around 17 N, 53 W. Apparently, float A2 was therefore located outside or close to the plume boundaries before the storm but it came up at the surface crossing the advected plume after Igor. Only A4 and A5 sampled the wake within the highest surface wind speed region, where values exceeded 40 m/s (see the red region in Figure 10a). Nevertheless, six of the floats performed measurements in an area where the wind power index is found to exceed 3 (A1, A3, A4, A5, A6, and A7). Note as well that the depths of the upper level measurements available during the Argo float vertical profiles are ranging from 6.5 to 3.5 m below the surface. The differences between the Argo floats upper level salinity and temperature measurements obtained before and after IGOR passage can be compared to colocalized satellite estimates. Note that the oceanic surface response estimates from satellite sensors are based on 1 week composite images at 0.25 spatial resolution. Argo floats sampled these quantities locally in space and time, 65 days from the storm passage in average. Moreover, the microwave surface measurements of salinity and temperature are representative of the surface conditions in the top first centimeters below the sea surface, while Argo floats sampled these quantities at an averaged depth of 5 m. In Figure 13, we plot the satellite versus in situ oceanic response estimates for sea surface salinity and temperature. Despite the differing sampling characteristics of these sensors, an overall good agreement is found in the surface changes estimated from both type of measurements. The latter exhibits root-mean-square deviations over the nine samples of 0.37 and 0.4 C for surface salinity and temperature, respectively. The greatest difference between both DSSS data sets is found at float A8 (see Figure 12). Here, SMOS detected a 0.8 drop in the sea surface salinity while the float measured almost no change in SSS, 5 days apart of the storm passage. Argo float A3 (diamond symbols in Figures 12  and 13), was located just at the north-eastern reach of the Amazon-Orinoco plume 8 days before IGOR and it came up at the surface 40 km southeastward, 1 day after the storm passage. Measurements from this float exhibit a strong surface salinity enhancement on the order of 11.5 and a surface cooling amplitude of 22.7 C after the storm passage. While the salinity change observed in situ by A3 is slightly smaller than the SMOS satellite one (11.7), both observations are consistently revealing a significant salinity increase after the storm in that area. As well, surface measurements from A5 (triangle-up symbol) conducted in the north-western part of the eroded plume along the storm track indicate 10.6 unit increase in the surface salinity, also consistent with SMOS estimates. Both SMOS and ARGO float A4 data (x cross symbol) indicate a small 0.2 salinity increase on the left side of the storm track, in a region where the presence of the Journal of Geophysical Research: Oceans 10.1002/2014JC010107 plume was still detected by SMOS after the storm passage (see Figure 12). Float A2 (circle symbols) detected a 20.7 decrease in SSS at the poststorm plume north-eastern boundary. This surface salinity decrease is also in relatively good agreement with SMOS observations (20.5) and is probably associated with the detected poststorm eastward advection of the northeastern tip of the plume. The amplitude of the salinity response found at these four in situ samples partly validate the salt changes observed from space by SMOS in the wake of Igor as the storm traveled across the Amazon-Orinoco plume. Amplitudes of the SST responses to IGOR as observed in situ also agree rather well with the satellite estimates. The largest SST drop observed in situ (22.8 C) within the wake is thus found at float A6 (1 symbol) around 62 W on the right-hand side of Igor track. This is located within the area of maximum cooling amplitude detected from space (see Figure 11a). Within the Amazon-Orinoco plume area, smaller cooling amplitudes than in open-ocean waters are generally detected from satellite observations. Oceanic response is generally greater to the right of the track of tropical cyclones [e.g., Ginis, 2002] as strong asymmetry of the baroclinic currents relative to the storm track takes place immediately after the hurricane passage. This rightward bias occurs because the Figure 13. Comparison between Satellite and in situ estimates of the ocean surface responses to hurricane IGOR at the locations where the nine Argo-float came up to the surface in terms of (a) sea surface salinity DSSS CW , (b) sea surface temperature (DSST CW ) ( C). Symbols identifying ARGO floats are given in the legend of Figure 13a. Figure 12. Positions of the nine Argo floats providing salinity and temperature profile measurements within the high-wind (>34 knots) wake of Igor before and after the storm passage (labeled A1-A9). The location of the profilers before and after the storm passage is indicated by black and magenta symbols, respectively. The corresponding number of days between the date of the ARGO float profile measurements and the date of the local highest wind during Igor passage are indicated in the legend (before/after the storm). The storm eye track is shown as colored circles, indicating the days in September along track with the code provided in the colorbar. The orange and gray-blue contours are indicating the prehurricane and posthurricane horizontal extent of the Amazon-Orinoco plume, respectively. Journal of Geophysical Research: Oceans 10.1002/2014JC010107 Journal of Geophysical Research: Oceans 10.1002/2014JC010107 clockwise inertially rotating currents are effectively accelerated on the right side and decelerated on the left side, due to the rotation of the wind stress vectors produced by the moving storm. This asymmetry in the oceanic response however drops significantly when the storm forward translation speed diminishes to low values. For very low translation speed such as the case of Igor over the plume (3-4 m/s), Ginis [2002] predicts an almost symmetrical oceanic response. Nevertheless, we found greater satellite SST drops where the freshwater layer was strongly eroded by Igor (right-hand side) than in the least-affected plume region (mostly in the left-hand side of the track). This is consistent with in situ observations from floats A3 and A5 which exhibit cooling amplitude of 22.7 C and 22.6 C in the eroded plume region, respectively, while the amplitude of the SST response at float A4, located within the noneroded plume, is measured to be only 20.7 C."}, {"section_title": "Data Sets and Methods", "text": ""}, {"section_title": "Tropical Cyclone Tracks and Atmospheric Forcing Data", "text": "Positions and along-track maximum winds of North Atlantic tropical cyclones were obtained from the International Best Track Archive for Climate Stewardship (IBTrACS) tropical cyclone data set [Knapp et al., 2010], version v03r05 and available at http://www.ncdc.noaa.gov/ibtracs/. This reanalysis covers the period 1950-2012. The IBTrACS data set records the 10 min maximum wind speed along with tropical cyclone track locations at 6 h intervals, which we convert to 1 min values by dividing by 0.88 [Knapp et al., 2010] to be compared on the Saffir-Simpson scale. As discussed in Price [1983], a scaling to characterize the oceanic response to TC is the nondimensional storm speed V/(2Rf), with V the storm translation speed, R the radius to maximum stress and f, the Coriolis parameter. Large uncertainties, however, remain in the estimate for R. For our purpose, the oceanic response to hurricane was computed separately by category on the Saffir-Simpson scale, according to the magnitude of the 1 min maximum wind speed, and further divided according to V/f. We consider V/f 5 1, with 1 unit equivalent to 2R 5 100 km. As reported [Lloyd and Vecchi, 2010] V/f < 1are associated to the largest SST cooling. For V/f > 1, the mean SST response is reduced. For the hurricane Igor case, we further consider the operational products of the NOAA/NWS/NCEP North Atlantic Hurricane Wind Wave forecasting system (NAH) [Chao et al., 2003]. This surface wind model product is available at http://polar.ncep.noaa.gov/waves/ and is a blend of the Global Forecast System (GFS) products and of the NOAA/Geophysical Fluid Dynamic Laboratory (GFDL) hurricane model winds. The products are obtained four times a day: 00Z, 06Z, 12Z, and 18Z with a current 0.25 resolution grid. These model products are used here as they were shown to compare well to several airborne and satellite wind observations over IGOR [Reul et al., 2012]. Following Vincent et al. [2012aVincent et al. [ , 2012b, the Wind Power Index (WPI) is used to characterize the hurricane atmospheric forcing. This builds on the Power Dissipation Index (PDi) [Emanuel, 2005] that is a good proxy of the kinetic energy transferred from the winds to the ocean. The PDi is evaluated along the Igor track in the area covered by wind speeds over 34 knots (1 knot 0.51 m/s). For each latitude k and longitude u, it is computed as: PDiðk; uÞ5 ð tc to qC D ðk; u; tÞUðk; u; tÞ 3 dt and the WP i writes as follows: where jUðk; u; tÞj is the local magnitude of surface wind at position k; u ð Þfor latitude k, longitude u, and time t; C D the dimensionless surface drag coefficient, q the surface air density, t o and t c the time when the Journal of Geophysical Research: Oceans 10.1002/2014JC010107 cyclone starts and stops influencing the considered location k; u ð Þ; respectively; PD o 5 Ð tc to qC D U o 3 dt is a normalization constant corresponding to a weak storm with a translation speed of 7 m s 21 (25 km h 21 ) and a maximum 10 min averaged wind speed of 17 m s 21 (the wind speed defining a Tropical Depression: the weakest cyclonic system classified). To analyze TC Igor, we estimate WP i using the local magnitude of the wind from the GFDL/NAH products, and the C D parameterization from Kudryavtsev and Makin [2011]. The latter model follows observations from Powell et al. [2003], Powell [2006], and Jarosz et al. [2007]: it exhibits a significant saturation and even decrease at high-wind speeds above 35 m s 21 . We used a temporal integration range defined by t o 5 t max 2 3 days and t c 5 t max 1 3 days, where t max is the time of occurrence of the maximum wind event at location k; u ð Þ."}, {"section_title": "Historical Sea Surface Salinity and Ocean Subsurface Properties", "text": "Historical in situ ocean Temperature (T) and Salinity (S) profile data are from the World Ocean Database (WOD) provided by the National Oceanographic Data Center (NODC, released in 2009). We considered all available profile data within the spatial domain (90 W-20 W; 5 S-40 N) and during the period 1913-2009. These include data collected from Ocean stations, high and low-resolution Conductivity-Temperature-Depth (CTD), moored buoys, profiling floats, gliders, and drifting buoys. In addition, we considered measurements from Argo floats provided by the Coriolis data centre (http://www.coriolis.eu.org/) to cover the period 2009-2012. We only selected the profiles with WOD quality flags equal to 0 for entire cast, depth, salinity, and temperature observed level flags. In addition, only the profiles showing at least one S and T value every 10 m from the surface to 100 m depth were used for our analysis. For the peak hurricane season, we thus collected an ensemble of 35,221 profiles in the region of interest. For each profile, SSS, SST were determined as the upper level measurements within the first 10 m below the surface. The depths D r and D T-02 of the mixed layer and of the top of the thermocline were also determined for each profile following De Boyer Mont egut et al. [2004,2007]. The depth of the oceanic thermocline is defined as the depth D T-02 where the temperature has decreased by 0.2 C, as compared to the temperature at the reference depth of 10 m. D r is defined as the depth where the potential density r h has increased from the reference depth by a threshold Dr equivalent to 0.2 C decrease in temperature at constant salinity: Dr5r h T 10 20:2; S 10 ; P o ð Þ 2r h T 10 ; S 10 ; P o ð Þ , where T 10 and S 10 are the temperature and salinity at the reference depth and P o , the pressure at the ocean surface. Because of oceanic stability, the density is necessarily approximately constant above this depth, which defines thus the base of the density mixed layer. The intermediate layer between the top of the thermocline and the bottom of the density mixed-layer then constitutes the Barrier Layer (BL) and its thickness (BLT) is defined as the difference between D T-02 and D r. The strength of the oceanic stratification is characterized by the vertical distribution of the buoyancy frequency N z ð Þ52 g ro drðzÞ dz , where g is the acceleration of gravity. Shay and Brewster [2010] have shown that high values of the maximum vertical buoyancy frequency N max 5 max(N(z)) (relatively to a reference No taken at base of the seasonal thermocline) significantly modulate the fraction of oceanic heat content (OHC) available to tropical cyclones. The OHC quantity is generally evaluated relative to the 26 C isotherm as it is the temperature assumed for tropical cyclogenesis [Palmen, 1948]. For each profile, we therefore evaluated N(z), N max and the depth of the 26 C isotherm (H 26 )."}, {"section_title": "Sea Surface Temperature (SST)", "text": "We use a blend of Tropical Rainfall Measuring Mission (TRMM) Microwave Imager (TMI) and Advanced Microwave Scanning Radiometer AMSR-E SST daily data set (http://www.ssmi.com/sst/microwave_oi_sst_ data_description.html) to characterize the observed SST response to TCs in the Amazon-Orinoco plume region over the 1998-2012 period. Despite its inability to retrieve SST data under heavy precipitation [Wentz et al., 2000], TMI and AMSR-E still provide accurate observations of SST beneath clouds, a few days before and after TC passage. The evaluation of the SST anomaly in the wake of a given storm was obtained following Vincent et al. [2012a]. From the TC track locations available at every 6 h intervals, the SST fields are projected along and across track axes. A fixed radius of 200 km (about 3-4 maximum wind radius in average) around each TC-track position is used to characterize the maximum cooling amplitude. This region encompasses a crucial area where SST is known to influence TC intensity [Cione and Uhlhorn, 2003;Schade, 2000]. The reference unperturbed prestorm SST conditions (SST o ) is defined as the 10 day average from 12 to 2 days before the TC passage. The SST in the wake of the TC (SST CW ) is defined as the 3 day average starting 24 h after the storm passage. The amplitude of the SST response is characterized by the cooling amplitude in the cold wake (CW) as DSST CW 5 SST CW 2 SST o . Journal of Geophysical Research: Oceans 10.1002/2014JC010107"}, {"section_title": "Tropical Cyclone Heat Potential", "text": "To characterize Igor prestorm oceanic conditions, we use the Tropical Cyclone Heat Potential (TCHP) products derived by AOML for the month of September 2010. TCHP is an estimate of the integrated vertical temperature from the sea surface to the depth of the 26 C isotherm and is derived from AVISO Sea Surface height Anomaly (SSA) data, historical 1992-2006 in situ temperature profiles, and merged TMI/ AMSR-E SST fields [Goni and Trinanes, 2003]. We also use the by-product estimate of the depth the 26 C isotherm. 2.5. SMOS Sea Surface Salinity Data SMOS (Soil Moisture and Ocean Salinity) is the European Space Agency (ESA) water mission [Kerr et al., 2010;Mecklenburg et al., 2012], an Earth Explorer Opportunity Mission belonging to its Living Planet Program. SMOS was launched in November. ESA produces so-called Level 2 SSS products which correspond to instantaneous SSS retrievals under the satellite swath. The accuracy of these instantaneous SSS retrievals is rather low (1-1.5 unit) and space-time averaging of the Level 2 products is needed to decrease the noise level in the retrievals. Here, we used space-time composite SSS products generated at the ''Centre Aval de Traitement des Donn ees SMOS'' (CATDS, http://www.catds.fr), which is the French ground segment for the SMOS data [Reul and Tenerelli, 2011]. Overall accuracy of the 10 days composite products at 25 km resolution is on the order of 0.3 practical-scale salinity (pss) in the Amazone Plume region [Reul et al., 2014]. As the wind-induced sea surface roughness and foam impact dominantly contributes to the ocean emitted L-band brightness temperature under severe storms [Reul et al., 2012], SSS cannot be accurately retrieved from the SMOS sensor data directly under tropical cyclones. However, a reliable estimate of the upper ocean salinity response in the TCs wake can be derived from the SMOS data 1-2 days after the TC passage. The prestorm SSS over Igor hurricane, denoted SSS o , is defined as the 7 days average of surface salinity from 7 to 1 days before the TC passage and the SSS in the wake of the TC (SSS CW ) is defined as the 7 days average starting 24 h after the storm passage. The amplitude of the SSS response over Igor hurricane is characterized here by the amplitude of the salt change in the TC wake as DSSS CW 5 SSS CW 2 SSS o ."}, {"section_title": "Results", "text": ""}, {"section_title": "Area of Maximum Occurrence of the Most Intense Hurricanes", "text": "We selected the most intense events during the period 1950-2009, with estimated 1 min maximum wind speed along track exceeding 112 knots (categories 4 and 5 in the Saffir-Simpson scales) during the storm lifetime. First, we consider storms before 2010 when no spaceborne SSS measurements were yet available. The number of TC tracks per 1 3 1 boxes for which the storms evolved as categories 4 and 5 somewhere along their track during that period is shown in Figure 2a. The most destructive hurricanes are observed to Figure 2. The number of 1950-2010 ''best track'' TC per 1 square (smoothed by a 3 3 3 block average) (a) that evolve as categories 4 and 5 somewhere along their path and (b) that intensified locally to categories 4 and 5. The black curve is showing the historical extent of the Amazon-Orinoco river plume during the hurricane peak season (August to October)."}, {"section_title": "Reduced Cooling Amplitude in the Wake of TCs Traveling Over the Amazon-Orinoco River Plume", "text": "Intense hurricane-induced mixing and upwelling generally act to entrain cool thermocline water into the mixed layer, leaving behind a cool wake of SST [e.g., Price, 1981;Bender and Ginis, 2000]. Hereafter, we wish to characterize the Lagrangian hurricane-induced cooling amplitudes and dependencies with respect the Amazon-Orinoco river plume. We restricted our analysis to the 1998-2010 period covered by TMI-AMSR SST products over the domain (100 W-30 W; 5 S-28 N). The subset of TC tracks extracted for that period (Figure 3) includes 190 storms. As found, 40 storms crossed the historical region of the plume (defined hereafter). Sea surface cooling amplitude DSST CW in the wake of each storm was determined within a radius of 200 km from the storm tracks, and classified as function of the maximum wind speed along track and of the hurricane translation speed (V/f), both factors strongly impacting the cooling amplitude in TC wakes. The influence of the Amazon-Orinoco River plume on DSST CW is further explored by considering separately tropical cyclones-induced cooling amplitudes estimated within the historical region of the plume from those determined in the other North Tropical Atlantic regions (hereafter referred to as ''open-ocean'' waters). The plume horizontal extent is determined from the historical SSS data collected over the June to November months and defined by SSS 35.4 (green domain in Figure 3). A significant spatiotemporal variability is expected in the horizontal spread of the Amazon-Orinoco plume and detecting its location using a 4 months averaged SSS climatology is therefore introducing errors in our classification for open-ocean and river-plume influenced surface waters. As illustrated in Figure 4, a reduced-cooling amplitude DSST CW in the wake of TC passing over the historical plume region is systematically found with respect to open-ocean domains. A larger cooling amplitude is observed for slow (V/f < 1) than for fast moving storms (V/f > 1), whatever the type of ocean surfaces crossed by the storms. The SST response appears to be a nonmonotonic function of wind speed, with stronger cyclones producing more cooling up to categories 2 and 3 but producing less or approximately equal cooling for categories 3-5 tropical cyclones. This is particularly true for slow-moving storms. Categories 4 and 5 cyclones form dominantly over regions with deep and warm mixed layer inhibiting very strong cooling [Price, 1983;Greatbatch, 1984;Lloyd and Vecchi, 2010]. As illustrated in Figure 4, SST measured anomalies in the wake of TCs traveling over the Amazon-Orinoco plume waters are systematically reduced. The relative reduction of the cooling amplitude, R 5 100 * DSST plume /DSST open ocean , is shown in Figure 5. For slow- Journal of Geophysical Research: Oceans 10.1002/2014JC010107 moving storms, the cooling amplitude reduction over the plume waters varies from about 35% for tropical storms and up to 60% for hurricanes. For fast moving storms, the impact of the plume waters is also increasing with storm intensity from slightly less than 20% for tropical storms and category 1 hurricanes to 50-60% for TCs with intensities above category 3."}, {"section_title": "Oceanic Processes Potentially Triggering Increased TC Intensification Over the Plume", "text": "This strong reduction in ocean surface cooling amplitude over the plume waters certainly questions its role to favor the hurricane intensification potential in this region. To further gain insights of this possible influence, the subsurface hydrological characteristics along the northern TC corridor and their spatiotemporal variability are reported hereafter.  Journal of Geophysical Research: Oceans 10.1002/2014JC010107"}, {"section_title": "Subsurface S and T Properties Below the Northern Tip of the Amazon-Orinoco Plume", "text": "The historical distributions of salinity and temperature as function of depth z and latitude averaged within the longitudinal band (62 W-52 W) during the peak hurricane season (August-October) are shown in Figure 6. As evidenced, the plume clearly extents northward during that season to 22 N, with an average thickness (depth at which salinity values equal to 35.4) D plume 30 m in this area and an average vertical salinity gradient of 0.05 pss/m at that depth. A steep latitudinal salinity gradient of 3.5 3 10 23 pss/km marks the northern reach of the low-salinity waters at 21 N. To evaluate the ocean heat content (OHC) potential [Leipper and Volgenau, 1972;Goni and Trinanes, 2003;DeMaria et al., 2005;Mainelli et al., 2008], integration is performed relative to the 26 C isotherm (the temperature assumed for tropical cyclogenesis [Palmen, 1948] as:  Journal of Geophysical Research: Oceans where T(z) is the upper ocean temperature vertical profile, D 26 is the depth of the 26 C isotherm, g 0 is the sea surface height anomaly, q represents the density of the upper ocean layer, C p is the specific heat of seawater at constant pressure, which has a value of 1 cal g 21 C 21 . OHC is usually determined based on climatological profiles of T, SST from satellite measurements and surface height anomaly from satellite altimetry [Shay et al., 2000]. As shown in Figure 6, Figure 2b), the 26 C isotherm is the deepest within the region, reaching 70 m depth. North of the plume between 21 N and 35 N, the average temperature above the 26 C isotherm depth is 27.3 C. With an average value of H 26 30 m within the 21 N-35 N zonal strip, this yields an OHC value about 3 times smaller than within the river plume waters. Other factors, for instance, wind shear, humidity, rings shed by the North Brazilian Current, etc., may certainly also impact the intensification of TC in the plume region but would require more in depth analyses, left for future work."}, {"section_title": "The Strength of the Oceanic Stratification Below the Northern Tip of the Amazon-Orinoco Plume", "text": "As expected, a strong upper ocean density stratification can modulate the response of the upper ocean to intense storms to often preclude a cold SST wake [Shay and Brewster, 2010;Wang et al., 2011]. While temperature is a sufficient proxy for density and static stability in most oceanic conditions, salinity can also have a significant and sometimes decisive effect on static stability in special locations, such as in the Amazon-Orinoco plume region [Balaguru et al., 2012]. Significant stratification within an isothermal layer can maintain a BL between the base of the isothermal layer and the base of the mixed layer. Wind-driven effects can then become insufficient to lower the Richardson numbers to below criticality at the base of the BL where the stratification is reaching maximum values due to the combined effects of the very strong S and T vertical gradients. Mixing is then restricted to the layers shallower than the BL base and entrainment of cool thermocline water into the isothermal mixed layer is then reduced [Balaguru et al., 2012]. This mechanism is certainly taking place over the plume as reported in Figures 4 and 5, and hence, can possibly explain the maximum occurrence of intense storms at the tip of the Amazon-Orinoco plume region (see Figure 2b). This stabilizing effect of the salinity from the surface down to the main pycnocline can be related [Maes and O'Kane, 2014] to the depth where the Brunt-Va€ ıs€ al€ a frequency, N 2 (T,S), is maximum. In Figure 7, we show the meridional average distribution of the hurricane-season climatology of the buoyancy frequency N as function of depth z and latitude k. The N (z, k) distribution is derived from the ensemble of individual N(z) profiles collected within the longitudinal band (62 W-52 W) and by averaging over 3 width bins in latitude and 10 m width bins in depth. As illustrated, two maxima of N (z, k) greater than 12 cycles per hour on average are found around 10 N and 18 N near the freshwater layer base. The local maximum at 18 N is principally related (see Figure 6a) to a strong local vertical gradient (0.1 pss/m) in salinity, which evolves from 37.2 at 50 m depth (just above a subsurface salinity maximum of 37.5 at 120 m) to 35.4 at a depth of 30 m, the base of the freshwater river plume layer. The histograms of the number of TC crossing that area ( Figure 7) reveal that most of the categories 4 and 5 hurricanes pass over the northern maxima in stratification at around 18 N. The fact that a significant number of weaker hurricanes (categories 1-3) also frequently cross this maximum indicates that TC does not systematically intensify over this area, but also, do not significantly alter the particular plume stratification. Results reported in Figures 6 and 7 illustrate that this relatively preserved heat reservoir may then become an important factor for the most intense hurricanes crossing this area."}, {"section_title": "Temporal Variations of the Subsurface Properties in the Three Regions Along the Northwestern Tropical Atlantic TC Main Corridor", "text": "As already reported [Mignot et al., 2012], a unique BL system in terms of persistence, extension, and associated subsurface temperature maximum is seasonally expected in the northwestern tropical Atlantic Central region (see Figure 1c, red box). Based on collected historical NODC profile database, such a seasonal Journal of Geophysical Research: Oceans 10.1002/2014JC010107 evolution of the subsurface properties can be assessed for the three regions identified along the northern TC corridor: namely, the North-West, central, and South-East oceanic regions. Time evolution of temperature and salinity from the surface to 100 m depth averaged over each of the three domains shown in Figure 1c are given in Figure 8. For each region, we represent the evolution of the isothermal depth D T * 202 (solid white circles), of the MLD (solid black circles), the depth D 26 of the 26 C isotherm (red curve) and of the vertical maximum in the buoyancy frequency N(z) (gray curve)."}, {"section_title": "Central Region", "text": "In summer, the BL (see Figure  8, middle) is relatively shallow, found at 30 m depth at the base of the river plume, and thin, 10 m thick, with subsurface temperature maxima, D 26 reaching a depth of 60-70 m during the peak hurricane season. The mixed layer is constrained to a very thin depth (25 m), while the intense radiative heat flux penetrates significantly below. Protected from air-sea interactions, subsurface waters efficiently gain warmth to sustain a BL. The average depth at which the Brunt-Va€ ıs€ al€ a frequency is found maximum during the August-October period is located around 50 m depth, i.e., in between the BL depth and the D 26 , thus reenforcing the subsurface waters protection from air-sea interactions."}, {"section_title": "North-West and South-East Regions", "text": "Comparatively (see Figure 8, top and bottom), during the hurricane peak season, the North-West and South-East zones exhibit a slightly deeper MLD (found between 30 and 40 m depths), a significantly thinner BL (thickness <5 m) and shallower D 26 (found at 40-50 m depths). The Brunt-Va€ ıs€ al€ a frequency maximum is found at 55 m depth, i.e., below both the thinner BL and shallower D 26 . During their northwestward travel from 30 W to 80 W within the northern corridor, the most intense TCs are passing above the northern tip of the Amazon-Orinoco river plume. As a result of the specific seasonality of the freshwater discharge and of the intense radiative heat flux in this area, this region is locally exhibiting a significantly higher Ocean heat Content and stronger-salinity-driven-stratification than found in the surrounding open-ocean North-West and South-East region within the TC corridor. Both processes can then act to reduce the SST cooling effectiveness in the wake of storms passing above the river plume as evidenced in section 3.2. As such, TC intensification can more likely occur in this region, as illustrated in section 3.1. Journal of Geophysical Research: Oceans 10.1002/2014JC010107 3.4. The Category 4 Hurricane Igor Case Study: An Illustration of Amazon Plume/Hurricane Interactions In the following, the category 4 hurricane Igor that crossed the river plume is used as a satellite case study to further demonstrate that the new sea surface salinity measurements from space further serve as a useful complementary data set to improve the local characterization of the atmosphere-ocean coupling in tropical cyclones."}, {"section_title": "Precyclonic Ocean Conditions", "text": "Igor, as the strongest tropical cyclone of the 2010 Atlantic season, was a very large and intense Cape Verde hurricane that struck Bermuda with category 1 intensity. Table 1 and Figure 9 illustrate that Igor underwent a very rapid intensification starting on September 11 from a tropical storm to category 4 on the Saffir-Simpson scale as the storm center passed over waters warmer than 28 C, around 45 W on September 13 (see Figure 9b). At that time, Igor slowed its forward translation speed (see Table 1), while maintaining a category 4 intensity and a nearly due westward heading across the tropical Atlantic until September 14. The peak intensity of Igor was estimated to be 135 knots, reached on September 15 [Pasch and Kimberlain, 2011]. As evidenced using SMOS SSS prior the storm (Figure 9a), this happened as Igor eye was traveling over the northern reach of the Amazon-Orinoco river plume, indicated by SSS fresher than 35.4. Igor then moved west-northwestward in response to a weakness in the subtropical ridge created by a broad deeplayer trough near the northeastern U.S. It maintains a category 4 intensity until the morning of 17 September progressively weakened as it moved out of the region of the Amazon-Orinoco river plume. North of the storm track between 60 W and 53 W, river influenced fresher surface salinities are detected over an Journal of Geophysical Research: Oceans 10.1002/2014JC010107 estimated surface area of 89,000 km 2 . The TMI-AMSRE SST imaging (Figure 9b) further reveals that the Amazon-Orinoco river plume waters were warmer than 29 C before the hurricane passage. The prestorm SST maintained warm values above 29 C along the location of the storm track, northwest of the Amazon-Orinoco plume until 27 N. The Tropical Cyclone Heat Potential (TCHP) along Igor track (Figure 9c) was   Figure 9c). In Figure 9a, the text within black boxes indicates the dates (month-day) corresponding to Igor eye locations along the track. Journal of Geophysical Research: Oceans 10.1002/2014JC010107 favorable for hurricane intensification and reached maximum values on the order of 70-75 kJ cm 2 over the region of the plume, which is above the typical threshold values (50-60 kJ cm 2 ) usually advocated in cases of Atlantic rapid intensification [Mainelli et al., 2008;Goni et al., 2011]. This results from the combination of a high SST and of a 26 C isotherm reaching a locally maximum 70-90 m depth within the plume region (Figure 9d). From 11 to 17 September, the NOAA Climate Forecast System Reanalysis (CFSR) wind products indicate that there was low wind vertical shear in the hurricane area (not shown). The large-scale atmospheric circulation was therefore favorable for Igor development and intensification as it traveled over the plume warm waters during its most intense phases (12-17 September)."}, {"section_title": "Atmospheric Forcing Conditions", "text": "The oceanic surface response to tropical cyclones is driven by the evolution of the wind stress intensity and its spatial distribution (described by characteristic horizontal scales of the storm, such as the radii of the maximum wind and wind stress torque), and by the storm forward translation speed [Ginis and Sutyrin, 1995]. The along-track evolution of the forward translation speed of Igor is provided in Table 1. The storm progressively decelerated from 10 m s 21 on 10 September to 3.5 m s 21 , reached on 14 September, just before Igor eye first encountered the freshwater-layer of the plume north-western edge. The storm maintained a slow forward motion below 5 m s 21 as the eye traveled across the plume region. It then progressively reaccelerated after quitting the latter zone to reach 21 m s 21 on 21 September when the eye reached the Bermuda islands. While best-track data include, at 6 h interval along Igor track, estimates of characteristic parameters such as the maximum wind speed, its radius, and the 34, 50, and 64 knots radii, associated errors are not provided. The lack of surface observations from reconnaissance aircraft flights thus precludes any confident computation of the evolving spatial distributions of Igor wind fields. As a consequence, observed surface wind analysis such as the HWIND product from Hurricane Research Division is not available over the plume region [Reul et al., 2012]. The NAH/GFDL model wind speed products are therefore used hereafter to gain insight into the two-dimensional distribution of the wind energy input to the ocean during Igor and its potential impact on the upper ocean vertical mixing. In Figure 10, we show the spatial distributions of the maximum surface winds from the NAH/GFDL model and of the associated wind power index WPi. As illustrated, the northernmost portion of the low-salinity plume, imaged before the storm, is a region where the surface wind speed and wind power index reached values above 40 m s 21 and 3, respectively. The WPI, which is a proxy for the amount of kinetic energy available for mixing under the storm, reached its maximum values in an area where the velocity of forward movement of the storm dropped to a minimum of 2 m s 21 on the evening of the 15 September, around the position at 21 N, 56.5 W. As expected, both the maximum winds and WPi distributions exhibit some asymmetries with respect the track of the hurricane center, with highest values generally found on the storm right-hand quadrants. An extended area where the amount of kinetic energy available for mixing is weaker than in the prestorm plume region but still significant (1 < WPi < 3) is distributed on both side of the storm track within the domain where wind speeds exceeded 34 knots. As shown in Table 1, the mean values of the surface wind speed radii at 34 knots under Igor and evaluated over the four storm quadrants increased quasilinearly from about 100 km on 11 September to 500 km on the 19 September. As Igor passed over the northernmost portion of the low-salinity reach of the plume (15-16), the latter radius reached around 350 km. Note that on the right-hand side of the storm track, the wind power index is found to be always greater than 3 within the prestorm plume region while on the left-hand side it is ranging from 1 to 4. Figure 10 therefore reveals that during the passage of Igor, a significant portion of the north-western edge of the Amazon-Orinoco plume surface waters was under the action of strong surface wind stresses on both sides of the storm track."}, {"section_title": "Spaceborne Observations of Ocean Surface Response to Hurricane Igor", "text": "After the hurricane passage [see Reul et al., 2014, Figure 25], the relatively freshwater surface area located on the right-hand side of the storm track is not anymore detected by SMOS. In this region, the surface salinity increased by 1 unit as illustrated in Figure 11b, a result very similar to the SSS response evidenced during the passage of hurricane Katia over the plume [Grodsky et al., 2012]. Vertical mixing certainly acted to entrain saltier waters from below the freshwater plume surface layer into the mixed layer, thus leaving a salty wake in the SSS on the storm track right-hand side. The same Journal of Geophysical Research: Oceans 10.1002/2014JC010107 mechanism also entrained cooler waters from depth, leaving a cold wake in the SSTs (Figure 11a). The SSS response reaches maximum amplitude DSSS CW 5 1-1.5 unit on the storm right-hand side at the prestorm location of the Amazon-Orinoco river plume, in an area where the wind energy input reached maximum intensity (WPi 4). An associated significant surface cooling of 22 C is detected in this eroded freshwater plume region. Yet, the greatest cooling effect, with amplitude DSST CW < 23 C, occurred further north, in between 25 N and 35 N, as Igor intensity damped to category 2 and as the wind power index decreased below 3.5. In this region, the surface salinity changed only weakly with |DSSS CW | < 0.5."}, {"section_title": "In Situ Observations of Ocean Surface Response to Hurricane Igor", "text": "In situ vertical profiles of salinity and temperature measured by Argo float profilers provide a key complementary observation. Nine Argo floats that passed the quality-control checks provided measurements before and after the storm passage in the high-wind wake of Igor (here defined by surface wind speeds greater than 34 knots during the storm). Note that the approximate 10 days sampling interval of the Argo float array resulted in a random time coverage of the individual profile measurements with respect to the date of the local highest wind encountered at the float locations. The distances traveled by the floats in Journal of Geophysical Research: Oceans"}, {"section_title": "Vertical Structure of the Ocean Within Igor Wake From Argo Profiles", "text": "The wind power index values were estimated at the barycentric coordinates of the prestorm and poststorm locations of each Argo floats. Increasing values of the WPi of 2.9, 3.1, 3.4, and 3.8 are found at floats A6, A3, A5, and, A4, respectively. Corresponding DSSTs with decreasing amplitudes of 22.8 C, 22.7 C, 22.6 C, and 20.7 C are found from the float surface data. Contrarily to the general results found in Vincent et al. [2012a] for a large number of TC around the world, both in situ and satellite measurements suggest that the cooling amplitude in Igor wake is not increasing with the wind energy input by the storm to the ocean surface. In Figure 14, we show the prestrom and poststorm vertical profiles of salinity and temperature at Argo floats A3, A4, and A5 which sampled the wake in the plume region (within left and right sides of the storm) and at float A6, located in the open-ocean waters in the storm right-hand side region with maximum cooling amplitude. As evidenced in Figure 14c, a 25 m thick BL is detected at float A4 before the storm passage, located in the central part of the plume northwestern extension. Measurements at floats A5 ( Figure 14a) and A3 (Figure 14d), which sampled the vertical structure within the plume at its north-western and north-eastern boundaries, respectively, also reveal BLs, but significantly thinner (10 m) Floats A3, A4, and A5 all exhibit strong vertical salinity gradients and wellmixed temperature above the thermocline D T-02 . By contrast, the salinity is almost constant with depth at the float A6 which is located in the open-ocean waters (Figure 14 b). At this float, the prestorm temperature and salinity are not very well mixed in the top 15 m, with weakly decreasing T and increasing S as depth increases in that layer. By virtue of our chosen definition for the top of thermocline depth and compensating effects of salinity and temperature on the density in the upper layer, D r is therefore found to be approximately at the same depth than D T-02 and no significant BL is detected at A6. Note however that the largest vertical gradient in the prestorm temperature at this float is found at 50 m depth, which shall impact the strength of the vertical stratification. In the case of Igor, the presence of a stronger salt-driven stratification on the left-hand side than on the right-hand side of the track as the storm passed across the Amazon plume might have contributed to amplify the rightward bias in SST response. Indeed, a net salinity anomaly within a fresh surface layer (thickness times salinity anomaly in the initial state) is as large as about 20 m to potentially fully inhibit vertical mixing [e.g., Price, 2009]. This threshold value is reached at float A4, where the prestorm salinity anomaly from surface to top of thermocline is 0.5 pss and D T-02 5 40 m. As the fresh surface layer of the plume is warmer than the water below, salinity stratification acts to reduce the depth of vertical mixing and thus sea surface cooling. This salt-driven stratification effect might explain partly why the surface cooling and increase in salinity are much reduced at float A4 than at floats A3 and A5, despite WPi is found largest at A4. Note however that A4 and A5 floats rose back at the surface 7-8 days after the storm passage while A3 poststorm profile measurements were conducted only 2 days after Igor (see legend in Figure 12). As the cooling amplitude in TC wakes is known to be a decreasing function of time after storm events [Lloyd and Vecchi, 2010], the varying temporal sampling of the profiling floats might also partly explain the observed differences. The reduced SST and SSS responses measured by float A4 may also result from the fact that the float was located to the left of the track. Overall, the strength of the vertical stratification can thus be invoked to interpret the measured larger SST drop found on the right-hand side of the storm at float A3 (within the plume) than at float A6 (outside northwest of the plume), despite a WPi is smaller at A6 (2.9) than at A3 (3.1). As further shown in Figure 15,   (Figure 15c) than on the right-hand side of the track where N max 516.5 cph at float A3 (Figure 15d)."}, {"section_title": "Potential Use of Satellite SSS Data to Infer Ocean Stratification Below the Plume", "text": "As recently refined [Shay and Brewster, 2010], an estimation of the ocean heat content (OHC) potential can be estimated by considering (i) a hurricane-season climatology of T(z) and (ii) a stratification parameter where N o is the reference buoyancy frequency for a given reference density. This leads to an equivalent OHC variable defined by OHC E 5OHC ffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffi that incorporates the strength of the thermocline at the base of the oceanic mixed layer and which seems better correlated to hurricane intensity change in highly stratified upper ocean area, such as the Eastern Tropical Pacific. Given the previous analysis, we investigate the capability of satellite SSS estimates to help monitor the horizontal distribution of the stratification parameter S over the Amazon river plume waters. The NODC historical 2009 database complemented by ARGO floats data from year 2010 includes 21,000 in situ profile measurements of salinity and temperature acquired within the domain (90 W-25 ; 5 S-35 N) and during the August to October period (peak of the hurricane season). To determine if the SSS and/or SST values in the plume waters can be used as proxies for the strength of the vertical stratification below the plume, SSS and SST data from the historical profiles acquired during the peak hurricane season were binned averaged   as function of the N max values (determined for each profile) within the spatial domain (70 W-25 W; 5 S-25 N), which includes most of the plume waters. As found (see Figure 16) both SSS and SST quasi-linearly vary with N max with sensitivities @SSS @Nmax -0:1 pss=cph and @SST @Nmax 10:025 C=cph, respectively. The SMOS SSS L3 products at a spatial resolution of 0.25 3 0.25 and averaged over 10 days exhibit an rms difference with in situ observation on the order of 0.5 [Reul et al., 2014]. The satellite TMI-AMSR OI SST product accuracy is on the order of 0.2-0.5 C. Given the larger dynamical range of SSS than SST over the plume waters, their respective accuracy and that the static-stability is dominated by salinity impacts in this region, SSS data from space might be considered a more sensitive proxy than SST to estimate the maximum of the vertical stratification N max below the Amazon-Orinoco river plume waters. Given such empirical approach, the spatial distribution of the N max parameter can be deduced from SMOS SSS observations before the passage of hurricane Igor over the plume waters, using: N max 52 ðSSS236:8Þ 0:1 (Figure 17). As derived, the estimated spatial distribution of N max is found to agree with the values from vertical profiles of density at ARGO floats A3, A4, and A5 (see Figure15)."}, {"section_title": "Use of SMOS SSS Data to Characterize the Cooling Amplitude in the Wake of TCs Traveling Over the Amazon-Orinoco River Plume", "text": "As the spatial extent of the river plume can vary over short time scales, the SMOS SSS data can now be used to determine whether a cooling amplitude is measure over the actual plume position or not. The Figure 18. Ensemble of the TC tracks in the North Western Tropical Atlantic over the period 2010-2012. The color background is showing (a) the averaged SMOS sea surface salinity during the hurricane season (June to November) over the three years. (b) The stratification parameter S. In both plots, the black thick curve is showing the average extent of the Amazon-Orinoco river plume (surface isohaline at 35.4) as detected by SMOS during the hurricane peak season. Journal of Geophysical Research: Oceans 10.1002/2014JC010107 ensemble of TC tracks in the North Western Tropical Atlantic over the period 2010-2012 is shown in Figure  18 together with the SMOS sea surface salinity averaged during the hurricane season (June to November) and over the 3 years. During this period, 45 named storms were detected among which 14 crossed the Amazon-Orinoco river plume. From the SMOS SSS mapping and the linear relationship previously established to infer N max , the stratification parameter S5 ffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffi , where N o is the reference buoyancy frequency is evaluated. As shown in Figures 7 and 15, N o 55 is chosen as the reference buoyancy frequency at depth in this region. Accordingly, the equivalent OHC variable defined by OHC E 5S 3 OHC takes into account the strength of the haline stratification to further differentiate the freshwater plume from the surrounding open-ocean area. With estimated S values >2 over the plume, the increased equivalent Ocean heat Content might help better explaining the observed reduced surface cooling amplitude in the wake of the storms that cross the river plume. Using TMI-AMSR microwave satellite SST data, sea surface cooling amplitude DSST CW in the wake of each storm was determined within a radius of 200 km from the storm tracks, and classified as function of their prestorm SSS value determined from SMOS data. Most of the 14 storms crossing the plume during 2010-2012 were slow storms with V/f < 1 and the number of ''fast'' storms intercepting the plume was insufficient to derive reliable statistics on DSST CW. In Figure 19, the cooling amplitude is given as function of the Saffir-Simpson scale for the slow storms. As already shown in Figure 4a, the mean sea surface cooling amplitude in the wake of North-Atlantic slow-moving Hurricane traveling across the river plume, is again systematically reduced compared to open-ocean waters."}, {"section_title": "Conclusions and Discussions", "text": "We first reanalyzed the spatial distribution of extreme atmospheric events for the North Western Tropical Atlantic region within the domain (80 W-20 W; 4 S-35 N). Considering the ensemble of storm tracks from 1950 to 2010, the number of storms that intensified locally to category 4 or 5 is found locally maximum as the TC corridor within the Main Development Region intercepts the northern tip of the Amazon-Orinoco river plume around 55 W, 18 N. Using historical SSS information on the extent of the river plume during the peak hurricane season (August to October), we investigated if the cooling amplitude detected from TMI/AMSRE SST data in Figure 19. Mean sea surface cooling amplitude in the wake of North-Atlantic Hurricane during 2010-2012 as function of the Saffir-Simpson Wind scale with error bars showing the 90% and 95% significance levels for errors in the mean. Responses estimated over open water waters (red dots) are distinguished from those evaluated within the Amazon river plume region (blue dots) using SMOS SSS data. Slow-moving (or low latitude) tropical cyclones with V/f < 1. Journal of Geophysical Research: Oceans 10.1002/2014JC010107 the wake of an ensemble of TCs is dependent, or not, on the fact that the storms travel across the neutrally stable and buoyant river plume. As analyzed, SST anomalies measured in the wake of TCs traveling over the Amazon-Orinoco plume waters are systematically reduced. For slow-moving storms, the cooling amplitude reduction over the plume waters varies from about 35% for tropical storms to within 40 to 60% for hurricanes. For fast moving storms, the impact of the plume waters on reducing the cooling amplitude increases with storm intensity, from slightly less than 20% for tropical storms and category 1 hurricanes to 50-60% for TCs with intensities above category 3. The Amazon-Orinoco plume warm waters cover the first 30 m below the surface and are contributing, on average, to 62% of the Ocean Heat Content value south of 21 N. Around 18 N, where the occurrence of extreme storm events is found locally maximum, the 26 C isotherm is the deepest within the region, reaching 70 m depth. The OHC is also found about 3 times smaller in the open-ocean region north of the river plume waters than within the latter. Histograms of the number of TC crossing the northern tip of the Amazon plume further reveal that most of the categories 4 and 5 hurricanes pass over a subsurface maxima in stratification at around 18 N. This local maximum is principally induced by a strong local vertical gradient in salinity of about 0.1 pss/m just below the base of the freshwater river plume layer. Weaker hurricanes (categories 1 and 3) do not significantly perturb the subsurface vertical stratification, and do not systematically intensify over this region. Other mechanisms must certainly be involved to explain the local intensification (such as atmospheric vertical wind shear). Yet, our results illustrate that the stratification under the plume is an important factor to maintain stable warm waters contributing to enhance the oceanic feedback mechanisms to the atmosphere for the most intense hurricanes in this area. During their northwestward travel from 30 W to 80 W within the northern TC corridor, the most intense TCs are passing above the northern tip of the Amazon-Orinoco river plume. As a result of the specific seasonality of the freshwater discharge and of the intense radiative heat flux in this area, this region is locally exhibiting a significantly higher Ocean heat Content and stronger-salinity-driven-stratification than found in the surrounding open-ocean North-West and South-East region within the TC corridor. These might be the two key oceanic processes reducing the amplitude of SST cooling in the wake of storms passing above the river plume, which might further potentially trigger an increased TC intensification in this region. Since 2010, spatial mapping of the salinity is accessible using satellite data. Analysis of the category 4 hurricane Igor that crossed the river plume demonstrates that satellite SSS can serve as a useful complementary data set for improved characterization of the atmosphere-ocean coupling in tropical cyclones. In particular, not only SST cooling but also SSS upwellings are now accessible in the wake of TCs. For Igor, satellite estimates compare very well to in situ observations. Combined Argo vertical profile and satellite measurements in Igor wake clearly evidence the plume haline stratification impact on the cooling inhibition. As analyzed, the reduction of the cooling amplitude in the wake of a TC passing over the river plume apparently depend upon the local strength of the wind stresses and of the local subsurface properties (thickness of the BL, depth of the D 26 and strength of the vertical stratification). Over this particular region, the SSS mapping capability has thus been tested to monitor the horizontal distribution of the stratification parameter S over the Amazon river plume waters. Using NODC historical 2009 database complemented by ARGO floats data from year 2010, links are robustly established between the SSS and the SST values in the plume waters and the strength of the vertical stratification below the plume. Given its largest dynamical range, SSS appears as a more sensitive proxy than SST to estimate the maximum of the vertical stratification N max below the Amazon-Orinoco river plume waters. Over this region, satellite SSS can be now used to regularly map the stratification parameter S5 ffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffi N max =N o p and to further modulate the OHC estimates. With the availability of satellite observations of SSS from Aquarius and SMOS, along with satellite SST, and in situ ARGO measurements, this methodology can certainly be extended to other regions, to further map freshwater transports and to analyze the resulting salinity stratification role in rapid mixed layer dynamics. The combined surface and interior measurements, especially identifying persistent large SSS gradient regions, shall then certainly help to gain new insights about air-sea coupling under extremes. Journal of Geophysical Research: Oceans 10.1002/2014JC010107"}]