[{"section_title": "Abstract", "text": "Background: APOE 4 and sex have been linked to increased risk for conversion to Alzheimer's disease (AD). However, the relationship between APOE 4 gene dose, sex, and AD biomarkers remains understudied. Objective: To investigate the effect of APOE 4 dose on AD biomarkers in a sample of older adults with mild cognitive impairment (MCI), and to examine whether APOE 4 dose modifies AD risk differently in MCI women and men. Methods: We examined cross-sectional AD biomarkers for participants with MCI (n = 930, 55-96 years old) from three large aging cohorts. Region of interest MRI volumes, global cognition, and episodic memory were analyzed by number of APOE 4 alleles and stratified by sex. Results: Across all participants, number of APOE 4 alleles was associated with smaller hippocampal and amygdala volumes and poorer cognition. When stratified by sex, women showed an APOE 4 dose effect for bilateral hippocampal and left amygdala volumes and cognition. In contrast, men showed an APOE 4 dose effect for hippocampal volumes with a trend in amygdala, but cognition did not differ between men with 1 and 2 APOE 4 alleles. Women with 2 APOE 4 alleles had poorer memory between 65-69 and poorer global cognition between 70-74 compared to men with 2 APOE 4 alleles. # Last authorship.\nConclusion: APOE 4 confers a dose effect on AD biomarkers in patients with MCI, and the number of APOE 4 alleles has a greater detrimental impact in women than men, which may be specific to a critical time window."}, {"section_title": "INTRODUCTION", "text": "Alzheimer's disease (AD) is the most common form of dementia. Currently, there are no effective treatments for AD, creating a critical public health concern [1]. Because it is likely that effective therapies will require early intervention, understanding the role of AD risk factors, such as apolipoprotein E 4 (APOE 4) and sex, is critical for identifying individuals who are at greatest risk [2] .\nThe greatest known genetic risk factor for lateonset sporadic AD is the APOE 4 allele [3] . APOE 4 is more prevalent in people with AD compared to cognitively normal individuals [4, 5] , and extensive research has demonstrated that relative to APOE 3, APOE 4 significantly increases the risk of developing mild cognitive impairment (MCI) [6] and AD [7, 8] . One APOE 4 allele increases risk by 2-to 3-fold, and 2 alleles increase risk by 10-fold [5, 9] . While a number of studies have shown that AD risk increases as the number of APOE 4 alleles increases [5, 10] , few have examined the effect of APOE 4 dose on specific biomarkers for AD. Evidence for an APOE 4 dose effect on cognitive and MRI biomarkers is needed.\nFemale sex is another major risk factor for AD [11] . Studies that have examined the interaction between APOE 4 and sex suggest that women may be more adversely affected. Indeed, 1 APOE 4 allele has been shown to increase lifetime AD risk in women, whereas 2 APOE 4 alleles increased lifetime risk in men [5] . Similar APOE 4 by sex effects have been observed for hippocampal volumes [12] . A recent meta-analysis of approximately 58,000 subjects reported a critical time window starting at 65 years old in which women with APOE 4 are at greater risk of conversion than men with APOE 4 [13] . Another recent paper examined the longitudinal differences between men and women and the effect of APOE 4 status across the AD spectrum on hippocampal volume, cognition, and association with cerebrospinal fluid (CSF) biomarkers of tau and amyloid [14] . The findings from this study suggest pronounced sex differences exist within the MCI stage, motivating additional explicit examination of this phase of disease progression.\nIn the present study, we examined the effects of APOE 4, sex, and their interaction on MRI brain volumes and cognition in a sample of older adults with MCI [15] via within-sex and between-sex analyses."}, {"section_title": "METHODS", "text": ""}, {"section_title": "Study design", "text": "De-identified and coded data from 930 participants with MCI between 55-96 years old were acquired with permission from three aging cohorts: The Alzheimer's Disease Neuroimaging Initiative (ADNI), the National Alzheimer's Coordinating Center (NACC), and the Australian Imaging, Biomarker & Lifestyle Study (AIBL). This study was approved by our local institutional review board as non-human subjects research. Subjects with a baseline diagnosis of MCI with a probable etiology of AD were included. APOE 4 carriers who may have conferred protection from AD [16] were excluded from the analysis to include only those who were APOE 3/3, APOE 3/4, and APOE 4/4. Participants with no available diagnosis, genetic information for APOE, imaging and cognitive data, less than 6 years of education, or possible co-enrollment across cohorts were excluded. Variables were harmonized across datasets. For example, education was binned into 4 groups to enable comparison with the AIBL dataset: 6 to 8 years, 9 to 12 years, 13 to 15 years, and 15 + years."}, {"section_title": "Datasets", "text": "Data from the ADNI (n = 723), NACC (n = 121), and AIBL (n = 86) cohorts were aggregated to create the final dataset for analysis (n = 930). ADNI was launched in 2003 as a public-private partnership with the primary goal of testing whether serial collection of imaging, biomarker, clinical, and neuropsychological data can be combined to measure the progression of MCI and early AD [17] . AIBL is an ADNI collaborative study established in the Australian cities Melbourne and Perth in 2006 in order to assemble a cohort of individuals who could be assessed at regular intervals for AD [18] . NACC was established by the National Institute on Aging in 1999 to sup-port collaborative research in AD from participants at 34 past and present NIH-funded Alzheimer's Disease Centers (ADCs) [19] .\nAll three cohorts collect imaging, genetics, cognitive, and biological biomarker data, and evaluate enrolled participants approximately every 12-18 months with a comprehensive cognitive battery and clinical assessment. Diagnostic classification for study participants in the ADNI and AIBL cohorts are determined by a clinician or physician, and diagnoses are monitored by a clinical review committee to ensure uniform application of the diagnostic criteria across sites. NACC aggregates data from multiple ADCs, and diagnoses are made either by a physician or by a consensus committee, according to each ADC's protocol. A detailed description of how MCI is determined for each cohort is included in the Supplemental Materials. ADNI, AIBL, and NACC data collected between August 2005 and October 2014 were included in this study."}, {"section_title": "Brain imaging and quality control", "text": "Baseline T1-weighted MPRAGE MRI images from both 1.5T and 3T scanners were downloaded with authorization from ADNI, AIBL, and NACC databases and processed using FreeSurfer software version 5.3.0 (http://surfer.nmr.mgh.harvard.edu, Boston, MA) [20] . Hippocampal volumes were selected a priori as the region of interest based on its relevance to cognition and AD. Exploratory MRI analyses included total gray matter brain volume and five additional brain regions in medial and lateral temporal lobes that have shown sex and APOE differences [51] that are affected in early AD [21] [22] [23] . All hippocampal output volumes were visually inspected and scored by two experienced raters using ITK-SNAP software version 3.4.0 (http://www.itksn ap.org) for accuracy [24] . Segmentations failed if a substantial segmentation error was identified, defined as an unambiguous mislabeling of a substantial portion of the total volume. 131 (14.1%) subjects were excluded from the analysis for poor segmentation accuracy. Subjects who failed quality control or had more than 12 months between cognitive and MRI acquisition were excluded from hippocampal analyses but included in the cognition analyses."}, {"section_title": "Cognitive tests", "text": "Baseline scores from the Mini-Mental State Examination (MMSE) [25, 26] and Immediate Recall and Delayed Recall from the Wechsler Memory Scale -Revised (WMS-R) [27] Logical Memory tests were examined as measures of global cognition and episodic memory, respectively. These were the common cognitive tests available across the cohorts. APOE 4 gene dose APOE 4 dose was defined as the number of APOE 4 alleles (0, 1, or 2) carried by a participant. An APOE 4 dose effect was defined as a significant difference that corresponded with the number of APOE 4 alleles, in which the effect was significant between 0 versus 1 allele, and 1 versus 2 alleles. By this definition, each APOE 4 allele had a significant, measurable effect on the biomarker and thus may have increased AD risk."}, {"section_title": "Statistical analysis", "text": "Analysis of covariance (ANCOVA) was used to assess the effect of number of APOE 4 alleles on MRI brain volumes and cognition using SPSS version 25. Main effects of APOE 4 dose and sex in the entire sample was assessed, along with main effects of APOE 4 dose when stratified by sex and 5-year age bins. Cohort, baseline age, and education were included as covariates. Total intracranial volume and scanner field strength were also included as covariates when analyzing brain volumes. Post-hoc pairwise comparisons were used to examine group differences based on the number of APOE 4 alleles. Because of our a priori hypothesis that APOE 4 effects may differ by sex, brain volumes, and cognition were examined separately for women and men. Post-hoc pairwise comparisons of brain volumes and cognition by APOE group were tested via withinsex and between-sex analyses. Additionally, APOE 4 effects across the aging spectrum were examined at each 5-year period, separately for women and men, and predicted values for cognition were derived from models with factors for age, APOE 4, cohort, and education. Sex and APOE 4 dose-dependent effects are expected to be subtle, especially given the low prevalence of 4/4 carriers, therefore results were not corrected for multiple comparisons."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Participant demographics", "text": "Demographic data for the study population by APOE 4 genotype are summarized in Table 1 . Par- ticipants were predominately white (84%). The ratio of women:men did not differ significantly by APOE 4 group (p = 0.75). Average years of education did not differ by APOE 4 group (p = 0.79); however, the average years of education was significantly higher for men than for women (p = 0.001). Age differed significantly by APOE 4 genotype (p < 0.001). Participants with 1 APOE 4 allele were younger than those with 0 APOE 4 alleles (p = 0.026) and those with 2 APOE 4 alleles were younger than those with 1 APOE 4 allele (p = 0.001). Participant demographics are also shown separated by cohort in Supplementary Table 1 ."}, {"section_title": "Biomarkers across all participants Hippocampus", "text": "There was a main effect of APOE 4 dose for left and right hippocampal volumes, our a priori ROI (left & right, p's < 0.001). Post-hoc tests showed smaller left and right hippocampal volume with each APOE 4 allele in a dose-dependent manner (0 > 1 > 2, all ps < 0.001) ( Fig. 1 ).\nAmong the exploratory MRI volumes, a main effect of APOE 4 was also seen bilaterally in the amygdala (p < 0.0001) ( Fig. 2, Supplementary  Table 2 ). Post-hoc tests showed a dose-dependent response in the left (0 > 1 > 2, p ≤ 0.001) and right (0 > 1 > 2, p < 0.05) hemispheres. No dose dependent differences were seen in the other brain regions (Fig. 2) . Effect size, standard error (SE), and significance are reported in Supplementary Table 2 for all ROIs."}, {"section_title": "Cognition", "text": "For cognition, there was a significant main effect of APOE 4 dose on MMSE, Immediate Recall, and Delayed Recall across all participants (all ps < 0.001) ( Fig. 1) . Post-hoc comparisons showed that worse performance on MMSE and Delayed Recall was associated with each APOE 4 allele in a dose-dependent manner (0 > 1 > 2). Participants with 1 APOE 4 allele had significantly worse cognitive performance on all tests than non-carriers (all ps < 0.001), and participants with 2 APOE 4 alleles had significantly worse performance than those with one allele on MMSE and Delayed Recall (all ps < 0.05)."}, {"section_title": "APOE 4 dose effects", "text": ""}, {"section_title": "Between-sex analyses", "text": "For age, between-sex analyses showed there was no difference between women and men with no APOE 4 alleles (p = 0.57). However, women with 1 APOE 4 allele were younger than men with 1 APOE 4 allele (p < 0.001). Similarly, women with 2 APOE 4 alleles were younger than men with 2 APOE 4 alleles (p = 0.03).\nFor between-sex analyses of hippocampal volume, left hippocampal volumes were significantly smaller for women than men with 1 APOE 4 allele, while right hippocampal volume was significantly smaller for women than men with 0, 1, or 2 APOE 4 alleles (all ps < 0.05). Sex-differences were also observed in the left and right amygdala for women with 0, 1, and 2 APOE 4 alleles relative to men (all ps < 0.002). No dose dependent effects (0 versus 1 versus 2) were observed in other ROIs (Fig. 2 , Supplementary  Table 2 ).\nFor cognition, delayed recall differed by sex, such that women with 2 APOE 4 alleles had lower delayed recall scores than men with 2 APOE 4 alleles (p = 0.005). A trend for the same pattern was observed for men and women with 1 APOE 4 allele (p = 0.078) There were no sex-specific differences on MMSE or immediate recall."}, {"section_title": "Sex-stratified analyses", "text": "Sex-stratified analyses showed an APOE 4 dose effect of age for women with 1 or 2 APOE 4 alleles compared to women with 0 APOE 4 alleles (all ps < 0.0001), but no age difference between women with 1 and 2 APOE 4 alleles (p = 0.19). Men were only of a younger age if they had 2 alleles when compared to men with 1 APOE 4 allele (p < 0.005).\nWhen stratified by sex, the APOE 4 dose effect on hippocampal volumes remained significant for both women and men, separately (all ps ≤ 0.05). No differences were observed between left and right hippocampal volumes, so analyses combined left and right hippocampi. In women, post-hoc analyses showed that those with 1 APOE 4 allele had smaller hippocampal volumes than those with 0 APOE 4 alleles, and those with 2 APOE 4 alleles had smaller hippocampal volumes than those with 1 APOE 4 allele (all ps < 0.05). Men showed a similar pattern, such that those with 1 APOE 4 allele had smaller hippocampal volumes than those with 0 APOE 4 alleles, and those with 2 APOE 4 alleles had smaller hippocampal volumes than those with 1 APOE 4 allele (all ps < 0.05) (Fig. 3) . The above analyses were repeated using a residual normalization method for the left and right hippocampi against intracranial volume, and the significance of the results remained unchanged.\nIn women, an APOE 4 dose dependent volumetric difference was observed in the left amygdala, such that women with 1 APOE 4 allele had smaller volumes than women with 0 APOE 4 alleles (p = 0.016) and women with 2 APOE 4 alleles smaller than women with only 1 APOE 4 allele (p = 0.019). For women with 1 APOE 4 allele compared to women with 0 APOE 4 alleles, smaller volumes were observed in the right amygdala, left and right inferior parietal cortex, the right middle temporal lobe, and in total brain volume (all ps ≤ 0.05; Fig. 2 ; Supplementary Table 2 ). In men, the left and right amygdala were smaller for men with 1 APOE 4 allele than men with 0 APOE 4 alleles (all ps < 0.05; Table 2 ). No other APOE 4 dose differences in the other brain regions were observed for men.\nSex-stratified analyses showed that women had a significant APOE 4 dose effect, with lower scores with each APOE 4 allele for all cognitive tests (all ps, p < 0.05). In contrast, men showed lower scores for those with 1 APOE 4 allele compared to those with 0 APOE 4 alleles for all cognitive tests (MMSE: p = 0.011, Immediate Recall: p = 0.015, Delayed Recall: p = 0.004); however, there was no difference in cognition between men with 1 or 2 APOE 4 alleles (Fig. 4) ."}, {"section_title": "Age-specific effects", "text": "Based on our recent work demonstrating a relationship between APOE 4 status, sex, and age [13] , we examined the effect of age and APOE 4 on our biomarkers. There was no significant age by APOE 4 interaction on the AD biomarkers (all ps > 0.14). In age-stratified analyses of 5-year bins, there was a trend for an APOE 4 by sex interaction on delayed memory in those 65-69 years of age (p = 0.09). Additionally, there was a trend for an APOE 4 by sex interaction on the MMSE for those 70-74 years of age (p = 0.06). Post-hoc analyses in this age group showed that women with 2 APOE 4 alleles performed worse than men with 2 APOE 4 alleles on delayed memory (65-69 years, p = 0.047) and MMSE (70-74 years, p = 0.004) ( Fig. 5 ). There were no significant differences at the other 5-year age bins."}, {"section_title": "DISCUSSION", "text": "Understanding the contribution of number of APOE 4 alleles and how these effects are mod- ified by sex and age is important for determining AD risk [28, 29] . In the present study, we showed an association between number of APOE 4 alleles and the AD biomarkers for hippocampal and amygdala volume and cognition in older adults with MCI, providing insight into those at risk for AD. Importantly, we demonstrated that the effect of APOE 4 dose on cognition differs by sex and preliminary, exploratory analyses suggest that cognitive differences for women compared to men exist between 65-69 for episodic memory and between 70-74 for global cognition. While APOE 4 dose is associated with smaller hippocampal volume in both sexes, 2 APOE 4 alleles may have a greater impact on cognition in women than in men.\nAcross all participants, those with 2 APOE 4 alleles were significantly younger than those with 1 APOE 4 allele who were younger than those with 0 APOE 4 alleles, suggesting that APOE 4 may shift risk of AD earlier. However, this effect was modified by sex, showing men with 2 APOE 4 alleles were younger than men with 0 or 1 APOE 4 allele, while women with 1 or 2 APOE 4 alleles were significantly younger than women with 0 APOE 4 alleles.\nPrevious research has demonstrated an APOE 4 dose effect of increased AD risk and undesirable changes to a variety of AD biomarkers in participants with MCI. APOE 4 carriers with MCI are at increased risk of converting to AD [30] , have poorer cognitive function [12, 31, 32] , smaller hippocampal volumes [12, 31, 33, 34] , lower CSF amyloid-␤, higher CSF hyperphosphorylated tau [35] and higher total tau [14] . Our study expands this work to examine how APOE 4 dose and sex modify risk based on AD biomarkers.\nOur general finding of a significant APOE 4 dose effect on hippocampal and amygdala volumes in this sample of individuals with MCI suggests that each APOE 4 allele has a measurable effect on regional brain structure. While not all studies have found this [36] , our result is supported by previous research which found reduced hippocampal volume [33] and cognition [31] with each APOE 4 allele and reduced amygdala volume for APOE 4 carriers versus non-carriers [36, 37] in individuals with MCI. Furthermore, our results show that, while there was a significant APOE 4 dose effect on hippocampal and amygdala volume for both men and women, Fig. 5 . Predicted values for cross-sectional data of Global Cognition and Episodic Memory by APOE 4 allele and sex. Predicted values generated from cross-sectional data for global cognition (MMSE, A) and episodic memory (Logical Memory Immediate, B and Delayed Recall, C), separately for men and women. Lines represent intercept and slope of predicted values over the lifespan, grouped by number of APOE 4 alleles. Women with 2 APOE 4 alleles performed worse than men with 2 APOE 4 alleles on delayed memory (65-69 years, p = 0.042) and MMSE (70-74 years, p = 0.002) at specific 5-year age bins. the same was not true for cognition. In our analysis of cognitive performance, women had worse performance with each APOE 4 allele, while men with 1 and 2 APOE 4 alleles did not differ, suggesting a differential impact of APOE 4 allele between the sexes on cognition. Importantly, at 1 and 2 APOE 4 alleles performance on delayed memory was significantly worse for women than men, even though women were also significantly younger.\nTo date, the effects of APOE 4 dose on brain structure and cognition, two important AD biomarkers, have not been demonstrated conclusively in women and men. The research predominantly informing current views on the interaction between APOE 4 and sex reports differences in AD risk. These studies reported that APOE 4 confers greater AD risk to women than men. Specifically, it has been reported in a number of studies that one copy of the 4 allele is sufficient to increase AD risk in women, whereas two copies but not one, increase risk in men [5, 7, 9, 38, 39] . A similar finding was demonstrated by Fleisher et al., who reported an APOE 4 by sex interaction in the hippocampal volume of MCI subjects [12] . Recent studies reported that women with higher amyloid burden were at greater risk of cognitive decline than men and that this effect was even stronger in women who were APOE 4 carriers [14, 40] . Additionally, women who were APOE 4 carriers had greater tau burden than men who were APOE 4 carriers [14] , especially in those who had significant amyloid burden [41] . New genetic targets associated with amyloid and tau pathology have been implicated in women's risk for AD, suggesting that the sex differences may extend beyond APOE 4 [42] .\nWhile previous research suggests that APOE 4 relates to AD risk differently for women and men, a recent meta-analysis by our group reported that women and men had nearly the same risk of developing MCI or AD between 55-85 years of age [13] . However, a critical period of risk for APOE 4 women to convert to MCI was found between 55-70 years of age whereas APOE 4 women to convert to AD were at elevated risk between 65-75 years of age. This study, which aggregated data for nearly 58,000 participants, suggests that the sex-specific effect of APOE 4 may not differ, but that sex differences are evident at critical time periods. Although preliminary and exploratory in nature, the trends in our current findings support this critical period in women with 2 APOE 4 alleles compared to men with 2 APOE 4 alleles between 65-69 years of age in delayed memory performance. Additionally, this same relationship was identified for global cognition, but for those 5 years older, between 70-74 years of age, positing a temporal relationship of differences in memory preceding differences in global cognition, although this cannot be directly assessed in our cross-sectional analysis.\nPotential mechanistic explanations for the consistent sex and APOE 4 differences may be related to hormonal changes experienced by women during menopause, which has cascading effects in the subsequent aging process. Higher levels of estradiol are associated with better cognitive performance [43] and estrogen has been shown to reduce vulnerability to cell death in the hippocampus in the presence of amyloid-␤ [44] , which may be exacerbated in APOE 4 carriers because of higher amyloid-␤ burden [45, 46] .\nA primary strength of our study is the direct, intentional analysis of sex differences in AD by utilizing large, retrospective datasets to examine subtle and understudied effects. Obtaining and harmonizing large datasets to increase the sample of participants with 2 APOE 4 alleles was a necessary task to examine APOE 4 dose effects stratified by sex and age, although the study was underpowered for multiple comparison correction likely due to subtle sex and APOE 4 dose effects. However, there are limitations to conducting retrospective analyses. Many aging cohorts have only a limited number of cognitive tests available for analysis. There is some variability in how MCI is defined (see Supplementary Materials) . Other risk factors that may differ between women and men, such as smoking, alcohol use, and cardiovascular disease [47] , were not available in all the datasets and therefore, not included in our models. Other sex-specific considerations may also be contributing to this, such higher rates of mortality due to cardiovascular disease and stroke in men that might lead to a surviving population of older adult men who are healthier than their female counterparts [48] . Additionally, ascertainment bias poses several problems for population-based studies. For example, our cohort is enriched for APOE 4 carriers beyond what is observed in the general population. Individuals with a family history of AD may be more likely to participate [49] , and importantly, these studies may oversample healthier individuals due to the difficulty for sick participants to participate in follow up data collection [50] . Lastly, the combination of 1.5T and 3T MRI scans is less favorable than MRI scans from the same scanner and/or MRI field strength.\nOur findings, taken together with previous literature, support the hypothesis that detrimental effects conferred by APOE 4 are dose-dependent and sexspecific in the MCI stage. While the importance of APOE 4 is key to understanding AD risk, sex as a biological factor may additionally modify level of risk at critical time periods."}]