[{"section_title": "Abstract", "text": "Strong surface winds of a hurricane locally cool the surface and warm the subsurface waters via turbulent mixing processes. While the surface cool anomalies generally decay in roughly a month, the warm subsurface anomalies can persist over a seasonal cycle. The authors examine questions related to the magnitude and cumulative footprint of subsurface warm anomalies forced by tropical cyclones during the combined global tropical cyclone seasons, making use of a global ocean model forced by tropical cyclones.\nSimulations of the 2004/05 tropical cyclone season are conducted with and without tropical cyclone wind forcing, blended with the daily Coordinated Ocean-Ice Reference Experiments (COREs) atmospheric state. Physical characteristics of cyclone-forced surface and subsurface anomalies are elucidated. In particular, the spatial extent and magnitude of tropical cyclone-forced subsurface warm anomalies over the course of an entire season are examined. This analysis permits the estimation of the contribution of cyclone-induced anomalies to the ocean heat content and sea surface temperature, aiding in understanding anomalous meridional heat transport.\nGlobally, there is a maximum accumulated heat uptake 4.1 3 10 21 J, with the greatest regional contributions in the North Atlantic (1.7 3 10 21 J), west Pacific (1.5 3 10 21 J), and east Pacific (1.7 3 10 21 J). An export of heat from the subtropics to the tropics via rapid advective pathways is found, most notably in the west Pacific. These warm anomalies tend to remain in the equatorial band, with potential implications for the tropical climate system."}, {"section_title": "Introduction", "text": "Tropical cyclones (TCs) are highly coherent, intermittent, and intense wind and precipitation events, notable for their ability to induce strong vertical oceanic mixing over the course of their lifetime. TCs are defined by their cyclonic winds, which increase from nearly zero to magnitudes exceeding 70 m s 21 at a radius of maximum wind on the order of 50 km before decreasing over several hundred kilometers. Strong sea surface temperature (SST) cooling associated with TC passage over the ocean produces a well-understood cold wake due to vertical mixing of mixed layer and upper thermocline waters (Price 1981) , and anomalous surface buoyancy fluxes and upwelling induced by the strong wind stress curl.\nSST returns to its climatological value within 30-40 days regardless of storm intensity (Dare and McBride 2011) , with local restoration due to anomalous heat flux associated with SST cooling (Price et al. 2008) . Furthermore, restoration of the shallow cooling takes place over similar time scales, although full climatological mixed layer (CML) restoration takes several months (Park et al. 2011; Price et al. 2008) . However, the subsurface warm anomalies decay over much longer time scales (Pasquero and Emanuel 2008 ) since they are not subject to the same restoration processes as the mixed layer cold anomaly. Emanuel (2001) estimated that the restoration of an idealized cold wake could result in the introduction of up to 5 3 10 21 J of anomalous ocean heat uptake (OHU) . Extending this analysis to an idealized modeling study he hypothesized that a full year of TC activity could produce an annual mean OHU rate of 1.4 6 0.7 PW.\nStudies since Emanuel (2001) have attempted to refine the magnitude of TC-induced ocean heating based on global observations from remote sensing instruments. Sriver and Huber (2007) used satellite SST and ocean reanalysis to derive a mean annual TC-induced OHU rate of 0.26 PW, later revised to a peak value of 0.6 PW and accompanying 60% increase in ocean heat transport (OHT) based on refined estimates of mixed layer (ML) deepening (Sriver et al. 2008) . Jansen et al. (2010) utilized SST and sea surface height (SSH) satellite observations, and ML depth and stratification from ocean reanalysis, to estimate a mean annual seasonal thermocline heat deposition rate of 0.58 PW, which may produce a comparable OHU. Jansen et al. (2010) hypothesized that the magnitude of persistent TC heat pumping is systematically overestimated on interannual time scales, with upperthermocline warm anomalies entrained into the winter ML and reventilated to the atmosphere. Accounting for this heat release results in a mean annual OHU rate of 0.15 PW, a 75% reduction of their previous estimate. Shoaling of upper thermocline warm anomalies by baroclinic ML instabilities enhances this reventilation, a process unaccounted for in most observational estimates (Jansen et al. 2010; Boccaletti et al. 2007 ). Pasquero and Emanuel (2008) found that equatorial upwelling also releases TC OHU to the atmosphere. Using gridded SSH measured from satellites, Mei et al. (2013) derived a global annual OHU of 1.01 6 0.46 3 10 22 J and a mean annual rate of 0.32 6 0.15 PW from the thermal expansion needed to account for TC-induced SSH anomalies.\nArgo float data have recently been used to directly quantify TC OHU. Park et al. (2011) used pre-and poststorm float pairs to estimate TC-induced OHU, finding that storms of category 3 or less (;85% of annual TCs) produce no detectable subsurface warming, with the remaining storms producing an OHU rate of ;0.19 6 0.03 PW. The spatial and temporal sparseness of in situ observations in relation to storm tracks, effects of Ekman pumping, inertia-gravity waves, and other background variability make the accurate quantification of TCinduced OHU from these observations quite difficult.\nNumerical modeling studies with varying levels of dynamic and thermodynamic idealization have also been used to study the magnitude and mechanisms of TC OHU. Pasquero and Emanuel (2008) used a 48 horizontal resolution ocean general circulation model (OGCM) with specified mixing to 75 m, equivalent to a 25-m deepening of the ML, resulting in 1.1 3 10 22 J of OHU over 12 months of model integration, from which we estimate a mean annual rate of 0.35 PW. Approximately 50% of this heating persisted through the winter, while anomalies from mixing down to 155 m had ;80% retention. Sriver and Huber (2010) specified realistic TC wind forcing derived from Quick Scatterometer (QuikScat) data in a 3.68 zonal by 1.58 meridional resolution OGCM. By doubling and tripling the TC winds, mean OHU rates varied from 0.1 PW to 0.3 and 0.8 PW respectively, during 500 years of model integration. Anomalous heat transport was predominantly into the tropics, warming the upper 300 m of the tropical Pacific, with much of the heat deposited in the Equatorial Undercurrent (EUC).\nEnhanced diffusivity of k ; 1 cm 2 s 21 has been used as a proxy for TC wind forcing. Manucharyan et al. (2011) used this method in the upper 200 m of the ocean between 88 and 408 latitude in a 1.258 zonal and 0.258-18 meridional resolution OGCM. Enhanced mixing was applied uniformly in time, seasonally, and as discrete multiday events repeated over 200 years of model integration, with the resulting OHU producing an average ;0.2 PW of poleward and equatorward OHT over the last 25 years of simulation. Forcing was found to be most effective when applied during the local summer, demonstrating sensitivity to temporal variability in TC activity. Jansen and Ferrari (2009) demonstrated a sensitivity to the meridional distribution of TC forcing in a 2.88 resolution OGCM by introducing an enhanced diffusivity uniformly between 318N/S, with gaps imposed between 11.28N/S and 5.68N/S. Increases in poleward OHT reached values of 0.24 PW with no equatorial gap, which decreased to ;0.175 and ;0.15 PW with increasing gap size during their 100-yr analysis timeframe. These gaps also allow for enhanced OHT into the tropics of ;0.15 and ;0.25 PW, respectively. Scoccimarro et al. (2011) used a coupled oceanatmosphere general circulation model with a 28 resolution ocean, finding a 35% increase in equatorward OHT between 08 and 188N (;0.5 PW), a 5% increase in poleward OHT between 188 and 408N (;0.1 PW) attributed to the presence of TCs during their 120-yr experiment. While their 3 /48 resolution atmosphere reproduced the climatology of TC distribution and movement, it underestimated the annual frequency by ;15%, with a bias toward weaker storms. Jullien et al. (2012) conducted a finer-resolution ( 1 /38) regional study in the South Pacific, with surface forcing from global Weather Research and Forecasting (WRF) model output with and without TCs. They derived a regional OHU rate of ;0.015 PW during the southern TC season, with an attenuation of ;0.009 PW over the winter. This region is subject to 10%-15% of global TC activity, and of those the WRF forcing contains fewer major TCs than observed.\nRecently, Vincent et al. (2013) used a 1 /28 OGCM initialized from World Ocean Atlas climatology and forced with winds from version 2.0 of the Coordinated Ocean-Ice Reference Experiments (CORE-II) and synthetic vortices based on the International Best Track Archive for Climate Stewardship (IBTrACS) record and Willoughby et al. (2006) wind profile formulation to explore the impact of TCs on the mean ocean state. They found broad cooling in the mixed layer, with underlying warming and cooling in the upper thermocline due to mixing and upwelling/downwelling, and offsetting warming and cooling deeper in the water column due only to upwelling/downwelling. They attempted to account for cooling from enhanced fluxes during TC passage offsetting the impact of mixing-induced OHU, as well as fall/winter release of heat anomalies to the atmosphere via surface heat fluxes. They quantified the average 3D response in various regions, finding subsurface warming in the subtropical northwest Pacific down to nearly 200 m underlying cooling to ;40 m. They found that ; 1 /4 of TC heating is transported out of its region of generation, with ;40% released locally during winter ML deepening and ; 1 /3 compensated by loss of heat to the atmosphere during TC passage. Meridional OHT was derived from a surface flux-based overturning, with all anomalous heat moving on average from latitudes of net input to those of heat release, displaying a transport from the subtropics poleward to the midlatitudes, and equatorward to the deep tropics. This assumed a quasi-steady-state response interannually, and stressed the importance of dynamical effects over mixing in many cases for heat transport.\nWe expand on previous studies of this topic using a global ocean-ice general circulation model of finer resolution than those used in previous studies, with realistic TC surface boundary conditions. In this way, we hope to better understand the rate and magnitude of TCinduced OHU over intraseasonal and interseasonal time scales, both globally and in the individual ocean basins. Specifically, we will enumerate and contextualize this heat uptake for a single year, explore its regional climate significance, and detail likely pathways and time scales that dictate the export of heat from the dominant TC forcing regions."}, {"section_title": "Methods", "text": ""}, {"section_title": "a. The ocean model", "text": "We use the Geophysical Fluid Dynamics Laboratory's (GFDL's) Modular Ocean Model (MOM), version 4 (Griffies 2009 ). MOM is a hydrostatic primitive equation ocean model configured using a Boussinesq approximation with a free surface algorithm and coupled to the Sea Ice Simulator (SIS) ice model to handle processes in the high latitudes. We utilize an ocean-ice configuration with its resolution taken from the GFDL Climate Model version 2.5 (CM2.5) documented in Delworth et al. (2012) . The horizontal resolution varies from 28 km at the equator to 8-11 km at high latitudes. The model has 50 vertical levels, 23 of which are in the upper 500 m of the ocean.\nThe upper ocean mixing and restratification is of particular importance in evaluating the ocean's response to TCs. Vertical mixing of tracers and momentum is handled by the K profile parameterization (KPP) boundary layer scheme (Large et al. 1994) , which computes enhanced mixing within a boundary layer depth determined according to a bulk Richardson number. Mixing of tracers also arises in regions of negative surface buoyancy fluxes from a nonlocal transport term proportional to surface boundary heat and salt fluxes. Beneath the boundary layer, tracer mixing arises due to parameterized shear instability, tide-induced mixing, double diffusion, and convection due to gravitational instabilities. The parameterized mixing is thus highly variable in both space and time, producing mixing that is strongly dependent on the applied surface forcing. MOM parameterizes the effect of submesoscale mixed layer eddies according to Fox-Kemper et al. (2011) , with these eddies enhancing the ventilation of TC warm anomalies (Jansen et al. 2010 )."}, {"section_title": "b. Air-sea fluxes and TC forcing", "text": "The ocean model is forced with air-sea boundary conditions as in the CORE-II experiments described by Griffies et al. (2009) . The prescribed atmospheric state is from the corrected interannual forcing product (Large and Yeager 2009 ) with a 18 resolution, providing sea level pressure, air temperature, specific humidity, and zonal and meridional winds at 10 m every six hours; daily average values for incoming shortwave and longwave radiation; and monthly averages of liquid and frozen precipitation rates. The CORE-II winds are relatively coarse, so that TC winds are poorly resolved, if present at all. As an example, the strong winds in the compact TC eyewall region of category 4 Hurricane Frances (here on 1 September 2004 north of Hispaniola), critical for producing ocean mixing, are entirely absent (Fig. 1a ).\nIn this study we introduce two changes to the CORE-II boundary conditions. First, the parameterization of the drag coefficient, C D , is modified for strong winds. The linear relationship between wind speed and C D (Large and Yeager 2004) used in CORE-II greatly overestimates the wind stress for high wind speeds, particularly those present in tropical cyclones (Powell et al. 2003; Moon et al. 2007) . The high C D values result in unrealistically intense vertical mixing ). For wind speeds greater than 12.5 m s 21 , we replace the Large and Yeager (2004) parameterization with the formulation of Moon et al. (2007) , empirically derived from coupled wave-wind model simulations in hurricanes. The hybrid drag coefficient increases more slowly than in Large and Yeager (2004) and levels off for wind speeds greater than 40 m s 21 .\nSecond, we modify the CORE-II winds by introducing synthetic TCs based on the National Hurricane Center (NHC) and Joint Typhoon Warning Center (JTWC) Tropical Cyclone Vitals Database (TCVitals). This database contains cyclone location, intensity, and structure information, generated in real time by forecasters (Tables 1 and 2). TCVitals data are used to initialize cyclones in operational forecasting models. We use TCVitals data because they contain parameters such as radius of maximum wind, radius of last closed isobar, and the radii at which winds reach values of 18 and 26 m s 21 in the northeast, southeast, southwest, and northwest quadrants of the storm (extended structure data), which are not consistently available for all basins from the IBTrACS or NHC's North Atlantic hurricane database (HURDAT2). While there are statistical biases in storm intensity (;0.25-1 m s 21 ) and location (0-5 km) compared to the best-track database (Trahan and Sparling 2012) , these errors should have negligible impact on the results of this study.\nAir-sea heat fluxes are calculated from bulk formulas as described in Griffies et al. (2009) . No explicit SST restoration is applied. Surface heat fluxes are allowed to freely evolve under the specified atmospheric state and respond to both the enhanced TC winds and cooled SSTs in the storm cold wakes. The air temperature and humidity are unperturbed from their CORE-II values and do not respond to the ocean state, with implications for the character of these fluxes. Specifically, the elevation of latent and sensible heat fluxes out of the ocean in response to high TC wind speeds is underestimated in our simulations. Likewise, suppression of the latent heat flux out of the ocean and rate of the resulting upper ocean warming in the TCs cold wake may be somewhat overestimated.\nSynthetic TC wind speeds are generated for each storm in the TCVitals as is done for operational hurricane forecasting (Bender et al. 2007 ). The cyclone wind field is projected onto the ocean model grid, and at any location where the CORE-II wind speed is lower than the TC wind speed it is replaced by the latter (Fig. 1b ). For cases when the extended structure data are unavailable, the axisymmetric wind profile of Holland (1980) is used. The Holland (1980) axisymmetric profile comprises only ;20% of storm hours, typically during cyclogenesis and storm dissipation. Further details of the wind formulation and the blending method are described in the appendix.\nThe 2004/05 global TC season is simulated from the start of the North Atlantic hurricane season (1 June) and integrated for one full calendar year. There were 92 TC events during these 12 months (Fig. 2) , with the greatest number in the west Pacific (WestPac) (30), a significant number in the North Atlantic (16), east Pacific (EastPac) (17), and Southern Hemisphere (18), and a few in the North Indian Ocean (3). The boundaries and oceanic surface areas of these basins are defined in Table 3 ."}, {"section_title": "c. Experimental procedure", "text": "The model is run from 1 June 2004 through 31 May 2005 in two forcing configurations. The first has surface forcing based on the CORE-II atmospheric state, and we will refer to this experiment as the control experiment (Fig. 1a ). The other configuration has the CORE-II surface wind augmented by embedding the synthetic TCs, and will be referred to as the TC experiment ( Fig. 1b ). An ''anomaly'' is defined as the difference between the oceans in the TC and control experiments, thus yielding the net thermal and dynamical effect of TC activity.\nOcean initial conditions are derived from GFDL's Ocean Data Assimilation Experiment (ODAE) product, described by Zhang et al. (2007) . This product provides the average monthly temperature and salinity fields at 18 grid spacing. MOM is started on 1 December 2003 from the ODAE December 2003 field interpolated onto the ocean model grid, with air-sea fluxes computed based on the CORE-II atmospheric state. The model is run for 6 months. At this point, the ocean has reached a mechanical quasi-steady state with the ocean's globally integrated total kinetic energy being ;3500 PJ."}, {"section_title": "d. Seasonal behavior", "text": "To evaluate the seasonal behavior of the ocean model and set a baseline against which to compare TC heating values, the seasonal component of the upper ocean heat content (OHC) is calculated. OHC is defined as\nwhere [x w , x e ; y s , y n ] are the [zonal; meridional] domain boundaries. The 729-m depth level is selected as it is the closest model level to the 700-m depth used by in situ analyses, such as Levitus et al. (2012) . The seasonal OHC variability is defined as\nwhere the overbar denotes time averaging from 1 June to 31 May. A 30-day low-pass filter is applied in order to The seasonal OHC amplitude in MOM is compared to that found by applying Eq. (2) to an independent data source, the Navy Coupled Ocean Data Assimilation (NCODA) product (Cummings 2005 Fig. 3 . The value of DOHC season is consistent between model run years, with little difference in phase and amplitude. The seasonal OHC in MOM is on average ;8% smaller than in NCODA (although at times this discrepancy is closer to ;18%), but otherwise in good agreement. This comparison gives confidence that MOM is capturing the seasonal behavior of OHC reasonably well. The maximum global excursion of DOHC season (calculated as the sum of the Northern and Southern Hemisphere extrema), as well as those for the individual ocean basins, is presented in Table 4 . A cross-comparison of ML depths between MOM and NCODA was conducted as well. While not shown, the temporal and spatial structure of the modeled ML was generally consistent with that derived from NCODA data."}, {"section_title": "Results", "text": ""}, {"section_title": "a. Test cases", "text": "Two TC cases are considered to test the model response and explore the physical processes involved in simulating the ocean response to TC passage. In this way the suitability of our analysis is established. We select 2004's Hurricane Frances (Table 1) , a category 4 hurricane that took place from 25 August to 7 September 2004 in the North Atlantic, and Typhoon Songda (Table 2) , a category 4 typhoon that took place from 27 August to 7 September 2004 in the west Pacific. The Hurricane Frances case is selected due to the availability of observational data from the Coupled Boundary Layers and Air-Sea Transfer (CBLAST) field experiment (Black et al. 2007; D'Asaro et al. 2007 ). Typhoon Songda is selected for comparison of the ocean response to a TC with similar intensity, duration, and track length in the west Pacific.\nTo investigate the restoration time scale of TC-induced anomalies, model integration is carried out through 31 December 2004 (;2 weeks of storm passage and just over 4 months of ocean recovery). SST and DSST following passage of Hurricane Frances and Typhoon Songda are shown in Fig. 4 , with both TCs producing strong cold wakes by 5 September. Figure 5 focuses on the cold wake of Hurricane Frances on 1 September, with domain boundaries selected to approximate those in to the 268C isotherm, defined in D'Asaro et al. (2007), is reduced by ;100 m 8C 21 (Fig. 5d ), comparable to the ;125 m 8C 21 from D'Asaro et al. (2007) . The cold wake of Frances is consistent in spatial structure with CBLAST observations. Typhoon Songda produces a stronger simulated cold wake (Figs. 4c,d) with maximum cooling ;5.58C. Songda passes over a more strongly stratified ocean ( Fig. 9b ), allowing for a more intense modeled cold wake (Vincent et al. 2012b) , with its slower translation speed during the period of maximum cooling (;5 m s 21 ) compared to that of Frances (;6 m s 21 ) reinforcing the effect (Yablonsky and Ginis 2009; Mei and Pasquero 2013) . The modeled cold wake of Songda is consistent with remote sensing observations taken from Advanced Microwave Scanning Radiometer for Earth Observing System (AMSR-E) swath data ( Fig. 6) , with similar spatial structure and SSTs in the core of the wake as low as 228C in both cases.\nIn Fig. 7 , the recovery e-folding time (t) of the sea surface temperature anomaly (DSST) is presented, with means and standard deviations of those times calculated within the shown DSST bins. Dare and McBride (2011) calculated the SST recovery time for cold wakes found in the daily 1 /48 resolution Reynolds et al. (2007) SST analysis product. The position and time of cold wakes was determined for each storm in the IBTrACS during the 1981-2008 period, showing that surface cold anomalies were restored with an e-folding time ;8.5 days. From the daily MOM output a local recovery e-folding time is calculated for every model grid point determined to be within the cold wake of either Hurricane Frances or Typhoon Songda. This recovery time is based on an exponential decay model DSST 5 DSST o e 2(t2to)/t , where DSST o is the initial SST cooling and t o is the time of storm passage for that location. Figure 7 is produced from the results of this fit, with an average e-folding time of ;8.75 days, in good agreement with the findings of Dare and McBride (2011) , and somewhat faster than the ;11-day e-folding time derived by Mei and Pasquero (2013) . As in the results of Dare and McBride (2011) , recovery time shows no statistically significant dependence on the strength of initial cooling.\nTC-induced subsurface anomalies are addressed next. Figure 8 illustrates the cross-track structure of the cold wake behind Typhoon Songda, with the cold anomaly in the upper 50 m centered ;25 km to the right of the storm track, corresponding to upward mixing and upwelling of thermocline waters into the mixed layer. Cooling directly below the track exceeds 750-m depth, consistent with Ekman pumping induced by the strong TC wind stress curl, and is offset by downwelling centered around 500-m depth and ;150 km from the storm track. Warming due to downward mixing of ML waters into the thermocline is present between 50-and 100-m depth to the right and left of the storm track. Warming of ;2.58C extends to nearly 200 m, at depths that have been attributed to nonlinearities in the superposition of mixing-induced warming and downwelling (Vincent et al. 2013) .\nMean temperature anomalies are calculated in the regions shown in Fig. 4 , isolating the respective mixing effects of Frances and Songda while averaging out upwelling and downwelling effects. Immediately after storm passage there is surface cooling and subsurface warming (Fig. 9b) . The depth and strength of mixing in the two storms is comparable, with Songda producing slightly more warming at depth, consistent with the stronger cold wake.\nOcean heat content anomaly (DOHC), ocean heat loss (OHL), and ocean heat uptake (OHU) are used to quantify the bulk impact of TC heating and cooling. The OHC anomaly is defined as\nwhere OHC TC and OHC con are the respective heat contents of the TC and control experiments calculated from Eq. (1a). OHL and OHU decompose the heat content anomaly into shallow cooling and deep warming constituents:\nwhere DT 5 T TC 2 T con . These integrals are first carried out horizontally, to obtain a heat anomaly profile with clear zero crossings (Fig. 9b ). OHL is integrated from the surface through the cold anomaly to the first zero crossing (z 1 ) and OHU from the first zero crossing until either the second zero crossing or, if one is not present, the warm anomaly has attenuated to 1% of its peak value (z 2 ). Time series of OHL and OHU are calculated through 31 December as OHL is attenuated to zero by mid to late December for both Frances and Songda (Fig. 10) . For Frances, OHL reaches a maximum value of 2.6 3 10 20 J with an accompanying OHU of 2.9 3 10 20 J, while Songda produces both OHL and OHU of 3.7 3 10 20 J. OHU and OHL approximately balance in both cases, indicating that prior to restoration heat has been well conserved over the integration depth. TC windenhanced heat fluxes under the storm cool the ocean during TC passage, an effect that is underestimated in the uncoupled model as previously discussed. Direct extraction of heat by TC winds is a relatively small but nonnegligible contributor to TC-induced cooling when compared to vertical mixing, contributing less than 10%-15% to the cooling (Price 1981; Ginis 2002) . While this lower heat extraction provides for warmer surface waters available for mixing by the TC and thus may elevate OHU values (Vincent et al. 2012a ), its contribution to the anomalous heating is expected to be small. The maximum OHU and OHL for Frances are reached on 7 September, two weeks after Frances formed. Maximum OHU is ;10% higher than OHL, indicating that restoration of upper ocean cooling has begun even as the TC continues to mix the ocean elsewhere. This is consistent with the SST restoration time scale previously discussed. The value of DOHC was ;75% of the maximum OHU for Frances, an artifact of the chosen averaging domain capturing cooling due to uncompensated deep upwelling. OHL decays with an e-folding time of 39 6 2 days for Frances and 44 6 2 days for Songda. This recovery time is significantly longer than that of the SST, consistent with the additional time needed for solar insolation and mixing to restore temperatures in the ML. Reduction of SSTs in the cold wake result in a dampening of the outgoing latent, sensible, and longwave heat fluxes in Songda's wake (Fig. 11 ). This reduction creates an imbalance between outgoing heat fluxes and the unperturbed incoming shortwave radiation at the ocean surface, resulting in an accumulation of 3.5 3 10 20 J of anomalous heat input by the time the CML is restored. This positive anomalous surface heat flux nearly balances the 3.6 3 10 20 J of upper thermocline OHU, closing the heat budget in the mixed layer.\nThe impact of individual storms is compared to the values from Emanuel (2001) . He found OHU from a single storm of ;5 3 10 20 J, given a wake of uniform width (400 km), length (2000 km), depth (50 m), and cooling (38C). The wakes of Frances and Songda have lengths ;2000 km, widths ;400 km, cooling to ;50 m, and average SST cooling of 3.258 and 3.58C, respectively. While the wake characteristics are very similar, the OHU of Frances is ;57% and Songda's ;74% of Emanuel's estimates.\nThe discrepancy is due to the spatial variability of the modeled cooling. The SST anomaly quickly falls off with distance from the core of the cold wake, cooling at depth quickly approaches zero past a depth of ;30 m, and the greatest cooling takes place only along the portion of the storm track where storm intensity and stratification are favorable. In light of this discrepancy, the idealized single storm estimate is considered an upper bound on storm impact. Pacific Hurricanes Howard and Isis; North Atlantic Hurricanes Frances and Ivan). Figure 13 presents the accompanying subsurface temperature and temperature anomaly fields near 100 m. Warming from mixing and downwelling is present throughout the TC forcing regions, persisting long after the surface cooling has been restored. Cooling due to Ekman pumping (upwelling) accompanies many of these warm anomalies, but the anomaly field at depth is dominated by warming. Figure 14 shows TC-induced temperature anomalies averaged laterally across the basins described in Table 3 , on 1 October 2004 and 31 May 2005. The different averaging areas are reflected in the differing DT axes between the global and hemisphere means (Figs. 14a,f) and basin means (Figs. 14b-e ). The global anomaly (Fig. 14a ) displays cooling to ;40 m on 1 October with maximum warming at ;60 m and extending deeper than 300 m. By 31 May 2005, only the deep, persistent warming remains, with a maximum at ;90 m and magnitude comparable to that in October.\nThe west Pacific, east Pacific, and North Atlantic have cooling on 1 October down to ;50, 30, and 40 m respectively ( Figs. 14b-d ). West Pacific warming has a deeper and broader peak than either the North Atlantic or east (Table 3) .\nPacific, while the east Pacific warming is both the shallowest and weakest. This interbasin variability is due to differences in TC forcing and local stratification, with those regions with the greatest forcing (west Pacific and North Atlantic) and with deeper mixed layers (west Pacific) having stronger and deeper warming.\nCooling in the North Atlantic has vanished by 31 May, with a weaker and deeper warm anomaly centered around 100 m. The east Pacific warm anomaly on 31 May is nearly as strong as that on 1 October and has deepened by ;60 m. The west Pacific has two peaks of weaker persistent warming, one shallower (;50 m) and the other deeper (;160 m) than on 1 October. The reasons for these differences, especially the strong, deep 31 May warming in the east Pacific and weakened, bifurcated warming in the west Pacific, will be discussed in section 3e.\nThe North Indian Ocean, consistent with its weakened and offset TC season, has nearly zero subsurface accumulation on 1 October (Fig. 14e ). By 31 May there is strong warming centered on 110 m. In the Southern Hemisphere (Fig. 14f) there is a weak warming at depth on 1 October, centered on 150 m. 1 October is before the start of austral TC activity, and so is not attributed to direct storm forcing. By 31 May, there is a sharp warming centered on 95 m. The origin of this deep anomalous heating at times and locations removed from TC-induced mixing will be explored in section 3e. (Fig. 14a) . A 15-day low-pass filter is applied to the resulting time series, in order to emphasize seasonal to interseasonal trends. OHL increases slowly before accelerating with increased storm activity in August, reaching a peak of 1.7 3 10 21 J at the beginning of October. Global OHL subsequently decays until there is none remaining by February, indicating that on average the CML has been restored."}, {"section_title": "c. Ocean heat uptake", "text": "OHU temporal structure mirrors that of OHL through October, with anomalous heating increasing slowly through August, and then accelerating before leveling off at ;4.1 3 10 21 J, which is approximately 3% of the maximum amplitude of global seasonal OHC (Table 4) , and somewhat lower than the heat uptake derived from SSH anomalies by Mei et al. (2013) (1.01 6 0.46 3 10 22 J). OHU continues to increase slowly through January, before decreasing slightly to 3.9 3 10 21 J. Increasing DOHC lags OHU as in the Frances and Songda cases, with the difference between the two being equivalent to the OHL. February DOHC values are comparable to OHU, by which time mean restoration of the global CML has occurred, giving confidence that OHU is capturing the warming anomaly in a globally averaged sense.\nA globally averaged OHU rate can be derived from a linear fit to the OHU time series in Fig. 15 . An annual OHU rate of 0.13 6 0.09 PW is found for 1 June 2004-31 May 2005, with R 2 5 0.69. A seasonal rate of 0.47 6 0.02 PW with R 2 5 0.98 is found by constraining the fit to the period of peak OHU (20 July-28 October 2004). This difference in uptake rate and R 2 supports the hypothesis that the effect of TC-induced heating on the ocean is poorly represented by a bulk annual heating rate. As in past studies, we find the mean annual OHU rate to be a useful method of comparison, despite its acknowledged shortcomings in capturing the full spatial and temporal variability of TC thermocline heating. The annual OHU rate is consistent with the Argo float estimates of Park et al. (2011) (0.19 6 0.03 PW) and the 0.15-PW rate of Jansen et al. (2010) , which accounts for the effect of reventilation of thermocline thermal anomalies via the so-called ''Stommel demon'' associated with seasonal advection of subsurface heat anomalies around the subtropical gyre (Stommel 1979) . The annual rate is lower than the findings of Sriver and Huber (2007) (0.26 PW) and the ''doubled wind'' experiment of Sriver and Huber (2010) (0.3 PW), which they considered to be the most physically representative. Both rates are significantly lower than the estimates of Emanuel (2001) Figure 16 shows the ocean basin cooling response to TC forcing, where OHL has been integrated across those basins defined in Table 3 . The strongest OHL is seen in the North Atlantic (peaking at 8 3 10 20 J on 5 October) and the west Pacific (peaking at 7 3 10 20 J on 1 September). While its peak is lower, the west Pacific OHL is broader, consistent with the longer west Pacific TC season. The east Pacific and Southern Hemisphere have weaker OHL, peaking in late September and mid-April respectively, again consistent with the timing and duration of direct TC forcing in those regions.\nBasin integrated OHU is shown in Fig. 16b , with maxima shown in Table 4 . Similar to the Frances, Songda, and Global OHU calculations, the initial heat uptake follows the structure of the accompanying OHL. North Atlantic OHU peaks in early October before gradually falling by 50% by 31 May 2005. West Pacific OHU peaks in early November, at a lower value than the North Atlantic peak despite the greater local TC forcing. OHU in the west Pacific decreases rapidly between November and March, with less than 1 /3 of the maximum heating remaining on 31 May.\nIn contrast, east Pacific OHU peaks at ;6 3 10 20 J, and subsequently increases by ; 1 /3 after the conclusion of local TC activity. OHU in the Southern Hemisphere begins to accumulate during the northern summer, increasing rapidly in November before leveling off in February. There is a slight decrease in Southern Hemisphere OHU in March, followed by an increase that corresponds with local TC activity. The North Indian Ocean sees a small accumulation through the course of the northern winter.\nComparisons of basin peak OHU to 1 /2 the local summer-winter difference in DOHC season are presented in Table 4 . In the dominant TC regions, TC-induced OHU can reach values up to 10% of the maximum seasonal amplitude. While the relative impact of TC OHU in the Southern Hemisphere is lower (;3%) it is still considerable given the lower direct TC forcing and size of the basin (Table 3) .\nThe striking behavior of west Pacific, east Pacific, and Southern Hemisphere TC-induced OHU bears deeper analysis, specifically the reasons for their apparently compensatory variability. The heat anomaly budget for the region delineated by the dashed box in Figs. 12b and 13b is calculated (Fig. 17) to understand the reasons for the drastic drop in west Pacific OHU. Accumulated anomalous heating through the ocean surface results in a warming of the ocean. There is a strong and rapid accumulation of anomalous ocean heat transport\nD(yT) 5 y TC T TC 2 y con T con (5b)\nacross the southern boundary. This southward heat export continues through January, with a peak value ;2.75 3 10 21 J before turning northward. A considerably weaker and slower zonal export of anomalous heat occurs at the eastern boundary. The surface and advective forcing are balanced by a regional change in OHC [Eq. (3)]. This analysis indicates that the drop in west Pacific OHU in Fig. 16b is consistent with a redistribution of anomalous heat from the subtropical to the tropical Pacific. Figure 18a shows the meridional distribution of OHU, integrated 3608 zonally. Initially, anomalous heat accumulates between 108 and 408N, before decreasing through the northern autumn and winter. OHU between 108S and 108N, where there is little to no TC activity, increases as that north of 108N attenuates. By 31 May the largest TC-induced heat anomaly is in the deep tropics, with a significant amount remaining in the northern subtropics and a smaller amount having accumulated in the southern subtropics due to austral TC activity. This distribution of OHU illustrates that the southward export of heat from TC forcing regions results in a convergence of heat in the tropics."}, {"section_title": "d. Meridional transport", "text": "Heat export and convergence is more clearly seen in Fig. 18b , where Eq. (5a) has been integrated around the globe every 108 from 308S to 308N, producing time series of the accumulated meridional TC induced heat transport anomaly. There is a clear southward transport in the Northern Hemisphere starting in late summer. This OHT anomaly strengthens between 208 and 108N before penetrating across the equator. By 108S there is no further transport accumulation, confirming the convergence of heat in the equatorial region.\nThe temporal structure and magnitude of the global OHT anomaly accumulation across 108N is consistent with that across the southern boundary of the west Pacific control volume analyzed in Fig. 17 , establishing that the equatorial DOHT convergence is dominated by export of TC induced OHU out of the subtropical west Pacific. For this reason, the remainder of the analysis focuses on the west Pacific transport and circulation. While there is a significant decrease in OHU in the North Atlantic between November and May (;50%), it is not associated with export of heat to the tropical Atlantic. Rather, this decrease is likely due to the reventilation mechanism of Jansen et al. (2010) ."}, {"section_title": "e. Subtropical-tropical interaction", "text": "The currents in the west Pacific upper thermocline are shown in Fig. 19 . Zonal and meridional currents are averaged from 56 to 253 m to capture the flow field over the depths where TC mixing deposits heat. The region shown contains nearly all of the west Pacific TC activity (Fig. 2) . Zonal flow is predominantly westward, carrying TC-induced heat anomalies toward the western boundary, where they enter either the Kuroshio to be advected poleward or the Mindanao Current to be advected into the deep tropics. Whether a water mass enters the Kuroshio or Mindanao is determined by its latitude upon reaching the western boundary and the location of the bifurcation of the North Equatorial Current (NEC).\nThe location of the NEC bifurcation varies seasonally, consistent with the observational findings of Qu and Lukas (2003) , who hypothesized that changes in local Ekman pumping associated with monsoonal winds alter the circulation such that the bifurcation reaches its northernmost location between November and December, before migrating south through July. The bifurcation point is around 158N between August and October (Fig. 19a ), 168N between November and January (Fig. 19b) , and as far south as 128N between February and April (Fig. 19c ). Times when the bifurcation is farther to the north correspond with elevated anomalous heat transport into the tropics, with the proportion of midgyre waters flowing into the Mindanao elevated relative to the annual mean.\nWarm anomalies are advected equatorward as part of the subtropical cell (McCreary and Lu 1994) . Large-scale southward deflection of the NEC between 1258 and 1308E in the November-January period further enhances the flow into the Mindanao, corresponding with the period of greatest DOHT into the tropics. The late winter period February-April sees a relaxation of the currents consistent with the reduced wind stress curl during the southwest monsoon. Meridional flow in the midgyre region (1308-1508E) is now predominantly northward, with waters from the tropics penetrating the gyre interior and entering the Kuroshio. This seasonality in the regional flow results in a reversal of the total regional OHT integrated along the equator and 108N, in phase with the reversal in DOHT seen in Figs. 17 and 18b , providing a physical explanation for the return of anomalous heat to the subtropics.\nThe model representation of the mean annual equatorial circulation averaged from 56 to 330 m is shown in Fig. 20 . The current experimental design allows for a reasonable representation of the low-latitude western boundary currents in the Pacific, and produces a wellresolved Indonesian Throughflow. For example, the Makassar Strait, one of the narrowest choke points in the region, has an ;10 grid point representation at this resolution. The rapid flow in the Mindanao is clearly displayed, feeding into the Indonesian Throughflow west of 1208E and the Equatorial Undercurrent (EUC) east of the Philippines and eastward into the open Pacific. We estimate that of the ;2.9 3 10 21 J of accumulated DOHT from the Mindanao Current, nearly 0.9 3 10 21 J enters the Indonesian Throughflow via the Makassar Strait, with the rest progressing east via the EUC. This partitioning of the anomalous heat transport between the Indonesian Throughflow and EUC is consistent with observations of the mean volume transport, where 9.3 6 2.5 Sv (1 Sv [ 10 6 m 3 s 21 ) passes through the Makassar Strait (Gordon et al. 1999 ) out of the 25-35 Sv of mean southward transport in the Mindanao (Lukas 1988) . The MOM representation of the EUC reaches speeds exceeding 1 m s 21 and is sharply sloped zonally along isopycnals, consistent with observations (e.g., see Fig. 13 in Griffies et al. 2009 ). Advection by the EUC would serve as a rapid mechanism of zonal OHU redistribution should TC-induced warm anomalies reach the undercurrent. On the eastern boundary, the coastal undercurrent off of Peru (Brockmann et al. 1980 ) would serve to advect anomalous heat from the tropical East Pacific north of the equator into the Southern Hemisphere, accounting for the offsetting changes in East Pacific and Southern Hemisphere OHU (Fig. 16a ) seen in April.\nFor TC heat anomalies to enter the undercurrent, water parcels must reach nearly 100-200-m depth by the time they enter the deep tropics. Figure 21 shows temperature anomalies averaged from 1208-1508E, that being the dominant region of equatorward transport. Most anomalous heat is deposited north of 158N and below 60 m. Meridional flow takes place primarily along isopycnal pathways, subducting water masses as they are advected equatorward (Rothstein et al. 1998; McCreary and Lu 1994) . Advection of warm anomalies is inferred along the 1031-1032 kg m 23 isopycnals in Fig. 21a during the autumn, causing the anomalies to deepen until they intersect with the EUC. Relatively little anomalous heat remains in the western Pacific south of 108N, implying that the EUC is in fact exporting heat eastward. Some heat anomalies remain at depth in the subtropics during the winter to be ventilated by winter mixed layer deepening ( Fig. 21b) . A persistent upwelling centered around 158N and flanking downwelling is a prominent feature seen in Fig. 21a , resulting from multiple TCs propagating predominantly westward in the region (Fig. 2) and subsequent reinforcement of the storm-induced Ekman pumping. This cumulative Ekman pumping produces anomalous zonal currents due to the thermal wind balance, directed westward on the northern and eastward on the southern edge of the upwelling region. These currents are expected to be weaker than the mean currents associated with the subtropical gyre, which are primarily responsible for advection of the TC-induced heat anomalies. Figure 22 presents the mean monthly temperature anomalies from 58S to 58N. TC-induced warm anomalies generated in the subtropics reach the tropics between late July and early August (Figs. 22b,c) . Advection within the EUC moves the warm anomalies entering the equatorial Pacific eastward. Warm anomalies can also be carried by eastward-propagating Kelvin and Yanai waves excited by west Pacific TCs as demonstrated by Sriver et al. (2013) . The phase speeds of the first and second baroclinic Kelvin modes are similar to the EUC velocity. The vertically coherent warm and cold anomalies present in Figs. 22e-l are due to the phase differences in tropical instability waves between our two simulations. These phase differences are not expected to contribute to the zonal heat transport.\nWarm anomalies reach the east Pacific by midautumn, shoaling along the thermocline (Figs. 22a-e ).\nThermocline warm anomalies in the west Pacific are significantly diminished between March and May while persisting in the east Pacific (Figs. 22j-l) . This behavior is consistent with the seasonal generation of TC-induced warm anomalies in the west Pacific.\nRapid relocation of TC-induced warm anomalies via the west Pacific subtropical cell, Mindanao Current, EUC, and equatorial waves explains the rapid decrease of OHU in the west Pacific between November and February seen in Fig. 16b . This connection between west Pacific TC activity and warming of east Pacific tropical thermocline waters occurs on time scales of less than one year. FIG. 22 . Monthly averaged temperature anomalies averaged from 58S to 58N in the Pacific Equatorial Undercurrent, with average isopycnals from the same period superimposed. Isopycnals based on potential density referenced to the surface are averaged over the same region and period as temperature anomalies, and range from 1030 to 1035 kg m 23 in 1 kg m 23 increments."}, {"section_title": "Discussion", "text": "The interaction of tropical cyclones with the ocean produces a nonnegligible heating of the thermocline with potential implications for the ocean climate system. Although tropical cyclones (TCs) are a global phenomenon, viewing the impact of TCs on the ocean on a regional basis sheds light on the physical mechanisms driving the generation and redistribution of TC-induced ocean heat uptake (OHU). Our estimates of global heat uptake magnitude and rates are consistent with the results of recent observational and modeling studies. We find that TC-induced heat uptake can augment the basin heat content by up to 10% of the maximum local seasonal amplitude in those basins with the greatest storm activity. Results from our study are subject to uncertainties associated with model formulation (e.g., parameterizations), grid resolution, and biases due to the lack of atmospheric coupling. We therefore recommend further examinations in global eddying simulations of the mechanisms for TC-induced heat transport and quantitative estimates of OHU.\nBecause of the single year of model integration and analysis, we are unable to address questions related to the poleward export of anomalous heating through the Atlantic meridional overturning circulation predicted by previous studies (Emanuel 2001; Jansen et al. 2010; Sriver and Huber 2010; Manucharyan et al. 2011; Scoccimarro et al. 2011) . Rather, our analysis identifies a rapid equatorial convergence of heat through the shallower and more rapid wind-driven west Pacific subtropical cell. The intense currents near the western boundaries of the ocean basins play a key role, especially in the west Pacific. We do not see this behavior as contradicting findings of poleward transport, but as taking place in parallel and on shorter time scales.\nTC-induced warm anomalies are efficiently exported to the tropics, where they are moved zonally into the tropical east Pacific by the EUC and equatorial waves. This behavior is consistent with the findings of Manucharyan et al. (2011) , but shows strong heat accumulation in the east Pacific over shorter time scales. Convergence of anomalous TC heating in the equatorial east Pacific could have climate implications on interannual time scales, with the possibility for modulation of the El Niño-Southern Oscillation (ENSO) (Fedorov et al. 2010) .\nOur analysis of a single season has provided insight into the potential effect of tropical cyclones on the ocean climate system. Nonetheless, many questions remain unaddressed. While we have traced some of the dominant pathways by which anomalous heat is redistributed, a further analysis of the physics of this transport is warranted, as is the study of the fate of these anomalies through subsequent TC seasons. Future work should also address how representative the impact of 1 June 2004-31 May 2005 TC activity is, and if there is a multiyear accumulated effect of storm induced heating. If this heating does continue to accumulate, the mechanisms by which the ocean eventually discharges it in order to remain in thermodynamic balance must be explained, be it by reventilation or interaction with and discharge by ENSO or other large-scale climate processes. \nThis wind speed magnitude is decomposed into tangential (U tan ) and radial (U rad ) components as U tan (r, a) 5 U 10 (r, a) cos[u(r)] ,\nU rad (r, a) 5 2U 10 (r, a) sin[u(r)] ,\nwhere u(r) is an empirically derived angle represent the proportion of the wind directed in the radial direction (inflow) versus tangentially. These radial and tangential winds are then converted into zonal and meridional components as u(r, a) 5 U rad cos(a) 2 U tan sin(a) 5 2U 10 sin[a 1 u(r)] ,\ny(r, a) 5 U tan cos(a) 2 U rad sin(a) 5 U 10 cos[a 1 u(r)] .\nIn the absence of the angularly dependent structure data, the axisymmetric wind profile of Holland (1980) is used instead. RMW, MWS, and pressure gradient Dp 5 ( p c 2 p o ) are used to calculate the scaling variables\nB 5 MWS 2 e r a Dp ,\nwhere r a is the density of dry air (;1.28 kg m 23 ). These two parameters are then used to calculate a wind speed magnitude at each grid point U 10 (r) 5\n\" AB e 2A/r B r a r B ! 1 r 2 f 2 4\nwhere r is the current distance from the center of circulation. As above, the wind speed magnitude is then decomposed into zonal and meridional components. These wind speed vectors are then augmented by onehalf of the storm's translation speed, in order to capture some portion of the asymmetry caused by the superposition of the storms circulation and forward motion. Synthetic wind speeds are generated for each storm in the best-track database in sequence, on a 1 /68 resolution equirectangular grid, using the appropriate formulation. To minimize the overlap of storm profiles and problems in the tail of the Holland (1980) wind profile as the Coriolis parameter f tends to zero, the winds are constrained to uniformly vanish outside of an imposed radius equal to twice the R cls . This radius is chosen because, physically, R cls should roughly represent the size of the closed, recirculation vortex, but somewhat underestimates the distance at which the synthetic TC winds are uniformly smaller than the CORE-II winds.\nEach storm is projected onto the ocean model grid. A point-by-point comparison is then made between the synthetic TC and specified CORE-II wind speed magnitudes. For those points where the TC forcing is greater, the meridional and zonal wind speed components from the CORE forcing are replaced by those from the synthetic storm. In this way, relatively smooth embedding of the empirically generated storms into an atmospheric dataset that previously lacked strong TC forcing is achieved."}]