[{"section_title": "Introduction", "text": "This report presents selected findings about the employment and educational outcomes of bachelor's degree recipients 10 years after they completed their degrees. These findings are based on data from the 2008/18 Baccalaureate and Beyond Longitudinal Study (B&B:08/18). B&B:08/18 is the third follow-up in a nationally representative longitudinal study of students who completed the requirements for a bachelor's degree during the 2007-08 academic year. The first follow-up, which was conducted in 2009, one year after their graduation, explored both undergraduate education experiences and early postbaccalaureate employment and enrollment. 1 The second follow-up, conducted in 2012, examined bachelor's degree recipients' labor market experiences and enrollment in additional degree programs through the 4th year after graduation. This third follow-up, conducted in 2018, explores labor market experiences, financial aid debt and repayment, and postbaccalaureate enrollment through the 10th year after graduation. The Baccalaureate and Beyond (B&B) series of data collections allows researchers to address questions regarding bachelor's degree recipients' undergraduate experiences, including their participation in various financial aid programs, student loan debt and repayment of that debt; entrance into and progress through postbaccalaureate education; and employment, particularly for graduates who became elementary or secondary teachers. B&B also includes items to help policymakers and researchers better understand the teacher pipeline and experiences and outcomes of teachers. This First Look focuses on a subset of topics that can be examined with the B&B:08/18 data: financial well-being, student loan borrowing and repayment, postbaccalaureate enrollment, employment outcomes, and teaching status. The purpose of this report is to illustrate the range of information available in B&B:08/18. The selected findings present a selection of the estimates that can be obtained from the data. Readers are cautioned not to infer causality from the estimates in this report. Many of the variables presented are related to one another, and complex interactions and relationships have not been explored. Among the approximately 137,800 students who were sampled for the 2007-08 National Postsecondary Student Aid Study (NPSAS:08), about 17,100 students INTRODUCTION were determined to be eligible for B&B:08/18. Eligible students were those who had enrolled at an institution that was eligible to participate in Title IV federal student aid programs and was located in one of the 50 states, the District of Columbia, or Puerto Rico; and had completed requirements for a bachelor's degree between July 1, 2007, andJune 30, 2008. These students represent the approximately 1.6 million students who completed the requirements for a bachelor's degree between July 1, 2007, andJune 30, 2008. For readers interested in appendixes with estimate and standard error tables, definitions of terms used in the findings and tables, and additional information about the survey from which the findings are drawn, please see the \"View full report\" link at https://nces.ed.gov/pubsearch/pubsinfo.asp?pubid=2021241."}, {"section_title": "Characteristics of current job (table A-6)", "text": "• Over half (59 percent) of 2007-08 graduates who were working in 2018 were doing so in the same state where they had earned their bachelor's degree. Eighty-seven percent of working graduates considered their 2018 job a part of a career they were pursuing, 84 percent had employer-offered health insurance benefits, and 48 percent were supervising others on the job .  Kindergarten through 12th-grade regular classroom teaching (table A-7) • Ten years after bachelor's degree completion, 13 percent of graduates were current or former regular classroom teachers: 5 5 percent of graduates were regular classroom teachers before 2012 and continued teaching in 2018, another 2 percent began as a regular classroom teacher after 2012 and continued teaching in 2018, and 6 percent had been a regular classroom teacher since 2007-08 but were not teaching in 2018."}]