[{"section_title": "What Is the Issue?", "text": "Farm income is highly variable, with earnings subject to wide fluctuations in yields and prices. Income variability affects key farm decisions-how much labor to use on-farm versus off-farm, how much income to save as a cushion for bad years, how much to invest in machinery or land, which crops to plant or types of livestock to produce, and how much to spend on risk-reducing inputs such as pesticides or irrigation. Because household income variability influences these decisions, it can affect agricultural production and household welfare. Also, by influencing land, water, and agrochemical decisions, it can affect environmental quality. Federal agricultural policies have long sought to shelter farmers from income fluctuations using price supports, direct income support, disaster assistance programs, and yield and revenue insurance programs. Recently, the 2014 Farm Act shifted spending priorities to programs designed to reduce income risk-eliminating direct payments and creating new programs with payments linked to annual or multi-year fluctuations in prices, yields, or revenues. There has long been information tracking farm income at the national level, yet little information exists about income variability of individual farm households. How much does farm household income vary from year to year for different types of farms? How does this variation depend on farm and operator characteristics? How has farm income variability changed over time? To what extent is farm household income variability driven by variation in different sources of household income? To what extent do Federal programs mitigate household income fluctuations and how much is this worth to farmers? This research seeks to answer these questions."}, {"section_title": "What Did the Study Find?", "text": "This report focuses on larger scale commercial farms, the type responsible for about 80 percent of U.S. agricultural output. For these commercial farm households, total household income is much more volatile than that of typical nonfarm households. The median change in total income between years was about eight times larger than for nonfarm households. Farm household income varies so widely mainly because farm income, which constitutes the majority of household income for these commercial farms, varies much more than off-farm income (income from work unrelated to farming). For individual farm households, the median change in farm income between years was about 180 percent of the median farm income. In contrast, the median change between years in off-farm income was only about half the median off-farm income. However, the volatility of farm income is similar in magnitude to the volatility of nonfarm self-employment income. Differences among farm households, too, correlate to differences in income volatility. Variations in farm size (farm asset value), commodities raised, operator characteristics, and extent of reliance on Federal programs all play roles: Total household income is more volatile on larger farms than on smaller farms . Farm households with more than $3 million in farm assets have a 34-percent chance of having negative household income at least once every 2 years, compared with a 17-percent chance for farm households with less than $750,000 in farm assets. Income volatility likely increases with farm size, because on larger farms, a bigger share of household income comes from the farm and the operators have more volatile off-farm income. Crop farms, on average, have more volatile household income than livestock farms. This is mainly because crop farms tend to be larger and derive more of their total income from farm sources. However, farm income was also found to be more volatile on crop farms, which could be explained by the vulnerability of crops yields to weather and pests and the fact that a large share of livestock is produced under production or marketing contracts, which reduce income risks for farmers. Farm household income varies more when the principal operator has less education, does not have a spouse, or considers farming to be his or her primary occupation . Less educated workers face higher rates of unemployment during economic downturns. A spouse often provides an off-farm income source, which can smooth household income variation. Full-time farmers face greater household income risk because farm income is much more volatile than off-farm income. Between 1996 and 2013, the volatility of farm household income declined by about 20 percent or 1 .2 percent per year . The simultaneous decline in the volatility of farm income (about 10 percent or 0.7 percent per year) might be explained by an increased reliance on production contracts, changes in the organization of farm businesses, or an expansion of the Federal crop insurance program. Farm income contributes 77 percent of total income variation for the average farm household (90 percent for large farms with at least $3 million in farm assets, and about 60 percent for small farms with less than $750,000 in assets). Off-farm wage income and off-farm non-wage income each contribute about 10 percent to total income variation. On average, for all farms, farm program payments comprise about 17 percent of total income but contribute only about 3 percent to total income variation, reflecting the role of program payments in smoothing farm income fluctuations. All categories of farm program payments (direct, counter-cyclical, conservation, crop insurance, and other) were found to reduce household income volatility. Because program payments reduce risk, each dollar of payments is worth more than one dollar to a risk-averse farmer-an economic term for a farmer who is willing to pay a premium to reduce income variability. By making assumptions about how much a farmer dislikes income variation, ERS researchers estimated the value of risk-reducing farm program payments. For a \"moderately\" risk-averse farmer, each net dollar of crop insurance payments was estimated to be worth $1.38, of counter-cyclical payments (repealed by the 2014 Farm Bill)-$1.09, and of direct payments (likewise repealed by the 2014 Farm Bill), which were essentially fixed-$1.01. In comparison, the expected (average) dollar from farming is worth only $0.70 to a moderately risk-averse farmer, because of farm income variablity."}, {"section_title": "How Was the Study Conducted?", "text": "This study uses data from 18 years of USDA's Agricultural Resource Management Survey (ARMS) and a sample of over 27,000 farms that were surveyed at least twice between 1996 and 2013. While not representative of all U.S. farms, these farms have characteristics that resemble, on average, the commercial farms responsible for the bulk of U.S. agricultural production. Unlike aggregate or cross-sectional data, these panel data allow observations of how farm income, off-farm income, and farm program payments changed over time for the same farms."}, {"section_title": "www.ers.usda.gov", "text": ""}, {"section_title": "Introduction", "text": "Farm income is highly variable, with earnings subject to wide fluctuations in yields and prices. Farm output can vary unexpectedly because of weather that can damage crops or make it difficult to access fields with equipment at critical planting or harvest times. Plant pests and diseases can be difficult to control and can cause substantial yield reductions. Livestock feed crops are subject to many of the same hazards as food crops. The livestock themselves are also vulnerable to weather and disease risks that can damage herds. In addition to unexpected yield fluctuations, farmers must cope with commodity prices that vary more than most nonfarm goods and services (Tomek and Kaiser, 2014). The price variability is partly caused by the time lag between the decision to produce and when output can be sold. Because farmers often make their production decisions months or (in the case of investments in buildings, equipment, fruit trees, or livestock) years before harvest, their ability to alter supply is limited in the short run. Hence, product markets may continue to be flooded with output, even when prices are low. At the same time, consumers and processors of agricultural products generally do not alter their demand quickly to changing prices. As a result, shocks to either supply or demand-caused by rapidly changing economic conditions abroad, exchange rate fluctuations, production shocks, or policy changes-can result in wide price fluctuations. For the nearly 1 million U.S. farmers who consider farming their primary occupation, variability of returns can be a challenging part of running their business. Large unplanned income fluctuations can affect the ability of farmers to obtain credit, expand their operations, and repay debt. Farmers may try to cope with income variation in a variety of ways. They can smooth income by liquidating their farm or nonfarm assets or by using their assets as collateral for a loan. For many farm households, a sizable portion of total income is derived from off-farm sources, including wages and earnings from off-farm investments and off-farm businesses. Farms may adjust their off-farm labor supply in anticipation of, or to compensate for, unexpected income shocks. Farmers might also cope with risk by using risk-mitigating inputs, such as pesticides and irrigation, by reducing fertilizer applications, or by adjusting or diversifying their crop mix-decisions that can influence water quality and biodiversity. Hence, the way farmers cope with income risk affects what, how, and how much they produce and can have strong implications for agricultural production, rural household welfare, and environmental quality. Federal agricultural policies have long sought to shelter farmers from income fluctuations by using price supports, direct income support, disaster assistance programs, and crop yield and revenue insurance programs. Trade and agricultural policies that are mainly framed as supporting producer incomes and internalizing externalities can have important risk-reducing benefits for farmers (Thompson et al., 2004). Even the largely decoupled production flexibility contract (PFC) payments introduced by the 1996 FAIR Act provided insurance value to farmers by offering a relatively stable source of income. The 2014 Farm Act significantly shifted Federal agricultural spending toward programs aimed at reducing income risk (USDA, ERS, 2016). The Act ended fixed annual payments to producers based on historical production, and it created new programs tied to annual or multiyear fluctuations in prices, yields, or revenues. The new programs include those that pay producers when prices fall below a reference price or revenue level (Price Loss Coverage (PLC) and Agriculture Risk Coverage (ARC), respectively), and expanded crop insurance programs aimed at providing support for small or \"shallow\" revenue or yield losses. Despite the powerful effects of income volatility on farm household behavior and welfare and, also, despite the Government's new emphasis on income risk reduction, little empirical information exists about the extent of U.S. farm household income volatility, its variability across different household types and with different mixes of income sources, and the extent to which Federal programs mitigate income fluctuations. The dearth of information about U.S. farm household income variability largely stems from a lack of data tracking farm household income over time-that is, farm household panel data. Past studies of farm income variability at the national level have relied on either aggregate or cross-sectional data. Aggregate statistics (e.g., the national mean or median income) can provide useful insight into how the sector as a whole fares from year to year, but they can mask considerable variation at the farm level (Mishra and Sandretto, 2002). In a given year, producers in one region might be thriving, whereas those in another region might be incurring losses from local drought or pest infestations. Figure 1 illustrates the difference between aggregate and individual farm income variability. The blue line shows the median national farm income for a commercial farm household (with at least $350,000 in gross cash farm income, adjusted for inflation) between 1999 and 2014 (from ARMS).   Farm Income ($1,000) Median income, all commercial farms Typical commercial farm The median farm income ranged from about $70,000 to $180,000, and the average magnitude of the change (positive or negative) between consecutive years was about $20,000. The median income varies much less than does the income of a typical farm. This is illustrated with the red line, which shows the annual farm income of a hypothetical typical commercial farm. Between 1999 and 2014, the farm has the same average income as the median commercial farm (about $120,000). However, the typical commercial farm's income varies much more from year to year-the median change between years (positive or negative) is about $86,000. Because the income of a typical commercial farm varies much more from year to year than does median farm income, the typical farm's income spans a wider range, and sometimes the household loses money on its farm operation. Studies using cross-sectional data (e.g., Mishra and El-Osta, 2001; can also provide only limited information about individual farm income variability. Because of inter-annual variation in commodity prices, policies, and yields, average farm income changes from year to year, and sometimes results in \"boom\" or \"bust\" cycles. Examining variation in income across farms at one point in time ignores this inter-annual variation and, therefore, underestimates individual farm income variation. The drawbacks associated with aggregate and cross-sectional data can be addressed with individual farm panel data that span several years. This report uses a newly constructed panel dataset to shed light on individual farm income variability. The panel is constructed by matching observations of farms that were surveyed more than once between 1996 and 2013 by the USDA Agricultural Resource Management Survey (ARMS)the most comprehensive survey of U.S. farm households. That panel nature of the data allows us to observe how farm and nonfarm income and program payments changed over time for the same household, which allows for an accurate assessment of inter-annual income fluctuations. Because the ARMS was not designed as a panel, the sample of repeat observations used here does not represent the farm population as a whole. However, the farms we observe display characteristics that are very similar, on average, to commercial farms. Hence, our sample should provide insight into income volatility for the types of farms responsible for most U.S. agricultural production. We develop several measures of income volatility that allow for negative farm or total household income. We compare income volatility for farm and off-farm income, and we compare total income volatility for farm and nonfarm households. We examine how income volatility differs between crop and livestock producers and farms of different sizes. We use a regression analysis to see how different farm and operator characteristics influence household income volatility, and we investigate trends in income variability across time. Next we disaggregate income volatility into several components: farm income, off-farm wage income, off-farm non-wage income, and farm program payments. We estimate the covariance of these components and trace how they contribute to overall income volatility. The analysis also shows the extent to which income variation from one source can offset variation from another source. Finally, we estimate how much program payments reduce income risk, and we estimate the benefits from payments to producers who would prefer less risk. By making assumptions about how much a farmer dislikes income variation, we can estimate how much the farmer would be willing to pay for two streams of risky income: (1) a stream that includes Government payments that help mitigate income risk, and (2) a stream without Government payments. The benefits from payments are calculated as the difference between what the farmer would be willing to pay for each of these income streams."}, {"section_title": "Data", "text": "For this analysis, we create a panel dataset using data from 18 years of the Agricultural Resource Management Survey (ARMS), an annual USDA survey carried out by the National Agricultural Statistics Service (NASS) and Economic Research Service (ERS) (USDA, ERS, 2015a). Although the ARMS is not a panel survey, some farmers are surveyed multiple times due either to random chance or to their agricultural importance within their State. We identify these repeat observations using the operator identification number. 1 For information on how ARMS defines income, see box, \"Defining Farm Household Income\" on page 6. Of a total of 229,073 farmers surveyed between 1996 and 2013, 37,945 were surveyed more than once. Of these, 29,511 were surveyed twice, 6,648 three times, and 2,182 four or more times (table  1). This report compares changes in income across 2 survey years. For farmers who were sampled more than twice, each interior pair of years was used to create an observation. 2 We drop observations where the span between the observations is greater than 5 years in order to keep the time between surveys relatively homogeneous. We also drop observations if the difference in operator age between two surveys was more than 7 years (which would imply that a different person is operating the farm). 3 We limit the study to family farms-operations where the operator and the operator's family own the majority of the business. These family farms represent about 98 percent of all farms over this period. The final panel sample consists of 27,515 observations. 1 NASS uses a multipart method to track operations and operators over time. For family farm operations without hired professional managers, the principal operator is tracked over time. For \"managed operations\" that use hired farm managers, the operation is tracked, and household information, including information on principal operator household income is not collected in most years. Managed operations and non-family farms are not included in this study. Table 2 displays some key household and farm characteristics for the panel sample, all farms that were surveyed between 1996 and 2013, and the subset of the full ARMS sample that are categorized as \"commercial farms\" according to the ERS farm typology (Hoppe and MacDonald, 2013). The two rightmost columns are calculated using sampling weights that account for the importance of each observation in the population. Commercial farms are defined as family farms with gross sales of at least $250,000 per year ($350,000 after 2010) or nonfamily farms with any level of sales. Under the higher sales threshold in 2010, commercial farms represented 9.9 percent of all farms and produced 79.0 percent of total output. Note: The \"panel sample\" consists of farms surveyed more than once between 1996 and 2013. \"All ARMS farms\" include all family farms surveyed between 1996 and 2013. \"ARMS commercial farms\" are all family farms with gross annual sales of at least $250,000 ($350,000 after 2010). Because non-family farms are not associated with a principal operator's household, these observations are excluded from the analysis. All values are deflated to 2012 dollars. Values for the panel sample are average values for the 2 years surveyed. In the final two columns, averages account for yearly sampling weights. Two observations were dropped because of negative sampling weights. SD = standard deviation. Source: USDA, Economic Research Service calculations using data from USDA, Economic Research Service's and USDA, National Agricultural Statistics Service's Agricultural Resource Management Survey (ARMS), 1996-2013."}, {"section_title": "Defining Farm Household Income", "text": "The total household income of family farms combines income from on-farm and off-farm sources. The Agricultural Resources Management Survey (ARMS) collects production and expense data from farm and ranch operators about their farm operation and about the off-farm income from members of the farm household. The figure below shows the composition of farm household income. Farm income is the sum of the operator household's share of farm business income (net cash farm income less depreciation), wages paid to the operator and other household members, and net rental income from renting farmland. In addition, some households report other farm-related income from operating a farm business other than the one being surveyed, and in-kind payments to household members for farm work. Off-farm income comes from earned and unearned sources. Earned income includes compensation from wages and salaries for household members and net earnings from operating other businesses. Unearned income is derived from interest and dividends from investments; transfer payments, such as pensions and unemployment benefits from both private and public sources; and other off-farm income, such as gifts or bequests. "}, {"section_title": "+ Box Figure", "text": ""}, {"section_title": "Components of Farm Household Income", "text": "As compared with the full ARMS sample (\"All ARMS farms,\" in table 2), the farm households that were surveyed at least twice between 1996 and 2013 (\"Panel sample\") tended to operate much larger farms and to produce more. On average, farms in the panel dataset received less income from offfarm sources, such as wages, and significantly more from farming. The panel sample had an average household income that was slightly more than twice that of the average farm. On the other hand, the panel sample also had characteristics that are similar to commercial farms (column 3). The farms in the panel had average farm, off-farm, and total household income that was roughly the same as commercial farms. In addition, the level of farm assets, total assets, and total debt was very close to the commercial farms. The fact that the farms in the panel were roughly comparable to commercial farms implies that our analysis should provide insight into income volatility for the larger scale operations that produce the overwhelming majority of agricultural output. Because the panel was a subset of the full ARMS sample, it is not possible to use the ARMS sample weights. The ARMS is designed to create a nationally representative cross-section of farms rather than a panel of farms, and the sample weights associated with repeat farms do not expand to a meaningful population. Hence, all sample statistics reported that use the panel dataset are calculated without using sample weights and are not representative of the population of all farms."}, {"section_title": "Measures of Household Income Volatility", "text": "A substantial number of studies have used panel data to examine the income volatility of nonfarm households-usually seeking to identify how volatility varies across income categories and over time. Early studies focused on decomposing the cross-sectional variance in individual earnings into permanent and transitory components and on identifying time trends using the Panel Study of Income Dynamics (Gottschalk and Moffitt, 1994;Haider, 2001) or the Current Population Survey (Cameron and Tracy, 1998). More recent studies have examined trends in nonfarm income volatility using simpler measures of volatility, which are usually a function of the percent change in income over the previous year (e.g., Congressional Budget Office, 2008; Dahl et al., 2011;Dynan et al., 2012;Moffitt and Gottschalk, 2011;Shin and Solon, 2011;Ziliak et al., 2011). In this study, we modify some of the simple measures of volatility used in these studies to allow for negative farm or total household income. One simple measure of variation in income across 2 years that allows for negative values is the absolute value of the change in income (|y ity is |), where y is and y it are the incomes of household i in year s and t. Another easily interpreted measure of income dispersion is the standard deviation (SD) of income: If income varies randomly year to year and is normally distributed, then about 68 percent of the time, realized income will fall within one SD of mean income, and about 95 percent of the time, it will fall within two SDs of the mean. The absolute change and the SD indicate the magnitude of income fluctuations over time, but they do not take into account the size of the change relative to expected income. Similarly sized income changes could have different implications depending on the household's expected income. For example, it is likely that a $10,000 income change will have much larger welfare and behavioral implications for a household that normally earns $50,000 than it would for a household with an expected (average) income of $250,000. One measure of volatility that is scaled by average income is the absolute value of the arc percent change (AAPC): where y i − is average income across the 2 years: y i − = 0.5 * (y it + y is ) The arc percent change is often used instead of the percent change as a measure of income volatility because the arc percent change is symmetric regarding increases or decreases in income and it is bounded between -200 and 200 (Dyan et al., 2012;Hardy and Ziliak, 2014). The second factor is particularly important when we are dealing with a skewed distribution with large changes from year to year. The AAPC is bounded by 0 and 200. The coefficient of variation (CV), which is the SD divided by the mean, is a second measure of income volatility scaled by average income. If the CV is large, then income varies widely relative to the mean, whereas if it is small then income usually falls within a narrow range around the mean. The absolute value of the coefficient of variation (ACV) of income allows for possible negative mean income values: Unlike the AAPC, the ACV is not bounded. When households have a very small average income, the ACV can be extremely large, which can skew regression parameters. For example, consider a small farm household that earns $20,000 one year and suffers a loss of $18,000 the next year. This corresponds with an average income of $1,000 but a standard deviation of 26,870. The ACV is 26.9, which is a large outlier. To address this problem, we use the natural logarithm of the ACV as the dependent variable in the regressions. The log transformation reduces the influence of the outliers and makes data conform more closely to the normal distribution. A measure that is commonly used to examine trends in volatility for nonfarm households is the standard deviation across farms of the arc percent change (SDAPC) (Dahl et al., 2011;Ziliak et al., 2011;Dyan et al., 2012). Unlike the previous measures, the SDAPC does not measure volatility for an individual household, but rather for the sample, or a subsample, at one point in time: and N is the number of farms in the sample. Following the literature, average income is defined as: y i − = 0.5 * (|y it | + |y is |) to allow for possibly negative incomes in the first or second periods."}, {"section_title": "Farm Household Income Volatility-An Overview", "text": "To illustrate the scale of household income volatility for a typical farm household, we first examine income changes from one year to another for farms that earned between $75,000 and $125,000 in the first survey year (fig. 2). 4 While income changes between the first and second years centered on zero, a substantial share of farms had increases or decreases in income of at least $100,000. The wide range of income changes was also reflected in the distribution of second-year income for the same group of farms ( fig. 3). The average second-year income centered on the average value of firstyear income (about $100,000), but most farms earned less than $75,000 or more than $125,000the initial range of income in the first year. A significant share of households earned less than $0 or more than $200,000 in the second year. The total household income volatility (see figs. 1 and 2) was driven mainly by the volatility of farm income rather than off-farm income. For the same group of middle-income households (those that earned a total income between $75,000 and $125,000 in the first year), net farm income varied widely in the second survey year, and a substantial share of households experienced negative net farm income ( fig. 4). In contrast, almost all second-year off-farm income was positive, and the distribution of off-farm income was clustered between $0 and $100,000 (fig. 5). Change in total household income between the first and second period for households with first-period total income between $75,000 and $125,000  Second-period farm income for households with first-period total income between $75,000 and $125,000 Second-period total household income for households with first-period total income between $75,000 and $125,000  Table 3 presents a number of measures of volatility of farm, off-farm, and total income. 5 The measures of income volatility defined in the previous section confirm that farm income is much more volatile than off-farm income. The absolute median change between periods for farm income was $86,462, which was 80 percent more than the median farm income ($48,057). In contrast, the median absolute change in off-farm income was $16,793, which was about half the median off-farm income ($33,037). Similarly, 46 percent of households in the sample experienced negative farm income in at least one of the two periods, and 14 percent had negative farm income in both periods. In contrast, off-farm income was negative in either period for less than 0.1 percent of the sample. The measure of income volatility relative to average income also shows that farm income was more volatile than off-farm income. The absolute arc percent change was 125 for farm income compared with 94 for off-farm income. Similarly, the absolute coefficient of variation of farm income was 1.35 versus 0.67 for off-farm income. Because farm income is a large component of total household income, total household income is quite volatile, with an average absolute percent change of 105 percent. In addition, 26 percent of the sample had negative income in at least one year, while 4 percent had negative income in both years. Second-period off-farm income for households with first-period total income between $75,000 and $125,000  Note: 354 of all farms are not classified as livestock or crop producers because they had no production in the year of the survey. These farms may have received farm income from sources such as land rent, sales of stored inventory, or conservation payments on non-producing lands. The term \"years\" refers to survey years. SD = standard deviation. CV = coefficient of variation "}, {"section_title": "Farm Households Versus Nonfarm Households", "text": "How does the income volatility of farm households compare with that of nonfarm households? Using data from the Current Population Survey, Hertz (2006) reports that the median absolute change in household income between consecutive years was $10,874 in 1997-98 and $11,345 in 2003-04, which was approximately 25 percent of median income. In contrast, the farms in the ARMS panel had a median income change between periods of $100,925, which was approximately the same as their median income (see table 3). Part of this difference between farm and nonfarm households might be explained by the fact that we observe farm income changes over a longer time span. However, even for the sample of 1,821 observations that were surveyed in consecutive years, the median income change was $88,490. Further evidence that farm households have more volatile income than nonfarm households is provided by examining the percent of households that experience an increase or decrease in income of at least 50 percent. Dahl et al. (2011) find that about 9 percent of nonfarm households had income changes of at least 50 percent between consecutive years. In contrast, we find that among the 85 percent of farm households with positive household income in the first year, two thirds (66 percent) had a total household income change of at least 50 percent. 6 Even among the sample of farm households surveyed in consecutive years, we find that 58 percent had their income change by at least 50 percent. For nonfarm households, Dynan et al. (2012) find the standard deviation of the arc percent change of household income averaged about 50 percent since the mid-1990s using data from the Panel Study of Income Dynamics. Dahl et al. (2011) find the same measure averaged around 30 percent using the Survey of Income and Program Participation and Social Security Administration data. These values are substantially below the 126 percent that we estimate (see table 3), confirming that farm households have much more volatile income than typical nonfarm households. Although the total household income of farmers is more volatile than for nonfarmers, farm income does not appear to be more volatile than income from nonfarm self-employment. A Congressional Budget Office study (2008) found that the standard deviation of the arc percentage change in selfemployment income ranged between 140 and 150 from 1992 to 2003, which is similar in magnitude to the variability of farm income (143). The higher total income volatility of farm households is driven partly by the fact that farmers receive some income from on-farm sources, and as discussed previously, this income is more volatile than off-farm income. However, there appears to be more to the story: the nonfarm income of farm households is also relatively volatile. For farm households, the standard deviation of the arc percent change of off-farm income is 118 percent-well above the total income volatility of nonfarm households (which is 30-50 percent) (Dynan et al., 2012;Dahl et al., 2011). Similarly, among the 86 percent of farm households that reported positive off-farm income, 56 percent had income that changed by at least 50 percent (49 percent of those surveyed in consecutive periods also had large income changes). This is much higher than the 9 percent of nonfarm households (Dahl et al., 2001). Also, farm households had a median absolute change of off-farm income of $16,793-much higher than for nonfarm households. It is possible that farm households have particularly volatile off-farm income because their off-farm labor decisions are influenced by their highly volatile farm income. That is, unlike nonfarm households, farm households may adjust their off-farm employment to compensate for fluctuations in farm income. We explore this hypothesis later in the report when we disaggregate total income variability into farm and off-farm components."}, {"section_title": "Factors Associated With Income Volatility", "text": "What operator and farm characteristics are associated with high income volatility? Do the type of commodity produced, the size of the operation, the region, or the operator's education have an influence?"}, {"section_title": "Crop Versus Livestock Farms", "text": "One way to shed light on how income volatility varies across farms is to compare two broad types of producers: those that specialize in either crop or livestock production (last two columns of table 3). 7 Crop farms constitute about half of the sample (51.6 percent) and have about the same assets as livestock farms (a median value of $1.87 million versus $1.73 million for livestock farms). In addition, crop farms' households earn about the same amount working off farm as livestock farms' households (with median off-farm incomes of $34,647 and $31,847, respectively). Crop and livestock farms differ mainly in how much they earn from farming. Crop farmers earn significantly more agricultural income than livestock farmers (which is more volatile than off-farm income) and, therefore, experience larger absolute changes in household income from year to year. Crop farms have higher total household income volatility than livestock farms have, as measured by both the AAPC and ACV. However, the measures of farm income variability relative to average farm income do not indicate that crop income is riskier than livestock income. That is, both of our volatility measures -the absolute arc percent change in farm income and the coefficient of variation of farm income -are similar for both types of farms."}, {"section_title": "Farm Size", "text": "Farm size is another important dimension for comparing income volatility. In the United States, most farms are small scale, and most farm households obtain most of their income from off-farm sources. However, most agricultural output is produced on large-scale operations by operators whose primary occupation is farming. One way to illustrate how total income volatility varies with farm size is to look at the income distribution in the second year for farms with different first-year incomes ( fig. 6). As first-period income increases, both the mean and variance of second-period farm income increases. We can also compare income changes for households categorized by their farm assets ( fig. 7). The income change over time centers on zero for all sizes of farms, but the income change varies much more for larger farms. Figures 5 and 6 suggest that absolute income volatility increases with farm size, but it is not clear what underlies this increase. To better understand, we calculate several measures of volatility of farm and off-farm income for households in four farm asset categories (table 4). We use the value of farm assets rather than farm income or sales as a measure of farm size because farm assets vary much less from year to year. As expected, farms with more assets earned more farm income and experienced larger absolute changes in farm income (see table 4). Although mean absolute income change increases a lot with farm size, farm income variability increases only slightly, relative to farm income, with farm size: the arc percent change increases from 123 to 127 and the coefficient of variation increases from 1.32 to 1.36. Hence, between years, a typical large farm can expect a slightly bigger percentage change in farm income than can a small farm. Distribution of total second-period income for farm households, by first-period total income category   Although households in all four size categories had similar levels of off-farm income, the riskiness of off-farm income increases substantially with farm size: the AAPC increases from 80 to 107 and the ACV increases from 0.57 to 0.76. Hence, between years, a typical large farm can expect a substantially bigger percentage change in off-farm income than can a small farm. It is possible that larger farms, with more assets and higher average incomes, are able to indulge in riskier off-farm investments. Alternatively, households with large farms may be more likely to use the off-farm labor market as a response to farm income shocks, rather than as a constant source of income. In sum, large farm households have a larger share of their total income coming from farm income, which is riskier than off-farm income, and they have more volatile off-farm income. These two factors combine to make total household income more volatile for larger farms than for smaller farms: as shown in the bottom part of table 4, the AAPC of total income increases from 88 to 118 and the ACV increases from 0.81 to 1.24 as the farm size increases. The higher volatility means that households operating larger farms are more likely to experience years with negative household income despite having higher average household income. Even though the probability of having negative farm income in any given year declines as farm size increases, the probability of having negative household income in at least one of the two observed periods increases from 17 percent for the smallest farms to 33 percent for the largest farms. The finding that larger (and higher average income) farms have more volatile household income contrasts with the nonfarm sector, where studies have consistently found less income volatility among higher wage earners and higher income households (Hertz, 2006;Dahl et al., 2011;Shin and Solon, 2011;Moffit and Gottschalk, 2011;Hardy and Ziliak, 2014). The positive correlation between larger farm sizes and incomes and volatility for farm households is driven by the fact that households operating larger farms derive more of their income from relatively risky on-farm sources."}, {"section_title": "Regression Analysis", "text": "The summary statistics illustrate differences across farms distinguished by a single characteristic (crop/livestock specialization or farm size). We can use a multivariable regression analysis to understand how a number of farm and operator characteristics are associated with farm and total income variability. 8 The regressions have the form: where X i includes exogenous grower and operation characteristics, Year i is the midpoint year between observations, and Region i is a State dummy variable that is included to account for differences in soil quality and weather associated with each State. The parameter y on the year variable indicates the annual rate of change in volatility. The model is estimated with the errors clustered by State in order to account for sample design without using weights. 9 Several earlier studies have used regression analyses to explore the volatility of farm business income using data from certain U.S. States, Canada, or Europe (e.g., Schurle and Tholstrup, 1989;Purdy et al. 1997;Poon and Weersink, 2011;Enjolras et al., 2014). A potential problem arises when researchers include endogenous factors among the explanatory variables. Endogenous explanatory variables are determined, in part, by the dependent variable (income volatility, in our case). Potentially endogenous variables include measures of risk mitigation such as Government program participation, farm enterprise diversification, borrowing, and off-farm labor participation. These variables are not only likely to affect income risk, but also to be influenced by income risk. For example, farmers who face higher production and income risks (e.g., from pest or weather hazards) are more likely to purchase crop insurance, diversify their production, borrow more, or work more off farm. As a result, we might observe a positive correlation between income risk and these risk mitigation strategies in a regression, even though the strategies lower risk compared with what it would be otherwise. Therefore, it is impossible to meaningfully interpret the estimated parameters or the direction of causality when endogenous variables are included in the regression. For this reason, we only use variables such as operator age or farm location that are likely to be determined independently of income risk. That is, we only include factors that influence volatility, but are not influenced by it. Table 5 shows summary statistics for the variables used in the regression. 10 We use the logarithm of the absolute coefficient of variation (Ln ACV) as a measure of volatility. A model using the ACV as the dependent variable produces very similar results, in terms of parameter significance and sign, but the Ln ACV permits interpreting the coefficients in terms of percent change and better fits the data. 11 As shown in the table, there was a gap of about 3 years between when the average farm was first surveyed and when it was next surveyed. Just over half of farms produced mainly crops. The sample is close to evenly divided among the four farm asset categories. Most operators (93 percent) completed at least high school, and 28 percent completed at least 4 years of college. About 85 percent of operators report farming as their primary occupation. Operators have an average age of 53. "}, {"section_title": "Regression Results", "text": "The regression results indicate that crop farms have a total household income that is about 9 percent more volatile than livestock farms (table 6). 12 Farm income is about 5 percent more volatile on crop farms than on livestock farms. 13 Note this result diverges from the comparisons reported in table 3, which did not control for differences in farm or operator characteristics between crop and livestock farms. In a separate regression (not reported here), we found that, for cattle farms, farm income volatility was 5 percent lower and, for dairy farms, it was 9 percent lower than for cash grain farms. The regressions results are similar for total household income volatility. Farm income might be less volatile on livestock farms because of the prevalence of marketing and production contracts. It is also possible that crop yields are inherently more variable than livestock yields as crops are more vulnerable to weather and pests. The parameters on the farm size indicators are consistent with the summary statistics discussed above (see table 4). While the differences in farm income volatility between small and large farms are relatively modest, the differences in total income volatility are substantial. Households with at least $3 million in farm assets have farm-income volatility that is about 10 percent greater than the smallest farms, but have total income volatility that is 59 percent greater. Total household income is more volatile on larger farms because larger farms have riskier off-farm income and because they derive a greater share of their total income from the farm. Volatility of farm income and of total income are both substantially lower if the principal operator has more education. High school graduates had farm-income volatility that was 6 percent lower than operators who did not graduate from high school. Operators with at least 4 years of college had volatility that was about 9 percent lower. The negative correlation between education and income volatility was even stronger for total household income. Operators with a college degree had total household-income volatility that was 19 percent lower than those who did not graduate from high school. Higher income volatility for the least educated farms is consistent with findings for nonfarm households (Ziliak et al., 2011). Likely contributing to negative correlation between education and volatility is the fact that the study period spanned the Great Recession-a period in which lesseducated workers faced larger increases in unemployment than better educated workers (Hout and Cumberworth, 2012). The statistically significant coefficients on age and age-squared indicate that farm-income volatility varies over the lifecycle of the operator. At the average age of 53, an additional year increases farm income volatility by about 0.2 percent. The increase in farm-income risk with age might stem from the fact that older farmers tend to operate larger farms. In contrast, there was no statistically significant association between age and total household-income volatility. Many older farmers are likely to be retired from off-farm occupations and to qualify for stable retirement annuities and Social Security payments. It is possible that, for older farmers, a more stable off-farm income compensates for the slightly riskier farm income. Being married for both survey years is associated with a 6-percent decrease in farm-income volatility and a 23-percent decrease in total household-income volatility. Compared with single individuals, married couples likely have a larger share of household labor earning income from less volatile off-farm sources, which reduces total income variability. Regression analysis (1996-2013): What factors explain farm and total income variation? (1) "}, {"section_title": "Evolution of Income Volatility Over Time", "text": "Much research has documented changes over time in income volatility among nonfarm U.S. households (e.g., Congressional Budget Office, 2008;Dahl et al., 2011;Dynan et al., 2012;Moffitt and Gottschalk, 2011;Shin and Solon 2011;Ziliak et al., 2011). Most of these studies find more income variability in the 1980s than in the 1970s and flat trends in variability during the 1980s and early 1990s, though findings differ for more recent periods. Farm households-commercial farm households, in particular-respond to different economic forces than do nonfarm households. For example, the general economy saw unemployment spike with the Great Recession in 2007 and 2008, followed by a slow recovery and sluggish wage growth over the next 4 years. In contrast, the farm economy boomed over this period, with net cash farm income more than doubling between 2007 and 2012 because of increases in both production and agricultural prices (USDA, ERS, 2015c). In addition, a set of agricultural policies influence farmhousehold income while having little effect on the incomes of nonfarm households. Because farms respond to different economic conditions and policies than do nonfarm households, it is plausible that farms have also experienced different trends in income volatility. Figure 8 shows farm, off-farm, and total income volatility (ACV) plotted over the span of the dataset. Because each observation is a single measure of income volatility between 2 years, we use the midpoint of those 2 years as the date on the graphs. Hence, each point represents the average ACV for all the farms at that midpoint. The graph shows a declining trend in volatility for all income types. Total income volatility fell about 10 percent over the study period. Although the aggregate trends suggest a decline in income volatility over the study period, these results could be misleading if the composition of the panel sample changed over time. For example, if the share of crop farms in the sample or average farm size declined over time, we might observe a decrease in volatility even if individual farm volatility did not change, or even increased. The regression analysis addresses this issue by accounting for farm characteristics. The negative and significant coefficients on the year variable (the midpoint between the 2 years the farm was surveyed) confirm a declining volatility trend. The coefficient indicates that the volatility of farm income declined about 0.7 percent per year and total income by 1.2 percent per year. These outcomes are about the same magnitude as the linear estimates in figure 8. There are several possible explanations for why farm income volatility declined over the study period. It may be that changes in farming technologies and practices (e.g., increased use of genetically engineered crops, no-till farming, Global Positioning System (GPS) technologies, precision agriculture, irrigation, etc.) reduced yield variations. Farm income volatility may also have moderated because of changes in how farmers manage risk, including a greater reliance on contracting (the value of production under contract increased roughly 10 percentage points between 1991 and 2007) (O'Donoghue et al., 2011). Farm income includes net payments from agricultural programs and crop insurance. The reduction in risk over time may have resulted from an expansion in risk mitigation programs and the Federal crop insurance in particular. Acres enrolled beyond the most basic catastrophic coverage level increased from 117 million acres in 1996 to 280 million acres in 2013, and Federal subsidies to purchase insurance increased from $720 million to $6.6 billion in constant 2009 dollars over the same period (USDA, RMA, 2015)."}, {"section_title": "Decomposition of Income Variation", "text": "Total income can be decomposed into four broad components: farm income, farm program payments, off-farm wage income, and off-farm non-wage income. How much did each source of income contribute to total income variation? Hardy and Ziliak (2014) decomposed nonfarm household income into income from the household head, spouses, Government transfers, taxes, and other income using 2-year panels from the Current Population Survey. The authors measured volatility using the variance of the arc percent change in income. This approach is not feasible for farm households because of the frequency of negative household income. Instead, we measure income volatility as the variance of income, which is always positive and which lends itself to a straightforward decomposition (see box \"Method Used To Decompose Income Variation\"). This approach was used by Mishra and El-Osta (2001;2005) in an application that used cross-sectional rather than panel data. As discussed above, the variation in income across farm households (as opposed to across time for the same households) will not reflect the variations in income due to annual fluctuations in weather, crop prices, and other factors."}, {"section_title": "Method Used To Decompose Income Variation", "text": "To decompose income variation, let be the income from component j for household i in year t. Assuming each of these four income components varies randomly from year to year, the variance of total household income is the sum of the 4x4 covariance matrix with elements Cov (y it j , y it k ). That is: Var y Cov y y where each covariance term is computed for each observation as where each household is observed in two periods, denoted s and t, and y If income components, such as farm income and off-farm wage income, are negatively correlated, then the total variance will be lower than if these income sources were positively correlated. The contribution of the j th component to total income variability is the sum of the elements of the j th row of the 4x4 covariance matrix: The sum of the four variance components is the total income variance: . So the share of the j th component in total variance is"}, {"section_title": "Contribution of Income Components to Total Variance", "text": "For the average farm in the sample, table 7 shows the covariance matrix for the four main income components divided by the total variance. Hence, the sum of each column (or row) shows the share of each income component in total variance, CS(y i j ). The sums indicate that farm income contributes 77 percent of all income variation, off-farm wage income 10 percent, off-farm non-wage income 10 percent, and farm program payments 3 percent. As shown in the first row (or column), total income risk is substantially mitigated by the negative correlation between net farm income and the other three income sources. The variance of farm income alone is 107 percent of total income variance. However, because farm income is negatively correlated with the other three income sources, its total share of household income volatility is only 77 percent. The covariance of program payments with off-farm income sources is small and negative, which slightly reduces total income risk. Similarly off-farm wage income is slightly negatively correlated with off-farm non-wage income. Covariance of income components divided by total income variance: all panel farms, 1996-2013 "}, {"section_title": "Income Component Variance Shares by Farm Type", "text": "Next, we estimate the variance components' shares for all farms and separately for primary crop and primary livestock producers by farm asset quartile (table 8). The results display several patterns about the contributions of farm income, program payments, and wage and non-wage income to total variance. For all farm types and sizes, farm income contributes the largest share of variation to total income, and the share of farm income in total variation increases from 61 percent at the lowest farm asset class to 90 percent at the highest for crop farms, and from 49 percent at the lowest asset class to 87 percent at the highest for livestock farms. In each asset category, farm income contributes a larger share to total variance for crop farms than it does for livestock farms. Although farm income on crop farms is not significantly more volatile than farm income on livestock farms (in terms of the arc percent change or coefficient of variation), farm income is more volatile than off-farm income, and crop farm households receive a larger share of their income from the farm than do livestock farm households. This finding likely explains the larger contribution of farm income to total income volatility for crop farm households. Conversely, the share of off-farm income (both wage and non-wage) in total variance decreases as farm assets increase for both crop and livestock farms. Off-farm income contributes 41 percent (24.3 + 16.6) of total variation for the smallest farms compared to only 9 percent (2.6 + 6.3) for the largest. This difference reflects the declining share of off-farm income in total income as farm size increases. Larger operations also incur more risk from non-wage income (6 percent of total risk) than from wage income (3 percent). In contrast, the smallest farms incur less risk from non-wage income (17 percent of total risk) than from wage income (24 percent). This pattern reflects the relative importance of non-wage income for larger scale operations. Farm program payments comprise about 17 percent of total income but contribute only 3 percent of total income variation, reflecting the negative covariance between payments and farm income. Interestingly, for crop farms, the contribution of payments to risk declines as farm asset size increases, but for livestock farms, it increases as asset size increases. Possibly, the large crop farms receive a relatively larger share of payments from risk-mitigating sources (e.g., counter-cyclical payments or disaster relief), but large livestock farms do not receive a larger share of more riskmitigating payments. Overall, payments as a share of income are much lower for livestock operations than for crop operations, which likely explains why payments have a lower contribution to income variation for livestock operations. "}, {"section_title": "Farm Program Payments' Effects on Household Income Risk and Well-Being", "text": "One way to observe how farm program payments or net crop insurance payments affect income risk is to estimate and compare income volatility (measured with the standard deviation, coefficient of variation, or other measure) with and without the payments. Although changes in volatility provide insight into how payments affect income risk, these changes do not necessarily indicate whether a household is better off. Risk-averse individuals care about both their income level and income variation: they would be willing to trade some income for less risk. Most measures of volatility, including the SD and CV, do not capture the tradeoff between income and risk-an increase or decrease in either measure does not indicate whether an individual is better off. For example, a program that doubles positive farm income would also double the SD of income and would clearly make a farmer better off. On the other hand, a program that left average income the same but raised it in good years and lowered it in bad years would also increase the SD of income, but would make a risk-averse farmer worse off. A similar problem can arise with the CV. An increase in the CV does not necessarily imply a decrease in welfare, and likewise, a decrease in the CV does not necessarily imply an increase in welfare. To estimate how a risk-altering program affects welfare, we can compare the certainty equivalent (CE) income of survey respondents with payments from Government programs to those without payments from Government programs. The CE is the certain amount an individual would be just as happy to receive as the risky income source. Among risky alternatives, an agent will always prefer the one with the highest CE. The change in the CE resulting from a program is a measure of how much an individual would be willing to pay for the program payments. For a given payment, programs that reduce income variation more will generate a greater benefit (CE) per dollar. To compare the benefits of each dollar of program payments, we can compute the CE per dollar. Estimating the CE requires making assumptions about how individuals trade off risk versus return-that is, assumptions about individuals' utility functions. As detailed in the appendix, if we assume individuals have a negative exponential utility function and income that is normally distributed, then the additional certain benefits from having an income with Government payments (p) compared to an income with no payments (np) is The additional benefit increases with the increase in expected income (first term in parentheses) and decreases with the increase in the variance of income (second term). The extent to which the benefits decrease with the variance depends on the risk aversion coefficient r and the farmer's wealth W. A farmer will value a reduction in income variance more if he or she is more risk averse (r is larger) or less wealthy (W is smaller). As discussed in the appendix, a number of studies have estimated individuals' risk aversion coefficients. Estimates of the relative risk aversion coefficient r vary across studies and across individuals within studies, but they generally fall in a range between 0 and 4. For this study, we use a midrange value of 2 and explore how the results change for lower and higher values of the relative risk aversion coefficient. This CE-comparison approach to estimating program benefits assumes acreage and other input decisions do not respond to the availability of Government programs. In fact, producers who participate in a program are likely to adjust their crop mix, off-farm work, and other decisions affecting household income (El-Osta et al., 2004;Ahearn et al. 2006;Goodwin and Mishra, 2004;Key and Roberts, 2009). These adjustments would allow farmers to offset, to some extent, the removal of the risk-reducing benefits of programs and would raise the CE of income without payments. For this reason, the CE-comparison approach used here would tend to overestimate the net benefits of the program. On the other hand, the fact that ARMS collects information only for a single calendar year could cause us to underestimate the risk-reducing benefits of payments. With data collected only for the calendar year, payments associated with the current calendar year's plantings that arrived after December 31 would not be reported, nor would payments from previous calendar year's plantings that arrived after January 1. When payments do not arrive in the same year, there is a weak link between payment levels and income, and we are likely to underestimate the inverse correlation between farm income and payments. This is likely to be a particular problem for counter-cyclical payments and Average Crop Revenue Election (ACRE) payments (see box, \"Major Types of Federal Agricultural Programs, 1996-2013\"). Because of a time lag between the harvest and when payments are delivered, a substantial share of farmers receive their counter-cyclical payments in the calendar year after the harvest."}, {"section_title": "Comparing Policies", "text": "For all farms and for crop farms and livestock farms separately, table 9 shows how the distribution of total household income and the CE changes with the addition of four types of Government agricultural program payments: direct, counter-cyclical, conservation payments, and other. (Crop insurance is included later for a smaller sample of farms.) The sample includes only farms first observed in 2004 or later, which is the first period in which the ARMS distinguished between the four categories of payments considered, as follows: Direct payments-fixed payments based on historic yields and crop types-are by far the largest category of payments, averaging $11,663 per farm (and $20,188 per crop farm). Counter-cyclical payments, such as those received from direct counter-cyclical payments (DCP) programs, Average Crop Revenue Election (ACRE), and Marketing Assistance Loans, average $3,860 per farm. Conservation payments-from the Conservation Reserve Program (CRP), Wetlands Reserve Program (WRP), Environmental Quality Incentive Program (EQIP), and Conservation Stewardship Program (CSP), and other programs-are the smallest category, averaging only $2,624 per farm. 14 14 Some types of conservation programs provide financial assistance for farmers adopting a particular conservation practice (e.g., implementing a nutrient management plan, installing stream-side or field-edge buffers, adopting no-till methods, or retiring cropland to grass or tree cover). If farmers would have adopted a conservation practice without the payment, then the payment can be considered \"pure\" income-farmers would have incurred the costs anyway. However, if farmers only adopted the practice because of the additional incentive provided by payments, then linked to the payments are some costs that would not have been paid had the farmer not adopted the practice. These payments, therefore, overestimate the net income from the program to some extent. We do not observe the extent to which payments are pure income. However, a recent study estimated that for some types of environmental payments-particularly, conservation tillage-a substantial share of farmers would have adopted the practice even without the payments (Claassen et al., 2014). \"Other payments\" include agricultural disaster assistance payments and market loss payments such as Milk Income Loss Contract (MILC) payments, tobacco buyout payments, and payments from all other Federal, State, or local programs, averaging $5,977 per farm. For each program category, income with the payments has a lower CV than income with no payments. This suggests that all types of payments reduce income risk, as measured by the CV. However, the magnitude of the reduction in the CV does not tell us which program is more effective at reducing risk on a per dollar basis. The reduction in the CV is largely proportional to the size of each program-commodity payments are the largest source of payments and they reduce the CV the most, followed by \"other\" payments and then conservation payments. The amount of risk reduction per dollar of payment is captured by the change in the CE per dollar. Consequently, we can accurately estimate net insurance payments only for farms with no livestock insurance. Therefore, we focus our analysis on the subsample of operations that are highly specialized in crop production (with at least 90 percent of total sales from crops). Even for these highly specialized crop producers (table 10), net crop insurance payments are not large-averaging $6,628 per farm-about a quarter as much as direct payment ($28,337). However, the CE per dollar of crop insurance payments is 1.38-each dollar received from crop insurance is worth $1.38 to the farmer, on average. The benefits per dollar from crop insurance are substantially higher than the other programs because crop insurance more effectively mitigates farm income risk. Finally, table 11 provides a sensitivity analysis for different levels of risk aversion. Greater risk aversion increases the value of all types of Government payments. For example, under the assumption of very high levels of risk aversion, a dollar of net crop insurance payments is worth $1.76 to farmers compared with $1.19 under low risk aversion. (A risk-neutral farmer would value a dollar of payments at exactly one dollar.) Although programs are valuable to growers because of their risk-reducing potential, it is worth putting this value into perspective. The average farmer for whom we have complete payments data (table 9) receives total payments (not including crop insurance) of $24,124, which represents only about 19 percent of total income without payments. As reported earlier (table 3), the average household has a median change in farm income between periods of about $86,000 (and mean change of $261,000). Hence, the scale of Government payments limits the extent to which payments can smooth income. However, it is worth noting that the payments are worth much more per dollar than farm income. For all farms, the average CE per dollar of income is only 0.70 (=$89,426/$127,177) (column 1, table 9). In other words, an expected (average) dollar of farm income is worth only about $0.70 to the farmer because farm income is so highly variable. That is, the farmer would have no preference between $0.70 of certain income and $1 of farm income, given the choice."}, {"section_title": "Conclusion", "text": "This study used a newly created panel dataset drawn from the 1996 to 2013 Agricultural Resource Management Survey (ARMS) to examine how income varies for individual farm households over time. The repeat observations form a sample with similar characteristics to commercial-scale farms-the type responsible for most U.S. agricultural output. The data show that farm households have much more volatile total income than do nonfarm households. The median change in total income between years was about eight times larger for the farm households than nonfarm households. Total household income for farmers is highly volatile mainly because farm income varies much more than off-farm income. The median change in farm income between periods was about 80 percent more than the median farm income. In contrast, for farm households, the median change in off-farm income was only about half the median off-farm income. Unlike for nonfarm households, where income volatility declines with average income, we find that income volatility increases with farm size. Total household income is more volatile on larger farms because operators of larger farms derive a greater share of household income from the farm and because they have more volatile off-farm income. Crop farms have, on average, more volatile total household income than livestock farms because crop farms are larger and derive more of their total income from farm sources and also because crop farm income is more volatile than livestock farm income. Crop farms also have more volatile farm income, which might be explained by the vulnerability of crops yields to weather and pest risks and the fact that a substantial share of livestock is produced under production and marketing contracts, which reduce income risks for farmers. Consistent with other studies of nonfarm households, we also find that household income is more volatile when the principal operator has less education. An examination of average income volatility over time suggests that farm and total income volatility decreased between 1996 and 2013. This finding was confirmed using a regression analysis that controlled for farm, operator, and regional characteristics. The decline in farm income volatility could be explained by a number of factors, including an increased reliance on production contracts, changes in the organization of farm businesses, or an expansion of the Federal crop insurance program. This study also examined the extent to which different components of household income (farm income, farm program payments, off-farm wage income, and other off-farm income) have contributed to, or mitigated, income variation. We find that farm income contributes the largest share to total income variation-about 77 percent for all farms and 90 percent for farms with at least $3.0 million of farm assets. We find that for the average farm, there is a negative correlation between net farm income and other sources of income, which substantially reduce total income volatility (compared with a situation where income sources are not correlated). This is strong evidence that diversification of income sources is an effective strategy used by farm households to mitigate household income risk. Finally, we examined the effect of different types of Government programs on income risk and welfare. We find that all types of program payments (direct, counter-cyclical, conservation, crop insurance, and other) reduce total income volatility (as measured by the coefficient of variation). Assuming that farmers are moderately risk-averse, we estimated that crop insurance payments provide the greatest benefits per dollar to producers-each net dollar received from crop insurance being worth $1.38 to recipients because of how much the payments reduce total income risk. Counter-cyclical payments are also valuable-each dollar of payments being worth $1.10 to farmers. Even direct payments, which are essentially fixed, are much more valuable than risky farm income on a per-dollar basis. The expected (average) dollar from farming is only worth about $0.70 to a riskaverse farmer because farm income is so highly variable. et al., 2011). With this method, individuals are typically presented with a list of decisions between paired gambles that differ in their probability of each payoff. The method can estimate coefficients of risk preferences, given assumptions about the form of the utility function."}]