[{"section_title": "Abstract", "text": "ABSTRACT A behavioral change in some western corn rootworm (Diabrotica virgifera virgifera LeConte) populations is threatening the effectiveness of crop rotation, a successful management strategy for controlling this pest. We created a set of simple meteorologic and behavioral models that can be used to predict the spread of the beetle infesting soybean (Glycine max (L.)) throughout the midwestern United States. We used data collected in Illinois, IN, MI, and Ohio to create maps of observations to evaluate the model. We displayed data on the maps using detection thresholds for western corn rootworm in soybean Þelds of 10 or 20 beetles per 100 sweeps and one or two beetles per yellow sticky trap per day. Counts greater than a detection threshold represent populations with a lack of Þdelity to corn (Zea mays L.) and adapted to circumvent corn-soybean rotation. Some of the models invoked a landscape-diversity function that included the proportion of noncorn, nonrotated soybean vegetation on farmland in each county (i.e., extra vegetation). The best model for the period from 1997 to 2001 is based on heavy-storm data, with distance that beetles spread each year reduced by the proportion of extra vegetation in a county. This version is superior to a previously published model and to two new models that do not consider landscape diversity. Most of the models predicted spread at too high a rate between 1997 and 2001, compared with observations, but a few new models with rates of spread reduced by a landscape-diversity function matched the observations relatively well. Results suggest that the conclusions based on a linear model using proportion of extra vegetation as the key parameter are likely to be robust. Thus, we hypothesize that as the landscape diversity represented by the proportion of noncorn and nonrotated soybean vegetation in a geographic region increases, the rate of regional spread of the rotation-resistant western corn rootworm decreases over several years."}, {"section_title": "", "text": "THE WESTERN CORN ROOTWORM (Diabrotica virgifera virgifera LeConte) is the most serious insect pest of corn grown after corn (Zea mays L.) in the mid western United States (Levine and Oloumi-Sadeghi 1991) . The adults of the univoltine western corn rootworm are present in cornÞelds from June through frost. From late July through September, oviposition occurs primarily in cornÞelds; few eggs are normally laid in other crops. The eggs overwinter in the soil, and hatch begins in late May and early June. The larvae can survive only on the roots of corn and on the roots of a limited number of grasses (Levine and Oloumi-Sadeghi 1991) . Thus, growers have managed western corn rootworm by rotating corn crops with soybean crops (Glycine max (L.)) or another noncorn crop.\nThe model proposed by Onstad et al. (2001) for the resistance of western corn rootworm to rotation emphasizes the widespread adoption of a corn-soybean rotation within a landscape that is primarily composed of these two crops. In areas of intensive corn-soybean rotation, larvae from eggs that are oviposited into and overwinter in soybean emerge in a cornÞeld the following spring. Alternatively, eggs laid in cornÞelds hatch the following year in a nonhost Þeld (i.e., soybean). Because western corn rootworm larvae do not feed on soybean, and eggs do not exhibit an extended diapause (Levine and Oloumi-Sadeghi 1996, Levine et al. 2002) , there is selection pressure in a landscape predominately rotated between corn and soybean that favors western corn rootworm that lay eggs in soybeans. Accordingly, OÕNeal et al. (1999) found a higher percentage of adult females in soybean Þelds than in cornÞelds during August, when western corn rootworms likely lay most of their eggs (Hein and Tollefson 1985) . As of 1997, more than 90% of the cropland in east-central Illinois is rotated corn and soybean, and Ͻ 10% is continuously grown corn (Onstad et al. 2001) . Furthermore, Onstad et al. (2001) used a model based on a single-gene locus for rotation-resistance to explain the occurrence of this phenomenon in east-central Illinois 16 yr after the western corn rootworm invaded Illinois. Although efforts to separate rotation-resistant individuals from the wild type have not been successful , Hibbard et al. 2002 , OÕNeal et al. 2002 , the sudden appearance and spread of injury to rotated corn is strong evidence for a rotation resistant population. Since the precise behavioral mechanism is not yet known, we use the expression \"rotation-resistant western corn rootworm\" to refer to populations that can persist in a landscape of rotated corn and soybean through an expansion of their ovipositional range to include soybeans. Onstad et al. (1999) described the Þrst dozen years of the geographic spread of rotation-resistant western corn rootworm. Model results supported the hypothesis that the population of western corn rootworm infesting soybean originated in Ford County, IL. The predictions of the simple model Þt an independent set of observations well on three of four fronts or directions up to 1997. Onstad et al. (2001) used a population-genetics model to show that landscape diversity in the form of noncorn, nonrotated soybean vegetation could slow the development of resistance to crop rotation. This process results from the Þtness cost of the rotationresistant, polyphagous phenotype distributing eggs randomly to soil covered by any vegetation. In the model, all larvae hatching outside of cornÞelds in subsequent years will die, reducing the Þtness of the phenotype. In this article, we improve the Þrst model of Onstad et al. (1999) and use it to study hypotheses that attempt to explain the spread of resistance before and after 1997. Our primary hypothesis is that increased landscape diversity slows the rate of regional spread of the rotation-resistant western corn rootworm over several years."}, {"section_title": "Materials and Methods", "text": "Observations of Spread. We used data collected in Illinois, IN, MI, and Ohio to create maps of observed infestation of soybean by western corn rootworm. Data from 1986 to 1997 were reported by Onstad et al. (1999) . For the period from 1998 to 2001, we collected trap data for Illinois, OH, and Michigan. These are Pherocan AM yellow sticky trap captures (OÕNeal et al. 2001) , based on at least four traps per soybean Þeld, deployed from mid July through late August to monitor adult rootworm activity. For the same period for Illinois and Indiana, we also measured beetle captures in 100 sweeps of a sweep net (38-cm diameter) in soybean Þelds.\nThe number of counties sampled each year per state is shown in Table 1 , along with the range in the number of Þelds sampled per county. Indiana had roughly the same number of counties sampled each year, while the number of counties sampled in Illinois, MI, and Ohio varied over the 4-yr period. Although the counties of DuPage and Cook in Illinois and Marion in Indiana were within our predicted area of infestation and are surrounded by counties that exceeded detection thresholds, they were never sampled from 1986 to 2001 due to the difÞculty in Þnding soybean Þelds in the Chicago and Indianapolis metropolitan areas.\nWe created maps showing counties with soybean Þelds infested by western corn rootworm. We use the highest capture value from each county to create the maps and evaluate our model. To avoid including spurious captures of beetles, which at low numbers may simply represent adults straying or accidentally blown into a Þeld and subsequently caught in a net or trap, we used two detection thresholds when creating the maps (Onstad et al. 1999) . From 1979 to 1982, the maximum captures of western corn rootworm beetles ranged from less than 10 to almost 16 per 100 sweeps in soybean Þelds (Levine 1995) . Therefore, we concluded that the detection thresholds should be 10 Ð20 beetles per 100 sweeps (Onstad et al. 1999) . Any Illinois or Ohio data based only on damage to corn observed before 1997 is automatically considered above a detection threshold (Onstad et al. 1999) .\nWe used linear regression with a computer spreadsheet (Excel, Microsoft 2002) to relate data for the highest average beetles/trap/d for a county (MAXATC) to data for the maximum number of beetles/100 sweeps for a county (MAXSC) and, thereby, determine detection thresholds based on trap captures. Illinois was the only state in which both measurements were made for the same counties and years. For the 90 matching observations during 1998 and 2001, the equation and the standard errors for the coefÞcients are with an r 2 ϭ 0.66, and only the slope was signiÞcantly different from zero (P Ͻ 0.0001). We used equation two to calculate the detection thresholds for average trap capture. The values that match 10 and 20 beetles/ 100 sweeps are 1.34 and 1.96, respectively. We simpliÞed these to one and two beetles/trap/d for the maps. A county was marked as infested on the map if either the sweep net or sticky-trap data were above the detection threshold. We believe that counts greater than a detection threshold represent populations that lack Þdelity to corn and are adapted to the soybean-corn rotation First, we only used data recorded during the day between the hours of 0900 and 1200, and 1600 and 1900 because western corn rootworms do not ßy at night and were observed to have a low level of ßight activity during the afternoon (Isard et al. 2000) . Second, because Witkowski et al. (1975) observed western corn rootworms ßying only between 22.2ЊC and 27.0 ЊC, we included only wind speed data recorded between these temperatures. Based on these criteria, 1,944 hourly observations were used to calculate wind supported movement during a hypothetical summer.\nWe determined from the data of Coats et al. (1986) that sustained (migratory) ßights by beetles Ͼ 30 min occurred during 0.8% of observation hours under optimal ßying (i.e., ßight mill) conditions. Dividing 1,944 h by the 12 weather stations gives an average value of 162 h of potential ßight activity per location. Sustained ßight is expected to occur during only 0.008 by 162 ϭ 1.30 h. At the average of three km/h ßight mill speed for sustained ßights (Coats et al. 1986 ), a beetle can ßy 3.9 km without wind support during the 1.30 h.\nThe wave front of beetle dispersal will be determined by those ßying downwind. Although beetles actively ßy upwind, we do not expect them to ßy as far as those assisted by the wind. Table 2 shows the number of observations that have dominant vectors in the 18 directions (total 1,944) and mean wind speed for those dominant vectors. The mean wind speeds for the 18 directions ranged from 6.4 km/h to 10.3 km/h, with an overall weighted mean of 7.8 km/h. The Þnal column presents the calculated distance ßown with wind support. We assigned a weight of one to the direction with the highest number of observations. The beetles ßying to the northeast between 220Њ and 240Њ are expected to have the highest chance of ßying 1.30 h on migratory ßights. Other directions give beetles fewer opportunities to ßy the maximum possible distance. The ratio of number of observations to the maximum number determines the weight for each of the directions. To calculate wind supported ßight, we add 3.9 km to each of the distances that the wind blows over 1.30 h in each of 18 directions based on the average wind speed.\nModeling Eastward Movement by Storms. We used observations of heavy rainstorms and heavy raincells (i.e., areas through which rain passes) to calculate probability distributions for storm tracks. Huff and Angel (1992) described the orientation of 260 eastward moving heavy storms, with mean rainfall more than 2.54 cm, and the movement of heavy raincells in all directions, to calculate probability distributions of storm movement considered typical for the mid western United States.\nFollowing the storm-data analysis of Onstad et al. (1999) , we used the maximum distance of 33 km to simulate the rate of spread of the eastern wave front or leading edge each year. This wave front rate is hypothesized to be valid for any threshold of measurement used to deÞne the spread of the western corn rootworm. The sector from 240Њ to 260Њ had the highest number of observations based on eastward moving heavy storms (30%), and the sector from 240Њ to 270Њ had the highest number of observations based on the movements of raincells (22%). Based on these data, we used the maximum value of 33 km to model the distance traveled in these sectors. The distances for all other sectors of the heavy storm model in Table 3 were then calculated as (Z/30) ϫ 33, in which Z is the percentage of storms observed for a given sector. The distances for the raincell model in Table 3 were calculated as (Z/22) ϫ 33. Only sectors with higher movement based on storms compared with wind are presented in Table 3 and used in the modeling.\nModeling Movement Based on Vegetation. We obtained data on farmland and vegetation for each county in the four states for 1997 from the USDA Census of Agriculture (USDA 1997) . To determine the total amount of land covered by vegetation that will not likely be rotated to cornÞelds, we used the following approach. We deÞned any land planted to vegetation other than continuous corn or rotated corn-soybeans as extra vegetation. We deÞned \"F\" as acreage of farmland, \"C\" as acreage of corn, and \"S\" as acreage of soybean per county. The acreage of corn was calculated as the total acreage of corn grown for grain and seed plus the acreage grown for silage and green chop. For counties with more corn than soybeans in a given year, we deÞned acreage of extra vegetation, \"E,\" as F Ϫ (C ϩ S). For counties with more soybeans than corn in 1997, all the corn is assumed to be rotated, and the amount of land planted to rotated soybeans equals the amount of land planted to corn. We included the difference between the acreage of soybeans and corn as extra vegetation because the additional land planted to soybeans is assumed to be not rotated with corn and, therefore, is treated as extra vegetation. Therefore, for these counties, E ϭ (F Ϫ (C ϩ S) ϩ (S Ð C)) or E ϭ (F Ϫ 2C). We then calculated the proportion of extra vegetation per county as EV ϭ E/F.\nThe calculated values of extra vegetation (i.e., proportion of farmland in county) are presented in Fig. 1 . Figure 1 shows the eight categories used in the standard model. East central Illinois and western Indiana have the lowest levels in the region. The proportions increase in Ohio, MI, and northeastern and southern Indiana.\nSimulation Technique. We used the observations of Onstad et al. (1999) to determine the starting point of our model as the one km 2 grid cell 6.4 km north of Piper City (Pella Township, Ford County, IL) and to deÞne 1986 as year one of our model. We simulated the model for 16 yr from 1986 to 2001 using ArcGrid computer software (ESRI 2002) , calculated on a desktop computer (Dell, Austin, TX). Each year is a time step, and one km 2 is the size of each grid cell in the model.\nEach cell was assigned a value for proportion of extra vegetation. All cells whose centers were contained within a given county were assigned the value for extra vegetation associated with that county. Because of restrictions of the computer software, we had to deÞne categories of cells. We did this because the function we used within the software to simulate the wave front was not designed to input a unique value for each cell but, instead, performed calculations on large groups of cells. We deÞned eight categories for proportion of extra vegetation: 0 Ð 0.10, 0.10 Ð 0.20, 0.20 Ð 0.30, 0.30 Ð 0.40, 0.40 Ð 0.50, and 0.50 Ð 60, 0.60 Ð 0.70 and 0.70 Ð1.00. For each year, each cell used as a possible source of dispersal was grouped into one of these categories. To simplify computations, all map cells other than those deÞned as Lake Michigan or Lake Huron can be sources for insect dispersal.\nThe distances presented in Tables 2 and 3 were used as maximum distances of movement for each sector from 0Њ to 360Њ. We simulated the wave front based on these radii and the value for extra vegetation of each cell. We deÞned a linear model based on the heavy storm data presented in Table 3 as our standard model. This model used a linear effect to adjust the radii used for each cell, depending on which category of extra vegetation that cell was in. For all cells within each category, the maximum radius for each sector was multiplied by (1 Ϫ MEV), where MEV represents the mean value of extra vegetation for that category. For each year, the ArcGrib program calculates the distances traveled for each sector separately for each of the eight categories based on these adjusted radii. The adjusted radii used for each category extend from the center of all cells included within that category. If it encompasses the center of another cell, that cell is completely included in the area infested for that year, and the wave front is rounded off to the nearest cell. Huff and Angel (1992) .\nc Distance in km dispersed each year with the maximum of 33 given to the sector with highest percentage and the distances for the others equal 33 ϫ %/max %.\nd Distances used for sectors 200ЊÐ210Њ and 330ЊÐ340Њ were based on wind data from 200ЊÐ220Њ degrees and 320ЊÐ340Њ degrees, respectively.\ne Sectors were 30Њ instead of 20Њ based on data presented by Huff and Angel (1992) . Sensitivity Analysis. To test the sensitivity of our standard model and hypothesis, we ran multiple variations of the model. We used the lowest value of extra vegetation (LEV) for each category to reduce the distance the wave front spreads each year. For all cells within each category, the maximum radius for each sector was multiplied by (1 Ð LEV). We also ran the model with a quadratic effect and using a power of 1.5 to adjust the radii of each category. These models multiplied the maximum radius of each sector by (1 Ϫ MEV**2) or (1 Ϫ MEV**1.5). Another variation used a threshold value of EV. As usual, 1-MEV was used to adjust the radii of all cells within categories of extra vegetation Ͼ0.30, but all cells with extra vegetation Ͻ0.30 did not have the radii adjusted (multiplier of 1). Alternative Hypotheses. We tested other hypotheses that might explain the decrease in the rate of spread of rotation-resistant (soybean inhabiting) western corn rootworm. First, we repeated all simulations described previously using the raincell storm data rather than heavy storm data (Table 3) in the model. Second, to test the validity of our models based only on wind/storm data and behavioral characteristics of the western corn rootworm, we ran each model without extra vegetation as a parameter and with no limiting factors. These models tested the hypothesis that wind/storm data alone was sufÞcient to model the spread of western corn rootworm populations. Third, we tested the effect of an environmental factor besides landscape diversity that could reduce the distance of dispersal uniformly in all directions, by running each model without extra vegetation as a parameter but with a constant limiting factor of 0.15 or 0.20. For these models, the maximum radius of each sector was multiplied by 0.85 or 0.80, respectively, regardless of the value of extra vegetation for that cell. These models tested the hypothesis that there is another environmental factor besides landscape diversity that could better predict the rate of spread of western corn rootworm populations.\nQuantitative Comparison of Simulations. For each year from 1997 to 2001, we measured the area of all counties that exceeded either of our two detection thresholds. We focused on these years because the quantity and quality of the sampling data before 1997 did not permit a formal analysis. For each model, we measured the area of counties over a given threshold that were included within the predicted wave front for that year (i.e., correctly predicted). We then measured the area of counties included within the predicted wave front for each year but which did not exceed either one or both thresholds, giving us the area the model overpredicted. To evaluate quantitatively each model, we used Y ϭ (A Ϫ B)/T, where A is area correctly predicted by model inside of wave front, B is area overpredicted by model, and T is total area of counties over the detection threshold. A perfect model would produce a Y value of 1.0.\nWe ranked our 17 models starting with a rank of one for the model having the highest Y. We tested our rankings using a Spearman rank correlation coefÞcient and a Kendall ô -test using statistical software (SAS Institute)."}, {"section_title": "Results", "text": "Figure 3 presents the observed infestations of soybean by western corn rootworm over time in Illinois, IN, MI, and Ohio. The counties are shaded according to the year during which western corn rootworm adults were Þrst observed in soybean. The rootworm has expanded its range in Illinois to the west, north, and south. The southern, eastern, and northern fronts in Indiana, OH, and Michigan, respectively, did not change much after 1997. This result indicates that some factor has limited the spread of the rootworm on these fronts. The number of counties with observations greater than the lower and higher detection thresholds are 77 and 70 in 1997, and 99 and 91 in 2001, respectively. Examination of our observation maps using spatial analysis tools within the ArcMap software program (ESRI 2002) showed that the rate of spread of the western corn rootworm variant was signiÞcantly slower from 1998 to 2001 than from 1986 to 1997. Analysis of the counties over the higher detection threshold indicated that the rate of spread from 1986 to 1997 was Ϸ27 km/yr to the east and 8.5 km/yr to the west. From 1998 to 2001, the rate of spread slowed to Ϸ16 km/yr to the east and 7.75 km/yr to the west. With the lower detection threshold, the rate of spread from 1986 to 1997 was Ϸ33 km/yr to the east and 8.5 km/yr to the west. From 1998 to 2001, the beetles did not signiÞcantly spread to the east and spread to the west at a rate of 7.75 km/yr.\nThe quantitative comparison of all the models is presented in Tables 4 and 5 . The Spearman coefÞcient between the ranking based off the thresholds of 10 beetles/100 sweeps and 20 beetles/100 sweeps indicated a high degree of concordance, r s ϭ 0.91176, and was signiÞcantly different from zero (P Ͻ 0.0001). The Kendall ô between the two thresholds also indicated a high degree of concordance, i.e., t ϭ 0.77941, and was statistically signiÞcant (P Ͻ 0.0001). Based on these results, we determined that the rankings of our models based on the two thresholds were highly correlated and that using the average ranking between the two thresholds was appropriate. The best model for the period between 1997 and 2001 is the standard model (Table 4) based on heavystorm data, with distance that the beetle spread each year reduced by MEV (i.e., mean proportion of extra vegetation for each of the eight categories). This version is clearly superior to the old model of Onstad et al. (1999) and to the two new models that lack a landscape-diversity function (multiplier of 1.0, Table 4 ). Most models predicted spread at too high a rate between 1997 and 2001. Therefore, they over predicted the spread for this period, as indicated by the Y values Ͻ 0.60 in Table 4 . In general, the models based on the raincell data of Table 3 did not perform well.\nQuantitative analysis of Table 5 indicates that the top three models overall ranked Þfth to seventh in 1997. The heavy-storm models improved over time, and the raincell models lost accuracy with time. Thus, as the rate of spread in the rotation-resistant population declined, the heavy-storm models performed better than the raincell models. This trend indicates that a raincell model would likely continue to be less accurate over time. The top two models in Table 4 (i.e., heavy-storm models with multipliers of 1-MEV and 1-LEV) maintained Y values greater than 0.60 throughout the 5-y period. All other models had Y values less than 0.60 in some years (Table 5) . Figure 4 shows how the results of the heavy-storm models compare with the observations. The dark contour lines represent the twelfth (inner line for 1997) and sixteenth (outer line for 2001) years of the model simulations. The standard model (Fig. 4a) performs relatively well by 2001 but failed to predict the earlier infestations in Ohio. Switching to a multiplier of 1-LEV produced a slightly better prediction on the eastern front in Ohio and Michigan (Fig. 4b) . The use of a threshold level of extra vegetation (30%) improved the 1997 predictions, especially in Ohio, but, by 2001, the predicted wave front is too far southeast, southwest, and even in Wisconsin (Fig. 4c) . The results with a multiplier of 1 Ϫ MEV**1.5 were similar to those with the 30% threshold (Fig. 4d) . The model based on the constant reduction of 20% in distance traveled per year (i.e., a reduction similar to values of EV in the central part of the region [ Fig. 1]) , has results for 2001 that were second only to those of the standard model ( Fig. 4e ; Table 5 ), and were certainly better on the western edge.\nWhile comparing the results of the best raincell models with the observations, both models performed very well up to 1997 (Fig. 5) . The model with the same multiplier (1-MEV) as our standard model overpredicts the spread into Ohio and Wisconsin in 2001 (Fig. 5a) . The other raincell model has a constant reduction of 20% in distance traveled each year. It predicts the western edge well in 2001 but pushes the northeastern, eastern, and southern fronts much farther than the other top models (Fig. 5b) .\nRaincells refer to individual convective cells or what we conceptualize as big cumulus clouds/thunderstorms, while heavy storms refer to the larger system (typically referred to as a front) in which many raincells are usually embedded. Updrafts associated with raincells are much more localized, and may draw fewer western corn rootworms into the cells compared with the more extensive updrafts associated with the convection cells that line the front and essentially sweep across the central United States. Thus, one possible explanation for why the heavy storm models outperformed the raincell models over time in our modeling is that most of the western corn rootworms move in association with larger systems.\nThe results shown in Tables 4 and 5 , and in Figures 4 and 5 suggest that a few hypotheses are worth investigating in the future. Note that changing the multiplier from (1 Ϫ MEV) to (1 Ϫ LEV) had very little effect on the heavy-storm model results ( Fig. 4 ; Table 4 ). This effect suggests that the conclusions based on a linear model using extra vegetation as the key parameter are likely to be robust. Thus, we hypothesize that as the landscape diversity represented by the proportion of noncorn and nonrotated soybean vegetation in a geographic region increases, the rate of regional spread of the rotation-resistant western corn rootworm decreases over several years. We also hypothesize that the rotation-resistant western corn rootworm cannot persist over the long-term in small areas with high landscape diversity. The size of the area and the amount of vegetation must be quantiÞed in the future. "}, {"section_title": "Discussion", "text": "Factors other than landscape diversity may help explain the spatial distribution of rotation-resistant western corn rootworm. Onstad et al. (2001) suggested that a landscape with at least 20% continuouslygrown corn could also slow the development of rotation resistance. OÕNeal et al. (2002) showed that western corn rootworm feeding on corn foliage was inßuenced by corn phenology. Corn phenology was also observed to inßuence the consumption of soybean leaves. More soybean leaf area was consumed in the presence of corn from late reproductive stage (postanthesis) than younger, vegetative stage corn. OÕNeal et al. (2002) suggested that the larger numbers of western corn rootworm found in soybean than cornÞelds, as observed by OÕNeal et al. (1999) , may thus be due primarily to dispersal from cornÞelds with a growth stage that is unattractive as a feeding site. Future modeling should attempt to clarify corn phenology and the proportion of continuously grown cornÞelds in each county, but this would require extensive data collection.\nIt is noteworthy that the modeled maximum rate of spread of 33 km/yr is less than the 44 Ð125 km/yr, observed during the original west to east invasion of western corn rootworm into such states as Illinois, IN, MI, and Ohio during the 1970s (Ruppel 1975 , Clement et al. 1979 , Metcalf 1983 , Onstad et al. 1999 . Of course, the early invasion did not involve a major Þtness cost associated with oviposition outside of cornÞelds.\nOur best models did not predict the infestation of counties in central Michigan, but this lack of accuracy may be explained by the following observations. In 1999 and again in 2001 in Clinton County, central Michigan, we observed high numbers of western corn rootworm in a soybean Þeld but did not observe signiÞcant root injury, or large numbers of adults emerging from this Þeld when it was rotated to corn the following year. Thus, it is difÞcult to determine whether this is a rotation-resistant population. Bordering this particular soybean Þeld was corn grown for silage, which can be chopped in August, as was the case in 1999. In Clinton County, 30% of the farms raise cattle; nearly a third are dairy farms. This result contrasts with Berrien County, southwestern Michigan, in which large numbers of beetles have been trapped. In Berrien County, only 9% of the farms raise cattle, with only 25 dairy farms (less 2% of the total number of farms in the county). None of the soybean Þelds monitored in Berrien County were bordered by silage corn.\nOur analysis was limited by the resolution of our observations and the scale at which we could feasibly represent these data. Five teams, each consisting of one to three scientists, have collected the observations in the past. This process is probably adequate to study a large-scale phenomenon. However, only three to Þve Þelds could typically be sampled in each county. Because of the resolution of the samples and the county-level reporting of USDA Census of Agriculture data (for extra vegetation), we chose to analyze the observations and model results using a county as our basic spatial unit. A more sophisticated geographic information system would use maps of farmland, parks, and forests to represent vegetation better. A more systematic collection of samples, perhaps based on a grid, could be used in the future to measure the rotation-resistant beetle population. However, in both cases, more time, money, and labor would be required.\nBecause of the limitations in our data described previously, we decided not to reÞne the models further. We did try to Þnd the best-Þtting model by systematically varying exponents and thresholds for MEV or LEV. We did not try to Þnd a better variable than either of these. A constant multiplier other than 0.80 and 0.85 may have been better, but we believe that the models should not be considered precise tools. We emphasize their qualitative characteristics and ecological relevance.\nTwo aspects of climate should be investigated in the future. Future modeling work could limit ßight hours to times at which wind speed greater than the canopy (1.0 Ð1.5 m) is Ͻ1.5Ð2.0 m/s. Van Woerkom et al. (1983) and Isard et al. (1999) observe little or no ßight activity greater than these wind-speed thresholds. However, wind speed is rarely recorded at these heights at weather stations. Furthermore, Isard et al. (1999) observed ßight activity below 22.2ЊC and above 27.0ЊC. Thus, future modeling could explore the consequences of relaxing the limits used in the current modeling effort."}]