[{"section_title": "Abstract", "text": "Understanding species richness patterns represents one of the most fundamental problems in ecology. Most research in this area has focused on spatial gradients of species richness, with a smaller area of emphasis dedicated to understanding the temporal dynamics of richness. However, few attempts have been made to understand the linkages between the spatial and temporal patterns related to richness. Here, we argue that spatial and temporal richness patterns and the processes that drive them are inherently linked, and that our understanding of richness will be substantially improved by considering them simultaneously. The species -time -area relationship provides a case in point: successful description of the empirical spatio-temporal pattern led to a rapid development and testing of new theories. Other areas of research on species richness could also benefit from an explicitly spatio-temporal approach, and we suggest future directions for understanding the processes common to these two traditionally isolated fields of research."}, {"section_title": "INTRODUCTION", "text": "A major goal of ecology is explaining why some regions have more species than others (e.g. Brown 1995; Rosenzweig 1995; Hawkins 2001) . One approach to this problem is spatial: predicting and evaluating patterns of variation in species richness among local communities distributed across a geographical region. Spatial patterns of richness are among the best-known and most-studied patterns in ecology: the latitudinal gradient of species richness (Rosenzweig 1995; Hillebrand 2004) , the species -area relationship (SAR; Rosenzweig 1995; Harte et al. 2009 ), elevational richness gradients (Terborgh 1977; McCain 2005) , the relationships between productivity or habitat heterogeneity and richness (e.g. Currie 1991; Kerr & Packer 1997) , and the relationship between local species richness and that of the regional pool (Ricklefs 1987; Harrison & Cornell 2008) . Studying these patterns has provided information about the maintenance of diversity at large spatial scales, the importance of immigration and extinction in regulating richness and the role of the abiotic template and biotic interactions in niche partitioning and species' turnover.\nHowever, spatial patterns at any given time are the result of dynamic processes playing out over potentially long periods (Preston 1960) . Thus, studies of temporal variation in richness within a local community represent a complementary approach for explaining geographical patterns of richness. While richness dynamics are a traditional focus of palaeontology (Sepkoski 1978; Sepkoski et al. 1981; Alroy et al. 2008) , the temporal patterns of richness on ecological time scales have received much less attention than their spatial analogues (White 2007) . Recent work has focused on predicting the response of species richness to global change (Sax & Gaines 2003; Thomas et al. 2004) , understanding the apparent stability of species richness despite major changes in species composition (Brown et al. 2001) , and on theoretical questions related to species coexistence (Chesson 2000) . Of course, these dynamic processes do not operate in isolation from the surrounding region but are embedded in, and influenced by, the spatial contexts in which they occur (e.g. Ricklefs 1987; Mouquet & Loreau 2003; Leibold et al. 2004 ). Yet, research integrating spatial and temporal approaches is even rarer than purely temporal studies. The scarcity of spatio-temporal research reflects differences in focus between temporal and spatial richness research and the lack of high-quality long-term data. Even in palaeontological studies where long-term data are readily available for many groups, there has been little integration of spatial and temporal patterns.\nOur goal in this paper is to promote the integration of spatial and temporal richness research by showing how it can advance ecological understanding and by outlining directions for future work. This integration has yielded valuable insights in other areas of ecology including succession, stratigraphy and species distribution modelling, and we suggest that it can yield equivalent insights in the study of richness. Here we: (i) review and discuss a successful linkage of spatial and temporal patterns of richness-the speciestime -area relationship (STAR); (ii) discuss other areas of richness research that would benefit from this approach and how we might begin to take an integrated spatio-temporal approach to understanding them; and (iii) discuss general theoretical and empirical directions for future research in this area. This is not meant to be an exhaustive review of the research areas where spatial and temporal patterns of richness have been, or can be, linked. Instead, we proceed by highlighting a few recent examples of the benefits of this approach and attempt to point the way forward for using greater integration of spatial and temporal approaches to understand one of the longest studied and most pressing questions in ecology."}, {"section_title": "LINKING SPATIAL AND TEMPORAL RICHNESS:", "text": "A CASE STUDY (a) Introduction One of the best explored linkages between spatial and temporal richness patterns is the relationship between the spatial and temporal scaling of richness described by the STAR (Adler & Lauenroth 2003; Adler et al. 2005) . We start by reviewing the relevant spatial and temporal patterns in isolation, address the recent empirical synthesis and explore theoretical explanations for this spatio-temporal relationship. While there are a number of forms of both the SAR (Scheiner 2003) and species -time (STR; Carey et al. 2007) relationships, here we focus on the fully nested form of the relationships.\n(b) Species -area relationships The SAR describes the observed increase in the number of species identified as the area sampled increases. The SAR is one of the most studied patterns in ecology (e.g. Connor & McCoy 1979; Rosenzweig 1995) and is observed on both island systems and within subsets of mainland regions (Drakare et al. 2006) as well as on geological time scales (Sepkoski 1976; Barnosky et al. 2005; Raia et al. 2010) . Although there may be substantial variation in the exponent (Fridley et al. 2005; Hurlbert & Jetz 2010) , the SAR is often well described by a simple power function (figure 1c; Rosenzweig 1995) . Nonetheless, other quantitative forms may also be appropriate (Connor & McCoy 1979; Tjorve 2003; Guilhaumon et al. 2008) . Understanding observed variability in the SAR is important for a basic understanding of richness patterns (e.g. MacArthur & Wilson 1967; Rosenzweig 1995) and for conservation applications (Guilhaumon et al. 2008) . White 2007). While this pattern was originally viewed as the result of simple sampling processes (Fisher et al. 1943; Preston 1948) , it also reflects ecological and evolutionary patterns of temporal species turnover (White 2004; White et al. 2006 ) and has been demonstrated on geological time scales (Rosenzweig 1998; McKinney & Frederick 1999; Raia et al. 2010) . Like SARs, STRs tend to be well fit by power functions (McKinney & Frederick 1999) , although the slope and the general form of this relationship vary among regions, ecosystems and taxonomic groups (White et al. 2006; White 2007) .\n(d) Interactions between space and time An integrated spatio-temporal approach helps explain observed variation in the SAR and STR, because there is an interaction between the spatial and temporal scales at which species richness is sampled (Adler & Lauenroth 2003; Adler et al. 2005; McGlinn & Palmer 2009) . As the temporal scale of sampling increases, the exponent of the SAR decreases. Similarly, increasing the spatial scale of sampling decreases the exponent of the STR (figure 1). This means that some differences in observed richness scaling relationships may simply reflect differences in the scale of sampling. For example, some SARs are calculated based on a single annual sample of a community (e.g. a local plant census), whereas others are based on the accumulated flora for a region compiled from records spanning years or decades (e.g. Fridley et al. 2005) . This linkage between spatial and temporal scaling can be modelled using a simple empirical model based on a power function:\nwhere S is the number of species observed, A the area sampled, T the time span sampled, z 1 the exponent of the SAR at the unit time scale, w 1 the exponent of the STR at the unit spatial scale, and u characterizes the interaction between space and time (Adler et al. 2005) . Empirical analysis of nine assemblages including ecological data on plants, algae, invertebrates, zooplankton and mammals, and fossil data on mammals suggests that this interaction may be universally negative (Adler et al. 2005; McGlinn & Palmer 2009; Raia et al. 2010) .\n(e) Understanding spatio-temporal scaling theoretically Despite the apparently general nature of this linkage between spatial and temporal richness (Adler et al. 2005) , there has only been one attempt to explain this pattern theoretically. McGlinn & Palmer (2009) showed that a neutral model could produce the observed negative interaction between rates of spatial and temporal scaling under a range of parametrizations. However, a previous attempt to empirically evaluate neutral model predictions for observed spatial and temporal scaling-considered independently of each other-suggested that while neutral models could be parametrized to yield either realistic SARs or realistic STRs, they could not generate realistic predictions for both patterns (Adler 2004) . Thus, the potential for neutral models to explain the spatiotemporal scaling of richness requires further study.\nAn alternative framework for understanding the spatio-temporal scaling of richness is an entropy maximization framework (Harte et al. 2008 (Harte et al. , 2009 ). This approach postulates that observed SARs can be predicted by determining the most probable configuration of a community or assemblage given that the system level values of total numerical abundance, species richness and whole community metabolic rate are constrained to equal their observed values (Harte et al. 2008 (Harte et al. , 2009 ). In the species -area model, the exponent of the SAR is predicted to vary as a function of the ratio of the total number of individuals, N, to the total species richness, S. As a result, since N increases linearly with spatial scale and S increases less than linearly, the exponent of the SAR is predicted to decline with scale. This prediction successfully describes variation in the SAR across a range of spatial scales in bird and tree communities (Harte et al. 2008 (Harte et al. , 2009 .\nWhile maximum entropy models do not currently predict temporal patterns, it would be possible to modify these models to explain observed linkages between spatial and temporal scaling. The current approach generates spatial patterns, in part, from the clustering of individuals in two-dimensional space (Harte et al. 2008 (Harte et al. , 2009 ). To generate spatio-temporal predictions, we can consider time as a third dimension and then predict the probability of individuals occurring in blocks of different size. This approach predicts that the SAR exponent should decrease with the time scale of sampling because N/S should decrease in the same way with increasing temporal scale that it does with increasing spatial scale (N increases linearly with time while S increases less than linearly). Likewise the exponent of the STR should decrease with the spatial scale of sampling owing to the equivalent decrease in N/S. This prediction provides an alternative explanation for the universally observed form of the STAR, and addresses one of the weaknesses with the current empirical model for the STAR. When the power-law-based model is extrapolated to sufficiently large spatial and temporal scales, the exponents of the SAR and STR become negative (Adler et al. 2005) , which is an undesirable behaviour since expanding either scale should never decrease species richness. Moreover, STARs estimated on large time scales in fossil data do not become negative, behaving similarly to STARs estimated on ecological time scales (Raia et al. 2010) . A spatio-temporal version of Harte et al.'s maximum entropy model will lead both exponents to converge asymptotically to zero.\nBoth maximum entropy-based models and neutral models require testing to determine their ability to explain observed STARs. In addition, neither of these models is intended to operate at biogeographic spatial scales or evolutionary temporal scales where the SAR and STR accelerate (Williams 1943; Rosenzweig 1995; White 2007) . Therefore, spatiotemporal development of models designed to operate at these broadest scales ( (f) The importance of an integrated approach to understanding spatio-temporal scaling The strong and general interaction between the SAR and STR demonstrates that an integrated spatiotemporal approach is necessary to quantify and understand patterns of species richness. It is well known that patterns of species richness are dependent on the spatial scale of analysis (Rahbek & Graves 2001; Chase & Leibold 2002) , but the empirical form of the STAR suggests that these patterns will also depend on the temporal scale of interest and on the spatiotemporal linkages (White 2007) . Using heterogeneous ecological data to identify richness hotspots for conservation will require this integrated approach. It is a Figure 3. Illustration of the mass effect and its implications for the importance of habitat heterogeneity and the relative difference in temporal turnover among core and occasional species. Grid cells represent habitats with particular environmental conditions (colours) that make them differentially suitable to various species (circles). Any given habitat may support only a limited number of viable populations (large circles, core species), but occasional species (small circles) may also be present in a cell owing to immigration from adjacent cells. Cells occurring in heterogeneous regions with a more diverse regional species pool will therefore include a greater total number of species compared with a cell with similar conditions occurring in a homogeneous region. Because core species by definition have viable populations, there is low temporal turnover in species composition among this group. By contrast, occasional species are constantly colonizing from adjacent habitats and going extinct, resulting in high values of temporal turnover.\ncommon practice to use SARs to either scale up to estimate regional richness from local samples or to control for differences in sampled area among different regions (Scheiner et al. 2000; Barnosky et al. 2005) . The STAR shows that if there is heterogeneity in the time span over which regions have been censused then this must also be considered and that these two scale effects are inter-related. Finally, by evaluating both spatial and temporal patterns and their interaction, the STAR provides additional hypotheses for more rigorous testing of theoretical models (Adler 2004 )."}, {"section_title": "PRODUCTIVITY -RICHNESS RELATIONSHIPS", "text": "The relationship between productivity and species richness has been a major focus of ecological research (Waide et al. 1999) . At broad spatial scales, richness is hypothesized to increase with productivity for a variety of reasons (e.g. Wright 1983; O'Brien 1998; Hurlbert & Jetz 2010) . However, productivity often covaries with temperature, edaphic conditions, environmental stability and other variables, making it difficult to determine the independent contribution of productivity. While it may be difficult to distinguish the productivity -richness hypothesis from alternative hypotheses using spatial data alone, a spatio-temporal approach can help disentangle the environmental covariates. Hurlbert & Haskell (2003) combined spatial and temporal data to study the relationship between productivity and avian species richness. They complemented a traditional spatial approach, examining richness as a function of seasonal primary production in a region, with a temporal approach focused on seasonal changes in both productivity and richness. Richness increased with productivity across regional spatial gradients and also between seasons (figure 2). Migratory species were responsible for the seasonal increases in avian richness, demonstrating links between life history and species' responses to spatial and temporal variability. The consistent, positive relationship between richness and productivity in space and time (figure 2) provides strong support for productivity as a primary driver of richness gradients at continental scales.\nIn contrast to the continental scale pattern in birds, Adler & Levine (2007) found discordant relationships in space and time for prairie plants. While species richness of 1 m 2 quadrats increased across a regional precipitation gradient (a proxy for productivity in water-limited plant communities), richness was not higher in wet years than dry years. Adler & Levine (2007) argue that the contrasting patterns reflect processes operating on different time scales. Increases in species richness across the regional precipitation gradient are the long-term outcome of biogeographic processes such as colonization and extinction. By contrast, changes in quadrat-level species richness from year to year reflect demographic processes within established populations, rather than biogeographic species sorting.\nAn easy lesson to draw from these two case studies is that mobile organisms such as birds are better able to track temporal variability in productivity than sessile plants, leading to more consistent richness gradients in space and time. However, differences in the kind of temporal variability may be as important as the differences in dispersal. The seasonal fluctuations that Hurlbert & Haskell (2003) studied are highly predictable, making migration a winning strategy. By contrast, the interannual variability in precipitation that Adler & Levine (2007) addressed is not predictable and is thus more difficult for organisms to exploit (e.g. Venable & Brown 1988 ). The implication is that productivityrichness relationships are more likely to be similar in space and time when the temporal variation in productivity is highly predictable or coarse grained than when it is unpredictable or fine grained. Consideration of both spatial and temporal patterns can provide more rigorous tests of hypotheses as well as new insights about the underlying processes."}, {"section_title": "COMBINING LOCAL AND REGIONAL APPROACHES TO SPECIES RICHNESS", "text": "For decades, ecologists have debated whether species richness is determined primarily by local processes such as resource availability, interspecific interactions and environmental filtering, or by regional processes that are important in influencing rates of evolutionary diversification and long-distance dispersal (Ricklefs 1987 (Ricklefs , 2008 Harrison & Cornell 2008) . Conflicting perspectives and a lack of empirical integration between these two approaches have prevented consensus on the roles of regional and local processes in determining the richness of local assemblages (Harrison & Cornell 2008; White & Hurlbert 2010) .\nOne recent study demonstrated that integration of a temporal perspective helps disentangle local and regional processes. A spatial analysis showed that both local environmental variables and the richness of the regional species pool influenced the local species richness of North American birds (White & Hurlbert 2010) . However, the spatial approach did not provide clear inferences about the underlying local and regional processes. Varying the temporal resolution at which local species richness was measured (from a single annual survey up to 10 years of surveys combined), showed that the relative importance of local and regional scale processes depended on the time scale of analysis. As the time scale increased, the relative importance of the regional pool in determining local richness increased, while the importance of local environmental variables decreased.\nThe increasing importance of regional influences at longer time scales suggests a mechanistic explanation. Owing to dispersal or range shifts, individuals often occur in habitats where their long-term population growth rate is negative. As a result, the measured species richness of a site is typically greater than the number of species with viable populations at that site (figure 3; Schmida & Wilson 1985 , Pulliam 1988 . This leads to the potential existence of two classes of species in a community: core species, which can persist in the absence of immigration, and occasional species, which cannot. Different factors should be responsible for regulating the abundance and richness of these two groups (e.g. MacArthur 1960; Belmaker 2009). Specifically, the presence of an occasional species is Review. Spatio-temporal approaches to richness E. P. White et al. 3637 likely to depend more on the occurrence of the species in the surrounding region than particular conditions at the focal site. Therefore, the richness of occasional species will be strongly influenced by the richness of the regional pool, whereas core species richness is more likely to be determined by local constraints on richness (figure 3). As richness is estimated over longer time scales, the proportion of core species in the community will decrease, since their composition will be relatively constant while occasional species will turnover rapidly. The increasing proportion of occasional species at longer time scales explains the increasing relative importance of the regional scale processes, which primarily influence the dynamics of those species. Furthermore, the core-occasional species concept predicts a positive correlation between temporal turnover and regional heterogeneity (figure 3). Support for this prediction would suggest that most short time scale variation in richness is not being driven by resource availability or interspecific interactions within communities, but by stochastic colonization -extinction dynamics from the regional pool, thus linking these results with those of Adler & Levine (2007) discussed above. This example shows how integrating a temporal perspective into traditionally spatial questions can facilitate more rigorous testing of the processes of interest and generate new, testable hypotheses that would not be evident through spatial approaches alone."}, {"section_title": "ENVIRONMENTAL HETEROGENEITY", "text": "Research on the impacts of environmental heterogeneity on species richness has involved both spatial and temporal approaches, but there has been little integration of these perspectives. Studies of spatial patterns of richness have shown that habitat diversity and landscape heterogeneity promote species richness (MacArthur 1958; Kerr & Packer 1997; Hurlbert & Haskell 2003) . This result is intuitive: if different species are adapted to different environments, then a heterogeneous environment will contain more niches and support more species than a homogeneous environment (see Amarasekare (2003) for a description of conditions necessary for spatial environmental variability to promote species diversity).\nTemporal environmental variability can also promote species richness (Armstrong & McGehee 1980; Chesson 2000) . Just as spatial heterogeneity provides niches for species with different environmental preferences, species can exploit temporal niches created by environmental fluctuations. If dispersal is the demographic mechanism that allows species to find their spatial niches, then dormancy, or high tolerance of unfavourable conditions, allows species to 'find' their temporal niche (Warner & Chesson 1985; Chesson 2000) . Unlike spatial heterogeneity, however, temporal fluctuations impose both costs and benefits because fluctuations increase the probability of stochastic extinction for all species (Boyce et al. 2006 ). Therefore, species richness should increase monotonically with spatial heterogeneity, but might peak at intermediate levels of temporal heterogeneity (Adler & Drake 2008) .\nEmpirical evidence for the relationship between temporal heterogeneity and species richness has begun to accumulate only recently. Field studies have focused on the population dynamics of interacting species to test mechanisms of fluctuation-mediated coexistence. Some of these studies support the hypothesis that environmental variability promotes coexistence (Warner & Chesson 1985; Adler et al. 2006; Angert et al. 2009 ), but in other communities the effect is quite weak (Adler et al. 2009 ). An alternative approach is to compare average species richness across sites characterized by different levels of environmental variability. In a rare example of this approach, Shurin et al. (2010) showed that temporal variability of water temperature was positively correlated with zooplankton species richness across 53 lakes. In fact, correlations between environmental variability and richness were stronger than correlations between the mean environment and richness. More broad-scale analyses of this kind are needed to complement the traditional focus on population dynamics.\nThe distinct spatial and temporal perspectives on environmental heterogeneity ignore the possibility of spatio-temporal environmental variation. Chesson (1985) distinguished between pure spatial variation, which is constant in time, pure temporal variation, which is constant in space and true spatio-temporal variation, which involves a space Â time interaction (figure 4). How these different kinds of variation influence coexistence should depend on the lifespan of the organisms and on which vital rates (e.g. recruitment versus survival) are affected by the environmental variation (Chesson 1985) . More recent theoretical work has shown that the scales of spatial and temporal variability important for coexistence cannot be easily predicted from life-history traits such as dispersal and dormancy (Snyder 2007) . Since some coexistence mechanisms are based on purely spatio-temporal mechanisms (Berkley et al. 2010) , focusing on spatial and temporal variation in isolation may lead to an incomplete understanding of diversity maintenance. To our knowledge, pure spatio-temporal coexistence mechanisms have not been investigated in natural systems.\nA better understanding of whether spatio-temporal mechanisms are important would be aided by the documentation of spatio-temporal patterns of environmental variation using long-term broad-scale climate data (e.g. U.S. Historical Climatology Network, http://cdiac.ornl.gov/epubs/ndp/ushcn/ushcn.html) and palaeontological datasets, and by linking these environmental dynamics with spatio-temporal richness patterns. One recent attempt using palaeodata found that analysis of STARs could yield spatio-temporal signals consistent with known patterns of spatiotemporal heterogeneity (Raia et al. 2010) . Similar studies on other palaeontological datasets and on long-term ecological datasets are necessary to determine the universality of these patterns."}, {"section_title": "FUTURE DIRECTIONS (a) Empirical", "text": "While studies of both spatial and temporal richness patterns represent core areas of ecological research, little effort has been invested in linking these approaches to yield an integrated spatio-temporal understanding of richness. One of the simplest approaches to linking spatial and temporal richness is to acknowledge that many spatial models already make temporal predictions or can be modified to include a temporal component. Evaluating spatiotemporal predictions from these models requires high-quality spatio-temporal data, which is becoming increasingly available from local studies (e.g. McGlinn et al. 2010) , coordinated broadscale surveys (e.g. the North American Breeding Bird Survey, Bystrak 1981; the U.S. Forest Inventory and Analysis programme, Woodall et al. 2010 ) and the fossil record (e.g. NOAA Global Pollen Database, Grimm & Keltner 1998; the Palaeobiology Database, www.paleodb.org; Miocene Mammal Mapping Project, www.ucmp.berkeley.edu/miomap/) . Spatio-temporal data will also help identify the spatial and temporal scales at which observed patterns are roughly equivalent. Preston (1960) was the first to identify these scales in the context of STR and SAR. Research in this area has continued in the STAR literature where these scales have been identified using combinations of scales at which spatial and temporal scaling exponents match (Adler & Lauenroth 2003; Adler et al. 2005; White 2007 ). This research should be expanded to include other patterns including correlates of richness such as productivity and heterogeneity. One of the most obvious benefits of determining the most similar scales of space and time is to improve the use of space for time substitutions. For example, spatial scales that reflect processes operating on a millennial scale should not be 'substituted' to investigate temporal processes at decadal scale. Quantitative estimates of scales of equivalence would help researchers avoid such mistakes, and help them choose appropriate scales for sampling.\nIn the case of coarse-grained continental to global scale richness patterns, the temporal scales of equivalence may be extremely long (Adler & Levine 2007) . In these cases, traditional long-term ecological data (on the order of 10-100 years) will not be sufficient for studying spatio-temporal linkages. Fortunately, palaeoecological databases can provide information on assemblage level richness at appropriate time scales. Many of these databases span thousands to millions of years and provide spatial coverage from regional to global scales. Unfortunately, palaeoecological data and perspectives are often underused in ecology (McKinney 1998) . It is particularly important to incorporate the fossil record into the future spatiotemporal research because without the use of palaeodata, it will not be possible to understand how space and time interact at the broadest scales or truly assess the role of evolution and history in structuring contemporary richness patterns. Future progress in this area will require increased interaction and collaboration between contemporary and palaeo ecologists.\n(b) Theoretical While we have outlined linkages between space and time for several well-known patterns of species richness, a true integration of spatial and temporal processes will require new theory. One of the challenges for theoretical development is the sheer number of spatial and temporal richness patterns that need to be explained. Rather than creating a theoretical model for each individual pattern, we should seek theories that can explain multiple patterns. Pattern unification recognizes that a number of different patterns studied by ecologists may be manifestations of the same core phenomena. For example, the SAR, the species-abundance distribution and the decline in compositional similarity with distance can all be related to one another through the simple characterization of the aggregated distribution of individuals within a species range (e.g. He & Legendre 2002; Harte et al. 2005; McGill 2010) . Expanding this approach to make it spatio-temporal will reduce the number of independent spatial and temporal patterns that need to be explained. Examples of the potential power of this approach come from the discussions of neutral theory and maximum entropy models as possible explanations for the STAR. Both of these approaches effectively produce the kind of simple statistical structure in the spatio-temporal distribution of individuals that have been used successfully in spatial pattern unification.\nA second priority for theory should be development of mechanistic models that are explicitly spatiotemporal in nature. Fortunately, many of the best approaches to modelling ecological systems are already dynamic and increasingly include either implicit or Review. Spatio-temporal approaches to richness E. P. White et al. 3639 explicit spatial structure. This kind of modelling dates at least back to island biogeography theory (IBT; MacArthur & Wilson 1963 , 1967 , which has expanded into individual-based neutral theories (NT) designed, in part, to explain high levels of richness (Caswell 1976; Hubbell 2001; Alonso et al. 2006) . Both models involve similar components: immigration from a larger species pool as a critical component of diversity maintenance, locally driven extinction dynamics, a focus on predicting local scale diversity patterns and an assumption that differences among species are not important for predicting species richness. Both models make explicit spatial and temporal predictions; for example, IBT predicts that both species richness and temporal turnover of species are higher on islands closer to the mainland pool and that both richness and turnover are lower on larger islands than on smaller islands. However, assessment of the temporal predictions of both models has received much less attention than their spatial predictions (but see Simberloff & Wilson 1969; Brown & Kodric-Brown 1977 , Clark & McLachlan 2003 McGill et al. 2005) .\nDespite their abilities to make spatial and temporal predictions, NT and IBT are limited in their utility for general research into spatio-temporal structuring of richness because they are either focused on specific assumptions (i.e. all species are demographically equivalent) or designed to apply to specific landscape configurations (i.e. the mainland -island linkage). However, both IBT and NT are special cases of more general metacommunity models, which have great potential for exploring spatio-temporal richness patterns. Metacommunity models examine how linking multiple communities through dispersal can impact the ability of species to coexist at local and regional scales (Mouquet & Loreau 2003; Leibold et al. 2004) . Metacommunity models meet the basic requirements for modelling spatio-temporal impacts on richness: (i) a spatially explicit component to the model (e.g. communities across a landscape), (ii) processes that influence species composition over time (e.g. changing environment, variable dispersal rates, competitive exclusion), and (iii) linkages between the spatial and temporal components and the species composition at local and regional scales. Metacommunity models can be adjusted to emphasize different structuring processes such as dispersal limitation, local control over colonization and the importance of niche differences among species (Leibold et al. 2004) , resulting in a rich array of system types in which to explore how spatio-temporal processes interact to affect richness patterns.\nFocusing on the spatio-temporal predictions of metacommunity models will improve both the utility of metacommunity models for understanding existing richness patterns and our ability to identify which of the major classes of metacommunity model are operating in a particular system. One of the challenges for empirically testing metacommunity models, outside of tightly controlled experimental protocols, is that static spatial patterns (e.g. Cottenie 2005) suffer from the standard challenges that multiple models can potentially predict the same observed pattern, thus making process differentiation problematic. One approach for overcoming this weakness is to increase the number of patterns predicted and tested for a given model (McGill 2003; McGill et al. 2007) , by taking advantage of the distinct temporal predictions of different metacommunity models (e.g. Jabot et al. 2008) ."}, {"section_title": "CONCLUDING REMARKS", "text": "Progress in creating an integrated spatio-temporal approach to species richness is particularly important given the need to understand the response of ecological systems to global change. Increasingly, ecologists are being asked to predict long-term trends in richness and provide scientifically sound management plans for its maintenance. By definition, prediction requires an inherent understanding of the ecological processes underlying richness. While we can infer process from spatial or temporal patterns in isolation, using the two in combination can substantially improve our power of inference. The benefits of an integrated spatio-temporal approach include: (i) resolving apparent inconsistencies in spatial or temporal richness patterns and greater integration of palaeontology and ecology; (ii) identifying the scales at which different processes operate (e.g. colonization and extinction versus resource competition); (iii) identifying the scales at which space-for-time substitutions are appropriate; (iv) accounting for spatio-temporal coexistence mechanisms that a purely spatial or purely temporal approach would miss; and (v) generating new, testable hypotheses and allowing more rigorous testing of theoretical models. A full understanding of patterns of species richness and the processes that drive them will require an integrated spatio-temporal approach.\nE.P.W. and S.K.M.E. would like to thank Diane Ernest for providing them with the time to write, without which this paper would never have been completed. We thank John Harte and Xiao Xiao for conversations regarding the potential application of entropy maximization to these problems, and Robert Colwell and an anonymous reviewer for comments on the manuscript. This work was partially supported by a grant from the U.S. National Science Foundation to EPW (DEB-0953694)."}]