[{"section_title": "", "text": "This report presents findings of the second follow-up in the Baccalaureate and Beyond Study, a longitudinal study which is tracking students who received a bachelor's degree in academic year 1992-93. Major findings indicated that: (1) when they graduated from college, 85 percent of the degree recipients expected to earn an advanced degree; by 1997, 30 percent had actually enrolled, 21 percent had either attained a degree or were still enrolled, and 9 percent had left without a degree; and that (2) overall, 89 percent of the original group were employed in April 1997, 76 percent were working only, another 13 percent were combining school and work, 5 percent were enrolled only, and 6 percent were neither working nor enrolled. Following an executive summary, the main body of the report analyzes findings concerning educational expectations in 1993 and 1997; progression to graduate and first-professional education; and actual participation in graduate and first-professional education. A compendium presents tables showing data on the employment and enrollment status of 1992-93 college graduates. A glossary and technical notes are appended. (DB) ******************************************************************************** * Reproductions supplied by EDRS are the best that can be made * * from the original document."}, {"section_title": "Executive Summary", "text": "When followed up in 1997, 1992-93 college graduates as a group were well established in the labor force, with 89 percent employed (figure A). Not all had finished their formal education, however: 18 percent were enrolled for an advanced degree or certificate (13 percent combining school and work, and 5 percent enrolled only). The remaining 6 percent were neither working nor enrolled (with females about twice as likely as males to be in this situation).  in their expectations between 1993 and 1997; steps they took to prepare for study at the graduate or first-professional level (taking the necessary examinations, applying for admission, and being accepted); their enrollment; and their progress toward advanced degrees if they did enroll. A compendium of tables and highlights from the tables following the essay detail aspects of graduates' employment in April 1997 (including how much they are working, their occupations, and their salaries), their experiences with unemployment since they graduated, and various characteristics of their primary jobs in April 1997."}, {"section_title": "Graduate and First-Professional Education Educational Expectations", "text": "When asked about their educational plans in 1993, a large majority of 1992-93 bachelor's degree recipients (85 percent) reported that they expected to earn a graduate or first-professional degree sometime in the future. By 1997, the percentage with this expectation had declined to 72 percent. There were some differences by gender and raceethnicity in terms of the percentages with advanced degree expectations and how expectations changed over time. In 1993, female graduates Executive Summary were slightly more likely than male graduates to have advanced degree expectations (87 percent versus 83 percent). By 1997, however, the difference had diminished, and they were about equally likely to expect to earn an advanced degree (73 percent of females and 71 percent of males). In 1997, black and Hispanic graduates were more likely than white graduates to expect to earn an advanced degree (85 percent and 79 percent versus 70 percent, respectively). Advanced degree expectations dropped more for whites (15 percentage points) between 1993 and 1997 than for blacks (4 percentage points). Undergraduate borrowing did not seem to discourage graduates from considering advanced degrees. In 1993, borrowers and nonborrowers had similar expectations, an(d in 1997, borrowers were actually more likely than nonborrowers to report advanced degree expectations (74 percent versus 70 percent). Changes in graduates' advanced degree expectations differed depending on their original degree expectations. The percentage of bachelor's degree recipients who expected to earn a master's degree as their highest degree decreased slightly between 1993 and 1997 (from 58 percent to 54 percent), while the percentage expecting to complete a doctoral degree declined sharply (from 21 percent to 12 percent). The percentage expecting to earn a first-professional degree was similar in both years (about 6 percent)."}, {"section_title": "Progression to Graduate and First-Professional Education", "text": "One of the first steps toward admission to an advanced degree program is to take one of the ad- Undergraduate debt may discourage students from continuing their education. Bachelor's degree recipients who had borrowed for their undergraduate education were slightly less likely than nonborrowers to have applied for admission to a graduate or first-professional program (38 percent versus 42 percent). The amount borrowed did not seem to make a difference, however. Students' performance in college was positively associated with applying, being accepted, and enrolling (table A). Graduates with cumulative grade-point averages (GPAs) of 3.5 or above at their baccalaureate institution were at least twice as likely as those with GPAs under 2.5 to apply, and about three times as likely to enroll. Among the 50 percent of graduates with GPAs of 3.5 or above who applied for admission to a graduate or first-professional program, 91 percent were accepted. Eighty-three percent of those who were accepted enrolled. "}, {"section_title": "Participation in Graduate and First-Professional Education", "text": "Most post-baccalaureate enrollment by 1997 was at the master's level. Of the 30 percent of the 1992-93 bachelor's degree recipients who had enrolled in an advanced degree program by 1997, about three-quarters were pursuing a master's degree (10 percent were seeking an MBA and 66 percent were working on other master's degrees). Another 14 percent were enrolled in a firstprofessional degree program, and the remaining 10 percent were enrolled in a doctoral program. Men and women were equally likely to enroll in a graduate or first-professional program, but gender differences in the types of degrees pursued were pronounced. Three-quarters of enrolled women were in a master's degree program other than an MBA, compared with about half (54 percent) of enrolled men. In contrast, men were twice as likely as women to enroll in an MBA program (14 percent versus 6 percent). Men were also more likely than women to enroll in a first-professional program (18 percent versus 10 percent) or doctoral program (13 percent versus 7 percent). Differences existed by raceethnicity as well. For example, Asian/Pacific Islander graduates who continued their education were about twice as likely as graduates from other racialethnic groups to enroll in a first-professional program (35 percent versus 12-17 percent), and they were less likely to enroll in non-MBA master's degree programs (46 percent versus 66-70 percent). Overall, 49 percent of 1992-93 graduates who enrolled in a graduate or first-professional program by 1997 did so within a year of earning their bachelor's degree, and another 23 percent enrolled within 2 years. Doctoral students were the most likely to have enrolled within a year of graduation (78 percent did so), followed by first-professional students (55 percent), and then those entering a master's program other than an MBA (46 percent). MBA students were the least likely to enter this soon (29 percent), and one-third of them waited more than 3 years before enrolling. Education and business were the fields most commonly studied, chosen by 22 and 18 percent, respectively, of the 1992-93 bachelor's degree recipients who had enrolled in an advanced degree Executive Summary program by 1997. About one-third (31 percent) of students enrolled in a master's program other than an MBA sought a degree in education. At the doctoral level, about one-quarter (24 percent) of students were studying the life and physical sciences (compared with about 5 percent of those pursuing a master's degree). Enrollment patterns varied markedly with degree program. Among those enrolled in April 1997, 94 percent of those working on a fffstprofessional or doctoral degree were enrolled full time. In contrast, a majority of non-MBA master's students (59 percent) were enrolled part time. About two-thirds of MBA students attended part time. About three-quarters (77 percent) of all MBA students attended classes on weeknights. Progress toward an advanced degree reflects the combined effects of enrollment duration, enrollment intensity (full-or part-time), success in the courses taken, and program requirements. Of those who had enrolled for an advanced degree or certificate at any time since earning a bachelor's degree, 71 percent of doctoral students, 56 percent of MBA students, and 32 percent of non-MBA master's students were enrolled when interviewed in 1997. The rest had either completed their degree or left without completing. Of doctoral students who enrolled within a year of earning their bachelor's degree, 57 percent had not completed their coursework by 1997, and 46 percent had not taken their exams. However, the majority (59 percent) had started on their thesis. Just over one-half (56 percent) of 1992-93 bachelor's degree recipients who pursued an advanced degree received some type of financial aid to help pay for their education. Fifty-three percent of students in first-professional programs received loans but no grants, compared with 18-25 percent of students in other programs. Doctoral students were the most likely to receive an aid package that included grants and no loans (28 percent versus 5 12 percent of students in other degree programs). MBA seekers were the most likely to receive only employer benefits (18 percent versus no more than 4 percent for students in other degree programs). As indicated above, 30 percent of 1992-93 graduates had enrolled in a graduate or firstprofessional program between the time they graduated and when they were interviewed in 1997. At the time of the 1997 interview, 21 percent had persistedthat is, they had either attained a graduate or first-professional degree or were enrolled and working toward a degree (figure B). The other 9 percent had left without a degree. Of the 21 percent who persisted, about half (10 percent) had attained a degree and were no longer enrolled. Another 1 percent had attained one degree and were enrolled for additional education, and the remaining 10 percent were enrolled but had not yet earned an advanced degree. Persistence was lowest among students who had enrolled for a master's degree other than an MBA (table B). About one-quarter of doctoral students had completed one degree and were still enrolled.\nThere was no systematic relationship between undergraduate debt and changes in educational expectations between 1993 and 1997. The previous section showed that 1992-93 bachelor's degree recipients expected to participate in graduate or first-professional education in large numbers. This section describes the steps that they had taken by 1997 toward participation, including taking entrance examinations, applying, being accepted, and enrolling.\n\nBorrowing may discourage graduates from applying for admission to advanced degree programs. Bachelor's degree recipients who borrowed through federal loan programs were slightly less likely than nonborrowers to have applied for admission, and this difference is reflected in the percentage who were accepted and who enrolled, as well. For example, 38 percent of those who borrowed applied to graduate or first-professional school and 28 percent enrolled, while 42 percent of nonborrowers applied and 31 percent enrolled (table 5). Among borrowers, however, there is no evidence that level of debt was related to this likelihood of applying, being accepted, or enrolling. Of bachelor's degree recipients who applied, borrowers and nonborrowers were accepted at comparable rates (figure 3 and table 6). Similarly, of those who were accepted, borrowers were as likely to enroll as graduates who had not borrowed.  Graduates' cumulative grade-point average (GPA) at their baccalaureate institution was positively related to each stage of access to further education: entrance examinations, applications, acceptances, and enrollment. For example, 46 percent of graduates with GPAs of 3.5 or higher took entrance examinations, half applied, 46 percent were accepted, and 41 percent enrolled (table 5). For those with undergraduate GPAs below 2.5, the percentages were 26, 22, 16, and 14 percent, respectively. Among graduates who applied for admission, those with higher grades were considerably more likely to be admitted (91 percent of those with GPAs of 3.5 or higher versus 76 percent of those with GPAs below 2.5) (figure 4 and table 6). Of admitted candidates, those with higher undergraduate GPAs were more likely to enroll (83 percent of those with high grades versus 66 percent of those with low grades). Participation in Graduate and First-Professional Education Table 6 also relates applications, acceptances, and enrollment to performance on the GRE general test (which was taken by a subset of individuals who applied to graduate or firstprofessional school). Individuals who take this test receive scores on three subtests: a verbal ability test, a quantitative ability test, and a test of analytical reasoning skills. For each test year, the 1992-93 bachelor's degree recipients were assigned a quartile rank for each subtest relative to that of all GRE examinees in that year. Quartile ranks on each of the three subtests were then combined to characterize their overall performance. The \"GRE score summary\" variable in table 6 places each of the examinees into one of five subgroups based on their overall performance: individuals who scored in the top quartile on all three sections, on two sections, or on one section; individuals who scored in the middle quartiles on all three sections; and all others (that is, individuals who did not score in the top quartile on any section and who scored in the bottom quartile on at least one section). The likelihood that an individual would apply for admission was not related to performance on the GRE, but the likelihood of admission was.12 For example, 94 percent of those who scored in the top quartile on all three sections were admitted, compared with 85 percent of those who did not score in the top quartile on any section (table 6). Among those accepted, however, the likelihood of enrollment was unrelated to performance on the GRE. There was a wide range in application, admission, and enrollment rates among bachelor's degree recipients depending on their undergraduate major. For example, 71 percent of those with a major in the biological sciences had applied for a graduate or first-professional program by 1997,62 percent had been accepted, and 52 percent had enrolled (table 5). In contrast, 25 percent of those who had majored in business had applied, 20 percent had been accepted, and 16 percent had enrolled.\nThis section focuses on the 1992-93 bachelor's degree recipients who had enrolled in graduate or first-professional education between the time they graduated and the 1997 interview, examining the characteristics of their enrollment in detail. It also provides an overview of students' attainment of advanced degrees as of that time.\n\n"}, {"section_title": "Employment Experiences Employment Patterns", "text": "Among 1992-93 bachelor's degree recipients, 89 percent were employed in April 1997 (81 percent full time and 8 percent part time). An additional 3 percent were unemployed, and the remaining 8 percent were out of the labor force. There were some gender differences in employment patterns. Men were slightly more likely than women to be employed (91 percent versus 88 percent), and women more likely than men to be working part time (11 percent versus 6 percent). About three-quarters of the bachelor's degree recipients had held more than one job since graduation. The average number was 2.8."}, {"section_title": "Occupation Types and Salaries", "text": "About one-fifth (21 percent) of the 1992-93 graduates who were employed in April 1997 had jobs in business and management, and 16 percent were working as teachers. Fourteen percent had administrative jobs, and 11 percent had jobs in professional fields other than education, business, health, or engineering. The overall average annual salary for graduates working full time was $34,252, but average salaries varied considerably by undergraduate major. \nWith respect to their April occupation, about one-fifth (21 percent) of college graduates who were employed in April 1997 had jobs in business and management, and 16 percent of graduates were working as teachers. Fourteen percent had administrative support jobs, and 11 percent had jobs in professional fields other than education, business, health, or engineering (table 1.4). Female 1992-93 bachelor's degree recipients who were employed in April 1997 were more likely than their male counterparts to be school teachers (22 percent versus 9 percent), health professionals (11 percent versus 4 percent), or administrative or clerical support workers (17 percent versus 10 percent). On the other hand, males were more likely than females to be in sales occupations (10 percent versus 6 percent) (table 1.4). One-quarter of graduates who were enrolled part time in April 1994 reported that they were working as school teachers in April 1997. A similar proportion of those enrolled full time and employed also were working as school teachers. Thirty-one percent of respondents whose highest educational attainment by 1997 was a postbaccalaureate certificate and twenty-four percent of respondents whose highest degree by 1997 was a master's degree reported that they were working as school teachers in April 1997. About one in five graduates (19 percent) who were neither enrolled nor employed in April 1994 reported that they held administrative or clerical jobs in April 1997."}, {"section_title": "Foreword", "text": "The Baccalaureate and Beyond Longitudinal Study (B&B:93) tracks students who received a bachelor's degree in academic year 1992-93. Participants were sampled and surveyed in their year of graduation as part of the 1993 National Postsecondary Student Aid Study (NPSAS:93). The base-year study consisted of two components: an institutional survey that provided extensive information on students' enrollment and financial aid and a student survey. The First Follow-up (B&B:93194) was conducted 1 year later, and provided additional information that is comparable to that collected in the Recent College Graduates (RCG) series of cross-sectional surveys. As part of the First Follow-up, participants' undergraduate transcripts were also collected from the B&B sample institutions. In 1997 (approximately 4 years after graduation), B&B participants were contacted again for the Second Follow-up (B&B:93/97). While B&B:93/94 provided continuity with earlier cross-sectional surveys, B&B:93/97 highlights the benefits of B&B's longitudinal design. Some issues, such as access to and participation in graduate and first-professional education, require a longer time lag than 1 year after graduation to observe outcomes of interest. Furthermore, the longitudinal design permits a comparison of outcomes at different points in time for bachelor's degree recipients. Percentage of 1992-93 bachelor's degree recipients who expected to attain a graduate or first-professional degree when asked in 1993,1994, and 1997, by  Percentage distribution of 1992-93 bachelor's degree recipients according to graduate or first-professional admission exams taken, by selected student and enrollment characteristics: 1993-97 Percentages of 1992-93 bachelor's degree recipients who applied for admission to a graduate or first-professional program, were accepted if admitted, and enrolled if accepted, by selected student and enrollment characteristics: 1993-97  Table  Page   8   Percentage distribution of 1992-93 bachelor's degree recipients who had enrolled in a  graduate or first-professional program by 1997 according to number of months  between bachelor's degree receipt and first enrollment, by degree program  24   9 Percentage distribution of 1992-93 bachelor's degree recipients who had enrolled in a graduate or first-professional program by 1997 according to xiii 5 List of Tables   Table   Page   1.3 Percentage distribution of 1992-93 bachelor's degree recipients according to the number of jobs held since graduation and the average number of jobs, by selected characteristics Percentage distribution of 1992-93 bachelor's degree recipients who were employed in April 1997 according to their reported occupation, by selected characteristics 1.5 Percentage distribution according to annual salaries, and average annual salaries, for 1992-93 bachelor's degree recipients employed full time in April 1997, by selected characteristics 59 1.6 Percentage of 1992-93 bachelor's degree recipients who had experienced any unemployment since graduation, the average number of unemployment spells, the average number of months unemployed, and the unemployment rate for April 1997, by selected characteristics Percentage of 1992-93 bachelor's degree recipients employed in April 1997 who were very satisfied with benefits and advancement opportunities, by selected characteristics 11.5 Percentage of 1992-93 bachelor's degree recipients employed in April 1997 who indicated various reasons for taking their current positions that were related to the nature of the work itself, by selected characteristics Percentage of 1992-93 bachelor's degree recipients employed in April 1997 who indicated various financial reasons for taking their current positions, by selected characteristics 11.7 Percentage of 1992-93 bachelor's degree recipients employed in April 1997 who indicated that they had found their jobs through various information channels, by selected characteristics Table   Appendix B   List of Tables   Page   B1   Standard errors for compendium table I.1: Percentage distribution of 1992-93 bachelor's degree recipients according to employment and enrollment status in April 1997, and percentages employed and enrolled, by selected-student characteristics Percentage of 1992-93 bachelor's degree recipients who reported that they expected to attain a graduate or first-professional degree, by raceethnicity: 1993,1994, and 1997 4 2 Percentage of 1992-93 bachelor's degree recipients who expected to attain advanced degrees, by type of degree: 1993 and 1997 5   3Percentages of 1992-93 bachelor's degree recipients who applied for admission to graduate or first-professional programs, were accepted if applied, and enrolled if accepted, by undergraduate borrowing status: 1993-97 17 4"}, {"section_title": "List of Figures", "text": "Percentages of 1992-93 bachelor's degree recipients who applied for admission to graduate or first-professional programs, were accepted if applied, and enrolled if accepted, by undergraduate GPA: 1993-97 Participation in Graduate and First-Professionali Education"}, {"section_title": "Introduction", "text": "Graduate and first-professional education provides important benefits for both individuals and society. At the individual level, it can yield both personal and financial rewards by permitting individuals to pursue their intellectual interests in greater depth, providing them with access to careers that require an advanced degree, and increasing their earning potential. At the societal level, graduate and first-professional education supplies the labor market with highly trained professionals in a wide variety of fields. In addition, it is central to supporting and continuing knowledge production in universities and research centers. When examining participation in graduate and first-professional education, a number of important issues deserve consideration: Who enjoys access to further education? Is there evidence of impeded access for some groups? For example, relative to their educational expectations, do certain racialethnic groups participate at lower rates than others? Does undergraduate debt deter students from continuing their education?"}, {"section_title": "What degrees are graduates pursuing, and in what fields?", "text": "What proportion of high-achieving undergraduates pursue further education? What is the nature of graduate and first-professional education with respect to timing of enrollment, enrollment intensity, combination of enrollment and work, and financing? What proportion of 1992-93 bachelor's degree recipients had completed a graduate or first-professional degree by 1997, and what proportion were working toward a degree? The analysis uses data from the Baccalaureate and Beyond Study to address these questions. Baccalaureate and Beyond is a longitudinal study of students who received a bachelor's degree in academic year 1992-93) Participants were sampled and surveyed in their year of graduation as part of the 1993 National Postsecondary Student Aid Study (NPSAS:93). They were surveyed again in 1994, approximately one year after graduation (B&B:93/94) and then again in 1997 (B&B:93/97). This report summarizes selected findings from the most recent Participation in Graduate and First-Professional Education follow-up to describe bachelor's degree recipients' plans for graduate and first-professional education, changes in those plans over the study period, steps taken toward enrollment, and enrollment in the 4 years after college graduation. In addition, a compendium of tables provides descriptive information on the bachelor's degree recipients' enrollment and employment status in April 1997, with detailed information about their labor market participation. To place this analysis in context, it is worth briefly describing the characteristics of the 1992-93 bachelor's degree recipients. Just over half (55 percent) were female; 83 percent were white, non-Hispanic, 6 percent were black, 5 percent were Hispanic, 5 percent were Asian/Pacific Islander, and 1 percent were American Indian/Alaskan Native. About half (47 percent) of the graduates were 22 years or younger when they received their degree, and one-quarter were 23-24 years old. About two-thirds (65 percent) earned their degree at a public institution.2 Educational Expectations in 1993 and1997 In the base year (1993) and each of the follow-ups (1994 and 1997), the 1992-93 bachelor's degree recipients were asked to indicate the highest degree they expected to attain in the long run. This section examines how their educational expectations varied with respect to their demographic and undergraduate enrollment characteristics, and how these expectations changed over time. Although data are presented from each of the three surveys, the discussion concentrates on the first and last years (1993 and 1997)."}, {"section_title": "Advanced Degree Expectations in the Aggregate", "text": "Aggregate advanced degree expectations are described firstthat is, the total percentage of bachelor's degree recipients expecting to complete a graduate or first-professional degree3 without distinguishing among different types of degrees. Eighty-five percent of bachelor's degree recipients indicated in 1993 that they expected to complete a graduate or first-professional degree. By 1997, this percentage had declined to 72 percent (table 1). When comparing the overall percentage with advanced degree expectations at two points in time, it is important to remember that the change reflects the combined effects of individuals who maintained, reduced, and raised their`expectations in the intervening period. In other words, the overall decline observed between 1993 and 1997 includes not only individuals who reduced their expectations, but also others who had the same advanced degree expectations in both years, and still others who had raised their expectations by 1997. These different types of changes are described later. 2A. McCormick and L. Horn, A Descriptive Summary of 1992-93 Bachelor's Degree Recipients I Year Later (NCES 96-158) (Washington, DC: U.S. Department of Education, National Center for Education Statistics, 1996), 3, 7. 3First-professional degrees are defined as those that qualify an individual to enter into dentistry (DDS or DMD), medicine (MD), optometry (OD), osteopathic medicine (DO), pharmacy (DPharm), podiatric medicine (DPM), veterinary medicine (DVM), chiropractic (DC or DCM), law (JD or LLB), or the clergy (MDiv or MHL). Participation in Graduate and First-Professional Education Table 1-Percentage of 1992-93 bachelor's degree recipients who expected to attain a graduate or firstprofessional degree when asked in 1993,1994, and 1997, by  There was some variation in expectations by gender and raceethnicity. Female graduates were somewhat more likely than male graduates to report advanced degree expectations in 1993 (87 percent versus 83 percent). In 1997, however, their expectations were similar (73 percent and 71 percent, respectively, expected to earn advanced degrees). In 1997, both black and Hispanic graduates were more likely than white4 graduates to have advanced degree expectations (85 percent and 79 percent versus 70 percent) (figure 1).5 Compared to 1993, advanced degree expectations among black graduates dropped by 4 points, while the percentage dropped by 15 percentage points among whites. Undergraduate borrowing does not appear to discourage graduates from considering advanced degrees. In 1993, there was no evidence of a relationship between individuals' participation in federal loan programs and advanced degree expectations. In 1997, college graduates who 4Throughout this report, when the terms \"white\" and \"black\" appear alone, they should be assumed to include the qualifier \"non-Hispanic.\" No other differences between the various racialethnic groups are statistically significant. Participation in Graduate and First-Professional Education had borrowed were actually more likely than nonborrowers to report advanced degree expectations (74 percent of borrowers versus 70 percent of nonborrowers)."}, {"section_title": "Specific Degree Expectations in 1993 and 1997", "text": "When 1992-93 bachelor's degree recipients were asked in 1993 about their educational expectations, 58 percent expected to earn a master's degree, 21 percent a doctoral degree, and 6 percent a first-professional degree (figure 2 and table 2). By 1997, the percentage expecting a master's degree had dropped slightly from 58 percent to 54 percent, and the percentage expecting a doctoral degree had dropped sharply from 21 to 12 percent. The percentage expecting a first-professional degree was about the same in both years.6  Participation in Graduate and First-Professional Education Doctoral degree expectations declined between 1993 and 1997 for almost every group that appears in table 2. The only possible exceptions are groups with relatively few members in the B&B sample: American Indian/Alaskan Native graduates, graduates of \"Other\" institutions, and borrowers who graduated with less than $1,000 in debt. For these groups, the percentages appear to have declined, but there is insufficient statistical evidence that the two estimates differ.7 In 1993, white graduates were more likely than black or Asian/Pacific Islander graduates to have master's degree expectations in 1993 (59 percent versus 50 and 46 percent, respectively). However, by 1997, these groups held master's degree expectations in similar proportions. In both 1993 and 1997, Asian/Pacific Islander graduates were more likely than white graduates to expect a first-professional degree (12 percent versus 6 percent in 1993, and 13 percent versus 5 percent in 1997). In addition, black graduates were more likely than white or Asian/Pacific Islander graduates to have doctoral degree expectations in 1997. Graduates who borrowed through federal loan programs expected to complete a master's degree in comparable proportions to nonborrowers in 1993, but were more likely than nonborrowers to expect to complete a doctorate (24 versus 20 percent). By 1997, 12 percent of each group expected to attain a doctoral degree, and borrowers were somewhat more likely than nonborrowers to expect a master's degree (57 versus 52 percent)."}, {"section_title": "Comparison of Graduates' Degree Expectations in 1993 and 1997", "text": "A considerable number of graduates changed their educational expectationseither raising or lowering thembetween 1993 and 1997 (table 3). Expectations were most stable among those who iniiially did not plan to continue their education or who expected to complete a master's degree, while those who expected a first-professional or doctoral degree in 1993 were more likely to express a different expectation in 1997. Among college graduates who said in 1993 that they did not expect to pursue an advanced degree, 63 percent expressed the same expectation in 1997, as did 67 percent of graduates who reported master's degree expectations in 1993 (table 3).8 Among those who expected a firstprofessional degree in 1993, 40 percent had the same expectation in 1997, and among graduates who had doctoral degree expectations in 1993, 36 percent held the same expectations in 1997. 7When a group is represented by a small number of individuals in the sample, the uncertainty associated with the estimates increases (that is, the standard errors associated with the estimates are relatively large). See appendix B. 8About 2 and a half percent expected some further education short of an advanced degree (choices that were not present in the 1993 survey instrument)."}, {"section_title": "Entrance Examinations", "text": "One of the first concrete steps graduates can take toward enrollment is to take required entrance examinations. Table 4 shows the percentages of the 1992-93 bachelor's degree recipients who had taken certain of these examinations by 1997: the Graduate Record Examination (GRE), which is required by many master's and doctoral programs in the arts and sciences as well as certain professional fields; the Graduate Management Admissions Test (GMAT), which is required by many graduate schools of business; the Law School Admissions Test (LSAT); the Medical College Admission Test (MCAT); the Miller Analogies Test, which some graduate programs accept as an alternative to the GRE; and certain other examinations that were taken by a small percentage of graduates (dentistry, nursing, veterinary medicine). The GRE has two forms: a general test, and an advanced or subject area test. Graduates who took either or both tests are reported together in table 4. Other than the two forms of the GRE, some took more than one graduate admissions exam. Those who took two exams, one of which was the GRE, are categorized with GRE takers. The final column in table 4 includes the remaining graduates who took more than one non-GRE exam and graduates who took examinations other than those listed. Thirty-nine percent of graduates had taken at least one of these entrance examinations by 1997 (table 4). This group was roughly evenly split between those who took the GRE (or the GRE and another exam) and those who took other exams. Female graduates were slightly more likely than male graduates to have taken the GRE, while proportionately more males took tests for admission to business, law, or medical school. Asian/Pacific Islander graduates were more likely than Hispanic or white graduates to have taken entrance examinations (53 percent versus 38 percent each), but there is insufficient statistical evidence of other differences in test-taking by raceethnicity. Comparable proportions of graduates from each racialethnic group took the GRE (about one out of five graduates). Bachelor's degree recipients who said in 1993 that they did not expect to complete an advanced degree were less likely than graduates with higher degree expectations at that time to have taken any entrance examinations by 1997. Nonetheless, about one out of five such Participation in Graduate and First-Professional Education "}, {"section_title": "28", "text": "Participation in Graduate and First-Professional Education graduates did so. About three-quarters of graduates who expected to complete a firstprofessional degree had taken an entrance exam by 1997, more than those with other degree expectations. Those with 1993 expectations of a doctoral degree were next most likely to have taken entrance exams (60 percent), followed by those who said they expected to complete a master's degree (34 percent). Even though they had greater expectations about earning an advanced degree in 1997, bachelor's degree recipients who had borrowed through federal student loan programs as undergraduates were somewhat less likely than nonborrowers to have taken any entrance examinations by 1997 (37 percent versus 40 percent). Among borrowers, there is no evidence that those with higher levels of debt were any more or less likely than those with smaller amounts of debt to take exams."}, {"section_title": "Applications, Acceptances, and Enrollment", "text": "After entrance examinations, the next stages of access to postgraduate study are applications, admission, and enrollment. Table 5 presents the percentages of all 1992-93 graduates who took admission exams, applied for admission, were accepted, and enrolled. The base for calculating the percentages shown in this table is all bachelor's degree recipients; thus, the percentage enrolled shown in table 5 represents the percentage of all graduates who enrolled. Table 6 presents conditional percentages for applicants who were accepted and for acceptees who enrolled. The base for calculating the percentage enrolled is the number accepted; because the percentage enrolled shown in table 6 represents the percentage of those admitted who enrolled, it is much higher than the percentage of all students who enrolled. While the last column in each table reports the percentage who enrolled for a master's or higher level degree, the percentages for applications and acceptances are based on respondents' answers to questions about their applications to graduate or first-professional school, and thus rely on their own definition of the term.9 As previously indicated, 39 percent of 1992-93 college graduates took graduate entrance examinations. A comparable percentage (41 percent) applied for admission. Thirty-five percent were accepted by at least one institution, and 30 percent enrolled in a graduate or firstprofessional program (table 5). Eighty-seven percent of applicants were accepted, and 76 percent of those who gained admission enrolled (table 6). 9About 2 percent of B&B participants said they had applied to graduate or first-professional school, but they appear to have applied to programs other than those leading to a master's, first-professional, or doctoral degree.  "}, {"section_title": "31", "text": "Participation in Graduate and First-Professional Education   Table 5 showed that 29.8 percent of 1992-93 bachelor's degree recipients enrolled in a graduate or first-professional program by 1997. Because some enroll without formal application, a smaller percentage appear to have enrolled when the percent enrolled is conditioned on applying and being accepted, as it is in this "}, {"section_title": "Individual Characteristics", "text": "Gender differences were not evident in aggregate data. Women and men applied to advanced degree programs, gained admission, and enrolled at the same rates (41, 35, and 30 percent, respectively) (table 5). However, there was some variation by raceethnicity and age and by educational expectations. Asian/Pacific Islander bachelor's degree recipients were more likely than their white counterparts to apply to graduate or first-professional school (49 percent versus 39 percent). Among those who applied for admission, black candidates were admitted at a lower rate than Asian/Pacific Islanders, Hispanics, or whites (75 percent of blacks were admitted versus 88-90 percent of candidates from the other groups) (table 6). Although the estimates in tables 5 and 6 appear to indicate other differences in applications, acceptances, and enrollment by raceethnicity, there is insufficient statistical evidence of other systematic differences.10 Bachelor's degree recipients who graduated by age 22 were more likely than older graduates to have applied to graduate or first-professional school, and this difference is reflected in the percentages who were accepted and who enrolled. About half (48 percent) of those who graduated by age 22 applied, 43 percent were accepted, and 37 percent enrolled (table 5). Among applicants, there is no evidence that acceptance rates differed by age at graduation. As might be expected, the rate of application to graduate or first-professional school was related to educational expectations at graduation. Graduates who expected to complete a doctoral or first-professional degree were the most likely to have applied (67 and 74 percent, respectively, versus 35 percent of those who expected a master's degree and 17 percent of those who in 1993 had not expected to earn an advanced degree). Among those who applied and were accepted, individuals who had expected to complete a first-professional or doctoral degree were more likely to enroll than those who had lower expectations."}, {"section_title": "Institutional Origins and Undergraduate Debt", "text": "Graduates of private, not-for-profit doctorate-granting institutions were more likely than those from other institutions to have applied to graduate or first-professional school.\" Thirtyeight percent of graduates from these institutions had enrolled in a graduate or first-professional program by 1997, compared with 25-30 percent of graduates from other institutions (table 5). Among applicants, the likelihood of being accepted by at least one institution did not differ with respect to the type of institution in which the graduates had earned their bachelor's degree."}, {"section_title": "Characteristics of Graduate and First-Professional Enrollment", "text": "Thirty percent of 1992-93 bachelor's degree recipients had enrolled in graduate or firstprofessional school by 1997 (table 5). This section presents a detailed analysis of the nature of Participation in Graduate and First-Professional Education this participation, including degree programs, timing of entry, types of institutions attended, fields of study, employment status, time of attendance, status with respect to program requirements, and financial aid."}, {"section_title": "Degree Program", "text": "Among bachelor's degree recipients enrolled in an advanced degree program by 1997,66 percent were pursuing a master's degree other than a Master's of Business Administration (MBA), and another 10 percent were seeking an MBA (table 7). Fourteen percent were enrolled in a first-professional degree program, and the remaining 10 percent in a doctoral program. Although women and men were equally likely to enroll in a graduate/first-professional program, there were gender differences in the types of degrees pursued. Three-quarters (76 percent) of women enrolled for a master's degree other than an MBA, compared with about half (54 percent) of men (figure 5). On the other hand, men were twice as likely as women to enroll for an MBA (14 percent versus 6 percent). Men were also more likely than women to enroll in a first-professional or doctoral program. Asian/Pacific Islander graduates who continued their education were twice as likely as graduates from other racialethnic groups to enroll in a first-professional degree program (35 percent versus 12-17 percent of other groups for whom a reliable estimate could be computed). Hispanic, black, and white graduates, on the other hand, were much more likely than Asian/Pacific Islanders to enroll for a master's degree other than an MBA (66-70 percent versus 46 percent of Asian/Pacific Islanders). Considering the age of the bachelor's degree recipients who enrolled in a graduate or firstprofessional degree program by 1997, those who received a bachelor's degree by age 22 were the most likely to have enrolled for a first-professional degree (18 percent did so, compared with 5 12 percent of older graduates). In addition, those who graduated at age 23 or 24 were more likely than older students to pursue a first-professional degree. Those who graduated after age 24, by contrast, enrolled for a master's degree (other than the MBA) in proportionately greater numbers than younger graduates (78-81 percent versus 61-67 percent of those who graduated by age 24). There was no relationship between age at graduation and MBA program enrollment. Graduate/first-professional program enrollment was generally consistent with the educational expectations that students expressed in 1993, but there was considerable variation between specific initial expectations and actual enrollment. This is not surprising in view of the changes 38 Participation in Graduate and First-Professional Education in expectations already discussed. With the exception of those expecting a first-professional degree, a majority of those who enrolled ended up in a master's degree program other than an MBA regardless of their initial expectations. Among those who initially expected to complete a firstprofessional degree and who continued their education, 55 percent actually enrolled for a firstprofessional degree. About half of students who initially expected a doctorate had enrolled for an advanced degree by 1997 (table 5). Of this group, about one in five had enrolled in a doctoral program, and 62 percent had enrolled in a master's program other than an MBA (table 7).13 13The 62 percent who enrolled for a master's degree other than an MBA may include students who intend to complete a doctorate eventually, even if they identified their present degree program as a master's. Participation in Graduate and First-Professional Education  "}, {"section_title": "Timing of Entry Within 4 Years", "text": "Doctoral students were the most likely to have enrolled within 1 year of graduation (78 percent did so), followed by first-professional students (55 percent), and then those entering a master's program other than an MBA (46 percent) (table 8). MBA program entrants were the least likely to enter this soon after graduation (29 percent). At the other extreme, one-third of MBA enrollees began more than 3 years after graduation (compared with 14 percent of other master's program entrants, and fewer entrants into other programs). Table 9 shows where students enrolled to continue their education, using the classification scheme developed by the Carnegie Foundation for the Advancement of Teaching.14 The aggregation used in the table distinguishes institutions according to the number and types of degrees awarded, the number of fields in which degrees were awarded, and the level of federal research funding. Research universities award at least 50 doctoral degrees annually, and receive at least 15.5 million dollars per year in federal research support (when classified in 1994). Doctoral universities award at least 10 doctorates in three or more fields annually or at least 20 doctorates in 14A Classification of Institutions of Higher Education, 1994 edition (Princeton, NJ: Carnegie Foundation for ttie Advancement of Teaching, 1994).  Research universities enrolled about two out of three graduates who were pursuing a doctoral degree (70 percent), and 31-41 percent of graduates seeking other advanced degrees. Master's degree seekers were well distributed across research, doctoral, and master's universities. As might be expected, they were more likely than other degree seekers to enroll at master's universities (35-38 percent versus 2-15 percent of those seeking other degrees)."}, {"section_title": "Carnegie Classification of Institution Attended", "text": ""}, {"section_title": "Field of Study", "text": "Among 1992-93 college graduates who enrolled for an advanced degree, business and education were the fields most commonly studied, with roughly 20 percent pursuing degrees in each of these fields (table 10). Gender differences were quite prominent, with males more likely than females to enroll in business and management; medicine and dentistry; engineering, mathematics, and computer science; and life and physical sciences. Females, on the other hand, were more likely than males to enroll in education; health sciences other than medicine and dentistry; and social and behavioral sciences. Enrollment rates in law and arts and humanities were not significantly different for males and females. Asians were more likely than blacks or whites to enroll in medicine and dentistry. Although there were apparent differences by raceethnicity in other fields (such as engineering, math, and computer sciences), the differences were not statistically significant. Of students who enrolled for a master's degree other than an MBA, about one-third (31 percent) sought a degree in education. About 10-13 percent of non-MBA master's seekers enrolled in each of the following aggregate fields: arts and humanities; social and behavioral sciences; engineering, mathematics, and computer science; business and management; and other health sciences. , 47 and by doctoral students: arts and humanities (9-10 percent); social and behavioral sciences (12 18 percent); engineering, mathematics, and computer science (10-12 percent); and other health sciences (10-12 percent). About one-quarter of students seeking a doctorate (24 percent) were studying the life and physical sciences, compared with about 5 percent of those enrolled for a master's degree. About half of students who enrolled for a first-professional degree (53 percent) were studying law, and almost one-third were studying medicine or dentistry. As one might expect, there was a relationship between students' undergraduate major and their field of graduate study: Among those who continued their education, three out of five undergraduate business majors pursued a degree in business, and two-thirds of education majors enrolled for an education degree. Health professions majors who pursued an advanced degree were no more likely than the average graduate to study medicine or dentistry, but were more likely to be enrolled in other health sciences (59 percent). Public affairs/social services majors who enrolled for an advanced degree spread across a number of fields, including primarily the social and behavioral sciences (39 percent), business and management (30 percent), education (10 percent) and law (10 percent). Sixty-three percent of engineering majors who continued their education did graduate work in engineering, mathematics, or computer science, as did 34 percent of those who had majored in mathematics, computer science, or the physical sciences. The latter group was also more likely than the average graduate to study the life and physical sciences (26 percent versus 6 percent of all graduates who pursued further study in this field). Relative to the average graduate who enrolled for an advanced degree, undergraduate majors in the biological sciences were more likely to pursue a degree in each of the following fields: medicine or dentistry (40 percent versus an average of 5 percent overall); other health sciences (23 percent versus 10 percent); and the life and physical sciences (23 percent versus 6 percent). Undergraduate social science majors (including history majors) were more likely than the average graduate to study law (17 percent versus 8 percent overall) or the social and behavioral sciences (24 versus 10 percent). Twenty percent went into business and management, and 20 percent went into education (both similar to bachelor's degree recipients overall). Forty-one percent of arts and humanities majors who continued their education pursued a graduate degree in the arts and humanities, compared with an average of 8 percent for all graduates. Participation in Graduate and First-Professional Education Enrollment Status and Employment Table 11 presents data on how those who continued their education combined schooling and employment. This table presents a snapshot of graduates' enrollment and employment status at a particular point in timeApril 1997. Forty-five percent of graduates who ever enrolled for an advanced degree were enrolled in April 1997.16 Employment is not differentiated for those enrolled part time because almost all part-time students were employed (compendium table 1.1). Students' patterns of enrollment and employment in April 1997 varied considerably depending on their degree program. About nine out of ten graduates who were working on a firstprofessional or doctoral degree (94 percent) were enrolled full time. The majority of master's students attended part time (65 percent of MBA students and 59 percent of those seeking other master's degrees). Doctoral students were about twice as likely as first-professional students to combine employment with full-time enrollment (41 percent versus 22 percent), but it is important to note that teaching and research assistantships are included here as employment. Students working toward a first-professional degree were most likely to be enrolled full time but not employed (72 percent). "}, {"section_title": "Time of Attendance", "text": "Respondents who had enrolled for further education were also asked when they usually attended classes (weekdays, weeknights, or weekends). As with enrollment and employment, there was considerable variation among graduates who were in different degree programs in April 1997 with respect to when they attended classes. Consistent with the findings on enrollment intensity, weekday attendance was by far the norm for doctoral and first-professional students (89-95 percent) (table 12). About one in five MBA students (22 percent) and two in five students in other master's programs (40 percent) attended on weekdays. About three-quarters of MBA students (77 percent) attended on weeknights. Very few graduates who were enrolled in April 1997 attended class on weekends (2 percent).\" Among students who were enrolled part time in a graduate or first-professional program in April 1997, about three out of four attended on weeknights. Eighty percent of full-timers attended on weekdays. "}, {"section_title": "Graduate Program Status", "text": "Students who were enrolled in a graduate program at the time of the Second Follow-up interview were asked a series of questions about how they were doing on three critical milestones: coursework; exams; and final project, thesis, or dissertation. This gives an indication of the amount of progress students have made in their programs. This progress reflects the combined effects of enrollment duration, enrollment intensity (full-or part-time), and success in the courses taken. These questions also provide some information about the requirements of different graduate programs. Because a student had to be enrolled in a master's or doctoral program to be asked these questions, they were asked of only a subset of all students who had enrolled for further education. About one-third (32 percent) of students whose most recent enrollment was in a non-MBA master's program were enrolled as of the follow-up interview, as were 56 percent of MBA students and 71 percent of doctoral students.18 Because the doctoral group is best represented and because time to degree is of particular policy interest for doctoral candidates, the discussion below will focus on students who were working toward a doctorate at the time of their interview. Three out of five enrolled doctoral students (60 percent) were still working on their coursework when interviewed in 1997 (table 13). Half had not yet completed required examinations (this includes students who said that they were working on their exams). Those who had begun graduate study within 12 months of college graduation were more likely to report that exams were required, and more likely to report having completed their exams. About half of enrolled doctoral students (52 percent) were working on their dissertations when they were interviewed in 1997-59 percent of those who enrolled within a year of completing the bachelor's degree, and 34 percent of those who began later. Table 14 presents information on how graduates who pursued financial aid financed their further education. Because receipt of financial aid can vary from year to year, the information in the table refers to the last academic year enrolled."}, {"section_title": "Financial Aid", "text": "While the majority of 1992-93 college graduates who pursued further education received some form of financial aid to help meet their costs, 56 percent received some type of financial aid (table 14). Receipt of aid and sources of aid varied by degree program and enrollment status.   Among students who were enrolled full time in April 1997, 76 percent received financial aid. First-professional and doctoral students were much more likely than master's students to receive financial aid. However, this appears to reflect differences in enrollment status: among those enrolled full time in April 1997, there is no evidence that students in some programs were more likely than others to receive aid. One out of four students received an aid package that included loan assistance but no grants.19 Fully half of students in a first-professional program (53 percent) received loans but no grants, compared with 18-25 percent of students in other programs. Among those enrolled full time in April 1997, first-professional students were more likely than non-MBA master's and doctoral students to receive loans but no grants. Doctoral students, by contrast, were most likely to receive a package that included grants but no loans (28 percent versus 5-12 percent of students in other degree programs). Among fulltime students, doctoral students were more likely than MBA and first-professional students to receive grants but no loans, but there is insufficient statistical evidence of such a difference between non-MBA master's and doctoral students. Doctoral students overall were also more likely than students in other degree programs to report financial aid packages in the form of on-campus employment alone (14 percent versus 0-5 percent of other students). MBA seekers were most likely to receive only employer benefits to help cover their costs (18 percent versus up to 4 percent of students in other programs). Sole reliance on employer benefits was associated with part-time enrollment: one-quarter of MBA students enrolled part time in April 1997 received only employer benefits, while none of those enrolled full time did.20"}, {"section_title": "Attainment to Date and Enrollment Status", "text": "Finally, the B&B data tell us about graduate and first-professional degree persistence and attainment of 1992-93 bachelor's degree recipients. Recall that 30 percent of 1992-93 graduates had enrolled in a graduate or first-professional program between the time they graduated and when they were interviewed in 1997 (table 5). At the time of the 1997 interview, 21 percent had either attained an advanced degree or were enrolled ( figure 6 and table 15). The rest had left without a degree. Of the 21 percent who persisted, about half (10 percent) had attained a degree and were no longer enrolled. Another 1 percent had attained one degree and were enrolled for Participation in Graduate and First-Professional Education additional education, and the remaining 10 percent were enrolled but had not yet earned an advanced degee. Persistence (defmed as attainment or present enrollment) was lowest among students who had enrolled for a master's degree other than an MBA: 67 percent compared with 79-80 percent of those who enrolled for other advanced degrees. About one-quarter of students who enrolled for a doctoral degree (23 percent) had completed a degree and were still enrolled (it is not unusual for doctoral students to receive a master's degree as part of their program). Because table 15 contains students who did not apply to graduate or first-professional programs, the percentages for the remaining rows reflect the cumulative effects of applications, enrollment, and persistence. For example, it was previously shown that students with high undergraduate GPAs applied to and enrolled in graduate or first-professional programs in proportionately larger numbers than students with lower grades (table 5). Thus, it is not surprising that students with high GPAs were more likely than those with lower grades to have attained an advanced degree or to be enrolled toward one in 1997. The analysis of table 5 also showed that students who had borrowed under federal loan programs applied to graduate or first-professional school in slightly smaller proportions than nonborrowers, and that their enrollment rate consequently lagged behind that of nonborrowers. These differences carry forward to the aggregate percentages for persistence and attainment presented in table 15: those who had borrowed were slightly less likely than nonborrowers to have attained an advanced degree or to be enrolled for one in 1997 (19 versus 22 percent)."}, {"section_title": "Summary and Conclusion", "text": "When they graduated from college, a large majority (85 percent) of 1992-93 bachelor's degree recipients expected to earn an advanced degree at some time in the future. Expectations declined over time. Four years later, in 1997, 72 percent expected to earn an advanced degree. By the time of the 1997 follow-up, 41 percent had applied for admission to a graduate or firstprofessional program; 35 percent had been accepted; and 30 percent had enrolled. Again at the time of the 1997 interview, 21 percent had either attained a degree or were enrolled. This group was roughly evenly divided between those who had earned a degree and were no longer enrolled and those who were enrolled at the time (a few of whom had already earned an advanced degree as well). Female bachelor's degree recipients were slightly more likely than their male counterparts to report advanced degree expectations in 1993, but there was no significant difference in 1997. There were no gender differences evident in the rates at which male and female college graduates applied for admission to an advanced degree program, were accepted, or enrolled. However, gender differences were pronounced in terms of the specific degree programs in which they enrolled. Males were more likely than females to enroll in MBA, doctoral, and first-professional programs, while females were more likely than males to enroll in non-MBA master's degree programs. There were differences by race as well as gender. Black and Hispanic graduates were more likely than white graduates in 1997 to expect to earn an advanced degree, and the expectations of whites declined more than those of blacks between 1993 and 1997. Asian/Pacific Islander graduates were more likely than white bachelor's degree recipients to apply to graduate or firstprofessional programs by 1997, and among those who enrolled in a graduate or first-professional program, they were twice as likely as graduates from other racial-ethnic groups to enroll in a first-professional program. Undergraduate grades were positively related to participation in graduate and firstprofessional education. Graduates with higher GPAs were more likely than those with lower Participation in Graduate and First-Professional Education GPAs to take entrance examinations and apply, more likely to be accepted if they applied, and more likely to enroll if accepted. Consistent with this pattern, graduates with higher GPAs were more likely than those with lower grades to have attained a degree or still be enrolled in 1997. Although bachelor's degree recipients who had borrowed as undergraduates had slightly greater expectations than nonborrowers in 1997 about earning an advanced degree, borrowers were slightly less likely than nonborrowers to have taken any entrance examinations by 1997 (37 percent versus 40 percent) and to have applied for admission (38 percent versus 42 percent). However, among those who applied, borrowers and nonborrowers were accepted and enrolled at comparable rates. Among borrowers, the level of debt did not appear to be related to the likelihood of applying, being accepted, or enrolling. College graduates who were not working or who were working part time were often enrolled full time: 44 percent of college graduates who reported being out of the labor force in April 1997 and 24 percent who were unemployed were enrolled full time in further education. The same was true for 29 percent of those who were working part time. In contrast, 2 percent of college graduates working full time in April 1997 were enrolled full time (table I. 1). In April 1997, 89 percent of college graduates were employed, and 18 percent were enrolled in further education. 13 percent were both enrolled and employed (table I.1). Males were slightly more likely than females to be employed as of April 1997 (91 percent versus 88 percent); males and females were equally as likely to be enrolled in further education (17 and 18 percent, respectively) (table I.1) Graduates whose parents had advanced degrees were more likely to be enrolled in further education in April 1997 than graduates whose parents had less than a bachelor's degree. Graduates whose parents had bachelor's and advanced degrees were about equally likely to be enrolled in further education in April 1997 (19 percent and 23 percent, respectively) (table I.1). Graduates whose parents had advanced degrees were also more likely than those whose parents had a college degree or less education to be enrolled full time and not employed in April 1997 (table I.1). Whether or not a graduate had borrowed money to attend college did not appear to be related to the enrollment status of college graduates. Nineteen percent of nonborrowers and 17 percent of borrowers were enrolled at that time (table I.1). Among college graduates who had borrowed money to finance their undergraduate educations, the amount of money they borrowed (from less than $1,000 to $20,000 or more) did not appear to be related to their employment or enrollment status as of April 1997 (table I. In April 1997, approximately 89 percent of 1992-93 bachelor's degree recipients reported being employed: 81 percent were working full time, and 8 percent were Section IEmployment Status working part time. An additional 2.7 percent were unemployed. The overall unemployment rate (excluding those out of the labor force) was 2.9 percent (table 1.2). Among 1992-93 bachelor's degree recipients, men were slightly more likely than women to be employed (91 percent versus 88 percent). Women were more likely than men to be working part time (11 percent versus 6 percent) (table 1.2). Although employment rates for 1992-93 college graduates were generally high, they differed according to major field of study. For example, 92 percent of students who had majored in a professional field of study were employed in April 1997, compared with 84 percent who had majored in the arts and sciences (table 1.2). Similarly, the unemployment rate in April 1997 for those who had majored in the arts and sciences was slightly higher than the rate for those who had majored in a professional field (4 percent versus 2 percent) (table 1.2). Students with undergraduate degrees from private, not-for-profit 4-year doctorategranting institutions were less likely to be employed than students from private, notfor-profit 4-year nondoctorate-granting institutions (84 percent versus 90 percent) (table 1.2). College graduates who were employed and not enrolled in April 1994 were more likely than graduates who reported being neither employed nor enrolled at that time to report that they were employed in April 1997 (92 percent versus 75 percent) (table College graduates who were enrolled full time and not employed in April 1994 were more likely to be out of the labor force in April 1997 than graduates who were enrolled full time and employed, employed and not enrolled at all, or enrolled part time in April 1994 (24 percent, versus 8, 6, and 9 percent, respectively) (table 1.2). Unemployment rates in April 1997 for graduates who were not employed but enrolled full time or neither employed nor enrolled in 1994 were higher than the rate for students who were enrolled part time in 1994 (7 percent and 6 percent, respectively, versus 1 percent) (table 1.2). In April 1997, females were slightly more likely than males to have held four or more jobs since graduation (30 percent versus 26 percent) (table 1.3). Bachelor's degree recipients in 1992-93 who had two or more children had held a lower average number of jobs (2.2) since graduation than those who had one child (2.6) or no children (3.0) (table 1.3). Graduates who had received their bachelor's degree at age 24 or younger (including those 22 or younger and those 23-24) had held more jobs, on average, since graduation (3.1 and 3.0, respectively) than those who were older when they received their degree. Those who were 25-29 when they earned the degree had held 2.6 jobs and those 30 and over had held 2.2 jobs since graduation (table 1.3). With the exception of a slight difference between borrowers who owed $1,000-4,999 and those who owed $10,000-19,999, there were no differences in the average number of jobs held since graduation among students with different levels of debt. Although it Section IEmployment Status appears that borrowers who owed less than $1,000 were more likely to report a higher average number of jobs than others, there is not enough evidence to make this conclusion. (table 1.3). Students whose parents had not continued their education past high school (less than high school or a high school diploma) had held fewer jobs, on average, between their graduation and April 1997 than those whose parents had attained a bachelor's or advanced degree (table 1.3). There were some differences by occupation type in the number of jobs held since graduation. For example, college graduates in business and management had held an average of 2.6 jobs, compared with their counterparts who were educators or in service positions, who had been employed in an average of 3.2 jobs. Educators include teachers in non-elementary/secondary settings, in addition to K-12 teachers. Those employed in engineering had also held fewer jobs than those employed in school teaching or service (table 1.3). Students who were enrolled full time and working in April 1994 reported in 1997 that they had held, on average, a greater number of jobs since graduation than graduates who reported in 1994 that they were enrolled full time and not employed or those enrolled part time (3.5 versus 2.7 and 2.8 respectively) (table 1.3)."}, {"section_title": "Section IEmployment Status", "text": "Twenty-two percent of graduates who were not enrolled but employed in April 1994 reported that they were employed in business and management jobs in 1997. Fifteen percent and 14 percent of those who were not enrolled but employed in April 1994 were employed as school teachers and administrative personnel, respectively. About one in ten graduates (9 percent) who were not enrolled but employed in April 1994 reported that they were employed in sales jobs in April 1997 (table 1.4). Among 1992-93 college graduates employed full time in April 1997, males had significantly higher average salaries than females ($38,430 versus $30,578).21 This is consistent with the findings in the 1-year follow-up of the Baccalaureate and Beyond Longitudinal Study (B&B:93/94)22 (table 1.5). The average full-time salaries of college graduates who had majored in professional fields (business and management, education, engineering, health, or public affairs/social services) were higher than those who had majored in the arts and sciences ($35,525 versus $32,890) (table 1.5). Among the professional fields of study that college graduates chose as majors, the average full-time salary was higher for those who had majored in engineering ($44,524), health professions ($39,421), or business fields ($37,454) than it was for graduates who had majored in public affairs/social services ($30,563) or education ($26,513) (table 1.5). While average annual April 1997 salaries seemed to be higher for graduates who had reported in 1994 that they were enrolled full time and not employed ($35,126) than for those who were enrolled full time and employed, or those employed and not enrolled ($31,836 and $34,611, respectively), there is not enough evidence to make this conclusion (table 1.5). While average annual April 1997 salaries appeared to be higher for graduates who had reported in 1994 that they had $20,000 or more in undergraduate debt than for those with less debt (ranging from less than $1,000 to $19,999), there is not enough evidence to make this conclusion (table 1.5). Graduates with bachelor's degrees from private, not-for-profit doctorate-granting institutions earned, on average, higher annual salaries than graduates from private, notfor-profit nondoctorate-granting institutions and public doctorate or non-doctorategranting institutions ($38,806 versus $33,858, $34,340, and $31,967) (table 1.5). 21Sa1aries are reported for college graduates who were employed full time in April 1997, regardless of their enrollment status (81 percent of all graduates) (table 1.5). The salaries represent the annualized wages/salaries reported for the April job. Thus, if the respondent reported an hourly or monthly wage, it was annualized. Yearly salaries that exceeded $500,000 were reset with a value of $500,000. Consistent with the 1993-94 B&B report, average salaries (column 6) include salaries that range from $1,000 to $500,000. \n"}, {"section_title": "Unemployment", "text": "The unemployment rates were calculated for April 1997 (about 4 years after graduation) and are based on all college graduates who were in the labor force, regardless of their enrollment status. Note that 44 percent of graduates who were out of the labor force in April 1997 were enrolled full time in school at that time (see table I.1)."}, {"section_title": "O", "text": "In April 1997, the unemployment rate for 1992-93 college graduates was 2.9 percent (the rate excludes those not in the labor force) (table 1.6). As a point of reference, the U.S. unemployment rate for April 1997 was 5.0 percent (for adults 25 and older, it was 3.7 percent).23 The unemployment rate for college graduates who had majored in professional fields of study was lower than the rate for those who had majored in the arts and sciences (2 percent versus 4 percent) (table 1.6). Nearly 40 percent of 1992-93 college graduates had experienced some period of unemployment since their graduation. Among those who had ever been unemployed, the longest duration of unemployment averaged 7 consecutive months (table 1.6). While unemployment rates seemed to be higher for Asian/Pacific Islander and black, non-Hispanic graduates (7 and 5 percent, respectively) than those for white, non-Hispanic graduates (3 percent), there is not enough evidence to support the conclusion that these unemployment rates are significantly different (table 1.6). o The 1992-93 college graduates who reported being unemployed in April 1997 reported that they had been unemployed for an average of 16 months since graduation. Members of this group indicated that the longest average period of unemployment they had experienced was 13 months (table 1.6). Between April 1994 and April 1997, graduates who were employed but not enrolled in April 1994 reported that they had experienced fewer months of unemployment (6 months), on average, than graduates who were enrolled full time and employed in 1994 (7 months); graduates who were enrolled full time and not employed in 1994; or graduates who were neither enrolled nor employed in 1994 (14 months each) (table 1.6). Between 1994 and 1997, graduates who were employed but not enrolled in 1994 reported that their longest average period of unemployment was 5 months. For those who were enrolled full time and employed, or those enrolled part time, in 1994, the longest average spell of unemployment was 7 months. Among those enrolled full time but not employed, or those neither enrolled nor employed, in 1994, the longest duration of unemployment during this period averaged 13 months (table 1.6). 23Bureau of Labor Statistics, Labor Force Statistics from the Current Population Survey, table A-9, seasonally adjusted.         Table I.5-Percentage distribution according to annual salaries, and average annual salaries, for 1992-93 bachelor's degree recipients employed full time in April 1997, by selected characteristics -Continued Full-time salary distribution A verage annual salary' Less than $10,000-$10,000 14,999   'Respondents reporting salaries less than $1,000 were excluded (10 cases unweighted). Respondents reporting salaries greater than $500,000 were reset to $500,000.  "}, {"section_title": "SECTION II Characteristics of Job", "text": "General Job Characteristics Among 1992-93 bachelor's degree recipients who were working in April 1997, at least half reported that their job was closely related to their degree or that it had definite career potential (56 percent and 57 percent, respectively). About 7 in 10 reported that their April job incorporated skills they had used or learned in their previous jobs (table   II.1). Among employed college graduates, 7 percent reported that they had a part-time job and 9 percent that they worked less than 35 hours a week. Women were more likely than men to report having a part-time job (9 percent versus 4 percent) (table II.1). Students who had majored in professional fields were more likely to say that their jobs were closely related to their undergraduate field of study (64 percent) than were those majoring in arts and sciences (44 percent). Those majoring in professional fields and the arts and sciences were equally likely to indicate that they had jobs with definite career potential (table II.1). . Among 1992-93 bachelor's degree recipients who had majored in professional fields, the group most likely to say that their 1997 job was closely related to their degree was those who had majored in health professions (85 percent), followed by those majoring in education (68 percent), engineering (61 percent), public affairs/social services (60 percent), and business and management (58 percent). Among those who had majored in arts and sciences, the percentage indicating that their job was closely related to their degree ranged from 31 percent of those in social sciences, to 49 percent of those in biological sciences, to 66 percent of those in mathematics and other sciences (table   II.1). Forty-six percent of those employed part time in April 1997 indicated that they preferred to work full time (table In)."}, {"section_title": "Employer Benefits", "text": "Most 1992-93 bachelor's degree recipients indicated that they received various benefits from their jobs in 1997. Eighty-eight percent reported receiving health insurance, 87 percent paid vacation, and 86 percent paid sick leave. Slightly fewer (80 percent) were offered retirement benefits by their employers (table 11.2). 1992-93 bachelor's degree recipients who were employed part time in April 1997 were far less likely than their full-time employed counterparts to receive health insurance (39 percent versus 91 percent), paid sick leave (38 percent versus 89 percent), "}, {"section_title": "Satisfaction With Various Employment Characteristics", "text": "Most 1992-93 bachelor's degree recipients (80 percent) were very satisfied with their co-workers at their 1997 jobs. Six in 10 were very satisfied with their supervisor, and slightly fewer (56 percent) were very satisfied with working conditions at their place of employment (table 11.3). Respondents who had earned first-professional degrees since graduating from college were more likely than those who had earned master's or bachelor's degrees (75 percent versus 59 and 60 percent, respectively) to say that they were very satisfied with their supervisor at their 1997 job (table 11.3). The proportion of respondents who indicated that they were very satisfied with working conditions at their 1997 jobs ranged from about 4 in 10 for those in military or protective services occupations to about two-thirds for those in engineering occupations (table 11.3)."}, {"section_title": "Satisfaction With Current Opportunities and Compensation", "text": "With respect to their 1997 jobs, respondents who had earned their bachelor's degrees in 1992-93 were most likely to say that they were very satisfied with job security (64 percent), followed by job challenge (58 percent), fringe benefits (55 percent), and educational benefits (48 percent). About 4 in 10 indicated that they were very satisfied with promotion opportunity, and about 1 in 3 were very satisfied with the pay from their current jobs (table 11.4). The proportions of respondents who were very satisfied with their job security varied among members of different racialethnic groups. Black, non-Hispanics (49 percent) were less likely than Asian/Pacific Islanders (63 percent), white, non-Hispanics (65 percent), or Hispanics (67 percent) to indicate that they were very satisfied with this aspect of their job (table 11.4). Males were more likely than females to indicate that they were very satisfied with opportunities for promotion at their jobs (42 percent versus 36 percent) (table 11.4). Respondents who had majored in professional fields were more likely than those who had majored in arts and sciences to indicate that they were very satisfied with the job challenge at their current jobs (60 percent versus 55 percent) (table 11.4). The percentage of respondents saying that they were very satisfied with the pay their 1997 jobs offered them ranged from 24 percent for those in service occupations to 44 percent for those in engineering jobs (table 11.4). The 1992-93 bachelor's degree recipients who worked part time in April 1997 were less likely than their counterparts working full time to be very satisfied with job security (52 percent versus 65 percent) and fringe benefits (30 percent versus 57 percent). so Section 11Characteristics of Job However, there was no significant difference between the two groups with respect to their satisfaction with pay (33 percent each) (table 11.4)."}, {"section_title": "Reasons for Taking Current Job", "text": "About one in five 1992-93 bachelor's degree recipients indicated that they took their 1997 job because it was related to their field of study or because it was interesting work. Fewer indicated that they took their current position because it was intellectual work (9 percent) or because they had previous work experience in that field (8 percent) (table 11.5). Females were more likely than males to say that they had taken their current position because it was related to their field of study (22 percent versus 16 percent) (table 11.5). Respondents who had earned master's degrees or postbaccalaureate certificates (28 percent each) were more likely than those who had not pursued graduate education (17 percent) to say that they took their current job because it was related to their field of study. While it also appears that students who had earned first-professional degrees were more likely than those who had not pursued graduate education to indicate this as a reason for taking their job, there was not enough statistical evidence to make this conclusion (table 11.5)."}, {"section_title": "Financial Reasons for Taking Current Job", "text": "Sixteen percent of 1992-93 bachelor's degree recipients said that they took their job because it was a better advancement opportunity for them. About 1 in 10 took their job because it provided a good income to start or had good income potential, while 5 percent said that they chose the job because it provided good job security (table 11.6). Males were more likely than females to indicate that they took their current positions for a variety of financial reasons: that the job provided a better advancement opportunity (18 percent versus 14 percent), good income to start (13 percent versus 10 percent), or good income potential (13 percent versus 8 percent). Males and females were equally likely to indicate that they took their current job because it offered good job security (table 11.6). Graduates who were working full time in April 1997 were more likely than those working part time to indicate that they took their current position because of better advancement opportunities (17 percent versus 7 percent) and good income potential (11 percent versus 2 percent) (table 11.6)."}, {"section_title": "How Respondents Found Jobs", "text": "Roughly one-third of 1992-93 bachelor's degree recipients indicated that they had found their 1997 jobs through referrals. About one-fifth said that they had found their jobs through want ads, and fewer (8 percent) said that they had found their current employment through an employment agency (table 11.7).    -Too few cases for a reliable estimate. 'Respondents were asked a series of questions about specific reasons why they selected their current jobs. These answers were the most common reasons relating to finances that were mentioned by respondents. -Too few cases for a reliable estimate. 'Respondents were asked a series of questions about specific ways they found their current jobs. These answers were the most common reasons that were mentioned by respondents. In part of the analysis, they are also grouped according to more specific enrollment and employment characteristics that take part-time/full-time status into account.  "}]