[{"section_title": "", "text": "xi IMPLAN model construction .........................................................................................75 Customer surveys .........................................................................................................79 Impact analysis ............................................................................................................80 RESULTS .............................................................................................................................81 Model 1: multiplier and distributional impacts .............................................................81 Model 2: multiplier and distributional impacts .............................................................82 Food Hub customer survey results ................................................................................83 DISCUSSION AND CONCLUSIONS ...............................................................................................85 FUTURE RESEARCH ................................................................................................................87 REFERENCES ........................................................................................................................ "}, {"section_title": "INTRODUCTION", "text": "Among researchers, there is broad consensus that rural development policies in the United States (U.S.) have not met the needs of rural people and communities (Stauber 2001, 33) and that \"policies to improve the disappointing economic performance of rural regions are, by and large, not working\" (Porter et al. 2004, 3). Quigley (2002), for example, provides a detailed analysis of economic trends in rural and urban areas from 1970-2000 and finds a drop in total rural personal income, rural per capita incomes at about 70% of urban incomes, and increasing disparities in wages and salaries between rural and metropolitan regions. The period between 2010 and 2012 represents the first recorded period of nonmetro population loss in U.S. history, highlighting a growing demographic challenge facing much of rural America. At the community level, this may reduce the demand for jobs, diminish the quality of the workforce, and raise the per capita cost of providing services (Kusmin 2013, 6). 1 Part of the challenge is that the U.S. has never had a systematic approach to rural development policy (Long 1987). There is no Department of Rural Development. The Rural Development Agency is one of 34 Agencies and Offices housed under the U.S. Department of Agriculture (USDA) (USDA 2013a). The fact that agriculture supersedes rural in the layers of federal bureaucracy may be indicative of a piecemeal approach to rural development. The 'farm bill' (an omnibus bill passed approximately every five years), is the primary policy tool of the U.S. government to support agricultural and rural development. The first farm bill, called the Agricultural Adjustment Act (AAA), was passed as part of Franklin D. Roosevelt's New Deal in 1933 as an emergency response to post-World War I economic distress in agriculture. When the AAA passed, 21.5 percent of the U.S. workforce worked in agriculture, and the agricultural gross domestic product (GDP) was 7.7% of total GDP (Dimitri et al. 2005). The 1933and 1938AAA, and 1948, 1949, 1954, 1956, 1965, and 1970 Agricultural Acts created and maintained agricultural commodity support mechanisms, supported by a \"socalled iron triangle of farm bloc interest groups (originally the Farm Bureau, later other farm and commodity groups as well), the USDA, and congressional agricultural committees\" (Lehrer 2010, 60). The result was tremendous increases in productivityimproved crop varieties through plant breeding and increased use of chemicals, fertilizers, pesticides, and sophisticated machinery (e.g., Dimitri et al. 2005;Lehrer 2010). By 1970 the U.S. employed labor force working in agriculture declined to four percent as consolidation and growth in farm size increased. Additionally the relative share of agricultural GDP to total GDP declined to 2.3% (Dimitri et al. 2005). Simultaneously, a host of nonfarm interest groups-ranging from environmentalists to consumers to anti-hunger groups-gained access to the farm bill policy process. An urban-rural alliance among legislators developed whereby urban legislators would vote for the farm bill if rural legislators would support the Food Stamp Act (a national feeding program) (Lehrer 2010). However, a schism developed among rural America's farm bill interests; rural development interest groups, distinct from agricultural commodity interest groups, began to emerge (the Center for Rural Affairs, for example, was started in 1973) (Center for Rural Affairs 2012). These rural development groups argued that the productivity of industrial agriculture was accompanied by serious side effects for rural America, including changes in rural employment, structure, and economic development incentives. Growth in farm size and consolidation, for example, meant that former small farmers began migrating out of rural communities in search of employment. Many rural communities were left without threshold levels of inhabitants to sustain local businesses (Lehrer 2010). 2 Despite these structural changes in rural America, the powerful commodity agricultural interest groups (including agribusiness corporations such as Cargill and Tyson, general farm organizations such as the American Farm Bureau Federation, and commodity groups such as the National Corn Growers Association) maintained their position that funding for rural America was better spent supporting commodity agriculture (Lehrer 2010; Sheingate 2001). A sufficiently influential champion for rural development policy never emerged (Sheingate 2001). Consequently, rural development programs continue to be squeezed. The Agricultural Act of 2014 (the 2014 farm bill) provides the most recent example of the inferiority of rural development programs with 80% of projected outlays from the bill expected to fund nutrition programs, 6% conservation programs, 5% commodity programs, and the remaining 1% to everything else-including trade, credit, rural development, research and extension, forestry, energy, horticulture, and miscellaneous programs (USDA ERS 2014). The limited resources devoted to rural development, and inability for policymakers to fully distinguish its needs from commodity agriculture, may provide explanation for the failure of U.S. rural development policy."}, {"section_title": "Defining 'rural'", "text": "Another frequently cited reason for the failure of U.S. rural development policy is policymakers' definitional choices for 'rural' (e.g., Brown and Schafft 2011;Dabson et al. 2012;Isserman 2005;Shortall and Warner 2012). Brown and Schafft (2011) write that rural has always been defined using a location or 'place' approach, which \"suffers from a number of inadequacies\" (7). First, this approach assumes a clear delineation between urban and rural places. Second, and related to the first, while the 'urban' definition is often carefully calculated, the 'rural' becomes everything else. Shortall and Warner (2012) concur that \"nonmetropolitan/rural areas are [defined as] those that are not metropolitan urban areas\" (8). Thus, implicitly, the heterogeneity of rural regions is largely ignored (Drabenstott 2001). These rural definitional choices have very important policy impacts. First, they affect how data are collected and viewed. The U.S. Bureau of the Census provides a poignant example. The Bureau uses population size and density thresholds to carefully delineate what is urban (metro), and then defines what remains as rural (nonmetro) Dabson et al. 2012;Shortall and Warner 2012). Careful analysis of the 2000 Census, however, using the metro/non-metro distinction, results in more than half of all rural residents living in metro counties . The specific needs of these constituents may therefore be masked by the county's metro designation. Second, the definition of rural establishes the rules regarding which localities can benefit from USDA's Rural Development programs. Most Rural Development programs include maximum population thresholds, above which municipalities are not eligible to participate (USDA 2013c). As part of the Food, Conservation, andEnergy Act of 2008 (The 2008 Farm Bill), the Secretary of Agriculture was required to report to the Committee on Agriculture of the House of Representatives and the Committee on Agriculture, Nutrition, and Forestry of the Senate on the Department's various definitions of the term 'rural', the definitional effects, and recommendations for improvement. The report acknowledges that within the Office of Rural Development there are \"arbitrary barriers…perpetuating community isolation and less cost-effective economic and community development practices… [For example,] if a regional sewer project encounters a municipality of greater than 10,000 population…that community cannot be part of the Rural Development financing application no matter how much sense it might make to project engineers geographically and no matter what the impact of including the larger community might have had on end user rates as fixed costs get spread over a larger number of end uses\" (USDA 2013c, 10). The definitionally established delineation between urban and rural boundaries also has the effect of supporting policy aimed solely at rural or urban areas, rather than toward broader regions encompassing both rural and urban. This may be important as researchers acknowledge the high degree of connectedness and interdependence between urban and rural America (e.g., Irwin et al. 2010).  highlight the \"new rural-urban interface\" marked by \"rapid changes now taking place in rural America and the blurring of rural-urban spatial and social boundaries\" (566), as well as the \"new scholarly dialogue…along the rural-urban divide\" (585). Kubisch et al. (2008) underscore the influence that rural and urban places have on each other. And  writes that \"leading thinkers on strategies to achieve greater rural prosperity emphasize the value of strengthening productive ties between rural and urban places\" (1)."}, {"section_title": "Local and regional food systems: opportunities for regional development", "text": "Though historically there have been few federal programs to create and enhance strategic linkages between rural and urban areas, increased interest in and support for local and regional food systems are starting to bridge that gap. The USDA 2013creport provides evidence of changes-particularly in regards to an expanded rural definition with respect to local and regional food systems. 3,4 In making this change, policymakers and agency staff explicitly acknowledge the \"role of more populous areas in providing market opportunities for goods and services provided by rural people\" (USDA 2013c, 10). Both the 2002 and 2008 Farm Bills expanded access for local and regional food enterprises to loans and loan guarantees under the Business and Industry (B&I) program, to establish and facilitate the growth of local and regional food markets (as well as to support increased access to 'local' food in 'food desertsi.e., underserved communities). The 2008 Farm Bill reserved at least five percent of B&I funding each year for this purpose, and defined eligible businesses as those selling product within 400 miles of the farm, or within the same state (USDA 2013c). This shift in Farm Bill policy reflects the recommendation of many researchers and practitioners advocating for a move to regionalized policies to support rural development, as well as the desire of many health, consumer, and environmental interest groups to strengthen alternative local and regional food systems (e.g., Dabson et al. 2012;Feenstra et al. 2003;Gillespie et al. 2007;Jensen 2010;Kubisch et al. 2008;Marsden et al. 2000;Porter et al. 2004). The term 'local food systems' has prevailed in the U.S. since the 1990s, marked by increased interest in sustainable agricultural production and alternative food markets (Dimitri et al. 2005;. And though, other than with respect to the B&I program, the term does not have a legal definition, it most frequently references geographic proximity between producers and consumers, and, secondarily, social, environmental, or supply chain characteristics (Johnson et al. 2013; Hand and Martinez 2010;. By almost any measure the demand for locally and regionally grown products has increased.  found that \"the value of direct-to-consumer food sales in the United States grew 37 percent between 1997 and 2002-from $592 million to $812 million\" (Tropp et al. 2008, p.7). Farms that market their products direct-to-consumer (through farmers' markets, Community Supported Agriculture, farm stands, U-pick operations, etc.) are often thought of as synonymous with local food systems (e.g., Ostrom 2006). However, as  point out, \"the 'systems' of local food systems entail more involved and potentially complicated overlays of economic activities, institutions and networks\" (157). , reiterate this sentiment, finding that most local food involves intermediary businesses (e.g., aggregators, distributors, wholesalers) to get the product from farmto-market; when they include local food system participants with intermediated sales in their estimates of total sales, they find a number four times higher than estimates based on direct-to-consumer sales alone--$4.8 billion in 2008. Acknowledging the myriad of actors involved in sustaining this economic activity is important in determining the size of the sectors, and understanding its potential as a strategy for rural development. Since 2009 when the USDA and President Obama created the Know Your Farmer, Know Your Food (KYF) initiative, an inter-agency task force to \"help connect producers with new opportunities in local and regional marketing-and to better inform Americans about the business of agriculture and opportunities to connect with farmers and ranchers\" over 2,600 projects nationwide have been supported, mostly through farm bill appropriations (USDA 2013b). 5 For example, federal funding has supported almost 450 projects nationally that expand farmers' markets, over 860 projects to increase the production of fruits and vegetables for sale at local markets, and more than 4,000 microloans to small-scale producers interested in local marketing opportunities. According to the Secretary of Agriculture, Tom Vilsack, these initiatives support enhanced rural economic development and farm viability, and thus 5 The KYF initiative has been met with some resistance, particularly on the part of commodity agriculture interest groups. Former ranking member of the Senate Agriculture, Nutrition and Forestry Committee, Senator Roberts (R-Kansas, a longtime supporter of commodity agricultural interests), for example, raised questions about the efficacy of the Know Your Farmer, Know Your Food initiative. \"But policy makers must ask with such dramatic private sector growth would taxpayer dollars be better invested elsewhere, like research, pest and disease management that help the entire industry, rather than one particular farmers' market\" (Little 2012). Despite the development of the KYF initiative, it has no money or staff, but rather provides a framework under which USDA agency staff can interact. developing local and regional food systems has become one of the Department's priorities (USDA 2013b). Despite the increased interest from the USDA to support these initiatives, there have been very few empirically-driven analyses of the efficacy of local and regional food systems as a strategy to support regional economic development. 6 Further, there is not an agreed upon methodology for how these type of assessments should be conducted. Accordingly there is a widespread call from policymakers and researchers to spur this effort (e.g., Jenson 2010;; The National Research Committee on Twenty-First Century Systems Agriculture, National Research Council 2010). One major barrier to conducting economic impact assessments of local and regional food system initiatives is the lack of requisite data for complete evaluation. , for example, writes that \"official tracking of direct farm sales has not kept pace with the sector's growing importance in the U.S. food system\" (1310). Matteson and Hunt (2012) similarly note that \"agricultural data collection efforts usually focus on farm production issues, not…marketing practices\" (10). Through a series of three papers, this dissertation contributes to the question: What are the regional economic impacts of policies supporting re-localized food systems? The first paper develops an enhanced understanding of how local food system participants interact with other businesses and industries in a local economy, which is important for economic impact assessments. The second paper provides an empirically-driven methodology to estimate the regional and farm-level economic impacts produced by policies promoting an increasingly popular regional food system initiative: food hubs, i.e., local food aggregation and distribution businesses. The third paper builds upon the second paper by examining the extent to which food hubs increase the overall availability of locally-grown food, enhance farm entry into markets, and impact farm viability. Together these papers make important methodological and empirical contributions to evaluating the regional economic impacts of policies supporting re-localized food systems, and thus to considering the role local food systems can play in rural economic development."}, {"section_title": "Paper 1: Differentiating 'local' producers' expenditure profiles to evaluate impacts of policies supporting local food systems", "text": "The economic impact of an industry depends on the size of the industry, number of and payment to employees, and its linkages to other industries within a local economy. Each industry requires inputs in order to produce its outputs. The act of purchasing these inputs creates linkages with other industries. Purchases can be made locally, or they can be made from the rest of the world. When they are made locally, these interindustry purchases can be measured to show the strength of linkages within a locality. When non-local purchases are made, the money leaks out of the local economy. The stronger the local inter-industry linkages, the larger the local economic impact (Ribeiro and Warner 2004). Most economic impacts from re-localized food systems occur from import substitution (Swenson 2009). 7 As consumers (e.g., households, restaurants, schools, grocery stores, hospitals) shift their purchasing preferences and patterns towards locally-grown and processed products, they are strengthening the inter-industry linkages within their local economy. This increase in local purchases usually comes at the expense of other purchases. As local purchases increase, consumers will likely decrease their nonlocal purchases. Consumers are thus substituting imports with local purchases, theoretically resulting in a positive local economic impact. To conduct economic impact assessments, therefore, one must have information about inter-industry linkages both within and among sectors of an economy. This information can then be used to assess the impact of a policy (exogenous shock) on all inter-linked industries within an economy (i.e., a policy that expands the amount of locally-grown products purchased by a school). A Social Accounting Matrix (SAM) model is an accounting system that links the economic transactions within an economy among production sector, labor and other factors of production, and government and other institutions (Miller and Blair 2009). Most previous local food assessments utilize SAM models with data and software generated by the IMPLAN Group, LLC. to analyze the local economic impact resulting from import substitution (e.g., Haynes 2010;Kane et al. 2010;Leung and Loke 2008;Swenson , 2011Timmons 2006). One of the main challenges, however, with this body of work is that the data available on inter-industry linkages are generally available only at the aggregate enhancing regional exports have the same direct impact (assuming the same comparative advantages), but import substitution increases the indirect effects through additional endogenous purchases, which then increase the output and income multipliers. commodity sector scale, which limits the extent of tractable analyses of local food system activities. To this point, most current research quantifying the impact of local food systems utilize expenditure patterns for aggregated agricultural commodity sectors, thus assuming that the purchasing and sales patterns of local food producers are indifferent from those in aggregated commodity sectors. By default, the entire economy is represented by 440 sectors within IMPLAN data. Each IMPLAN sector is represented by a single, static production function (the type and quantity of inputs required to produce one unit of output). The production function for each sector reflects average purchase and sales patterns across all firms in the sector, without the requisite information to be able to disaggregate them by any specific characteristic (i.e., scale of operation, or marketing channel) (Lazarus et al. 2002;Liu and Warner 2009). 8 As IMPLAN sector data represents all inter-industry linkages, the expenditure and sales patterns are more reflective of those firms that contribute a higher proportion of total output in the sector (typically the larger firms) (Lazarus et al. 2002;)."}, {"section_title": "In early 2013, the Union of Concerned Scientists and Michigan State", "text": "University's Center for Regional Food Systems convened a two-day meeting of economists and local food researchers to identify data needs and best practice methodologies in order to better understand the impact of local food system activity. One of the specific gaps identified was a need to better understand the input expenditure patterns of farms that sell into local food markets and, in particular, what inputs farms require and where the inputs are purchased . Understanding farm expenditure patterns is critical in assessing how local food systems impact local economic development. To the extent that local food system participants have different expenditure patterns than other types of agricultural producers, they will interact with the local economic sectors differently and produce varied impact results. Given that local food system participants tend to be smaller in scale, and represent a small overall portion of agricultural sector transactions , the estimates of the impacts from increased local food sales based on existing IMPLAN data may be misleading if local food system participants have different patterns of input expenditures (e.g., different production functions) and/or they purchase a different proportion of their inputs from local sources. The first paper of this dissertation provides data-driven results to enhance understanding of the production profiles (or inter-industry linkages) of local food system participants. Utilizing two unique data sets from samples of producers in New York State (NYS), along with 2008-2011 USDA Agricultural Resource Management Survey (ARMS) data, this paper constructs expenditure profiles for local food system participants in NYS. Building on an initial case study by , the primary contribution of this article is to demonstrate with strong empirical evidence that local food system participants in NYS have different expenditure patterns than farmers who do not sell through local food markets. This paper shows that farmers with local food sales have higher reliance on local labor and 'other variable expenses' as primary inputs than farms without local food sales. Additionally, when field crop, fruit, and vegetable producers with local food sales are viewed alone, they have lower expenditures on fertilizer and chemicals-the largest expenditure item for farms without local food sales. Accordingly, researchers who utilize aggregate agricultural sector data to determine the economic impact of policies supporting local food system activity will likely under-estimate overall impact."}, {"section_title": "Paper 2: Assessing the economic impacts of food hubs to regional economies, including opportunity cost", "text": "Building on the production function data collected in the first paper, the second paper applies these differential expenditure patterns to an examination of the regional economic impacts that result from policies supporting a local food initiative. The paper uses an illustrative local food initiative, a food hub, as an example. Following the USDA's working definition, a food hub is a \"business or organization that actively manages the aggregation, distribution, and marketing of source-identified food products primarily from local and regional producers to strengthen their ability to satisfy wholesale, retail, and institutional demand\" (Barham et al. 2012, 4). The USDA supports food hubs in an effort to: 1) increase market access for local growers, particularly those that are small and mid-scale; and 2) strengthen regional food systems (USDA AMS 2014). Food hubs are receiving increasing levels of financial and professional development support from the USDA, state governments, and private foundations. For example, the USDA's KYF task force has a Regional Food Hub Subcommittee. In 2011, the Subcommittee prepared a list of 15 USDA agency programs that already provide funding to support food hubs, including: Rural Development; Agricultural Marketing Service; the National Institute of Food and Agriculture; Farm Service; Natural Resources Conservation Services; and Risk Management (USDA KYF 2011). Some state governments have also utilized public funds to support food hub development. In February 2013, the New York State Governor announced $3.6 million in state funding to support four new food hubs . Despite this substantial and growing interest in food hubs, as well as a burgeoning literature, there have been no data-driven economic impact assessments completed to date, nor is there an agreed upon methodology about how an economic impact assessment should be conducted (O'Hara and Pirog 2013). The primary objective of this paper is to promote the utilization of a bestpractice methodology to evaluate the economic impact of food hubs to regional economies and the participating farms they support. By collecting detailed expenditure and sales information from food hubs, as well as participating farms, a SAM analysisby-parts approach is used to estimate the multiplier effects of a change in final demand for food hub products. The framework developed is applied to a case study analysis of a food hub located in NYS. Using Regional Access, LLC (a food hub located in Trumansburg, NY) as a case study, this paper demonstrates that the estimated multiplier effects on the farm sector are 7% lower when using the agricultural sector data that is not differentiated by local food system participant production function information. And, overall, the total output multiplier is biased downward. If the farms in this case study are shown to be typical elsewhere, the impact of food hubs utilizing default IMPLAN agricultural sector data will likely underestimate the true magnitude of the local economic impact. Of more fundamental importance to the rural economy, however, is the ability of food hubs to strengthen the interlinked network of business-to-business and business-tocustomer sales within the region. Thus results showing that local food system participants spend more money per unit of output on employee compensation, other agricultural sectors, and support activities for agriculture and forestry, may be particularly important for rural economies. In addition to the importance of understanding local food system participants differential expenditure patterns mentioned above, the other key difficulty in previous local food economic impact assessments is what O'Hara and Pirog (2013) refer to as an 'interpretation' challenge. Specifically, \"stipulating how the 'opportunity cost'…is defined\" (4). As they rightly point out, measuring opportunity cost is not straightforward, and requires information about the extent to which increased consumer purchases of locally-grown food offsets other types of purchases, changes market prices and/or supply chain characteristics, or impacts land use. There are only a handful of local food economic impact assessments that explicitly acknowledge the need to consider opportunity cost Tuck et al. 2010;. However, each of these studies makes assumptions about the sectors in which there are decreased purchases (or changes in land use) as a result of increases in local food consumption-in other words, none collects the data necessary to more fully understand the opportunity costs of increased local purchases. Accordingly, the secondary objective of this paper is to better understand the extent to which food hubs increase the overall demand for and consumption of local food products. By collecting detailed customer information on purchasing patterns from food hubs, a better understanding of the important factors affecting the growth and scalability of food hubs as business enterprises can be attained, along with estimating the opportunity costs associated with increases in food hub product purchases (i.e., offsets via decreases in purchases in other sectors). Results from the Regional Access case study estimate that a policy that generates an additional $1 direct effect increase in final demand for food hub products also results in a $0.11 direct effect offset in purchases from other sectors occur (mainly the wholesale trade sector). When including this corresponding negative direct effect in the SAM model, the gross output multiplier is reduced by over 11%, demonstrating the importance of including opportunity costs in future assessments."}, {"section_title": "Paper 3: Increasing access to 'local food': evaluating the farm-level impacts of food hub development", "text": "The third paper builds upon the second paper, continuing to examine the impact of food hub development. One of the major motivations for supporting food hub initiatives is to increase consumer access to local foods, and farm access to markets, thereby increasing farm profitability. Given that most local food moves through intermediated channels , the USDA has determined that unmet demand is due to the fact that accessing appropriately scaled markets is difficult for small-and mid-sized farms as supply chains become more vertically-integrated and consolidated. Large-scale supermarket retail and wholesale operations demand large volumes, low prices, and consistent quantities and qualities that must meet increasingly strict safety standards. The procurement systems in such markets are often vertically and horizontally integrated, global in scale, and aim to maximize efficiency ). However, to date there has been little empirically-driven research that examines if food hubs increase the overall availability of local foods. The primary objective and contribution of this paper is to better understand the extent to which food hubs increase consumer access to locally-grown and processed products, enhance farm-entrée to markets, and support farm viability. As in paper 2, a case study approach is employed, given the significant data needs to conduct this type of analysis. The case study includes surveys with over 300 food hub customers, and in-depth interviews with 30 farms and 15 processors that sell food products to a food hub. This paper offers some of the first empirical evidence that food hubs increase consumer access to locally-grown and processed foods, improve farm access to regional markets, and support farm business expansion. Catalyzed by a myriad of actors, many local food outlets (e.g., farmers' markets, food hubs, farm-to-school programs) are supported through public policies at the local, state, and/or federal levels, often under the auspices of strengthening community economic development. Despite the proliferation of these policies (the U.S. Department of Agriculture reports funding over 2,600 local food projects between 2009-2013, USDA 2013), the resulting economic impacts remain unclear, largely due to data deficiencies precluding comprehensive analysis. To conduct economic impact analyses, one must have information about interindustry linkages both within and among sectors of an economy; i.e., as a business or industrial sector buys from and sells goods and services to other sectors of the economy and to final users, the firm stimulates additional economic activity by other businesses and within other industrial sectors. This information is generally available only on an aggregate commodity sector scale, particularly for agriculture (e.g., IMPLAN data and software provided by the IMPLAN Group LLC), which limits the extent of tractable analyses of local food system activities. To this point, most current research quantifying the impact of local food systems utilize expenditure patterns for aggregated agricultural commodity sectors (e.g., Kane et al. 2010;Leung and Loke 2008;Conner et al. 2006;Swenson , 2011Timmons 2006;; University of South Carolina 2010), thereby assuming that the purchasing and sales patterns of local food producers are indifferent from those in aggregated commodity sectors. In early 2013, the Union of Concerned Scientists and Michigan State University's Center for Regional Food Systems convened a two-day meeting of agricultural economists to identify data needs and best practice methodologies to assess the economic impact of local food system activity. One of the gaps identified was a need to better understand the input expenditure patterns of farms that sell into local food markets and, in particular, what inputs farms require and where the inputs are purchased O'Hara 2013a, 2013b). This is not to suggest that the 2013 meeting was the first time that researchers have called for this type of information. Krinke (2002), for example, states that little is known about the labor and materials farmers use to supply their farms based on alternative farming systems. And  specifically called for more research on expenditure patterns of local food participants. Understanding farm expenditure patterns is critical in evaluating how policies supporting local food systems impact community economic development. To the extent that local food system participants have different expenditure patterns than other types of agricultural producers, they will interact with the local economic sectors differently and produce varied impact results. While previous attention on input purchase patterns and their connection to economic impacts has concentrated on farm size and/or alternative farming practices, little attention has focused on differential purchasing practices by producers involved in local food channels, either through direct-to-consumer (D2C) or through intermediated markets. As a step towards better understanding the production profiles of local food system participants, this article utilizes two unique data sets from samples of producers in New York State (NYS), along with 2008-2011 U.S. Department of Agriculture (USDA) Agricultural Resource Management Survey (ARMS) data to build expenditure profiles for local food system participants. 9 Building on an initial case study by , the primary contribution of this article is to demonstrate with strong empirical evidence that local food system participants in NYS have different expenditure patterns than farmers who do not sell through local food markets. We show that farmers with local food sales have higher reliance on local labor and 'other variable expenses' as primary inputs than farms without local food sales. Additionally, when field crop, fruit, and vegetable producers with local food sales are viewed alone, they have lower expenditures on fertilizer and chemicals-the largest expenditure item for farms without local food sales. Based on our results, we find that researchers who utilize aggregate agricultural sector data to determine the economic impact of policies supporting local food system activity will likely underestimate overall impact. We recommend that impact assessments utilize revised production functions that more accurately reflect inter-industry linkages of the local food sector. We begin the rest of this paper by reviewing the literature on farm input expenditure patterns and its relationship to community economic development. This is followed by a description of the data collected in the two case studies and utilized from the ARMS. Finally, the empirical results are discussed, along with their implications and directions for future research."}, {"section_title": "Literature summary", "text": "The importance of the relationship between farm input expenditures and community economic development is well documented. For rural areas with strong agricultural and less diversified economies, there is evidence that the mix of inputs purchased and the location of the purchases has key community impacts (e.g., Aldrich and Kusmin 1997;Lambert et al. 2009;Shaffer et al. 2004). As the structure of farming in many rural economies continues to shift-in large part due to improvements in transport and telecommunication technologies-much of the literature focuses on the negative impacts resulting from these changes (Tacoli 1998;Krinke 2002;Stabler and Olfert 2009;McManus et al. 2012). McManus et al. (2012) refer to this phenomenon as the 'uncoupling' of farm enterprises and rural service centers. They conclude that as farms are freed from reliance on 'the local', small rural towns are likely to experience decline unless they have other attributes that will support local economies (e.g., amenity tourism). Related literature emphasizes the impact of farm attributes (especially scale and farming practices) on input purchase decisions, though none looks specifically at the relationship between market channel and input purchases. Goldschmidt's (1947) seminal study of two California communities generated the hypothesis that large-scale farming has detrimental community impacts while family-operated farms enhance community well-being-in part because family-operated (smaller-scale) farms more largely supported local businesses. Marousek (1979) surveyed small and large farmers in two towns in Idaho and found that small farms spend a higher percentage of their total expenditures locally (59 compared to 55 percent). Chism and Levins (1994) conducted a study of 30 crop and livestock farmers in Minnesota, finding that larger farms purchased a smaller percentage of their inputs from the local economy. Lawrence et al. (1997) reported from their survey of pork producers in Iowa that largescale producers spend less money on inputs in the nearest community than small-scale producers. Tacoli (1998) writes that the multiplier effects of 'prosperous' agriculture often bypasses local small towns; and Krinke (2002) cites a farmer in Green Isle, MN as stating that \"When dairy gets so big, they don't deal with you; they buy direct and bypass the local economy\" (9). Additional research suggests that farming practices also play an important role in determining the location of input purchases. Brodt et al. (2006) and Milestad et al. (2010) claim that 'sustainable' farming practices tend to involve more locally produced inputs, and to replace agrochemicals obtained in distant markets. However, Brodt et al. (2006) caution that preliminary evidence suggests that increased local input purchases only result where local economies are prepared to meet the needs of alternative agricultural producers. Lockeretz (1989) compared five previously published studies examining the economics of high input conventional cropping systems with low input alternatives to assess the community economic impact. He reports that though lower input systems contribute less money per acre to the local economy (as they purchase less inputs), a greater portion of the value of expenditure is spent locally. Community economic impacts resulting from the declining employment opportunities in agriculture on small rural towns is well understood (e.g., Heady and Sonka 1974;Marousek 1979). Significant technological advances and increases in productivity have resulted in farm employment and labor expenditures per dollar of gross output declining precipitously throughout the United States; accordingly, many rural communities are unable to support businesses that supply farm inputs and household items. As a result, many remaining farms and households can no longer purchase products in the nearest town, but travel to more densely populated locations (Aldrich and Kusmin 1997;Lambert et al. 2009;Shaffer et al. 2004). Despite these negative community impacts, it is not clear that higher levels of farm employment are desirable. Irwin et al. (2010) note that federal farm support policies \"have not typically sought to promote local job growth…and in fact may detract from rural growth given the need for productive farms to shed labor to remain competitive\" (532). There are a limited number of studies that look specifically at differential labor input requirements for participation in local food system market channels.  conducted a two-year study of growing and selling products for a farmers' market in rural Oklahoma. They calculated that 55 percent of the total variable production expenses were associated with hired labor. In their conclusion they note that though rural customers were willing to pay a premium price for farmers' market products, there were not enough customers to overcome production costs. They suggest that if family (unpaid) labor can be obtained, production costs can be reduced.  and  conducted research on market channel selection for local food system producers. Both studies demonstrate the high labor demands per unit of output associated with certain D2C sales outlets. They conclude that increased labor needs associated with some market channels offset price premiums, thus having a large impact on farm net income, and market channel selection. Similarly,  found that producers receive a greater share of retail prices in local food supply chains than mainstream supply chains-partially due to the fact that producers assume additional supply chain functions such as processing, distribution, and marketing. However, these supply chain functions are costly and King et al. found that producers often do not include the costs of their own (unpaid) labor in their production budgets."}, {"section_title": "Methods", "text": "While some data exist on the value of D2C and intermediated sales within local food systems (e.g., , there is widespread recognition that official tracking has not kept pace with the sector's growing importance . Most available data \"does not describe how local food systems operate or how their operations and economics vary from place to place\" (Hendrickson et al. 2013). To analyze the differential expenditure patterns of local food system producers, we use a case study approach, interviewing two sample groups of farmers during the summers of 2011 and 2012. We utilize USDA ARMS data for farms with local food sales to broaden our scope of analysis and assess the robustness of our case study results. Additionally, we use USDA ARMS data for farms who do not report local sales as well as default IMPLAN agricultural sector data to compare sales patterns for farms with local food sales to those without."}, {"section_title": "Case study data", "text": "The first case study data (henceforth the 'CD study') was collected through interviews during the summer of 2011 from a random sample of farms within the Capital District (CD) region of NYS. 10 In this case study, we endeavored to better understand the purchasing patterns of small and mid-scale farms with D2C sales. A team of Cornell Cooperative Extension educators identified farmers in each county that marketed at least a portion of their farm products through D2C market outlets. The team identified 752 farms in total, a number remarkably consistent with data from the 2007 Census of Agriculture, which reported that there were 797 farms in the region with D2C sales in 2007 (USDA ERS 2007). In total, 130 farmers were randomly selected for interviews based on the county-level distribution of all farms in the region (USDA 2007). A total of 97 interviews (75% response rate) contained complete information, 82 of which were small or mid-scale operations (under $500,000 in annual gross sales). The interview protocol was designed based on our knowledge of how farmers report expenditures in an income (or profit and loss) statement for their business. Farmers were asked to provide their 2010 annual farm expenditures by item category and the proportion of each expenditure purchased locally (i.e., purchased within the 11-county region), as well as outside of the region but within NYS, and outside of NYS. Based on the farm's commodity with the largest sales (numerous farms produced products in multiple categories), the distribution of farms by category was 15% fruit, 27% vegetables, 6% dairy, 23% meat and livestock, 12% greenhouse and nursery, and 17% other crops. Interviews for the second case study (henceforth the 'food hub study') were conducted during the summer of 2012 with farmers who supplied product to Regional Access (RA), a food hub located in Trumansburg, NY. 11 The purpose of this case study was to understand the economic impact of food hubs, particularly on participating farmer vendors. We chose RA as our case study food hub because of their commitment to working directly with farmers (they currently source product from 96 farmers, as well as 65 specialty processors), their length of time in operation (they were established in 1989), the diversity of their customer base (they sell product to over 600 customers, including individual households, restaurants, institutions, distributors, buying clubs, retailers, manufacturers, and bakeries), and size of their operation (they are a mid-scale operation with over $6 million in annual sales). We conducted 30 interviews with RA's farmer vendors out of a population of 86 located in NYS (35% response rate). Farmers were asked to provide their 2011 annual farm expenditures by item category and the proportion of each expenditure purchased locally (i.e., purchased within NYS). Unlike the CD study, the expenditure categories were designed to correspond to the sector categorization within the IMPLAN software. In addition, for the CD study we only included small and midscale local food system participants, while the food hub study utilized information 11 \"A regional food hub is a business or organization that actively manages the aggregation, distribution, and marketing of source-identified food products primarily from local and regional producers to strengthen their ability to satisfy wholesale, retail, and institutional demand\" (Barham et al. 2012, 4). from farms of all scales working with RA. In this study, 37% farms were classified as 'small' ($1,000-$249,999 in total gross sales), 43% farms were classified as 'large' ($250,000-$999,999 in total gross sales), and 20% were classified as 'very large' ($1 million or more in total gross sales). Farmers were also asked to identify their primary commodity category; accordingly the distribution of farms by primary category was 37% meat and livestock, 30% fruit and vegetable, and 33% value added products (including cheese, butter, yogurt, honey, maple syrup, wine and juice)."}, {"section_title": "ARMS data", "text": "The ARMS is the only nationally representative sample of farmers that estimates the costs of production. Starting in 2008, the ARMS added specific questions about sales to local food outlets. However, , the first researchers at the USDA ERS to publish local food data from ARMS, caution \"the design and structure of the questions create[s] obstacles\" (18). The ARMS utilizes a stratified sampling technique, which targets certain commodities (depending on the year), large farms, and farms in 15 core agricultural states (of which NYS is not one). Given that local food system participants are overwhelmingly small-and mid-scale farms (65% of local food farms in NYS report under $500,000 in gross annual sales), they have a small overall sample size in ARMS, and larger associated weights. We utilized custom-built USDA ERS software with a jackknife re-sampling process that employs additional weights from NASS for each sample to estimate the average expenditure components and their standard errors (Dubman 2000;USDA ERS 2012). Due to the small sample size of farms reporting local food sales in NYS, the data were aggregated over the available four years with local food questions (2008)(2009)(2010)(2011). Following Low and Vogel (2011), we excluded cut Christmas trees, short rotation woody crops, nursery, greenhouse and floriculture from our definition of 'local foods', as well as point farms (those with under $1,000 in total gross annual sales). 12 We included any farm that reported a non-zero number for D2C or intermediated sales as a 'local food' producer. In total, ARMS reports 64 unique respondents with local food sales in NYS over the four years, representing 5,536 farms (as a point of comparison, the 2007 Census of Agriculture reports 5,210 farms in NYS with D2C sales). Of the 64 respondents, 22% define their primary commodity as field crops, 27% as vegetables, fruit, and nuts, 43% as livestock, and 8% as dairy. Average farm sales for farms reporting local food sales is $45,431 (141 acres), compared to $125,874 (239 acres) for those without."}, {"section_title": "Nonlocal food system participant data", "text": "In order to analyze the differential expenditure patterns of producers in NYS with and without local food sales, we utilized ARMS data for farms that do not report local food sales, as well as default agricultural sector IMPLAN data. There are 429 farms that do not report local food sales in the ARMS for NYS from 2008-2011 (representing 27,575 farms). According to the respondents, 27% define their primary commodity as field crops, 4% as vegetable, fruit, and nuts, and 69% as livestock and dairy. The default IMPLAN data are based on 2011 data for NYS. We created an 'agricultural production sector' that includes the IMPLAN agricultural commodity sectors corresponding to the CD and food hub studies. Accordingly, our agricultural production sector in IMPLAN includes oilseed farming, grain farming, vegetable and melon farming, fruit farming, greenhouse, nursery and floriculture farming, all other crop farming, cattle ranching and farming, dairy cattle and milk production, poultry and egg production, and all other animal production. Though the default IMPLAN data includes both farms with and without local food sales, the farms without local food sales dominate the data due to their larger volume of total expenditure ."}, {"section_title": "Results", "text": "Utilizing the case study and ARMS data, expenditure profiles for local food system producers in NYS were calculated from each source. The results demonstrate some key points of convergence between the three local food producer data sets, as well as acute differences with NYS ARMS respondents without local food sales and the default IMPLAN data.\nWe divide our results into three sections. The first two examine how the food hub impacted the availability of local food, with the first section looking specifically at the impact on consumer access and the second looking at farm and nonfarm vendor access to markets. The third section examines farmers' perception of the impact that food hub sales had on farm viability."}, {"section_title": "Expenditure patterns", "text": "Due to the varying designs of the interview protocols and the way that IMPLAN divides its sectors, we can only compare certain aggregated expenditure items from the food hub study and the default IMPLAN data to the CD study and ARMS data. Table   1 compares total expenditures for the small-and mid-scale farms with D2C sales in the CD study with the ARMS data for NYS broken into four groups-those with local food sales and those without, and divided by primary commodity (all and field crop, vegetable, fruit and nut producers). 13 For all local food system participants, 'labor' and 'other variable expense' are the largest areas of expenditure. 14 The CD farms spend on average 22% of total expenditure on labor, and 16% on other variable expenses. ARMS data show local food participants spend 18% of total expenditure on labor and 16% on other variable expenses. Closer analysis of ARMS data divided by primary commodity reveals that field crop, vegetable, fruit and nut producers spend 29% of total expenditure on labor. As 71% of CD respondents report fruit, vegetable, greenhouse, nursery or other crop as their primary production category, comparison with the ARMS producers reporting field crop, vegetable, fruit and nut as their primary production category is perhaps a more accurate comparison than utilizing the entire ARMS local food sample (with 41% of farms reporting livestock or livestock-related as their primary commodity). 15 The data from the food hub study supports this finding; on average, food hub farms spend 26% of total expenditure on labor (see table 2). Unfortunately, given the design of the food hub study interview protocol and the composition of the IMPLAN sectors, we are unable to break out an equivalent 'other variable expense' item for the food hub study or default IMPLAN data. [ Tables 1 and 2 here] For NYS ARMS respondents without local food sales, livestock-related expenditure represents the highest portion of total expenditure (24%), followed by not ask about capital expenditure items in the case studies, or utilize non-variable expenditures available from the ARMS). 14 The ARMS defines 'other variable expense' as V32B (Hand tools, supplies, farm shop power equipment expense) + V36 (General business expense excluding insurance) -V35A (utilities). 15 When we create an expenditure profile for CD farms who report fruit, vegetable, or crop as their primary commodity, average expenditures are very similar. However, average percentage of total expenditure on labor increases to 24% and average expenditure on other variable expenses decreases to 15%. labor (14%) and other variable expense (10%). Though we cannot break out livestockrelated expenditure or other variable expense within the default IMPLAN data, we see similar average expenditure on labor (15%). ARMS respondents, both with and without local food sales, show much higher portions of total expenditure on livestockrelated expenses than the CD respondents (14% for ARMS respondents without local food sales, 24% for ARMS respondents with local food sales, compared to 4% in the CD study); CD study respondents report a larger share of total purchases of seeds and plants (10%) compared to 3% for ARMS respondents without local food sales and 4% for ARMS respondents with local food sales. However, these differences may reflect the survey samples-the CD respondents having the smallest representation of livestock producers (23%). ARMS field crop, vegetable, fruit and nut respondents without local food sales spend the largest proportion of expenditure on fertilizer and chemicals (21%). This stands in stark contrast to expenditures by our local food samples. ARMS field crop, vegetable, fruit and nut respondents with local food sales spend 10% of total expenditure on fertilizer and chemicals and CD farmers spend 8%. Unfortunately, we are unable to break out fertilizer and chemical expenses for the food hub study. Pairwise means difference tests were conducted to compare variance in expenditure proportions between the farms with local food sales and farm without local food sales in the ARMS data, where the null hypothesis is H0 : ß1 = ß2 (ß1 = no local food sales, ß2 = local food sales). Table 1 shows which of the categories are statistically different at significance levels of 1% and 5%. Though only three of the input expenditure items have statistically significant differences (custom work, other variable expense, and tax, land and property), this is particularly influenced by the small sample size where the jackknife estimator can be problematic (Dubman 2000)."}, {"section_title": "Location of input expenditure", "text": "In both the CD and food hub studies, surveyed farmers reported spending higher percentages of their total input expenditures 'locally' than is reported in the default IMPLAN data for the corresponding regions (11-county CD region and NYS, respectively). Table 2 shows that the RA food hub farms spent 82% of their total expenditures in NYS. By comparison, the default IMPLAN data, which includes all corresponding agricultural sectors, show 54% of expenditures taking place in NYS. The interview data from the CD study shows farms spending 64% of their total expenditures in the 11-county CD region, compared to 52% in the default IMPLAN data. 16 If the definition for 'local' expenditure is extended to include all of NYS, the CD study farms spent 82% of their total input expenditure locally. Thus results from both case studies are very similar in terms of location of expenditure by local food participants when 'local' is defined as NYS. The information on local expenditures is limited in the ARMS survey. The 2008-2011 ARMS surveys ask about the purchase location (miles traveled) of four input expenditure items: farm machinery and implements; fuel; fertilizer; and chemicals. 17 Table 3 reports the average miles traveled for each item, differentiated by whether or not the farm reports sales to local food outlets. There are no major differences in the distance location of purchases based on whether the farm reports local food sales or not. As ARMS does not ask about expenditure items of key importance to local food producers, the usefulness of the ARMS data in terms of expenditure location is limited."}, {"section_title": "Discussion and conclusion", "text": "The input expenditure pattern results from the two case studies, the ARMS, and default IMPLAN data elicit strong empirical evidence that local food system participants in NYS have different expenditure patterns than farmers who do not sell through local food markets. Across all data sets for local food system producers, we find that expenditures are greatest on labor and other variable expense. Consistent with , we expect that the greater reliance on labor and other variable expenses is likely due in part to the additional supply chain functions assumed by local food system participants. Though our case studies and ARMS data do not enable us to know exactly what is included in other variable expense, items like marketing and packaging materials are not accounted for in other categories. LeRoux et al. 2010and  research on marketing costs associated with D2C market channel requirements supports the fact that local food producers have substantially higher labor input requirements. Thus, as local food system participants are more likely to market and distribute their own items, the differences in the production budgets may be a reflection of these supply chain characteristics. Greater reliance on labor, in particular, for local food system participants may be a double-edged sword. On one hand, previous research shows that the additional labor needs may have important community economic impacts, for example supporting threshold-level farm business and household expenditure to support local businesses. On the other hand, there is some evidence to show that additional labor requirements may impede profitability (e.g., . Additionally, we can use the same NYS ARMS data set to look at key farm financial measures (table 4). On average, farms that did not report local food sales were more likely to have a positive net income (55.1%, compared to 39.8% for those with local food sales). This relationship holds if we exclude dairy and livestock operations; on average, 58.6% of field crop, vegetable, fruit, and nut farms without local sales reported positive net farm incomes, compared to 43.4% of those with local food sales. Likewise, farms with local food sales had a higher average operating expense ratio (92.3 for all farms, 81.8 for field crop, vegetable, fruit, and nut farms) compared to farms without local food sales (81.6 for all farms, 74.3 for field crop, vegetable, fruit, and nut farms). The median operating profit margin (100 * (net farm income + interest expense) / gross farm income, excluding the imputed cost of operator labor) was negative for farms with local food sales (-12.4 all farms, -16.6 field crop, vegetable, fruit, and nut, farms), but positive for farms without local food sales (11.0 all farms, 22.9 field crop, vegetable, fruit, and nut, farms). Though we cannot say for certain whether the local food system participants' additional labor expenditure is correlated with the financial measures, the results demonstrate the need for future research that examines potential tradeoffs between higher local and/or labor expenditures per unit of output and profitability. Our results also show that field crop, vegetable, fruit and nut farms without local food sales have greater reliance on fertilizer and chemicals as a share of total expenditure. In attempt to better understand this finding, we looked the proportion of farms with certified organic acreage by whether or not they participated in local food sales channels. According to 2008-2011 ARMS data for the combined New England and Mid-Atlantic regions, 2.8% of farms with local food sales report certified organic acreage versus only 0.5% of farms without local food sales. 18 This characteristic may, in part, be driving the differences in expenditures on fertilizers and chemicals between the two groups of farms. Furthermore, our results from the CD study show that 87% of total chemical and fertilizer purchases were made within the CD region, and that percentage increases to 91% if the region is expanded to include all of NYS. Thus our CD results do not support the conclusion that fertilizers and chemical purchases are inherently nonlocal (Brodt et al. 2006;Lockeretz 1989;Milestad et al. 2010). Our two case studies also provide evidence that in comparison to the default agriculture sector data available in IMPLAN, local food participants purchase more of their inputs locally than do farms without local sales. Though ARMS data does not support this finding, its evidence in this regard is limited by the scope of the questions."}, {"section_title": "Future research", "text": "This article highlights the differential input expenditure patterns for local food producers in NYS compared to ARMS respondents without local food sales and default IMPLAN data. Our results provide evidence that warrant additional data collection in other states and regions to see how local food system participants interact within a local economy, so that policies promoting local food system activity can be accurately evaluated. Our case studies show additional local expenditure by local food system participants, as well as higher reliance on labor and other variable expense. The extent to which the differential expenditure patterns, particularly a greater reliance on labor and assuming additional supply chain functions, impacts farm profitability is a key area for future research, and will have important implications for the direction of future policy. As the Michigan State University and Union of Concerned Scientists' convened meeting found, more research is needed to determine best practice methodologies in order to better understand the impact of local food system activity. Determining expenditure profiles for local food system participants is only one of the requisite steps to conducting economic impact analyses. Taking the next step to incorporate differential expenditure patterns into modeling efforts that assess the impact of policies support local food system initiatives remains a key area for future research. As we show local food producers spend a larger percentage of total expenditure in the local economy, this inherently has a direct economic impact, by increasing total local demand. However the multiplier impacts from inter-industry linkages remain unclear. Understanding how these differential expenditure profiles reverberate throughout the economy remains the key next step in understanding the economic impacts that result from policies supporting strengthened local food systems.    local foods and meeting consumer demand (Martinez et al. 2010, iv). Accessing markets that provide return on investment is difficult for small-and mid-sized farms as supply chains become more vertically-integrated and consolidated. Large-scale supermarket retail and wholesale operations demand large volumes, low prices, and consistent quantities and qualities that meet increasingly strict safety standards. The procurement systems in such markets are often vertically and horizontally integrated, global in scale, and aim to maximize efficiency ; . In order to facilitate market access for small-and mid-scale farms, public agencies and private foundations are increasingly financing and promoting 'food hub' development. Following the USDA's working definition, a food hub is a \"business or organization that actively manages the aggregation, distribution, and marketing of source-identified food products primarily from local and regional producers to strengthen their ability to satisfy wholesale, retail, and institutional demand\" (Barham et al. 2012, 4). Economic impact assessments model and measure the economic activity associated with the chain effects of linked purchases. An (exogenous) final demand driven change for food hub goods and services results in changed production levels of other industry sectors throughout the entire economy. Of key importance is the extent to which food hubs serve to increase overall demand for and consumption of locallygrown agricultural products, versus diverting some regional farm sales from existing local markets to another, as well as the percentage of the sales price retained by the farm through food hub sales compared to other market outlets. This is due to the fact that policymaker's primary interest in food hubs emanates from their potential to support economic development, which one must measure by estimating the total impacts, including who or what benefits and loses. In other words, it is not clear whether increases in final demand for food hub goods and services divert sales from other industry sectors (like wholesale trade), thus resulting in a 'beggar thy neighbor' phenomenon taking place , or serve to increase farm profitability. Thus, taking into account where businesses would have purchased products had the food hub not existed (the opportunity cost) is important. Attention to this type of impact assessment can help to better inform public and private programs that support food hub initiatives. Efforts to assess the impacts of local food system activities are often complicated by a lack of data necessary for complete evaluation. Frequently, these efforts suffer from insufficient data to identify the major inter-industry sales and purchase linkages of local food system participants. Data problems are exacerbated as data is not collected about a food hub industry sector per se, and thus food hub interindustry linkages must be identified within existing industry sectors in the economy. The primary objective of this paper is to promote the utilization of a bestpractice methodology to evaluate the economic contributions of food hubs to their local economies and the participating farms they support. This is accomplished by developing a data-driven empirical framework applicable to a variety of food hub structures. Included in this framework is a discussion of the data requirements and a recommended methodology for collecting such data. As the USDA distinguishes a food hub from other traditional food aggregators or distributors in part based on the fact that they purchase products \"primarily from local and regional producers,\" the differential expenditure patterns can be modeled to determine the relative effects on the regional economy, including the impact on local agricultural sectors. The framework developed is applied to a case study analysis of a food hub located in New York State. There are significant limitations to generalizing the results of an individual case study to other food hubs. However, in contexts where food hubs exhibit similar attributes to our case study (i.e., performs similar types of business functions, serves the same number of farms or physical market), one may be able to utilize the adjusted expenditure patterns in constructing a similar analysis. However, where food hubs are more dissimilar in terms of their activities and purchasing and sales patterns, following the complete data collection procedure proposed is advised. The secondary objective of this paper is to better understand the extent to which food hubs increase the overall demand for and consumption of local food products. We collect additional information on the nature of purchases of food hub output, and we analyze the extent to which these purchases represent increased demand for local goods and services, or if they instead represent substitutes of purchases from one local source for another (e.g., from a conventional wholesale distribution company to a food hub). The information collected from purchasers of food hub goods and services allows us to ascertain the direct value of food hub purchases, offsets in purchases from other sectors, and the potential in our case study for growing overall local food product demand. We begin with a brief description of economic impact analysis to frame the paper's objectives, along with a discussion of previous literature analyzing the impacts of local food system infrastructure. Next we provide an analytical framework for our analysis and a detailed empirical methodology, including two alternative modeling approaches. A discussion of the case study application follows, including the interpretation of and policy implications from the particular results and a set of recommendations for replicating the methodology in alternative settings. We conclude with priorities for future research.\nThere are many areas for future research that emerged from this project. We fully support the recommendations of O'Hara and  that \"collective understanding of the relationship between local foods and economic development can be enhanced through improving data collection, undertaking studies on larger geographic scales…and forming a learning community to review and critique studies\" (1). Our results provide strong evidence that economic impact assessments of food hubs will underestimate local impacts if they depend on IMPLAN default data, and thus will benefit from data collection from farm participants. The challenge is that this type of data collection is time consuming and expensive; as presented, the data needs for this type of research are significant. The USDA Agricultural Resource Management Survey (ARMS) data provide a valuable source of information on farm expenditure patterns, but the sample size for local food system participants (not to mention those selling to food hubs) is extremely small. In addition, there is no useful information on location of expenditures. This information would be extremely useful, and facilitate more regular evaluation of these types of initiatives. This study presents information based on one case study, and the broader application of its recommendations will clearly benefit from refinement via a learning community. Recently completed studies from , as well as Farm Credit Council and Farm Credit East (2013), will help to determine, for example, the extent to which RA's expenditure pattern, as well as the expenditure pattern of food hub farms, are similar to other food hubs and participating producers. For example, how do the economic impacts of food hubs change when a hub works only with fresh product producers (i.e., no value added products)? Further, our food hub farm survey was designed to correspond to IMPLAN sectors, rather than to farm profit and loss statements. There are merits and weaknesses to this approach, and as data of this sort continues to be collected, future research to determine more standardized data protocol is extremely importantparticularly to compare the results across studies. Finally, we recommend additional research that compares different models and structures for aggregating and moving locally-grown products into different types of market outlets. Conducting market channel assessment studies similar to those conducted by  and     We asked food hub farms how much they purchased from Regional Access as a percentage of total expenses. On average, food hub farms reported spending $6,398 on products from RA, including freight service, other farm products (i.e., products for re-sale at a farm stand), and warehousing/storage. In this table we show these expenditures mapped evenly between 'wholesale trade' and 'transportation and warehousing'.      Large-scale supermarket retail and wholesale operations demand large volumes, low prices, and consistent quantities and qualities that must meet increasingly strict safety standards. The procurement systems in such markets are often vertically and horizontally integrated, global in scale, and aim to maximize efficiency (e.g., . In order to facilitate market access for small-and mid-scale farms, and improve consumer access to locally-grown foods, public agencies and private foundations are increasingly financing and promoting 'food hub' development (e.g., NGFN 2013; USDA KYF 2011; Cuomo 2013). Following the USDA's working definition, a food hub is a \"business or organization that actively manages the aggregation, distribution, and marketing of source-identified food products primarily from local and regional producers to strengthen their ability to satisfy wholesale, retail, and institutional demand\" (Barham et al. 2012, 4). Despite the increase in public and private support for food hubs, there has been little work to evaluate their impact. Efforts to assess the impacts of local food system activities generally, and food hubs specifically, are often complicated by a lack of available data necessary for evaluation. The primary objective and contribution of this paper is to better understand the extent to which food hubs increase consumer access to locally-grown and processed products, enhance farm-entrée to markets, and support farm viability. Given the significant data needs to conduct this type of analysis, we use a case study approach, examining a food hub located in New York State (NYS). Accordingly, we conducted surveys with over 300 food hub customers, and in-depth interviews with 30 farms and 15 processors that sell food products to our case study food hub. The rest of this paper begins with a review of the literature related to assessment of food hub impacts on overall supply of local food and farm viability. Next, we present information about our methodology and case study food hub. We then conclude with our results, discussion, and recommendations for future research."}, {"section_title": "Local food economic impact assessments", "text": "Most local food economic impact assessments utilize social accounting matrix (SAM) models with data and software generated by the IMPLAN Group LLC (IMPLAN). 19 Among these assessments, there are a handful that measure the impacts of specific marketing channels, such as farmers' markets (e.g., Myles and Hood 2010;Sadler et al. 2013) or farm-toschool programs Tuck et al. 2010), as well as key pieces of infrastructure such as meat processing facilities (Swenson 2011). Throughout most of these studies, there are two main challenges that reflect the difficulty in meeting the significant data requirements to conduct rigorous economic impact assessments. The first is what O'Hara and Pirog (2013) refer to as an 'interpretation' challenge. Specifically, \"stipulating how the 'opportunity cost'…is defined\" (4). As they rightly point out, measuring opportunity cost is not straightforward, and requires information about the extent to which increased consumer purchases of locally-grown food offsets other types of purchases, changes market prices and/or supply chain characteristics, or impacts land use. There are only a handful of local food economic impact assessments that explicitly acknowledge the need to consider opportunity cost Tuck et al. 2010;. However, each of these studies makes assumptions about the sectors in which there are decreased purchases (or changes in land use) as a result of increases in local food consumption-in other words, none collects the data necessary to more fully understand the opportunity costs of increased local purchases. The second challenge is that almost all of these studies reflect the implicit assumption that local food system participants have the same patterns of expenditure as the aggregate agricultural sector data available in IMPLAN. By default, the entire economy is represented by 440 sectors within IMPLAN. Each IMPLAN sector is represented by a single, static production function. The production functions for each sector reflect average purchase and sales patterns across all firms in the sector, without the requisite information to be able to disaggregate them by any specific characteristic (i.e., scale of operation, or marketing channel) (Lazarus et al. 2002b;Liu and Warner 2009). 20 As IMPLAN sector data represents all inter-industry linkages, the expenditure and sales patterns are more reflective of those firms that contribute a higher proportion of total output in the sector (typically the larger firms) (Lazarus et al. 2002a). Given that local food system participants tend to be smaller in scale, and represent a small overall portion of agricultural sector transactions  In addition, one should consider whether the default IMPLAN production functions associated with the sectors the food hub purchases from adequately represent the production technologies (input combinations) of firms with whom the food hub interacts. If not, additional information will be required from firms representing these upstream sectors. This is perhaps most acute for the farm production sectors that supply food products to the food hub; i.e., are farms that sell to food hubs adequately represented using the default farm average data contained within IMPLAN? In order to assess this question, to see if there are substantial differences, we construct two alternative impact assessment models-one that incorporates additional data collected from farms selling to the food hub and one that does not. Expenditure categories from the food hub data must be mapped to appropriate industry, value added, and institutional sectors within IMPLAN. We start defining industries by utilizing the two-digit NAICS aggregation scheme provided within IMPLAN, but leave sectors of particular interest or importance to food hubs disaggregated. Importantly, in addition to the industries included in the 2-digit NAICS aggregation scheme, we create a separate aggregated 'food sold-farm' sector that only includes those sectors from which the food hub purchases food products. 22 Similarly, we separate from the 2-digit NAICS scheme processed food and beverage products that food hubs purchase from nonfarm manufacturers for resale. We then consolidate them into a new 'food sold-nonfarm' sector."}, {"section_title": "Defining farms that sell to food hubs", "text": "Understanding how farms that sell product to food hubs (henceforth 'food hub farms') interact with other sectors of the economy is important in improving the precision of an impact assessment. While the same can be said of any input supplying sector, since purchases from farms generally represent a relatively large share of total food hub expenses, and we are particularly interested in how food hub farms are impacted by food hubs given the role this may play in rural economic development, it is important to consider the inter-industry linkages for farm suppliers. Furthermore, for most of the businesses from which food hubs purchase inputs, it is both sufficient and consistent with standard practice to assume that the individual business' expenditure patterns reflect that of the entire industry sector. For example, a food hub is unlikely to purchase insurance from a specialty food hub insurance provider. As such, assuming that the food hub's insurance company has a similar production function to that of the region's 'insurance' sector within IMPLAN should be sufficient. By contrast there is growing evidence that farms participating in local food system outlets are oftentimes (but not exclusively) smaller in scale, and/or have different patterns of expenditures and labor requirements per unit of output than is reflected in IMPLAN's default agricultural sectors . Defining a separate food hub farm sector distinct from the total farm sector requires outlays data analogous to what is required from the food hub described above; i.e., the value and location of payments by the food hub farm to each industry sector and value added component."}, {"section_title": "Impact analysis and considering opportunity cost", "text": "Once our SAM model is customized to reflect food hub expenditure patterns according to the framework explained above, we can perform the impact analysis. We consider a scenario in which an exogenous shock increases the final demand for food hub products and services. Given the absence of a discrete food hub sector, the increase in final demand is fully allocated according to the food hub's expenditure pattern. While the initial increase in final demand is the value of the direct effect, only a portion of expenditures to satisfy that increase occur locally, and thus only the expenditures that occur with local firms are included in the impact analysis (as firstround indirect effects). In addition to a positive hypothetical shock assumed due to an increase in demand for food hub products, we need to consider resulting negative impacts due to decreased spending in other sectors. We hypothesize that food hub purchases are not strictly additional, new purchases from local suppliers (i.e., they are likely to offset to some extent local purchases from existing wholesale distributors). At the same time, however, it is likely that consumers increase their overall purchases of local products due to the more specialized food hub marketing efforts and the resulting availability of food hub products and services. Customers should have increased awareness of and access to a basket of goods that is differentiated from that available from other types of distributors (i.e., they have more options to purchase local goods). In order to test this hypothesis and more fully reflect the impact that increased demand for food hub products has on other sectors, we require the following information from food hub customers: (i) the percentage of food hub customers who would have purchased product from other sectors had the food hub outputs not been available; and (ii) of the customers who purchased less product from other sectors, the amount of reduced purchases that are a result of purchases from food hubs."}, {"section_title": "Case study application", "text": "Given the heterogeneous structure of food hub operations and the detailed data needs required for an impact assessment, we utilize a case study approach. This is a preliminary case study and is not indented to provide definitive evidence of the economic impact of food hubs, but rather to: 1) test the framework developed herein; and 2) provide an initial case study with which future research can be compared."}, {"section_title": "Case study food hub", "text": "Regional Access, LLC (RA) was chosen for our case study because they fit within the USDA's regional food hub definition as an aggregation and distribution business that is committed to supporting local farmers and preserve source-identification. In addition, RA's length of time in operation, the diversity of its customer base, and its operation size make it an interesting business to examine. RA was established in 1989. In 2011, it had over $6 million in sales, and employed 32 full-time jobs. Utilizing 9 vehicles and a 25,000 square foot warehouse, RA aggregates and delivers products primarily throughout NYS. RA has over 3,400 product listings, including beverages, breads, cereals, flour, meats, produce, prepared foods, grains, and fruits and vegetables. RA purchases products directly from 96 farm vendors, 65 specialty processors (nonfarm vendors), as well larger-scale foodservice distributors. The product is sold to over 600 customers, including: individual households, restaurants, institutions, other distributors, fraternities and sororities, buying clubs, retailers, manufacturers, and bakeries. RA also provides freight services to a range of businesses. New York State (NYS) was chosen as our local region of analysis. Though we recognize that the defining choice of local is a fraught one, RA works primarily with farms and customers across NYS; accordingly, the term 'local' will refer to NYS throughout the case study application. [ Figure 1 here] The extent to which these purchases are local is also important to consider. expenditures that were local. Though they do not provide an average for all expenditures, they found \"no expenditure averaged less than 50% spent in-state\" (pp.34) with 85% of food and/or product purchases taking place within the state of the food hub's operation."}, {"section_title": "Food hub farms", "text": "In-person interviews were conducted with 30 farms that sell product to RA (out of 86 located in NYS, 35% response rate). 23 The farms were located in every region of NYS except New York City and Long Island. 24 Of the farms from which RA purchased product, 50% classified their operation as 'small' ($1,000-$249,999 in gross sales), 20% percent as 'medium' ($250,000-$500,000 in gross sales), and 30% as 'large' (over $500,000 in gross sales). When asked to classify their farms' primary production 23 A copy of the interview protocol is available upon request. Deriving food hub farms' expenditure pattern Table 1 presents the average expenditure patterns of the food hub farms interviewed. The average total expenditure was $601,110 per farm, of which 80% was spent in the local economy ($483,741). The largest percentage of total expenditure is allocated to employee compensation (24%), followed by food sold-farm (17%), manufacturing (16%), and support activities for agriculture and forestry (9%). [ "}, {"section_title": "Model 2: Creating a food hub farm sector", "text": "For Model 2, the food hub farm data were utilized to apportion transactions in the food sold-farm sector into two distinct sectors: the 'food hub farm' sector and the 'other farm' sector (i.e., everything in food sold-farm other than the food hub farm sector). The first step in separating the food hub farm sector from the food sold-farm sector is to determine the total size of the RA food hub farm sector in NYS-effectively calculating the total amount of a new expenditure column and a new sales row in the SAM. The average estimates from the interview data were multiplied by the total number of RA farm vendors in NYS (86). Food hub farm expenditure categories were then allocated to their corresponding IMPLAN sector. Importantly, this procedure does not change the size of the overall economy, but reallocates total local expenditures into its two distinct sector components. As above, we account for margining in the retail and wholesale trade sectors. In addition to selling product to RA, food hub farmers also identified purchases of goods and services from RA (e.g., transportation, warehousing and wholesaling). We divided these expenditures evenly between 'wholesale trade' and 'transportation and warehousing'. Additionally, we allocated the difference between the average sales and expense per farm ($601,110 -$569,167 = $31,913)  considered intra-industry linkages and mapped to the food hub farm sector. [ Table 2 here] Once we complete mapping of the food hub farms expenditures and sales to the relevant IMPLAN sectors, we see that our case study farms have very different patterns of expenditure than the default food sold-farm sector within IMPLAN (see "}, {"section_title": "Impact analysis", "text": "To understand the impact of an increase in final demand for RA food hub products and the extent of differential economy-wide impacts from the two models, we consider a scenario in which an exogenous shock increases final demand for food hub products and services by $1,000,000. The only difference between the allocation of the shock in  32 In other words, for every dollar increase in final demand for food hub products, an additional $0.68 is generated in backward linked industries. While not shown, the total indirect multiplier effect is $0.46 and the total induced multiplier effect is $0.22 indicating that most of the multiplier effect is due to the business-to-business transactions. [ Table 4 here] Alternatively, consider the results for Model 1 when incorporating opportunity 31 Though not a top impacted industry sector in Model 1, we include support activities for agriculture and forestry for a point of comparison with Model 2. 32 This result is similar to sectors that conduct activities that are, at least in part, similar to a food hub. For example, comparable output multipliers for wholesale trade, truck transportation, and warehousing and storage are 1.60, 1.69, and 1.73, respectively, for NYS. costs. Here, the additional negative shock to the wholesale trade sector results in total indirect and induced effects of $502,011, implying an output multiplier of 1.50. While still a relatively strong multiplier effect, this represents a 12% decrease in the total multiplier effect (1 -1.50/1.68) from that when opportunity costs are ignored. When accounting for opportunity costs, the indirect effect portion of the multiplier is $0.32 and the induced effect portion is $0.18.  Table 5. Here, when opportunity costs are not considered, the combined indirect and induced effects are now $748,074. Considering the direct effect of $1M, this implies a gross output multiplier of 1.75, 4.0% higher than its counterpart in Model 1. The relative allocation to indirect effect (0.51) and induced effect (0.24) are similar to that for Model 1. [ Table 5 here] The consideration of opportunity costs remains important to the impact results. Now, the additional negative shock to the wholesale trade sector results in reduced indirect and induced effects to $566,443, implying a net output multiplier of 1.56, and reflecting an 11% decrease when accounting for opportunity cost. As with Model 1, the relative distribution of effects is similar across versions of Model 2. We restrict our attention to the model that explicitly accounts for opportunity costs. final demand, and is almost entirely from indirect effects. When we compare the farmlevel impacts to Model 1, we see a 7% increase. [ Figure 3 here] The ranking of the top five sector effects remain the same as that with Model 1. Notably, support activities for agriculture and forestry are considerably higher in Model 2 ($15,477) than Model 1 ($3,196), reflecting the higher industry linkages with this sector by food hub farms (Table 5)."}, {"section_title": "Food Hub customer survey results", "text": "Customers were asked a series of questions to better understand the extent to which their purchases from RA displaced other purchases and/or expanded their total procurement of locally-grown or processed products. The majority of customers (79%) reported that the existence of RA enabled their business to expand product offerings (either in terms of type of items offered or quantity) (n=166). Of those businesses who responded that RA enabled them to expand offerings, on average, they indicated that their total number of available products increased by 17%. We also asked businesses if they purchased fewer products from other distributors in 2011 due to their relationship with RA. Accordingly, 49% reported that they purchased less product, 46% report that their purchases from RA did not impact their purchases from other distributors, and 5% reported that they did not know (n=164). For those who responded that purchases from RA decreased their purchases from other distributors, they estimated their average amount of purchases from other distributors decreased by 23% (n=69). This was the information used above to estimate opportunity costs of expanded RA sales. Finally, business customers were asked a series of questions addressing the market potential for the food hub sector to scale up (i.e., if RA expanded its delivery routes/days, more products, etc. would the customers purchase more product). Though we know asking questions about the possibility for expanded sales from RA's customers presents a limited view of the potential to scale the food hub sector, the responses provide some clarity into the unmet demand for food hub outputs. Most business customers (67%) reported that they were interested in making additional purchases if RA expanded its product availability, delivery routes, or times. (n=167). Customers were asked to elaborate on the ways in which RA could expand that would cause them to purchase additional product: 73% of customers cited that expanded product offerings would result in their business purchasing more product; 40% of customers reported that improved logistics would support increased ordering. While some of customers mentioned they would create room for more local products if RA carried them, others explicitly said they would purchase more from RA at the expense of other distributors. This reiterates the importance of considering opportunity cost when considering the expandability/scalability of the food hub sector."}, {"section_title": "Discussion and conclusions", "text": "This paper provides a replicable empirical framework to conduct impact assessments for food hub organizations. By collecting detailed expenditure and sales information from food hubs, a SAM analysis-by-parts approach was used to estimate the multiplier effects of a change in final demand for food hub products. In addition, by collecting similar detailed-level information from food hub farms, the downward bias in using default agricultural production data can be lessened and result in more accurate assessments of a food hub's economic activity. Finally, by collecting detailed customer (downstream) information on purchasing patterns from food hubs, a better understanding of the important factors affecting the growth and scalability of food hubs as business enterprises can be attained, along with estimating the opportunity costs associated with increases in food hub product purchases (i.e., offsets via decreases in purchases in other sectors). Our particular application considered RA, a food hub operating in NYS. Importantly, we demonstrate that the farms selling to the food hub have different production functions than those that are constructed by default using an aggregate NYS farm sector in IMPLANi.e., the SAM coefficients found in the default IMPLAN agricultural sectors do not accurately reflect activities of the food hub farms in our study. From the comparative modeling exercise, we show that the estimated multiplier effects on the farm sector are 7% lower when using the default data and, overall, the total output multiplier is biased downward by 4%. If the farms in our case study are shown to be typical in other studies, the impact of food hubs utilizing default IMPLAN agricultural sector data will likely under-estimate the true magnitude of the local economic impact. This is an expected result, given that food hub farms spend more money in the local economy. Further, additional spending by the food hub farms per unit of output on employee compensation, other agricultural sectors, and support activities for agriculture and forestry, may be particularly important for rural economies. Of more fundamental importance to the rural economy is the ability of food hubs to strengthen the interlinked network of business to business and business to customer sales within the region is important. Results from the model incorporating food hub-farm specific data show a gross output multiplier of 1.75. However, using customer data, we estimate that for every $1 increase in final demand for food hub products, a $0.11 net offset in purchases from other sectors occur. After accounting for this offsetting negative shock, the output multiplier is 1.57, reducing the gross multiplier by 12%. Future impact assessments on food hubs should importantly consider opportunity costs. Customer survey results provide evidence that there are opportunities for expansion within the food hub sector, primarily through improved logistics (e.g., lower minimum order sizes and increased frequency of deliveries) and expanded product offerings. Based on our findings, policies resulting in increased final demand for food hub products will have a positive community economic impact (even when opportunity costs are considered). As discussed earlier in this paper, our results are based on one case study, and thus extending the results beyond the methodological recommendations may be problematic, particularly for food hubs whose business model is considerably different (e.g., include food processing). Though we caution against generalizing the results of our case study to other food hubs, in the context where a food hub operates in a region with similar scale producers growing similar commodities, and performs similar functions, analysts without the resources to collect local food hub and farm data are likely to find the case study data preferable to IMPLAN farm sector default data. Further, given that Fischer, et al. (2013) estimate a very similar level of COGS, and the Farm Credit Council (2013) estimate similar expenditures on employee compensation, this may give some indication that RA, in some capacities, exhibits an expenditure pattern similar to an average food hub. In any case, the data collection procedure described can be used by researchers interested in conducting similar studies of food hub operations."}, {"section_title": "Literature review", "text": "There is a bourgeoning literature on food hubs mostly focused on descriptive statistics (e.g., Bloom and Hinrichs 2011;Matteson et al. 2013;, or feasibility, best practices, and opportunities to support farm and community development (e.g., Hardesty et al., forthcoming;Hoshide 2007;Jarosz 2000;King and Venturini 2005;; Day-Farnsworth and Morales 2011). 33 The espoused benefits of food hubs include: 1) expanded farm access to market, particularly for mid-scale producers; 2) price premiums for farms through maintained source identification; 3) decreased market costs for farms through resource-sharing; and 4) better access to healthy fruits and vegetables for low income consumers (e.g., Cohen and Derryck 2011;Hoshide 2007;Painter 2007;Trauger 2009;. Though this literature is useful in many respects, as a whole it does not provide a critical perspective with enough information to discern the ability of food hubs to expand total local food availability or assess the impact of food hub development on farm profitability. Pointedly,     identify competition between local independent food retailers and alternative market outlets in their examination of the relationships and linkages between the conventional supply chain actors (wholesale and retailers) and local food producers in Southeast Michigan, but they do not look at the impacts of this competition on total availability of local food or farm viability. There are several studies that discuss farm-level impacts resulting from food hub development. , for example, conducted a study of the Intervale Food Hub in Vermont and found that there were many farm-level benefits, including price premiums over other wholesale channels. They write that \"many farmers reported an increase in their farm's food production, sales and income because of their Intervale Food Hub account\" but do not elaborate on this point (i.e., how many farms? by how much?). Additionally, the authors acknowledge that at the time the article was written, the hub had not reached a break-even point for operations and was supported by public and private grant subsidies.  suggest that there is evidence that their case study food hub, CNY Bounty, reduced marketing and distribution costs for farmers. In their recommendations for future research they provide data from one farm comparing hours spent marketing and distributing product by market channel, percent of total sales, and percent of final price received (138). They find that though only eight percent of the farm's total sales are through the food hub, the marketing and distribution costs are relatively lower compared to other channels, and percent of final price received by the farm relatively high. However, they only conducted this type of analysis for one farm, thus limiting the expandability of their results. Further, like the Intervale Food Hub, the authors acknowledge that CNY Bounty is grant-dependent. The report by  is the only one that provides strong evidence that localized supply chains can enhance farm viability. They find that farms receive a greater share of retail prices in local food supply chains than in mainstream chains, with \"net revenue per unit in local chains rang[ing] from about equal to more than seven times the price received in mainstream chains\" (v). However, their report does not delineate the extent to which the availability of localized supply chains expand overall farm sales (versus diverting sales from one market to another) or consumer access to locally-grown goods."}, {"section_title": "Methodology: case study", "text": "We decided to use a case study approach given the detailed data needs to conduct this type of assessment. We chose Regional Access, LLC (RA) because they fit within the USDA's regional food hub definition as an aggregation and distribution business that RA provided a list of the vendors from which they purchase product as well as the customers to which they sell product. We divided the vendor list into farm vendors and nonfarm vendors, and separated the list based on whether or not the vendor was located in NYS. We conducted in-person interviews with 30 farm vendors (out of 86 located in NYS) as well as with 15 nonfarm vendors (out of 55 located in NYS). 34 We conducted in-person interviews with the vendors due to the sensitive nature of some of the questions. It is very difficult to discern the precise role that a food hub plays in terms of enhanced farm viability or profitability, as each aspect of the supply chain may play an important role (i.e., without access to credit a farm is unlikely to be viable even if it has terrific market access). Given this challenge, we determined to understand the farmer's perspective of the role that the food hub played in supporting business expansion or viability. Vendors were therefore asked a series of questions related to: 1) the percentage of their total sales facilitated by RA; 2) the extent to which their relationship with RA expanded their overall business; and 3) other key pieces of infrastructure that facilitated farm business expansion or viability. The 30 farms interviewed were located in every region of NYS except New York City and Long Island. 35 Of the farms from which RA purchased product, 50% classified their operation as 'small' ($1,000-$249,999 in gross sales), 20% percent as 'medium' ($250,000-$500,000 in gross sales), and 30% as 'large' (over $500,000 in gross sales). When asked to classify their farms' primary production category, 37% percent identified meat and livestock, 30% fruit and vegetable, and 33% value- If a farm classified its primary production category as 'value added', it can be inferred that the farm grew/raised the raw commodity that it then processed. Examples of the value added products produced include cheese, butter, yogurt, honey, maple syrup, wine and juice. function as: animal slaughtering and processing (3); frozen food manufacturing (3); snack food manufacturing (2); perishable prepared food manufacturing (2); grain and oilseed milling (1); soap and lotion manufacturing (1); wine wholesaling (1); bakery (1); and, canning and pickling (1). On average, the nonfarm vendors sold over $4.2 million in 2011 (range from $4,300 to $42,000,000) and had 32 full-time equivalent employees (range from 0 to 320). RA's customers were surveyed using a combination of an online survey and follow up phone interviews. 37 At the time of the survey, RA customers included 110 households and 547 businesses. Of these totals, 57 households and 248 businesses responded to the survey (46% response rate). Customers were asked a series of questions related to: 1) expanded availability of local or source-identified products due to their relationship with RA; 2) reduction in purchases from other sources due to their relationship with RA; 3) potential for expanded local or source-identified purchases from RA (or another local food distribution company); 4) for business customers only, price premiums customers were willing to pay for local items; 5) unmet demand for local items. RA's business customers reported average annual gross sales of $5.7 million (N=101), with a range from $3,000 to $414 million. On average, they have been in business 13 years, with a range from new to more than 130 years in operation (N=151). The average number of full-time equivalent employees was 15 (N=145). 37 A copy of the online customer survey is available upon request. Business customers were also asked to identify the function their business most often performs; accordingly, 2% identified themselves as distributors, 3% as grocery/meal delivery service providers, 9% as processors/manufacturers, 11% as wholesalers, 25% as restaurants, 34% as retailers, and 17% as other (N=245)."}, {"section_title": "Impact on the availability of local food: consumer access", "text": "Both household and business consumers report increased availability of locally-grown and processed items due to the existence of RA. The majority of customers (62% households, 57% businesses) responded that if RA did not exist, they did not know or were unsure of a place to purchase similar products. Almost 80% of businesses reported that working with RA enabled their businesses to expand their product offerings, on average by 31%. Both household and business customers also reported additional demand for the types of items carried by RA. Though over one-half of household customers (51%) responded they were unsure or did not know if they would purchase additional items from RA if they expanded, 33% responded they would (thus only 16% responded they would not). Business customers on the other hand reported overwhelmingly (67%) that they were interested in making additional purchases if RA expanded its product availability, delivery routes, or times. Perhaps this is because their customers are willing to pay a premium for locally-grown and source-identified products. We asked businesses to rank on a scale from 1 to 5 the premium that they received from their customers for items marked 'locally-grown' (1 = significantly lower price for local, 3 = no price difference, 5 = significantly higher price for local). On average, customers responded that they received a slightly higher price from consumers for items labeled locally-grown (3.49), with 3% reporting significantly higher prices, 49% somewhat higher prices, 42% no price difference, 5% somewhat lower prices, and 1% significantly lower prices."}, {"section_title": "Impact on the availability of local food: farm and nonfarm vendor access to markets", "text": "Farm and nonfarm vendors reported enhanced market access due to their relationship with RA. Of the farm vendors, those that were mid-scale (farms with gross sales between $250,000 and $500,000) reported being most reliant on RA's services (see top panel of figure 1). All six of the mid-scale farmers interviewed reported that over 20% of their farm's total sales were facilitated by RAthree between 20 and 50% and 3 over 50%. Of the small farms we interviewed (those that earned under $250,000 in gross sales), six had less than 20% of their total gross sales facilitated by RA, three had 20-50%, and six had over 50%. Large farms (those with over $500,000 in gross annual sales) reported much less reliance on RA-facilitated sales than the farmers in the other farm size categories. Of the nine large farms interviewed, seven reported that under 20% of their sales were facilitated by RA. Of those respondents, three reported less than one percent of total sales facilitated by RA, the others reported two percent, three percent, and five percent. Interestingly, the remaining two large farms reported 51% and 93% of total sales facilitated by RA. [ Figure 1 here] We also looked at RA facilitated sales by primary farm commodity (livestock, fruit and vegetable, and value added), see middle panel of figure 1. Accordingly, we found that the distribution of RA facilitated sales by commodity was fairly evenly distributed. Between 27-56% of the producers from each primary commodity category had less than 20% of their sales facilitated by RA (fruit and vegetable producers 56%, value added 50%, livestock 27%), and 33-40% from each category had over 50% of their sales facilitated by RA. Livestock producers had a larger share of 20-50% of sales facilitated by RA, compared to fruit and vegetable or value added producers (36%, 11%, and 10%, respectively). Of the nonfarm vendors that we interviewed, the smaller businesses, particularly those that earned less than $500,000 in gross annual sales, were more reliant on RA (see bottom panel in figure 1). Of them, over one-half had at least 50% of their sales facilitated by RA. None of the nonfarm vendors with over $500,000 in gross annual sales had over 50% of their sales facilitated by RA, and only 20% had between 20-50% of their sales facilitated by RA. The rest of these large nonfarm vendors (80%) reported less than 20% of their sales were facilitated by RA."}, {"section_title": "Impact on farm viability", "text": "Of the farm vendors interviewed, 60% reported that their business relationship with RA enabled their business to expand. An additional 10% were unsure if RA had supported farm business expansion, and 30% reported that RA had not enabled farm business expansion. Of the farms that responded that RA had not enabled their business to expand, two reported that their business was not currently interested in expanding, and another five mentioned the importance of gaining access to the NYC market through RA. Only one farm vendor with over $1,000,000 in total annual gross sales responded affirmatively that RA had enabled their business to expand. These larger farms generally felt that the volume of sales facilitated by RA was too small to make a significant difference in their business' total sales or production, and that they had other market options. Access to the New York City market was the most frequently cited reason for expanded sales, though improved market access generally was consistently reported. Even farms that were unsure about RA's role in its expanded sales frequently cited RA's freight service and its pick-up and delivery flexibility as the primary reasons farmers chose RA over other freight services to NYC. Others used RA's 'good reputation' as a 'values-based distributor' to gain market access. This sentiment was particularly true among newer businesses that had not developed direct wholesale purchasing agreements with stores or restaurants. RA's warehouse capacity was also cited as facilitating business expansion for farms too small to have significant cooler or storage space. Many farms keep frozen meat or storage crops (i.e., potatoes, root vegetables) at RA's warehouse, retrieving them periodically to sell through winter markets, community supported agriculture (CSA), or wholesale outlets. As a result of access to additional storage, some farmers reported putting more acres into operation specifically for storage crops as a way to increase winter (year-round) income."}, {"section_title": "Discussion and directions for future research", "text": "The purpose of this paper is to better understand the extent to which food hubs increase consumer access to locally-grown and processed products, enhance farmentrée to markets, and support farm viability. Using RA as a case study, we conducted surveys with over 300 of their customers, and in-depth interviews with 30 farm vendors and 15 processors (nonfarm vendors). Our survey results demonstrate that RA increased household and business customer access to locally-grown and processed items. Further, the survey results reveal unmet demand for these products, and consumer willingness to pay a modest premium, on average. Mid-scale farmers and smaller nonfarm vendors appear to be particularly reliant on market access facilitated by RA. And the majority of farmers reported that their relationship with RA enhanced their farm's viability, particularly through increased access to the New York City market and warehousing. Despite these positive impacts, understanding a food hub's impact on farm profitability is very difficult. In this case study, we found that there are many ways that RA may support farm viability indirectly. And it is difficult to parse out the relative importance of aggregation, warehousing, distribution, and marketing infrastructure (provided by a food hub) compared to the host of other pieces of infrastructure that farms mentioned were also critical in facilitating sales. In other words, part of the challenge for future research is in considering the opportunity costwould the farm have found other ways to distribute the product, for a proportionate amount of time and money, had RA not existed? These results also reflect only one case study. It is possible, for example, that  (a) Farm vendors by size category (small = less than $250,000 in sales, medium = $250,000 to $500,000, and large = more than $500,000), (b) Farm vendors by commodity category (livestock, fruit and vegetable, and value added), and (c) Nonfarm vendors by size category (small = less than $50,000 in sales, medium = $50,000 to $500,000, and large = more than $500,000). system participants are due to market channel selection, or their relatively smaller scale. Examining whether smaller scale producers generally (and not just local food system participants) spend a larger percentage of inputs locally (per unit of output) has potentially important implications for policymakers, planners, and economic developers. For example, if an explanation for the negative operating profit margin of small-scale producers is their lack of access to affordable inputs, there are strategies to enhance the viability of these businesses (for example, establishing buying clubs for bulk purchasing by smaller producers). The first and second papers also highlight the different sectors in which local food system participants spend money. Research is needed to look at how these impacted sectors effect opportunities for rural economic development. For example, are communities with more local food system participants likely to have more vibrant farming communities and input supply infrastructure given that these farms spend a larger percentage of input expenditure on purchases from other farms (i.e., intraindustry linkages) as well as on support activities for agriculture and forestry sectors? More research is also needed as to the net farm-level impacts of policies supporting local food systems. Given the evidence that local food system participants take on additional supply chain functions such as processing, distribution, and marketing to get their products to market , there is more work to do in determining the net impacts resulting from these policies. Do local markets yield sufficient additional income (either through higher prices or larger volumes) to compensate for the likely higher per unit of output costs associated with these sales? The results from the third paper show that farmers overwhelmingly reported that the food hub did support expanded sales, but that it was one of a confluence of factors and pieces of critical marketing infrastructure. Parsing out the precise role that a food hub (or other local food system infrastructure) plays in supporting farm viability is difficult. Discerning the net impacts of participation in a market channel is even more challenging. Future research utilizing a market channel assessment approach (e.g., LeRoux et al 2010; Hardesty and Leff 2010) may help to more critically evaluate differential farm-level impacts of market channel selection, although gaining access to this type of data comes with its own challenges."}, {"section_title": "Rural-urban distribution of impacts", "text": "There is now strong evidence that regionalized strategies to strengthen local food systems involve rural or urban-adjacent farms selling into urban markets-i.e., strengthened rural-urban linkages-rather than rural farms intra-region sales to rural customers or urban farms intra-region sales to urban customers. For example, a USDA ERS (2012) report shows that farmers' markets are concentrated in metro areas. Lichter and Brown (2011) provide justification for this phenomena, stating that urban customers are willing to pay higher prices for goods. Trivette (2012) notes that urban settings allow for a greater number of vendor outlets, especially restaurants and grocery stores. Aleci (2004) and Aleci and Smith (2011) corroborate this, remarking that the historic central farmers' market in Lancaster, PA has difficulty retaining vendors who are increasingly drawn to better-trafficked farmers' markets in more affluent Philadelphia suburbs. And, Carroll and Jensen (2012), in their case study of Crescent City market vendors, remark that many would not be in business today or as successful if they had not participated in the urban farmers markets. Concomitantly, studies of rural farmers' markets, for example, corroborate these findings. Stephenson et al. (2008), for example, cite small market size as being positively associated with market failure. Malone and Whitacre (2012) found that the most rural counties were under-represented in direct-to-consumer sales generally. Schmit and Gomez (2011) and  report limited overall vendor sales in their studies of rural markets across Northern and Central New York, respectively. Even in studies of rural communities demonstrating consumer willingness to pay a premium for locally-grown produce, evidence shows that there are often not enough customers to generate enough revenue to overcome costs ). Yet there is little research to support the efficacy of strengthened rural-urban linkages as an effective strategy for rural development. From a global perspective, rural and urban areas are obviously economically linked as there are goods produced in rural areas that are consumed in urban markets. However, in a globalized world, the importance of localized rural-urban linkages becomes much more complex, and is understudied Holland et al. 2011). Holland et al. (2011), in their work on Oregon, claim that not much is known about the relationship between urban centers and their rural peripheries, and that a clearer understanding of these linkages could support more appropriate policies and strategies for investment. Likewise, Snoxell (2005) states that there is no body of research specifically focused on linkages between communities, nor is there a prevailing analytical framework for understanding these linkages. He calls for more research in identifying linkages between communities and assessing the impact of the linkages on communities. Similarly, Porter (2003) and Porter et al. (2004) call for future research to examine the relationship between rural-urban linkages and rural economic growth. The customized SAM approach taken in paper two enables one to assess the resulting economic impacts of a policy shock, but not the distribution of the shock in urban versus rural parts of NYS. One important next step for future research is to utilize a customized SAM methodology as presented in the second paper, and extend it to a multi-regional model. There are several studies that utilize this type of multiregional modeling approach to look at the distributional impacts of a shock, but none customize the model, or look at the impacts resulting from re-localized food system initiatives (Dabson et al. 2009;Holland et al. 2011;Hughes and Litz 1996;Lewin et al. 2013;Searls 2011;Waters et al. 1994)."}, {"section_title": "Evaluating opportunity cost", "text": "The second paper includes the first research to empirically-derive the opportunity cost associated with policies supporting local food system initiatives, indicating the importance of including these impacts in future assessments. The approach demonstrates empirically that businesses make choices about where to purchase inputs due to the availability of local food. Indeed almost half of the businesses purchasing product from food hubs reported decreasing expenditure from other sources, thus purchases from local sources cannot be considered all new final demand. However, the methodology used was limited in that the survey only included current food hub customers. More critical consideration about how opportunity cost can be assessed in this context is needed, as are opportunities for policymakers and practitioners to craft and support initiatives that minimize opportunity cost. In light of the fact that local food initiatives are concentrated in urban places, the distribution of opportunity cost also requires additional consideration. How are rural communities impacted by farmers participating in urban markets? Do farmers derive additional net income through participation in urban markets that is spent in rural communities? Where are the workers located that farmers hire to support urban market participation? The papers in this dissertation only brush the surface of evaluating the spatial distribution of the impacts resulting from local food system policies; the opportunities for future research in this area are truly exciting."}, {"section_title": "Evaluating the impact on rural wealth creation and prosperity", "text": "Assessing the economic impact of re-localized food systems using more traditional job creation, sales, and value added generation approaches (e.g., through IO/SAM models or standard CGE models) are important, but are primarily designed to consider shortterm impacts on a limited set of indicators of economic activity. The ability to understand longer-term and broader community impacts is needed for a more comprehensive evaluation, as well as to inform future programming. As discussed throughout this dissertation, SAM approaches model the dollar values of annual flows of goods and services. They are thereby incidentally related to incremental changes to stocks of various types of market-valued capitals, but they do not endogenously account for the contributions to productivity that investment in capital typically involves. Expenditures on education, information, intellectual assets, and social relationships, for example, are either excluded or treated as consumption or as intermediate goods rather than investments (Johnson et al. forthcoming). Indeed, there is growing interest within the literature in examining a broader mix of inputs and community assets as key components of long-term economic growth in rural communities and in expanding national accounting systems to include various nonmarket and intangible capitals, as well as their associated flows (Arrow et al. 2012;Johnson et al. forthcoming;Pender et al. 2012;Stauber 2007, World Bank 2011. The rural wealth creation framework conceptualizes wealth as a community's assets (net of liabilities) that contribute to the wellbeing of an individual or group (Pender and Ratner forthcoming). The rural wealth creation framework lends itself to assessing the spatial distribution of impact by distinguishing between people-based and place-based wealth. People-based wealth expands the typical personal financial wealth assets (i.e., owned real estate, personal property, stocks, bonds, automobiles) to include, for example, one's human capital assets (i.e., education, work experience, and health) and social capital assets (i.e., access to networks). Place-based wealth includes housing stocks, fixed commercial and industrial capital, public infrastructure, environmental quality, and social networks (Johnson et al. forthcoming). The bridge between place-based and people-based wealth is the spatial distribution of asset ownership; only local ownership is counted as part of a community's wealth (Pender 2011). Despite the fact that it is a promising framework for assessing opportunities for rural economic development, efforts to conceptualize a formal rural wealth creation approach are just starting to emerge (e.g., Pender et al. 2012;Pender and Ratner forthcoming;Johnson et al. forthcoming, World Bank 2011), and application and measurement of the framework has been limited (Pender et al. 2012). Jablonski (forthcoming) published the first peer-reviewed research contextualizing rural wealth creation within the construct of local food systems. Her research shows that impact assessment using a rural wealth creation framework can elicit very different results, and thus policy implications, than a more traditional economic impact assessment. However, given it is a new framework for evaluation, and metrics and data requirements remain unknown and largely unavailable from secondary sources (Pender et al. 2012), Jablonski (forthcoming) used a literature review for analysis and was limited in her ability to draw many conclusions. Gathering the data necessary for complete analysis remains a critical next step in fully actualizing a rural wealth creation framework to assess the impacts resulting from re-localized food system efforts."}, {"section_title": "Data Needs", "text": "Part of the reason that there are so many areas for future research is due to the data challenges highlighted throughout this dissertation. Official tracking of local and regional food systems has not kept pace with the sector's growing importance , \"agricultural data collection efforts usually focus on farm production issues, not…marketing practices\" (Matteson and Hunt 2012, 10). As a result, expensive and time consuming case study data collection efforts are necessary in order to accurately assess policy impacts. This dissertation offers strong evidence of the value of data tracked by market channel, and provides fodder to agency staff and policymakers to advocate for data collection by market channel at the national level. In its absence, researchers working at the local case study level should work together in developing questionnaires and methodologies such that \"collective understanding of the relationship between local foods and economic development can be enhanced through improving data collection, undertaking studies on larger geographic scales…and"}]