[{"section_title": "", "text": "During the first few years of life, children's brains are uniquely influenced by contextual factors, inputs, and stimulation (Knudsen, Heckman, Cameron, & Shonkoff, 2006). Early childhood interventions, therefore, have the potential to alter children's developmental trajectories and, in turn, improve their life outcomes. Indeed, a large and growing body of research has established the impact of high-quality preschool participation. Short-term benefits on early cognitive skills and school readiness have been well documented both in the United States (Yoshikawa et al., 2013) and internationally (Ruhm & Waldfogel, 2012). Studies have also demonstrated striking long-term effects of early childhood programs on health, educational attainment, and earnings (Campbell et al., 2012;Havnes & Mogstad, 2011;Schweinhart et al., 2005). A major puzzle in this literature, however, is the rapid \"fade out\" of the initial academic benefits of preschool as children progress through the primary grades of schooling (see Gibbs, Ludwig, & Miller, 2011;Claessens, Engel, & Curran, 2014 for reviews). Two recent experimental studies of large-scale early childhood programs, Head Start and Tennessee's Voluntary Pre-Kindergarten, have found benefits at kindergarten entry that rapidly diminish in the first years of elementary school (Lipsey, Farran, & Hofer, 2015;Puma et al., 2012). Researchers, policymakers, and practitioners have struggled to reconcile this observed fade out with the robust body of research, showing that the benefits of preschool can persist well into adulthood (Deming, 2009;Ludwig & Miller, 2007). There is strong interest in uncovering why convergence in outcomes between preschool participants and nonparticipants occurs (e.g., Do elementary school teachers focus attention on preschool nonparticipants thus helping them catch up? Are there spillovers between participants and nonparticipants? Yoshikawa et al., 2013). The empirical evidence on these questions is limited, and substantial gaps remain in our understanding of the conditions that support persistent preschool benefits. A limitation of the current evidence base is the lack of research examining this issue with recent, nationally representative data. This is an important gap because the early childhood landscape has changed considerably since 1998, when the first nationally representative study of kindergarten entrants took place. Since then, enrollment in state-funded preschool has nearly doubled, and the visibility of early childhood education has grown (Barnett et al., 2017). Our study aims to fill this gap. We leverage two cohorts of the Early Childhood Longitudinal Study-Kindergarten cohort (ECLS-K) to assess whether associations between preschool participation and child outcomes, both at school entry and through the third grade, have changed over time. These large, nationally representative data sets track kindergarten cohorts from 1998 and 2010 and include comparable information, allowing us to test whether the initial associations between preschool participation and child outcomes for children in the United States have diminished or grown. We also conduct the first investigation of changes in the persistence or fade out of these associations, tracking patterns through the spring of third grade across two different cohorts of kindergarten children. Finally, our analysis adds to a limited, but growing, literature exploring heterogeneity in preschool fade out. We examine whether patterns of persistence or fade out differ across three theoretically motivated dimensions: (a) child and family demographic characteristics; (b) characteristics of the preschool experience; and (c) characteristics of the subsequent schooling experience. Understanding whether and how the persistence of preschool effects varies is important for identifying strategies for early interventions with lasting impact. Although existing studies have explored a subset of our research questions using the first ECLS-K (Loeb, Bridges, Bassok, Fuller, & Rumberger, 2007;Magnuson, Ruhm, & Waldfogel, 2007a, 2007b, the current study synthesizes work in a single, more comprehensive study, replicating the earlier findings, considering additional hypotheses, and exploring whether patterns uncovered in the earlier wave are still present in a comparable but more current data set."}, {"section_title": "Background", "text": "Theories of human development from both developmental psychology and economics provide useful lenses for examining the relation between preschool and children's skill development (Duncan & Magnuson, 2013). Bioecological theory centers around \"proximal processes\" and suggests that optimal development occurs when children experience supportive proximal processes over an extended period (Bronfenbrenner & Morris, 2006). The theory suggests that it is important to understand interactions between characteristics of the child, the preschool, and the multiple other environments children experience (Blair & Raver, 2012). The cumulative model of human capital acquisition (Cunha & Heckman, 2007) asserts that skills produced in one stage of development amplify skill development in a later period. This notion of complementarity suggests that the benefits of preschool may be enhanced when followed up by high-quality, enriched environments. In contrast, developmental models allow for a compensatory role of subsequent environments in which the benefits of an enriched environment are most pronounced for children with the least prior exposure to such environments (Ramey & Ramey, 1998). While complementary and compensatory models yield different predictions about the persistence of preschool effects over time, both imply that preschool benefits will vary by characteristics of the child, preschool, and subsequent schooling."}, {"section_title": "Empirical Evidence on the Effects of Preschool", "text": "Two well-known and oft-cited experiments demonstrated that early childhood programs can yield large, lasting benefits into adulthood (Campbell et al., 2012;Schweinhart et al., 2005). It is unclear, however, to what extent the findings from these small, decades-old studies generalize to present-day contexts. Most study participants were Black children living in poverty. The preschool experiences were more intensive than most programs today and the comparison group generally stayed home or with relatives. In contrast, two thirds of 4-year-old children in the United States in 2014 were enrolled in an early childhood education program (Kena et al., 2016). Recent studies from the United States and abroad demonstrate that participation in scaled-up preschool programs yields sizable short-term benefits in both literacy and mathematics (Berlinski, Galiani, & Gertler, 2009;Esping-Andersen et al., 2012;Phillips et al., 2017;Wong, Cook, Barnett, & Jung, 2008). There is also empirical evidence that these benefits can persist into the primary grades, adolescence, and adulthood (Ladd, Muschkin, & Dodge, 2014;Ludwig & Miller, 2007;Reynolds, Temple, White, Ou, & Robertson, 2011). Indeed, studies of program expansion and availability in India, Norway, Sweden, and Uruguay all found impacts into adolescence (Berlinski, Galiani, & Manacorda, 2008;Black, Devereux, Løken, & Salvanes, 2014;Fredriksson, Hall, Johansson, & Johansson, 2010;Hazarika & Viren, 2010). Taken together, these studies demonstrate that across widely ranging contexts, large-scale programs can have important short-and long-term benefits. Importantly, the majority of existing evidence examined meanstested or targeted programs, which may yield different results than the average formal early childhood care program in the United States Despite compelling evidence of long-term benefits (Dumas & Lefranc, 2012;Havnes & Mogstad, 2011), a recurring finding is that the short-term benefits, particularly on academic skills, dissipate in elementary school (Camilli, Vargas, Ryan, & Barnett, 2010;Leak et al., 2012). In the United States, fade out has been documented in Head Start programs (Deming, 2009;Puma et al., 2012) and state prekindergarten (Lipsey, Hofer, Dong, Farran, & Bilbrey, 2013). Magnuson et al. (2007b) also documented fade out for a national sample using the ECLS-K 1998."}, {"section_title": "Heterogeneity in Preschool Effects", "text": "In trying to understand both the immediate effects of preschool participation and the causes of fade out, researchers have attempted to identify whether there are particular groups for whom the benefits of preschool are larger and more persistent or whether there are particular characteristics-either of the preschool or the subsequent schooling environments-that lead to greater, more long-lasting program impacts. Differences in preschool effects by child characteristics. While children benefit on average from early childhood program participation, there is evidence that the magnitude of impacts varies across groups. In line with predictions from compensatory models, researchers have found evidence of more pronounced benefits at school entry among low-income children , Hispanic children (Gormley, 2008), and Black children (Bassok, 2010). There is also heterogeneity in the medium-and longer-term impacts of preschool by socioeconomic status (SES) and race (Cascio & Schanzenbach, 2013;Garces, Thomas, & Currie, 2002). In keeping with this earlier work, we hypothesize that the association between preschool and subsequent outcomes will be larger among lowincome, Black, and Hispanic children. Differences in preschool effects by program characteristics. A large body of research has demonstrated variation in preschool effects depending on proximal measures of classroom quality such as teacher-child interactions (Araujo, Carneiro, Cruz-Aguayo, & Schady, 2016;Mashburn et al., 2008). Unfortunately, in the current study, measures of proximal preschool quality are unavailable. However, we do consider heterogeneity with respect to two program characteristics with empirically demonstrated links either to preschool quality or to child outcomes: public funding and length of day. Because observable measures of quality in public settings are systematically higher (Bassok, Fitzpatrick, Greenberg, & Loeb, 2016), one plausible hypothesis is that both the initial benefits and their persistence would be more pronounced in these more highly regulated settings. Attending a program a few hours per week may yield quite different effects than attending full time (Robin, Frede, & Barnett, 2006). Children who spent more hours in preschool had higher test scores at the start of kindergarten (Loeb et al., 2007), but longer preschool days were also associated with increases in behavioral problems (Vandell, Belsky, Burchinal, Steinberg, & Vandergrift, 2010). We, therefore, hypothesize positive associations between preschool length of day and academic outcomes but negative associations with behavioral measures. Magnuson et al. (2007b) found no evidence that the relation between preschool and academic outcomes differed depending on the length of the preschool day, but that study did not consider behavioral outcomes. Differences in preschool effects by subsequent schooling environments. Early childhood advocates have called for preschool to third-grade (PreK-3) initiatives, arguing that to sustain the benefits of a preschool experience, children must have access to high-quality learning experiences in early elementary school (Bogard & Takanishi, 2005). Recent work focuses on the importance of \"sustaining environments,\" or inputs and features of early schooling classroom experiences, as critical for the preservation of preschool effects (Bailey, Duncan, Odgers, & Yu, 2017;Phillips et al., 2017). There is conflicting evidence, however, on whether subsequent experiences play a complementary or compensatory role. New research on Head Start indicates that the benefits of the early childhood program were more pronounced when followed by access to elementary schools with higher levels of funding (Johnson & Jackson, 2017). Relatedly, Reynolds, Ou, and Topitzes (2004) found that high-quality elementary schools mediated the longterm benefits of preschools. In contrast, Magnuson et al. (2007b) showed that the preschool test-score advantage was more persistent for children who subsequently attended classrooms with larger class sizes and lower levels of reading instruction. The specific school characteristics used in the existing literature are a subset of the early elementary school characteristics that have been shown to matter for learning during the primary grades. For instance, a number of studies have demonstrated that children benefit from full-rather than half-day kindergarten (Gibbs, 2014;Votruba-Drzal, Li-Grining, & Maldonado-Carreño, 2008). Recent studies also demonstrate that children learn more in kindergarten classrooms that spend more time on advanced rather than basic math and literacy content (Claessens et al., 2014;Engel, Claessens, & Finch, 2013), and that children benefit from kindergarten teachers' support of the transition into school (Schulting, Malone, & Dodge, 2005). Given the compelling evidence that early schooling experiences (e.g., kindergarten class size) can have meaningful later-life implications, it is reasonable to investigate whether the association between preschool and children's early elementary outcomes relates to subsequent kindergarten and primary grades experiences (Chetty et al., 2011). Despite the mixed empirical evidence to date, we hypothesize that schooling characteristics (e.g., full-day programs, smaller class sizes, and more challenging curricula) play a compensatory role, thus catching up children with less enriched prior experiences and environments."}, {"section_title": "The Current Study", "text": "This study examines three primary research questions using data from two waves of the National Center for Education Statistics' (NCES) ECLS: 1. Do children who attended preschool in the year before kindergarten outperform children who did not participate in formal care with respect to academic or behavioral outcomes, both at school entry and through first and third grades? 2. Do patterns differ across demographic groups as defined by race and ethnicity and SES? 3. Do patterns differ by characteristics of the preschool or subsequent school? Although each of these questions has been tackled, to varying extents, with the earlier cohort of ECLS data, our analyses use both cohorts, and we discuss similarities, differences, and potential implications for both developmental science and policy. Examining how these relationships changed over time is of particular interest given that the 12 years between the two ECLS-K cohorts considered were characterized by a heightened understanding of the importance of early childhood, as well as substantial expansion of public preschool access, heightened focus on preschool quality, and marked changes in kindergarten learning environments (Bassok, Finch, Lee, Reardon, & Waldfogel, 2016;Bassok, Latham, & Rorem, 2016). A strength of the current analysis is the ability to track the associations between preschool and child outcomes through third grade, a focal year for policymakers and practitioners under accountability systems that typically introduce standardized testing in that year. In addition, we provide new evidence on the extent to which patterns differ based on child, preschool, and subsequent schooling characteristics."}, {"section_title": "Method", "text": "This study leveraged data from two nationally representative samples of children entering kindergarten in the fall of 1998 and 2010, respectively. The ECLS-K 1998 tracked children through eighth grade, and data collection for the more recent cohort is ongoing. In this study, we leverage data from the fall of kindergarten, as well as the spring of the kindergarten, first-grade, and third-grade years. The content and data collection procedures for the new cohort were modeled after the original ECLS-K and, as a result, these data sets provide a unique opportunity to compare the experiences of children in the United States over time."}, {"section_title": "Participants", "text": "The initial ECLS-1998 and ECLS-2010 samples consisted of approximately 21,400 and 18,150 children, respectively, rounded to the nearest 10 in keeping with NCES guidelines. To facilitate comparison, both across waves of data collection and across cohorts, we restricted our sample to firsttime kindergarteners with assessment data in the fall of kindergarten, spring of kindergarten, spring first grade, and spring third grade. Auxiliary analyses that include all children with a given test score, even if they do not have data at all time points, yield similar results. For comparability, we also limited our analysis to children who passed an English language screener. Children were administered an English language screener in both cohorts, but in 1998, children who failed the screener were not assessed in literacy at all, whereas in 2010, children who failed the screener but spoke Spanish were given a Spanish version of the assessment. Limiting the sample to children who passed the English assessment was necessary to ensure comparability across cohorts and to ensure that differences in patterns across academic literacy and math were not driven by differences in the groups who took each assessment. Relative to the analytic sample, children excluded from our sample were more likely to come from low-income families and to be Hispanic. Thus, our sample restrictions have implications for the external validity of our study, a point we address in several ways and revisit in the discussion. For instance, because all Spanish-speaking children, irrespective of their performance on the language screener, were assessed in math, we run supplementary models with math score outcomes for this broader group of Hispanic children. All analyses are estimated using weights developed as part of the ECLS-K studies to account for nonrandom selection and attrition. Specifically, we chose weights that accounted for missingness in direct child assessment data and child characteristics, such as age, race and ethnicity, and sex. Where possible, we also chose weights that accounted for missing parent-reported data at baseline. The specific weights we used in 1998 and 2010, respectively, were fall kindergarten-BYCW0 & W1_2P0; spring kindergarten-BYCW0 & W1_2P0; spring first-C124CW0 & W4C4P_20; spring third-C1_5FC0 & W7C7P_20. We conducted multiple imputation using chained equations to avoid the bias that may arise when analyzing complete-case data. Our imputation model, following Von Hippel (2007), accounted for all covariates included in our analysis (i.e., demographics, preschool participation, and variables listed in Appendix S1, Table A). Dependent variables were included in the imputation, but we did not use imputed values for dependent variables. We generated 20 imputed data sets. Since the sample of children who had valid literacy and math assessments in each cohort is substantially larger than the sample who had valid behavioral assessments, we constructed separate \"academic\" and \"behavioral\" samples. Our academic samples consisted of 10,400 and 8,370 children in the 1998 and 2010 cohorts, respectively. The behavioral samples consisted of 7,850 and 6,890 children. Analyses on a fixed sample of children with both academic and behavioral outcomes yielded substantively similar results."}, {"section_title": "Measures Preschool Experience", "text": "During the fall kindergarten data collection, parents were asked whether their child attended a \"day-care center, nursery school, preschool, or prekindergarten program\" in the year before kindergarten and how many hours per week they attended. We categorized students as having attended \"preschool\" if they attended any of these programs for 5 or more hours per week. Children who attended fewer than 5 hr were excluded due to limited exposure, though including them did not substantively change our results. Consistent with earlier studies leveraging the ECLS data (e.g., Loeb et al., 2007), we defined \"preschool\" to include a broad set of classroom-based early childhood education experiences, excluding Head Start. There are substantial differences in how questions about Head Start participation were asked across cohorts. In 1998, parents were asked questions about their child's enrollment in Head Start, separately from the set of questions about other forms of preschool participation. In contrast, in 2010, there was no separate survey component about Head Start participation. Instead, parents were only asked whether any of the time their children spent in a preschool setting was spent in Head Start. To address this discrepancy, we constructed comparable variables in both cohorts that indicated whether a child attended any Head Start in the year before kindergarten. Children who attended any Head Start in the prior year were excluded from our \"preschool\" group. We did include a Head Start indicator in all of our analyses. Our excluded group included all children who did not attend preschool or Head Start. This group was made up of children who received nonparental care that occurred in a home (\"nonparental, home-based care\"), such as family child-care homes, babysitters, and relative care, and it also included children who received exclusive parental care (\"only parent care\"). This specification allowed us to identify the association between preschool participation and child outcomes between children who went to any formal preschool arrangement excluding Head Start and those who had no formal care experience at all. We also ran specification checks in which our comparison group was restricted to children exclusively in parental care. Public and private preschool. Our broad definition of preschool participation may mask important differences across types of preschool. For instance, publicly funded programs generally face higher quality regulations, offer warmer and more educated teachers, and are associated with larger learning gains (Bassok, Fitzpatrick, et al., 2016). Unfortunately, accurately identifying preschool types from parent-reported data is notoriously difficult, and due to changes in survey items across the two ECLS cohorts, it is also impossible to disaggregate the preschool group in exactly the same way over time. Despite these limitations, we disaggregated our broad \"preschool\" category into two mutually exclusive types: \"public\" and \"private\" preschool. In 1998, we defined public preschool to include any preschool that was either free or located in a public school. In 2010, public preschool was defined as any preschool that parents identified as \"public prekindergarten\" or that was located in a public school. All preschool programs not classified as public were categorized as private. Although this disaggregation is imperfect, our rates of public preschool participation (shown in Table 1) are comparable to, though lower than, those reported in the National Household Education Surveys and the National Institute for Early Education Research State of Preschool yearbooks over similar time periods, and all three sources indicate a substantial increase in publicly funded preschool over the study period. Part-time and full-time preschool. We also constructed a measure of preschool intensity, disaggregating our preschool measure into \"part time\" and \"full time\" based on the number of hours per week that children attended. Following Magnuson et al. (2007b), we defined full-time preschool as 20 or more hours per week and part-time preschool as between 5 and 20 hr per week. Children who attended multiple preschools were classified based on total hours per week across arrangements. We explored the robustness of our findings to different definitions of part time and full time, including using thresholds of 25 and 30 hr per week. Results were strikingly similar regardless of the definition."}, {"section_title": "Outcomes", "text": "Academic outcomes were drawn from direct assessments of student literacy and math skills, conducted in the fall and spring of kindergarten, and in the spring of first and third grades. Fall assessments were conducted between August and mid-December of the kindergarten year. Spring Note. Preschool and Head Start are mutually exclusive; students who attended more than one type of care are classified as Head Start students. Part-time care is defined as < 20 hr per week. These descriptive statistics refer to the \"academic\" sample described in text. Sample sizes rounded to nearest 10 as per National Center for Education Statistics requirements. SES = socioeconomic status. assessments were conducted between March and June. The language and literacy (\"literacy\") assessment was designed to measure basic skills such as letter recognition and print familiarity along with vocabulary and listening comprehension. The math assessment measured conceptual knowledge, procedural knowledge, and problem-solving ability. To minimize the burden of the assessments, children first took a routing test and were then given an easy, medium, or hard test based on their score. Scores were equated using item response theory (IRT). The reliabilities for these IRT-based assessments were quite high in both 1998 and 2010 (between .93 and .95 for literacy and between .92 and .94 for math). Literacy and math outcomes were standardized to have mean 0 and standard deviation (SD) 1, within the \"academic\" sample described earlier and separately for each cohort. In keeping with the existing ECLS-K literature, we drew our behavioral outcomes from teacher reports (Loeb et al., 2007;Magnuson et al., 2007a). We considered externalizing behavior and self-control, two measures adapted from the Social Skills Rating Scale (Gresham & Elliott, 1990), both of which have high reliability (ranging from .79-.90 in 1998 to .79-.88 in 2010). The externalizing behavior scale asked how often children argued, fought, got angry, acted impulsively, or disturbed classroom activities. On this scale, higher scores represent more negative behavior. The self-control scale measured whether children respected others' property rights, controlled their temper, accepted peer ideas, and responded appropriately to peer pressure. Higher scores represent more positive behavior. Behavioral outcomes were standardized to have mean 0 and SD 1, within the \"behavioral\" sample described earlier and separately by cohort. Additional details regarding the psychometric properties of all measures are reported in Rock and Pollack (2002) for the 1998 cohort and Tourangeau et al. (2013) for the 2010 cohort."}, {"section_title": "Subsequent School Characteristics as Moderators", "text": "We explored interactions between preschool participation and five characteristics of children's subsequent school environments to determine whether these factors moderated fade out. First, we considered whether a child's kindergarten classroom was full day. Following the existing literature, we defined a \"full-day\" kindergarten classroom to be 5 or more hours per day (Gibbs, 2014;Votruba-Drzal et al., 2008). Next, we considered the transition practices that were used by each child's kindergarten teacher, which we employed as a proxy for purposeful alignment between the preschool and kindergarten experience. Kindergarten teachers were asked whether they used each of the following six transition practices: sending information about kindergarten home to parents of preschoolers, visits to the kindergarten classroom for both preschoolers and their parents, shortened school days at the beginning of the kindergarten year, teacher visits to children's homes at the beginning of the kindergarten year, and parent orientation prior to the school year. We consider the total number of transition practices employed by each teacher (0-6). Next, we construct two measures of children's exposure to advanced kindergarten classroom content, one each for literacy and math. In the spring of kindergarten, teachers were asked how often they taught a wide variety of literacy and math skills and also had the option to indicate that a particular skill was not taught until a later grade. We defined \"advanced\" content as skills that at least 25% of teachers in 1998 indicated were not taught until a later grade. The following six literacy skills met this criterion: composing and writing complete sentences; composing and writing stories with an understandable beginning, middle, and end; conventional spelling; reading multi-syllable words; alphabetizing; and reading aloud fluently. The following seven math skills also met this criterion: counting beyond 100, writing all numbers between 1 and 100, place value, reading three digit numbers, fractions, estimating probability, and writing math equations to solve word problems. Our measures of exposure to advanced literacy and math content are defined as the proportion of these advanced skills that were taught at least weekly in children's classrooms. For example, if a child's teacher taught two of six advanced literacy skills at least weekly, that child's value for exposure to advanced literacy content would be 2/6 or .33. Finally, we constructed three measures to indicate the subsequent class sizes that children experienced. We defined a small class as 20 or fewer students (e.g., Blatchford, Moriarty, Edmonds, & Martin, 2002) and constructed three indicators to measure a child's exposure to small class sizes in the primary grades. The first is an indicator for whether a child attended a kindergarten class with 20 or fewer students. The second is an indicator for both the kindergarten and first-grade classes having 20 or fewer students, and the third is an indicator for the kindergarten, first-grade, and third-grade classes all having 20 or fewer students."}, {"section_title": "Control Variables", "text": "We included a rich set of covariates contained in both ECLS-K data sets to account for nonrandom sorting into preschool. We controlled for children's age (at kindergarten entry and at assessment), sex, race and ethnicity, SES, parental education (both mother's and father's), maternal age, family composition, and whether English is the primary language spoken at home. We also controlled for region of the country and urbanicity. Appendix S1, Table A provides a complete list of these controls."}, {"section_title": "Analytic Approach", "text": "Following previous literature (e.g., Loeb et al., 2007;Magnuson et al., 2007b), we used ordinary least squares (OLS) to estimate the association between preschool participation and child outcomes. For each outcome, we estimated three sets of regressions, one that treated preschool as a single construct, one that separated preschool into private and public, and one that separated preschool into part and full time. These equations took the forms: where Y is the outcome of interest for individual child i, PRESCHOOL is an indicator that takes on a value of one if the child's care experience in the year before kindergarten meets the definition of preschool and zero otherwise, and X is a vector of covariates. X includes an indicator for whether the child attended Head Start in the year prior to kindergarten, such that the omitted category is children who did not attend any formal care in the year before kindergarten. In Models 2 and 3, in which we disaggregate PRESCHOOL into its component parts, the key coefficients of interest (b 1 and b 2 ) measure the association between a particular type of preschool experience (e.g., public or full-day) relative to the omitted category. We also report whether there are statistically significant differences between these two coefficients. To account for the nested structure of the data and the possibility of correlated errors across individuals, all models include heteroskedasticity-robust standard errors clustered at the kindergarten classroom level. We estimated Models (1-3) four times for each outcome variable, once each for fall kindergarten, spring kindergarten, spring first grade, and spring third grade. As a robustness check, we also re-estimated all of our models using a propensity score matching approach. Results (available on request) were consistent with the OLS estimates. To explore heterogeneity with respect to child characteristics, we reran all analyses by demographic subgroups, restricting the sample to students who are Black, Hispanic, or low SES. Finally, to explore whether the association between preschool participation and child outcomes differed for children depending on their subsequent schooling experiences, we estimated a series of models in which we allowed for an interaction between preschool and one potential moderator. We specified these interacted models as follows: Mod was a measure of child i's subsequent experiences in school. PRESCHOOL 9 Mod was the interaction term of preschool and subsequent experience, and X was a vector of covariates. In Equation (4), b 3 is the coefficient of interest, capturing the composite relation of preschool participation and subsequent kindergarten experiences. We refer to our findings as the associations between preschool participation and child outcomes. To the extent that selection into the initial preschool experience was confounded by unobservable characteristics over and above those included in our vector of covariates, our coefficients may be biased estimates of the impact of preschool. That said our analytic approach and reliance on the richness of the ECLS data sets to address selection bias are consistent with previous studies employing the 1998 data to explore preschool effects."}, {"section_title": "Results", "text": "The Early Childhood Landscape, 1998 and 2010 Table 1 shows the proportion of children that attended preschool, both overall and disaggregated by type (private and public) and length of day (part and full time). Participation in preschool and in Head Start was strikingly stable over the period examined. In both cohorts, just fewer than 70% of first-time kindergarteners were enrolled in either preschool or Head Start in the year prior to kindergarten entry. The lack of overall increase is notable given heightened public investment in preschool. Indeed, our results show that over the study period public preschool participation nearly doubled, from 11% to 19%, while private preschool participation dropped by 9 percentage points. Participation in full-time preschool rose by 3 percentage points. The remaining columns in Table 1 disaggregate patterns by demographic subgroups. In both periods, Black, Hispanic, and low-income children were less likely to attend (non-Head Start) preschool than the average sampled child. In 2010, for example, 56% of the sample attended preschool compared with 41% of Hispanic children, 37% of Black children, and 28% of children in the bottom SES quintile. The percentage of Black children enrolled either in preschool or Head Start dropped from 77 to 68, and there was also a 4 percentage point decrease among low-SES children. Relative to 1998 then, Black and low-SES children in 2010 were more likely to use home-based care or to be cared for only by their parents. Table 1 also provides descriptive statistics about the subsequent schooling experiences of each cohort. Full-day kindergarten participation increased over this timeframe, from 55% in 1998 to 80% in 2010. This increase was particularly pronounced among Hispanic children, whose participation in full-day kindergarten rose by 35 percentage points. There was also a sizable increase in exposure to advanced literacy content. The proportion of advanced literacy skills that children were exposed to weekly increased from 36% to 64%. There was a smaller but still notable increase in exposure to advanced math content. Overall, the likelihood of being in a small classroom (< 20 students) remained similar over time; however, the data suggest a dip in the likelihood low-income and Hispanic children attended a small class."}, {"section_title": "Preschool Participation and Children's Academic and Behavioral Outcomes", "text": "To explore the relations between preschool participation and academic and behavioral outcomes, we estimated the models described in Equations (1-3) for literacy and math in 1998 and 2010. The regression results for academic outcomes are presented in Table 2, and Table 3 shows results from analogous models predicting behavioral outcomes."}, {"section_title": "Academic Outcomes", "text": "In keeping with earlier studies using the ECLS-K, we find that in 1998, there are positive associations between preschool participation and children's literacy and math outcomes at school entry (Loeb et al., 2007;Magnuson et al., 2007a). This pattern holds in the 2010 data, and the magnitude of these initial associations is comparable across waves. We also observe that the initial association between preschool participation and literacy diminishes rapidly as children proceed through the first years of elementary school. These findings replicate those already reported for the 1998 cohort (Magnuson et al., 2007b). A key goal of the current study was to examine if those earlier patterns still hold in the more recent data. We find that the patterns are strikingly similar. For example, in 2010, the association between preschool participation and literacy outcomes fell from .15 SD to .09 SD between the beginning and end of kindergarten, and by third grade, the association was only .04 (and statistically indistinguishable from zero). The analogous coefficients in 1998 were .16 SD, .09 SD, and .05 SD. Our results indicate that the associations between preschool and both literacy and math outcomes, at both school entry and beyond, are extremely similar across cohorts. Next, we disaggregate the data by preschool type. In 2010, both private and public preschool participation is positively and significantly associated with academic skills at kindergarten entry. Coefficients for private preschools are always larger than those for public preschools, though the differences in coefficients are not always statistically distinguishable. The associations between private preschool and literacy and math outcomes are still evident through the spring of third grade (.08 SD). In contrast, the association between public preschool and child outcomes is no longer evident by the end of kindergarten. In 1998, the differences between private and public preschools were more pronounced. At kindergarten entry, the private preschool coefficient for literacy was statistically significant and four times larger than the insignificant public preschool coefficient (.20 and .05, respectively). By the end of third grade, children who had attended private preschool programs still outperformed similar children in informal care settings (.10 SD in literacy, .12 SD in math). In contrast, for public preschool, the comparable coefficients were negative and, in the case of literacy, statistically significant (À.12 SD in literacy, À.05 SD in math). In models that disaggregate preschool by length of day, the full and part-time coefficients were not statistically different from each other. That said, the point estimates for part-time care were generally larger and statistically significant through third grade. In contrast, in both waves, the association between full-time preschool and literacy outcomes was indistinguishable from zero, and the same pattern holds for math in 2010. Recall that in all models, coefficients are interpreted relative to an omitted group which includes all children who experienced no formal preschool in the year prior to kindergarten. This category includes children who were either in home-based settings or were with their parents and experienced no regular out-of-home care. In specification checks (available upon request), we reran the same models but added an indicator for whether children attended home-based care. In these analyses, we compare outcomes for preschool attendees just to children who were in parental care. The patterns from these models are strikingly similar to those presented in Table 2, suggesting our results are not driven by our decision to include both groups in our control group."}, {"section_title": "Behavioral Outcomes", "text": "Preschool participants in both cohorts exhibited more externalizing behaviors and lower levels of self-control than peers who did not experience any formal care (Table 3). These patterns were evident in both cohorts and in nearly every wave. For instance, for the 2010 cohort, in the spring of third grade, preschool participants were rated as having higher levels of externalizing behavior (.12) and lower levels of self-control (À.12). Patterns do not systematically differ between private and public preschools (although the larger negative coefficient on \"public preschool\" in the model predicting third-grade self-control in 2010 is one exception). Patterns do differ by length of day. Part-time preschool participation is largely uncorrelated with behavioral measures. In contrast, among full-time participants, coefficients are moderate in size and are evident in every wave through spring of third grade.\nTurning to the subgroup analyses for behavioral outcomes (Table 6 for 2010, Table 7 for 1998), we find suggestive evidence that the negative associations between preschool and both externalizing and self-control are less pronounced for Black children in the more recent cohort. Among Black children in 2010, preschool participation is not significantly associated with either behavioral outcome, at any wave. In the 1998 cohort, the associations between preschool participation and child outcomes were much more pronounced and significant at every wave. Similarly, the moderate positive association between preschool and externalizing behavior observed for low-income children in 1998 was not observed in 2010."}, {"section_title": "Racial and SES Differences in the Associations Between Preschool and Child Outcomes", "text": "Tables 4-7 show results from analyses examining whether either the initial association between preschool participation and child outcomes, or its persistence, differed by SES or race and ethnicity. The standard errors in these analyses are larger due to reduced sample size, and in some cases, the cell sizes for these subgroup analyses may be small."}, {"section_title": "Academic Achievement", "text": "Across both cohorts, the relation between preschool participation and academic outcomes was particularly pronounced for Black children. In 2010, Black preschool participants scored about .23 SD higher in literacy and .28 SD higher in math at school entry (Table 4). They maintained a preschool advantage in both subjects through spring of first grade (third-grade estimates are comparable but no longer statistically significant). Among the low-income sample, our results indicate that the preschool advantage, evident at kindergarten entry in both literacy and math, dissipated rapidly (and was no longer statistically different from zero) by the spring of kindergarten. A similar pattern holds among the Hispanic sample. In 1998, the association between preschool and academic outcomes is initially positive, but by the spring of first grade, it is no longer evident. In 2010, the associations between preschool participation and academic outcomes are not significant, even at kindergarten entry. As discussed earlier, for comparability, our Hispanic subsample excludes children who did not pass an English language screener at kindergarten entry. However, all Hispanic children-irrespective of their performance on the language screenertook a math assessment. Appendix S1, Table B indicates that the associations between preschool participation and academic outcomes are somewhat larger in this broader group. Still, the coefficients are modest in size, and in the 2010 cohort, they are no longer statistically significant by the spring of kindergarten."}, {"section_title": "Subsequent Schooling Environments as Potential Moderators", "text": "Our analyses did not uncover any evidence that the five characteristics of children's subsequent schooling (i.e., length of day, class size, transition    practices, and exposure to advanced content in literacy or in math) moderated the relation between preschool participation and child outcomes for either cohort, at any wave. Some moderators (e.g., full-day kindergarten and exposure to advanced math content) were associated with child outcomes, but we observed no systematic interactions between preschool and these moderators. Results showing these interacted models for spring kindergarten outcomes in 2010 and 1998 are available in Appendix S1, Tables C and D."}, {"section_title": "Discussion", "text": "This study is the first to employ two large and very similar data sets to compare whether the associations between preschool participation, broadly defined, and child outcomes have changed over time. Recent meta-analytic work has shown that the initial effects of preschool participation were more pronounced in preschool programs that began before 1980 relative to more recent programs (Duncan & Magnuson, 2013). The current study assesses whether the trend toward smaller associations between preschool participation and child outcomes has continued in a more recent period, and because the two data sets utilized are so similar, we can rule out differences in measures or designs as drivers of any observed changes over time. We also examined whether associations persist through the end of third grade. While fade out of early childhood program effects has been documented recently in studies of the Tennessee Voluntary Pre-K program and of Head Start (Lipsey et al., 2013;Puma et al., 2012), as well as in previous work leveraging the ECLS-K 1998 (Magnuson et al., 2007b), this is the first study to use similar data sets to assess whether patterns of fade out have changed over time. Finally, the study makes a contribution by exploring heterogeneity in the associations between preschool participation and child outcomes, focusing on three theoretically motivated dimensions: (a) demographic characteristics; (b) preschool characteristics; and (c) subsequent schooling environments. By doing so, the study aims to empirically test hypotheses derived from bioecological theory, which imply that the association between preschool and learning depends on characteristics of the child, the preschool, and the multiple environments children experience. Although existing studies have already explored some of our research questions within the first ECLS data (e.g., Claessens et al., 2014;Loeb et al., 2007;Magnuson et al., 2007b), the current study synthesizes that work in a single more comprehensive study, replicating the earlier findings, considering additional hypotheses, and exploring whether patterns uncovered in the earlier wave differ in a comparable but more current data set."}, {"section_title": "Preschool Participation and Subsequent Child Outcomes", "text": "The two kindergarten cohorts we considered straddled a period characterized by significant increases in public interest and investment in early childhood (Barnett et al., 2017). Given the heightened investment during this period, we hypothesized stronger associations between preschool and child outcomes in the more recent cohort. This is not what we found. As Figure 1 and Table 2 highlight, the patterns of association between preschool participation and academic outcomes in 2010 were strikingly similar to those observed in the 1998 cohort (which were documented previously in Magnuson et al., 2007b). In both cohorts, there were positive short-term associations between preschool participation and academic skills, with effect sizes ranging from .13 to .16 SD across subjects and cohorts. In both cohorts, these positive associations also became meaningfully smaller in magnitude as children progressed in school. Nevertheless, associations between preschool and math outcomes remained positive and statistically significant through the spring of third grade, and in literacy, coefficients were statistically significant through the end of first grade. The associations between preschool participation and two teacher-reported measures of behavior (i.e., externalizing and self-control) were also largely consistent across waves. These findings echo earlier work that documents a negative association between preschool participation and children's behavior (Loeb et al., 2007;Magnuson et al., 2007a). The results indicate that in the 12-year period examined, the association between preschool and children's outcomes neither narrowed, as it did over recent decades (Duncan & Magnuson, 2013), nor broadened, as might have been hoped given increased investment. That the associations are not larger in the second cohort does not necessarily imply that investments failed to yield benefits. The current study documents gaps in outcomes between children who did and did not experience preschool. Changes in these gaps over time could reflect changes in the average preschool experience as well as changes in the experiences of children who did not attend preschool. Indeed, a number of recent studies have highlighted the importance of understanding the counterfactual experience when investigating the impact of preschool programs (Zhai, Brooks-Gunn, & Waldfogel, 2014). Bassok, Finch, et al. (2016) show that over the same period tracked in the current study, children's exposure to learning experiences at home increased substantially (e.g., reading with their parents or playing computer games focused on literacy and math). There may not be changes over time in the relative advantage of preschool if both preschool participants and nonparticipants are having more supportive experiences than they once did. More research is needed to better understand how the experiences of children in informal care arrangements have changed over time."}, {"section_title": "Heterogeneity in the Association Between Preschool and Child Outcomes", "text": "In addition to describing overall associations between preschool participation and child outcomes, we also explored whether these patterns differed across three dimensions: (a) demographic characteristics, (b) preschool type, and (c) subsequent kindergarten experiences."}, {"section_title": "Demographic Characteristics", "text": "Consistent with earlier work, we find the associations between preschool participation and child outcomes-both at school entry and subsequentlyare particularly pronounced for Black children (Bassok, 2010). Unlike in the full sample, for which the preschool coefficients dissipated rapidly, among Black children the associations between preschool participation and child outcomes remain relatively stable in magnitude as children proceed through school. Our findings also provide suggestive evidence that among Black children the negative associations between preschool and children's behavior have diminished over time. In 1998, teachers rated Black children who had attended preschool as having much higher levels of externalizing behavior and lower levels of self-control, compared with similar Black children who did not experience formal care (.47 SD and À.34 SD, respectively). In 2010, the magnitude of the coefficients was notably smaller at school entry (.18 SD and À.05 SD). These relatively encouraging results for the Black subsample aligned with a compensatory hypothesis that the associations between preschool and child outcomes would be larger for Black, Hispanic, and low-income children than their white or higherincome peers (Bassok, 2010;Duncan & Magnuson, 2013;Ramey & Ramey, 1998). However, in the lowincome and Hispanic subgroups, there is little support for this hypothesis. For instance, among the low-SES group, the association between preschool participation and academic outcomes is fleeting and no longer evident at the end of the kindergarten year. For the Hispanic subgroup, in the more recent cohort, there is no association between preschool participation and literacy and math scores at any time point. One partial explanation for this surprising pattern is that our Hispanic subsample excludes children who failed an English screener test, an important limitation, given that existing research suggests English language learners may experience pronounced benefits from preschool participation (Gormley, 2008). There are larger coefficients in models that leverage the full Hispanic sample, including children who failed the screener (see Appendix S1, Table B). However, even in this group, the association between preschool and math outcomes is small and only significant at school entry. These results are at odds with the existing literature which has frequently shown larger benefits for low-income and Hispanic children (Gibbs, 2014;Yoshikawa et al., 2013)."}, {"section_title": "Preschool Type", "text": "In both waves, the positive associations between preschool and academic outcomes are larger for children in private rather than public preschools. In fact, in 1998, we only observe this positive association among children enrolled in private settings. That said, the magnitude of this private-public differential has narrowed across cohorts. In 2010, there is no longer a statistically difference between private and public settings, in this association during the kindergarten year. There are generally no differences between private and public settings with respect to the behavioral outcomes. The opposite pattern emerged when we turned to the length of the preschool day. There was no relationship between length of day and academic outcomes in either wave. However, the negative and persistent association between preschool participation and behavioral outcomes was driven, almost entirely, by children in full-day programs. In 2010, we observed no negative associations with preschool participation and either externalizing behaviors or self-control, among children enrolled in part-time programs. For children in full-day programs, we observe a meaningful, negative association for both outcomes, at all four time points considered. More pronounced negative associations between full-day preschool and behavioral outcomes are also evident when we disaggregate the analysis to focus on low-SES, Black and Hispanic children, though the differences between full and half-day programs are not always statistically significant in this context, due in part to smaller sample sizes. We do observe that in 2010, the negative association between preschool participation and behavioral outcomes among Hispanic children persists through third grade and is primarily driven by children enrolled in full-day programs. Overall, our results regarding preschool type countered our hypotheses that public preschools, which face more stringent regulations, and full-time programs, which offer more dosage, would relate to more favorable outcomes for children. One possibility is that the heterogeneity we observe is driven by differential selection (with higher-income children overrepresented in private and part-time programs). Although we control for a rich set of covariates, unobserved differences across these groups are likely, a point we return to next. On the other hand, it may be that, on average, the part-time and private programs in this data are of higher quality than the full-time or public programs. More research is needed to disentangle whether the heterogeneity observed is driven by differences in program quality or differences in selection."}, {"section_title": "Kindergarten Characteristics", "text": "A common hypothesis in discussions of preschool fade out is that characteristics of subsequent schooling might play a role in sustaining preschool effects (Bailey et al., 2017;Reynolds, Magnuson, & Ou, 2010). The characteristics we considered in the current analysis, including full-day kindergarten, transition practices, exposure to advanced content, and class size, did not moderate the persistence of an association between preschool and child outcomes either in the spring of kindergarten or in subsequent waves. The lack of moderation does not suggest that these features of elementary schools are unimportant. In fact, research has documented positive associations between each of these measures and child outcomes. The results only indicate that these measures do not serve to moderate the fade out or persistence of preschool associations in the ECLS-K data. One explanation is that schooling environments do play a central role in sustaining preschool effects, but that our measures fail to capture the factors that are most central. There is a need for research that more precisely measures the quality of early schooling experiences and identifies factors that play either compensatory or complementary roles with early childhood program participation. Studies currently in the field through the Institute of Education Sciences' recently funded Research Network on Early Childhood Education could play a critical role in expanding our understanding of this issue. Further, in recent years, early elementary school experiences have changed substantially, with a greater emphasis on academic instruction, and an explicit focus on PreK-3 alignment (Bassok, Latham, et al., 2016). Research is needed to assess the impact of these changes on children's development and to examine whether they have influenced the persistence of preschool effects. While more research is necessary to understand the role of elementary schools in sustaining the benefits of preschool, it is important to consider that focusing on subsequent environments may not be the only or best way to foster larger and longerlasting preschool benefits. It is notable that the lack of support for \"sustaining environments\" in the current study echoes other recent work that also showed no evidence that subsequent schooling environments moderate preschool fade out (Claessens et al., 2014;Jenkins et al., 2016). As pointed out by Bailey et al. (2017) in addition to work on sustaining environments, more work is needed to understand how preschool programs can best influence the type of skills that are less rote and more critical for individuals' longer-term success. Understanding the role of curricula, teacher-child interactions, and preschool professional development may help in those efforts."}, {"section_title": "Study Limitations", "text": "Although the ECLS provide a unique opportunity to assess changes in the association between preschool and child outcomes over time, the data have several limitations. First, although our overall \"preschool\" measure and nearly all other variables were constructed in exactly the same way across the 1998 and 2010 data sets, a few notable differences in survey items across cohorts limited our analysis. In particular, differences across surveys in measuring Head Start participation make it impossible to accurately examine whether the association between Head Start and child outcomes have changed over time. Relatedly, differences in survey outcomes limited our ability to construct consistent definitions of \"public\" and \"private\" preschool across cohorts. We, therefore, interpret any comparisons of these variables across cohorts with caution. Second, the ECLS-K provides a blunt measure of children's preschool experiences. Parents may not accurately distinguish among care types when reporting early childhood experiences. Moreover, a large body of research from the United States and internationally has demonstrated the importance of preschool quality and, in particular, the importance of engaged and caring child-teacher interactions, in predicting preschool benefits (Araujo et al., 2016;Mashburn et al., 2008). Unfortunately, the ECLS-K has no measures of quality. Although collecting these data can be costly, funders of future largescale studies of early childhood education should consider such an investment, as these data may meaningfully enhance our understanding of the conditions under which preschool benefits persist. The same is true for measuring subsequent schooling environments. Rich measures of children's experiences in elementary school may provide insights about the role of sustaining environments. Finally, the current study describes associations between preschool participation and child outcomes, but does not isolate the causal relationship between preschool and child outcomes. In supplementary analyses, we replicate our analyses using propensity score matching and find very similar patterns. We included a wide set of covariates in our analysis to account for factors that may be correlated with preschool participation, preschool type, preschool length of day, or subsequent schooling environments. Still, if the extensive set of controls included in our models does not account fully for endogeneity-a possibility that is quite plausiblewe cannot frame the relations documented in this study as causal. Nevertheless, the national scope of the data makes it an important resource for understanding the associations between preschool and child outcomes. The 1998 cohort of the ECLS data has been leveraged extensively in the literature to document the association between preschool participation and child outcomes (Loeb et al., 2007;Magnuson et al., 2007aMagnuson et al., , 2007b. Our study replicates findings from those studies and builds upon them."}, {"section_title": "Conclusion", "text": "Using two, large U.S. data sets, this study shows that preschool participation is associated with higher literacy and math scores at school entry. The magnitude of these associations shrinks quickly as children progress through school. Still, preschool attendees outperform their peers in literacy through the spring of first grade and in math through the spring of third grade (which is the latest year for which data are available). On the other hand, preschool is associated with higher levels of externalizing behavior and lower levels of self-control through third grade. Overall, patterns in 2010 mirrored those in 1998. While it is discouraging that the associations have not become more pronounced over a period characterized by heightened investments in early childhood education, the fact they have not become less pronounced either, as predicted by some recent research, is heartening (Duncan & Magnuson, 2013). The larger and more persistent preschool associations for Black children are encouraging as well. Still, this study leaves many questions unanswered about the conditions under which scaled-up preschool can yield meaningful and sustained benefits. It provides a nationally representative look at the average preschool experience. The early childhood landscape is varied, and recognizing that diversity, state policy efforts are increasingly oriented toward improvement. Studying the effects of these efforts to improve will prove important for the field."}]