[{"section_title": "This Issue Brief uses data from the National Education", "text": "Longitudinal Study of 1988 (NELS:88) to compare the economic outcomes of high school completers at three different points in time with the outcomes of individuals who did not complete high school. Differences by sex are also examined, following the results of Clery, Lee, and Knapp (1998), who found differences by sex in economic outcomes among different credential holders. The present analysis updates this research and investigates whether differences in economic outcomes exist by high school completion status, the timing of high school completion, and the type of credential earned. 3"}, {"section_title": "Definitions of Terms", "text": "For convenience of reference, this Issue Brief refers to spring 1988 eighth-grade students who completed high school as completers. Of these completers, those who completed high school by August 1992 are called 4-year completers; those who completed high school between August 1992 and August 1994 are called 4-to 6-year completers; and those who completed high school after August 1994 but by August 2000 are called later completers. Spring 1988 eighth-graders who had not completed their high school education by the end of the survey period (August 2000), meaning they had not received a diploma or alternative credential within 8 years of their expected graduation, are considered noncompleters. Six economic outcomes are examined in this Issue Brief: (1) labor force participation rate, and (2) unemployment rate; and of those who were employed, (3) percentage employed full time, (4) average hours worked per week, (5) average wage rate, and (6) average annual salary. The labor force participation rate is the percentage of all individuals in the sample who were either employed or unemployed but looking for work. The unemployment rate is the percentage of unemployed persons looking for work of those who were "}, {"section_title": "Issue", "text": ""}, {"section_title": "Brief", "text": "either employed or unemployed but looking for work. The percentage employed full time is the percentage of those employed who were working at least 35 hours a week. The average wage rate is calculated for both full-and part-time workers as dollars earned per hour worked, and the average annual earnings is defined as the amount earned by individuals from their current or most recent job. 4 All economic outcome data in this Issue Brief are for the year 2000, except for average annual earnings data, which are for 1999. 5"}, {"section_title": "Economic Outcomes of Completers and Noncompleters by Timing of Completion", "text": "A number of differences in economic outcomes were identified based on the timing of individuals' high school completion. For example, as shown in table 1, 4-to 6-year completers were more likely to be unemployed than 4-year completers (10 vs. 5 percent, respectively). Also, 4-year completers had, on average, higher wage rates and annual earnings than 4-to 6-year completers ($15 vs. $12 and $29,700 vs. $24,000, respectively). Furthermore, when compared to later completers, 4-to 6-year completers were less likely to be unemployed in 2000 (18 vs. 10 percent, respectively). No differences were observed between later completers and noncompleters in economic outcomes, with the exception of labor force participation. Noncompleters had lower rates of labor force participation than later completers (86 vs. 93 percent)."}, {"section_title": "Economic Outcomes of Completers by Type of Credential Earned", "text": "Among students who earned different types of high school credentials, there were few differences in economic outcomes by spring 2000. 6 The only measurable difference was that later completers with high school diplomas were more likely, on average, to participate in the labor force than their counterparts who earned an alternative credential (98 vs. 91 percent)."}, {"section_title": "Economic Outcomes of Completers and Noncompleters by Sex", "text": "Irrespective of high school completion status, the timing of completion, or the type of credential earned, differences in economic outcomes of completers and noncompleters were found by sex, which is largely consistent with the findings of Clery, Lee, and Knapp (1998). For the six economic outcomes analyzed, males generally had more favorable economic outcomes than females. The economic advantages for males, as shown in figure 1 for average annual earnings, largely held true even after controlling for the timing of students' high school completion and, to a lesser extent, the type of credential earned. For 4-year completers, differences were observed by sex for each economic outcome (table 1). However, for 4-to 6-year completers, differences were only observed by sex for labor force participation. Of 4-to 6-year completers, a greater percentage of males (97 percent) than females (89 percent) participated in the labor force. Most of the differences by sex among 4-to 6year completers, however, were found among those who earned high school diplomas rather than alternative credentials. Among later completers, males were more likely than females to participate in the labor force, work more hours per week, and have lower rates of unemployment. These advantages are partially reflected in the significantly higher average wage rates and average annual earnings of male later completers over female later completers. Lastly, among noncompleters, all observed economic outcomes were more favorable for males than for females."}, {"section_title": "Conclusion", "text": "This Issue Brief highlights the associations between high school completion status, the timing of completion, the type of credential earned, and economic outcomes. The findings suggest that individuals who completed high school within 6 years generally had more favorable economic outcomes than their counterparts who completed high school later or not at all. Conversely, few differences in economic outcomes were found between high school diploma and alternative credential holders at both the 4-to 6-year and later completion points. Differences in economic outcomes, however, were most prominent between males and females. Even after controlling ! Interpret data with caution. Standard error is more than one-third as large as the estimate. 1 High school completion status includes individuals who earned a high school diploma or an alternative credential-specifically, a General Educational Development (GED) certificate or certificate of attendance-as well as those who did not attain a high school credential by 2000. 2 Full-time employment is defined as working at least 35 hours per week. 3 Average annual earnings are for 1999. All other economic outcome data are for 2000. 4 Includes individuals who had earned a high school diploma or alternative credential by August 1992. 5 Includes individuals who had earned a high school diploma or alternative credential between August 1992 and August 1994. 6 Includes individuals who had earned a high school diploma or alternative credential between August 1994 and August 2000. 3 The estimates in this Issue Brief were produced using F4PNLWT, the panel weight for the eighth-grade members of the NELS:88 base-year sample who participated in the first, second, third, and fourth NELS:88 follow-ups (conducted in 1990, 1992, 1994, and 2000, respectively). The unweighted sample size is approximately 11,730, and the weighted sample of roughly 2.8 million represents the number of spring 1988 eighth-graders who were alive in 2000. The sample used in this analysis is larger than that used in Hurst, Kelly, and Princiotta (2004) by roughly 900 cases, but there are no measurable differences in the percentage distributions across the analogous high school completion categories. 4 The incomes of self-employed individuals, who constitute 6 percent of the sample, are included in the analysis along with the earnings of those who work for someone else. Also, statistical outliers for average wage rate and average annual earnings are not included in the estimates. See Hadi (1992) for a discussion of the method used in this analysis to identify outlier values. The analysis only reports differences between groups for the economic outcomes examined and should not be viewed as indicating causal relationships. 5 Nearly all of the data for this analysis were derived from the third and fourth follow-ups of NELS:88, conducted between February and June 1994 and between January and August 2000, respectively. The one exception was high school completion dates, which were taken from the postsecondary transcript file. All of the economic outcome data were taken from the fourth follow-up, but average annual earnings refers to the 1999 calendar year in order to report on a full calendar year. 6 The types of high school credentials earned by 4-year completers are not examined because 96 percent of these individuals received high school diplomas. for the timing and type of high school credential earned, females generally had significantly higher rates of unemployment, lower rates of labor force participation, and, consequently, lower hourly wages and average annual earnings. The existing literature provides potential explanations for some of the results highlighted in this Issue Brief and draws attention to some of the limitations of the analysis. For instance, among individuals who completed high school, 4and 4-to 6-year completers were more likely than later completers to acquire additional education beyond high school, a factor that may have enhanced their relative economic advantage (Hurst, Kelly, and Princiotta 2004;Berktold, Geis, and Kaufman 1998). In addition, the types of occupations in which those with high school credentials are likely to be employed may also explain some of the economic differences detected in this study."}, {"section_title": "Endnotes", "text": "1 The analysis focused on students' eventual completion status. Therefore, it is possible for individuals to interrupt high school attendance yet complete at a later time, whether in 4 years or otherwise. The Issue Brief series presents information on education topics of current interest. All estimates shown are based on samples and are subject to sampling variability. All differences discussed are statistically significant at the .05 level as measured by two-tailed Student's t tests; this means a difference is discussed only if the probability that it is due to chance (i.e., sampling variability) is less than 1 in 20. In the design, conduct, and data processing of National Center for Education Statistics (NCES) surveys, efforts are made to minimize the effects of nonsampling error, such as item nonresponse, measurement error, data processing error, or other systematic error. For more information on the National Education Longitudinal Study of 1988 (NELS:88), visit http://www.nces.ed.gov/surveys/nels88.  "}]